//Level 700
//评分: 
//+11
//+
//–
//X
// 
//
//生存难度：
//等级 4E - 环境危害
//
//不安全
//不稳定
//中度非实体性危害Mandelbrot
//该图片为模拟曼德尔布罗特分形的图像，而并非Level 700的照片。
//
//Level 700 是后室的第701层。它似乎是一片能无限扩大的不规则分形小型群岛。
//
//描述:
//如上所述，Level 700是一个无限分形的小岛屿群，类似于曼德尔布罗特分形的形状。这些岛屿由光滑无缝、似乎被刷洗过一般的金属组成，乌黑发亮。在这些岛屿周围是一片咸水海洋，海水在不同紫色的阴影和天空中纯白的云朵之间移动。这些岛屿的气候非常炎热干燥，因此建议不断摄入杏仁水。
//
//该层级也会造成严重的心理影响，此外还有关于致幻、恶心、呕吐和头晕的报告。建议进入该层级的人员不要停留超过一个小时，因为高温会导致致命的中暑。由于海水的含盐量和温度都很高，所以在该层级内饮用海水也是不可取的。
//
//每个岛屿都有通往下一岛屿的台阶，重复着分形图案。当你走下这些台阶时，你的身体会随着相应岛屿的规模而放大或缩小。由于这种情况，从流浪者的角度来看，每个岛屿的大小都将与上一个相同。这种现象被认为是无限延伸的，与分形的几何图形模式保持一致。关于这个层级，我们知道的其他信息不多。
//
//来到该层级的情况并不常见，因为进入方式还没有被确定。
//
//该层级的存在在 ▇▇/▇▇/▇▇▇▇得到确认。M.E.G.探险家▇▇▇▇▇ 和他的三人小组在通过完全对称进入Level 700后联系了M.E.G.指挥部。他们没能活着出来，但当他们在那里的时候，收集并传回了关于这个层级的宝贵信息。我们向他们为档案馆做出的牺牲表示崇高的敬意。
//
//基地、前哨和社区:
//在该层级内没有前哨或社区，由于环境危害，导致推广居住被认为不可行。
//
//入口与出口:
//入口
//目前还没有发现统一的进入方法。报告称有一种方法是可以通过完全对称进入，但这是未经证实的。
//
//出口
//到目前为止，该层级没有已知的出口。
//
//关闭
//由▇▇▇▇▇备注:
//有一条出路，一定是作者忘记了【乐】。你必须喝水。
//可能仅仅是在你的舌头上滴几滴，但那热量会迫使你昏迷，并且——
//你会在一个随机的层级中醒来。我就在一个没有档案的层级中醒来了，所以我认为你会在Level 700-799之间的任何地方醒来，但这只是一个猜测。
//这些层级可能很危险，所以要小心。确保之后喝大量的杏仁水。
//
//祝你好运，旅行者。
//
//- 来自你在后室中非常活跃的朋友，▇▇▇▇▇
//
package lvls7x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl700{}