//Level 718
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//Level 718是后室的第719层。据Entity 440提供的信息，人类早在公元前539年巴比伦陷落之后就发现了这一层级，但在1984年3月22日又被我们重新发现。
//
//描述
//Level 718是一片看似无边无际的晴朗蓝天，其上漂浮着零星而遥远的白云。
//
//地面由某种能够完美反射出天空的液体材料组成，这是一层薄薄的清水状液体。这种液体无法从地面上清除，并且其具有一定厚度，任何方法都无法将其刺穿。这一层级的生物能够在这种液体上行走，因为它的表面张力似乎足以支撑任何重量。躺在这种液体上的感觉非常柔软，就跟躺在床上一样，只是更结实。但是，如果你站在这种液体上面，感觉又像是站在某种木头之上。
//
//Level 718的太阳永远不会落下，任何进入Level 718的人都会感觉到一种“活力恢复”和“精神振奋”。在Level 718，人们不需要睡眠，但在如果想在该层级休息或睡觉也很容易。
//
//Level 718的温度始终保持在21.1°C或70.0°F。在Level 718似乎总能闻到甜食的香味。其具体的味道因人而异，许多人都报告说闻到了“新鲜烤肉桂卷”的味道。
//
//该层级唯一的实体是实体440，许多进入Level 718的人将其称为“The Historian”。这个实体看起来像一个巨大的、约9英尺高的人形生物，其全身都散发着光芒，发光强度为1000流明，这就表明其不可能被拍摄或用肉眼观察。任何试图减少或过滤这种生物发出的光的尝试都是徒劳的。同样，摄像头在Level 718也会停止工作，只有离开该层级才能恢复正常。
//
//该层级上唯一的其他生物是沉默僧侣们，他们是一个非敌对的半宗教狂热团体，由自愿加入沉默僧侣的人组成，加入他们的方法为向他们提出请求或向实体440提出形而上学问题。他们会在整个Level 718内漫游，但他们大多数人倾向于呆在实体440附近。他们不允许与其他任何人交谈，他们似乎与实体440存在着某种心灵感应交流。除了实体440，他们也并未表现出与其他生物进行交流的意愿。
//
//任何未加入沉默僧侣的人不得在Level 718停留超过24小时，如果超过时间限制，就会收到立即离开的警告，然后会在7分钟后立即被传送至Level 717, Level 4, Level 0,或是Level 719。在超过该24小时的时间限制并被传送出该层级后，试图通过从Level 4的窗户外坠落再次进入Level 718的人将被传送到Level 719，试图通过Level 717的白雾进入Level 718的人将出现在Level 719。
//
//基地，前哨和社区
//沉默僧侣的修道院
//-隐藏
//后室内许多到达这一层级的旅行者都曾考虑过成为沉默僧侣的一份子。因为他们似乎从不需要食物或水，也不需要睡眠或任何形式的休息。众所周知，他们偶尔会玩不同的棋盘游戏、读书、画画或参加其他休闲活动。
//
//请注意，任何对沉默僧侣的攻击都是徒劳的，因为他们身上的伤在约18秒内就会被治愈和消除。这包括任何身体上的伤害，甚至是死亡。任何试图在该层级内伤害他人的人将会立即被驱逐出该层级，效果类似于超过该层级的24小时时限。
//
//这是Level 718唯一稳定的“前哨”。
//该社区内目前居住着63名僧侣。
//僧侣们永远不会出于任何原因对他人怀有敌意。
//对人体的影响
//增强定力和耐力
//无需睡眠或休息
//在Level 718时，人体似乎变得更具弹性，任何对身体的重击效果都会被削弱。想切割和刺穿人体也变得非常困难，需要相当大的力量。
//在Level 718进行的测试
//-隐藏
//对象: 笑魇
//
//步骤简介: 将捕获的笑魇投放入Level 718。进入层级后，该生物停止了所有试图挣脱束缚的行为。就在之前，该生物一直在敲击收容其的箱子和栏杆。在记录下结果之后。对象从Level 718被转移出。在转移之后，对象在三小时后开始表现出正常行为。现已消灭。
//
//结果：在Level 718时完全消失了攻击欲望
//
//-隐藏
//对象: 笑魇
//
//步骤简介: 对象被投入到Level 718，表现出与前一次测试中的对象相似的行为。之后研究人员离开，将对象留在了那里，在24.2小时之后。研究人员返回，对象消失，但用于囚禁其的笼子仍在那里。当研究人员询问实体440时，实体440表明其并未表现出任何威胁，只是因为其超出时间限制后便将其传送出了该层级。
//
//结果: 在Level 718时完全消失了攻击欲望，失去对象
//
//-隐藏
//步骤简介: SM-01（一名男性沉默僧侣）被要求与研究人员一起离开Level 718。没有回应。研究人员抓住SM-01的手，轻轻地拉了拉。没有回应，没有抵抗。研究人员开始拉着SM-01走到了Level 718的出口。没有回应，没有抵抗。当SM-01进入雾气周围15米半径的出口时，SM-01开始表现出抵抗。研究人员描述了当时他眼中的“恐惧”。他使劲拉回自己的手，试图逃出研究人员的手中，并在这么做时还伤到了手。SM-01痛苦地呜咽着。然后是一道巨大的闪光。拉着SM-01的研究人员和SM-01都不见了。第二天，当研究人员回到Level 718时，发现了SM-01，他相对于前一天靠得离实体440更近了。
//
//结果：不可能在不造成身体伤害的情况下转移出对象。对其造成伤害将导致实体440通过远程传送被逐出该层级。不建议进行进一步的试验。
//
//入口和出口
//入口
//通往Level 718的唯一入口是在Level 717穿过浓密的白雾，或者有小概率从Level 4的窗户外掉落进入。据实体440所说，也可以通过从美索不达米亚的不同地方切出进入Level 718。
//
//出口
//有三个已知的出口。第一种方法是进入距离实体440约一公里的浓雾当中，该出口通向Level 719。你也可以往回走，穿过进入该层级的白雾，回到Level 717。最后一个已知的出口是要求实体440将你发送到一个生存难度为0或宜居的层级。离开的人可以指定传送的层级，也可以被传送至一个随机的生存难度为0或宜居的后室层级。有时人们会被传送至后室的宜居子层级。一个常见的随机目的地是位于Sub-Level 9.1的深红森林。
package lvls7x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl718{}