//Level 777
// 
//
//生存难度：
// 
// 
// 
//The%20Lobby
//“大堂”的一隅
//
//The%20Slots
//“柴郡猫赌场”的一组老虎机
//
//disappearing_casino
//一座曾经被称为“东京扑克”的赌场。现已下落不明
//
//Level 777 是一条开有赌场的街道，赌注大都极端高昂。
//
//描述：
//Level 777是一条赌场林立的街道。街道本身长度颇短，仅有14公里长。建筑物从头到尾列满了整条街道的两边。这里没有小巷，并且任何尝试通过翻越建筑以前往另一侧的行为均以失败告终。所有建筑都能够进入，并且它们的内部面积都显著大于建筑表面的尺寸。
//
//当你初次进入Level 777，你将会发现你处于一间被标记为“大堂”的建筑内。大堂是这一层级规模最小的空间，尺寸与普通的大堂相当。只要没有欠下债务，你同样可以通过大堂离开该层级。大堂的建筑风格类似于一个装修华贵，带有休息区的入口通道。这一区域被认为是该层级的出入口，由类人型的实体担任这里的工作人员，他们会尽可能地为你提供帮助。
//
//当你离开大堂，来到街道时，你会发现许多家赌场环绕在你周围。每座赌场都赌注高昂，并且赌注还会随着赌场位置的深入水涨船高。这里有其他人类存在，然而，他们似乎如同空壳一般，不会进行除赌博外的任何行为。尽管如此，这些空壳仍然展现出了对赢下赌博的渴望与最基本的求生意志。赌场内的荷官西装革履，深谙赌博之道。
//
//很少有赌场能够稳定地存在于这一层级。有时在眨眼间就会有一座赌场突然消失。它会被一间新的赌场所取代。甚至位于建筑内的人类也是基于同样的情况。因此，进入一间没有被特别列出的赌场会是十分危险的行为。有时，这些赌场也许会重新归位，然而，里面已不存在有任何之前在这栋建筑内部人类的痕迹。那些消失的人均假定为已经死亡。
//
//每座赌场都拥有其独特的，扭曲现实的属性，这种属性能够体现在任何后室中的对象上。在这里，金钱几乎不作为筹码，人们更喜欢以身体部位、珍贵的记忆和他们生命的归属权来“提高赌注”。因此，Level 777在你想快速获得某件物品时十分有用。
//
//取决于你进入的赌场，不同的荷官能够让你投注不同的金额。大堂外围的赌场被认为是安全的，因为在那里一般以材料、食物与水作为赌注。这些大堂外的赌场拥有着最少的人流量，并且对物资交易兴致缺缺。然而，随着你越深入这条街道，就会发现有越多的赌场提高了赌注，从记忆到人体部位再到公开羞辱，甚至他人的生命，这些事物都是能被推上赌桌上的筹码。
//
//已知赌场
//...
//低端
//低端赌场是一些你在刚开始就能进入的赌场，与三巨头不同，这些赌场都档次颇低，并且没有自身独属的特色项目。
//
//扎西娅老虎机
//扎西娅老虎机是一座低风险赌场，这里的赌注永远不会大于食物与水。大多荷官都十分友善，并且他们都不会带着扑克脸与你对赌。因此，如果你拥有一定水平的赌博技巧，推荐你于此赌博以提升自身的资源储备。如果你频繁进出这间赌场，许多其他的赌场会开始鄙视你，甚至一些高端赌场会直接禁止你入内。扎西娅老虎机对所有拥有人权的人都保持开放。作为你很可能会进入的第一间赌场，扎西娅老虎机并没有自己的特色项目。
//
//柴郡猫赌场
//柴郡猫赌场是一座水准接近中端的赌场，仅对确认拥有一定赌博技巧的玩家开放。由于在这里消息传的很快，所以只要在任意低级别赌场拥有良好的胜负比就会让你拥有进入柴郡猫赌场的资格。这里依然以资源作为赌注，因此这又是一间安全的赌场。该赌场以老虎机为主，不过这里同样拥有扑克和轮盘游戏。该赌场没有自己的特色项目。
//
//中端
//中端赌场拥有更高等级的赌注，是所有赌场中变数最多的一些。这些赌场全部对熟练度有所需求，并且有自己的入内条件。它们全部拥有自己的特色项目。
//
//疯狂经典
//疯狂经典是一座受到高度评价的赌场，并且。它是第一间你能进入的赌注在资源之上的赌场之一。你在这里所能押注的最高筹码是你身体的一小部分。例如一块脂肪或一片指甲。为了进入该赌场，你必须在赌桌上赢过柴郡猫赌场的每一位庄家。疯狂经典主营21点且没有其他游戏经营，疯狂21点他们的特色项目。
//
//疯狂21点是21点的魔改版本，规则与传统21点十分相近。然而，疯狂21点加入了几条为确保保密性而设立的新规则。例如，你的手牌会与对手互换，这意味着如果总计点数21点的手牌在你手中，你将很可能会输掉这场对局。这一游戏的胜负围绕着通过虚张声势，以让你的对手相信他的手牌是糟糕的为目的获取胜利。你只能够知道你总手牌中一张手牌的点数，这让你的每次出牌都伴随着风险。
//
//每当你“出牌”时，你的对手即会获得一张手牌，把点数累加到你的总分上。这张牌将保持作为暗牌且只有你的对手能知道它具体的点数。当手牌成功被组建时，投注阶段便会开始。投注阶段包括加注、弃牌与跟注，这点与传统规则相同。如果要参与游戏，你必须根据荷官的空余时间进行提前预约。
//
//这场游戏将会分三轮进行。最多可以让四名玩家参与，但场外串通是规则所禁止的。不论是谁，只要赢一整轮便就可以获得对家们的全部赌注。当下注被发起时，它将被认知为赌约“成立”，这意味着其已不可逆转。
//
//梅林的胡子
//梅林的胡子是中端档次中段位最高的赌场。这里最高能以人体部位或实体的一部分作为赌注。通常，你拥有一年的期限收集作为赌注的实体部位，如果你没能在规定时间内捕获该实体即会被视为违约，你将为该赌场服劳役。
//在梅林的劳役通常而言是宽松的，大多是做一些标准的杂活，例如烹饪与清洁。沦为劳役后，你将无法离开 Level 777。
//为了获得进入资格，你必须在赌局中击败一位位于门口的荷官。有三位不同的荷官以供挑战，且挑战内容均为扑克游戏。如果你输掉对局，你必须等到三个月后才能发起下一次挑战。梅林的胡子主营扑克游戏，以规则野蛮无道著称。他们提供的唯一另外一种游戏即为他们的特色项目，塔罗扑克。
//
//塔罗扑克是扑克游戏的修改版本，游戏使用三张而非五张卡牌为一组进行游玩。这些卡牌的分数等同于各自所代表的数字，并且在两边玩家同时叫猪(1)时卡片价值高的一方获胜。塔罗扑克中有三手主要的组牌，这些组牌通常不论在大牌和小牌中都拥有更高的价值权重。
//
//2连： 想凑齐这种组牌相当容易，只需要持有两张分值相邻的卡牌即可。
//3连：要凑齐这种组牌相对困难，需要由三张分值连续的卡牌组成。
//愚者诅咒：这一组牌由愚者卡与任意卡牌组成。它的分值高于三连。
//有数套组牌作为“特殊组合”存在。这些组合拥有相同的价值，并且能够被凑齐的情况极其罕见。有许多能组成这一组合的情况，其中的五种位列如下：
//
//地狱：包含倒吊人、死亡与恶魔的组牌
//宇宙：包含太阳、月亮与星星的组牌。
//皇家大殿：包含国王、王后与女祭司的组牌
//死亡之塔：包含塔与死亡的组牌。
//世界：包含世界的组牌。
//塔罗扑克可进行1轮，5轮或22轮。由荷官自由决定。弃牌、加注与跟注和传统规则一致。参与游戏所需要支付的筹码同样取决于荷官的意愿。
//
//三巨头
//三巨头是Level 777中最危险的几座赌场。它们全部押注极端高昂的筹码，并且每一位荷官都是各自领域的大师。这些赌场对所有人开放，但请注意，它们将对你不留情面。
//
//error 101_DELETE
//error 101_DELETE是一座高端赌场，并且是三巨头中水准最低的一间。它声名远扬且遵从三巨头的规则开放给所有人。这座赌场因其独特的“故障赌注”广负盛名。如果你选择以此押注，你将承担生命危险，因为在输掉赌局时，你将转变为一只故障。这间赌场提供许多不同的特色项目，而它主营的特色项目，是被称为故障轮盘的游戏。
//
//error 101_DELETE已知会发生频繁的故障，在这间赌场中，地板可能会突然发生迁移，你甚至有可能会因此直接切出到一个随机的楼层。整个赌场散发着耀眼的蓝色光芒，装修风格是带有黑色的流行元素。同样，这里的荷官也时常会发生“故障”，这使得要对其定性十分困难。error 101_DELETE的CEO是莫甘娜理事会中的一员。
//
//故障轮盘是一个十分复杂的游戏，只有发明游戏的CEO自身彻底了解规则。游戏使用着一个大约有40处修改的轮盘赌桌，这些魔改只有六处通过推理得到了确定
//
//故障的数字：有些计分板上的数字在赌球滚动的期间自始至终不断发生着故障。
//故障的颜色：赌球落位的颜色格是凭运气完全随机的。
//球体加重：球体的质量随游戏进行会以一种未知的方式进行着增减。
//“急刹”：没有任何征兆，轮盘会突然故障并停止转动，把赌球停止在它相应的轨迹。
//反重力空翻：整个桌子上下反转，这会让赌球改变滚动的方向。
//rorer_stop_EXECUTE：在任何时候，一场游戏都可能会随着代码“rorer_stop_EXECUTE”显示突然结束。这种拉闸似乎并没有呈现对任何玩家有利的倾向，这使整个游戏的结果变得更加随机。
//一些其他的魔改包括：
//
//赌桌突然消失
//赌球突然消失
//荷官突然消失
//违背你意愿，对下注额度的突然改变。
//桌子下面的地板发生塌陷。
//除这些修改以外，整个游戏玩法与普通的轮盘赌无异，并且这一游戏大多以荷官的胜利告终。
//
//名门对决!
//名门对决!是一座十分特别的高注赌场。他们最典型的赌注是永世不得翻身的公开羞辱和对非必要肢体的切除。许多来自Level 777“有名望”的人都在这间赌场赌博，有成群的赌徒作为他们的拥趸。这间赌场的CEO，Stretch Zimals是Level 777一位备受尊崇的人物，同时也是莫甘娜理事会的一员。整个赌场的游戏输赢变幻莫测，并在某种程度上与演技挂钩。因此，整个赌场的游戏都被认为是他们的特色项目。而最受名门青睐的项目叫做桃心扑克!
//
//桃心扑克!是规则与传统扑克类似，共持续三轮的扑克游戏。然而与传统规则使用筹码来进行赌局不同，这个游戏将以人作为赌注。在游戏中，你可以用那些被你拥有人权的人类作为筹码下注。这种游戏被权贵用以易换权利，并通过轻贱这些他们手底下的人命以此为乐。在游戏开始前，所有玩家都需要呈交一分“评估报告”，格式包括：
//
//体格
//外貌
//长相
//技能
//才艺
//“筹码”们评估来的分数会按0-100的分值在表格上相应排布。游戏除桃心卡比普通卡拥有更高权重外与传统规则无异。这意味着在高牌中，红桃将比其他花色的扑克拥有更高的价值。在叫猪的情况下，拥有最多红桃扑克的玩家获胜。
//
//莫甘娜赌场
//莫甘娜赌场被认为是拥有最强对现实扭曲能力的赌场，这里的荷官们实力强悍，且拥有对所有已知赌博项目的相关知识。甚至对于那些由玩家当场创造规则的赌博游戏都能有所了解。这座赌场谜团重重，许多秘密都尚待发掘。就连是否有可能击败某些该赌场内的玩家都仍无可知，如理事长。莫甘娜赌场从来不接受低风险的赌注，最少你也要赌上你生命中最珍贵的记忆亦或是你的性命本身。你几乎可以在这间赌场赢得任意种类的资源，并且赌场还能够支持进行对许多强大力量的积蓄召唤。莫甘娜理事位于这座赌场之中。他们由Level 777中最强大的7位实体组成。严格来说这一赌场并没有自己的特色项目，但他们的确拥有一项叫做命定之抛的独特硬币游戏。
//
//命定之抛是一项纯粹依靠运气的硬币游戏。当游戏开始时所有会影响游戏结果的其他外力都将被消除。荷官将翻转一枚两面花色不同的硬币，硬币有绝对为50%的概率落在正与反的任意一面。要说明的是：
//
//抛出硬币的位置对游戏结果没有影响
//风阻对游戏结果没有影响
//地心引力对游戏结果没有影响
//任何其他的外力对游戏结果都没有影响
//鉴于其固定在50%的正反概率，使得其几乎成为有史以来最公平的游戏。这个游戏唯一可以作为筹码的赌注是你的生命。输掉的一方会被直接处决。
//
//命定之抛以其公平性著称，因此每一位莫甘娜理事会的成员都必须至少在该游戏中取胜一次。莫甘娜理事会还有两件主要的已知事实。塔罗与和其相邻的塔罗室的进入点全部来自这一赌场。另一件已知事实是这间赌场里存在通往Level 777.1，赌博迷宫的入口。
//
//莫甘娜理事会
//莫甘娜理事会由七位十分强大的实体成立，他们拥有根据意愿扭曲现实的能力。这七位成员在这一层级被所有居民尊崇重视，他们性格各异，变化多端。成员名单如下：
//
//...
//Ria MAX：职位；理事会秘书。这位成员外表类似赛博朋克哥特风格，佢主要经营这一层级的扑克项目。莫甘娜理事会与error 101_DELETE是这位秘书的主要出没地段。佢在性格上对人有着极强的操纵欲且乐于接受挑战。此外，佢拥有小幅度操控现实的能力，这让佢相较一般的对手而言更加难以击败。然而，佢实际上是理事会成员中扭曲现实能力最弱的一员，由于这点，并不推荐让此成员去负责一些十分重要的赌局。Ria Max最爱的游戏是记忆俄罗斯轮盘。因此，佢对自己过去的记忆知之甚少，并以“活在当下”作为自己的座右铭。
//记忆俄罗斯轮盘是Ria发明的一种特殊游戏。此为佢的招牌项目，这意味其在这一游戏中经验老到。游戏与常规的俄罗斯轮盘赌法类似，然而，水枪取代了枪支被用以进行游戏。游戏用到的水枪被一种与记忆蠕虫无关的未知液体所灌满。这种液体呈现出类似彩虹万花筒的纹样变化，并且如若长时间对其注视将会迷失其中。每位玩家都有6/1的概率被这把枪所射中。当水弹击中你的头部，它会渗入你的大脑之中并且定位你最珍贵的记忆，当定位完成，你的那部分记忆将被彻底剥夺，永远从你的大脑中移除。之后，你将被冠以最珍贵的记忆被剥夺的认知，这会带来深刻的羞辱与抑郁。
//
//Stretch Zimals：职位； 首席公关。Level 777一位家喻户晓的人物，他是这一层级最富声望的名人，其名气主要来源于他担任着名门对决!中CEO的职位。他是一个演员、动作巨星，同时也是自己的特技替身。这位成员对许多形式的赌博都抱有浓厚的兴趣，不过，他最喜欢的特色项目还是叫做笔友豪华版!的游戏。相对强大的现实扭曲力让这位成员在莫甘娜赌场和名门对决!的项目中占尽优势。他是一位强大的赌徒，绝不该在没有准备的情况下轻易对其发起挑战。他是整个理事会中唯一展现出同理心这一特质的成员，尽管只显露出相当少的部分，Stretch最爱轮盘类的游戏，所以他也经常拜访error 101_DELETE游玩故障轮盘。
//笔友豪华版!是一种十分独特的轮盘游戏，与故障轮盘玩法类似，但他们的主题却大不相同。笔友豪华版是一个团队游戏，需要凑齐四名玩家游玩。游戏将持续三轮，且每轮的滚球都有其独特的行动方式。赌局需要下注高昂的筹码，不过这并不意味着你将以记忆或性命作为赌注。在这场游戏，你需要赌上的是自己与他人的关系，这是这个游戏最令人费解的一点。如果你的团队在豪华笔友!中落败，你会当即失去今生与其他人建立的全部联系。尽管这并不意味着你将无法再与他们产生交集，但是你们彼此之间的追忆将被全部清空。Stretch Zimals仍未在这一游戏有过落败。
//
//Cici: 职位；理事会财务官。Cici是故障的一种特殊变体，已知经常于error 101_DELETE进行赌博。并非完全被转化为一只故障，Cici的畸变程序只进行了一半。这一错误使佢获得无比强大的力量，成为了一只一半故障一半人类的混种生物。自出生以来，佢的地位节节高升，并很快成为了理事会中最受尊敬的人物之一。佢拥有能与监督者相媲美的权能，扭曲现实的能力被认为是理事长之下的第一强者。佢的特色项目是Poker_GLITCH_executeprogramDELETE，但这并不影响其对任何赌博项目都十分精通。佢看似善良且慈悲为怀，然而，这可能不过是表面的虚与委蛇。
//Poker_GLITCH_executeprogramDELETE是扑克游戏的魔改版本，只能由包括Cici在内的两名玩家进行游玩。游戏的输家将被完全转化为一只故障，不过Cici自身却不受影响。游戏规则与普通的扑克相近，然而，和故障轮盘一样，整场游戏有许多独特的故障撼动着游戏的结果，已知的故障包括：
//
//卡牌突然从你的手中消失——在很多时候都会发生这种情况，如果这一情况于抽牌阶段发生，卡牌会在之后重新返还你的手中。不过，如果一张卡牌在下注阶段消失的话，这张卡牌就会被视为弃置。出注将在这一情况发生时变得不可实现，所以请务必当心。
//筹码突然消失或重新出现——这种情况同样在赌博中时常发生，这使得下注的额度变得完全随机。如果你所有的筹码全部消失，你的对手将处于严重的劣势之中，这是由于在同一赌注下，你下注的额度变得相当之少，而对手却依然只能保持原有的高注。
//卡牌的价值突然变化——在任何时候，任何卡，不论在你的手牌里或是牌桌之上，都可能会转变为不同的价值。这些突变大多都会变为另一张传统规则体系下的扑克，然而，也有一张论外的特殊卡牌会通过这一故障加入游戏——野性被认为是一张好牌，它可以同时代表游戏中所有卡牌的价值。这张牌的出现是对整个游戏影响最大的部分。
//新的卡牌突然出现在你的手牌中——这一情况仅仅在下注阶段发生。这会使得出注变得更加频繁，并且通常来说会增加你的胜率。
//荷官有5%的几率突然将游戏叫停，尽管无法完全确定，但仍暂且将这种情况视作是游戏故障对其造成的影响。
//
//建议不惜一切代价避免参与这一游戏。虽然荷官通常而言仅以赌场的利益为准公平游玩，没有明显的偏袒迹象。但有必要明确的是，Cici即使输掉对局也不会遭受任何损失，这意味着佢能够肆意地根据情况投入更高风险的高低注而不需承担任何代价。
//
//Mariano：职位；理事会“清洁工”——Level 777已知信息甚少的一员存在，Mariano是一条狗。它凭借在赌博中赢取胜利挣得了如今的地位。它的主要职责是清理理事会管辖下的错误行为以及稳固公司在这一层级的至高地位。它同样是一位强大的赌徒，怠慢地与其对赌是不应当的。由于Mariano是一条狗，这让它很难游玩大部分的赌博项目，这也是为什么它会将色彩混乱!作为自己的特色项目的原因。不论在赌局内外，这条狗对现实都拥有着令人难以置信的操控力，并且它常以暴力手段执行命令。
//颜色混乱是一个简单但具有挑战性的游戏。这个游戏的要领十分简明，只要从九种可选的颜色中挑选一种，与荷官的所持有的色彩进行配对即可。颜色一共有九种外加一张额外的黑卡。如果荷官选中了任意一种你所选择的颜色，游戏将会结束，并且基于选择的颜色正确与否来决定这场游戏的胜者。如果没有玩家选中正确的颜色，新一轮的游戏将会开始，如此反复直到有一方选中正确的颜色为止。并且，当黑卡被选中时，会直接结束游戏并判定为荷官胜利。这个游戏有很大的运气成分，这也是为什么Mariano明明身为色盲却还能将它作为其招牌项目的原因。每轮游戏选抽一张牌后都会重新洗牌，以保证整个游戏的公平进行。
//
//Bry Nimolire：职位；理事会监事。Bry的已知信息寥寥无几，我们能够知道的是，她是整个理事会中最没有可能接受挑战的成员。她在理事会的主要职责是为名门之间进行的赌局提供监察。她被广泛认为是理事会中最受信赖且态度最为中立的女成员。Bry是一位赌桌上的塔罗牌大师，她的特色项目比起赌博游戏更倾向于一种占卜预测，名叫死或生。Bry是一位狡猾的赌徒，从不畏惧从他人手中“夺得胜果”(2)。
//死或生类似于经典的塔罗占卜。尽管如此，Bry声称占卜的结果是完全随机的。这一占卜仪式只能由高等奥数驱动，并多由Bry全权操办。这一游戏的奇异元素在于，它所占卜出的所有预测不论结果如何都会成真。举个例子，你抽到了愚者与恋人的常见组合。如果结果准确无误，你将最终陷入一场纯洁无瑕的爱情之中。警告，这一事实将不可逆转并且对你的人生轨迹产生改变。它是不可避免的，自我了断是唯一的替代方案，并且只在部分情况下能改变结局。
//
//副理事长：职位；理事长的直系助理。这一存在的名讳已被抹削，它们通常而言近似于一种无法被认知的精神灵体。因此对副理事在文档中进行直接描述是不可能的。副理事长没有自己的特色项目，不过它们是唯一能够为命定之抛进行授权的人员。
//理事长：理事长是理事会最神秘的一号人物。他们/它/佢们目前所有信息未知，并且他们/它/佢们能化形为任何形态存在。不过，现已有四个可能是理事长化身的潜在人选被确定，每一位嫌疑人彼此都大不相同。
//碾压者：职位；前任理事会“清洁工”。这一成员曾经是理事会的清洁工，但由于某些出自外部情况的原因，现已被判定为无用并被认为已经死亡。这位前成员是一只“半碾压者”。这类实体拥有修长的腿部，行为与 碾压者类似，拥有与人类接近的健全智能。
//理事长（们）
//目前对可能是理事长们化身的四个身份的拟议已位列于下。请记住，理事长（们）并没有自己的形态特征，这也是没有关于他们/它/佢们的相关特征记录在案的原因。理事长（们）是至高级别的赌徒，且在赌战还未有输过一次。理事长（们）可能是复数实体或单只实体。也有可能根本就不存在。
//
//...
//拟议1：双面身份
//CIci是理事会的前财务官在化为故障的转变中半程错误孕育出的未知实体。由于在转化过程中消耗了太过庞大的力量，Cici被削弱为类似于柴郡猫(3)的形态。即使处于这种状态的佢，对莫甘娜赌场仍然拥有着至高级别的掌控力，甚至能够根据自身的意愿随意扭曲现实，绝对不能让财务官Cici知悉自身拥有此等级别的权能。
//
//在这种类似柴郡猫的状态下，Cici的力量受到了极大的限制。然而即使被施以如此削弱，佢在赌博上也几乎不可战胜。如果Cici积蓄足够的力量到足以能够冲破束缚佢的这层桎梏，佢将能够拥有掌控整个后室的能力，甚至将能够前往前厅。然而，这种柴郡猫状态的束缚十分稳固，加上佢几乎不可能有机会成为一个完全的人类。这两点使得这一隐患几乎没有可能发生。推测年龄：117岁
//
//拟议2：纯粹的女赌徒
//默默无闻并不影响这位无名之辈是一个当之无愧的赌博大师。她曾是一位普通的流浪者，在误入Level 777后，她的地位迅速攀升，并在一场赌局中击败了前任的理事长。自此，她的力量进一步获得了增长，逐步积蓄成至高的权能，如今，她已被认为是后室中最有影响力的人物之一。
//
//她主要的目标是完全摧毁后室，她坚信如果将后室摧毁，自己便能重返前室的家园。目前，她的计划进展顺利。
//
//她对现实有令人难以置信的操控力，只要她想，便能轻易终结他人的生命。虽然她的身体十分脆弱，但她善于在赌博中运用自己的优势。她通过自己强大的现实扭曲力创造了DATA EXPUNGED BY THE M.E.G.来保护自己。她同样是一位至高级别的赌徒，并且很少接受挑战，鉴于她认为“对杂碎动手无用”。推测年龄：24岁
//
//拟议3：双刃剑
//Koni和Neko是一对在Level 777积累了强大力量的双胞胎。他们俩都是大师级的赌徒，并且每一位都不可战胜。他们的相貌打扮趋近相同，因此他们的外表几乎没有区别。这对双胞胎来历不明，并且很少透露他们的个人细节。然而，可知的是他们全都拥有对人类生命的病态渴求，他们乐于通过在赌局赢过对方来占有他人的灵魂。他们拥有能够提取他人灵魂的能力，并通常通过亵辱这些灵魂来取乐消遣。
//
//Koni和Neko拥有彼此同步的能力，他们能够互相心灵感应，这使他们在组队游玩的赌博游戏中更占优势，因为他们能够在场外串通还不必承担被对手察觉的风险。除此之外，他们还都是赌博战略的大师，他们能够轻易地识别对手是否出千。由于无法察觉双胞胎彼此是否在使用心灵感应，因此，这一能力在赌局中会显得十分棘手。
//
//Koni和Neko都在性质上反映出动物的某一特征，分别代表猫与狗。然而，他们的象征经常彼此互换，这进一步促成了他们时常替换身份的特征。推测年龄：12岁
//
//拟议4：Ally的筹码币
//Ally的筹码币是一个蕴含高浓度灵气的物品，这一物品被认为是理事长的化身。这片筹码代表一个单独的赌注，且价值可以与任意事物对等。只要事物的价值可以被衡量即可。例如，将赌注设置为“你的生命”会将所有其他赌局中赌徒的生命共同作为赌注被设定。这是一片受人尊敬的筹码，需要理事会成员的许可才能够投入使用。每当它在一场赌博中被使用，它的力量和效能都会受到强化。推测年龄：未知
//
//Ally馈予我们这件神迹，我们应该对祂心怀感激。
//
//基地、前哨和社区：
//赌徒
//一个由150-200名痴迷于赌博的流浪者所组成的组织。其中的一些赌徒活动在低段位的赌场中，有些则等级更高，但他们无一例外热衷于赌博。他们几乎不离开这一层级，并且其中的一些人员已沦为该层级的劳役。
//
//M.E.G.前哨
//一个建设在中心地带的MEG前哨站。它的规模很小，主要为新来到此层级的流浪者们提供警告，帮助他们了解在这里赌博可能会引发的后果。此外，他们也观察记录着这些赌博进行期间的各项细节。
//
//入口与出口：
//入口
//Level 777十分独特，这是因为你无法通过入口进入该层级。只有那些富有赌性的流浪者才能找到进入Level 777的方法。此外，只有一个其他的进入方式被找到，并且通过它进入层级的条件十分苛刻：当你来到Level 98，你可以找到一个独眼，戴单边眼罩的男人，他戴眼罩的那边眼眶偶尔会有一条触手探出。如果你向该男人发起赌博，他将会接受邀请。男人的赌技只略逊于莫甘娜理事会的成员，所以请注意，不要轻易对其发起挑战。如果你获得胜利，你将直接被传送到莫甘娜赌场的外围。如果你输掉对局，他只会单纯地问你要不要再玩一把。他的赌注设的很低，永远不会大于一瓶杏仁水。如果你决定先不再挑战，你可以于任何时间返往此地继续对其发起赌博。
//
//出口
//有许多离开Level 777的方法，不过最简单的还是直接通过大堂离开。这会将你传送到枢纽或Level 0。某些中端赌场会在你获胜的情况下将你传送到具体的层级。如果通过在三巨头赌场中赌博中获胜离开Level 777，他们会将你传送到Level 4。未经允许进入塔罗室可能会导致你被传送到Level 6，不过这种情况发生的概率仅有20%。有时，没有任何征兆，故障轮盘在游玩时会发生故障，将你传送到一个随机的层级。这一情况同样会发生在Poker_GLITCH_executeprogramDELETE。当玩笔友豪华版!时，如果你与他人的联系因为输掉游戏被断开，你会被传送到随机一个量子稳定的层级。
//
//作者信息
//
//« Level 776 | Level 777 | Level 778 »
//
//Footnotes
//1. 译注：叫猪： 在扑克游戏中有一种将奖池分为高低牌两份的玩法。手牌最好（如当你拥有同花顺）的玩家将赢得高牌那一池的奖金，点数相加最小的玩家则赢得低牌的一池。当你的牌组同时吻合高低两牌的胜利条件时，你可以选择叫猪来同时赢下两池的奖金。
//2. 译注：原文为"take the scalp of another" ，割掉对手的头皮，是意为赢过对方的俚语。
//3. 译注：《爱丽丝梦游仙境》中的魔法生物，没有身体且能化为无形。
package lvls7x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl777{}