//Level 789
// 
//
//生存难度：
//
//等级 Ψ
//
//不安全
//不稳定
//精神危害
//gallery.png
//拍摄自Level 789中半稳定房间的照片
//
//Level 789 是后室的第790层。刚开始时，它表现为一座数学艺术博物馆，随着层级的深入，不稳定的属性越发明显。
//
//描述
//Level 789表现为一个专门展出数学作品的现代艺术博物馆。这些作品包括复杂的几何多面体模型，分形艺术，数学光学错觉，艺术曲线，平面对称演示，以及各种其他数学常数的描绘，如黄金比例。其中一些作品以三维模型的形式存在，这些模型要么放在桌子上，要么装在玻璃盒中以供观看。二维作品可以看作是挂在墙上，绣在地毯上，甚至构成了房间的整个墙壁、天花板和地板的图片。
//
//某些艺术作品是使用非常特殊的材料创作的，包括纸张，木材，绳索，电线和珠子。这些作品的大小从几英寸到几米不等，许多作品需要自己的房间，还有一些是跨越多个房间的整个数字展览。
//
//除了这些艺术品之外，还观察到几个奇怪的物体漂浮在各个房间周围。这些对象在视觉上与存在于 3 维空间中的 4 维物体的描述相匹配。由于这些性质，这些物体可以穿过固体物质，缩小和增大尺寸，甚至消失并重新出现在不同的位置。这些高维物体还会发出特定的无线电频率，这些频率已被检测到与数学常数（如pi或2的平方根）的数字相匹配。1
//
//corruptedhalls.png
//一个极其不稳定的走廊实例。相机在拍摄此片区域时质量发生了减小。
//
//该层级的大部分在空间、物理和数学的标准性质下运行，但某些区域比其他区域更“不稳定”。这些区域被称为“数学错误空间”，被认为是数学基本定律（例如交换定律，结合定律和分配定律）发生错误或偏差的结果。关于这些区域的信息知之甚少，因为记录它们的风险极大；在其中一个区域中停留大量时间将导致身体与心理上令人难以置信的恶化影响。
//
//
//
//
//
//实体
//实体虽然存在，但是在Level 789很少见。 这些实体中的大多数是更常见的实体的奇怪变体，有许多例子，包括看起来像长有多只环绕着大量牙齿的眼睛的笑魇，带有相互黏着或融合的附属物的肢团，和记忆蠕虫的变体。2
//
//日志和注释还表明，一个有生命的实体偶尔会向层级内的人展现自己。这个实体的名字被发现是“Telatrix”，它试图通过各种方法操纵它遇到的人。究竟发生了什么是未知的，但那些从它手中返回的人经历了巨大的身心变化。3
//
//基地，前哨站与社区
//Level 789没有已知的基地或前哨，由于层级的异常性质，建立长期基地几乎不可能。
//
//入口与出口
//入口
//已知的通往Level 789的入口包括Level 4，Level 12，Level -1, 和后室地铁。层级中的各种笔记与其他证据也指向了Level 256和Level √2，然而这些入口仍未被确认。
//
//出口
//层级内不同区域的出口通向不同的层级。撕开大型纸质结构有可能达到Level 440或Level 137。特定的数字展览可以通往Level 522或Level 25。在 MIS 区域中切出是有风险的，但有可能达到Level √2或Level -0。
//
//Footnotes
//1. 当以赫兹为单位时。
//2. 这种记忆蠕虫仅在MIS区域内活动，令观测变得极为困难。
//3. 见探险日志“Pacioli”。
//4. 译注：原文为“Hit me”，按俚语翻译。
//5. 译注：原文为the fuck
//6. 译注：原文为Au contraire, mon ami，法语
//日志开始
//探险日志“Pacioli”
//以下文字记录（在其文件中称为“Pacioli”）是从Level 9的录像设备和一些视频记录中被发现的，显示了对Level 789的探索。探险的目的不明，在场的仅有人员被标记为003，006，007和009。有关他们真实身份和与他们合作的群体（如果有的话）的信息很少。
//
//007: 好了，所有人都在吗？
//
//003: 6号和9号还在赶来，我猜，他们忙着看珠子房间里的东西了。
//
//007: 明白。让他们知道，当他们在——
//
//006: 妈的！
//
//007: ……这里。
//
//009: 我们在，我们在，只是——
//
//006: 那儿有很多酷炫的玩意儿！你真应该看看！
//
//003: 好吧，我们看过了，但那不是我们来这儿的目的。
//
//006: 我知道，我知道，只是……它们太漂亮了。
//
//009: 没错。现在，有什么新消息吗？
//
//007: [清了清嗓子]好吧，Homestead没回来，但我们越来越近了。不稳定的峰值应该刚好经过这个房间—要是已经有人来过这里的话。在我们所有人都到之前不要擅自深入。
//
//003: 另外，记住：这是一个开端，保持警惕并为了任何事做好准备。
//
//006: 对。现在，有人反对分开行动吗？
//
//007: 如果我们成对探索，可以更快地覆盖更多的区域。九号，你跟我一起吧？
//
//009: 当然。三号和六号，你们一起吧。
//
//003: 我没问题。
//
//006: 我会留个心眼儿的，长官。
//
//003: 没错，就像我马上就要让你做的一样。[微笑]
//
//007: 好了，我们继续前进吧。 [他和九号探索一个走廊，三号和六号跟在后面]
//
//[七号和九号在走廊尽头转弯，六号和三号继续向前。两人进入了一个看起来像是故障艺术展览的地方。]
//
//003: 哇，这太牛逼了。
//
//006: 无论它是什么，我无法理解数学的部分。
//
//003: 实际上，毛刺艺术展示了现代数学的几个特性。例如，很多——
//
//006: 动动脑子，我不想知道。
//
//digital.png
//003和006。摄影师不详。
//
//[他们俩都继续往前走，进入一个房间，墙上有一个移动的图案。地形以闪烁的静态纹理呈现。]
//
//006: 看着墙壁有点眼睛疼。
//
//003: 那就……别看？
//
//006: 好主意。我应该早点想到的。
//
//003: [笑了笑，徘徊在另一个房间。]挺滑稽的，不是吗？即使在这种地方，仍然有很多前厅娱乐活动可供回顾。
//
//006: [跟着]当你找到一个酒吧层级时，告诉我，我可以在这之后去喝一杯。
//
//003: 如果我们毫发无损地离开这里，我会为你找个酒吧。
//
//006: 如果我们成功了，我会开那个该死的酒吧。
//
//003: [停了一会儿，叹了口气]是的……这就是我们要做的。我们会离开这里，在某个地方开一家酒吧。这肯定会引起一些注意，对吧？
//
//006: 基地那帮人呢？
//
//003: 去他妈的！他们所做的只是把我们扔进死亡陷阱，希望我们能拿出一些有用的东西。为什么我们不能摆脱这一切，开始一些真正有价值的事情呢？
//
//006: 好吧……我确实想开一个酒吧。
//
//003: 所以它已经被准备好了！“36”这个名字怎么样？
//
//006: [笑了一下]当然，当然。
//
//009: 我们已经走了很长一段时间了，我们到底要去哪里？
//
//007: 去这条走廊的尽头的无论什么东西。
//
//009: 我们至少需要休息一下，我需要问你一些事情。
//
//[两人停了下来]
//
//007: 问吧。4
//
//009: 如果你这么恨我，为什么决定和我组队？
//
//007: 我什么时候说过我恨你？
//
//009: 你不需要，我看得出来。你一直很生气，因为我是九岁号，而你只有七号。
//
//007: 然而，你从来没有表现得像一个九号，对吧？我必须成为那个把其他人从危险中救出来的人。你知道，一些领导不会受到伤害。
//
//009: 哦，是的，是的，但你直到现在才抱怨过。你喜欢这种优越感，不是吗？尝尝本来可以是什么。
//
//007: 仔细斟酌你的下一句话。
//
//009: 也许如果他们早点杀了她，那么——
//
//[他们两人似乎缠斗了一会儿，九号咕噜咕噜地嘟囔着，因为七号把她推到墙上。]
//
//007: 别用你那他妈的嘴提我的母亲！
//
//009: [她笑着，挣扎着说话]知道了，混蛋。
//
//[七号放手，九号倒在地上，咳嗽着。七号沿着走廊走了一会。]
//
//009: 你总是一个嫉妒的混蛋！
//
//[七号继续沿着大厅走，让九号喘口气。录音设备调到了一个特定的频率，七号似乎没有注意到。]
//
//007: 我希望无论他妈的谁在听这个，都知道我这样做是有原因的。不要拖后腿，基地，你这样做是为了m——
//
//[七号被刮石声打断。]
//
//007: 什么鬼……？
//
//him
//Telatrix的第一个形态
//
//[视频录制显示了七号对其做出反应的彩条。]
//
//007: 妈的天啊！
//
//[不明人声起初听起来失真，但慢慢地变得清晰。]
//
//Telatrix: 你好，七号。你遇到了点困难，不是吗？
//
//007: 别靠近！
//
//Telatrix: 哦，我可不敢侵犯你的个人空间。
//
//007: 告诉我你是……你到底是什么？
//
//Telatrix: [笑着继续说]已经忘了？他们在基地里教你的傻逼东西？5
//
//[沉默]
//
//Telatrix: 没关系，你一直是个白痴。
//
//007: 你对我一无所知。
//
//Telatrix: 正好相反，朋友6；我可很了解你。
//
//hesheretoseeyou.png
//Telatrix变化后的视觉效果
//
//[这个人像变成了一个更像人形的形态，并且更接近七号。]
//
//Telatrix: 我知道你出生于1月2日，2001年，下午14：23。我知道你的母亲在十一天后被那些最终抚养你长大的人杀死了。我知道你几乎对你见过的每个人隐藏了你自己的每一个部分，我知道这有多痛苦。 [伸出手]
//
//007: [握手之前犹豫了一会儿。]你是谁？您如何…知道这么多？
//
//Telatrix: 这就是现实的美妙之处，不是吗？每一刻都在转移到下一刻；您所需要的只是一秒钟的信息，以获得所有历史的幻灯片。请允许我向你们展示。
//
//[在他们俩都掉到地板上之前，高音调的频率变得越来越高，最终到达一个在剧烈移动和变化的地方。七号发出一声扭曲并有回声的尖叫，然后被带回原地。]
//
//Telatrix: 深呼吸，你没事。
//
//007: 那——那他妈是什么？！
//
//Telatrix: 现实的语言。我知道这很难理解，但我觉得好像你已经学习到了它。
//
//007: 不……不！我受够了你该死的怪胎表演！
//
//Telatrix: 别说那么多下流话，七号。无论如何，我给了你自由。
//
//[他又拿起了七号的手]
//
//007: 自由……？你管那叫自由？
//
//Telatrix: 我想说的是，你不需要再躲起来了，知道吗？让我告诉你撕开你的壳是什么感觉。[他紧紧地抱着七号，双臂搂着他的背，把头靠在肩膀上]和我一起度过片刻，你会吗？而且，请……叫我“Telatrix”。
//
//006: 那么，我们该如何离开这里呢？
//
//structures.png
//从堤坝艺术展出口的走廊拍摄的图像。
//
//003: 九号是唯一一个有出口名单的人，所以我说我们需要找到她，让我们切出。
//
//006: 是什么让你认为她会告诉我们？
//
//003: 好吧……我还没有仔细考虑过这一部分，但我无法想象这有多难。最坏的情况，我们只能……留在这里。
//
//006: 当然，从排名最高的探险者手里拿走一张隐秘的纸条——绝妙的主意。
//
//003: 有更好的吗？
//
//006: 也许有些事情不会让基地的人在我们离开后立即跟在我们后头。
//
//003: 我们可以躲在什么地方，对吧？我们可以去无数个地方。
//
//006: 如果他们找到我们一次，他们也可以再做一次。
//
//003:看，我让你觉得你必须一直做我的大姐姐，但你至少能对我有信心吗？我要确保我们俩一起离开这里。
//
//006: ……为了酒吧？
//
//003: 为了我们。
//
//[七号走回走廊，九号坐在地板上。]
//
//009: 在你时间之外的角落玩得开心吗？
//
//007: [保持沉默，看着九号]
//
//009: ……哎呀，好吧，我猜你还是有点生气。 [站起来，靠在墙上] 你至少会继续前进吧？
//
//[七号什么都不说，只是走在走廊上。九号跟着他，叹了口气。]
//
//009: 我猜也是
//
//007: 我们接近了。
//
//009: 接近……？
//
//corruptedhalls2.png
//MIS区域的照片，另一边的地板仍然稳定。
//
//[七号抓住九号的胳膊，把她推到他面前。当她看到走廊的状态时，她开始喘气]
//
//009: 妈—妈的！
//
//[七号提着九号悬空在扭曲的地板上，抓着她衬衫的领子，她一边结结巴巴地说话。]
//
//009: 所—所以这就是你从一开始的计划，是吗？把我拖到这么远的路上，只是为了杀了我？
//
//007: 不要那么快地做假设，九号。毕竟，你太有价值了，我没办法杀你。
//
//[七号放开了九号的衬衫，让她掉回扭曲的地板上。她大叫了一声，之后她的麦克风和视频源就被切断了。在MIS区域的另一边，可以看到三号看着七号，然后大声尖叫]
//
//003: 什么鬼？！
//
//006: 三号？怎么回事？[她看到了七号，她的身体在视频源上变成了一团乱麻的像素]
//
//003: 你他妈的对她做了什么，你他妈的精神病！？
//
//007: 给了他们需要的额外推动力。 [七号慢慢开始悬浮在离地面几英寸的地方，漂浮在混乱的地板上，一动不动。三号和六号都退后几步，然后冲刺离开。]
//
//003: [开始哭泣并尝试说话]那是什么？！
//
//006: 我不知道，我不知道……
//
//[他们不断试图跑回故障艺术博物馆，直到七号出现在他们面前。他毫不犹豫地抓住了三号，把他摁在墙上。]
//
//006: 放开他！
//
//003.png
//003被007抓住
//
//007: 恐怕我做不到。[七号举起手，把它推到三号的后脑勺上，逐渐透过它。三号沉默了，只能四处移动她的眼睛。]
//
//006: 停下！
//
//007: 一直以来，我都没有意识到我真正想要的是什么。我现在明白了，六号：有很多东西需要被抹去。
//
//[毫无征兆地，三号的上半身碎成了成千上万的玻璃状碎片，身体的其余部分都瘫倒在地上。七号甩掉了他手上的碎片。六号发出痛苦的尖叫，跪倒在地。]
//
//007: 嘿，我很抱歉，但有些事情必须被纠正。
//
//006: 他妈的离我远点！
//
//[七号抓住了六号的喉咙，把她摁在墙上。他大喊大叫，听起来更加迷茫。]
//
//007: 这是折磨，你明白吗？一切都是歪的，没有任何东西排成一行，他妈的不像它应该的那样增加或减少。Telatrix承诺—他他妈的承诺过—我们可以一起修复这个地方，你不会妨碍它！
//
//006:你那该死的脑子丢了吗！？
//
//007: 恰恰相反。我发现它的另一 —[七号突然痛苦地大叫起来，一只苍白的手臂从他的胸膛伸出。他放开了六号，跪倒在地。]
//
//009
//尝试拍摄009。
//
//006: 呸……他妈的……
//
//[六号喘着气，抬头看着袭击者。一个严重残缺的身影站在她面前，他的头漂浮在他身体的一侧，然后猛地向后退去，重复着。他的脸移动、扭曲，以块状分裂。六号再次尖叫，九号盯着她，笑了。笑声听起来几乎是数字变化的，听起来延迟并颠倒，叠加在他正常的笑声之上。]
//
//007: 你在这……[他慢慢地站起来，胸口的洞被堵住了]我告诉过你，九号：你是有价值的。
//
//009: 你让我去死——别以为我已经忘记了这一点。
//
//007: 还是这么快就判断出来了，我明白。好吧，我很惊讶他离开了你的那一部分。请放心，我们可以找到我们的平均值—从中，我们将绘制属于我们的函数。
//
//unity.png
//统一
//
//[他走近九号，多双手臂张开拥抱。九号回报了这份恩惠，用快速抽搐的四肢拥抱了七号。六号仍然在尖叫，当她把自己向后推去时，她的声音明显紧张。当他们两人拥抱时，他们的身体相交，直到所有能看到的都是一堆黑白形状和纹理。]
//
//007 & 009: 不用担心，六号；你的力量是真实的，你的恐惧是虚构的，你的本质是复杂的。如果你不能被添加到更伟大的东西中，那有什么意义呢？
//
//日志结束
package lvls7x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl789{}