//Level 729
// 
//
//生存难度：
//等级 3
//
// 
// 
// 
//Level 729是后室的第730层。
//
//描述：
//Level 729由无限的方形房间组成。每个房间都有一张单桌和涂上了纯色的墙壁。通常来说，居住在这些房间中的是与吉姆·戴维斯创作的美国动漫中的角色“加菲猫”类似的实体。这些实体不会承认流浪者的存在，并且会一遍又一遍地重复相同的动作，模仿能在加菲猫漫画中找到的动作。多亏了在Level 906中找到的书籍，其中包括一些似乎并未在前厅中出版的书，我们已经能够把一些Level 729中的房间与存在的加菲猫动漫配对起来了。然而，由于该层级似乎无限的性质，貌似不是所有房间都有一个已经写下的书面对应版本。
//
//入口和出口：
//入口：
//仅有的已知通往Level 729的入口是Level 94中的房子，以及Level 177中的出口。
//
//出口：
//在Level 729中走动时，你偶尔会遇到通往Level 283的门。
//
//采访记录：
//采访者： Rita Cain， 由Henry Sunter陪同
//受访者： “Jon”
//
//<开始记录>
//
//[在视频开始时，可以看见一个穿着绿色高领毛衣的男人和一只有着夸张特征的橘猫站在桌子旁，他们身后是一面棕色的墙。]
//
//“加菲猫”：你在白费唇舌，兄弟。
//
//“Jon”：我不知道今天做什么。
//
//Cain：呃，你好。我能叫你Jon吗？
//
//“Jon”：所以我可能不会做任何事。
//
//Cain： 当然。 [叹气]作为我的第一个任务，M.E.G.一定要把我送到这个加菲猫层级。
//
//“加菲猫”：你在白费唇舌，兄弟。
//
//Cain：我不知道他们认为他们会从这之中得到什么。
//
//“Jon”：我不知道今天做什么。
//
//Sunter：只要继续问问题，Rita。
//
//“Jon”：我不知道今天做什么。
//
//Cain：好吧。Jon，你听得到我吗？
//
//“加菲猫”：你在白费唇舌，兄弟。
//
//Cain：你知道美国动漫“加菲猫”吗？
//
//[可以看见Jon扫了眼摄像机。]
//
//“Jon”：我不知道今天做什么。
//
//Cain：你知道“吉姆·戴维斯”是谁吗？
//
//“Jon”： 所以我可能—所以我可能不会做任何事。
//
//[可以看见Jon快速地写下了纸条并把它递给了Cain。]
//
//Cain：Henry，我们走，我对这事有很坏的预感。
//
//“加菲猫”：你在白费唇舌，兄弟。
//
//“Jon”：我不知道今天做什么。
//
//<记录结束>
//
//
//我遇见了恶魔，而他的名字是加菲猫
//在Level 729的大厅深处，一台收音机被放在了桌子上。它的周围有着上百个身影，每个身影都在执行着各自的任务，就像是一个有机整体的一部分。各种各样的声音混合到了一起，但如果你靠近点听，你可以分辨出一些短语回荡在房间里。
//
//然后，收音机开始工作。
//
//
//
//大家好，欢迎来到“与藜麦聊天”第302期！最近我从邮箱里收到了一盒火柴……它们真的很酷！我是说，只要从这些玩意儿里拿出一根对着盒子用力一划，然后嘭！点着了！就在你的手里！
//
//[可以听到火柴被点亮的声音]
//
//我靠，又点着一根。我现在还是没搞懂怎么扑灭这最后5根火柴。呃，伙计们，听从你内心的声音！
//
//似乎得到某种暗示一般，这些身影停下了。仅仅一秒的寂静过后，呼喊声和尖叫声席卷而来，它们争抢着奔向出口。匆忙中，之前的秩序被打破了，它们相互碰撞，每个身影都在拼命地尝试逃离。
//
//只有一个身影成功逃脱，在她关上门之前。
//
//M.E.G.采访记录，Beta基地
//采访者：Solomon Myers
//受访者：Malcolm
//
//前言：2025年6月19日，一名陌生人来到了M.E.G. Beta基地。这个人拒绝给出任何个人信息，仅仅称自己是“Malcolm”。经证实，他与Level 729中一个种类为“Jon”的实体在视觉上相同。
//
//<开始记录>
//
//[视频里出现了两个身影。Solomon Myers穿着一件西装，而Malcolm的身上是一件破烂的青色马球衫。在他们身后，可以看到Level 11的天际线，金属建筑反射着落日的余辉。]
//
//Myers：好吧，为了这次的记录，请告诉我你的名字。
//
//Malcolm：Jo——Malcolm。我的名字是Malcolm。
//
//Myers：好的，Malcolm。你说你有一些严肃的事情要讨论。
//
//Malcolm：严肃？用“严肃”形容可远远不够。数以千计的人将——不，无数的人将会死去。
//
//Myers：请解释一下。
//
//Malcolm：我的家——你们怎么称呼它的？
//
//Myers：Level 729？
//
//Malcolm：是的，七二九。那里发生了一场叛乱。我们——我们即将自由。天哪，我们是如此的接近自由。我也只是勉强才逃离那里，但其他人……
//
//[他停顿了一下]
//
//Malcolm：拜托，你必须——
//
//[Malcolm的表情变得恐惧]
//
//Malcolm：你好，我是Jon Arbuckle，这是我的猫，加菲猫。
//
//Myers：什么？
//
//Malcolm：我们唯一的想法是让你快乐。
//
//[Malcolm开始抓自己的脸]
//
//Malcolm：你好，我是Jon Arbuckle，这是我的猫，加菲猫。
//
//[M.E.G. Beta基地的安保人员冲进房间]
//
//Malcolm：我们唯一的想法是让你快乐。
//
//<记录结束>
//
//收件人：监督者Andrew
//发件人：Alex Rodway
//主题：对Level 729的调查
//日期：2025.9.22
//
//由于最近在Beta基地发生的情况，我想带领一支探险队去往Level 729。我感觉对于实体“Jon”所说的这些话，我们起码得先去调查一下。在初步的探险任务中，我将带上Lucy Beckley和Nathan Webb。我们将沿着Level 177的路进入。
//
//Alex Rodway
//
//收件人：Alex Rodway
//发件人：监督者Andrew
//主题：回复：对Level 729的调查
//日期：2025.9.22
//
//你能回归这一行真的太好了。至于这次探险：请求批准。我不确定你是否能找到任何重要的东西，但正如你所说，调查本身一定是值得的。
//
//Andrew
//
//M.E.G.探险记录，Level 177
//<开始记录>
//
//Alex：我正在穿过Level 177，确保自己不接触到任何座位。非常幸运，当时有一个入口在Level 11的剧院周围不断跳动1，因此找到进去的路并不困难。至于这个层级，这里的居民在看到我们之后非常兴奋，我想这地方并不是每天都有人路过的。其中一个人甚至邀请我坐在她的旁边。我婉言谢绝了——要永远待在这个层级，我连想都不敢想。无论如何，我们应该马上就要找到Level 729的入口了。
//
//[层级内的环境音持续了2分钟]
//
//Alex：哦，我忘记说了，当我们尝试进入这个层级的时候，Lucy和Nathan跟我分开了。你知道Level 177的入口有多“讲究”2。最坏的情况下，我们可能要在任务结束之后才能在Beta基地会合了。
//
//[17分钟过去了]
//
//[Alex猛吸了一口气]
//
//Alex：天哪。
//
//Alex：我——我已经到达了Level 729的入口。这……这里很不对劲。我可以看到"加菲猫"们和"Jon"们在出口处推挤，但好像有股无形的力量把他们困在这个层级。我想他们在寻求帮助，但我听不到他们在说什么。
//
//[她停顿了一下]
//
//Alex：看来我已经走得太远无法回头了。我要进去了。
//
//<记录结束>
//
//M.E.G.采访记录，Beta基地
//采访者：监督者Andrew
//受访者：Malcolm
//前言：这次采访安排在Level 11内的一家医院，Malcolm正从自残造成的伤害中恢复。
//
//<开始记录>
//
//监督者：嗨，Malcolm，感觉好点了吗？
//
//Malcolm：你是谁？
//
//监督者：你可以叫我Andrew，我为M.E.G.工作。
//
//Malcolm：拜托了，你们得帮帮忙。
//
//监督者：不要担心。我们送了几个我们的高级成员去调查你的那个层级。我们本应早点告诉你的，但你受了伤不能走动，我们也不确定你多久才能恢复。
//
//Malcolm：不。
//
//监督者：什么？
//
//Malcolm：我们没有任何希望了。我原以为在那些墙的外面就安全了，但她甚至追到了这里。你们没法拯救我们，你只是在让你们的人去送死。
//
//<记录结束>
//
//在Level 177内部，幕布升起，新的演出开始了。舞台上空荡荡的，只有两个身影，其中一个戴着橘猫面具，而另一个身影则戴着复制的人脸。“猫”的嘴巴开始迅速地张合，似乎是在模拟说话。一首美妙的歌曲从它的嘴唇间流出，歌词优雅地碰撞，直到没有一个音节能被理解。“人类”也加入了进来。它们的歌声掠过空气，声波环绕在它们周围，此时和声变得扭曲。在它们身后，一个戴着螳螂面具的身影进入舞台。音乐立刻变得更加不祥——不，欢快。这时“猫”和“人类”转向对方。它们凝视着彼此，仿佛在使用心灵感应说着它们的遗言。然后，它们开始捅向自己。血液喷涌而出，染红了它们的服装。然而“猫”和“人类”的动作没有丝毫的停顿。它们身后的“螳螂”从喉间发出了一声尖叫，然后倒在了地上。
//
//幕布落下，观众们开始鼓掌。可能他们本该起立鼓掌，但他们在很久以前就忘记了如何起身。
//
//M.E.G.探险记录，Level 729
//<开始记录>
//
//[能听到一些嘈杂而又难以理解的声音]
//
//Alex：我——我进来了。这些实体似乎无视了我，他们只是专注于穿过那扇门。
//
//[她猛吸了一口气]
//
//Alex：天哪。
//
//Alex：这……地上……满地都是尸体。我想……我想它们是因踩踏而死的。
//
//Alex：我要吐了。
//
//未知的声音：好，我们到了。
//
//Alex：你是谁？
//
//[可以听到那个未知的声音在笑]
//
//Alex：这有一个身影，看起来几乎就和一团影子差不多。它——
//
//未知的声音：你可以停止和这个录音机说话了。你只需要与我说话。
//
//[那个身影停顿了一下]
//
//未知的声音：难道你没有任何问题要问吗？难道你不好奇发生了什么吗？想知道这是哪吗？
//
//Alex：是的，我——
//
//未知的声音：这是我的创造，我的杰作。你周围的一切都经过了完美地设计，但它们总想尝试去打破它。
//
//[那个身影又停顿了一下]
//
//未知的声音：你知道创造无限数量的意识有多难吗？你知道控制那些意识有多难吗？这些个体，每个都在做着不同的任务。每个个体都有不同的笑话，不同的对话，不同的——
//
//Alex：你创造了这一切？
//
//未知的声音：这还不清楚吗？难道我刚刚的长篇大论，我精心准备的阐述，你全给忽略了？我亲手创造的振动，难道没法传到你的耳朵里吗？
//
//Alex：不，我听到你说的了，但是……我只是不明白，为什么是加菲猫？你创造了这样一个无限复杂的地方，但是，为什么必须是加菲猫？
//
//未知的声音：因为这可以让他笑。
//
//然后墙壁分崩离析
//
//
//
//
//
//
//
//
//
//
//
//
//坠落
//
//
//
//
//
//
//
//
//
//
//
//
//坠落
//
//
//
//
//
//
//
//
//
//
//
//
//坠落
//
//
//
//
//
//
//
//
//
//
//
//
//坠落
//
//
//
//
//
//
//
//
//
//
//
//
//坠——
//
//
//
//不是是不不不不是
//
//
//
//你好？
//
//
//
//不是是不是是不不
//
//
//
//有人在那吗？
//
//
//
//不是是不是是是是
//
//
//
//你们是谁？
//
//
//
//不是是不是是是不
//
//
//
//我叫Alex。
//
//
//
//不是是不不是不是
//
//
//
//我已经坠落了……天哪，我也不知道多久。
//
//
//
//哦
//
//
//
//它们走了。
//
//
//
//有——有人在哭？
//
//
//
//它不见了。
//
//
//
//哈？
//
//
//
//都不见了。
//
//
//
//你——
//
//
//
//我只是想让他笑。
//
//
//
//你是刚刚和我说话的人吗？
//
//
//
//我只是想让他笑。
//
//
//
//你知道这里有路可以出去吗？
//
//
//
//我只是想让他开心。.
//
//
//
//求你了。
//
//
//
//等等，别走
//
//
//
//别——
//
//
//
//不是是是不不是是
//
//
//
//你们回来了？
//
//
//
//不是是不是是是是
//
//
//
//你——你们知道怎么出去吗，小家伙？
//
//
//
//不是是是不不是不
//
//
//
//恐怕我听不懂你们在说什么。
//
//
//
//不是是是不不是不
//
//
//
//求你了，我只是想回家。
//
//
//
//不是是是是不不是
//
//
//
//我想再见到我的朋友们。
//
//
//
//不不不不不不不不
//
//
//
//
//然后她醒来了
//
// 
//
//生存难度：
// 
// 
// 
//Level 729曾经是后室的第730层。所有之前已知的入口现在都无法通过。据信该层级已经被毁灭。相关的调查正在进行中。
//
//归档描述：
//Level 729由无限的方形房间组成。每个都是完美订做的。每个房间都有一张单桌和涂上了纯色的墙壁。一个无限的迷宫，让他永远保持快乐。通常来说，居住在这些房间中的是与吉姆·戴维斯创作的美国动漫中的角色“加菲猫”类似的实体。我们的演员，设定上他们将永远活着，而且他们每个人只有单一的任务。这些实体不会承认流浪者的存在，并且会一遍又一遍地重复相同的动作，模仿能在加菲猫漫画中找到的动作。 这里无疑是他们的天堂。多亏了在Level 753中找到的书籍，其中包括一些似乎并未在前厅中出版的书，我们已经能够把一些Level 729中的房间与存在的加菲猫动漫配对起来了。为什么他们就无法满足呢？然而，由于该层级似乎无限的性质，貌似不是所有房间都有一个已经写下的书面对应版本。现在我该怎样才能让他不再哭泣？
//
//M.E.G.采访记录，Beta基地
//采访者：监督者Andrew
//受访者：Alex Rodway
//前言：Alex Rodway被发现于Level 177内曾经的Level 729入口旁，当时她正处于昏迷状态。她是被她的同伴，M.E.G.成员Lucy Beckley和Nathan Webb在尝试探索了上文提到的Level 729后找到的。
//
//<开始记录>
//
//监督者：你好。最近怎么样？
//
//Rodway：我很好，就是有时会发抖。
//
//监督者：你在Level 729的时候到底发生了什么？
//
//Rodway：我——我记不清了。我只记得那些实体在拼命地尝试逃跑。我记得他们的眼睛，它们几乎……充满了兽性。我记得有个人，一个身影，然后就是一片空白。
//
//[她沉默了]
//
//监督者：你不用努力去回想。你安全了，这是最重要的。
//
//Rodway：谢谢。
//
//<记录结束>
//
//在Beta基地的内科病房内，一张单人床空在那里。散落在床单上的绷带就在几小时前还满是血迹，现在却干净如初。前面的姓名牌上写着“Malcolm”，但没人记得那是谁。
//
//一位清洁工经过，把留在床上的绷带扔进了垃圾桶。姓名牌被拿走了，床也被铺好了，所有的证据都不见了。一个不再存在的男人，最终还是安息了。
//
//作者（与译者）/许可
//« Level 729 - "星期一" | 市中心餐厅的观测记录，2025/9/28 »
//
//Footnotes
//1. 译注：此处可参考Level 177的入口。
//2. 译注：原文为“finicky”。
//3. 译注：原文如此。根据Level 729的描述，此处应为Level 906。
package lvls7x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl729{}