//Level 710
// 
//
//生存难度：
// 
// 
// 
//“我睁眼时，看到那只猎犬守在我身前，它离我是那样近，我几乎都能嗅到它温热潮湿的鼻息。那张血盆大口分泌的腥臭唾液顺延锋利致死的獠牙滴滴滑落。一把猎刀忽地具现在我的右手心。我知道，在这个地方它无法伤害到我，此刻，它和我一样心惊胆战。可怜的家伙，就这样突然消失了，而那把我手中攥紧的猎刀，已然变成了一块巧克力脆饼干。”
//——艾米·柯克伦，安保技术人员，隶属M.E.G.“先驱者”团队，叙述着她在环戒内的遭遇。
//
//299eb81cef05e9a50499f32e48d1e574.md.jpg
//高悬天空的异常，又名“环戒”
//由M.E.G.拍摄
//
//3631caa58a8b090d96f82fde196e8750.jpg
//M.E.G.手绘的环戒草图
//
//描述
//该层级为一枚半空中的银色环戒，高高悬挂在一片谜团重重的废墟上空。它的方位与海拔保持恒定不变，直径超过400英尺，周长约四分之一英里。表面没有能通过肉眼观察到的动力系统，该环形物体如何保持浮空仍是一个未解之谜。
//
//这一悬空的异常物会每次选定一位来访者并与其互动，M.E.G.已寻访过若干位声称在环戒内滞留过的人员，他们都是从后室的各个地方毫无征兆地切入进来的，在环戒内的访问时间似乎是由该异常本身决定的，范围在3到20天之间。来访者通常会在访问结束后被传送到一个安全且稳定的地点。
//
//十分幸运的是，我们的一员，M.E.G.“先驱者”团队的安保技术员艾米·柯克伦意外切入了环戒之中。她花了整整二十天来收集该层级相关的情报。
//
//环戒没有入口，但在其内圈有四扇窗户，排列位置类似罗盘上的四个方向点。每扇窗户旁边都有对应的独特设施嵌在建筑墙内。北部区域有一副书桌/椅组合，桌面陈列着纸、笔与留言簿。东部区域提供有杏仁水和食物。南部区域则安置着洗手间和床。最后，西边有一个盒子形状的容器，来访者将被迫牺牲自己的一件个人物品放在里面。异常内的环形长廊能够即刻复制后室中各个层级的地理风貌，其能根据环戒内无形非人类智能的意愿随心所欲变换。正常情况下，走完一圈长廊需耗费5到7分钟。
//
//流浪者们声称，他们能感受到该飞行物会产生积极或消极的反应，这种交流会使他们受其影响，基于这种联系产生的情感或直觉而进行某些行为。这种“交流”超脱语言，完全基于本能。环戒似乎是由一个未知意志精心策划的，对人类展开的一场检验、观测与评估。有人推测，与我们交流的这一意志为人工智能（AI）。而反对者们则觉得，这一实体作为AI而言，所拥有的情感和同理心太过丰富了。
//
//实体们会在环戒凭空出现，并非幻象或全息投影，每一个实体都是真实存在的。它们受缚在环戒的绝对控制之下，对来访者完全不构成威胁。
//
//特别通告
//
//由超自然学者兼M.E.G.顾问安妮·邓恩主要负责对先驱者拱门与周围乱石的研究工作，该项目将与她在Level 365M.E.G.“窥镜”小队中负责的任务同时进行。
//
//邓恩会把自己的成果直接向M.E.G.“先驱者”团队报告，她将研究这些神秘废墟的传说史诗，寻访前来此地的朝圣者，并探明监视该层级的指环存在的意义。
//
//研究对于该圣地的朝圣活动完全不会产生影响。
//
//马文·马修斯
//M.E.G.“先驱者”团队
//
//379bfab915b6d0186daa43a84503f9d9.md.jpg
//先驱者拱门和周遭矗立的巨石
//由M.E.G.提供的相片
//
//环戒下方正对的地层是一片完全没有植被生长的环形区域，直径420、周长1320英尺。拱门形状的巨石坐落在这片区域的边缘，先驱者拱门和它周围的立石门屹立于这片古久的荒芜之地上孤独地守望。已没有任何有关这片废墟年岁或起源的线索存在。
//
//许多流浪者出于心灵上或是其他方面的原因慕名前往先驱者拱门进行朝圣。据悉可以在该拱门内看到其他领域的景象，甚至在某种特殊情况下，前厅的光景也能从中显现。有传闻说几个流浪者在穿过先驱者拱门后并没有从另一侧出现，他们就这样直接消失了。没有能够证实或支持该现象的官方证据存在。
//
//整个层级的昼夜循环系统与前厅十分相似。此外，该层级以其生成的淡水泉和溪流闻名，这使它成为了后室中十分稀有的淡水来源之一。
//
//基地、社区和前哨
//没有已知的基地、前哨站或社区建设在该层级的环戒中。M.E.G.在环戒的下方建立了一个地面站以确保这片古老的遗迹不受破坏行为和爱顺走东西的旅者们(1)对其损害。站长马文·马修斯指挥着一个共九人组成的小队。
//
//环戒以北：在留言簿评论
//在流浪者离开环戒之前，一本登记簿会引导他们前往环戒的北窗。一股强大的无形力量将驱使流浪者，让他们在这本留言簿上对本次来访记录留言评论。我在评论之余抓住机会检视了这本留言簿，并记下了其中的一些评论。
//
//“当时我离死亡只有一步之遥，而你把我带到了这里。你救了我的命，我是真的千恩万谢啊。这里真挺好，唯一美中不足的可能就是我如厕时突然有只怪物冲进来了吧。好在我当时坐在马桶上啊！我像个动物似的直接吓拉了，不过我好像本来就是动物来着哈。”
//
//“即使您总一言不发，但，有您陪伴的时光仍是我人生中至福的一部分！我在前厅的生活烂透了。失业、离婚…当我切入后室时，周遭的一切变得更加令人沮丧了。直到与你相遇，你找到了我的价值。真的很谢谢您，如果有机会再次拜访您就太好啦。”
//
//“即使对你为何物一无所知也毫不影响我对你的深情。我爱你呀！哪怕看不见你也一样呀！有你相伴，我感到了安心和被照料的温暖，你对我所谓的考验其实是在了解我吧！窥探我的秘密吧！请您在我的灵魂再次起舞，把我永远留在这里吧！”
//
//"Du kannst mich nicht zwingen, etwas zu schreiben! Du kannst mich nicht zwingen, etwas zu schreiben! Nein! Nein! Fahr zur Hölle."
//翻译：你没法逼我写下任何东西！你没法逼我写下任何东西！不要！不要阿！去死吔啊啊啊啊啊！！！
//
//艾米·柯克伦
//M.E.G.“先驱者”团队
//
//环戒以东：请自便
//一扇四尺高、三英尺宽的门隐蔽地与东部窗户下方的墙壁融为一体，它很不显眼，若不是门扉上方“请自便”的标识，流浪者几乎不会注意到这扇门的存在。这扇门没有把手，但只要触摸门面便可以将其打开，里面是一个共分为三层、摆满冷热食物的食品储存区。它的顶层储有热食，中部是一个室温的食物储存柜，底柜则冷冻着杏仁水和冰鲜食品。当来访者离开后把门关上，里面的食物便会被重新补满。
//
//储存间的食物种类会根据来访者的反应发生变化，取决于访客表现的好坏，里面食物的品质也会在普通食品和美食之间浮动。环戒招待我享用了我妈妈做的那种肉汁浇炸鸡肝与我奶奶做的香草雪顶热桃子馅饼。这对我们来说都是十分愉快的一餐，我用了“我们”，是因为环戒也是有感觉的，不，仅仅将它称作“有感觉”无法完全阐明我们的羁绊。这一实体有丰富的同理心，并且它与人类建立了深入且亲密的联系。
//
//选择表现良好，环戒会让你拥有积极的情绪和亢奋的心情。并且它对不良表现的惩罚也是温和且轻微的。
//
//艾米·柯克伦
//M.E.G.“先驱者”团队
//
//环戒以南：美梦，以及其他。
//南窗区域倚墙安置着一张安适的床与与一间厕所。我抱着试试的心态按下了马桶的冲水按钮，居然真管用！不怕你笑我，我在发现这事儿的时候开心得都跳起舞来了呢。
//
//当产生那想法的顷刻，我所惦念着的淋浴间便顺应着我的想法平地而起。温水神奇的从…某处涌出再流走。香皂和松软的毛巾具现在我的手中。嗯…这么说吧，我跟条鱼似的，直接从衣物的束缚里跳了出来，沉溺进了洗浴之中。当我终于带着一身的少女粉气香喷喷地洗完出浴后，淋浴间也即刻消失了。
//
//所谓床更确切说应该是一个焊在墙里的睡眠小窝。它的每一处都超级完美。我就像是三只小熊里睡在宝宝熊床上的金发姑娘一样，刚躺上去就呼呼大睡啦。
//
//请原谅我主观色彩强烈的描述方式，但我真的好想念环戒哦。
//
//艾米·柯克伦
//M.E.G.“先驱者”团队
//
//环戒以西：献礼
//材质类似铝的方形盒子放置在西窗之下。当掀开盒盖时，献祭仪式，也就是“献礼”，便会开始进行。容器盛满了琳琅满目的各类财宝：刀与短剑、华贵的餐具、火盐、金银珠宝、装有神秘试剂的烧瓶…如此多的珍奇异物。
//
//你将被迫献出对你而言最珍贵、最优秀的物品加入它的收集。它知道自己想要什么，你也知道他所求何物。在仪式中，我拿出了我招牌的Victorinox牌瑞士军刀，毫不犹豫，爽快地把它放入盒子之中。
//
//什么事也没有发生，它毫无反应。
//
//突然，强大的欲望充斥了我的身体，它控制着我把手伸进盒子，试图把供品夺走。我到底是怎么了？我不能这样！但那股欲望好像将我附身一般，逼迫我再次抓住了小刀，我强忍着冲动又把它放在原处。难道是我的献礼不够珍贵吗？在我耿耿于怀时，抚慰灵魂的平静感笼罩了我焦躁的心灵，我终于如他所愿，拿去了我的“祭礼”。在我把小刀取走的同时，一把一模一样的小刀出现在了它原来陈列的位置。柔暖、毫无保留的博爱如涓流一样湍湍流淌，遍布我的全身。我们的神魂在那一刻合为一体。千言万语也难形容我当时的心情。仪式结束，我合上了盖子。
//
//艾米·柯克伦
//M.E.G.“先驱者”团队
//
//入口与出口
//入口
//你会基于该异常物的意志视情况随机切入环戒。
//
//你必须沿朝圣者之路前行才能够进入该层级，抵达环戒下方的废墟——你能在后室找到一些雕刻着拱门和环戒图案的浮木碎石。用右手触碰它们会将你切入到下一个场景：一个离废墟更近的层级。朝圣者之路的路程与难易是由环戒的意志决定的，它会根据你的健康、刚需与信仰酌情设置。
//
//出口
//你会基于该异常物的意志以切出的方式离开环戒。
//
//你同样需要沿朝圣者之路离开该层级的废墟。用你的左手触碰雕刻会让你切出该层级前往下一个场景，与废墟相隔一个层级的区域。
//
//- 来访者
//(M.E.G.安保技术员阿尔伯托·桑切斯叫住了该层级的地面站站长，外号“老家伙”的马文·马修斯，打断了他前往厕所的步伐。)
//
//桑切斯：长官！我们这儿来了一位客人。（他左顾右盼，神情惊诧中带有一丝疑惑）来了一位客人。（他360度扫视周围一周，搜寻着那位客人的踪迹，显然他已不见踪影。）他…去哪了？
//
//马修斯：啥？谁去哪了？客人是谁？那是张报纸吗？阿尔伯托，发生什么事了？快点向我报告。
//
//(桑切斯把折叠好的报纸上交给了他的长官。)
//
//桑切斯：他让我们把这份东西交给安妮·邓恩。
//
//（站长马修斯将报纸展开。一篇文章被红笔醒目地圈了出来。它的标题是邓恩失踪，疑似死亡。毫无疑问，这是一篇伪造成新闻的讣告。马修斯看完后便把报纸再叠了起来。）
//
//马修斯：谁让的？阿尔伯托，我们的客人长什么样子？
//
//桑切斯：他十分颀瘦，皮肤病白，像具尸体…中等身高，面堂…发黑。(技术员开始颤抖啜泣起来。)他穿着一袭黑色的大衣，头顶戴着一顶联邦帽。那双眼睛像是黄色的鬼火一样！(桑切斯开始撕扯他的耳朵和黑色的头发。)我看不到他！不puedo recordar… Se ha ido… El no esta en ninguna parte(2).
//
//马修斯：说英文！说英文！
//
//(另一位安保技术员，艾米·柯克伦被俩人引发的骚动所吸引。马修斯示意她过来帮忙，艾米见后便跑到了他们这边。)
//
//柯克伦：阿伯特？马修斯站长？我能帮上些什么吗？
//
//马修斯：桑切斯被施咒了！你必须立刻把他送到M.E.G.的Alpha基地接受治疗。
//
//柯克伦：施法了？Alpha基地？
//
//马修斯：没时间了！（站长拿出了一本小本子，匆忙地在上面写下了一些字母、数字与名字。他把写满信息的一页撕了下来，交给了柯克伦。)用上面写的授权码，这里面的一个名字能让你预约到和一位监管者进行会面。
//
//柯克伦：我不明白。为什么监管者会同意见我？安妮·邓恩博士马上要来这里调查遗迹，我已经被安排作她的护卫了。
//
//马修斯：前面的计划全部推翻。告诉M.E.G.，我们在后室遇到了一个M-i-B。
//
//(显而易见，柯克伦完全不明白这串词是什么意思。)
//
//马修斯：M-i-B，Men（人）in Black（黑衣），我们这来了一个黑衣人！
//
//柯克伦：黑衣人？(她紧张地咯咯笑起来)威尔·史密斯来这儿啦？我能要张签名嘛？
//
//马修斯：黑衣人是真实存在，和前厅喜剧电影里的虚构角色完全没有关系。MiB是缄灭相关证人，威胁着超自然学者的恐怖组织。并且，他们不属于任何的政府机关。
//
//柯克伦：这我们有啥关系？为什么要来这里？为什么要现在来？
//
//马修斯：M-i-B不是后室的原住民。他们也不是“人”，不是人类。我们甚至不知道他们如何称呼自己。他们是某种于各个世界之间穿行的高维度存在。黑衣人罕有露面，但他们的每次出现总伴随有人员的死亡与失踪产生。这次他们的目标很可能是安妮·邓恩博士。
//
//(马修斯把报纸的文章给柯克伦看，她在读完文章后看向自己的站长，她突然意识到，眼前的这位男人在当年可是M.E.G.制度内的头号玩家。他是靠自己的知识、经历与地位实至名归地赢得这个香饽饽一样的职位的：为先驱者拱门与废墟做轻松的保姆工作。)
//
//柯克伦：诅咒的效能有多强？
//
//(阿尔伯托·桑切斯在一旁口水横流，他正在与自己的手指热吻。)
//
//马修斯：现在还不好说。MiB在前厅的能力是被限制的，而在这里却没有那种削弱存在。邓恩也许是后室对黑衣人了解最为丰富的人了。有传闻说她前往这里的理由之一正是M-i-B。
//
//柯克伦：那么也许，安妮邓恩能拯救我们的阿尔伯托。
//
//注： 未完待续...
//
//- 来访者
//作者信息
//« Level 709 | Level 710 | Level 711 »
//
//Footnotes
//1. 译注：原文为souvenir seekers，纪念品追寻者，结合上下文作此翻译。
//2. 译注：此为德语，机翻：我还记得… 他走了…… 他无处可寻。
package lvls7x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl710{}