//小事
//生活中，我们总是会忘记一些小事。比如春天，花朵是如何绽放的，之后，又是如何转变，变到夏天清爽的空气，秋天娇嫩的落叶。
//
//还没注意，就到了冬天。
//
//可爱的雪在脚下被踩散，空气中吹过有些寒冷的微风，许多人觉得冬天是完美的季节，其他人却瞧不上。
//
//我周围的红木墙把房间装饰成了一间小木屋的样子。外面，雪花正不断跌落在屋子上。周围的地毯非常蓬松，上面结了小块小块的污垢；古旧的深蓝色沙发散发出我熟悉的气味；火焰轻轻地咯咯作响，声音反而让人觉得更加安静；房间里散落的小物件更是与此时相称（虽然我妈让我收拾起来）。整个房间堪称完美。
//
//但我已经知道了。
//
//我缓缓蜷进毯子里，欣赏外面美丽的雪花，然后我看到了组成那雪的许多东西。雪中美丽的事物不断下落，我也看到了更多——
//
//“哈利。”
//
//对了，我需要做什么事了。再等——
//
//“哈利！”
//
//哎，看来等不了了。
//
//“来了！”
//
//我扔下毯子，走向沙发去拿上面的外套。外套里有我的钱包、手套、帽子、还有些线头棉绒，可谓是一应俱全。毕竟，没有这些东西，我还是我吗？我需要这些东西。
//
//我还是——
//
//我一边戴手套、披外套，一边走向前门去，去往冬天的万花镜里。我的帽子没戴稳，肯定一会儿就会掉下来，不过暂时不用管。口袋里的线头棉绒没被我扔掉，因为它会破坏口袋里的舒适感，使得周围事物有一种超现实的感觉。又是一件完美的事。
//
//必须是完美的。
//
//打开门，我看到我爸拿着一把铲子。他把铲子交给我，对我说了一句话。
//
//“把雪铲开。”
//
//夺走雪的光华是多么背信弃义啊，竟然想让我乐意做这样的事吗？然而，他的话是绝对的。我无法反抗我爸的权威，只能接受命令。
//
//“好。”
//
//我爸转身走了，准备回屋。他每走一步，脚下的雪都沙沙作响，被压成一片片细密的小毯子。走到门廊，他开始跺脚，直等到靴子上不再有雪，只剩下几个孤零零的小白点。最后，他回头看了看，进门了。
//
//我感觉脚下精美的雪毯里似乎有一种需要我探索的触感，于是我便扑通栽了进去。我躺在冷得刺骨的深深的雪中，感觉到一阵平静。好像有冰冷的针钻了进来，戳刺着它所能触及的每一寸皮肤，但这种感觉却莫名地使我安心。轻柔的雪慢慢包围了我，我感到无法拒绝。我在雪中越陷越深，几乎就要睡着了。
//
//但我没有。
//
//我得完成我的任务。我得尽全力清理这里，不能剩下一片雪花。我抓住倒在一旁的铲子，把自己拉了起来。站起来的时候，我看到了什么东西。
//
//远处的房子……
//
//颠倒了？
//
//我眨了眨眼，它又变了回来。不出所料，我大概是头昏了或者别的什么吧。总之，幻觉已经消失了，一切重归正常。
//
//我挥舞铲子，雪随之翻动。我只管把它们推到大路上，这样一来，就成了别人该管的事情。我们人类就是这样，生来就很自私。没错。
//
//工作终于做完了。我把雪全都移走了，移到了他人责任的漩涡深处。真是奇怪，我们就是会把自己的问题甩到别的地方。也许这就是我们自私的原因吧。我们必须这样做，才不会在生命中迷失自我。
//
//根本不合理。
//
//准备回家的时候，有片雪花吸引了我的目光。它样子很奇怪，扭曲着，好像能看到里面的形状。那是……管道吗？不对，不可能。不过是幻想罢了。我转身离开了，听到那片雪花轻轻落进雪堆。然后又是一片古怪的雪花，仍旧落在那堆雪中。
//
//我回家走进了厨房。我只想找点暖和的东西。不要咖啡，喝了会变得兴奋，胃里也会不舒服。我想要一杯热可可。我拿出一只马克杯，上面随意地印了一颗心，写着“我爱你”几个字。那颗心替换掉了“爱”字，一般就是这样的吧。
//
//橱柜里放了各种东西，我拿出了最后一袋热可可和棉花糖。角落里有一只茶壶，我把它从我们自制的底座上取下来，准备拿去热牛奶。我这才想起我还得准备牛奶才能喝上热可可。我朝冰箱走去，却又看到了古怪的事。
//
//但是，今天发生的还不够多吗？
//
//我选择忽略它，照常去拿牛奶。我听到我爸在附近对他读的书品头论足，听他对天气之类无聊的事絮絮叨叨真的很烦。拿起牛奶时，我又听到有猫叫，又是一只流浪猫。我很想把它抱进来，但我爸特别讨厌猫，所以我做不到。猫咪跑开了，这么冷的天孤零零的，根本没人爱它。除非它有天能找到家。
//
//在你被恨意包围的这个世界找到爱的几率有多大？
//
//我热牛奶的时候，看了一眼棉花糖。怎么……看起来这么不对劲。我突然觉得还是改用冰箱里的奶油更好。最后，我果然还是感觉奶油这个选项更佳，毕竟，它的口味更棒，也不会化进可可里。我把那包棉花糖拿走，从冰箱里取来了奶油。牛奶热好了，于是我关火了。我把可可粉加进去，开始搅拌，让它们充分混合。接着，我把它倒进了杯子里，让它被爱包围。
//
//接着，我又去看窗外的景色。外面可真美。雪还在下着。
//
//然后我注意到了一处细节。
//
//雪是紫色的。
//
//管理员凭证已确认：欢迎，监督者B。
// 
//
//生存难度：
// 
// 
// 
//The-Boy.jpg
//Level 721中男孩的画像
//
//Level 721是后室的第722层。其外形类似一个房间，其中有一名男孩。此份文件只允许由监督者A，监督者B，以及监督者C阅读。如果你并非这些人员，请立即关闭此页面。
//
//描述
//Level 721是一间单人房，外形如同孩子的卧室。Level 721中有各种各样的杂物，如玩具和备用衣服，以及各种家具。Level 721的墙壁被漆成深蓝色，地板为木质，更确切地说，是橡木地板。Level 721中有一个衣柜，其中有多件衣物，都为青少年男性型号。Level 721中有一张床，其上有两层床单以及一张毯子。Level 721中有大量书架，其上摆满玩具及书本，且都无法辨识。特别是书本，其中都没有文字。Level 721中没有窗户，且任何尝试打破Level 721中墙壁的举动都已被证实无效。Level 721是标准儿童房间的完美复制。
//
//Level 721的独特性质会在任何尝试记录该层级的文件中生效。每当尝试记录Level 721中的任何信息时，这些信息都会被替换为同一个故事。故事的内容是一个男孩在冬天经历的种种事件。故事中包含了将积雪铲出草坪，制作热可可，以及观看下雪的事件。故事中含有大量值得注意的细节，包括：各种似乎在切入/切出的物件，如上下颠倒的房屋，似乎能将人吸入Level 2的一片雪花，以及在切入Level 1时脱水所引发的向Level 628的切入。
//
//任何有关Level 721的文件如果被超过三人阅读，就会产生异常。当这种情况发生时，有关该层级的文件会开始逐步损坏，直至完全消失。此外，阅读了该文件的人员会忘记文件内容，且无法回忆起文件中的任何文本和信息。无法通过任何方法讨论Level 721，进行讨论的尝试都会造成上述异常发生。
//
//发现
//在很长一段时间内，Level 721都未被发现，且由于其异常特性而难以获取相关信息。唯一一名了解Level 721信息的人员是监督者A，且由于该层级特性未向其他人员透露信息，致使当时该层未能被发现。经过实验1，认为Level 721的特性很可能是仅限三人间的信息传递。因此，向他人传播Level 721的信息被认为几乎是不可能的。
//
//男孩
//Level 721内只有一个实体居住，被称为男孩。男孩是一名性格忧郁的男性，主要活动只有睡觉以及“阅读”该层级的书本。男孩行动被动，似乎被困在Level 721并想要离开。当将上述故事讲述给男孩时，他似乎会表现出对故事的模糊记忆，并声称自己经历过这个故事。男孩喜爱热巧克力，会喝下给予给他的热巧克力，但他似乎总想要加奶油。因此，推测试图访问此文件时出现的故事的主人公就是男孩。
//
//基地、前哨和社区
//该层级不存在任何基地、前哨与社区，因为试图意识到此层级的存在并试图居住的行为是无法安全实现的。
//
//入口与出口
//入口
//进入该层级的唯一方法是意识到该层级及其特性，然后，用马克杯喝一杯热可可，当将其喝完时，你就会出现在 Level 721。
//
//出口
//要离开Level 721，只需走出门即可。之后，你会出现在Level 57。
//
//作者信息
//« Level 720 | Level 721 | Level 722 »
//
//Footnotes
//1. 由监督者B一人完成
package lvls7x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl721{}