//Level 790
// 
//
//生存难度：
// 
// 
// 
//level790.png
//关于Level 790唯一已知的照片
//
//Level 790 是后室的第791层。
//
//Level 790看上去是一座古典英伦式的城镇，但它会通过各种意外事件杀死任何来到此处的人。
//
//描述：
//Level 790是一座被雪覆盖的城镇，每天刮起的暴风雪会使这些雪不断补充。虽然这里的房屋呈现出老式英国石砖建筑的样貌，但它们都具备现代风格的装潢与电器。例如双开玻璃窗、中央供暖、供水和供电。
//
//本层十分寒冷，温度保持在-2°C（28°F）。地面十分湿滑，人在上面行走时很容易磕绊或跌倒。每栋建筑物都家具齐全。能找到食物、水，甚至是各种钝兵器。Level 790的城镇是无限延伸的。不过本层中能找到的房屋只有有限的几种类型。
//
//教堂
//教堂相对不太常见，其内部通常具有各种书籍、食物和一把刀。这里同样有能够防范本层危险事件的头部防具。
//独栋住宅
//独栋主宅是Level 790中最常见的建筑之一。它们通常具备 Wi-Fi，同时拥有可用的照明和供气。不过，这些建筑中的供气开关从不应当打开。
//半独栋住宅
//半独栋住宅是另一种在Level 790中很常见的建筑，它们通常没有Wi-Fi，但是能找到杏仁水、腰果水，以及诸如长杖和棒球棒的钝兵器。
//联排住宅
//联排住宅是本层中最常见的建筑，其内部会有各种补给，强烈建议居住在此处。
//街角商店
//街角商店总会在一排联排住宅的末端找到。它们内部总是会储存大量的食物，不过它们内部没有Wi-Fi或武器。
//茶叶店
//茶叶店是Level 790中最难找到的建筑。它们内部有Wi-Fi、供暖、供气、供电以及大量杏仁水和腰果水。因为Level 790的灾害在这些建筑中更不易发生，强烈建议你尝试在此处生活。
//对这些建筑物造成的任何损坏以及从中拿走任何东西都会在48小时内自动重置。不过，当一栋建筑重置时，它内部的东西可能会不再相同，这使得它们不一定能绝对保证无限制的补给。
//
//尽管看上去本层十分适合居住，但Level 790绝对不应当进入。这是因为每一位进入的人都被某种看上去是意外的事件杀死了。虽然造成死亡的事件可以被总结并规避，但当你留在Level 790时，死亡的可能性每天都在增加。直到有天达到一个不可能规避的程度。
//
//基地、前哨和社区：
//本层中没有已知的基地、前哨和社区。
//
//死亡关联事件
//经过无数的牺牲与探索，几种会导致死亡的行为已经被发现。它们如下列所示：
//
//暴风雪。
//每日出现的暴风雪在过境时必然会导致死亡，具体原因不明，不过推测是因为极度寒冷、过大的雪，或者某些居住在暴风雪中的未知实体。
//屋顶瓦片。
//应当避开任何看上去年代较远的建筑物，如果一个人靠近这些建筑物的入口，一片瓦将会掉落并砸在流浪者的头上。致其死亡。
//透明冰面。
//在透明冰面上滑倒总会在落地时导致头部骨折。
//一氧化碳。
//使用任何火炉时，其都有可能以惊人的速度释放一氧化碳，如果窗户没有打开，建筑内的人将会窒息而死。
//食物中毒。
//很多食物都有可能含有剧毒，原因可能为过期或被污染。
//电气火灾。
//很多电力系统会接触不良并引发电气火灾，将房屋中的人付之一炬。然而这些火焰不会扩散到其他屋子中去。
//树枝折断。
//虽然不是很常见，但有时树枝会从树上落下或被风吹飞。这之后，它总会击中流浪者的脑袋。使之立刻死亡。
//地面开裂。
//有时，流浪者脚下的地面可能会突然裂开，导致其落入地表下的裂缝中，撞上底部的石头死亡。
//入口和出口：
//入口
//Level 790可从Level -7的小镇中进入。Level -7中的工厂会偶尔散发白雾，与这些雾接触会将人传送至Level 790。另一种进入方式是在Level 26中找到一扇橡木门，它将会带人来到Level 790中一间房屋的出口处。
//
//出口
//由于仅在进入的几天内便发生了大量死亡，目前未能发现任何Level 790的出口。
package lvls7x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl790{}