//Level 799
//U.E.C.终端
//正在连接至 U.E.C. 数据库。
//
//>检索 “翼靴计划”
//
//正在获取与查询内容：“翼靴计划”有关的文件。
//
//已找到6个相关文件。
//
//▽ meg-799-exploration-1.rtf
//Level 799探索日志
//详情：
//日期：
//2025/7/10
//
//目标：
//通过探索Level 799以为数据库搜集层级入口信息，并在此层级内寻找稳定的出口。
//
//参与人员：
//Mari Kerner，“Mari”探险队队长
//Alexander Horvat， “Mari”探险队队员
//Kathleen Younge，“Mari”探险队队员
//
//音频记录
//<开始记录>
//
//Mari Kerner： 音频已连接。我们可以开始为这次记录描述周围环境了。
//
//Alexander Horvat： 那好， 我们开始吧。
//
//Kathleen Younge： 我们先看看。 我们于该层级的所在处拥有一个废旧建筑的外观，像个，呃…医院？
//
//Mari Kerner： 如果是我，我不会说“医院”的。它更像个实验室。现在去第二个房间。
//
//Kathleen Younge： 好吧， 说的也是，这里显然是科学器材比药品更多。 我们找到了显微镜和一大捆我完全不认识的仪器……等等，看来终端把这里认定为是U.E.C.的一个基地了。这真是…… 见鬼。
//
//Alexander Horvat： 伙计们， 瞧瞧这里。
//
//Kathleen Younge： 好的，Lexi1 …… 哦，哇！有个洞。
//
//Mari Kerner： 这是一个在墙上的直径约为2英尺的洞，延伸极远.。看起来像是种由生锈金属造成的隧洞。我会把它标记为一个潜在的出口。进入下一个房间。
//
//Kathleen Younge： 妈的什么鬼。
//
//Alexander Horvat： 那声音真是…… 令人心神不安啊。
//
//Mari Kerner: 这儿一直有尖叫声。听着像是个女人或者孩子发出的。这或许是个实体，也可能是这个层级的特性。我们去调查一下。
//
//[话筒并未捕获到任何上述的声音。]
//
//Alexander Horvat： 好的。
//
//[无关音频被移除后的几小时内，该探险队正在探索此层级，寻找尖叫声的声源。 尽管话筒从未记录到尖叫声，该小队仍报道尖叫声在整个探索过程中是不间断的。]
//
//Kathleen Younge： 另一个U.E.C.终端？这个层级一定是正在不断生成这些玩意。U.E.C.绝不可能有这么多终端。
//
//Mari Kerner： 进入下一个房间。
//
//Alexander Horvat： 这是个新的。
//
//Kathleen Younge： 是的。总算不是一个堆满杂七杂八的实验器材的房间了。
//
//Mari Kerner： 房间里除了一把椅子啥都没有。对面的墙是一面玻璃幕墙。玻璃之后是……
//
//Alexander Horvat： 我操。
//
//Mari Kerner： 尖叫声的声源已找到。 玻璃墙的另一面是一个被绑在童床上的女童。她的头颅上半部分已经被摘除了。
//
//Alexander Horvat: 这……这不能。
//
//Mari Kerner： 进一步的检查表明这个女孩的整个大脑都不见了。
//
//Alexander Horvat： Mari，你怎么能对此无动于衷? 我们得救救她。
//
//Mari Kerner： 在她试着挣脱绑带时不断地有血从其头部流出。
//
//Kathleen Younge： 伙计们， 我们得撤了。立刻。
//
//[失去连接。]
//
//<结束记录>
//
//▽ uec-base-cyllene.uisle
//赛列妮基地
//基本信息
//位置： Level 172
//
//建立日期： 2022/8/13
//
//领导者： Dr. Winston Rosevolt
//
//活跃成员： 23
//
//建立目的： 在可控切入领域进行研究。
//
//描述
//cyllene.jpg
//赛列妮基地仓库的外部景观。
//
//Level 172 虽然会在较短一段时间内变得相当危险，但仍可以通过寻找庇护所躲避，因其在大多数时候都是绝对安全的，它被我们选为赛列妮基地的建址。这些因素的结合既保障了在基地内工作的U.E.C.的人员的安全，又能阻止流浪者在此建立社区，对U.E.C.的工作产生潜在的干扰。我们已与本地的的团体“电车帮”达成了协议，电车帮将会把流浪者带向远离赛列妮基地的地方以换取资源。
//
//该基地建造于此层级的一个办公楼及其周边的仓库中。 在建立一个基地之前，刃岭游击队的成员在两栋建筑内对窗户进行了搜查。在这之后，办公楼中的房间都被翻新用于多种用途，并配备了从其他层级拾获及从后室机器人科技和B.N.T.G.及其它团体那里获得的机械以将其改造为生活区。附近的仓库主要用于进行包含可控切入/出的研究在内的多项实验，必要时这些机械可以被移入或移出。 此外还建造了一个连接办公楼与仓库的连廊以保障在此层级的“夜晚”事件期间的楼间安全来往。
//
//巫神研究院的Dr. Winston Rosevolt建立了赛列妮基地用于研究可控切入。从它建立之初计，它已在该领域有了数目可观的进展， 其研究成果也成为了“翼靴计划”的核心。尽管“翼靴计划”尚处在早期阶段，它的成果绝对是前景光明的， 在赛列妮基地的研究很快就能让我们能随意在层级间穿梭。
//
//▽ uec-project-talaria.uisle
//翼靴计划
//翼靴计划是由巫神研究院的Dr. Winston Rosevolt与塞勒涅基地的其他人员主导的一个计划。它的最终目标是对“双叉矛魔使”的生物学进程进行逆向工程以开发出能让人在层级间随意移动的设备。
//
//对该实体的尸检表明它身上有一个可以产生类似于记忆汁的器官，并能直接将此液体泵入其大脑之一，该进程据信是被此实体专门用于执行可控切入（共同切入）的过程。此外还存在大量流浪者在摄入记忆汁之后自主切入一个他们在旅行过程中记得到达过的层级的报告，虽然这些传闻皆未经证实。这两个因素表明共同切入可以通过使用记忆汁实现。翼靴计划的最初目的就是验证这个假说。
//
//早期测验试图通过让人摄入记忆汁重现报告中流浪者共同切入其他层级的场景。在早期阶段将U.E.C.的人员暴露在潜在的记忆汁成瘾风险下被认为是不明智的。因此才有一个不知内幕的志愿者被从Level 11的大街上招募而来。Lee Halley因其拥有与违禁品接触的经历并处于孤立无援的状态而被选中。
//在Lee Halley身上的实验以U.E.C. 为其提供的大剂量记忆汁开始。将记忆汁注射入Halley的血流中并让其注意力集中在Level 11上。在前两周的试验中，这仅仅导致Halley经历了极其短促的记忆汁旅程，他报道仅仅是回溯了许多童年的回忆。然而第三周开始不久后一个被认为Halley在受输记忆汁时能进行自主切入的事件发生了。这个过程是否可控仍是未知的，因为Halley再也没有回来。这一次我们再也无法得知Lee Halley的下落。
//
//在失去Halley后，Dr. Rosevolt被U.E.C. 高层告知不准再次在此阶段进行任何人体实验。鉴于无面灵有着与人类有着相似的生理特性，所以他决定开始使用无面灵进行实验。不幸的是, 这一阶段取得的成果寥寥无几。在Lee Halley实验中使用的记忆汁的剂量在多数无面灵实验中都表现为过量，现阶段认为Lee Halley对记忆汁有着无法从其他无面灵身上发现的先天超常的抗性。更多组的小剂量经过了测试，但没有一组成功引发自主切入。后来在此时间节点上发现Dr. Rosevolt开始以自身精神健康为代价私自注射记忆汁试图重现Lee Halley实验的效应。
//
//在一连串的失败后，Dr. Rosevolt开始对其实验变得愈发偏执狂热，尽管具体表现仍在调查中。在某个时间，Dr. Rosevolt's的实验结果出现了偏差，整个赛列妮基地被转变为如今被M.E.G. 认定为Level 799的异常空间。Dr. Rosevolt与其余U.E.C. 出现在此基地的人员都已失踪，目前被假定为死亡。
//
//▽ uec-rosevolt-email-log-03182024.eml
//致： Oleana White，巫神研究院
//来自： Dr. Winston Rosevolt，巫神研究院
//主题： 造神
//日期： 2024.3.18
//
//亲爱的 White女士，
//
//不管您是否愿意加入我们，我们已然蹑足于新旧纪元之交。您和您的党羽总在讥讽我的研究方式 ，因为我的实验对其他人表现出了所谓的“危害性”。但您要知道为了追求科学的跃进，牺牲在所难免，而这能让整个后室都屈从于吾等意志并在虚实间穿梭的力量之意义早已在“跃进”之上了, 这实际是在造神。您已经数次让我使用人体实验的计划胎死腹中, 连使用无面灵中渣滓的请求都被您否决，对，就是那些有着人类衣装的肉瘿。如果您不让我招募人体实验的志愿者的话，那我自有备用手段。今晚的实验我将会在自己的亲生骨肉身上动刀，就是我那尚年幼的女儿，赛列妮 ，即我用来命名这栋建筑的人。她或许活不过今晚了， 但她的牺牲将会点燃引导新世代精神的业火。她今后会作为英雄被书写于汗青之上，而我则会被记载为一位君王。今晚之后，我必会成为你们世界的神，在成神之路上我是不会对那些挡道的蝼蚁心慈手软的。
//
//—Winston Rosevolt博士，众神之帝
//
//▽ meg-level-799.isle
//Level 799
// 
//
//生存难度：
//等级 0
//
//安全
//稳定
//实体绝迹level-799.jpg
//Level 799众多房间中的一个。
//
//描述:
//Level 799被假定为由无限组类似于能在科研设施内找到的房间组成。该层级内的房间有相当类似的样式，总是有着白色塑料地砖，干燥的白色墙面，还有各色放置于层压板台面的科学仪器。 诡异的是, 许多仪器都印有U.E.C.与后室机器人科技的标志。然而，鉴于这似乎无尽的房间内的设备都带有这些团体的标志，目前只得假定这是该层级的自然现象而非由上述团体的人员携带进入此层级。
//
//稀奇的是，该层级的墙上都嵌有不明隧洞，这些隧洞都由生锈的金属制成并延伸向各种不寻常的地点。隧洞的尽头是拥有各异陈设的自洽房间,许多房间看起来就像是Level 466中的重复区域。试图从隧洞入口前进极远的距离将会使流浪者遭遇无法穿透的白色虚空。
//
//该层级并没有已知的自然生成的实体，尽管有时被隧洞连通的房间会出现带有极其模糊动作及拥有人类或实体外观的诡异视觉幻像。这些幻像凝滞在原地，与它们进行物理接触的尝试则证明它们是完全没有真实形体的。
//
//Level 799最为异常的特性是它回荡在整个层级的挥之不去，撕心裂肺的尖叫声。此尖叫声被报道像是单个女性所发声音，尽管它似乎在该层级的所有的音频记录都是缺失的。听到此尖叫声的流浪者都能直接辨认出该声音来源的具体方向，但所有循此方向寻找声源的探索从未将他们引向可辨认的声音来源。
//
//基地、前哨和社区
//鉴于此层级内所展现的高科研技术水平， 曾提出过在此层级内建立一个科研站点的计划，但M.E.G. 人员发现该层级内回荡的令人心惊胆寒的尖叫声对拓展定居点形成了巨大阻力。M.E.G. 有时会组织以从该层级获取机械装置为目的的勘探。值得怀疑的是B.N.T.G. 和后室机器人科技也可能会以类似目的组织对该层级的勘探。
//
//入口与出口：
//目前已知仅有的入口是穿过Level 172的一栋办公楼。任何尝试进入此建筑的行为包括但不限于翻过此办公楼的窗户， 将会把流浪者带到此层级。该建筑的每个窗户及门都会将流浪者送至此层级的不同部分，这些部分经常会被巨大的空间所分隔。
//
//这些入口同时也是该层级仅有的已知出口。鉴于流浪者难以在该层级找到第二个出口，建议所有流浪者都不要远离他们进入此层级时的出口，不然他们便可能永远迷失在Level 799。
//
//▽ meg-799-exploration-2.rtf
//Level 799勘探后续记录明细
//前言:
//以下明细由M.E.G. “Mari”探险队的Kathleen Younge在完成对Level 799勘探后写成。该明细旨在记录在音频记录器材失联后探险队的经历。
//
//详情
//音频记录中的失联是由层级本身的崩坏造成的。看来是这个层级自己在试图抹除展现在其面前的这些令人作呕的场景。这次崩坏让我，Mari，和Lexi处在一种自己同一时刻一半在Level 799而一半处在另一个地方的状态。第二个地点像个满是机械和科学器材的仓库。但它们并不像在Level 172找到的那些。它的荧光灯早已烧坏了，我和我的同事们被完全笼罩在黑暗中。我们正被挟裹于骇人无比的惨状现场与蚕食意识的漆黑未知之间。
//
//Mari正经受着一种虚脱且意识游离的状态，所以我暂时把她留给Lexi 照料，这样我就能为我们找到一个出口。摸索周边，我攀上已废置多年的大型机械直到我到达了一个含有此层级声源中心的房间。连接着各种精密复杂的科学仪器和并被一束绿光照亮的是一个人脑，它悬浮在一种澄清棕色液体中。在现实的另一端，我注视着这个尖叫不已的女孩，她在用眼神苦苦哀求我结束她的生命。
//
//拾起身旁的显微镜, 我奋力将装有这个撕心裂肺尖叫的女孩的大脑的玻璃容器击个粉碎，容器内的液体一瞬间奔涌而出。我抓起一片玻璃碎片，将它直直刺入那个女孩的大脑，让它把整个脑子都捣烂，直到那个实验室完全崩毁瓦解，最后，只剩我与身边这个漆黑寂寥的仓库。
//
//我不知道那帮怪物对这个女孩做了什么变态的实验，但他们一手缔造个了强大到他们无法控制的东西，让她被困在由她自己记忆所创造的地狱中，亦即这个她所在的让她不得不一次又一次地，从她一生最痛苦的经历中寻求微乎其微的慰藉的无尽层级。
//
//唯一让我欣慰的是她不再会遭受任何痛苦了。
//
//« Level 798 | Level 799 | Level 800 »
//
//
//作者/授权信息
//Footnotes
//1. 译注：此处Lexi即为文中的Alexander Horvat的别称。
package lvls7x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl799{}