//Level 797
//z3DAOci9fhpTvZ5.png
// Nd2GotAL59Exgrh.jpg
//一张关于Level 797林间道路的照片。
//
//Level 797是后室的第798层。是一条绵延的林间小径，此地所特有的可进入的石窟和洞穴，往往可从中前往其他层级。由于该层级是近期才发现的，所以相关信息较少。
//
//描述：
//Level 797看似是一条覆有大量植被的石路。正如上文所述，路边有数块岩石，部分岩石上有石窟，流浪者可以通过这些石窟前往其他层级。路边的森林茂密且缺少相关信息，最好避开以免受到植被可能产生的不利影响。
//
//Level 797并非无边无际，但仍广阔到超出目力所及。有流浪者报告称，路径似乎在移动，但这一点还有待证实。不管怎样，绘制该层级的地图是一项艰巨的任务，但如果想在该层级建立常驻的基地或是前哨站的话，这一工作是十分必要的。
//
//该层级存在和前厅类似的昼夜循环。气候常多云，偶有雾、风或雨。温度在14-20摄氏度之间。
//
//超限成功
//附录 2024/04/15
//沿着主路，可以找到几条备用路径。我们对它们所知甚少。报告称，这些路径通常在森林深处，或是在从主路外行进很长时间后的位置。这些路径被命名为“子路径”，似乎能够在森林中移动并消失得无影无踪，据称这些小路狭长，数量极少，而且上面杂草丛生，想要进入非常困难。
//
//2024？这本不该出现在这里……
//
//
//这条路上有一些值得注意的路标，在下面会一一列出。
//地标
//大坝：
//51112911050_0bb3d60922_h.jpg
//大坝的照片，通过围栏上的某个洞拍摄。
//
//这是一座看上去已经废弃的大坝，沿着主路一直前进就能看到。整个设施封闭，被金属栅栏围住，未经探索。因此我们目前不了解大坝的运行情况，里面实体或物体的存在情况，以及水的来源。
//
//超限成功
//附录 2032/11/01
//大坝是满功率运行的，为Level 797的各个定居点提供能源和灌溉用水。大坝中不存在任何实体，目前由#$%&#%…
//
//时空异常……我明白了。这很快就能解决，我对造成的不便表示歉意……看来不完人又在搞什么鬼了……
//
//林间前哨站：
//51112041333_6f5c084e10_h.jpg
//前哨站的唯一照片。
//
//一座白色平房，里面有两个房间，距离大坝约一公里远。这里有电力、饮用水和可用的家用电器，以及似乎是取之不尽用之不竭的物资。已发现的物资中包括：
//
//各类食物，如坚果、饼干、无商标的薯片和各种蔬菜。
//水。
//急救用品。
//钉子和螺丝。
//便利贴。
//工具。
//办公用品。
//乐器。
//画材。
//林间前哨站目前作为流浪者的休息场所使用。
//
//超限成功
//附录 2031/11/2?
//这座建筑是Albireo基地，天鹅座骑士团的第二个基地。
//
//海湾：
//海湾这一地点还未经证实，据传是位于路径的尽头。M.E.G.目前正致力于对其进行调查。我们对相关信息的缺失表示歉意。
//
//鎈噁�！轈氙*韡^成。?功
//附录 2033/08/∆¶
//路尽头的海湾。这里真是……太美了。你能听到海浪撞击下面岩石的声响，感受海风在你的脸上拂过……如此……宁静。
//
//51112046713_345f20b646_h.jpg
//这里多么静谧，为什么我们不把这儿探索一下呢？就你我二人？
//
//又来啊？可能是我安错了哪个齿轮……我可不能把自己工作搅黄了。
//
//实体：
//目前该层级没有任何记录在案的实体。
//
//ERROR
//附录 ERROR/00/00
//这里没人……真你妈谢天谢地。是时候切回去了。我得结束这一切。如果有人看到这些话……祝我好运吧。有了这个，我就可以改变这死寂的未来。命运的齿轮将得以再次转动。
//
//基地、社区和前哨：
//该层级没有已知的基地、社区或前哨，但基于其环境条件，在此地建立基地是可行的。因此有不少在Level 797建立基地的计划。
//
//超限成功
//附录 2031/06/27
//Albireo基地是天鹅座骑士团的第二大基地，其中容纳的成员数量不详。它位于林间前哨站。
//天鹅座骑士团乐于为每一位流浪者提供住宿和物资。
//
//落实到细节！为什么它还是不工作？是我算错了吗？还是齿轮安错了？活塞上压力太大了？那个天杀的齿轮哪儿去了……这下应该能解决问题……我真是受够这些鸡毛蒜皮。
//
//其他照片：
//显示图片
//入口和出口：
//入口：
//时候未到……滴答，滴答……
//
//出口：
//可以通过墙上的众多洞口离开该层级。每个洞都通向不同的层级。退出Level 797可前往的层级包括：
//- Level 10
//- Level 39
//- Level 75
//- Level 84
//- Level 134
//- Level 140
//- Level 155
//- Level 170
//- Level 300
//- Level 420
//- Level 480
//- Level 743 （未经证实）
//- Level 817
//
//出口列表尚在归纳中，还没准备好发布。我们对带来的不便表示歉意。
//
//EЯROR
//附录 ERROR/!-/~`
//这条路可以带你去任何你想去的地方，前提是你的心诚，你的意决。
package lvls7x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl797{}