//Level 714
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//
//Level 714是后室的第715层。也是最有趣的一层！ 它是一个成立于2000年6月29日大型录音室！
//
//graffiti.png
//看看这恶心的涂鸦！
//
//51119025272_aa8efb7180_m.jpg
//这里有更多！
//
//
//
//描述
//
//
//Level 714最引人注目的特点是其独特的外观：一个地下电台和录音室，一个看起来像从视频游戏中出来的像素风图形！令人遗憾的是，它没有在照片中显示出来……你能相信这个地方曾经是一个火车站吗？令人遗憾的是，它也没有在照片中显示出来……
//
//说到让这里焕然一新的东西，莫过于那些充满了时尚、鲜艳的色彩，以及炫酷的节拍和涂鸦。这些特征分布在录音室的墙壁、天花板，甚至地板上！ 像其他任何录音室一样，Level 714也挤满了电子设备：计算机、运行中的音频工作站、编辑软件和一大堆流行的音乐样片、话筒、话筒架、耳机、录音室监听器、扬声器，以及驱动上述电子设备的无限能源电力结构。简而言之，这里有你录音需要的所有东西，你可以在此制作出最炫酷的歌曲！
//
//从布局上看，Level 714由一个休息室组成，你将从那里进入本层级。它通向一个长长的大厅，两侧有门，你可以进入录音区和编辑区，这两个地方是Level 714不可或缺的灵魂之地！大厅的入口处甚至有“未来放克广播电台”的标志！
//
//77339959_39a2282c30.jpg
//放克贩子和他们的一些粉丝！不要问我们哪个是放克贩子，哪个是粉丝，我们也不知道……
//
//46148886084_b296810062_b.jpg
//独家披露！这里就是放克贩子制作音乐的地方！
//
//实体
//
//
//未来放克广播电台只有一个实体：放克贩子！
//
//他的外形是人形实体，其衣服、指甲、妆容和耳机上都具有鲜艳的色彩。你知道吗？这就是都市时尚风格！他有自己的行事准则，而且通常很有杀伤力！ 他一般在录制、编辑或创作最动听的时尚节拍后，供所有的听众通过他们自己的电台——未来放克电台收听！虽然他是非常有活力的实体，但未来放克电台播出的歌曲并非都是由放克贩子创作的。无论如何，你可以肯定的是，这些歌曲将震撼你一整天！
//
//不过，放克贩子的歌曲还有另一个作用。据说，在这些欢快的电子朋克歌曲的采样的歌词中，隐藏着一个预言——一个对未来的小预测。破译这些信息往往有点棘手，而且更多时候，这些信息夹杂着很多无用的干扰内容。不过说唱风格的歌曲有更详细、更容易破译的信息。因为这种类型的歌曲内容展现的更多的是歌词，而不是旋律。不是吗？
//
//虽然放克贩子很友好，但请不要在他的身边制造噪音，否则你会很有可能被他逐出该层级……即使你还是会被允许回到该层级。放克贩子将奖励那些尊重他们和他们的工作的人——专门为他们写一首歌。
//
//接下来，是由M.E.G.探险者和节目主持人菲斯-西尔弗松进行的采访的书面记录，在未来放克广播电台电台播出：
//
//隐藏
//FS——菲斯-西尔弗松
//TFD——放克贩子
//
//FS—直播正在进行。我是菲斯，我正在采访放克贩子——介绍一下自己吧！
//
//TFD—这里是放克贩子，我和我的好朋友菲斯正在进行一场全球首发的独家采访。
//
//FS - 那么，让我们开始吧。是什么让你创办了未来放克广播电台？
//
//TFD – 很简单的理由。曾今这里充斥着破旧的气息，让所有人都觉得很压抑，当时，我想到我可以好好的修复这里，让大家开心起来！。所以，每当你不开心的时候，你都可以在电台上收听最有趣、最生动的音乐，让你的血液沸腾起来！"。
//
//FS - 听起来是个很好的理由。你是从什么时候开始的？
//
//TFD – 我从2000年开始的。新的千禧年需要一些更潮流的放克风格，一些更潮流的歌曲，一些更欢快的节奏，你能理解吗？
//
//FS – 能理解。假设我想告诉一个朋友怎么来这里，我该怎么推荐给他？
//
//TFD—告诉他们，他们需要感受到这种“放克”力量，感受到直击他们灵魂的音乐。
//
//FS - 我明白了。现在，我知道你在这里演奏的大部分东西都是你自己创作的，你从哪里得到这么多歌曲的灵感？
//
//TFD - 嗯，有时候我只是随波逐流，写任何我能想到的东西，等着灵感进入我的脑海并击中我，然后把它变成一些特别的旋律之类的。我写的歌曲的主题，有些时候是关于我的一些好朋友或粉丝。又有些时候我只是想传播某个“信号”而已。
//
//FS - 我明白了。那你本人的风格又如何呢？你是那种很罕见的拥有如此独特魅力的人。
//
//TFD - 我认为我自己和我的曲子一样有活力，伙计。我是放克贩子，因此行为举止必须像个“大人物”才行。
//
//FS - 我真的很喜欢你的气质。
//
//TFD – 哈哈，谢谢。不过……是时候换我问你一些问题了，你不觉得吗？
//
//FS—我？什么？
//
//TFD - 角色转换！ 你是谁，你靠什么为生？
//
//FS—我是菲斯-西尔弗松，目前在M.E.G.和新视野组织工作。
//
//TFD - 在你来这里之前，你是做什么的？
//
//FS - 我是一名退伍军人，曾经以唱歌和弹吉他为副业。
//
//TFD—真不错，你想和我们合作吗？
//
//FS - 现在吗？我很乐意！
//
//TFD - 采访结束后。你能告诉我你在未来放克广播电台上最喜欢的歌是什么吗？
//
//FS - 我只能选择一首吗？如果只能选一首的话……那就是“彩绘墙-冲向法西斯”。但说实话，目前为止，还没有一首能让我不喜欢的歌。
//
//TFD – 哦哦！不错的选择，伙计！ 很高兴听到你喜欢我的歌曲。总之，未来放克电台，这里是放克贩子和信仰银歌的节目！接下来，我将播放一首我的新歌——"GET ENUF"。注意安全！
//
//
//采访结束！
//
//
//基地、前哨与社区
//本层级没有基地、前哨或社区，但这并不可怕，放克贩子喜欢与他们的粉丝见面！
//入口与出口
//入口
//要进入Level 714，请收听"未来放克电台"并让自己沉浸在音乐之中。
//出口
//走入Level 714尽头的一扇门，你将回到你进入的那一个层级！
package lvls7x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl714{}