//Level C-674
//
//（建议音量：20%—40%）
//
//评分: 
//+21
//+
//–
//X
//您有多久没有好好呼吸过了？
//
//我的朋友，我说的可不是普通的、仅仅只能维持生命的“呼吸”。
//
//能被我称作呼吸的，是可以从内而外净化灵魂的呼吸。
//
//如果您极度渴望这种呼吸，欢迎您光临绿色天堂！
//
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//level-c-674-picc
//绿叶们为您提供新鲜的空气。
//
//Level C-674 是后室C层群中的第674层。
//
//描述
//Level C-674 呈现为一处封闭立方体空间，地面面积为1平方米1其空间顶部被各种大小不一的绿叶遮挡，因此其高度未知。
//
//空间内部墙壁被浅绿色的纯色墙纸所覆盖，地板则直接为面积为1平方米的类瓷砖。据有限的报告称，该层级内的墙纸与瓷砖似乎都不会因任何外力施加或污染而产生形变或形成污渍，原因未知。覆盖在空间上部的绿叶种类不一，曾有流浪者试图采取该层级中绿叶的标本，但都因无法取下任何样本而以失败告终。
//
//该层级内气温保持在约23°C、湿度为45%—65%，且该层级内不存在任何除绿叶之外的生命体，以保证流浪者安心放松。据报告称，所有从该层级切出的流浪者都声称：
//
//“那是我去过的最舒服的地方。”
//
//故该层级被命名为:“绿色天堂”
//
//实体 引导者
//绿荫向导（The Green Guide）
//该层级的“引导者”，无可视形态，可对进入Level C-674的流浪者进行精神方面的引导。引导包括但不限于：
//
//以轻柔的女性声音给予流浪者正向引导，例如深呼吸、放松身体、清除杂念等。
//使流浪者在闭上双眼时，脑海中想象着一切美好的事物，但仅限于与自然、心理、灵魂等方面2。
//目前，“绿荫向导”已与M.E.G.达成合作关系，并且保证不会对任何进入该层级的流浪者造成任何形式的伤害。
//
//（注：“绿荫向导”似乎不喜欢我们称呼其为“实体”，且其不会对流浪者造成任何负面影响，所以我们已同意将其划分于“实体”概念之外。）
//
//我们随时欢迎您的到来
//欢迎来到“绿色天堂”！
//
//在这里，您可以尽情的享受人生中最美好的时光。呼吸新鲜的空气、欣赏洁净的绿叶、在这一刻钟感受无尽的精神力涌入脑海。
//
//现在，跟着我一起，轻轻的，闭上双眼……
//
//吸气……呼气……你听到了悦耳的声音吗？
//
//清脆的鸟鸣、潺潺的流水、还是轻拂的风声……
//
//吸气……呼气……让灵魂在一瞬间被洗涤。
//
//开心的事、不开心的事、全部忘记吧。
//
//这一刻，只有你自己，在世界的中心。
//
//……
//
//入口与出口
//入口
//在流浪者感到极度疲惫时，看到一颗长有绿叶的植株，尝试从该地切出，有小概率到达Level C-674。
//或尝试寻找M.E.G.相关负责人员，他们手中掌有如何自由出入Level C-674的方法，但因该层级特殊性质而不得公开。若你有合理的理由，他们会引导你进入该层级。
//出口
//若是通过绿叶切入该层级，则体验结束后会回到原来的层级3。
//若通过相关人员所掌有的方法切入该层级，则会进入Level 48。
//作者信息
//


//« Level C-673 | Level C-674 | Level C-675 »
//
//Footnotes
//1. 该层级为“绿荫向导”为了向疲惫的流浪者提供净化灵魂的呼吸所专创造的，所以空间内只需要能够站下一个流浪者就够了。由于M.E.G.可以自由出入该层级，所以可以保证每次进入该层级的只有1个人。
//2. 你觉得，在这样的自然环境下，去想象自己成为了后室首富，坐拥一切科技与信息资源，这合理吗？
//3. 为了限制该层级内的人数，当层级内已有流浪者在体验时，尝试切入将不会成功。
package lvls16x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1674{}