//Level C-680
//评分: 
//+40
//+
//–
//X
//忘川北溪在潮湿的雾气下显得朦胧而不真实，在云层间透出几缕黯淡的光，就像黑白胶卷相机吐出的胶片，深邃空洞让人发麻。寂静伴着忘川水流淌了数百年，最后顺着溪流渲染成一幅无声油墨画卷……
//
// 
//
//生存难度：
//等级 0
//
//安全
//稳定
//实体绝迹
//Level C-680是后室C层群的第680层，是一片由忘川水组成的海洋。
//
//描述
//image2.jpg
//Level C-680的摄影记录，Elena Bright摄
//
//Level C-680全部被液体覆盖，深度约为一万米，不存在原生的陆地，但各团体通过气垫等建立的临时居所仍能保证居住。层级内具有强烈的电子信号干扰现象，尚无法确认该现象的引发原因，无线电通话器在该层级几乎不可使用，大画幅的摄像机能够勉强保证轮廓清晰的常规记录。处于Level C-680较长时间可以帮助减缓思乡症带来的情绪低落症状，具体时间因流浪者个人体质而异，这一效应倾向于认为来自于层级本身而非忘川水，但鉴于相关实验资料较缺乏，不排除来自忘川水的可能。
//
//Level C-680内始终弥漫较浅的雾气，云长期聚集在层级上空铺开形成阴天气候，较暗的光从云层投下，自层级被发现以来没有观测到雨天，亦没有观察到云层散开的现象。Level C-680不存在一个明确的昼夜分界线，一切能够表示时间的工具在层级内都处于失效状态。层级内不存在原生的实体或生命体，这是因为忘川水本身不具有产生生命的性质，并已经确认无法支持生命正常存活。尽管不存在蒸发现象，但层级内的空气湿度常年保持在60%~75%之间。
//
//自层级发现后，后室的部分媒体对层级的报道具有一定误导性质，这使得大批流浪者涌入层级并将忘川水带离，这导致部分区域忘川水的污染现象，在相关禁令发布之后层级污染现象有所改善，但地下贩卖团体仍时常进入层级盗卖忘川水。
//
//忘川水
//jQmiI3oY.jpg
//特殊摄制的忘川水下
//
//忘川水是构成Level C-680的液体，常温下呈低透明度的黑色，其密度与常见状态下水的密度相当，不溶于水，支持燃烧。在2×103℃温度下会沸腾汽化，目前没有对其蒸发现象的相关记载，在层级内也无法观测到下雨状况。
//
//忘川水可以被人类饮用，并可能引起以情绪危害和精神退行危害为核心的认知危害效应。思乡症研究小组“君自故乡来”发布的报告称，经多次临床测试后忘川水被证实可以在一定程度上减缓思乡症的发病症状，引起暂时性的亢奋，亦会引发情绪低落以及其他心理忧郁症状，根据M.E.G.发布的《2021年后室心理健康报告》，忘川水的带入带离应该被严格限制以尽可能防止引发的药物滥用行为。
//
//基地、前哨与社区
//忘川舟楫社
//忘川舟楫社是一流浪者非政府结社，该旅游社出租付费的常规船只以及相关器具。忘川舟楫社的参与者大多为思乡症患者，其希望通过Level C-680对思乡症症状的减缓性质而对患者进行一定的医疗提供，结社的盈利被用于支撑“君自故乡来”的研究工作，反过来又作为“君自故乡来”身后的支撑组织。一般而言，忘川舟楫社只应进行简单的船只租借行为。但目前其已作为Level C-680最大的原生结社团体协助维护治安，惩戒地下组织的盗卖与污染行为。
//
//“君自故乡来”第一办公室
//x3jY4I.jpg
//第一办公室图片，摘自介绍页
//
//第一办公室有完善的水利设施以及生活循环装置，基于一大型商务船只改装。在紧急状态下的储备食物能至少保证一百人生活三个月，在忘川舟楫社提供的帮助下第一办公室建立起了合理的安保设施体系。
//
//介于思乡症逐渐演化为一个较大规模的后室疾病，各流浪者团体的研究工作者组建了“君自故乡来”研究小组，该小组现作为权威的研究小组进行对该疾病的研究、治疗与教育工作。“君自故乡来”下设位于Level 2的第二办公室和本层级的第一办公室。第一办公室负责疾病研究、医师培训及心理治疗与咨询，第二办公室负责其他的思乡症相关项目。“君自故乡来”小组主要由后室心理公益基金会、忘川舟楫社提供资金与技术支持，自身亦作为一个独立的研究小组进行独立的研究与帮助。
//
//思乡症
//思乡症是后室自2019年起逐渐出现的一类疾病的称呼，亦有学术文件将其称之为“属地情感障碍”或“前厅综合症”，该疾病通常表现为间歇性的情绪低落、认知能力下降、长久的意志活动抑制和疏懒。在躯体方面，患者表现为长期的乏力、失眠、月经不来潮、性欲消减，以及间歇性的心慌、虚汗、流鼻血与干呕。间歇性症状过去后患者能暂时恢复正常状态，暂无法找到复返的确切规律，较可靠的观点认为其反复的周期视患者而存在区别。
//
//药物滥用行为会对思乡症患者产生极大的危害，所以各方应做好协调做好药物控制。正规医疗集团不得私自生产或贩卖此类药物，个体患者亦不建议在无医师指导下购买此类药物或此类药物的等效药物。
//
//对思乡症的更多信息请参考此条目
//
//- 关闭资料[忘乡]
//本资料来源于“君自故乡来”的组长沈浅，受保护的公开，已经过本人授权：
//
//忘川在潮湿的雾气下显得朦胧而不真实，在云层间透出几缕黯淡的光，就像黑白胶卷相机吐出的胶片，深邃空洞让人发麻。寂静伴着忘川水流淌了数百年，最后顺着溪流渲染成一幅无声油墨画卷，我划着舟楫在忘川中摆渡，在压抑中沉默着。
//
//虽然是忘川，却总在前尘婉转停留。
//
//像那个阳光分隔开的午后，那个街道旁叫不上来名字的树垂下来树枝形成了的阴凉处，那个小卖铺门口模糊且摇曳的摇椅。只是这么久过去了，那群在忘川挣扎的人，也应当不只活在过去。
//
//我小时候曾度过一段美好的童年时光，那时候所有人都还在，似乎日子只像这忘川的水一样不分昼夜的流淌，人群也好似雾气般熙熙攘攘。不过那段时光还是有些区别，忘川一望无际水势平和，而童年却一眼就能看到尽头。
//
//忘川的压抑很容易让我联想到与之相同压抑的中学时代，童年之后，凌辱与嘲讽开始慢慢入侵儿时我那个还在童话中的世界，没有被救下来的精卫却也没有选择填海，而是依旧处于沉默中，这种沉默那时没有爆发，直到现在也没有。我那时的想法很简单，我想离开那个地方，虽然那里并不是什么偏远山村，但我仍然想离开家乡。我想考出去，考的越远越好，再也不回去。
//
//人就是这样一种有着矛盾情感的动物，三年之后，我又回到了故乡。
//
//我本痛恨故乡，但如今却想念，大概我的确是走出阴影了。我回去的时候，也是午后，透过窗户已经可以看到街道与楼市，阳光在浮云里若隐若现。那是我最后一次见到我的家乡，在那之后我就来到了后室，同种种不可名状之物共同生存着，在荒谬与疯狂中寻找一丝平静的生活。
//
//思乡症与人类共生，就像人类与忘川共生一样，它流淌在每个人的血液中，呼唤着他们回到自己所诞生的那片土地上。
//
//忘川依旧平静无波澜，我放下船桨，倚在木舟头。热风混着雾气在我身边萦绕，忘川对我耳语道：
//
//“你是忘川北溪的一滴水，你要回去”
//
//入口与出口
//入口
//在Level C-630被净尘水吞噬有概率切入本层级
//如果Level 432窗户呈深灰色，打破窗户即切入本层级
//出口
//跳入水中将切出至Level C-630
//闭目冥想Level 1的画面将切出至该层级。
//手持《望乡旅馆介绍及守则》并闭目冥想将切出至Level C-255
package lvls16x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1680{}