//Level C-601
//评分: 
//+11
//+
//–
//X
//
//
//
// 
//
//生存难度：
//等级 5
//
//不安全
//空间迷离
//存在强大实体
//
//Level C-601是后室C层群的第601层。
//
//描述
//IMG-20220814-145803.jpg
//纽萨姆孤儿院
//
//Level C-601整体上是一处被森林所包围的平地，平地面积约为3平方千米，该层级整体上被一层无阻碍的薄雾所覆盖，过多吸入这种薄雾会使流浪者抑郁，这种负面效果可以用杏仁水来缓解。空地周边的“黑森林”已被M.E.G总部判定为不可探索的区域，“黑森林”和空地之间的空间异常现象导致人类无论以任何方式接近“黑森林”，“黑森林”总是与人类保持一定的距离。Level C-601不存在昼夜循环，其天气自层级被发现以来一直维持在阴天时刻，透过相对较薄的云层，该层级的天空可以观测到两个月亮，但该天体是否存在于层级本身内尚不明确。与“黑森林”相比，“树林”是流浪者可以随意进入的地方，它似乎象征着“黑森林”与“平地”的分界线。在广袤的树林里分布着些许随机生成的路径，纵横交错甚至是毫无意义的路线通常会导致流浪者失去方向感，越过路径直接穿过树林的行为也是不可取的，这反而会加深该层级赋予流浪者的负面效果。
//
//令人毛骨悚然的是，在Level C-601雾气较浓的时期，多名流浪者目击到有未知人形实体在雾气中发出凄厉的尖叫并高速奔向“黑森林”，那些实体无一例外从孤儿院的方向奔来。处于该种极端天气下，仅有一名流浪者看清了该类实体的容貌，它们身穿人类衣服但略显破旧，身体瘦削，在裸露的皮肤处可以清楚的看到淋巴肿块以及大面积的黑斑，此种样貌与欧洲中世纪流行的黑死病症状十分吻合。另外，中世纪的“鸟嘴医生”有时会在“黑森林”地区被观测到，它们在浓雾地区或上述未知人形实体活跃期的出现频率最高，“鸟嘴医生”有能力在平地和“黑森林”二者之间自由穿梭，如果流浪者遇到了“鸟嘴医生”，请不要尝试与其交谈或做出攻击行为，目前没有任何一份报告反应出做这些事的后果。有流浪者报告称他们在浓雾地区经常感到头疼、乏力，更有甚者出现了呕吐、皮下出血、呼吸空难等症状，而这些报告者无一例外消失在了本层级或在同伴的不经意间失踪，经M.E.G相关部门检测，Level C-601的雾气中含有大量鼠疫杆菌的芽孢，但不知为何这些芽孢只有在浓雾地区才会被激活。离开该层级的流浪者，其体内残留的芽孢也会消失，为此我们不建议流浪者在Level C-601久留。
//
//灰烬庭院
//孤儿院周边的环形区域，面积约为5平方千米，是流浪者前往孤儿院的必经之路。该区域的地面上覆盖着一层疏松的物质，其成分的检测结果为某种动物的骨灰。对于流浪者而言，灰烬庭院是Level C-601中最安全的区域，尽管被风扬起的灰尘会给流浪者造成困扰。与孤儿院老旧的外表相比，该区充斥着现代化的游乐设施，这些设施无一例外都受损严重，坐在游乐设施上的流浪者会被传送到未知地点。有“孤儿”乘坐的游乐设施会重新活动起来，原理不明，但不建议流浪者在这种异常情况下靠近它们，以免遭受游乐设施的攻击。
//
//该区域的地表零碎生长着白桦树，经研究发现，这些白桦树有很大可能是动物而并非植物，将耳朵贴在树上倾听内部声音，流浪者将会听到沉重的心跳声和窃窃私语声。白桦树会对外界刺激作出反应，试图砍伐白桦树的流浪者会被传送到生存难度系数4以上的层级。在该区域所有曲折的路径将会笔直通向孤儿院的正门，当沿着小路行进时不仅会看到白桦树，同时也会在远处看到具有违和感的建筑物，最先会遇见的建筑物是谷仓和马厩。这些建筑物的内部通常是空的，在其中漫游过久会将流浪者传送至本层级的任意位置。
//
//孤儿院
//在本层级空地的正中央屹立着一座大型废弃孤儿院，总占地面积约为2630平方米，其装修风格类似于中世纪晚期，建筑物外部墙皮老化，有很大可能会高空坠落砸中路过的流浪者，破碎的窗户里时常传出孩子的哭泣声，流浪者不应过多在意窗户，否则望向窗户会不可避免的与趴在孤儿院窗户上的实体“孤儿”发生目光接触，该行为通常会导致流浪者重温童年的心理创伤从而患上精神疾病。孤儿院具有特殊的失色效应，其周边的一切事物似乎是蒙上了一层灰色的阴影，由外向内失色效应造成的影响逐渐加强，失色效应给流浪者带来的负面影响不限于干扰视觉，在污染严重区黑与白的纠缠容易引发空间扭曲现象，流浪者会在不知不觉中被拉入危险区域。
//
//home-2662965-340.jpg
//腐朽的走廊
//
//孤儿院内部是一处巨大且持续延伸的非欧几里得空间，大部分地区的地板被不可抹除的阴影所覆盖，接近地板的墙面更加肮脏，随机排列的门和窗户时常将流浪者导向本层级的另一个未知地点，或是致命的Level 1.5。流浪者在探索孤儿院时可能会遭遇不同种状态的特殊房间或走廊，以下是
//收起
//▲ C601-001 “玩具房”
//该房间表现为一个颇有hellokitty风格的儿童卧室，但其异常之处在于房间内部所有的物品皆是由塑料制成的，经进一步探索证明，该房间具有治疗精神疾病以及逆转悲尸循环的功效，流浪者可在此处稍作歇息稳定心神。值得注意的是，该房间周边的窗户在正常状态下是紧闭的，在极少数情况下窗户会被打开，邻里守望会从窗户外部观察房间内的情况，被发现的流浪者不会被当场处死，3~5秒后房间会发生大幅度倾斜，流浪者有可能会从该房间的窗户跌出并切入Level 18、Level 151、Level C-418或Level C-311。
//
//
//▲ C601-002 “血肉走廊”
//该区域在普通走廊的基础上覆盖了一层厚厚的血肉，肉壁在受损的情况下流出的液体并非是血而是樱桃汁，饮用这种腥味极重的樱桃汁可能会导致心跳加速和神志不清。牧蛇经常盘踞在该区域，牧蛇的爬动和流浪者的大幅度动作会促使肉壁分泌出黏液，它使得流浪者在该区域的移动变得举步维艰，但对牧蛇来说，这种黏液是绝佳的润滑剂。与此同时，肉壁毫无规律性的浮动也可能会导致流浪者摔倒。在该区域生存一段时间后，流浪者有可能会遭遇“血海啸”，该事件表现为大量樱桃汁从未知地点如潮水般涌出，与此同时，所有盘踞在此的牧蛇皆会消失，流浪者可以在这之后尝试寻找区域出口。
//
//
//▲ C601-003 “潜伏”
//该区域表现为一条缺乏光源的笔直走廊，走廊两侧的墙壁上附有随机排列的窗户和门，其透射出的光芒对流浪者有某种心理上的吸引性。窗户和门是导致该区域流浪者死亡的主要因素，从窗户或门窗所观察到的景象对于流浪者的精神具有严重危害性，根据幸存下来的流浪者报告，其景象内容通常为以人类为主的活体献祭或解刨实验，这会诱发流浪者陷入极度的歇斯底里并会使受影响者发出尖叫。而一旦有人或任何外部声源发出声音，某种无形的力量会将流浪者拖入窗户或者门内，后果未知但推测为死亡。更糟糕的是，该区域具有较为特殊的“Level C-9”效应，流浪者在穿越走廊时有可能会幻视出某种实体或怪物，若流浪者没能在第一时间内回复冷静，则幻觉将当场成真并无法撤销。因此流浪者在该区域的行为准则应遵循如下三条：
//1.不要试图去看到窗户或门窗内的景象。
//2.匍匐前行，注意周围障碍物，不要发出太大声音。
//3.如果流浪者看到怪物，请一定要迅速闭上双眼并在脑海中多次强调它只是幻象。
//
//
//
//与某些会大量刷新物资的层级相比，Level C-601的资源显得极其稀少，但在孤儿院内部，流浪者可能会遇见稀有物资甚至是未被记录在案的物品，为了确保流浪者安全，请勿擅自使用能力不明的物品，并把它第一时间交给M.E.G总部。该区域最常见的实体为“孤儿”，在极少数情况下，你会遇见“黛西”。流浪者穿梭孤儿院时应尽量避免接近黑暗的角落或走向奇怪的路，“院长”很有可能潜伏与其中。
//玛丽小巷
//玛丽小巷是传说中未经证实的神秘区域，该区域表现为一条纵深的石道，石道两侧高耸的建筑似乎将与阴云相触，晦暗的石墙自带一股肃杀之气。这里缺少光源，只有几盏寥寥无几的明灯照亮着废弃的楼房。该区的楼房绝大多数都不可进入，上锁的房间经常传来人类绝望的呻吟声和哭泣声，行走中的流浪者有时会感觉有东西抓住他们的脚踝，但该种现象不会对流浪者造成实质上的伤害。流浪者可在石道上碰见游荡的“鸟嘴医生”，此时行色匆匆的它们通常不会对流浪者做出任何反应。据说，如果流浪者深入该区域，便可在一栋未上锁的建筑中发现一个特殊的破损卧室，它被叫做“珍妮的房间”。该房间的各个角落里堆满了洋娃娃等可爱的物品，如果流浪者把身上携带的自认为“最可爱”的东西献给这个房间，那么流浪者将会被传送到C层群的任意一个宜居层级。
//
//实体
//“孤儿”
//“孤儿”外表为3～15岁的未成年人类，其躯体上部被无形态的灰色阴影所覆盖，因此无法通过肉眼观察到该实体的具体样貌。“孤儿”在一般情况下不会轻易攻击流浪者，但该实体的精神状态很不稳定，一次意外的触碰可能会成为流浪者被攻击的导火索。请勿尝试攻击孤儿，这会导致流浪者周围“孤儿”的行为变得与笑魇无异。对于该实体最佳的应对方案是尽量避开，如果有“孤儿”与流浪者互动，流浪者应站在距离实体不少于3米的地方与其交谈，像哄孩子一样说些好听的话，该实体有可能会将你引向安全的道路。在后室死去的孩子有可能会以该实体的形式出现在孤儿院，其至亲之人可透过灰色阴影认出他们的孩子，经相关检验证实，“孤儿”无法通过层级出口离开Level C-601。
//
//“黛西”
//“黛西”的外表为13～15岁的人类少女，其具体样貌与穿着无法被描述，任何尝试描述“黛西”样貌的流浪者将会被传送到该层级。“黛西”会排斥闯入孤儿院的流浪者并将其以粗暴的方式赶出孤儿院，但“黛西”对待孩子的态度总是亲切和温柔的，她会尝试与孩子玩耍并将孩子领到该层级的出口，同时“黛西”不会攻击与“孤儿”关系亲近的流浪者。
//
//“院长”
//IMG-20220815-153439.jpg
//“院长”发动攻击的前兆
//
//极度危险的强大实体，其外貌被描述为隐藏于一团黑雾之中的空洞人脸。每当“院长”逐渐接近流浪者时，流浪者周围的景象会呈现出一种“高度曝光”的异常变化，“院长”似乎拥有扭曲空间的能力，他会尝试将流浪者前方的道路转变成一个死循环或将道路的方向通向自己的所在地，离“院长”越近的流浪者越难以逃脱。“院长”的攻击方式是将流浪者身边的环境“曝光”至界限分明的黑与白，在黑色现实与白色现实的强力撕裂中，流浪者会被碾成齑粉。“院长”与“黛西”似乎处于敌对关系，被“院长”跟随的流浪者遇见“黛西”后会更容易逃脱。
//
//“鸟嘴医生”
//该实体与前厅中世纪的鸟嘴医生的外貌别无二致，它们拥有自由穿梭于森林与平地之间的能力，对流浪者无明显敌意，我们也不推荐流浪者与其发生冲突。
//
//“艾迪”
//仅有一次位于本层级的目击记录，其外貌表现为兔头人身，具体信息不明。
//
//基地、前哨和社区
//由于建立在该层级的基地的人员经常集体消失的原因，本层级现没有已知的基地、前哨和社区。
//
//入口和出口
//入口
//在Level 18进入一扇标有“纽萨姆孤儿院”的大门便可来到本层级。
//在Level 49的战壕中找到一个装有儿童套餐的餐盒并吃下其内容物会被传送到该层级。
//在Level 87中遇见一个掩面哭泣的小孩，触碰他你将会来到这里。
//在Level C-28.1中举行山魔王仪式的人会被传送到该层级。
//在任意层级中捡到一封有关儿童的寻人启事1会被传送至Level C-601。
//出口
//在区域C601-001从该房间的窗户跌出会切入Level 18、Level 151、Level C-418或Level C-311。
//进入受到实体窗户影响的窗户和门会进入Level 1.5。
//在本层级的任意位置发现一封孤儿收养信会被传送到生存难度为1级及以下的随机层级。
//作者信息
//
//« Level C-600| Level C-601 |Level C-602 »
//Footnotes
//1. 寻人启事通常为显眼的红纸黑字，且纸上的人脸被灰影覆盖难以识别。
package lvls16x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1601{}