//Level C-600
//评分: 
//+26
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
//介稳定
//少量中立实体C-600A.jpg
//Level C-600一处走廊。
//
//Level C-600是后室C层群的第600层。
//
//描述
//Level C-600是一处夕阳下的无尽走廊连楼，其形状类似于前厅“古罗马斗兽场”，本质由多个走廊组成的高楼拼合而成，凭借肉眼无法看清这些大楼的底部，更无法直接通过大楼内部走到底部1。本层级为非欧几里得空间，尽管看上去楼层之间错综复杂，但倘若在该层级内的任意单层走廊直线行走，流浪者总能回到流浪者来到该楼层时的起点。试图跳出走廊的廊洞将会使流浪者在自由落体2到24小时后切入另一个不稳定的层级当中，由于过快的重力加速度，触及其他层级的固体地面时，流浪者很有可能会摔得粉身碎骨。
//
//Level C-600的楼层虽然没有底部，但却存在许许多多的顶端和架空层。尝试在架空层探索偶尔会发现一个奇怪的门，虽然此门无法打开和破坏，但总会有一副自然生成的诺克立普贴在该门的不远处，借助该物品可以实现对该门的单次穿越。其内部景象通常为一个空荡的房间——或者说是用于囚禁流浪者的牢笼，但也有例外情况2。
//
//虽然Level C-600常年处于清晨时刻，但其内部温度却十分不稳定，阳光会从云层当中间歇性的照射在某些大楼的表面，使得该区域气温迅速上升3，有记载以来，被照射的区域温度普遍上升至75℃以上，其中甚至还出现过140℃极端空气气温的情况。因此，若流浪者遇到太阳光直射现象，一定要尽可能迅速的找到掩体，防止烧伤。
//
//Level C-600由于其配色与Level 0高度相似，故有流浪者称呼其为“副0”，并带有一种别样的情愫，努力在此层级内建立稳定的基地。4经过一段时间的发展，由于Level C-600得天独厚的太阳能源条件，有许多大功率太阳能和热能发电装置在此处被安置，并用于掩体内的幸存者的日常生活，随着社区规模的不断形成，已有部分友好合作的组织加入了Level C-600并开启了各类贸易。
//
//门的特例
//C-600B.jpg
//由用户u/Meauz33k1传回的图片。
//
//在切入位于架空层的门之后，用户u/Meauz33k1并没有锁死在房间当中，而是来到了一处开阔的天台上，虽然天边仍然直射着耀眼的阳光，但其散发的热量却异常微小，甚至不能使金属制的天台产生任何发热的迹象，触碰这些栏杆反而让这位流浪者产生了一丝凉意。
//
//沿着天台的楼梯上行约20分钟，出现了第一个门。该门由红木所制，极其坚硬，但能通过门上的猫眼看到其内部的景象——一个昏暗的酒店走廊。紧接着，在向上行走10分钟后，又一扇沉重的铁门出现在了墙边，其中还用红色油漆喷上了大大的“EXIT”字样，但由于其内部无法观察，故该位流浪者选择了继续上行。终于，在行进了1个小时后，已经出现轻微脱水症状的他终于走到了阶梯的尽头，一扇标有橙色霓虹灯的防盗门正半掩着，似乎一推就能打开。最后，这名流浪者穿过这扇门到达了Level C-70的一处无人的街道当中。
//
//基地、前哨与社区
//幸存者组织
//由163名中立的流浪者组成。
//会与表现出善意的流浪者交易。
//不欢迎新的流浪者加入他们。
//M.E.G.六零零站点
//由30名士兵组成。
//配备有武器和物资，乐于救助需要受到保护的流浪者。
//很少出没于流浪者集市。
//B.F.P.F. 003中转站
//由约两百人组成，其中半数为武装人员。
//创办并管理流浪者集市。
//为B.F.P.F.在此层运送物资提供保障。
//对待流浪者态度友好。
//后室娱乐2K宣传点
//无人类，均由数名新品推荐员和娱乐清扫者组成。
//通过改装后的太阳能接收装置储存维生能源，
//偶尔会在出入口附近推销关于后室娱乐的商品，并鼓动中立流浪者加入“后室娱乐”。
//入口与出口
//入口
//在Level C-126的第600号车厢中切出即可到达本层级。
//在Level C-386阅读一本黄色封皮的书会被传送至本层级。
//位于Level C-451的一面刷有黄色油漆的墙会在流浪者接近后将其主动拉入墙壁当中，之后流浪者便会来到本层级。
//据某些流浪者口述，穿越Level C-599的“边界”可来到本层级，然而此说法尚存疑。
//在Level C-offee中点一杯奶啤并喝尽后，穿过幕墙即可来到本层级。
//出口
//从某些楼顶切出，总会掉入Level C-126的第599~609车厢内。
//穿越架空层的门，登上天台的顶端并穿过一扇防盗门，即可到达Level C-70
//作者信息
//« Level C-599 | Level C-600 | Level C-601 »
//
//Footnotes
//1. 根据流浪者所述，每一栋楼似乎根本不存在底部。
//2. 已记录在该档案的后半部分。
//3. 有可能是因为直射的紫外线光并没有受到大气层的阻隔。
//4. 有流浪者声称，这是因为他们要把在Level 0失去的居住权利“扳回来”而做的斗争。
package lvls16x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1600{}