//Level C-647
//
//评分: 
//+18
//+
//–
//X
// 
//
//生存难度：
//等级 2
//
// 
// 
//大量实体
//Level C-647是后室C层群的第647层。
//
//Z6lHA6.webp
//Level C-647的鸟瞰图，由M.E.G的无人机拍摄。
//
//描述：
//Level C-647是一座面积约为一万平方公里的城市。该层级温差于2℃～25℃之间，气候为地中海气候。拥有周期为10小时的昼夜循环，但在夜晚时分，天空中仅可观测到月球这一天体，无季节更替和天气变化。
//
//该层级中具有正常的水电供应，在月亮升起时街上的路灯和霓虹灯将会自动亮起，太阳升起时则会自动关闭。且具有较完善的城市设施，如超商、学校、警察局、工厂、游乐园、图书馆、公交车站、地铁站、机场、图书馆、公共卫生间1、医院、餐厅、停车场2，应急避难所，加油站3等前厅中的常见设施均可以在此找到。该层级大部分建筑均可以进入，但内部结构大多反常或没有内部设施；小部分建筑物的门窗被上锁，或是没有安装门窗；部分建筑物的风格与现代城市主题的风格不符。下文列出部分值得注意的建筑物和标志。
//
//- 收起
//塔
//位于Level C-647的市中心，为该层级最高建筑物。类似于中世纪欧洲塔楼，有着圆柱形塔身和锥形塔顶，塔身由混凝土浇筑，塔基则由圆石围成，塔身上开有小窗，以便阳光透进。现代建筑学无法解释它的组合原理和构造方法。尚未知其作用以内部结构，因为所有尝试进入高塔内部的行为都失败了。上写有“这里危险”、“别进去”、“不要靠近！”等标语。走近此建筑物时会使流浪者感到强烈不适，不推荐流浪者在此附近停留。
//
//石灰墙
//位于Level C-647的最西侧，为一堵高大的石灰墙，墙上画有涂鸦，目前可辨认的涂鸦有
//
//这里并不安全
//沿着箭头走！
//我什么都听不见？
//一幅画有一个长有翅膀，龙角和龙尾的人，头被砍断，面目狰狞，疑似与龙血族有关。
//一群红衣人追逐着一金色瞳孔女孩。
//一张中式古典小亭的设计蓝图。4
//我讨厌你们，别过来！！！
//尚未知留下这些标语的人是谁，石灰墙上的涂鸦经常被修改，建议流浪者不要在石灰墙上留下痕迹。
//
//
//安全出口标志
//安全出口标志是随机存在于Level C-647中建筑物的墙壁上的标志，其一般模糊不清或位于不显眼的位置。经验证其通常指向该层级的出口，推荐流浪者进入该层级后跟着安全出口标志走，以便快速寻找出口。
//
//
//Level C-647内所有实体都受到“十一层效应”影响，常见实体有无面灵，清道夫和猎犬。该层级中的窗户失去其特性，与普通窗户无异。居民区和办公区为无面灵的聚集场所，这里的无面灵的穿着打扮均与前厅居民相似，且会像前厅居民一般早上去工作场所进行“工作”；傍晚回到居民区中休息。而清道夫行踪不再隐秘 ，会在凌晨进行清洁工作，工作效率相对于普通清道夫而言较高。马路上会随机出现驾驶无牌车辆的无面灵，在路边挥手可以使驾驶出租车的无面灵停下来。幼年无面灵通常穿着类似于中学生的校服，并会在成年无面灵的陪同下或是成群结队地进入学校。猎犬的外貌会更加接近于前厅中的宠物犬，行为也像普通家犬一般温顺，可以对其进行抚摸等行为。
//
//在该层级中，Wi-Fi覆盖全境，且密码设置的较随意，5在餐厅等建筑物中可以在墙上发现用端正的字迹手写Wi-Fi的密码，尚未知道是何人书写。在大型超商等建筑物中可以找到杏仁水和罐装龙肉，在五金店中可以发现火盐和常用厨具。医院和应急避难所中可以找到急救包和常见药品6，在高档酒店等建筑物中甚至可以发现皇家口粮。工厂等场所中可以发现黄铁矿，铜，银，部分稀有金属，纤维，塑料，石油，煤炭，沥青，火盐，枪，冷兵器等物品。书店中可以寻找到常见工具书与世界名著。7
//
//喧寂效应
//喧寂效应是存在于Level C-647的一种特殊效应，在该层级中，流浪者无法听见层级中任何的声音，包括流浪者自己的声音。但流浪者会出现听到噪音时出现的生理不适感，该症状分为三个阶段。
//
//第一阶段 约进入该层级一小时后出现，探索过该层级的流浪者将其描述为“像是心中多了一团乱麻”。在此阶段中，服用杏仁水可有效减轻该症状。
//第二阶段 约在进入该层级一个半小时后出现，流浪者会出现头晕，胸闷，恶心，浑身乏力等症状，建议流浪者在此阶段来临之前寻找到出口并离开。
//第三阶段 约在进入该层级两小时后出现，在此阶段中，流浪者会出现腹痛，呕吐和精神崩溃等症状，杏仁水的作用在此阶段微乎甚微。若继续在该层级中停留会导致流浪者昏厥，醒来后会发现自己被传送到了其他层级，尚未清楚是流浪者昏厥时导致的切出还是该层级的特性，但是介于喧寂效应会给流浪者精神上带来不可磨灭的影响，不建议流浪者长时间的停留于该层级。
//基地，前哨和社区
//M.E.G.“噤声者”无人基地
//因“喧寂效应”的存在，无常驻人员。
//位于Level C-647西侧居民区的一座低矮的黑色平房中。
//基地中有杏仁水，罐装龙肉等补给。
//墙壁上记录了该层级的部分Wi-Fi密码。
//入口和出口
//入口
//Level C-647有且仅有一个稳定入口，因其他方式进入此层级均为意外切入
//
//闭眼跳入Level C-98中的“井口”，并在下落过程中想象一座繁华的城市，睁眼时会落在Level C-647的一片小池塘中。
//出口
//沿着层级中的安全出口标志探索可以来到一扇用喷漆书写的“GETOUT!!!”的大门，推开大门可以到达Level C-67，这是最稳妥也是最推荐的离开方式。
//在火车站中乘坐一列黑色列车有概率来到Level C-990。
//在该层级中一名为“乡村公路”的道路中行驶会来到Level C-511（不推荐）
//因上文中任意原因而晕厥后会被送到C层群任意层级。（不推荐）
//
//
//检测到特殊权限，是否展开加密文档？
//
//Level C-647
//
//评分: 
//+18
//+
//–
//X
// 
//
//生存难度：
// 
// 
// 
//Level C-647是后室C层群中的第647层。
//
//描述
//经克西博士确认，Level C-647中居住着龙血族成员殆格玛（ ϝ ），殆格玛在龙血族中的顺次不详，但至少在克西之前。因不服从欧米伽的命令而被除名。目前得知殆格玛有着创造和破坏建筑与控制感官的能力，距本人称在龙血族中实力排行较为靠后，对流浪者没有敌意。
//
//殆格玛的外貌为一名棕发蓝瞳的欧洲男性青年，一般身着风衣和围巾，会在大街上游荡。因此经常被错认为流浪者，有目击报告称他可以不借助任何外力在建筑物间自由的穿梭和轻易杀死猎犬群。遇到流浪者时，殆格玛会转身离开或者用钝器击倒流浪者，将其送出Level C-647。
//
//经确认，Level C-647中的手写的Wi-Fi密码，石灰墙上的涂鸦，建筑物上的安全出口标志均出自殆格玛之手1，该层级中的部分建筑物也出自其手2。据其自述，殆格玛将Level C-647视为自己的家。且不喜欢其他人进入。喧寂效应实为殆格玛驱赶流浪者的手段，受到喧寂效应影响而昏厥的流浪者也被殆格玛所送出此层级。殆格玛同样对龙血族内部颇有微词，但目前无与M.E.G.等组织合作之意。
//
//受殆格玛本人之意，应避免切入Level C-647与其接触。
//
//附录
//- 收起
//交涉地点:Level C-647中心的塔附近
//
//交涉人员：“克西”
//
//交涉对象：“殆格玛”
//
//（克西在塔附近探索，殆格玛出现在克西视野中）
//殆格玛：“你好，克西。”
//
//克西：“你是？”
//
//殆格玛：“殆格玛。”
//
//克西：“殆格玛？难道你是...”
//
//殆格玛：“我应该是你的哥哥？不重要。”
//
//克西：“那你为什么会出现于此？”
//
//殆格玛：“我为什么不应出现在此？这里是我的家，我的净土，我的乌托邦。这些词还是我从人类那里学来的。”
//
//克西：“好吧，殆格玛，那我可以请你透露一下这里的一些情况吗？”
//
//殆格玛：当然可以，我很乐意，但是你必须答应我一件事。
//
//克西：“请说。”
//
//殆格玛：“让你们的人少来这里打扰我，好吗？我不太喜欢外人随意闯入我的家。”
//
//克西：“我会和上级请示的，所以…你可以先透露一下这座塔吗？”
//
//（克西指了指高塔）
//
//殆格玛：“哈哈哈哈，这只是我嫌弃这里空荡荡的而随意创造出来的罢了。”
//
//（殆格玛挥了挥手，塔轰然倒塌，他又握紧拳头，塔又恢复了原状。）
//
//克西：（鼓掌）真厉害，这就是你的能力吗？随意创造出建筑，夸你是后室中最厉害的建筑师也不为过。
//
//殆格玛：哈哈哈，艾普西隆那小子早就这么称呼过我，不过我还有其他能力。
//
//克西：什么能力？方便说一下吗？
//
//殆格玛：我觉得你已经猜出来了，克西，你是个聪明人。你是不是早已怀疑，为什么你在此刻可以听见我的声音，按理说你不应该受到喧寂效应影响吗？
//
//克西：“难道说，喧寂效应其实…”
//
//殆格玛：“对，准确来说是控制感官的能力。你们所说的喧寂效应其实是我用来驱赶来这里的人的手段。说实话族里还有比我强多的了，我的综合实力还是挺靠后的。”
//
//克西：“那么，我就直接问了，你为什么离开父亲？”
//
//殆格玛：“离开老东西？那我想先问问你为什么离开他，我觉得我们的理由都大同小异，肯定是因为受不了他呗。老东西动不动就发动战争，正巧我讨厌战争，在我这两群猎犬打架都不允许。加上老东西让我干这干那，我讨厌被人当狗使唤，于是我就不听他的话直接走了，和你们差不多吧。”
//
//殆格玛：“百足之虫，死而不僵。龙血族内部看似牢不可破，实则早已众叛亲离。即使是还留在族里的兄弟姐妹，还有几个和老东西一条心？老东西早就是孤家寡人了。”
//
//克西：（正色）那你在这里的目的是什么？
//
//殆格玛：“没有目的，我只是想逃避老东西和人类而已。我喜欢城市，所以我就逃到这里，当这里的主人”。
//
//（殆格玛停顿了一下）
//
//殆格玛:说实话，我羡慕你们，我羡慕你和德尔塔敢公然离开老东西投奔探险者总署，我羡慕派和舒敢创造自己的子民和王国，我甚至连像艾普西隆那样虽然对老东西颇有微词但还能老老实实待在老东西手下的脾气都没有。
//
//克西：“……”
//
//殆格玛：“我向往层群I，但是西格玛的下场告诉我意志是不可忤逆的。我向往前厅，但是那么多人类的努力都无法寻找到前厅的入口。艾普西隆说的没错，我们只是从一个牢笼杀到另一个牢笼里而已。后室就是牢笼，我们只是牢笼中可怜的困兽罢了。”
//
//克西：“没错，意志之下我们连层级I都去不了，父亲仅仅是用杀戮来试图违抗意志罢了。”
//
//殆格玛：“刻普帕来找过我，想和我一起合作对抗老东西，但是我拒绝了。我曾经也想谋权，但我已被除名，现在我已无心参与，何况大洪水要来了。”
//
//克西：“大洪水？你也知道了？”
//
//殆格玛：“约塔也来找过我，奥密克戎给的口信，我不知道我应该怎么做，也许大洪水不会影响到我，我不确定。”
//
//克西：“大洪水…那如果它真的来临，你会怎么做？”
//
//殆格玛：：“走呗…我哪有那个实力和大洪水对着干，虽然这里是独属于我的世界，但还是小命更重要。”
//
//克西：“（叹气）祝你好运。”
//
//殆格玛：“到时候再说吧。我已被除名，关于龙血族的事情我知道的和你们差不多，为了自保关于我本身的事情我无可奉告。就此告别吧。不过，有一些藏在心底的话，我想和你单独说。”
//
//殆格玛：“天地不仁，以万物为刍狗。龙翼之间，月色皎洁清明，太阳照常升起，龙潭水深险恶，但在意志之下，都是沧海一粟罢了。我最担心的是，龙血族的未来究竟是什么样的，当龙血族与其他组织发生不可避免的碰撞时，我们应如何应对？意志真的会放任我们随意驰骋于后室中吗？”
//
//克西：“或许不用这么悲观，我和德尔塔在M.E.G.其实也待的好好的，虽然意志是个沉重的话题。”
//
//殆格玛：（摇头）“非我族类，其心必异。曾经与人类的接触使我不敢相信人类，说这么多我只想告诉你，当我的疑问出现之时，明哲保身是最重要的，克西。这是我最后一次以哥哥的身份和你说话，也转告德尔塔，保护好自己。”
//
//克西：“嗯…我明白了，先告辞，祝你好运。”
//
//殆格玛：“嗯，后会无期。”
//
//（记录结束）
//
//
//通过殆格玛我们获得了关于Level C-647的部分信息，因其本人要求，我们会在非必要情况下与其避免进行接触。但在可预见的未来中我们会争取与殆格玛开展合作。
//脚注
//1. 其目的为让流浪者尽快离开Level C-647。
//2. 比如市中心的塔等反常建筑
//
//
//
//+ 作者信息
//脚注
//1. 通常为上锁状态
//2. 部分车辆未上锁，可以驾驶
//3. 会有至少两名身穿工作服的无面灵在此工作，可以在此处为该层级中发现的车辆进行加油
//4. 一周后发现这座小亭出现于市中心附近。
//5. 目前已知的Wi-Fi密码有12345678，12qwaszx等
//6. 一般是阿司匹林，布洛芬等感冒药或止痛药
//7. 均为英文版，且大部分书籍都有缺页或删减。
package lvls16x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1647{}