//
//建立帐号 或 登入
//The Backrooms吧
//Backrooms Fandom Wiki
//The Backrooms中文wiki官方哔哩哔哩公众号
//Discord
//主页
//
//中文沙盒站
//
//图书馆
//
//层级
//|
//实体
//|
//物品
//|
//团体
//
//故事
//|
//相关人士
//|
//现象
//|
//设定
//
//搞笑文章
//|
//国际翻译中心
//
//原创图书馆
//
//原创层级
//|
//原创实体
//
//原创物品
//|
//原创故事
//
//原创团体
//|
//原创相关人士
//
//原创设定
//|
//原创搞笑文章
//
//原创艺术作品
//|
//原创现象
//
//网站
//
//最近创建的页面
//
//最近的更新
//|
//最近的编辑
//
//随机层级
//|
//随机原创层级
//
//随机实体
//|
//随机原创实体
//
//旧页面中心
//
//本月最高评分页面
//
//历史最高评分页面
//
//最低评分的页面
//
//社群
//
//讨论区
//
//翻译预定
//|
//最近的帖子
//
//作者页
//|
//中文网站作者页
//
//加入网站
//
//管理专用
//
//后台管理
//
//职员站点
//
//所有页面
//
//会员一览
//
//侧栏
//|
//顶栏
//|
//主题版式
//
//
//
//　
//
//Level C-640
//评分: 
//+15
//+
//–
//X
// 
//
//生存难度：
//等级 3
//
// 
// 
// 
//Level C-640 是后室C层群的第640层。
//
//描述
//photo-1601662528567-526cd06f6582?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=2515&q=80
//Level C-640的照片
//
//
//
//Level C-640表现为一系列纯白色的房间。单个房间一般呈现为10米*10米*3米的标准矩形，墙纸、地板与天花板均为纯白色，均无法通过常规手段破坏，使用爆炸性武器的提案因其危险性而被否决。四面墙上均有约25%的几率出现一扇黑色的门，中间可能有玻璃，每间房间至少有两扇门，每扇门都连接另一间房间。Level C-640的空间似乎拥有非欧几里得性质，导致其可能顺着直线行走却返回起点，而沿着你的足迹折返将会导致一组新的、不同的房间替代已经通过的房间出现。此外，在Level C-640中从未有人员报告在本层内与其他流浪者发生接触。
//
//Level C-640中会出现少量杏仁水和罐装龙肉，有少量报告显示层级中存在皇家口粮，但未经证实。Level C-640中有少量实体，主要为钝人与窃皮者，有敌意，应避开传来可疑声响的房间。
//
//Level C-640中除了门之外的的一切均由纯白色构成，其对光线的反射率不一而足，但都超过了对人体无害的反射率标准。流浪者最先来到的房间平均反射率一般介于80~85%之间，此时流浪者可能并不会感到明显不适。然而当其探索的越深入，墙壁及其他材料的反射率就越高，甚至达到了98~99%。经罗经点层级探索小队采集数据并整理后得到下表。
//
//photo-1537199322506-85bfd51c0601?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=782&q=80
//Level C-640中调低亮度后的门的照片
//
//
//房间探索数（个）	墙壁反射率（%）	地板反射率（%）	天花板反射率（%）
//1	85	83	80
//5	86	85	83
//10	88	88	85
//18	90	89	87
//50	95	95	95
//89	99	99	98
//在探索至89个房间时，探索者已经因强烈的光线照射产生了类似于雪盲症的症状，眼睑红肿，结膜充血水肿，有剧烈的异物感和疼痛，怕光、流泪和睁不开眼，视物模糊，视力大幅下降，由于Level C-640中存在敌意实体，探索因危险性而提前停止，探索者切出。
//
//以下内容直接引自《后室搭车客指南（后室协调时2022年版）》
//Level C-640
//该层级很白！我是说，白的“发亮”。它对光的反射率高得惊人，因此在Level C-640里停留得过久可能会对眼睛造成不可逆的损伤。惊人吧？不过， 不要惊慌
//Don't Panic
// ，我们什么大风大浪没见过？跟着我做一个简易的滑雪镜。
//
//取出你随身携带的毛巾
//擦擦汗然后放回去
//取出罐装龙肉的罐子，若没有，Level C-640中可以找到
//剪开，没有利器就撕开
//你得到了一块长方形的铁皮
//在正中间割开一道口子，要能让你的眼睛看到外面
//扯一扯铁皮，保证你可以看见外面又不会有太多光透入眼睛
//两边都开一个洞，用随便什么东西固定在耳朵上
//简单吧？什么？还不够简单？看看这个：
//
//取出一块纱布
//对折
//用两根扎成圈的绳子1/橡皮筋放在两边
//用纱布的两边包裹住绳子
//用胶带固定
//带上
//这样的滑雪镜可能视野和效果不太好，但够用了——让你有足够的时间找到可以切出的出口。
//
//基地，前哨与社区
//由于Level C-640的非欧几里得性质，建立稳定的基地不可能
//出口与入口
//入口
//在Level C-208中进入一间纯白色的房间可以进入Level C-640
//在Level C-273中砸碎一块纯白色的冰块并闭上眼睛，睁开眼睛时会来到Level C-640
//在Level C-312中进入一扇黑色的被蛛丝包裹住的门会来到Level C-640
//出口
//切入墙壁可能会来到Level C-380
//停留过久可能会来到Level C-5
//作者信息
//Footnotes
//1. 自行调节长度
package lvls16x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1640{}