//Level C-616
//评分: 
//+10
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
//不安全
//稳定
//实体绝迹
//Level C-616 是后室C层群的第616层。
//
//描述
//Level C-616 表现为一个大型密闭长方形仓库，仓库的长度约为120米，宽度约为75米，高度约为10米，内部含有大量的货架。
//
//本层级有稳定的Wi-Fi信号，温度维持在15℃到20℃之间，内部没有窗户，有两扇无法被打开的大门，层级中唯一的光源来源于天花板不稳定的LED灯，目前没有发现它们的电力来源。
//
//流浪者切入Level C-616 时，往往处于本层级的正中央附近，周围的环境应当是无数个满载货物的货架，由于货架的排列并不规则，流浪者有可能会在本层级迷路。某些时候，一个含有物资的纸箱会从仓库顶部落下，这一状况可能会对流浪者造成威胁。
//
//快递盒
//Level C-616 的货架上有大量大小不同的纸箱，大部分的纸箱被打开了，里面空无一物。少部分的纸箱是密闭的且外部贴有一张快递单，内部可以发现各式各样的物品。目前认为此层级出现的物资是从前厅中切入后室的快递。
//
//petrebels-VH-OpMRhFII-unsplash.jpg
//Level C-616的一张照片
//
//可以在纸箱中被发现的常见物资有：
//
//食物
//饮用水
//衣服
//电子产品
//各式书籍
//小型家具
//目前还未发现装有杏仁水等物资的纸箱。
//
//快递炸弹
//曾经一名流浪者在本层级开箱时，一个纸箱突然喷出了一种粉尘，流浪者吸入后不久便高烧不退，被送往医院紧急治疗后才康复。经M.E.G. 调查发现，本层级的部分箱子内部含有一种原理未知的陷阱，打开后会产生不同的危险。
//
//目前已知的陷阱如下：
//
//箱子里会弹射出大量刀片。
//箱子中喷出致病的粉尘。
//箱子发出强光对流浪者的视力产生破坏。
//突然爆炸。
//箱子喷射出具有腐蚀性的液体。
//介于这种情况，建议进入此层级的流浪者应当顺着墙壁行动以找到位于本层级的M.E.G.站点，在做好防御措施后再选择逃脱此层级或搜集物资。
//
//远程快递
//Level C-616 中的空纸盒可带出到其他层级，使用在Level 11 ，Level C-48 和Level C-28 找到的快递单，将其贴在空纸箱上，之后填写自己的名字（此顺序不可颠倒，否则书写者自己会切入Level C-616），然后这个纸盒会切入Level C-616 的某个货架上，可以利用这种方式转移一些物资。
//
//注意，请不要试图钻入即将切入Level C-616 的纸盒，目前尝试这种方式进入Level C-616 的流浪者全部下落不明。
//
//特殊事件
//一名流浪者在本层级搜集物资时，发现本层级突然开始大量刷新含有物资的纸箱。根据该流浪者的描述，起初纸箱只会在地面上出现，当地面几乎被纸箱堆满后，大量的纸箱从仓库顶部落下来，该流浪者躲在货架下才勉强幸存。
//
//经过M.E.G.勘测员的调查，发现这些突然出现的纸箱的快递单上记录的日期均为11月11日。
//
//实体
//本层级没有发现实体。
//
//基地、前哨与社区
//M.E.G.站点
//该站点设立在仓库的一个角落，并且搭建了一个屋顶用来防御突然降落的纸箱，共有有34名M.E.G.成员，他们大部分为乐忠于开盲盒在这里搜集和接收切入此层级的物资。本站点还有大量的防具，给进入此层级的流浪者使用，现在M.E.G.正在尝试把本层级建立为一个仓库。
//
//入口与出口
//入口
//在Level 11 ，Level C-48 和Level C-28 找到一张空白的快递单，填上自己的姓名后会进入Level C-616 的正中心处附近，快递单在其他层级时会失效。
//出口
//攀爬本层级的货架，穿过天花板后会来到Level C-67。
package lvls16x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1616{}