//Level C-625
//评分: 
//+20
//+
//–
//X
// 
//
//生存难度：
//等级 2
//
// 
// 
//实体绝迹
//Level C-625是后室C层群的第625层。
//
//描述
//photo-1563192504-36ac622196dd?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=774&q=80
//Level C-625的照片
//
//Level C-625表现为一个高大的建筑物，面积约140平方米，墙壁为白色，有金属光泽。该层级的墙壁表现为大量堆叠的立方体，其以交错的方式互相层叠。单个立方体高约为1米，长和宽至少为1.5米。立方体之间的空隙被用一种未知的粘合剂粘合并填补，立方体本身极难被破坏。少数样品显示，该种立方体由约54%的碳酸钙，20%的铝与26%的未知物质组成。立方体可以用于攀登，然而难度极大。立方体上有时会出现杏仁水、罐装龙肉以及其他物资，概率中等偏下，不建议流浪者前往50m以上的区域或穿戴宇航服攀登。使用激光测距仪勘测显示，Level C-625的高度大约为960米。
//
//据测量，该层级表面的重力约为正常重力的5倍左右，因此在没有任何保护措施的情况下进入Level C-625是非常危险的。无重力宇航服可以抵消层级内一部分的重力，然而穿戴宇航服的流浪者仍然会收到约1.8倍于标准重力的引力。若流浪者顺着墙壁攀登，则所受重力会有一定程度上的减小，但幅度不大。有传言称若到达层级顶部，会来到完全失重的区域，但未经证实。1不建议普通流浪者尝试证实/证伪。
//
//以下是已被探明的重力与高度的比例：
//
//高度（m）	重力（倍于标准重力）	宇航服内重力（倍于标准重力）
//0	5.2	1.8
//20	5.1	1.7
//50	4.9	1.6
//100	4.4	1.3
//100米以上的区域没有经过探索，同时由于实验的危险性，向上深入的探索均被停止。2
//
//基地，前哨与社区
//M.E.G.“自由落体”前哨站
//提供无重力宇航服，食物，杏仁水等物资。
//会指导流浪者切出
//会营救困在立方体上的流浪者
//出口与入口
//入口
//在Level C-249切入墙壁有小概率来到此层级
//在Level C-251切入一个白色的立方体会来到此层级
//更多待补充
//出口
//从立方体中切出会来到Level C-336
//在黑色立方体中切出会来到Level C-444
//更多待补充
//
//
//
//探索录像#C-625-23
//地点：Level C-625
//录音者：Ancage（曾是业余攀岩爱好者）
//时间：2022/7/12
//
//Ancage：[拍打麦克风] 开始了？
//
//Samblock：很清晰……我在下面看着你呢！
//
//Ancage：不错……那我开始了…… [攀爬] 这狗日的重力真他妈离谱……
//
//“自由落体”前哨：我们发现您正在攀登墙壁。请问原因是？
//
//Ancage：额，我在……收集物资！
//
//“自由落体”前哨：若需要物资，请前往前哨站领取。请您尽快下来。
//
//Ancage：好……马上…… [攀爬]
//
//[沉默]
//
//“自由落体”前哨：先生？您已经攀爬了约15米了，这是很危险的！
//
//[沉默]
//
//“自由落体”前哨：先……
//
//Samblock：行了别喊了，人打算到上面去。
//
//“自由落体”前哨：这是极其危险的行为，我们此前从未上过100米以上，不清楚是否有未知的风险，因此……
//
//Ancage：[停止攀登，坐在了一块立方体上] 别跟我在这官里官腔的了，你们做不到的，我来做，懂？你不能限制我的人身自由。
//
//[沉默]
//
//“自由落体”前哨：如果您上至100米，我们将无法保证您的人身安全。
//
//Ancage：我也没指望你们。安静点就行了。
//
//“自由落体”前哨：……我去请示一下上级。
//
//[沉默]
//
//Samblock：你那边没事吧？前哨站这边我可以去周旋一下。
//
//Ancage：当然，我继续上去了。
//
//[Ancage继续向上攀爬]
//
//“自由落体”前哨：上级批准了你们的行动，接下来我们会协助你规划路线。Samblock，你可以来前哨站协助我们吗？
//
//Samblock：老天，你们这群顽固不化的老东西居然还能良心发现。我来了。
//
//[无关内容略去]
//
//Ancage：探索行动已进行到第14天，高度已达到约760米，重力约2.1倍于标准重力。我的物资又不够了，前哨，帮我看一下路线。
//
//“自由落体”前哨：以你为原点的（4，3）位置有足量食物和水，可以尝试到达。
//
//Ancage：明白。[开始攀爬] 重力越来越低了，按这个比率，顶上说不定真是失重状态。
//
//Samblock：在一切没有尘埃落定前，不要妄下推断。
//
//Ancage：你他妈再敢这么跟我说话我下来就削了你的头。
//
//Samblock：行行行我错了行了吧……
//
//Ancage：[坐在一块立方体上开始尝试拆开一听罐装龙肉] 呼……好久没有直接看向这个深渊了…… [抬头] 上面也是深不可测呢……
//
//“自由落体”前哨：按原先的测量结果来看，只差大约200米了，并且重力也远低于下面，对你来说应该不难。
//
//Ancage：只怕……一不小心……啪，没咯……
//
//[无关内容略去]
//
//Ancage：嘿看！上面已经有头了！[奋力向上爬去] 我能感到重力几乎没有！[跳了一下] 看！我一跳就可以上升这么高！
//
//Samblock：悠着点！
//
//Ancage：这儿的氧气有点稀薄…… [穿上了反重力宇航服] 我没丢掉这玩意居然是个正确的选择……
//
//“自由落体”前哨：上面的那个不断移动的柱子是什么？
//
//Ancage：[来到柱子前，因失重漂浮着] 看上去……像个……轴？
//
//Samblock：等等！我就知道！那确实是个轴！但旋转的不是轴，而是——我们！
//
//Ancage：老天…… [推了一下墙壁，向右侧飘去，并停在了墙上] 等等……如果这真是离心力的话，降低转速是不是可以降低重力？[试图触碰轴]
//
//“自由落体”前哨：等等！别！
//
//Ancage：[一把抱住轴]
//
//Ancage被轴带着飞速旋转，差点脱手，但他及时拉住了一个突起的把手。待镜头稳定下来，Anacge抬头，整个世界都在围绕着镜头飞速旋转。由于氧气稀薄，空气阻力竟然微乎其微。
//
//Ancage：我只在星际穿越里看到过这个场景…… [用扶手推动自己飘向了一段] 这是控制箱吗？
//
//“自由落体”前哨：如果你修改上面那个闪烁的数字，兴许可以降低转速。
//
//Ancage：[修改了上面的数字] 一下子降低会不会有破坏性？[在“TIME”一栏输入了2DAYS] 好了……那么见证奇迹的时刻—— [按下YES]
//
//Ancage出现在了Level C-217中。
//
//
//
//
//M.E.G.通告
//鉴于Level C-625中的重力已于2022/8/3恢复正常，现已取消此前关于攀爬墙壁的限制，烦请注意安全。
//
//感谢Ancage对此事件做出的巨大贡献
//作者信息
//« Level C-624 | Level C-625 | Level C-626 »
//
//脚注
//1. 已被证实，见探索录像#C-625-23
//2. 已被取消，见探索录像#C-625-23
package lvls16x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1625{}