//Level C-630
//评分: 
//+20
//+
//–
//X
// 
//
//生存难度：
//等级 2
//
//部分区域不安全
// 
// 
//Level C-630是后室C层群的第630层。
//
//%E6%B5%AE%E6%B4%B2%E4%B9%8B%E6%A0%91
//Level C-630的浮洲部分。
//
//描述
//Level C-630是一片理论上无限的空间，其中有一片树林，未知其面积1，包含上千棵笔直高耸的树木。该树林以一地势低平的圆形陆地为依托，称为“浮洲”2。在浮洲周围为一片空旷平坦的水域，称为“瀚海”3。瀚海似乎延伸至无限远处。任何生物都能如履平地一般在水面上走动。所有令物体浸入水面以下的主动尝试均会失败。
//
//Level C-630无昼夜更替。流浪者处于瀚海之上时常能看见一片渺远而呈蓝灰色的天空，伴有浮云；而靠近浮洲时，则会有强烈的日光（尽管层级中未观测到类似太阳的天体）照射，且日光会慢慢从白色变为金黄色。
//
//Level C-630的异常性质主要体现在对事物大小尺寸的改变上。流浪者在进入此层级时，他们总会发现自己正站在位于瀚海之上、目测距离浮洲的边缘10m的位置。在这些位置所构成的圆周上，流浪者以及他们带入此层级的任何物品的大小尺寸是正常的。但随着他们远离这一圆周，则事物的大小会随移动的距离而等比例变小。若是向圆心方向远离（即去往浮洲方向），则在累计移动5m时这一变化会停止并最终维持在原体积的8*10-12倍4。若是向与圆心相反的方向远离，则他们会随着与圆心的距离变长而无限地变小下去。而这也导致任何对瀚海的深入探索都是不可能的。通常而言，Level C-630的上述异常性质导致进入此层级的流浪者抵达相对宜居的浮洲需要花费较长的时间。
//
//上述变小的过程是可逆的，且它所具有的异常性引起了众多对于其原理的猜测，譬如即使流浪者的身形理论上已经近似分子尺寸，脚下的水面却依旧平滑如镜。尤其空识5的存在更是令人费解。明晰Level C-630异常现象的本质在目前被认为是不甚紧急的，但持续研究仍有必要。
//
//瀚海
//瀚海是 Level C-630中除浮洲之外的部分，也是流浪者最初切入此层级时所踏足的部分。其是一片面积推测无限的水域，水面有着如镜面般的反光性，因此窥探水面下的物体是极为困难的。
//
//瀚海上存在攻击性实体，常见的如猎犬、窃皮者等，它们因未知原因更容易从其他层级经由某些位置入口切入Level C-630。由于瀚海极广的视野以及其毫无障碍物和阻挡物的特征，这些攻击性实体非常容易注意到流浪者并对其发动攻击。但同时，它们也因此容易被净尘水锁定。
//
//鉴于瀚海的单调性质，建议流浪者切入Level C-630后，向浮洲而非其反方向行进，否则遭受实体的几率将大大升高。
//
//净尘水
//净尘水是仅出现在瀚海上的一种现象，也是少有的能使事物进入其水面以下的途径之一。它被推测是Level C-630清除可能危害的方式。
//
//净尘水仅会在距浮洲5m或以内的地点出现。其表现为：在水面上出现轻微的环形扰动后，一颗直径约0.5cm的球形水珠从瀚海的水面上竖直跳出并将路径上的物体包裹入其内，然后再竖直落回水面，激起数圈涟漪。所有被水珠包裹的物体都将会因之而沉入水下，自此失联。但观察显示，水珠内的生物未表现出窒息的样态，这可能说明它们仍能在水下存活。鉴于净尘水所吞噬的有害实体远比流浪者多，因此被净尘水吞噬的流浪者，其遭遇是不乐观的。
//
//尽管净尘水的出现有一定的随机性，但有统计结果证明，在生物展现出暴力倾向、试图造成财产损失或伤害他人时，净尘水将更有可能生成于其下方。值得注意的是，此时的净尘水似乎会尽可能出现于不会将受害者一并吞噬的位置。
//
//净尘水的出现频率随靠近浮洲的距离缩短而提升，在距浮洲边缘1m以内的攻击性实体，将极有可能招致吞噬。这也使得浮洲中有害实体数量极少。
//
//浮洲
//浮洲是Level C-630可探索部分中心的一片圆形陆地，其上是一片由数千棵树构成的森林。树木的直径在35cm到50cm不等。浮洲的土壤质地细密，有较强的疏水性。
//
//由于流浪者的尺寸受层级影响，但浮洲上的植物尺寸仍为正常大小，因此到达浮洲时，其上的植物，尤其是树木，对流浪者会显得极其巨大且高耸入云。每棵树的树干在地面处都有一约高0.5cm的洞口，可以使流浪者进入。树木的内部都是空心的，且里面有用混凝土或木质搭建而成的地面、建筑等结构。尽管如此，目前没有观测到这些树枯死的迹象。流浪者将这些树内的城市称呼为“菩提城”。
//
//尽管浮洲内大多数时候由金黄色的自然光照射，其也偶尔会阴天并下雨6。雨滴会以正常大小下落，因此雨滴和积水通常对游荡在外的流浪者有较大的危害。又因浮洲的地面有着比一般土壤强的疏水性，因此积水通常会难以下渗，并顺着地势流向瀚海。被水流卷走的流浪者若足够不幸，有可能随水流而落入瀚海的水面之下。
//
//菩提城
//菩提城是建造于浮洲中树木树干内部的城市。其外壁由约厚1cm的极其坚硬的木质构成。目前观察到的菩提城皆是竖直多层结构以充分利用树木高大的纵向空间。
//
//菩提城的地面约厚0.5cm~1cm不等，且由混凝土、泥土、木屑等混合构建而成。建筑所用的材料多为木材、石材、砖瓦、钢筋混凝土等。建筑构造多数类似前厅的城市，有信号强度中等的Wi-Fi覆盖。据多名流浪者反映称他们“感到一种莫名的古朴感与神秘感”，这可能是由于建筑上常出现的装饰性纹饰、稍显昏暗的城市内部环境和城内隐约散发的线香味。由于树干内部少有可见自然光，所以菩提城的照明系统非常发达。菩提城内种植有苔藓等小型植物（尽管对于流浪者来说它们的尺寸并不小）作为绿化与装饰。目前已有5棵菩提城被较为全面地探索，另有约20棵菩提城被粗略地探索。已被探索的菩提城均已于其入口处标号。
//
//在已探索的范围内，菩提城的内部结构构造是不同的，但大概可分为以下两类：
//
//螺旋上升型：2号菩提城、5号菩提城等为此结构。其树干中心存在一条从底部直伸到树顶的支撑轴，内部的约厚0.5cm的地面沿着该轴以一个较缓的坡度螺旋上升。但尽管地面有坡度，建筑大多是垂直于水平面而建的。
//垂直分层型：1号菩提城、3号菩提城、4号菩提城等为此结构。其每层都是平行于水平面而建，上下两层之间依靠建设于层间的电梯与阶梯沟通。
//菩提城与外界沟通的通道除了树干底部的大门外，还有一些偶然出现于树干上的树洞。此外，由树木伸出的树枝偶尔会与相邻树木的树枝相连接，这些树枝上建设有道路，与菩提城的公路交通系统连通。流浪者可以通过这些道路，到达相邻的另一棵菩提城。
//
//菩提城内有相当先进的自动调控系统，用以稳定其内部温度在26℃恒定不变、控制其内光照系统的强度，并在下雨时封闭所有与外界沟通的窗口和树枝上的道路以防止雨水的侵入。也正是因此，若天色阴沉时流浪者没有及时进入菩提城以避雨，在开始下雨后他们就无法进入了。
//
//有相当一部分流浪者表示，若长期在菩提城中居留，他们的心情与情绪，甚至感情等，会逐渐趋于平淡，并进而感到单调乏味与嗜睡。这可能是由于某种未知的精神影响导致。离开菩提城并在外面漫步可以较快地消去这一影响。
//
//另外，在每棵菩提城的最顶部，都用镶金的字样在内壁之上刻有梵语“一花一世界，一木一浮生”。该语句所镶嵌的金属与电路相连接，据推测菩提城的顶部可能是整个城市的能源所在。尚不知其工作原理。
//
//空识
//空识是一种仅人类在浮洲中可以进入的状态，被视为是较为快速地在浮洲中穿行的方式。
//
//粗略而言，需进入空识时，流浪者需要走出菩提城，瞑目盘腿而坐，将自身的一切杂念暂且忘却并积极想象周遭事物，尝试将周围场景于脑海中复现。持续此过程直至自身的意识仿若脱离身体。此时流浪者的意识将会看见自己以正常的大小比例站立于原处。随后，他们的意识将随意志而以正常尺寸人类的速度在浮洲的森林中穿行。当到达自己想要到达的地方时，流浪者需在自己的意识中再次闭眼盘腿而坐，随后他们若睁开自己的眼睛，就会发现自己正盘腿坐在该处，而非进入空识前的位置。到达目标位置后，会从不知何处传来一次渺远的铃声。
//
//以上是较为简略的描述，可向在浮洲中居住的流浪者求助以获取更复杂的信息。
//
//由于进入空识约等于流浪者回到正常人类的大小并在浮洲中移动，因而其作为一种快捷的行动方法而在Level C-630中被使用。但由于未经训练的人员较难进入空识状态，且在状态期间若受到任何杂念的干扰将立即中断过程并返回原处，因此除非要到达距离较远的另一棵菩提城，否则步行仍是浮洲中较为主流的移动方式。
//
//基地、前哨与社区
//M.E.G.（探险者总署）-“明镜台”基地
//建设于1号菩提城第三层正中心的大型建筑之中。
//常驻人员约150人，为流浪者提供必要的服务与帮助，包括教授空识的技巧等。
//有3支安保小队会在浮洲的边界巡逻以歼灭被净尘水遗漏的攻击性实体，或帮助瀚海上的流浪者来到浮洲。
//研究人员会定期在浮洲处采集大型植物样本进行研究。
//B.F.P.F.（后室家居生产厂）-“无量”基地
//建设于4号菩提城7第二层。
//有较多人员驻扎在此，承担了4号菩提城的大部分管理工作。
//几乎不与M.E.G.进行任何交流。
//拥有一定的物资储备。
//B.N.T.G.（后室不结盟贸易集团）-“恒河沙”贸易点
//建设于3号菩提城，是此层级最主要的存储设施。
//在3号菩提城内经营一大规模的贸易点，主持此层级内绝大部分交易。
//在其他已被完全探索的菩提城内也设置了小规模的贸易点位。
//入口与出口
//入口
//抱起Level 1中出现的装有木材的补给箱并试图跳入其地面上的水坑，将进入此层级。
//在Level 57中切入一幅画着高耸树林（内容与本文档配图类似）的画。
//以平躺或盘腿姿势落入Level C-45的水体后有较小概率进入此层级。
//试图切入Level C-148的落脚点与水面相接处有可能进入此层级（因过于危险和困难而不建议尝试）
//在Level C-160的庭院中睡着，有约5%的可能性在此层级醒来。
//更多入口正在探查中。
//出口
//在浮洲中被雨滴直接击中可能去往Level C-7。
//据称沉入瀚海后有极小几率到达Level C-10。
//在浮洲中切入一个蘑菇可能会进入Level C-27。
//2号菩提城中有一栋通体纯白的楼房，少见地没有任何表面纹饰。切入它的墙壁将到达Level C-285。
//在此层级中尝试自杀可能会去往Level C-320。
//更多出口正在探查中。
//作者信息
//« Level C-629 | Level C-630 | Level C-631 »
//
//Footnotes
//1. 碍于此层级的特殊性质，对树林具体面积的测量难以完成，且不具有太大意义
//2. 关于浮洲的更详细描述见后文“浮洲”部分。
//3. 关于瀚海的更详细描述见后文“瀚海”部分。
//4. 即长宽高都缩小到原先的五千分之一。尺寸的变化速度是线性的，此数据根据粗略计算获得，可能不准确。
//5. 详细描述见后文“浮洲”部分下属“空识”部分 。
//6. 降雨的来源未知，并非是经由浮洲与瀚海间的水循环形成
//7. 目前所有已经全面探索过的菩提城中距1号最远的一棵
package lvls16x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1630{}