//Level C-633
//评分: 
//+18
//+
//–
//X
//这是给你们的：
// 
//
//生存难度：
//等级 0
//
// 
//随时间增强的精神影响
//大量友好实体
//这是给其他实体们1的：
// 
//
//生存难度：
// 
// 
//都是朋友
//你们好，我想按你们的说法，我的本体是后室C层群的第633层。2
//
//描述
//我的本体由多个巨大的宴会厅连接而成，每两个大厅之间会有门洞连接，风格嘛……KTV风格?夜总会风格?我不确定你们会用什么描述。我本体的墙壁和柱子由黑色、粉色和亮紫色的半透明反光板覆盖，上面通常会有许多晶莹剔透的几何形玻璃饰物和闪光彩带作为装饰。这里的温度嘛……我会让大家都感受到最舒服的温度的。
//
//这些宴会厅里面都摆了整齐排列的宴会桌，我在上面放了款待实体们——也包括你们——的各种吃的，不过你们最好看清桌子上饮料的标签，以免喝到我给其他实体们准备的腰果水。这些吃的会定时补充，不过不要拿太多啦，它们没法拿出我本体外，我这又不是食物仓库！
//
//当你们切入我的本体时，会在主厅出现。在这个宴会厅正中央，你们会看到一个用亮片、反光彩带、聚光灯和发光灯带之类东西装饰的大舞台。我，或者说我的化身，经常会出现在那里。
//
//我的本体面积虽然有限，但会随容纳的实体数量增加而扩大，这样大家就不用怕挤着不舒服了。
//
//我这里的网很好，水电什么也能正常用。我也会保护你们在这里不被那些家伙们拐走……我尽量。同时，在这里你们也不用怕那些危险的现象会困扰你们。
//
//你们完全不用担心会被实体们——同样包括你们的同类——攻击的，原因在下面。
//
//特殊效应
//我这里有个被你们那个叫M.E.G.的组织暂名为“交友气氛”的现象，在这里所有的实体都会变得和在别人的领域里不一样，他们会和你好好相处，大都可以和你们正常交流的。剩下不能直接交流的，也不会侵犯你们的。
//
//- 收起
//“交友气氛”的主要表现，是包括人类在内的所有实体侵犯其他实体的欲望和破坏欲完全消失，且皆变得更加倾向于进行利他行为及与其他友善的实体进行友好交流，像窗户这种没有明显意识的实体，能力也被彻底无害化。此外，有明显意识的实体，其本身会对其他实体造成负面影响且难以受其意志控制的特质亦会被无害化3。目前，尚未收到任何关于实体于Level C-633伤害流浪者的报告。
//
//此外，该效应还会使绝大部分实体获得接近人类水平的智力智力水平随受该效应影响时间增长而提高4，并能使包括人类在内的其他实体理解其语言含义。据当前已发现的案例推测，如受该效应影响的时间足够长，该效应对实体造成的影响将得以在其离开该效应作用范围后保留。暂不清楚足以使该效应造成的影响在实体离开层级后保留的最小时间。
//
//哦，还有一个最重要的东西没说。有些实体，你们会看着很不舒服吧，包括生理性的那种，没关系，在这待久了就没事了。我指的并不是习惯或麻木了那种，我指的是我这里另一种效应，它会让你眼中的其他实体变得越来美观，看起来越来越舒服，越来越亲切……不过注意，别待太久，不然你到别人的领域里碰到那些没教化的实体也会把他们看成朋友了。
//
//- 收起
//此处指的是Level C-633中一种重要的效应，其被命名为“C633ACG效应”，具体表现为实体在流浪者视野中显示的形象随逐步向更易被流浪者接受乃至喜爱的变化，在影响程度较低时可使用杏仁水加快影响的消失。以下是该效应产生的效果与受该效应影响时间的粗略对应关系:
//于Level C-633中停留时间	效果	解决方法
//0~25分钟	流浪者眼中的实体吓人程度较平常略高	离开Level C-633后影响瞬间消失
//25分钟~1小时30分钟	流浪者不再因实体外观感到厌恶和生理不适	离开Level C-633后影响将于25分钟内逐渐消失
//1小时30分钟~5小时	流浪者眼中的实体向人类形态转变	离开Level C-633后影响将于2小时内消失
//5小时~10小时	流浪者眼中的实体显示为具有实体标志性特征的人类，对于无面灵，则表现为出现具有一定透明度的正常人类五官	离开Level C-633后影响将于10小时内缓慢消失
//10小时~36小时	流浪者眼中的大部分实体显示为正常人类，个别仍保有少量实体特征，但外貌出现贴合流浪者自身审美的趋势	离开Level C-633仅能阻止影响恶化，需饮用大量杏仁水以解除该效应的影响
//大于36小时	流浪者眼中所有实体均显示为极其符合其审美的人类，个别会保留有该名流浪者喜爱的实体特征	此阶段下的该效应已无法消除
//相关人员推测此效应与“交友氛围”本质上为同一效应的不同方面，为Level C-633保持其良好氛围的重要机制。同时，对该效应的研究也在识别伪装的实体的问题上具有重大价值。
//
//实体
//我这里的实体种类非常多，你们数据库里面的实体好多我都能在我这里找到。不过我觉得有几个特别的要单独拿出给你们说。
//
//窗户
//这里的窗户，他们也装饰着反光彩带，如果你靠近他们，他们会把你送到我的舞台面前。所以如果你跟家人在这儿走散了，可以跟他们约好在我的舞台旁边汇合，然后向窗户们求助就好啦。
//
//椅子
//我知道他们在别人的领域也是安全的5，但我还是想说一下。他们会待在宴会桌旁边，当大家坐在桌子边，一起坐着享受美食的时候，他们也可以同你们一起享用美味——你们的疲劳。
//
//友佳
//这是你们给我的化身起的名字，我觉得挺好听的。
//
//我在我的化身上可花了好多精力呢，我给她弄了一头粉色头发，还弄了对大卷卷的粉紫闪亮双马尾 ，头上用了浅黄、浅紫、粉色等颜色的长丝带做了华丽的装饰，身上穿了个粉色、黑色和亮紫色反光材料装饰的……偶像装?打歌服?我不确定你们管那叫什么，这两个词我是从你们的网站看来的，你还是自己来看吧。
//
//我的虚影
//它实际上并不是在我的本体中待着的实体。因为我没法弄太多化身，所以我弄了这些东西。他们被我派到别人的领域，看起来就像我的化身的半透明版。它们的意识是和我连通的，你们可以通过与他们跟我交流，就像和我进行全息投影的视频对话一样。
//
//它们的身躯是可以穿透东西的，但我也可以控制它们中一些让它们能拿住东西，这样就可以把你们送的礼物送到我这了。如果你请求它们，它们也可以将你带过来。
//
//它们也能在周围弄出你们说的“交友气氛效应”，但范围应该不会太大，并且允许影响范围内的实体们反击外部的侵犯者。
//
//资源
//我给你们准备了品种丰富的小零食、饮料还有正餐哦，不过没法带到别人的领域去就是了。要纪念品的话，我这有一些腰果香水，它们对你们没效果，喷出后对其他实体的效果和普通腰果水基本一样，但比腰果水多一个重要效果，它会让被喷到的实体暂时变成你们的朋友，直到他们受到的其他增益没掉。
//
//房间
//小隔间
//如果你和你的几个小伙伴怕打扰到大家，你可以在我的本体中找到一些门，门及其后的房间的隔音效果足够把你们在里面发出的声音降到不会打扰外面的程度，里面会有一张定时补充吃的的圆桌和一些正常的椅子，你们可以尽情在里面狂欢或者别的什么增进感情的事。
//
//后室实体交友会总基地
//这是我为他们专门搞出来的房间，入口在我的本体的某处，其他的我不便透露。
//
//基地、前哨与社区
//哎呀，抱歉，因为上面我所说的影响，你们还是别在这里常住好。不过在我本体的影响下，这里的其他实体似乎已经可以建他们的组织了。
//
//友谊之灵追随者
//他们把我当成崇拜对象了……他们的成员大多数是悲尸，也有无面灵什么的，他们总是在我的本体的一些角落搞一些奇奇怪怪的事，说什么要把我的意志扩张到整个后室，我可没那种野心，担不起“神”这个名号……
//
//后室实体联合会后室实体交友会（B.E.F. Backroom Entity Friendship）
//这是一个由在我这里待得比较久的实体组建的组织，他们告诉我，他们想出去教化他们那些未开化的同胞，让他们能和人类联合起来，让彼此之间关系更加融洽，从而获得更和谐的生活。
//在我、红星建筑队和M.E.G.的帮助下，他们已经建成了一个正儿八经的组织了！他们致力于改善各类实体们（包括人类）之间的关系，帮助实体们生活得更和谐、舒适。
//
//他们把总基地建在了我给他们弄的一个巨大房间里。他们现在已经开始派出同伴在一些实体（包括人类）聚居的地方建立他们的驻扎点了，我派了我的虚影们跟了他们一起去。在我本体以外，每个他们的基地我都会安排至少5个虚影为他们提供你们说的“交友氛围”，因为我不知道，一旦他们脱离我的影响会怎么样。此外，我还给他们弄了制作腰果香水的机器，虽然目前制作效率有些低……
//
//至于这个名字……他们和我说是为了隐蔽。
//
//有识血肉交流点
//它们在这里研究我这里的特性，同时还代表他们的同伴们与后室实体交友会进行交流。
//
//另外还有的就是其他的一些实体们结成的小伙伴团体了，数量太多了，你们可以自己过来我这里看。
//入口与出口
//入口
//你们可以往一个中立或友善的实体（这里肯定不包括人类了）身上倒、喷或泼腰果水或腰果香水，然后抱住他几秒6，醒来时你们就会发现，你们抱着的变成了主厅的柱子。腰果水大概……要用1整瓶吧，腰果香水要更多些，比2整瓶少一点。
//
//我和C307等结盟保护人类后，搞了一个我们之间的双向通道，我这边的入口是我的舞台后方一大片的盆栽，走进去就行，他那边的入口是在M.E.G.基地旁边的一棵泛着粉紫光的大树，抱一会就能来了。
//
//其他实体有他们各自的途径，他们不想我告诉你们，我觉得告诉你们也没什么用，就算了。
//
//出口
//除了上面那个双向通道，你还可以来主厅和我说一下，只要不是太危险并且他不太介意，我就可以把你送过去。
//哦，还有，我在后室实体交友会的主基地里开了一些通往实体聚居地的出口，只不过如果你不是他们的人，他们估计只会给你使用通往Level 11之类地方的少数几个出口。
//
//附录
//-感谢你的阅读 
//你们好呀，我本来以为我会是第一个和你们主动接触的“层级意识”的，没想到已经有别人抢先了，不过也没关系啦，这正说明我不是在孤军奋战。既然我在上面已经介绍过我了，那我就直接进入正题了。
//
//后室好多地方都在用资源和空间逼着实体们相互戕害，把大家的存在对立起来。它们让每个个体的的存在都不得不或多或少损害别的个体，给大家带来了那么多不安宁。我听你们说，你们的那个前厅也是这个德行，斗争，斗争，把你们放到各种领域的斗兽场，让你们相互撞得头破血流、心神不宁却只为能保全自己的灵魂。
//
//还好，你们并没有向外界这种力量屈服。我之前看了你们那个叫“红星建筑队”的组织给我的书，更是感叹于你们的思想与力量。你们的书里的思想真是和我的不谋而合啊。
//
//尽管如此，外界破坏大家的联合体的力量依然强大。当初我和你们的M.E.G.的人接触的时候，就把我和那个盗用“后室实体大同”这伟大旗号的东西扯上关系了，看来外界对大家和谐相处的生活的破坏倾向是真……难以形容啊，连这种东西都出来了。
//
//对此，我觉得所有实体更应该团结起来，减少冲突，让大家都能安安心心过好各自的灿烂生活。而且，并不只是我这样想，于是，在M.E.G.和红星建筑队的帮助下，“后室实体交友会”在我的本体中诞生了，我本来建议他们起名实体总署(Major Entity Group)来着。而且，我觉得不仅是实体，有想保护大家安稳生活的层级同伴也可以参与进来，为大家撑起一把把牢固的保护伞，我会一直为大家争取的。现在，我和 C307几个已经建起了一个还没名字的庇护流浪者和友善实体们的联盟，致力和你们一起把更多的无辜生命从那些危险家伙手里抢回来。
//
//额，如果你觉得“带大家走向光明未来”之类的太大了，我还有“小的”要说。
//
//你们如果单纯想聊天的话，也可以来找我，我也挺乐意听你们的故事的，这里这么多的实体也一样。我随时欢迎你们。放松，只要大家不介意，你甚至可以在这里狂欢，不用像在她那里那么拘谨——对了，忘了说了，她也加入了我们那名字还没定的联盟，但她似乎还在考虑构建她住的地方到我的本体和C307的途径。
//
//希望我能给大家提供又一个珍贵又令人安心的避风港。
//
//-感谢你的阅读 
//- 收起文件
//M.E.G.对“友佳”的采访
//
//采访时间：20■■年7月6日
//采访地点：Level C-633的一小隔间内
//采访人员：M.E.G.特工许■■(下用“X”代表)
//采访对象:Level C-633的层级意识——“友佳”（下用“Y”代表）
//
//X：我们可以开始采访了吗？
//Y：开始吧。
//X：我首先想问一下，你为什么这么执着地保护人类和让实体们与人类团结在一起?
//Y：额，我之前也问过 C307类似的问题，只不过没有后面那半，他和我说是希望看到人类造出各种壮观的东西什么的，我觉得我对这个问题的回答略微有点像，我想看到大家一片和睦融洽生活的样子。
//X：哦……好的。接下来，我想了解一下，你是怎么理解实体在层级之间切入切出的?
//Y：我觉得……每个你们说的“层级”并不是三维的空间，相互之间在你们的三维以外的地方存在连接，如果突破了一些层级自身存在的阻拦，就会从连接处穿过去，单向的情况应该是层级自己施加的单向阻力吧……我也不太清楚。
//X：嗯……你的回答对我们很有帮助，我记一下……好的，请问你是怎么看待那些危险的层级的？
//Y：他们有的是老顽固，不知变通，执意要强行固守自己那套规矩；有些就像是你们说的疯子，还有本身就疯和被搞疯的之分呢！还有的就是纯粹蔑视生命的家伙，把宝贵的生灵当玩具，呵。但也有一些单纯只是没有广泛接纳的心态而已。
//X：好的，我明白了。那么，请问你有没有让你的化身离开你的本体的能力？
//Y：可以是可以，可是我放心不下这里，万一有你们的同胞切入我这里，我的化身却不在这里，谁给他们开出口呢？
//X：诶，你的化身不在本体内，就没法给流浪者开放前往其他层级的出口了吗？
//Y：我的本体当然可以感知到其中的动静并给他们打开出口，但是我要靠化身跟他们交流，引导他们啊。又不是每个层级都有和流浪者精神交流的能力的。
//X：哦，好的，今天的采访结束了，谢谢您的配合。
//Y：嗯。
//
//
//采访时间：20■■年7月8日
//采访地点：Level C-633的一小隔间内
//采访人员：M.E.G.特工许■■
//采访对象：后室实体交友会创始人之一——派提克(该人员是一名派对客，其拥有独特的笑容“=｝”)
//
//许■■：请问采访可以开始了吗？
//派提克：可以了=｝。
//许■■：好的，那我就先从个人方面的问起了?
//派提克：没关系，我能接受，我还要感谢你们M.E.G.帮我们这个初生的组织站稳脚跟呐=｝。
//许■■：那好，我想问一下，请问您是如何来到Level C-633的呢？为何要来呢？
//派提克：这个问题挺好=｝，这就要从那位贪婪的压迫者开始说起了，它以某种我也不知道的方式影响着我和我的同胞们，让我们去狩猎其他无辜的实体们，只为了它自己大饱口福>=｛。那天我去找它要的猎物，想看看能不能找到新的层级进行狩猎，随便切切，结果就切到这来了，你知道的，我们派对客在层级间穿越的能力比你们强得多=｝。
//许■■：啊，我知道了。请问您能不能讲讲您和您的同志们一起创建B.E.F.的目标呢？
//派提克：嘿=｝我正想接着刚才的讲这个呢。我就顺便把B.E.F.的建立也一起讲了吧=｝当我一来到这里的时候，我就看到了好多我的同胞。我立马就凑到我的一个同胞跟前，想拉他一起去抓猎物，他却和我说：“好好在这儿开派对不行吗=）去外面抓人又累又要挨人类打=）”我找了好几个同胞，得到的都是类似的回答，他们还劝我留下来，当时我不知道为什么就待下了。现在想起来，应该是这个层级的效应吧=｝我在这里呆了很久后，我想到一个问题，我是能在这里和各种伙伴们自由地开派对了，但我还有众多同胞们被那家伙操控呢=｛，我想让大家都能舒舒服服的开派对=｝后来我碰见了那几个现在和我一起建立B.E.F.的朋友，他们其中一个是不知如何从Level 400来到这里的编码员，一个是可怜的噬命之灵——对了，这里的效应似乎可以抑制那让他痛苦不堪的捕食欲望，让他可以像你们一样正常吃东西——还有其他几个=｝然后我们就建成了B.E.F.的前身——后室实体联合会，一边宣传，一边想办法出去，让大家一起为了更好的生活合作=｝结果你也看到了：最终，这个层级的层级意识帮了我们许多，后面你们的M.E.G.和红星建筑队也来帮了我们一把=｝红星建筑队送我们的那些书非常好，我们的很多伙伴都抢着看。
//许■■：哦好的。我有个重要的问题想问，请问你们组织对于与实体战斗和使用实体进行实验怎么看？
//派提克：我们并不是要求为了实体牺牲人类的狂热组织=｝我们尊重人类自身的需要，也在一定程度上了解那前厅在你们遗传物质中、本性里埋下的雷=｝对于那些挑起冲突的势力，不管是实体还是人类，如果不进行清除或压制，对大家的和谐生活都是一种破坏=｝你们人类不也是，在前厅和后室都要面对挑起混乱的同胞，不也是要动武=｝对于那些未教化的实体，我们是有条件教化就教化。至于用实体实验的问题，我们计划将克隆技术产生的实体提供给我们认可的组织进行实验。我们并不是人类，而且这是为了大家的和谐生活=｝毕竟这已经是现有的最好方案了，不是吗＝｝
//许■■：好的，请问您还有什么要说的吗？
//派提克：还有一件事，我要感谢这个层级=｝它压下了我们为己害人的底层倾向，让人类机构中横行的、潜藏的那些脏东西侵入不了我们的内部=｝那些压迫者绝对会对我们和这个层级抹黑让外面的同胞们避开这里，它们却不想这正进一步减轻了我们的管理压力=｝
//许■■：好的，谢谢您配合我们。
//
//此次采访被认为展示了对该层级特殊效应的研究的新价值，即可能存在的减少组织内的腐败等问题的效果。
//
//
//M.E.G.对后室实体交友会部分成员的采访
//采访时间：20■■年7月8日
//采访地点：Level C-633的一小隔间内
//采访人员：M.E.G.特工许■■
//采访对象：后室实体交友会的一名员工(该人员是一名编码员)
//
//许■■：你好，我能采访你一下吗？
//采访对象：最好别太久，我还要用我神圣的电脑7干我的活。
//许■■：好的我会尽快的，请问你是如何来到本层级的？
//采访对象：对不起，这是我们的秘密。
//许■■：我理解了。那么请问你的工作是什么？
//采访对象：编写这些程序。
//许■■：哦，好的。那么你在这里生活得怎么样？
//采访对象：嘿，挺好的，不仅能和我至高无上的科技造物成天在一起，还能给大家做出贡献。好了，我要继续干活了。
//许■■：谢谢你的配合。
//
//
//友佳的部分交流记录
//经相关实体及层级意识同意，我们将Level C-633层级意识的一部分交流记录置于此处：8
//
//交流对象：布兰奇
//交流途径：电子邮件
//
//友佳：你好，布兰奇女士。
//布兰奇：亲爱的读者，你好。
//友佳：我是Level C-633的层级意识，我想先问一下，你是不是也是层级意识？
//布兰奇：喔，我还从来没和C层群的层级意识交流过呢，很高兴认识你。对于你的问题，我的回答是，某种程度上，我们是相似的，你完全可以把我看成某种化身，但未必就是我现所在层级的，或者说，我所在的这个层级本身亦是某种虚无缥缈之物实体化的产物。
//友佳：噢——我有一个想法。
//布兰奇：什么想法，你可以和我说。
//友佳：我想组一个联盟，一个保护广大流浪者与非敌对实体的联盟。光靠他们自己的力量我觉得还是有点无力，我觉得我们这种存在，可以联合起来携手保护他们。
//布兰奇：挺好的，我一直都在努力保护我的客人们，有与我目标相同的意识体帮忙，当然是极好的。
//
//交流对象：Level C-307的层级意识
//交流途径：“Level C-307居住建议网上服务平台”
//
//友佳：你好。
//Level C-307：你好，额，你找我有啥事？
//友佳：我看M.E.G.的数据库里说，你是个极其热心保护流浪者们的层级，是吗？
//Level C-307：当然。👌
//友佳：那太好了～
//Level C-307：？
//友佳：我是Level C-633的层级意识，我想请你和我一同建立一个联盟 ，合力保护流浪者们，如果可以的话，还可以保护一下那些友善的实体们。
//Level C-307：正好，我也在用自己的力量把孩子们从那些危险的蠢蛋手里救下来，那我就加入吧。他们值得被这样对待。
//友佳：太好了。我们先把彼此互通搞定吧。对了，你不打算造个化身吗，这样不仅和他们交流起来更方便，还能吸引更多的人去你那里。
//Level C-307：我得考虑一下
//
//备注：在此交流发生后不久，Level C-633与Level C-307出现了相连的双向入口。同时，“Level C-307居住建议网上服务平台”上出现了一投票活动：“你们想我打造一个与你们交流的化身吗？”
//
//交流对象：“落舟湾”
//交流途径：未知
//
//友佳：你好，我是Level C-633的层级意识。
//“落舟湾”：哦，知道了，请问你找我有什么事？
//友佳：我想把乐意保护人类和有善实体的层级意识和其他强大存在结成一个联盟，大家分头救助的效果应该没有合作的效果好。
//“落舟湾”：哦。
//友佳：你愿意加入进来吗？
//“落舟湾”：我只想独自好好地照顾我的舟楫之子们……等等，友善实体？我得想想……
//
//备注：经Level C-633的层级意识反映，“落舟湾”至今未于此事给予任何回应。
//
//
//
//脚注
//1. 既然这个叫法便于你们理解，那我就这么叫吧
//2. 经M.E.G.相关人员讨论，该名层级意识化身被允许编纂本文档，且保留其语言风格，以向各位流浪者体现该层级的特点
//3. 如悲尸身体产生的黏液不再会使流浪者变为悲尸
//4. 推测其提高的速度起始时极快，而后减慢，这可以解释该层内大部分实体的智力为何都不低于人类中等水平
//5. 至少目前据我的了解是这样
//6. 此时这些腰果水不会对人类的身体造成伤害
//7. “编码员也痴迷于现代电子设备，除了修理和持续使用电子设备，它们似乎把科技视为上帝。”——引用自Entity 136原文档
//8. 以下皆省去交流途径本身所具有的特定格式
package lvls16x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1633{}