//Level C-644
//评分: 
//+18
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//Level C-644是后室C层群的第644层。
//
//描述
//Level C-644是一处非线性空间，其内部是一座博物馆大楼。
//
//f6e040a84ffe4f76.png
//Level C-644 内部拍下的照片。
//
//Level C-644中开放的展厅分为五个展区：史前文明、古代文明、近代文明、现代文明、概念区。除概念区外，其余四区均类似前厅中的博物馆，展出属于已知人类文明的展品，每个展区又分为农业、工业、社会、战争四个子分区。Level C-644的某些楼层还存在一扇标有“空白域”的大门，处于上锁状态。使用特殊手段破坏空白域的门锁后，流浪者将在门后看到一个空荡的展厅，不存在展品的展台零星地分布在此空间中。
//
//“楼梯间”是连接Level C-644各楼层的唯一枢纽。在此处进行探索或滞留的流浪者不会遭到层级内实体的袭击，但是楼梯间内空气较稀薄且长期存在甲醛等装修产生的有毒气体，所以并不建议流浪者长期停留于楼梯间。
//
//史前文明
//史前文明区的展品年代最早可追溯到前厅300万年前的旧石器时代，目前所发现最晚的展品为来自距今5000年前新石器时代的红陶碗。史前文明区的展品均是放置在混凝土展台上，且无任何保护措施。由于这些物品均经过了千年以上的腐蚀或风化，导致其结构变得十分脆弱，故并不推荐流浪者拿取这些物品或作为防身武器。
//
//史前文明区存在自然的杏仁水湖泊，湖泊周围有时可以找到一些原始人类搭建的草棚。
//
//古代文明
//古代文明区展示的是前厅中5000年前-公元15世纪的人类文明。
//
//古代文明区展示了更多的农具，并且此区域的部分展品开始用玻璃保护，但保护展品柜用的玻璃脆弱不堪，可以轻易摧毁。
//
//流浪者从古代文明区的展品柜中可以获取一些质量尚可的工具或冷兵器。并且在随机出现的古代建筑群中，流浪者可以找到一些陶制的空记忆罐。
//
//近代文明区
//近代文明区展示的是前厅中公元16世纪-19世纪的人类文明。
//
//在此分区，流浪者可以找到结构简单但可正常发射的枪械，这有利于对本层级的深入探索。
//
//在一些楼层出现的近代文明区中，铁路从墙壁出发，延伸到楼层的每一个角落。沿着铁路前进的流浪者会找到一辆生锈的老旧蒸汽动力火车头，车体已经严重损坏并且无法发动。在“夜晚”探索时进入火车头避难的流浪者称，时常会听到引擎中传来的叹息声。火车头中还能找到一些被开启过的罐装龙肉，但罐内的肉类并没有变质的迹象并可正常食用。
//
//现代文明区
//此分区是目前该层级中唯一拥有稳定出口的区域。
//
//现代文明区展出的展品来自于从20世纪至今的前厅人类文明，并且展厅装修与前厅的各种场景十分相似。
//
//在此区域，展品是用钢化玻璃保护起来的，这使得破坏玻璃变得困难。流浪者可以在这里找到枪械、可供智能设备充电的电源，Wi-Fi在此分区也是全范围覆盖的。
//
//现已知，“战争”子分区的场景原型为前厅的凡尔登战役、诺曼底战役等著名战役的战场。战争区存在一扇上面挂有时钟的木门，打开这扇门会将你传送至Level 299。虽然该出口目前仅在现代区被发现，但在失落一族的文献中，这扇木门在上文的几个分区都出现过，并且通向的层级并不唯一。
//
//概念区
//概念区在楼层中出现的频率相较于其他区域要更低。此区域展出的展品经考证，不属于任何已知人类文明，且均不能被人类所理解。在此区域经常出现的展品包括：
//
//用途不明的机械装置
//播放怪异图像或视频的电脑
//用文字随机拼凑而成的无意义书籍
//流浪者本身
//概念区并不存在能被辨认的子分区，并且其展厅的墙壁会有部分是由可切入物质组成的。当流浪者处于绝对值大于10000的楼层时，Level C-644的空间会变得不再稳定，这一部分的比例也会逐渐扩大。我们并不建议流浪者在概念区停留过久。
//
//
//Level C-644理论上来说有无限层，每一层的墙壁上都有阿拉伯数字标识。
//
//被称为
//“餐厅”的地点会在Level C-644中随机的楼层出现，流浪者可以在餐厅里获取随机的食物，杏仁水和皇家口粮也时常有被发现的记录。

//
//Level C-644各楼层能且只能通过楼梯往返。Level C-644内也存在“电梯”，但并不推荐流浪者们使用，因为所有使用了电梯的流浪者都无一例外地消失了。研究者推测，“电梯”可能是一种实体，属于窗户的亚种，不过尚未得到证实。

//
//Level C-644具有与Level 0相似的性质，即使处于同一层内，流浪者也无法通过任何方式感知到其他人。

//
//Level C-644的墙壁上有时会出现窗户，但窗外永远显示白昼的景象。流浪者可以从窗外看到电脑背景般静态的蓝色天空和白云，但看不到地面或任何其他建筑物。
//任何试图破坏窗户的行为均宣告失败。
//
//Level C-644内存在能正常运作的钟表，但任何钟表所显示的时间都是“绝对错误”的。Level C-644内存在一个基准时间，流浪者可以根据此时间来判断自己是否安全。
//
//实体
//
//Level C-644内存在少量敌对实体。在“基准时间”的“夜晚”，即23:00至5:00间，猎犬、钝人会从随机位置出现，但它们不会攻击进入“楼梯间”的人类。基准时间5:00以后，这些敌对实体会逐渐消失。
//
//如果流浪者在概念区迷失方向，穿着导游制服的无面灵有时会出现在流浪者附近。它们会为流浪者指明楼梯间的位置，如果流浪者不愿同其交流，它便会消失。
//
//Level C-644的近代文明区内还曾被记录过一次人形实体的发现记录。该实体外形是一名红色头发的欧洲男性，穿着肮脏的三袋五扣式铁路工装。该实体被目击的时候正擦拭着火车头铁皮表面的锈迹，注意到流浪者靠近后，该实体就消失了。
//
//基地、前哨与社区
//流浪者在这里并不能与其他人类相遇，故没有基地、前哨或社区。
//
//入口与出口
//入口
//在Level 11中找到一间博物馆，并破坏任意一件展品，随后你会陷入昏迷。醒来后，你会发现你来到了Level C-644。
//出口
//在大于10000的楼层切出会将你带到Level 11的高空。
//在“现代文明”展区的战争区找到一道挂着钟表的门，打开这扇门将会把你带到Level 299。
package lvls16x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1644{}