//Level C-612
//评分: 
//+27
//+
//–
//X
//“这就像花一样。如果你爱上了一朵生长，在一颗星星上的花，那么夜间，你看着天空就感到甜蜜愉快。所有的星星上都好像开着花。”
//
//——安托万·德·圣-埃克苏佩里《小王子》
//
// 
//
//生存难度：
//安全
//宜居聚集地
//无有害实体
//Level C-612是后室C层群的第612层。
//
//描述
//x03LKU.jpg
//Dr.Exupéry摄Level C-612卫星的一次落日
//
//Level C-612是一处包括一颗体型极小且运动较缓慢的行星极其卫星和一颗体型较大的恒星空间，行星及其卫星形成了常见的双星系统，行星与恒星的关系类似于典型的前厅太阳系天体系统。
//
//行星上包含了完善的大气与生命循环系统，含有平原、森林、沙漠、雪山山脉及湖泊地形，常见于行星上最早的生物主要包括鸟类、狐属动物、树木、少量其他杂草，尽管如此层级被研究确定不具有实际上产生原始生命的能力，但能支持生命的生活。Level C-612的行星上有明显的昼夜更替。一昼夜时间为大约二十小时，白昼与黑夜一般情况下时间均等，协调后室时下一年的昼夜变化偏差不大于四分之一秒。
//
//该层级行星的卫星相较于行星而言体积更小，但同样具有完善的大气与生命循环系统，能够支持生命生活。卫星上普遍覆盖雪山，在部分雪山顶峰会存在一小块草地，尽管植物被证明是无法在山峰上存活的。夜晚期间层级卫星温度不低于零下三摄氏度，最高不超过三摄氏度，温度不随高度而变化，雪山的冰雪虽然在较高温度下仍不会消融，取样调查中将雪样本放入调查一起或带出层级后雪快速消融为常规的水。
//
//Level C-612已经证实为一个宜居层级，可以进行小规模的聚落居住。聚落居住人数被严格限制，应经申请审批后进入，每日层级内包括流动的流浪者以内的人流量不得多于四十人，除警备人员外的任何人不得携带火器、炸药等工具，不得进行或参与对层级原生动物的捕猎活动。
//
//为防止对层级已形成的生态系统造成危害，未经允许不得带入任何植物或孢子、种子，不得带入除日常饲养家禽外的其他动物，亦不应将将其在Level C-612放生或散养。对该层级的资源利用被限制在一定范围内，砍伐植物或大规模踩踏是绝对禁止的。在保证生态平衡的前提下允许引入少部分动物在野外自由生活以弥补生物种类单一的不足。在此限度内允许猎捕定量的动物供生活用。
//
//被允许居住或进入Level C-612进行游览活动的流浪者应至少已满十七周岁，无迷幻药或精神麻醉药物服用史，无诸如精神分裂症、躁郁症或可能导致失控行为的精神疾病史，曾具有过暴力行为或暴力行为倾向者同样不得进入本层级居住或进行游览活动，对于症状较轻且经过许可的研究者不算做内。Level C-612最早的发现者是Antoine Prites，但对于其本身已存的资料甚少，唯一对该发现者的来源来自早期层级研究团队负责人Elena Bright博士公开的笔录及采访材料。
//
//小王子
//photo-1643439766762-b3731e689f83?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&
//使用软件模拟出的小王子大致外观（后视图）
//
//Antoine Prites，在层级早期历史资料中常以“小王子”代称，被认为是Level C-612最早的发现者。A.Prites是一名年龄在9～11岁之间的男孩，能使用法语进行交流。现存影像资料中对其衣着的描述通常为绿色着装，系黄色绸制围巾及腰间束巾，金黄发色，脸型整体较圆润，部分资料中对服饰颜色的记载略有偏差，但大致种类搭配相同。
//
//尽管针对A.Prites的一切研究结果都表明其与人类的生理及心理特征完全一致，但目前所具有的历史数据都表明他真正出现在后室的时间远超出体检所显示的生理年龄时间，据推测他第一次在后室活跃的时间约在1942年左右，曾有流浪者在Level 201目击了其的存在，其他目击报告亦覆盖包括已不存在层级Level C-490或隐秘层级礼物平原在内的十余个层级。自2022年7月21日后再无针对A.Prites的任何有关目击文件。
//
//- 交涉记录：Le Petit Prince.txt
//采访者：Elena Bright博士
//
//受访者：Antoine Prites
//
//Elena Bright：你好。
//
//Antoine Prites：您好，您是谁？
//
//Elena Bright：我们是从别的地方来到这里的人，想参观一下这里。这些玫瑰花都好好看，是你种下的吗？
//
//Antoine Prites：是啊，我花了好多时间才种下这些玫瑰花，它们的种子来自很多别的地方，但她们不喜欢自己的地方，所以就和我来这里了。您愿意和我聊一会儿吗，我很苦恼。
//
//Elena Bright：你在苦恼什么？
//
//Antoine Prites：我有自己的玫瑰花，但它和我赌气了。
//
//Elena Bright：你苦恼的时候会做什么？
//
//Antoine Prites：您知道这里的月亮吧，那颗月亮很小但又很清晰，比我以往见到过的任何一颗月亮都要清晰，它太小了，只要搬动椅子，就可以想什么时候看夕阳就什么时候看。如果我心情不好的时候，就会看日落，有一天我看了四十四次日落，当人们感到非常苦闷时，总是喜欢日落的。
//
//Elena Bright：你为什么和自己的玫瑰吵架了？
//
//Antoine Prites：我想让我的那颗星球种满花花草草，但她不愿意。她说自己是随着太阳出生的，这座星球应该只有她一朵花。后来我就离开了我的星球，我去了好多地方旅行，最后到了这里，这里和我的星球很像。
//
//Elena Bright：你多大了？
//
//Antoine Prites：九岁，也可能是十岁，或者十一岁？我也不确定，我的玫瑰记着我的生日，但现在她也不在我身边了。
//
//[一段沉默]
//
//Elena Bright：你去过前厅吗？
//
//Antoine Prites：前厅？我可能没听过。
//
//Elena Bright：就是地球——地球你知道吗？
//
//Antoine Prites：我知道那里，我曾经去过那里一次，那里是一片沙漠，非常非常广阔。但是那里的日落没有这里的好看。
//
//Elena Bright：你喜欢这里的日落？
//
//Antoine Prites：我还是喜欢月亮上看到的，我会给你看的。
//
//Elena Bright：你真的好像我小时候读过的儿童读物里的一个角色。
//
//[记录结束]
//
//- 交涉记录：ThePrience.txt
//采访者：Elena Bright博士
//
//受访者：Antoine Prites
//
//Elena Bright：又见面了，近来还好吗？
//
//Antoine Prites：我好多了，谢谢你，最近我的花儿们都长大了。她们很可爱，比我以前的玫瑰花还要可爱，我希望她们能在这里成长下去，不会再有人打扰她们。
//
//Elena Bright：嗯
//
//[一段沉默]
//
//Elena Bright：不会有人打扰她们的。
//
//Antoine Prites（指了指Elena的手）：您拿的那个是什么？
//
//Elena Bright：这个是润唇膏，你可以把它涂在嘴上，能让你嘴唇不那么干，我已经涂过了，你试试。
//
//[Antoine Prites接过润唇膏，涂在嘴上]
//
//Antoine Prites：然后呢
//
//[Elena关闭了翻译工具]
//
//Elena Bright：你好！
//
//Antoine Prites：哦，小姐，原来您会说我的语言
//
//Elena Bright：你只要涂上这个，我们就能直接对话了
//
//Antoine Prites：可是，为什么人们要有各自的语言，而不去说同样的话呢？
//
//[一段沉默]
//
//Elena Bright：你可以告诉我你的家在哪里吗？你想家吗？
//
//Antoine Prites：我的那颗星球距离这里很远很远了，我也不能确定那到底是在哪儿。我如果去旅行或者一个人看落日的时候，会想起我的星球和我的花。
//
//Elena Bright：你的花会想你吗
//
//Antoine Prites：小姐，她们应该会的，但只要她们能在这里幸福地生活下去就可以了，不需要她们必须要记得我。
//
//Elena Bright：她们会的，记得你以及幸福地生活下去。
//
//Elena Bright：你说你去过前厅，额就是，地球？你是怎么到那里的？
//
//Antoine Prites：我曾经在星星之间旅行。
//
//[记录结束]
//
//- 交涉记录：解密的附录
//本附录文件来自于Elena Bright的遗产，经其交付人同意后解密公开
//
//Elena Bright小姐：
//
//最近又有很多人来到这里，他们很和善，而且还和我一起浇花，您已经很久没有来了。我从一个似乎和您认识的人那里听说，你最近心情不是很好，如果是这样的话，小姐，你可以试试看日落，那会让心情好很多的。
//
//Antoine Prites
//
//亲爱的Antoine：
//
//很高兴听到你那边交到了一些新朋友，我遇到了一些小问题，在处理完之后我就会去找你的。谢谢你的建议，我现在好多了。不知道你的花儿们怎么样了，代我向她们问好。
//
//Elena
//
//Elena Bright小姐：
//
//我数了数，现在这里有21朵玫瑰花，都长得很漂亮。只是有一株枯萎了，我觉得有些伤心。凋零的花朵都去了哪里呢？
//
//我总是能想起我的花儿，它是亿万颗星星中独一无二的一株花儿，我看星星的时候，总能想起来那朵花。一开始我的星星上只有很小的几株花，早上开放晚上就凋落了，后来不知道从哪里来了一颗种子，长出一朵特别美丽的花儿来。
//
//Antoine Prites
//
//Elena Bright小姐
//
//我和我的花儿吵架了，我想要保护她，把她放到罩子里，可是她不愿意。她说自己不怕蝴蝶、大动物，她有四根刺来保护她。
//
//她怕我看到她哭，但是我还是看到了，她是一朵多么骄傲的花1
//
//Antoine Prites
//
//Elena Bright小姐：
//
//我的花儿们长得很好，现在已经是一座盛开的玫瑰园了。有人送了我一条狐狸，他总能让我想起我过去曾经遇见的一只狐狸，有时候周围没有人在的时候，我就会和他说话。
//
//一些事情也让我有点不安，来到这里的人似乎越来越多了，有一些还会一直待在这里不走。昨天我在给花儿除虫的时候，竟然有人想要抱走我的狐狸。
//
//Antoine Prites
//
//亲爱的 Antoine：
//
//我在联系人试着用别的方案去解决这问题，现在流浪者进入层级要受到审查了，你的花园已经被保护起来了，不会有人再去打扰你们了。对不起这造成了困扰。希望以后不会再出现这样的事。
//
//最近出了好多事情，我会尽快抽身到你那的。希望接下来一切都好，如果还出了什么事请让我知道。
//
//Elena
//
//Elena Bright小姐：
//
//今天早上起来，我的花儿们都走了，我不能理解为什么别人会讨厌我的花儿和我的狐狸。
//
//明早我就要回家了。
//
//Antoine Prites
//
//Antoine：
//
//我现在就来，我们在你的花园里相见。
//
//Elena Bright
//
//- Elena Bright博士的笔录
//那天晚上，夜空若天鹅绒般柔和，静寂的只剩下风吹树曳的溪声，自然的洪流不经意间能够将人淹没，朦胧下，看到凋零的花儿，枯萎的花瓣腐入泥土中。
//
//小王子提着一盏灯笼，灯火微弱，他童真的脸在火光中若隐若现，脸色惨白。
//
//“小姐，我很高兴你心情好多了，希望你也能会去……我也要回家了”他脸上显出几分忧伤：“我的家在很远很远的地方，我要去看我的玫瑰了。”
//
//“我不会让别人再来打扰你了，他们都会搬走，你可以留下种下你的花儿。”
//
//他摇了摇头，拽着我的手，在花园边的木凳那里坐下。那时黎明初起，夜月将落，晨云被揉成奶茶色，伴着天边太阳的升起，寂静融到西山的月夜中，曙光暗涌。
//
//“今天，我看了一次日出”他说着，似是要站起来：“我的花，我已经离开她很久啦，她也会想我的，而且她太柔弱了，自己一个人会害怕的。”
//
//我没有说话。
//
//他终于还是没有站起来，似乎是再没有力气，倚在我的肩膀上，有几分抽泣，他在哭。
//
//“我不能带着这幅身体离开，他太沉了，我的星星在很远很远的地方……”
//
//“你可以从你的星球上，晚上去看看星星”我用手抚摸着他的头发：“我也会和你一起看星星的”
//
//海上生明月，天涯共此时。
//
//他点点头。
//
//“你和他们都不一样”他想了想，又说
//
//“‘谁’们？”
//
//“那些除你之外，其他来这里的人”他从兜里缓缓拿出几粒玫瑰花种递给我：“给你的”。
//
//我动了动嘴，但是不知道该说些什么。
//
//“就是这些……我要走啦”
//
//伴着初醒的世界，他的脚踝子骨附近，一道黄光闪了一下，刹那间他一动也不动了，他没有叫喊，仍然倚在我的肩膀上。
//
//我的家庭是个很典型的中国家庭，至少在我中学之前是这样的，没有电视剧中的精致完美，也没有小说中的家门不幸。
//
//我奶奶是文革之后最早的一批大学生，她那时爱读诗，特别是明清时候的诗，有天我偶然看到她桌案上关于玫瑰的诗句。那时候我并没有见过玫瑰，但对它想的很多，于是我也画下了我的第一张玫瑰。
//
//我把它拿给大人看，她们回答我说：“不要净做些没有用的，有时间画这些东西不如去背背古诗，我给你留的算术题你做完了吗”
//
//我回答“哦”，然后悻悻地回我自己的屋子里了。那张画后来我并没有保存下去，大概是当草纸了吧。总而言之，就在我十岁的这一年，我当画家的梦想便飞走了。
//
//后来这件事情我差不多忘记了，我也不再愿意去谈论幼年时的花儿、裙子和芭比娃娃，转而去考虑升学、租房、实习、四六级……，于是我就成了个在别人眼中无聊的人，大人们很高兴看到我没有多叛逆。
//
//某天早上，我到新发现的层级勘察状貌，在林间看到一个黄色围巾、金发碧眼的小男孩，正一边因和花儿赌气而苦恼，一边默默地种着玫瑰花，已经长成的花儿朱红惹眼，正如十年前那个美的不真实的诗句。
//
//新叶烟中冉冉，轻香风外离离。朱英半染蝶翅，绿刺故牵人衣。
//
//那是我第一次见到小王子。
//
//基地、前哨与社区
//流浪者社区-B612
//由M.E.G.维护治安；
//社区居住的流浪者最多不超过15人；
//以小规模聚居形式位于Level 612的平原地区；
//以养殖和耕作为维持社区运转的方式；
//入口与出口
//入口
//Level C-34的南方公路网络可以进入本层级
//在Level C-150想象一扇通向任意拥有“门”这一实体层级的门，敲三下门后打开，过程中默念Level C-612并想象层级状貌，可以进入本层级
//在Level C-199可以找到一张标有“小王子”的名片，持其翻出庭院可进入本层级
//出口
//在层级任何位置以常规方式切入即可
//在花园中切出可以进入Level 599
//作者信息
//« Level C-611 | Level C-612 | Level C-613 »
//
//Footnotes
//1. For she did not want him to see her crying, she was such a proud flower
package lvls16x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1612{}