//Level C-605
//评分: 
//+6
//+
//–
//X
// 
//
//生存难度：
//等级 迷雾
//
//未知信息
//大雾弥散
//暂无出口
//Level C-605是后室C层群的第605层，被雾气所笼罩。
//
//描述
//切入该层级的流浪者会在露水丰沛的土壤上醒来。
//
//Teleferiqo.JPG
//无人机所拍摄的无雾区域，正有一缆车驶来
//
//而以此切入点为中心的150m半径范围内，可见地貌近似中纬度地区森林-山地，但仅生长有单一的冷杉树，并无其他物种。在此范围外，此层级其他部分均被无法驱散的浓雾所覆盖，目前尚不能确定层级其余部分信息。
//
//雾气主要由水液滴聚成，对人类并无毒害及异常作用。此层级存在天气变化和以24小时为周期的昼夜更替现象，但其气温恒定为14摄氏度。且不论何种天气，无雾区外雾气均不会消散。
//
//流浪者可在近无雾区边缘处看到一较高的缆车杆及配套机械，缆车索道。在缆车杆下方可能有部分流浪者尸骸及衣物等，若可利用请尽量回收。
//
//每隔约30分钟，将有一台缆车以图示方向以缓速驶来，其为完全空置，且缆车门并未上锁。流浪者可由缆车杆侧爬梯登上上侧机架，并在缆车接近时滑开车门进入缆车。请注意，若流浪者坠落将大概率导致死亡。
//
//收起
// 
// 
// 
// 
// 
//
//M.E.G.层级通告
//
//人员安排
//
//||||  2022年8月31日发布
//BTC-L0:01.00:01.00:00
// ||||
//
//根据当前信息，此层级并无可感异常现象，亦不存在任何可利用资源。对所谓雾气进行的探索亦未发现任何异样，但鉴于目前仍无离开该层级的方法，故不再组织对该层级的探索，亦不鼓励流浪者前往。
//
//基地、前哨与社区
//雾隐者：
//由最初M.E.G.派遣进入的5名探险者组成，在多次尝试切出失败后被迫留居其中。他们贡献了此层级文档的主要信息。目前其成员均已失联。
//
//隐藏
//你好，不知名的流浪者。
//现在感觉还不错。
//披着外套，双腿消失在雾气里面。
//缆车晃晃悠悠地前进着。
//
//只是旁边的肉，几乎不剩多少了。
//我们在这片雾气里走了好久好久。
//填充了许多入口。
//可惜，还是不知道怎么离开。
//
//我想起在那里……度假的时光。
//缆车晃晃悠悠，白雾涌起。
//只有风声告诉我，我们也许是在前进。
//雾蒙蒙，不分西东。
//就像现在一样。
//只可惜，恐怕它再不会到达终点。
//
//该走啦。
//希望我不会再掉到那个地方了。
//该结束了。
//
//入口与出口
//入口
//以恒为14摄氏度的水雾覆盖全身后，饮下一杯冷杉树上自然凝结的露水即可切入该层级。
//在露水丰沛的土壤上睡眠超过8小时有概率切入该层级。
//从各类行驶中的缆车坠落有小概率切入该层级。
//出口
//未知
package lvls16x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1605{}