//Level C-613
//评分: 
//+2
//+
//–
//X
//
//Level C-613修订
//
//生存难度：
//等级 5
//
//不安全
//不稳定
//精神攻击
//Level C-613是后室C层群的第613层。
//
//描述
//Level C-613是一个20m×1000km的环型街道，会在道路旁随机出现建筑物，已知固定建筑物有见下表“区域特点”一栏。因第一污染区域中燃烧的蜡像女人可以对一定范围内的流浪者的精神和生理进行影响，所以划分了成了四个区域。Level C-613的四个区域在街道第10km/900km/950km/1000km处离开。1
//
//安全区域
//安全区域 是Level C-613中最安全且宜居的区域，它位于流浪者行走方向的起点至行走方向的10km。你可以在这里找到少量杏仁水仓库、极少量装有皇家口粮的箱子。这里是Level C-613少有可以大声喧哗的区域。
//
//三级污染区域
//三级污染区域是Level C-613中较为危险但比较稳定的区域，它位于流浪者行走方向的11km至900km，是Level C-613中区域最大最广且物资最多的区域。蜡烛走廊是三级污染区域唯一一个且是最危险的固定建筑物，它将让你进入永久性眩晕。
//
//二级污染区域
//二级污染区域是Level C-613很危险且不稳定的区域，它位于流浪者行走方向的901km至950km，是Level C-613中物质最少的区域。二级污染区域街道两旁均建有仓库，其中多为实体。2充满蜈蚣的仓库是最为常见的建筑物。
//
//一级污染区域
//一级污染区域是Level C-613极度危险且极度不稳定的区域，它位于流浪者行走方向的951km至1000km，拥有目前所知的所有物质。街道上放置至少1000+的燃烧中的女性蜡像，但因为Level C-613的特殊性质，在进入一级污染区域时就会立刻死亡。
//
//蜡烛走廊
//蜡烛走廊是在三级污染区域的固定建筑物，它的外观是一个由白色大理石搭建的走廊，在地上放有许多燃烧中的蜡烛。它被《威廉沉思录》形容成Level C-613唯二的原生实体。任何进入该建筑物的流浪者都会陷入不可逆的永久性昏迷，不久昏迷的流浪者就会于蜡烛走廊消失。
//
//污染区域分级	危险等级	身体反应	区域特点
//安全区域	宜居、安全	无反应	少量杏仁水仓库
//一级污染	极度危险、不稳定	即刻死亡	燃烧的蜡像女人
//二级污染	危险、不稳定	不定时晕厥	充满危险的仓库
//三级污染	较为危险、较为稳定	轻度呕吐、眩晕	蜡烛走廊
//基地、前哨与社区
//M.E.G. “快乐小组”(废弃)
//M.E.G. 快乐小组于2001年2月7日废弃，其成员全部因未知原因造成了PTSD。但此处还存有数量可观的杏仁水。3
//蜡像女人俱乐部
//加入我们，成为我们，享受梦境4
//入口与出口
//入口
//在任何安静的情况下构思一条黑暗的走廊就有几率来到806房间走廊进入房间即可返回原本的层级 ，一直往前走就会切入Level C-613。
//出口
//没有什么可以离开，没有什么可以毁灭，我不可能失败，主人的命令必须遵守！
//我爱这里，你也是，对吗？
//我爱这里，你也是，对吗？
//我爱这里，你也是，对吗？
//我爱这里，你也是，对吗？
//我爱这里，你也是，对吗？
//对吗？
//于三级污染区域找到一本名为“威廉沉思录”的书，大声诵读即可切入Level 11。
//于安全区域找到一家花店，走进售卖洋甘菊的位置即可切入level A-7。
//-数据加载错误
//
//我至高的国王，我的主人，我的梦！
//
//- 加载成功
//- 输入成功
//- 访问成功
//那个女蜡像可以访问和更改文件!不要相信关于它的任何信息，请不要相信本页面的带有斜体文字的信息
//
//- 访问成功
//我看到你了哟
//
//你应当知道，你来到这里就是一个错误，你本来有机会离开806房间走廊的，离开这里的方法和进入这里的方法是相反与正确的，这里是一些你务必遵守的建议：
//1.永远也不要贸然进入建筑物，只有安全区域是绝对安全的。
//2.与Level C-613有关的任何页面都会被修改，包括但不限于现象、实体、故事。
//3.尽量在三级污染和二级污染区域保持安静，任何超过65dB的声音都会引发蝴蝶效应，而导致三级污染和二级污染区域的▇▇▇▇▇将发出长达十分钟的超过300dB的声音。
//4.你应当尊重这里每一个实体，任何不敬的语言都将在你无法离开的前提上给予你最大的危险。
//5.你要做到在此永远生存的准备。 ——M.E.G.快乐小组
//
//
//“家”
//到底你有什么秘密？
//
//我看到了。
//
//他们告诉你了什么？
//
//别害怕。
//
//像一支蜡烛一样燃烧吧。
//
//我已经明了。
//
//快睡吧。
//
//别害怕。
//
//我是你唯一可以依靠的人
//
//我是你，你是我，我与你同在。
//
//"生命在他里头，这生命就是人的光。光照在黑暗里，黑暗却不接受光。"
//You'll never leave.
//
//报告
//报告：关于出现在Level C-613中的实体
//描述:
//“麦克莱恩”是在Level C-613里唯一的原生实体，数量未知(≥1000)。
//
//行为：
//“麦克莱恩”是不可移动实体，根据“威廉沉思录”部分片段记载：它能吸引绝大多数流浪者接近他。从外形来看“麦克莱恩”就像是在烈火中燃烧的女性蜡像/雕像。
//
//生物学特征：
//“麦克莱恩”将会不定时在火焰中产出一种肉汁状液体5，少部分接近二级污染区域的“麦克莱恩”产出的液体将覆盖大部分二级污染区域。
//“麦克莱恩”会是附近100m的流浪者产生幻觉，常常会使其有拥抱“麦克莱恩”的意图。“麦克莱恩”会发出类似于教堂颂歌的声音。
//
//行为准则：
//应当：
//与其保持距离。
//不应：
//聆听其发出的声音。
//接近它。
//<开始记录>
//A：你听见了吗？
//B：什么玩意？你刚刚一直在望着那个雕像！所以说快点离开这个鬼地方，再向前走你就没命了！
//A：可是，你真的没有听见吗？多美啊…
//
//B：A！你现在很不正常，它对你的精神产生了影响快走吧。
//
//A：不……你难道不想与她永远在一起吗？
//
//B：（奋力地拉A）你要干什么？
//(A开始抽搐)
//A：你没有听见吗？她在叫我呢…… (B抓住了A的手)
//
//B：混蛋！你要做什么？
//(A跑进了一级污染区域，死亡)
//
//<结束记录>
//
//《威廉沉思录》
//《威廉沉思录》被认为是在Level C-613生存的法宝，它是以日记形式编写的书籍。《威廉沉思录》十分容易找到6。它详细的记载了“麦克莱恩”、四个区域以及蜡烛走廊。
//作者：据说是一个前Level C-163实体，已灭绝。
//
//
//部分资料
//这些是Level C-613中《威廉沉思录》部分可公开资料。
//以下均为在《威廉沉思录》中挑选的可公开资料。
//
//哦，感谢上帝。“麦克莱恩” 向来会宽恕任何人，但无论何时在它面前说出任何不文明的语言或做出任何不文明行为都会导致不可逆的事情发生。
//
//蜡烛走廊可不光是由大理石搭建的走廊建筑物，它是十分危险的实体。7大多数流浪者都在那永久性晕倒了，是的我很清楚这代表什么。他们8大多数都重新“回到”了他们幻想中的后室，这是十分危险的，我亲眼看见他们嘴里在喃喃自语什么的……如果他们在自己的幻想中“死亡”那么就意味着不久之后他就会被蜡烛走廊“消化”。
//
//在你极度饥饿时，那些油腻的肉汁黏液是你最好的选择，不要去追求找到什么杏仁水或者根本不可能找到的皇家口粮了，虽然可能有些副作用，但它提供给你的饱腹感可以供你找到足够的杏仁水了。
//
//看到这些文字，你应该明白那些二级污染区域的仓库全都是不可信的，从冠冕堂皇到衣衫褴褛都是一堆恶心人的实体，你进入二级污染区域的目的只有一个，在你极度饥饿时去那里找黏液吃，这很值得。安全区域和三级污染区域是你在正常情况下待的区域，其他区域的入口那块地方我都放了指示牌，不到万不得已不要去，那不值得你去。那些女蜡像也不可能被你们这些凡人普通人毁灭。
//
//服用任何精神药物在Level C-613 都是徒劳，它们改变的是你这个人而不是你弱小的精神或什么玩意的…
//
//
//Level C-613原始版本
//请勿相信“ Level C-613 旧版”中的任何信息，本页面修改率达85%。
//因修订版本增添了部分信息，可能与原始版本有出入。
// 
//
//生存难度：
//等级 5
//
//快乐
//享受
//绝对安全
//Level C-613是后室C层群的第613层。
//
//描述
//Level C-613是一个20m×1000km的环型街道，会在道路旁随机出现建筑物，已知固定建筑物有见下表“区域特点”一栏。Level C-613的四个区域在街道第10km/900km/950km/990km处进入。9
//
//安全区域
//安全区域 是Level C-613中最安全且宜居的区域，它位于流浪者行走方向的起点至行走方向的10km。你可以在这里找到少量杏仁水仓库、极少量装有皇家口粮的箱子。这里是Level C-613少有可以大声喧哗的区域。
//
//三级污染区域
//三级污染区域是Level C-613中没有危险且稳定的区域，它位于流浪者行走方向的11km至900km，是Level C-613中区域最大最广且物资最多的区域。蜡烛走廊是三级污染区域唯一一个且是物质最多的固定建筑物。
//
//二级污染区域
//二级污染区域是Level C-613不危险且稳定的区域，它位于流浪者行走方向的901km至950km，是Level C-613中物质种类相对多的区域。二级污染区域街道两旁均建有仓库，其中多为友善实体。充满快乐的仓库是最为常见的建筑物。
//
//一级污染区域
//一级污染区域是Level C-613极度安全且极度稳定的区域，它位于流浪者行走方向的951km至1000km，拥有目前所知的所有物质。街道上放置至少1000+的女王雕像，在流浪者进入一级污染区域时，他就已经成为了她的一部分。
//
//污染区域分级	危险等级	身体反应	区域特点
//安全区域	宜居、安全	无反应	少量杏仁水仓库
//一级污染	不危险、稳定	无反应	女王雕像
//二级污染	不危险、稳定	无反应	充满快乐的仓库
//三级污染	较为危险、较为稳定	无反应	蜡烛走廊
//基地、前哨与社区
//M.E.G. 快乐小组
//M.E.G. 快乐小组 能给你最好的帮助，来到他们的基地，这十分值得。
//蜡像女人俱乐部
//加入我们，成为我们，享受梦境。我们将如题古树一般长寿，如天空一般宽阔，如海洋一般波涛。
//入口与出口
//入口
//在任何安静的情况下构思一条黑暗的走廊就有几率来到806房间走廊一直往前走就会切入Level C-613。
//出口
//你难道不喜爱这里？这里是多么美好与幸福啊。
//我爱这里，你也是，对吗？
//我爱这里，你也是，对吗？
//我爱这里，你也是，对吗？
//我爱这里，你也是，对吗？
//我爱这里，你也是，对吗？
//对吗？
//- 加载成功
//- 输入成功
//- 访问成功
//加入我们，成为我们，走入第一区域，和我们同在。
//
//- 访问成功
//我看到你了哟
//
//你应当知道，你来到这里就是一个错误，你本来有机会离开806房间走廊的，离开这里的方法和进入这里的方法是相反与正确的这里是一些你务必遵守的建议：
//1.你可以随意进入建筑物，只有安全区域是绝对安全的。
//2.与Level C-▇▇▇▇的任何▇▇▇▇▇▇▇，▇▇▇▇▇▇▇▇、▇▇、▇▇。
//3.尽量在三级保护和二级保护区域安静，任何超过65dB的声音都会引发蝴蝶效应，而导致三级保护和二级保护区域的废弃留声机将发出长达十分钟的《命运》钢琴曲。
//4.你应当尊重这里每一个实体。
//5.你要做到在此永远生存的准备。 ——M.E.G.快乐小组
//
//作者信息
// 
//
//作者信息
//« Level C-612 | Level C-613 | Level C-614 »
//
//Footnotes
//1. 此数据以流浪者行走方向为准，因Level C-613特殊性质，没有流浪者能走完环形街道。并且每个人看到的建筑物都不一样。
//2. 众多资料表明，这些仓库仅仅只是“折叠”于Level C-613，并非Level C-613本身
//3. 请注意，因Level C-613的特殊性质，前往任何一个荒废、未被探索、坍塌的建筑物都是十分危险的。
//4. 无法找到下文的内容
//5. 一种发酸且油腻的可食用液体，饱腹感极强。但会有恶心、呕吐和晕厥等副作用
//6. 首次发现在三级污染区域的废弃图书馆
//7. 还未证实该信息
//8. 这里指永久性昏厥的流浪者
//9. 因脚注均带有误导性，于今日全部删除，留此一条提示。
package lvls16x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1613{}