//Level C-673
//评分: 
//+16
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
//安全
//稳定
//友善实体
//Level C-673是后室C层群的第673层。
//
//描述
//ChinaTown
//一条热闹的步行大街以及一座典型的牌楼，挤满了来来往往的无面灵。
//
//Level C-673的外观极为类似前厅中的唐人街1。
//
//因为此层级与Level 11部分较为相似，所以也曾被认为是Level 11的子集区之一。但通过LPS(层级定位系统)和层级密钥确认这应为C层级中的一个独立层级。
//
//Level C-673并非常规意义上的开放式层级。此层级的线性空间性质遭到轻微扭曲，如若沿着直线行走可能会不可察觉的返回起点，甚至使用飞行单位进行侦测也是如此，因此无法确定其是否存在真正的边界。指南针或电子地图设备等将会失灵，但使用手绘地图或招募人工向导不受影响。
//
//Level C-673的实体包括无面灵和车兽等，有时可以发现被驯养的母鸡2。部分流浪者声称自己在废弃地域中遇见过悲尸、笑魇和猎犬。
//
//此层级的大部分实体都会表现得更加友善无害，例如拿走母鸡的鸡蛋不再会遭到致命攻击，车兽会允许其他实体进入体内并搭载运输货物，无面灵可以进行沟通并通常会使用中文，包括普通话和地方方言3。但与"第11效应"4相比稍微有差异，只有生成于Level C-673内部的无面灵会自然具有此特征。
//
//此层级的原始建筑通常较为挤迫和破旧，但也有部分建筑被人工翻新。最为常见餐馆5、洗衣店、手艺店和百货店等，并最初由无面灵进行经营。但随着流浪者6的进入和定居，也出现了许多由人类经营的店铺，形成了人类和友善非人实体大范围混居的独特景象。此层级的物资通常由车兽进行运载，但暂不清楚物资来源。
//
//Level C-673为永昼层级，并无日月交替。即使如此，此层级的无面灵也通常会遵循一种较为古老的前厅历法，也称农历或阴阳合历。部分无面灵对于"红星建筑队"较为敏感甚至持有敌意，不建议随意提起或应答与其相关的话题。
//
//Level C-673可以大致划分为以下四种区域或建筑：
//大街
//MainStreet
//一条典型的单向车道，两边停满了车兽。一辆贴着新手标志的车兽载上第一位客人准备驶离。
//
//也称"大道"。通常为双向/单向车道或步行街，街道两侧设有大量的店铺和房屋。
//此层级中贸易最集中的地方，在正常情况下较为热闹和繁华。
//存在大量包括车兽和无面灵在内的友善非人实体以及人类定居者。
//每个大街都有不同的名称或俗称，并且每条大街都拥有至少一个牌楼。
//
//小巷
//和大街相比通常较小较窄，仅容一至四人并肩通过。
//但数量繁多且四通八达，已证实连接了此层级的各个区域。
//大部分小巷具有较为稳定的轻微空间扭曲性质，在熟悉路线的情况下可以使用小巷做到层级内无视距离快速移动。
//因为路线复杂，在不熟悉且无人指引的情况下不建议随意深入小巷。
//
//牌楼
//具有同级变种"牌坊"7。有多种不同的外形、材质、颜色和风格，且均是独一无二的。随着大众化通俗化，此类建筑称呼为"牌楼"或"牌坊"均可(在此档案中统称"牌楼")。通常被视作此层级的锚点和分界标志。同时也是此层级最常用的出入口。
//可自然生成或人工建造，但其效果和性质并无区别。触碰牌楼有极小的概率"看到"此建筑建成时的景象和原因。
//关于牌楼究竟属于带有异常性质的建筑物还是一种特殊实体，目前尚未达成一致结论。
//
//废弃地域
//应为此层级的边缘区域，随着人员迁出和废弃有扩大趋势。
//存在于废弃地域的牌楼通常会消失或坍塌，消失的牌楼目前并无再次出现的记录。
//此区域有可能出现不寻常的黑夜，且大量存在空间扭曲和空间叠加现象。
//具有目击危险实体的记录，在正常情况下不建议进入此区域。
//
//
//
//基地、前哨与社区
//M.E.G. "华埠"哨站
//在一条大街上拥有一栋看起来十分拥挤的迷你写字楼。
//常驻数十名M.E.G.人员，通常为亚洲人种。
//承担部分M.E.G.物资采购任务，提供物资交换。
//唐人街事务所
//在一条大街与小巷的交界处有一个名为"唐人街事务所"的小型店面。
//名义上隶属于B.E.P.(后室实体保护协会)，实际上具有同等的自由裁量权与行动权。
//声称为中立立场，接受寻人/寻物/各方交涉/纠纷调解等各种事务委托。
//无面同乡会
//无面灵自发形成的互助式社区团体，距考据自此层级生成之时就存在。
//此团体的成员会更加熟练使用地方方言，对于使用相同方言的人类具有好感。
//部分无面灵成员较为顽固，抗拒与人类共同生活。
//大唐滴车
//由车兽组成的车队，正常情况下提供电召车/出租车/货物运输等服务。
//较为友善，通常是无偿服务或要求洗车作为回报。不要弄脏提供服务的车兽。
//不知何时有部分小型车兽兼职兴起了外卖行业。
//入口与出口
//入口
//在Level 11中经过一个牌楼。
//在Level C-1中经过一个"熟悉"的牌楼8。
//在C层群中找到并携带一条有些褪色的中国结会显著增大切入此层级的可能性。
//出口
//经过一座标着"無垠城市"的牌楼，将切入Level 11。
//抱有"我想离开此层级"或类似的想法经过任意一个牌楼，将回到最近一次切入的其他层级。
//在经过牌楼的时候许愿想要去的层级，有概率切入目的层级。
//在小巷中彻底迷路将会随机传送到任意层级。不建议使用此方法。
//乘坐大唐滴车并告知你的目的层级，但有时会拒载或前往非目的层级。
//询问此层级的无面灵你想要去的层级应该怎么走，并按照着无面灵指出的方向前进就可以到达目的层级。若是无面灵拒绝回答甚至表现出明显的反感或敌意，应当更换目的地。
//作者信息
//« Level C-672 | Level C-673 | Level C-674 »
//
//脚注
//1. 在前厅中指华人地区以外国家的城市里华裔人士的聚居区，也称华人区、中华街、中国城等。
//2. 由流浪者从其他层级携带至此并在此层级进行养殖。
//3. 常见为广东话、福州话等。
//4. 存在于Level 11的一种异常效应，使Level 11内的无面灵和猎犬表现的更像正常的行人和狗。
//5. 但由于无面灵并没有嘴部，所以大部分食品都被极为热情地给喂给了人类。
//6. 奇特的是通常为亚洲人或具有亚洲血统。
//7. 区别在于牌坊没有"楼"的构造，即没有斗拱和屋顶。
//8. 不知为何，通常只有亚洲人种或有亚洲血统的流浪者可以使用此入口。
package lvls16x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1673{}