//Level C-628
//评分: 
//+11
//+
//–
//X
// 
//
//生存难度：
//等级 变化
//
//变化的安全性
//不稳定
//变化的实体数量
//Level C-628是后室层群C的第628层。
//
//描述：
//Level C-628是一颗面积约为5.6亿平方公里的被潮汐锁定的星球，整个Level C-628分为三个区域，分别为极昼区，晨昏带和极夜区。经过光谱分析得出此层级的主恒星为黄矮星，在该层级内并未观察到其他星体的存在。
//
//极昼区：
//- 隐藏生存难度信息
// 
//
//生存难度：
//等级 5
//
// 
// 
//极端气候危害shamo.jpg
//该照片拍摄于极昼区与晨昏带边缘地带。
//
//Level C-628的极昼区为一片广阔的类似于前厅沙漠地带的区域，该地区地表为红沙与碎石。在离晨昏带10~70公里内会出现混疑土楼房废墟1，在废墟里可以找到一些常见的物品，如杏仁水，罐装龙肉等。在离晨昏带70公里以外都是极高温气候，该地区没有天气变化且永远处于白天，因此该地区温度很高，到目前为止观测到的最高温度达到了76摄氏度2。该层级到目前为止并没有个任何实体的发现记录。目前为止我们仅探索了极昼区离晨昏带100公里以内的区域。
//
//晨昏带：
//- 隐藏生存难度信息
// 
//
//生存难度：
// 
// 
// 
//meijing.jpg
//该照片拍摄于晨昏带的树林区域。
//
//Level C-628的晨昏带是一条各种自然群系组成的大区域，该地区有河流、草原、丛林、高原等自然群系，经过计算得出该区域宽约760~800公里。该地区有天气循环与众多动植物3。该地区地区有11效应的无面灵创建的城市，除了无面灵以外，在此地区未发现其他实体。
//
//极夜区：
//- 隐藏生存难度信息
// 
//
//生存难度：
//不安全且不稳定
//实体横行
//极端气候危害
//Level C-628的极夜区是一片雪原，该地区地表堆积着厚厚的雪4，高原在此此起彼伏，针叶林稀疏的分布在高原上，还有一座座被掩盖在雪里的房屋。该地区气候十分寒冷，到目前为止该地区所观测到的最低温度达到了-34摄氏度,。该区域内的实体有肢团、窃皮者、悲尸等，该地区的实体在任何情况下都不会进入晨昏带。
//基地，前哨和社区
//M.E.G.极昼区气候观测站
//该前哨站位于距离晨昏带约100公里远的极昼区内，驻扎着12名M.E.G.成员，负责观测和记录永昼区的温度变化。
//
//无面灵城
//无面灵城位于晨昏带，整个城市有20平方公里。这里生活着大约3万名无面灵，居住在此地的无面灵会汉语和英语并对流浪者很友好，但他们拒绝回答他们是怎么居住在此地的。
//
//M.E.G.Level C-628中心基地
//该基地位于晨昏带，居住着2000名M.E.G.成员，该基地负责开发晨昏带地区的资源。
//
//入口和出口
//入口
//在Level C-8打开一扇写着 新家园 的门就会来到无面灵城。
//在任意沙漠层级观察其恒星10秒钟就会传送到极昼区的任意区域。
//
//出口
//在无面灵城切出会来到Level 11。
//在永夜区找到一座房子并睡着你就会在Level 790醒来5。
//在永昼区的废墟切出会来到Level C-144。
//
//作者信息
//« Level C-627 | Level C-628 | Level C-629 »
//
//脚注
//1. 通常有6~10层楼高。
//2. 此数据是在距离晨昏带100公里处观测到的
//3. 全是前厅动植物，包括史前动植物。
//4. 厚大约三米 。
//5. 目前为止只有一个人通过此方法来到了Level 790。
package lvls16x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1628{}