//Level C-668
//评分: 
//+34
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
// 
//较不稳定
//K值事件637a47cb16f2c2beb1f5a327.jpg
//停车场。
//
//Level C-668是后室C层群的第668层。
//
//描述
//该层级为一个伴有露天停车场的老式小区，其中矗立着数栋居民楼，每栋居民楼均有八层。每层楼中分布有四间一室一卫一厅的单人住房，这些单人住房装修简陋，流浪者只能在这些房间内发现各种低廉的破旧家具，凹凸不平的木制地板，空气中甚至还会伴有一阵消毒水挥发的刺鼻气味，但这里能找到一些老旧的唱片和播放器。
//
//小区正中心为一个露天停车场，它占据了整个层级内70%的面积，停车场内部停靠有少量汽车，这些汽车均被上锁，且没有打开的方式。为了寻找可用物资，流浪者几乎把所有车子的车窗击碎，但都发现车子内部没有任何物资，除去车窗，车辆的油箱门也被暴力拆解开来，其中也找不到任何的汽油。
//
//Level C-668的地面由劣质的水泥铺成，其地面凹凸不平。偶尔，地面会忽然形成一些小水坑，这些水坑中的水多数为带一些泥土的污水，形成原因未知，层级内的原住民也尝试过挖开地面，但没在水泥铺设下的浅层地面发现任何的泥土。有时你能在这里找到一些突然出现的罐子，罐子里通常会装有半瓶的杏仁水，有小概率装满矿泉水。
//
//在露天停车场的旁边有一间镶进大楼里的管理室，内部量复杂机器，这些机器共同管理着水和电，这间管理室的大门通常被紧紧锁死，只有少数的层级住民才有打开的钥匙。在层级住民的维护下，层级各处还能正常的使用水电。
//
//该层级的时间严格依照前厅时运转，并存在着昼夜循环，且温度也在15至25摄氏度之间徘徊。但层级本身性质并不稳定，早在刚被开发的三个月时就出现了次数近十次的地震、异常降温、实体切入的事件，层级甚至险些因为大量实体切入而被划定为存在较高生存难度的层级。
//
//由于层级环境上实在过于与前厅环境相像，大多数流浪者在进入后都会拥有一种回到前厅的错觉，这无疑加深了层级中流浪者的精神压力，于是在这里常驻的流浪者大多数都患有一定程度上的思乡症。但层级中有此类症状发生的人远比思乡症出现的时间要早得多。
//
//特殊现象
//在该层级中存在一个名为“K值”的底层逻辑。
//
//每个流浪者在进入层级时都会自动存入数额一百的K值，流浪者可以通过K值来互相购入和售出物品。在交换时，购买物品者需要亮出右手手背并将它搭在出售者的左手手背上，然后购买者需要大声喊出有关“K”等的字眼的语句，接着当出售者说出价格并把物品交给购买者时，一次交易完成。
//
//据层级内原住民所说，似乎有人出现过K值变成负数的情况，如果出现K值掉到负数以下的情况，那么流浪者身上会出现一些带有危险性的“随机事件”，例如流浪者在睡醒后发觉自己忽然间出现在停车场中，甚至有人在行走时忽然被一股力量炸的四分五裂。但也无需担心，这些随机事件发现的概率和危险程度都随着流浪者的K值的数量和时间而定，即当流浪者的K值落入负数并持续这种现象较长时，那么流浪者遇见危险程度较高的事件的概率也就越大。
//
//K值整体的涨幅变化没有明确地被任何人记录过，层级内的流浪者大多数会登记自己所剩下的K值。于是有流浪者发现只要离开层级后又重新切入层级的话，那么他们的K值将被刷新，只有少数人尝试过去刷新自己的K值，但这的确是有效的。
//
//对于K值具体意义的猜想中，准确性最大和依据最多的说法是“Karma”，即因果报应，从依据上来说，M.E.G.学者将其认为是层级中出现的过度购物行为和非诚信购物行为带来的影响的代表值。但通俗说来，这个值也只不过是一种通过层级本身作为载体来流通的货币，其意义本身对于流浪者而言并不起什么影响。
//
//实体
//层级中暂未发现任何实体，但偶尔会产生危险实体异常切入的现象，但这些实体大多数被层级流浪者驱逐或是杀死。
//
//基地、前哨与社区
//M.E.G.调查小组
//人数约有五到十人。
//负责调查K值的底层逻辑，试图记录层级中整体的K值变化。
//并不在此常驻。
//层级住民
//层级住民在2015年和2018年各经历过一次人数统计，固定居住人口总数从28人减少到了23人，不难发现，层级固定居住民正在以较慢的速度减少。
//在一次实体意外切入的事件中，人员被大量削减。
//这些家伙们把这个层级视为他们的另一个家，不过这并不能减轻思乡症的出现。
//入口与出口
//入口
//在Level 11中打开一扇在门上画着大大的K字的玻璃门后就会来到这里。
//在Level C-418中的电影院中观看《华尔街之狼》将切入此层级。
//出口
//可以通过进入时的大门重新回到Level 11，这是稳定的双向出口，但这样出入不会刷新流浪者的K值。
//在Level C-668的深夜时分进入一些隐藏在暗处、车门被敞开的车辆后将切入Level C-46。
//无论任何时候打开位于每栋居民楼中一楼中杂物间的门并进入会使流浪者进入一些危险性较高的层级。
//附录
//在前文中的“基地、前哨与社区”的模块中提到了一次使Level C-668中人口大规模减少的事件，这次事件在层级中所有流浪者的努力下被解决，我们在层级中一名流浪者的家中发现了一份记录着这件事情的手稿。
//
//- 收起
//呵。说是要让我记录这件事，倒不如说要我给那个家伙作序。那个家伙——我的邻居，一个经常把烟酒摆在嘴边的家伙，比我大上十多岁，但是做事情做起来甚至比不上一个十五岁小孩的四十岁男性。不过毕竟是老东西，在为人处世这方面相当圆润。
//
//……
//
//六楼。
//
//“那些家伙从实体切入开始就压根没回过消息了。他们到底是全部被杀光还是全部都睡着了？”
//
//我摆弄着手机，因为身处六层，所以Wi-Fi信号是可见的微弱。这些常驻的流浪者用自己的电子设备组建起了一个较小的通讯软件交流圈。
//
//“杀光啊……怎么说都不太可能，如果那些身处八层的家伙也死掉的话，那么我们也早就死掉了；如果说是睡着的话，那些老油条能在自身安危不稳定的情况下睡着的话，也该佩服佩服他们。那么就可以下定结论啦，这些实体虽然影响着他们的生活，但总体而言他们还没有什么生命危险，自然不会有干掉那些家伙的想法。就这样。”
//
//他走到我身边，在客厅的阳台向外看去，地面上大团的黑影攒动着，不难分辨那是十几只悲尸，这种数量的悲尸对于一个正常的成年男子来说是难以战胜的，不过我们这里少说也有五十来号人，而且个个有都是有着不少生存经验的老油条。但又跟他说的话一样，这些实体还没有完全触碰到老油条们的蛋糕，他们自然不会出手。
//
//“所以怎么办？”
//
//“人性嘛，怎么说来说去也还是绕不开这一点，那些家伙自然也有或多或少地把这里当成他们的家园的，但这种心理可没那么好表现出来，它们被这些人们的欲望、懒惰压缩着，自然也就正常地沾染上了懒惰的习性，接着它们就会连‘表现’这种简单的行为都完成不了。”
//
//我们要做的简单而又危险，我们的声音必须响彻整个层级，并且越早越好。
//
//……
//
//五楼。
//
//“这样走楼梯真是闷的要死啊，要不聊点什么。”
//
//我能意识到我们在想着相同的东西。楼梯太短、思绪太长，我们只好放慢脚步，一步一步而又不用力地踏在台阶上，脑中的脚步声清晰而又明显，每踏下一次发出的脚步声并不传出，而是内化着在脑中回响。
//
//“聊什么，我还没有和你正经聊过天呢。平时不是插科打诨就是发酒疯，关于你的生世啊、为什么经常失踪半个多月我都还没有了解过。”
//
//他喝了一口酒。是威士忌但不是正宗的威士忌。
//
//“没什么好说的，至少对我来说。我在前厅嘛，一开始家庭美满、生活也还算得上幸福，可惜后来染上了个酒瘾…….不想说了，总之我的生活、我的家人的生活、身边人的生活被严重地影响，甚至出现了暴力事件。”
//
//他的话语和脚步都停顿了很长一会。
//
//“然后作为‘因果报应’，上天让我在一次酗酒后切入了后室。至少我是这么想的。
//
//直到那时，我才幡然醒悟，他们作为我的精神支柱，却因为‘恶行’而在一瞬之间崩塌成一个个碎片，反射着我的行为。我的确在行恶，于是为了赎罪，为了再见他们一面，我开始戒酒、戒烟，我尝试在后室中与他们再次联系，也就是在这时我开始睡前祷告，这种祷告并非是带有宗教性的祷告，而是一种内心想法的表现。
//
//我实在不能遗忘。某种东西必须要被展出。那是一个人的展览秀。为了我自己。
//
//那时我刚好三十岁。”
//
//我突然想起我现在也是三十岁。
//
//……
//
//四楼。
//
//“然后我来到了这里，我第一次发现这后室之中居然还有一个适合我心目中该有的样子的小区。”
//
//一声尖叫直接将我的思绪打断，我望向楼梯间的窗外，那是一个无意间切入这里的流浪者，他被那些实体扑倒、分开。
//
//“然后你就沉沦于此？这不应该。”
//
//他没看出去。
//
//“我发现他们变成了另外一件事，一直在我不注意间发生着变化，从一个不可分割的部分变成一个寻求的目标，最后在我迷茫无力时变成了回忆，一种可以被轻易塑形的回忆。我开始害怕，我害怕他们变成了另外一个样子。走得越多忘得就多，然后我在这里停下了。”
//
//他摸出一张泛黄的照片。
//
//“但你也知道，停下也是一样的。一开始还好，遗忘的东西不多，被遗忘的不过是一小段一小段的碎片，我只会丢掉记忆中每件事情中的细节，例如一包不知道是否被打开的麦片、一个在后来有没有被打破的陶瓷碗，或者是一把不知道有没有被拧干水的拖把。
//
//然后，细节被丢光了，时间把眼神聚焦在那些事情上面。就算是遗忘这件事，我也是清楚明了它会发生的，这毕竟是无法避免的事情，我只能把它的影响减到最低。但即使无时无刻提醒着自己减少它的影响，自己还是会在无意间遗忘，我不是仅靠回忆活着的人，但是我又要依靠回忆找取活着的动力。于是在这两种情感与行为的矛盾间，回忆流失。
//
//回忆流失的副作用嘛，失眠、乏力、食欲不振都轮番涌上。我就躺在那里，没有任何的回忆出现、没有任何的期盼出现、没有任何的事物产生，我逐步逐步地化为无。他们说是什么思乡症，并且这是这种疾病表现的第三步，同时是最后一步。”
//
//他踏出走向三楼的最后一步。
//
//……
//
//三楼。
//
//“于是啊于是，解脱失眠、保全生命成了第二个前进的目标。但这段前进的路途中不需要任何的记忆，我的目标是出去再回来，在路途中找那些还算值点K值的东西，然后又傻傻地跑回来换K值。有了K值，就去找那些老家伙们换酒，换上以后就喝个烂醉，只有在那时我的记忆才最为清晰。
//
//他将照片递到我手中，又灌了一口酒。那是他的妻子、孩子，是构成他本身的碎片之一。
//
//“回忆很可怕。你这样沉沦就是在摧残身体…….但是身体存在与否对你似乎没有意义了。”
//
//“我清楚地知道喝酒会让我的记忆失去更多，我在大脑和伦理情感之间下赌注，赌桌是我的身体，筹码是记忆碎片，战利品是一段清楚的记忆。所以说啊，没办法了，回忆把我深深地植根在这里，我必然会在这里死去，携带着被摧毁得不剩多少的记忆死去。”
//
//我们本来并排而下，但在说完这句话后他快走两步，抢先一步进入楼梯间，来到三楼一个住户的门前，那门后传来一个慵懒、苍老的男人的声音。
//
//“到你小子出手了是吧，在上面就听见你说你那一点意思也没有的过去了。特殊情况，铁棍卖你25K好了。”
//
//“我这毛头小子能够干什么…？得得得，我能回来就给你。”
//
//铁门下一个小窗口被打开，两根铁棍伸了出来。在接过铁棍后，门后的男人又递出一根烟和一根火柴。他相当果断地接下来，转转头和我走向二楼。
//
//……
//
//二楼。
//
//窗外路灯亮起，太阳落下，红光照亮了半片天空。云是红的，红似鲜血，我们的血液被凝固于此然后又慢慢变凉，结成一团块状物，在风的吹动下挪向别处，投奔到记忆的浪潮中去，泯灭在记忆的浪潮中去，在无边而渺远的回忆中化为斋粉后，我们再回头望向自己的灵魂，最后深切地意识到自己甚至没有任何存在的痕迹，目睹着血液都化为尘烟。
//
//“我前面是不是说过那些老东西们不动手的原因？”
//
//我点头。
//
//“那还不够完全，人既然为人、为具有团居意识又是同源出生的动物之一，那么寄存在道德中的善恶观、生死观是相同的，不需要学历、不需要教育，他们生死观是植根着的，但就如同记忆一样，它们总要被磨平，被抹掉无用的、还算有点重要的、重要的部分。于是行为上的唤醒就成为了无比重要的解药之一。”
//
//他说完了。
//
//“讲得是不是太多了。这些话没什么依据的，就只是凭靠个人生存经验得出来的，当乐子就好了。”
//
//……
//
//我们正走向一楼。
//
//“我们这样的组合很奇怪吧，一个三十岁小伙子和一个四十岁的大老爷们。不对，你也称不上算是个小伙子，不过你是个在我心中相当值得敬重的后辈，至少我跑到你家大睡特睡的时候你没赶我走。”
//
//我们站在那堵消防门前，再走一步便能直入深渊。
//
//“你也应该要学会抽烟了吧，不管你收不收下，我都要把这根香烟留给你，我一个人抽不惯，然后K值也给你了，反正我留着没用，死了就没了。”
//
//他停顿几秒。
//
//“赎罪之路便在前方，不论它是否存在，我都要一试。我要拯救的不是你、不是他们、不是这个层级。而是我，是我的回忆，是我的被切得碎裂的回忆，是我的无力的生命轨迹。我该赎罪，但不应该拉上你。”
//
//他的语气转变了，从在六楼上说话时的懒散变为了某种肯定。我不得不伸出手去，搭在他另一只手的手背上，他的目光聚焦在我的手上，慢慢转到我的眼中，某种过去凝结的东西正在被转移，代表着因果的、罪恶的K值被赎罪的意识清洗开来。
//
//“什么……？”
//
//话音刚落的后一秒，我看见了
//
//一声“五十万K值”。
//
//一根香烟。
//
//那扇门在短促的五秒内被打开。没有人跟上。
//
//嘶吼。
//
//尖叫。
//
//爆炸。
//
//呼声。
//
//一场完美而悲观的赎罪。
//
package lvls16x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1668{}