//Level 499
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//level-499.jpg
//在Level 499内发现的一件雕塑。
//
//描述:
//Level 499是一个复杂的迷宫，各种环境布景似乎已经交错杂糅在一起。森林、洞穴、丛林和土坯结构彼此夹杂，弯曲并融合创造出一个复杂的整体。砖砌的大厅突然变成了树林; 大河从地下墓穴中穿过。层级中唯一不变的是墙上长满了藤蔓和其他植物，填满了石头上的每一个裂缝。该层级同时朝着水平和垂直两个方向延伸，不仅以多层的方式，而且这一层级的某些部分忽略了传统的方向，天花板上有门道，森林倒立生长。甚至连水体也似乎违反了万有引力定律，溪流可以向高处流淌，池塘可以占据墙壁和天花板上的大坑。然而，穿越这个层级的旅行者就没那么幸运了，因为他们只能在一个方向上感受到重力，那就是向下。
//
//尽管本层级的大部分内容呈现为森林和河流等自然环境，但层级的任何部分都不是真正的“外部”。在任何时候，如果一个人行进得足够高，他们最终会遇到某种类似天花板或其他的结构。这意味着本层级除了 “幽灵之光”
//The Ghost Lights
// 之外没有自然光。除了植物之外，“幽灵之光”是本层级中表面上唯一的本地生物，尽管一些流浪者认为它们更像是一种自然特征而不是实体，因为它们没有表现出任何明显的感知迹象。“幽灵之光”是橙色的光球，在整个层级中漫无目的地漂浮，发出亮度可与火把或手电筒相比的光。它们在层级中极为普遍，这意味着在本层级的大部分区域中，都有足够的光线可以清楚地看到前方的道路。然而，有几个无法解释的空洞区域，要么很少有“幽灵之光”，要么完全没有。这些区域非常危险，因为如果各种洞穴和洞口被黑暗隐藏起来的话，本层级的不可预测的架构会使得流浪者很容易迷路或跌入关卡的较低部分。
//
//Level 499也是宗教团体 神爱之繁生
//Amor Incrementum
// 的所在地。由于这个层级规模巨大且这个团体难以捉摸，他们的许多内部运作方式对于M.E.G来说是完全未知的，但是调查仍在进行中。
//
//相关文档:
//收件人: 监督者A,  阿什利·布兰切特
//Ashley Blanchet
//  - “科幻”小组
//发件人:  奥菲莉娅·T·罗宾逊
//Ophelia T. Robinson
//  - “科幻”小组
//主题: Level 499植物生命研究记录
//日期: 10.15.22
//
//致监督者A和队长布兰切特：
//
//这是您要求彻底调查Mx. 黎刹
//Rizal
// 提供的Level 499植物样本的更新。（如下所示）
//
//plantsample499.jpg
//来自Level 499的植物样本。
//
//不幸的是，一些植物样本在到达Beta基地实验室时已经枯萎。 我想亲自联系黎刹君并临时将植物样本转移到Omega基地以提高其交换效率，因为神爱之繁生唯一的其他存在地是在Level 4。
//下面附上完整的研究文件，包括对层级中植物生命特性的观察。
//
//您真诚地，
//奥菲莉娅·T·罗宾逊
//“科幻”小组研究员
//
//关闭文件
//Level 499是由神爱之繁生的现任成员 玛雅·蔡·黎刹
//Maya Chua Rizal
// 提请M.E.G.关注的一个层级，同时也正在向M.E.G.提供有关此层级和驻留在其中的相关组织(GOI)的信息。黎刹提供了多个植物生命样本用于研究目的。监督者A指派科幻小组“阿什利”小队调查植物生命的特性，这将有助于黎刹和M.E.G.对神爱之繁生和Level 499的调查。
//
//通过在光学显微镜下对健康植物样品进行细致观察，对植物样品进行了研究。 失活的植物样本无法观察，因为它们在干燥时似乎会分解。 我们使用了三种不同的植物，并附上来自黎刹的额外资料，指出这些植物是农作物的样本，这些农作物构成了神爱之繁生成员的大部分饮食来源。 从这三种植物采集的样本分别命名为AI-1、AI-2和AI-3。
//
//AI-1的外观类似红葱，有长长的叶和根。这种植物在收获时，表现为多个球茎相连的形式。从提供的植物取样显示，AI-1的细胞结构类似洋葱(Allium cepa1) ，观察如下:
//
//plantsample4992-2.jpg
//来自AI-1样本的细胞。
//
//AI-2具有类似于甘薯(Ipomoea batatas2)的块根作物的外观，其原产于Level 499。切开时，可以明显地观察到块茎会分泌出一种半粘性物质。 将块茎样品放在显微镜下，发现该植物的细胞不像正常的植物细胞那样，而是与动物细胞几乎相同，仔细观察该物质，可以看出该标本有类似于红细胞和白细胞的细胞，但是没有血小板，不像在正常动物血液中发现的细胞那样。
//plantsample4993.jpg
//来自AI-2样本的细胞。
//
//plantsample4994-2.jpg
//在显微镜下从AI-2中发现的物质样本。注意这些类似红细胞和白细胞的细胞。
//
//AI-3是原生于Level 499的树木的根的一部分（未给出详述，需要进一步分类）。与AI-2类似，样本显示了许多健康和病变的动物细胞。 一种可能是根的细胞还没有分解。 检查根部内部时，其内部似乎有静脉状结构。 切开一条脉状物会导致它分泌与AI-2相同的半粘性物质。
//plantsample4995.jpg
//从AI-3切下的样本上有明显的脉状结构。
//
//因此，对AI-2和AI-3等假定为植物(的生物)的本质的一个可能解释是，它们不是植物生命，而是动物生命。 这也意味着这些植物不进行光合作用。 至于AI-1只是普通的葱类植物，我想问问黎刹Level 499外的植物有没有在层级内繁殖。
//Level 499的植物生命还需要进一步研究，建议研究更多植物样本，主要关注Level 499的原生植物。如果可能的话，M.E.G.需要与黎刹密切沟通。
//
//收件人: 奥菲莉娅·T·罗宾逊 - “科幻”小组
//发件人: 阿什利·布兰切特 - “科幻”小组
//主题: 回复：Level 499植物生命研究记录
//日期: 10.17.22
//
//致罗宾逊夫人：
//您暂时转移至Omega基地的请求已获批准。但是，根据监督者A的要求，您必须由M.E.G.“科幻”小组的另一名成员与来自Level 11的 薰衣草
//Lavender
// 团队的 以利亚·玛卡雷格
//Elijah Makaraig
// 陪同。
//祝你工作顺利，奥菲莉亚。
//
//问候，
//阿什利·布兰切特
//“科幻”小组队长
//
//入口和出口:
//入口:
//Level 4中的某些走廊通向本层级，(在此过程中)办公楼的墙壁和地板慢慢地变成了森林或隧道。
//在Level 135中穿行时，偶尔会遇到地面上的洞，这些洞的出口会通向Level 499的各个地方。
//在Level 134的海洋中，可能会遇到地面上的洞，这些洞通向Level 499的各个河流和池塘。尽管水通过这些通道在两层级之间流动，但没有任何Level 499的水体出现过咸水污染的迹象。
//出口:
//虽然很难确定穿越的确切位置，但有流浪者报告说进入了Level 499的某些森林并出现在另一边的Level 62。
//一些隧道通向大沙漠，这些沙漠是Level 648的一部分。进入这些沙漠后，流浪者报告说转身却发现没有他们刚从中出来的隧道的痕迹。
//在Level 499的部分森林的天花板上，有一些洞在流浪者爬过时会通向Level 39的地面。
//一条用红棕色泥砖建造的走廊会包含一扇通往Level 499.1的门。
//作者/许可/译者
//« Level 498 | Level 499 | Level 500 »
//
//Footnotes
//1. “洋葱”的拉丁学名。——译者注
//2. “甘薯”的拉丁学名。——译者注
package lvls4x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl499{}