//Level 480
// 
//
//生存难度：
//等级 3
//
// 
// 
// 
//Level 480是后室的第481层。
//
//Level 480是一家宽敞的便利商店，座位于一条又长又脏的走廊上，是目前已知的在后室中唯一可以看到复印者的地方。
//
//描述：
//Level 480是一个的巨大商店系统，由几个不同的店面与门廊组成，它们类似于便利商店、食品店、工具店和家电店的入口，每条路通向不同且大小不一的商店，这些商店有些像加油站与便利店一样小，而有些则很大，像飞机机库一样。
//
//大多数商店的布局整齐有序。每个商店中都有一排排整齐的货架，货架的一端延伸到了很远的地方。在一些较大的商店里，偶尔可以在商店里发现货物和材料整齐地堆放在空地的托盘上。它们的高度取决于房间的整体大小。当产品从货架上取下时，商店会定期重新进货。目前尚不清楚这种现象是如何发生的。
//
//刚刚进入此层级时，这些商店看上去似乎干净整洁:地板擦洗得干干净净，货架摆放整齐，商店中弥漫着空调凉爽的冷气。然而，经过进一步的探索，流浪者会发现某些商店的条件比其他一些可以在这个层级内找到的商店更糟糕。一些区域的灯被发现被破坏了，许多冷冻食品通道的冰柜出现故障，无法正常工作。有些过道也可能完全混乱，他们的产品散布在地上，完全混乱。
//
//造成这些损害的原因目前还不清楚，但我们怀疑是居住在Level 480的实体所为。发现的破坏规模和类型的一致性也可能表明，破坏主要可能来自M.E.G.尚未遇到的一个未记录的实体。
//
//穿越此层级并不是一项简单的任务。该层级包含肮脏、漫长的店面走廊，它们通常紧密地挤在一起。这些商店可能比它们的入口要大得多。在进入一家商店时，流浪者们可能会发现，商店的内部空间可能与从外面看被相邻的商店占据的区域重叠。正因为如此，Level 480被认为是一片非欧几里德的线性空间，由于其性质，不可能有逻辑地安全地穿越Level 480。
//
//
//非品牌产品和诱杀陷阱：
//存放于Level 480货架上和显示器上的商品似乎是便利店中的非品牌产品1，包括罐头、盒装食品、瓶装饮料、化妆品和家用电器。与它们的非品牌外观相反，这些产品实际上比普通产品质量更好。
//
//y8xmTNIjsZHvVaB.jpg
//一个在Level 480发现的非品牌产品的例子。
//
//据说，这些食物和饮料的味道更好，在某些情况下，甚至可以加速轻微伤口的愈合。同样，现有的家用工具和电器往往比普通的同类产品更有效、更耐用、更强大。
//
//尽管如此，我们还是建议流浪者不要使用Level 480的任何商品，因为他们很有可能被诱杀陷阱所困。尽管没有任何迹象表明一个商品可能有陷阱，直到它被捡起来，如果有流浪者拾起该商品，会触发下列不同的陷阱之一，在某些情况下，它会发出只有受害者才能听到的轻柔的、孩子般的咯咯笑声。
//
//观察到的一些诱杀陷阱装置如下：
//
//接触时产品变得极热或极冷。
//该产品以鞭炮的威力（约 600J）引爆并产生中等响度的噪音，可能会吸引附近可能存在的任何实体。
//产品会在短时间内（10-15 分钟）粘在与其接触的任何表面上，使接触它的人暂时失去能力。
//产品从受害者手中升起并以高达 40 公里/小时的高速撞击他们。如果产品碰巧是铲子或保龄球之类的东西，这可能会特别致命。
//该产品悬浮在受害者的头顶上并发出破坏性的噪音。2
//在更严重的情况下，诱杀陷阱产品也被报告为：
//
//用一种看不见的力量对受害者的一根骨头施加很大的压力，将它们折断和压碎，这通常会导致永久性损伤。
//导致暂时或永久丧失感官能力（失明、耳聋，很少会完全丧失触觉）
//将受害者表皮的皮肤切片。
//使受害者身上的所有毛发自发脱落
//在一个报告的案例中，将受害者运送到另一个更危险的层级。
//实体：
//该层级包含中等数量的敌对实体，包括窃皮者，笑魇（在停电期间）和瓷砖陷阱。
//
//除了诱杀陷阱商品，另一个威胁存在于商店的过道上:被称为“复印者”的实体。这些变形生物整天都在商店过道的产品之间休眠，正如它们的名字所暗示的那样，它们可以变形为不同的商品形式，以欺骗猎物认为它们是无害的。
//
//与复印者打交道时，令人担忧的主要原因是它们刺耳的尖叫声。当他们被挑出来时，它们将自己从可能扰乱他们休眠的人/实体身边挣脱开，并发出很大的噪音3它既可以分散猎物的注意力，也可以引诱附近的实体。复印者发出尖叫声后，它将观察周围区域并等待实体来到并杀死猎物。如果没有实体前来，复印者会自己动手，攻击受害者，它会伸出一组锋利的尖牙，向受害者的胸腔猛冲或飞翔。獠牙本身非常锋利，强大到足以轻易撕裂人的肉体。然而，它们缺乏机动性，一个人可以通过简单地冲刺而轻松地避开复印者。
//
//除了尖叫之外，复印者本身并不难对付。它们由一种非常脆弱的软骨状物质制成，可以很容易地砸在周围的表面上，但是其他实体的威胁和它们致命的尖叫声使它们对穿越Level 480的人构成了巨大的威胁。最糟糕的是，不像诱杀商品陷阱，复印者甚至已经知道主动地攻击他们的猎物。虽然这种现象并不常见，但流浪者在穿过 Level 480的过道时仍需谨慎。
//
//由于该层级实体数量多且需要通过单个过道的长度（过长），流浪者无疑会在穿越层级期间的某个时间点遇到敌对实体。建议流浪者携带足够的装备并做好适当的准备，以便与实体交战、长距离奔跑，并在必要时翻越过道逃跑。
//
//停电期：
//Level 480最危险的时段是所谓的“停电期”。在此期间，Level 480的所有灯全部关闭，所有窗户都以未知方式关闭。这使得关卡内的所有流浪者都被困在漆黑的黑暗中，考虑到上述关卡中的风险性，这是非常危险的。在此期间，重要的是要有人造光源来发现可能在附近的实体——最好是一次性的，例如荧光棒，以防笑魇攻击。流浪者们应尽可能地保持沉默，以向可能潜伏在附近的任何实体隐瞒他们的位置。值得庆幸的是，停电期不会持续很长时间，通常只持续大约五 (5) 到二十 (20) 分钟。
//
//由于从 Level 480 获取产品存在风险，因此它们在后室的其余层级具有很高的贸易价值。如果流浪者不顾上述风险而寻求获得 Level 480的强化产品，他们应该为他们肯定会遇到的危险做好充分的准备。
//
//基地、前哨和社区：
//此层级没有已知的基地、前哨和社区
//
//其他内容：
//自 2024 年 12 月 5 日起，布告栏挂在Level 480周围的墙壁上，每个布告栏上都显示着一组注释或广告。上述笔记的来源尚不清楚。
//
//以下是在这些布告栏上找到的一些通知示例：
//
//本月最佳员工
//Nurinetrigyet K'Hanaquka
// 
//2024年4月
//职位：装料工
//
//提名：
//
//出色地抵御商店扒手
//惊人的安全维护
//超快速补货
//感谢您卓越的服务和忠诚!
//亲爱的顾客们:
//我们收到了几起关于我们的反入店行窃措施的投诉，我们希望尽快解决这些投诉。
//正如任何忠实的顾客都知道的那样，在[无法理解]我们将使用有组织的购物系统。购物者在穿过商店时应与我们的一名工作人员联系，他们携带的所有物品都将由选择陪伴他们的工作人员监控。
//
//这意味着，每当您在没有工作人员陪伴的情况下购物时，我们的反入店行窃措施就会生效。这确保了我们的连锁店不会发生盗窃，并且我们可以保持我们的场所没有小偷。
//
//我们希望您能理解我们的动机，我们也感谢您向我们提出您的担忧.
//
//谨此致意
//管理层
//
//你玩过Zumping吗？4
//大多数人将Zumping视为易于自我治疗的 Blorkflork 的一部分。但 Zumping 可能是Derek 病的症状。5。
//
//如果不及时治疗，Derek 病可能是致命的。
//
//其他症状可能包括：
//
//通卡伦克
//在欧几里得的几何中移动
//Z 'lhurk D 'hurk Nur和Fugili
//爆炸性腹泻
//H
//[无法理解]
//一般的感受
//这些适用于你吗?
//
//无需等待，得到帮助。
//
//-此信息由 Yalmart 和 Anti-Derek 协会联合提供给您
//
//致：维护团队，或任何真正负责灯的人。
//来自:第三个多里安6
//题目：灯
//请原谅这封信糟糕的格式，我不习惯这些“电子邮件”，你们在过去几年一直在使用。我想你们现在都知道了，因为这可能是我第一百次给你们发这个了。
//
//不过，这不是重点。我知道在你们所有人的眼中我被认为是一个“低级的存货商”，但如果我的意见至少被认真对待一次，我将不胜感激。我告诉过你们多少次灯都被拧坏了？我们安装这些东西已经有34，37年了。自从我们第一次安装它们以来，它们就坏了。我很确定你们都注意到了，所以我假设你们都在忽略我。
//
//我再问一次，你们能听我一次的请求吗？当我在整理袜子的时候，灯灭了，我就失去了平衡，这真的很烦人，我不得不重新组装你们坚持保留的几十个塔式显示器，而且我已经厌倦了每次都发生同样的事情。
//
//请尽快回复，我已经厌倦了这种糟糕的工作环境…
//
//你真诚的
//第三个多里安7
//
//
//
//入口与出口：
//入口：
//
//Level 122的一些门通向Level 480，与level 122的其它门与店面相比，这些门看上去更脏。
//这些相同的门出现在Level 423，尽管它们在那里更为罕见。
//出口：
//
//一些门和店面通向Level 122，这些门很难与层级中的其他门区分开来，但却是离开Level 480最常见、最可靠的方法。
//与商店相连的走廊有时会通往Level 2，当Level 480的门不再出现，而是Level 2的几何图形所取代时，这一点就变得很明显了。
//作者信息
//« Level 479 | Level 480 | Level 481 »
//
//Footnotes
//1. 发生这种情况的例子包括品牌名称的更改、颜色的互换和吉祥物的混淆。
//2. 这包括电视静电、商业广告，在某些情况下，是受害者最不喜欢的音乐。
//3. 已经观察到这达到了高达 180Db 的危险高容量。在达到像这样的极端音量的情况下，已经观察到流浪者瞬间耳膜破裂、失去知觉和自发死亡。奇怪的是，尽管在这种情况下通常会发生些什么，玻璃和灯泡之类的东西并没有被这种尖叫声损坏。
//4. 译者注：这段实在译不下去了，很多无法翻译的单词，并非译者不会翻译。
//5. 译者注:此处可能是Dercum's disease（德尔肯氏病）但原文是“Derek's disease."(Derek 病)
//6. 译者注：此处为音译，原文是网址，导向Entity 93 - "Night Stalker"。
//7. 在此层级周围的每个消息实例都附有一个印章。
package lvls4x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl480{}