//Level 495
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//ferryman.jpg
//摆渡人。
//
//描述：
//Level 495是一道由灰色沙砾组成的河岸。此地不存在风和气候的扰动，沙粒几乎完全静止，只被偶尔经过的流浪者踏过。而脚印留下的压痕也在不久后被抹去，不留下任何扰乱岸边的人为痕迹。另一边是一条河，水流潺潺，清凉而深邃，宽度超过目力所及。没人能独自渡过，更没人能抵达对岸。天色暗淡，但万里无云，天空的亮度随着人员与河岸距离变远而变暗，直到伸手不见五指。远处不存在照明，完全被黑暗所笼罩。
//
//河边有摆渡人。他们是使用长棍而非船桨，把棍子撑到河底，以此来移动自己的小船。棍子的一头挂着灯笼，灯笼发出昏暗的黄光划破了黑暗，是该层级唯一可见的颜色。人们对摆渡人所知甚少，因为他们不喜交谈。只知道他们通常以老者的形态出没，穿着破旧的黑色大衣，留着长长的邋遢胡子，除了上面的一些污渍之外，也是黑的。不过，他们也曾以身着白色T恤和短裤的男孩或身穿花色夏装的少女的形态出没。他们的眼睛都是灰色的，似乎什么都看不见，又似乎一直盯着眼前、远处、和黑暗。偶尔他们会载人，但要求人员为此付款。可以是任何硬币，不论价值几何，甚至任何类型的硬币都可以。人们曾观察到摆渡人收下了便士，甚至塑料代币。摆渡人似乎是过河的唯一途径，但他们的船总是空着回来，而且他们从未向任何人透露对岸的情况。
//
//经常有人影从黑暗中走出。身形影影绰绰，颜色晦暗，但除此之外和人类别无二致。这些人影似乎不会注意到流浪者，试图和其身体互动会使他们直接从人员身体穿过。当他们走到河岸时，通常会掏出一枚硬币，一般是从口袋、钱包拿出，有时甚至从舌下掏出来。这时，摆渡人就会带他们渡河。然而，并非所有人影都能拿出硬币来，那些没有硬币的人影便沿着河岸走远，直到远去。
//
//入口和出口：
//入口：
//Level 495的已知入口有Level 75的一条通道，Level 135的一处裂缝，以及Level 494的湖底。所有这些入口都导向该层级的黑暗处，但只要顺着光亮走就很容易到达河边。
//
//出口：
//少数情况下，在该层级的黑暗处，河岸的另一边，可能遭遇门洞。这些门洞的构造设计各不相同，在人员走进之前看上去全是空荡荡的。已知门洞可能通向Level 372，Level 97，Level 28，以及Level 899。有人认为河的对岸存在另一个出口，但没人能够证实。
//
//我看到他们从阴影里踱出，背着包。他们就走着，走着，走着，但他们的旅程已经步入终点。我看到一位母亲怀抱着一个婴儿。这是少见的现象，这些旅人一般都是形单影只的。她只有一枚硬币，所以她驻足，把婴儿和硬币都交付给了摆渡人。她虽然为此走了遥遥路途，但自己等而下之。摆渡人离开了，她继续走，这次是沿着河岸逆流而上。她既然已经走了如此远，再走几步又算什么呢？恒久的游荡又算什么呢？起码她的孩子摆脱了这一切，为此步入黑暗也是值得的，为此继续旅途也是值得的。旅途并无方向，只是因为这是她唯一能做的。黎明不再破晓，但是没关系。
//
//那一刻，她把他带到了这个世界上，而他会在几分钟后把他们俩的存在都带走。他的生和他的死都比她的永恒来的短。他们就这样走着。
package lvls4x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl495{}