//Level 432
// 
//
//生存难度：
//等级 4
//
// 
// 
// 
//Level-14.jpg
//Level 432 的图片
//
//Level 432 是后室的第 433 层，它是一个体积小却无限循环的地下室。
//
//描述：
//Level 432 是一个小型地下室，通过前壁或楼梯顶部的门将进入另一房间，这一空间现象呈相同性，无论如何，在相同区域内放置的物在进入下一房间时将出现在相同位置。在该层级存在未熟且不被消耗的杏仁水。每个房间本身存在数个放杂物的架子、一台只能显示静态画面的电视以及一个储存杏仁水的冰箱，房间顶部有通风口。该层级的结构似乎不可损坏，桌子与抽屉中有孩童关于地下室和棍状物的图画。Level 432 天花板管道有一类可被饮用的绿色物质，饮用后将产生视听幻觉，尽管这不会致命但仍不建议饮用。每个十二小时层级内部就会停电，这一情况发生时，肢团、笑魇、死亡飞蛾、窃皮者、猎犬和钝人将出现，除非停电，否则插座与洗衣机可以正常工作。
//
//基地、前哨与社区
//该层级没有已知的基地、前哨或社区。
//
//入口与出口
//入口
//于 Level 5 打破并穿过地板。
//
//出口
//如果窗户外是白色的，打破窗口将进入 Level 0。
//
//探索记录
//- 关闭探索记录
//记录开始
//
//记录 1：下午 8:32：我在哪？我当时正穿过 Level 5 并掉进了一个洞里，然后我就在这儿了，这可真是 太 好 了。
//
//记录 2：下午 9:15：我试了好几次打开门，结果都在一个房间里。我不知道这个问题有没有被发现，所以我试着联系外界。
//
//记录 3：下午 10:30：我打碎了窗户，外面一片漆黑，所以看起来我得另找出路了。
//
//记录 4：下午 11:01：为什么灯都灭了？等一下……该死。
//
//记录 5：下午 11:35：我刚刚遇到了一些……东西，它浑身都长满了胳膊和腿（如果你把它算作一个东西的话）。
//
//记录 6：上午 6:40：仍然在走，仍然啥也没有。
//
//记录 7：上午 6:57：我试试再联系一下外界？
//
//记录 8：上午 11:42：好消息，灯又亮了！而且我得到了自称为“MEG”的回话。
//
//M.E.G. 特工：有人吗？
//
//未知：你好！我被困在这个循环的房间里，我需要紧急帮助！
//
//M.E.G. 特工：保持冷静，我会派人去救你。那么现在，你附近是什么样的？
//
//未知：一个老地下室，很冷而且有些架子、通风口、一扇窗户、一架破电视和一些别的东西。
//
//M.E.G. 特工：好的，我会让别人看看这到底是什么地方。你最后在哪里以及你怎么进到这的？
//
//未知：Level 5，所以我该从窗户出去吗？
//
//M.E.G. 特工：你最好别这么做，因为我们都不知道会发生什么。
//
//未知：行。
//
//M.E.G. 特工：还发生了别的什么吗？
//
//未知：哦！在大约12小时之前灯灭了，然后我遇到了一个身体上长着各种肢体的实体。
//
//M.E.G. 特工：你是怎么到那里的？
//
//未知：在 Level 5 的主大厅掉进了一个洞里。
//
//M.E.G. 特工：好的。
//
//30 分钟后。
//
//M.E.G. 特工：有人正在试着找那个与你的描述相似的房间。
//
//未知：所以？
//
//M.E.G. 特工：我们找不到任何一个循环的地下室。
//
//未知：哦。
//
//M.E.G. 特工：是的，所以你应——
//
//未知：喂？喂？
//
//连接断开
//
//记录 9：下午 10:40：所以又“天黑”了，至少我会这么称呼它，我今晚就睡在沙发上吧，晚安。
//
//记录 10：下午 11:22：好 吧，那 可 真 遗 憾—— *喘气和跑步的声音*，哦，该死
//
//记录 11：下午 11:45：*很重的呼吸声* 哦天啊，这可不好。听着，我可能要死在这儿了。不，我是会死在这儿的。不要走进 Level 5 的洞，否则*笑*你会像我一样玩完了。
//
//记录 12：下午 12:13：我是怎么活下来的，我又遇到了那个东西，有三五只围着我，我拼命跑了 20 多分钟。
//
//记录 13：下午 3:30：窗户外面变白了，我要逃出这里，他妈的。
//
//记录 14：下午 3:35：我做到了！我逃出了这个层级然后我了 Level 0。*叹息*，我猜我应该去找那群 MEG 去，如果有人看到了这个，听着。别来这儿是最好的。
//
//记录结束
//
package lvls4x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl432{}