//Level 409
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//129paper.jpg
//Level 409中脆弱的纸质房间
//
//Level 409是后室中的第410层，于2020年12月25日由u/MagicExploresTheWeb发现。它由各种完全由纸构成的房间组成。
//
//描述：
//Level 409是一大片不断变化的，完全由纸构成的房间。该层级的墙壁非常单薄易碎，仅由几层纸来将房间之间彼此分隔开，如果施加足够的力，很容易将其撕裂或破坏。房间的布局和墙壁的墙纸本身与Level 0的布局类似，但有少量区别，例如：墙纸设计略有不同、地板没有铺设地毯以及存在实体。
//
//Level 409的顶部是纯白色的虚空，同时也作为光源，使整个层级充满明亮的光。本层级的影子经常向随机方向投射、互相重叠、甚至出现在通常被光线照亮的地方。
//
//Level 409的地板由硬纸板构成。尽管硬纸板相较于纸墙更加坚固，但十分易碎，撕开后会露出Level 410的顶部。硬纸板本身仅有几层厚，但经常被路过的流浪者或折纸堡采集作为基础和多功能建筑材料，或者用于制作包装。
//
//基地、前哨和社区
//折纸堡
//折纸堡是目前在Level 4091中建立的唯一组织的名称。作为一个集体性组织，他们拆除了多面墙并成功建立了一个定居点。他们由19名成员组成，依靠从这19名成员中选出的6人组成的“探索小队”生存。这6名成员会共同前往相邻的层级，寻找食物和水并将其带回基地。尽管通常对外人很友好，但据说折纸堡的成员更愿意独自生存，他们特意选择了Level 409来“避开其他层级的混乱”。
//
//筹建中的B.N.T.G.前哨 - 嵌花基地
//尽管目前作为定居点仍未完成，B.N.T.G.正尝试在Level 4092的外围建立一个贸易前哨。在未来，它将作为层级之间的补给线和用于储存更多基本商品，如食物、建材和衣物的安全区域。还有计划将在这个即将建成的设施内存放非致命性武器。
//
//实体
//折纸
//折纸是栖息在Level 409中的，硕大、飘动的纸片。尽管乍一看它们就像一张皱巴巴的纸，但仔细观察就会发现，它们是各种硕大的白色薄纸板，以优雅的方式沿实体的中央折叠。这些薄纸板层层相切，形成非欧形状，同时薄纸板缓慢旋转并始终相互折叠，构造出令人着迷的、近乎催眠的阵列。
//
//这些生物被认为是完全无害的，且经常被观察到修补被流浪者破坏或正常磨损的Level 409的墙壁与地板——这一过程是通过将不同形状的纸片悬浮在它们发现的破碎处完成的。广为人知的，它们在对Level 409进行修复时会哼唱温和的旋律，有时甚至会为路过的流浪者歌唱。报告显示，它们会接受请求，并哼唱任何曾播放给它们的旋律。除此之外，由于构成它们形体的薄纸板愈合速度要快于被撕裂的速度，它们被认为是坚不可摧的3。
//
//入口与出口：
//入口
//偶尔可以从Level 18进入Level 409。如果一个人拥有绘画或观看有纸质舞台布景的傀儡戏的记忆，并在途中想象了这些记忆，他们会被缓慢带入Level 409.
//
//进入Level 409一个更具体的方法是通过Level 104。流浪者偶尔会在其中遇到完全由纸构成的场景。进入这一特定阶段并远离任何可感知到的出口，便会导致毫无迹象的切换到该层级。
//
//出口
//Level 409可以通过在地板上打洞来很容易的进入Level 410。另外有很多出口通往Level 1和Level 696，外观呈现为由薄纸板构成的门。
//
//著作信息
//« Level 408 | Level 409 | Level 410 »
//
//Footnotes
//1. 嵌花基地尚未被官方数据库分类为前哨。
//2. 这个基地和定居者们到达这里初始入口的距离约为60km，但上述入口距离该层级的中心有多远是未知的。
//3. 正在策划进行测试以研究如何将其利用到建筑、军事或复制过程中。
package lvls4x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl409{}