//Level 420
//
//
//
//
//
//
//
//
//
//
//
//
//安全警告
//后室医师组织（Backrooms Physicians Cooperative）目前正在探索下述层级，除非拥有相关授权，任何人都不应访问本数据页面。任何未授权访问都将面临严重后果。
//威胁生命的事件已被知晓会在此处发生，而我们不能让它再发生了。如果您偶然发现了本文件，请向下列地址发送信息来告知我们：
//"BackroomsCooperative221@backmail.com".
//谢谢。
//欢迎
// 
//
//生存难度：
//等级 5e - 环境
//
//不安全
//不稳定
//无实体危害
//Level 420 的环境极其寒冷，没有合适的防护和装备无法在此处生存。除非你是一名出于研究目的被直接指派到此处的B.P.C.工作人员，否则不建议你来到这一层级。
//
//zone.jpg
//在基地区域的一栋木屋旁通过无人机拍摄下的湖面照片。
//
//描述
//Level 420 为一片巨大冰湖，大小约为100km2，被连绵不绝的山脉环绕。整个Level 420看上去被一层雪所覆盖。本层的温度在白天低至-10摄氏度（14°F）而在夜晚低至-23摄氏度（-9°F），这使得这里基本不适宜人类生存。
//
//由于恶劣的环境状况，对这一层级的探索被证明是极其困难的，两条最大的威胁便是低到致命的温度和无休止地席卷整个地表的暴风雪。当暴风雪来临时，已记录的温度范围可从-90摄氏度（-130°F）到-120摄氏度（-184°F）。暴风雪到来的不可预测性使之十分危险，不过当一阵突然的强风开始吹过整个层级时，人们很容易知晓风雪即将到来。
//
//本层具有24小时的昼夜循环，而夜间明显比白天更加危险。在夜间，暴风雪相较白天来袭得更加频繁并且会持续更长时间：白天的暴风雪倾向于持续20分钟，而在夜晚到来的暴风雪能够持续数个小时，有时直到日出才停止。
//
//blizzard.jpg
//暴风雪时的一张照片, 由一位流浪者在木屋中拍下。
//
//由B.P.C.所进行的进一步探索发现，在被称为“基地”的区域能够找到相隔数英里零散分布的小木屋。
//
//本层30%以下的可见区域已被探索，到目前为止B.P.C.已划分出了三个不同的区域，如下所示：
//
//边沿山脉
//基地
//冰湖
//边沿山脉
//边沿山脉是一系列将整个基地与冰湖包围其中的山脉。由于在山脉中大量分布的裂谷，早期对这些绵延不绝的山脉进行的探索导致了数次不幸伤亡。大多数的裂谷有数米深，这使得一旦有人掉入其中，就几乎不可能找到他们。裂谷中有许多锋利的岩石，其中含有未知且有时会危及生命的物质1无论具体情况如何，任何不幸掉入裂谷的人都会被视为已损失。
//
//在探索山脉时于暴风雪中保持安全是一项挑战，但人们可以通过躲藏在山脉中的某个洞穴内来确保自身安全。洞穴的温度约为 2 摄氏度（35.6° F），但它们十分不稳定且不安全，因此B.P.C.人员会阻止流浪者试图在其中寻求庇护，因为如果漂泊者试图留在其中，很可能会发生伤亡。
//
//基地
//基地被认为是本层中最安全的区域，这一区域作为山脉下的基地存在——这一区域也由此得名——同时位于冰湖旁的小丘上。基地最显著的特异之处在于大量木屋的存在，它们分布于整个基地区域。
//
//Basedaf
//一张基地的图片。
//
//木屋是Level 420中最安全的地点，这里能够生存但温度仍然很低，昼夜只有5摄氏度（41°F），而在暴风雪时只有-5摄氏度（23°F）.
//木屋内一般除了一套床架、桌子、椅子之外没有其他东西，这些家具都由风化木制造。木屋本身也主要由上述材料建成，除了由水泥建造的地基等小部分地方之外。令人惊讶的是，小屋有某种能源进行供电，并且这一能源能够控制整个屋子的电力系统正常工作。至今，能源的来源仍然未知，因为在本层中似乎没有什么明显能产生能量的方式。
//
//B.P.C.成员通常使用木屋来在相对安全的情况下在Level 420中探索。多数成员把木屋用作临时基地或研究站，不过大部分时候这些前哨站都会因Level 420不友善的环境而倒塌。
//
//除木屋外，流浪者也会在该区域发现树木，其中一些树木甚至结了果实。这些树木之中包括苹果树和番石榴树。B.P.C.研究员曾将这些果实当作身处Level 420时的基础食物资源食用。但近期研究证明这些水果并非一个可持续性的选择，当树上结的最后一颗果实从枝干上被取下时，那棵树也会开始衰败与腐烂，并在大约一小时内彻底倒下。进一步的研究也发现，这些树无法用它们的果实重新栽培。因此，B.P.C.已经不再鼓励在并非绝对必要的情况摘取树上的果实。目前，这些树的数量已经有所减少，而且已经被后室中的大部分组织定级为濒危。
//
//对这些树木的深入研究表明，当树木的树干或枝条受到损害（例如：切割、刺入、燃烧等等），它们会开始流出一些蓝青色的粘液状物质。这些树木流出这种物质的多少会因树木本身品种的不同而不同，但估计每一例会在200升上下。一旦这些物质从一棵树中完全流出，这棵树也会立刻开始冻结。据推测，这种液体具有某种防止树木的温度降至冰点以下的化学物质，不过，由于缺乏关于这种粘稠物质具体化学成分的了解，这一推测暂时无法验证。这是因为粘液会在从树上流出后的五分钟内蒸发，不论它被以何种方式加热或保温都是如此。对粘液进行冷却的尝试已有进行，但暂时未获成功。
//
//冰湖
//对于被B.P.C取绰号为“冰湖”，同时也是本层中面积最大的区域所进行的研究带回了有趣的结果。
//
//显而易见，这片湖的湖面完全冻结了，使用后室中目前通常有效的工具似乎没有办法打碎冰面——不过这片湖某些地方的冰面上存在着细微的裂痕。冰面是透明的，透过其中能看出下面是深蓝色的水。目前为止，在冰面以下还未目击到任何生命形式。
//
//Lak.jpg
//冰湖的近距离照片。注意冰面上的裂缝并非由任何B.P.C.干员制造的。
//
//对本层中雪与冰的样本进行分析后，B.P.C.研究员困惑地意外发现了一种新品种的阿米巴虫。大量观察表明这种阿米巴虫是极其危险的，并会对任何直接接触含有它们的雪或冰块的人造成致命感染。进一步的实地研究表明，这种变形虫似乎只存在于冰雪中，这提供了一种理论，它们只能在非液态的水之中才能生存。
//
//直接进行皮肤接触（在存在开放性创口时）或吞下受污染的雪或冰会导致这种阿米巴虫进入漂泊者的身体，随后开始一段时长27天的感染期，这被称为阿米巴坏死感染 (A.N.I.)。在最初的 11 至 16 天，阿米巴虫在体内会保持休眠状态，此时若阿米巴虫进入大脑，症状就会开始产生。各种症状如下列所示：
//
//11-16 日	感染后 20 日	感染后 25 日	感染后 27+ 日
//重度高烧 (40.5° C / 105° F)
//出汗
//浑身上下痛苦的肌肉僵硬
//疲倦
//呼吸短促
//咳嗽与吐血
//皮疹
//丛集性头痛
//癫痫
//失禁
//认知障碍
//无法感知手脚
//全器官衰竭
//对于A.N.I.（阿米巴坏死感染）的医疗建议
//感染者不会将阿米巴虫传染给其他人。
//在外出时遮挡面部，以防止因意外导致五官暴漏于阿米巴虫之下。
//当你拥有开放性创口时避免与雪接触。必要的话覆盖住创口。
//最近，由于B.P.C.大量成员的努力，一种由杏仁水, 一整块皇家口粮, 以及从巨植群落内Gamma Pali中提取的液体制成的混合物被发现能够有效处理阿米巴感染。2 如果一个人开始出现A.N.I.的症状，他应当向B.P.C.前哨站提出要求并得到这种处理。
//
//amoeba.jpg
//透过显微镜观察的阿米巴虫。
//
//探索湖泊时走出超过 1 公里（0.6 英里）的距离是不明智的，因为会涉及极高的风险，同时即便流浪者沿原路返回也很有可能迷失方向。超出安全点的探索只能由无人机进行。
//
//尽管这片湖是本层中最大的区域，但除了危险的阿米巴虫之外，它基本上一片空旷，没有特殊之处。进一步的探索正在进行中。B.P.C.干员的主要目标是打破冰面并到达湖底进行探索。
//
//社区，基地和前哨
//木屋的存在使得B.P.C.能够在本层中设置临时基地，但除此之外没有建立更进一步的主前哨。
//
//入口和出口
//入口
//少数情况下，Level 39的边界会出现能够将流浪者送至本层的暴风雪。
//Level 129中的暴风雪事件有时可能会将一名流浪者深埋在雪下，使他们在本层苏醒。
//Level 9中由红木建造的木屋的入口处可能会卡进这一层。
//在Level 797中进入一个被雪/冰覆盖的洞穴会导致你最终来到本层。
//出口
//有理论称暴风雪偶然会将流浪者送至Level 790，不过目前没有支持这一观点的明显证据。
//Level 9中的入口在Level 420中同样生效。Level 420中由红木建造的木屋的入口处可能会使流浪者卡进Level 9。
//有时，雪地会被巨大的阴影所覆盖，这些阴影看上去是什么隐形复杂形体的投影。已知踏上这些区域会将流浪者送至巨植群落。
//极其罕见的情况下，洞穴偶然会在你深入的过程中开始转变为镓。这种镓的洞穴会使你来到Level 75。
//作者信息
//« Level 419 | Level 420 | Level 421 »
//
//脚注
//1. 对于这些液态物质已经进行过的实验很少，主要原因是无法可靠并安全地收集它们来进行研究。目前已知的是，这些液体是低温液体的混合物，即氮气和氧气，它们通过未知的方法保持在极低的温度。
//2. 虽然并不会治愈，这种化合物可以减缓并减轻感染造成的影响，以增大A.N.I.患者存活的机会。
package lvls4x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl420{}