//Level 400
//好的，这个东西终于搞成了。编码员把这个文档反复删除了好几次……我们对这个文档进行的上传次数多到数不清。它们现在停下来了—我认为他们是放弃了，这算是一种解脱。尽管由于某种原因我们不能修改好他们对用户界面进行的设置。
//
//不论如何，这里记录的信息是M.E.G.特工Jamoson在Level 400内失踪前收集到的。为了能够准确理解此条目，我建议你可以首先去阅读ENTITY 136。 正确的信息可以被编码员修改成错误的信息。如果本文档中的任何信息与ENTITY 136相关文档的信息相矛盾，请立即与M.E.G.公共数据库技术支持热线进行联系。
//
//谨致问候，
//
//M.E.G.高级行政干事 Stephen Owling
//
// 
//
//生存难度：
// 
// 
// 
//m1nd.jpg
//主区域的照片。
//
//Level 400 是后室的第401层。
//
//描述：
//Level 400为一具有金属与瓷砖铺设的地板的巨大仓库，其正中有一颜色暗淡的金字塔。 编码员在此层级内横行，故应当尽量避免进入此层级。这是编码员唯一出现的层级。深入层级有可能发现一个房间，其中放满了科技产品 （电脑、笔记本电脑、路由器等）。建议不要触摸这些物体，因为这样做似乎会使得附近的编码员受提醒。
//
//medium.jpg
//充满了科技产品的房间。
//
//该房间中央有一个金字塔，强烈建议不要进入其中，因为大多数与編碼员的遭遇都是在那里出现的。由于此建筑颇为巨大，金字塔内部具有的事物的类型与性质是未知的。假若进入该金字塔便无法回头。可以避免进入金字塔，因为该层级相当大（大约两个奥林匹克游泳池或1.5个足球场的大小），但假若流浪者确实发现自己进入了金字塔，可以通过跳过其中计算机的其中之一这一方法，通过这个小出口进入到 谧碼 。
//
//异界代码：
//当与电子设备进行连接时。编码员似乎使用特殊的编码语言。这种代码对人类来说是陌生的，任何非编码员都无法理解。因此，此代码无法进行编辑。如果 尝试将异界代码下载到笔式驱动器或闪存驱动器上，它会自毁。
//
//计算机：
//层级内部有一使得值得冒着风险进入此层级的物件——在金字塔的正中央，有一台可以编辑/前往层群1中大量层级的计算机。想要离开的话，唯一要做的是在计算机上选择一个显示为文件的层级，比如说Level 0。然后便会从站立处立即切出该层级（穿过地板前往那个层级），不论是在哪里站定。尝试将电脑文件拷贝到USB上会使得USB上的拷贝文件立即消失。
//
//这一特殊计算机上的文件是用上述“异界代码”编写的，使得除了编码员之外，任何智慧生物体1都无法编辑信息。由于未知原因，无法从计算机中删除文件。计算机连接到互联网，可以使用管理员的权限访问M.E.G.数据库，允许编码人员编辑或删除他们想要的任何条目。
//
//编码层级：
//有时，在与一位编码员进行争吵之后，它们会让与之争吵的人认为自己切出到了其它层级，实际上他们只是进入了“被编码的”层级。以下列出一些不完全的例子—这个人可能会被传送到一个反转版的Level 0，其中并不具有黄色墙壁与大声运作的荧光灯，而是有紫色墙壁和无声的灯光。
//M.E.G.特工 Jamison 有一个理论，即編碼员位于许多子层级的后方，并且以某种方式与 Level 404 相关联，因为该层级与这些实体的数据和引诱行为有共同的联系，例如在其中一个房间中出现的“异界代码”流。
//对于这个理论中子层级部分的解释是这些“被编码的”层级与子层级的一般呈现状态近似，Level 1.5是最好的，可以预测“被编码的”层级的外观的例子。
//鉴于这些“被编码的”层级在进入不久之后就会崩溃这一事实，理论上来说編碼员位于这个子层级的后方。层级的构造方式导致其特征高度混乱。相比于一般的整洁稳定的后室层级来说，这些“被编码的”层级一般更加混乱，且看上去像是被生成出来的。
//
//file.png
//艺术家对进入金字塔后所见的描绘。
//
//基地，前哨与社区：
//由于大部分进入此层级的人员无法在存活状态下离开该层级，该层级没有基地，前哨与社区。
//
//入口与出口：
//入口
//可以通过在终点打开电脑上一名为“大脑已1是软0件”的程序进入此层级。滑下Level 119的绿色滑梯也可以抵达。与终点的那条路径相似，可以在Level 201的一个终端上打开“大脑已1是软0件”到达此层级。可以通过将自己的生命承诺给代码和代码上的数据进入，也可以通过Level 188一处流出数据流的窗口进入此层级。
//
//出口
//可以通过切出层级的墙壁离开层级，此方法由一 M.E.G.的未知员工发现。走到金字塔中的计算机前，点击其中一个层级文件可以离开此层级。有时也会通过未知的方式随机离开这个层级。强烈建议离开层级者检查自己到达的为一实际层级，而非編碼员创造的虚拟层级。
//
//错误 — 数据损坏。是否加载备份文件？
//
//我们给你的大脑上了软锁。不要抵抗。屈服于代码。你的大脑已是软件。
//
//
//作者（们）
//« Level 399 | Level 400 | Level 401 »
//
//Footnotes
//1. 译注：原文用的是“anyone”，但是编码员是实体不是人类，故照此翻译。
package lvls4x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl400{}