//Level 410
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//Level 410是后室的第411层。Level 410的记载很少。它最初是由一名熟睡的M.E.G.成员意外发现的，他在一张不记得睡过的床上醒来。
//
//kitchen.jpg
//Level 410厨房的一部分。
//
//attic
//Level 410的阁楼。
//
//描述：
//Level 410是一座中型豪宅，共有 4 层楼、阁楼和 3 层较低的楼层。这座豪宅的建筑风格与20世纪90年代末相似。豪宅中居住着一个人和他的一群被驯服的实体，其中包括：2只死亡飞蛾和一个娃娃脸。在此层级中可以找到一个无面灵，他维护着这座豪宅。这里存在 Wi-Fi，但由于速度太慢，它不可靠。
//
//豪宅的一楼有一个带有小型储藏室的厨房。储藏室里有一些厨房用品，另一边有一扇破旧的门。在地板左侧的房间里可以找到一张大桌子，周围有 8 把椅子。另一边的房间是一个客厅，里面有一张单人沙发，一台电视，柜子上有一台 VHS 播放器，还有一台 DVD 播放器与之相连。
//
//二楼包括2间浴室和6间卧室。每间卧室都包含 2 或 3 张全尺寸床和一个壁橱。地板中央的架子上放着一台旧路由器，虽然年代久远，但仍然可以正常工作。当向租客询问有关路由器的问题时，他说他在其中一所房子的一个有眼睛生物的地方发现了它，并把它带到了这里，作为以某种方式增强已经很差的 Wi-Fi 的手段。
//
//三楼有一间宽敞的主卧室，一侧是一张特大床，另一侧是一张双人床。在这个房间里还可以找到一个壁橱，里面放着各种各样的便服。地上还包括另一间浴室和通往阁楼的梯子。阁楼很旧而且尘土飞扬，建议在去之前戴上防毒面具。除了手电筒、玩具和收音机等设备外，没有什么好找的。这里也可以找到生锈的门。
//
//较低的楼层用作储存杏仁水等用品的地下室。容器也可以在这里找到，根据容器存储不同种类的食物。就像冰箱里的肉和冰淇淋一样。装有各种饮料（如苏打水和杏仁水）的冰箱以及食物。以及装有罐头食品的板条箱。如果供应用完或从此层级中取出，将在一周后根据容器用不同的食物或饮料更换。 2楼的情况基本相同，但那里的大部分物资都已过期。在地下室的这个部分可以找到一个房间，里面有一扇加固的、生锈的金属门和 3 把锁。如果有人靠近门，可以听到远处的金属撞击声从下方穿过门。目前没有已知的开门方式。
//
//租客
//个体是一名黑发绿眼的高加索人类男性。个体很欢迎并愿意提供补给、一些建议并告诉如何离开此层级，但如果被激怒会做出猛烈反应。自从他是第一个发现它的人以来，他就声称自己是此层级豪宅的主人。他是怎么切入到这里的，不得而知，甚至他都不记得自己是怎么来到这里的，尽管离开了几次又回来了。
//
//外部
//离开这座豪宅，出去是可以的。为此，请使用后门或前门，您将在豪宅外面。豪宅周围有一道高石栅栏，底部长有苔藓。栅栏也显示出老化的迹象，因为可以看到裂缝、孔洞和其他损坏。豪宅后面有一个后院，包括一个花园和一个小型游泳池。这里还可以找到一个破旧的温室以及一个装有园艺设备的小型仓库。
//
//在豪宅的前面，有4个不同的实体雕像围绕着一个喷泉，都面向它。这些雕像描绘了雌性死亡飞蛾、窃皮者、洛特卡和第四个破碎的雕像。目前尚不清楚这座雕像曾经代表什么。雕像的底座上也可以看到名称和描述，但第四个被划掉了。雕像的底部是3个带有符号的按钮，但这些按钮的用途目前未知。按下时，它会导致雕像根据按下的按钮改变其位置，但不久后会回到原来的位置。喷泉可以包含普通水或杏仁水。穿过雕像是一个可以打开的双金属门。
//
//过了大门，只有一条路，左、右、直。没有房子可看，取而代之的是在房子的地方有一片森林。如果一个人徘徊在森林里而不是沿着小路走，这个流浪者最终会回到金属门。继续这样做最终会将您带到Level -4或Level 135。
//
//基地、前哨和社区：
//此层级不存在已知的基地、社区或哨站，但在这里建立哨站是理想的。
//
//入口和出口：
//入口
//目前没有已知的进入该层级的方法，因为人们报告说他们通过某层级的门随机进入该层级。有些人通过在特定层级的床上睡着进入此层级，但这种情况很少见。
//
//出口
//有 5 种方法可以退出此层级。走出豪宅，打开大门后，您可以走3条路。左边的路径带你到Level 9，前进的路径将带你到Level 11，右边的路径将带你到Level 80。第四种方法是进入阁楼上生锈的旧门，它将带你到Level 19。第五种方法是在厨房的一楼找到一个小储藏室。在那里，房间的另一边应该有一扇破旧的门，穿过它会带你到Level 410.1。
package lvls4x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl410{}