//Level 414
//
//
//致任一觅得此境之人，
//
//汝已正式受邀进入吾等之家园，永恒花园，到此以逸汝之劳形并寻求这天成圣境的庇佑。
//谨随闪烁藤蔓的指引，它们将为汝指引路径。
//
//- 辛尼
//
//flower_icon_new.png
//
//花神之触贯穿时空
//
//
//将其子民与孑然的流浪者携往安居之地。
//
//
//
//留心香径，携花跋涉，
//
//因为，汝已受吾等庇佑。
//
//
//
//因为，只要汝未舞爪成胁，
//
//永恒花园便永为汝安身之地。
//
//lvlimg_7.jpg
// 
//
//生存难度：
//
//等级 宜居
//
//资源充足
//友好社区
//隔绝危险
//lvlimg_1.jpg
//欢迎来到我们的庇佑之地。
//
//
//
//
//
//永恒花园乃是一个蔚为壮观的草木圣境，也是扎根大地的花朵与植被的家园。
//
//多年以来，此层级保持着宁静祥和，隐匿于后室其他部分之外。但时至今日，在花束议会的至高之蕊的旨意下，这些花乡原住民开始欢迎流浪者进入花园。
//
//
//
//
//至高之蕊阿格诺，你真的想让这一改变发生吗？
//
//没错，我想我们已在他们面前遁藏已久了。
//
//但，你真的确信我们可以相信他们？或许我必须得提醒你：我们为什么要把他们所能想到的所有入口给封闭了。
//
//艾格妮。那已是遥远尘封的事了，几乎所有的宫廷成员都同意了这个决策。
//
//……
//
//现在我们只让一个流浪者进入花乡，单纯是为了观测他们将会如何作为。自此而始，我们将会决定是否继续施行这个计划。拜托了，亲爱的……
//
//如果这不是唯一一个，之后就会…… *叹息* 亲爱的阿格诺，你有信心应付失控的情况吗？
//
//放心吧，我当然不是凭违背本心做事成为现在的至高之蕊的，难道不是这样吗?
//
//*大笑*好吧，我想你会是对的。
//
//
//地理
//身为一个硕大无朋的植物花园和公园，永恒花园内充斥着茂盛的森林和绚烂的花园。在永久的春季中，气温仅在宜人的23°F至73°F波动，此外大陆上还常年吹拂着湿润的微风，永久性地携带花香。
//
//丛生都市
//lvlimg_3.jpg
//我们可以共存。
//
//此地点是该层级大多数文明定居的主要城镇，这些文明主要由土著类人物种组建，即伊芙拉尼亚。这里包含一个建造在山上的巨大温室，你可以在此处找到大量商店，咖啡馆，以及其他流浪者所需的资源。这些资源主要由自然材料组成，包括但不限于：水果，蔬菜，及其他植物基质。
//
//该地居民现已含有接近300名伊芙拉尼亚，但在整个永恒花园还有数不胜数其他的定居点。
//
//lvlimg_4.jpg
//生活如此惬意。
//
//该区域内的住房皆将现代人造设计与时刻生长的自然环境相结合。家具大多由石料和木材制成， 此外还有藤蔓在墙壁与其他支撑物上蜿蜒。
//
//此处住房并无能源，而是使用一种特殊的，层级特产的晶体作为替代。这些晶体依其颜色不同分别具有各异的功能；而在居家生活中最常见的晶体为红色(用于供热)与蓝色(用于降温和冷冻)。
//
//大花谷
//lvlimg_2.jpg
//此乃自然鬼斧神工之景致。
//
//大花谷蜿蜒的距离难以估量，它是连接该层级多数美丽地标与热门景点的要道。据说伊芙拉尼亚最初就是在这片山野中被唤醒的，因此大花谷也承载着其重要的文化遗产与绝美景致。
//
//许多居住于此的伊芙拉尼亚有时会被发现在山谷中抚摸或采集花朵。许多伊芙拉尼亚会将采集到的生长于此的花朵制成花圈，选择特定的花朵可以将如活力和欢乐等美好事物带回家中。
//
//除了作为一个赐福生灵的福地，它也拥有着作为逝去与死亡的伊芙蓉拉尼亚的避风港之职能。 每当有伊芙拉尼亚逝世，大花谷中便会举办一场纪念它们的仪式，并以此让他们的灵魂重新进入花朵绽放的生命周期。
//
//常春中庭
//lvlimg_5.png
//希望之露台。
//
//在大陆的中央矗立着常春中庭，花束之乡。这个美丽的城堡亦是本源之源，而本源就是让大地保持生机的神奇之物。
//
//花束议会是一个由25名被选中的伊芙拉尼亚组成的议会，由本源亲自挑选。每位成员都在花束议会中有着不同的职位：视察城镇，维护居住着伊芙拉尼亚的温室，对家用的供能晶体进行质检，等等。一旦花束议会中有成员凋零，另一个继任者就会被选中填补其空缺，因为它们在保障永恒花园的存续中发挥着关键作用。
//
//
//无人知晓本源是如何挑选花束议会的成员的。然而，至高之蕊，作为花束议会的监督者，总是会先经由议会推举，并在此之后接受能与本源亲自相见的一场试炼。如果本源接纳了被选中的伊芙拉尼亚，它们将会成为新的至高之蕊，并将与一个永不终结的知识的源泉相连结，受其滋养。
//
//万一这些被选中之人无法完成这一试炼……
//
//lvlimg_6.png
//花园仍在滋长。
//
//这便是所有你需要知道的主要地点了！其他的那些东西就凭你自己去探索吧！这之后你想知道些什么？
//
//之后你能跟我讲讲伊芙拉尼亚吗？我对是什么造就了你…你们真的很好奇！我希望这个问题没冒犯到你，辛尼。
//
//哦！你当然可以问了，只要是我马上能想到答案的我都会尽数告诉你！
//
//伊芙拉尼亚
//概述
//伊芙拉尼亚是一种居住于永恒花园的类人的，与植物相近的物种。他们拥有自主意识和高度智能，已经发展出了自己的文明，并拥有相应的经济基础和上层建筑。
//
//entity_placeholder.png
//一个伊芙拉尼亚。
//
//生物学特征
//伊芙拉尼亚个体拥有各异的形态与大小，还有远超平均人类寿命的生命周期。此外，伊芙拉尼亚还会拥有下列值得注意的特征：
//
//它们的头部完全由一朵花覆盖，掩盖了它们的嘴部与颔部。
//拥有隐藏其藤蔓状手掌的叶状的袖褶。
//伊芙拉尼亚大体上由四个生长阶段：破种期，萌芽期，孕苞期和开花期。伊芙拉尼亚的花状头要一直等到萌芽期适才开放，而开花期是它们生命周期中最长的一段。第五也就是最终阶段为凋零期，即伊芙拉尼亚开始失去它们的花瓣，它们的色彩，乃至最重要的——它们的生命。
//
//伊芙拉尼亚头部绽放的花朵同时也表达了它们的名字。1
//
//历史
//伊芙拉尼亚最初的演化形成的时间并无相应史料的事实是令人吃惊的，尽管它们有高度智能。有些个体声称它们已存在了数百年，其他个体则估测了更短的存在时间。但在此物种中有一点是公认的：本源赐予了它们生命并给予了它们的一切，让它们对其恩典心怀感激。
//
//至今，人类似乎对在此层级中的生活适应良好。灌木的萌芽期和开花期性状正在开始与人类亲和。融合进程十分顺利。我们很快就能……
//
//真是惊奇……
//
//……
//
//阿格诺？你还好吗？自试炼开始你开始变得不太一样了。
//
//我……*叹息* 唉，艾格妮，为何被选中的是我？
//
//本源究竟出了什么问题-
//
//我就永远不该出现在这里！我不应知晓这一切的！本源它就不应该接纳我还……
//
//吾爱阿格诺，我恳求你！冷静下来……告诉我发生了什么。
//
//我-我不能。艾格妮，如果我告诉了你我所知晓之事……我担心你也会和我一样沦落到如此田地。
//
//阿格诺，我们已携手经历了 一切 。我会如你一直扶持我一样成为你的后盾。如果你有什么难处，我便会与你共担风雨……所以，求求你，告诉我发生了什么。
//
//……
//艾格妮。 若人类永不被放逐。 我们便永不会再度生长。
//
//此乃本世界无人敢于涉足之地：余烬原野。这也是人类被放逐前的最后一站。
//
//他们贪得无厌。他们四处索取，他们纵火焚林，他们肆意践踏，从未对滋养他们的大地感到一丝敬畏。
//
//终有一天，大地忍无可忍。
//
//一个接着一个，自然它将人类掳走，带往未知无言提及之地。人类试图逃脱，但一切都为时已晚— 大地将他们囚陷其中，并取回了它应有的所属：生命。
//
//当人类消亡殆尽，一切归于寂寥。
//
//无物言语。
//
//无物歌唱。
//
//
//大地在寂寞中生长。
//因此大地决计让生灵回归。
//
//它在想如果它以其自己的形象创生人类，这样他们就可以按它所希冀的方式来照料它。这样它将不再孑然；也不再被遗忘。
//
//当它创生之时，它于他们心中播种：遗忘之种，求知之种。
//
//它需要一个他们能信任之人，一个定能使这大地如其所描摹之图景般繁花灿烂，欣欣向荣之人。
//
//因此，第一束花与其花蕊诞生了。
//
//花蕊知道大地的秘密。唯有花蕊有了解其真相之能。
//
//它会于无声处见证其成长，用其前所未见的样子绽放。
//
//它在啼哭了。它因生命再次被世人珍重喜极而泣。
//
//永远……
//
//如果本源不喜欢我，它会作何举动？
//
//哦，如果本源不信任你，它早就会把你从我们的大地上驱离了！
//
//这是不是意味着…本源已经接纳我了？
//
//哈哈哈，看来你已问过阿格诺那事了！薇将会知道本源是抱何看法的！
//
//啊，也是。只有至高之蕊能与本源直接交流呢…
//
//入口/出口
//入口
//如果你渴望进入此层级，跟随闪烁藤蔓。它们可能会在你所居住的任一层级内出现，除非该层级缺少阳光或有某些阻挡本源从层级外连接的事物。2 如果你成功跟随了闪烁藤蔓，层级入口将向你敞开，它将是一个附着着随风摇曳的藤蔓与鲜花的拱门。
//
//出口
//若你真想离开，只需表达离开的期望即可，你会找到一个仅一边长有花丛的石板小径，它常会将你引向另一个与自然有联系的安全区域。留心你所看到的花，因为它们会提示你将会到达的是哪个层级。
//
//紫罗兰	Level 10, Level 29
//蒲公英	Level 11, Level 125
//木槿花	Level 48, Level 149
//牵牛花	Level 63
//玫瑰	Level 90, Level 186
//樱花	Level 178
//忍冬花	Level 224
//反正我是不会担心这个的！我是说，你从未聆听过土地为你的存在轻吟浅唱吗？微风又是如何引导你前往它所欲你前往之地？花儿又是如何揣怀爱戴之心与你照面的？
//
//本源会垂爱于汝。它一直挂念汝之存在……
//
//植物们正有什么私语想倾诉于你……
//« Level 413 | Level 414 | Level 415 »
//
//Footnotes
//1. 例如，一个头部绽放薰衣草的伊芙拉尼亚可以被称为拉芙或艾文。
//2. 比如有着特定进入方式的封闭层级。
package lvls4x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl414{}