//Level 444
// 
//
//生存难度：
//等级 5
//
// 
// 
// 
//l2wS1KGjrugDRPW.jpg
//目前处于一次“后变换事件”中的Level 444，时间为07:18:0.05。
//
//Level 444是后室的第四百四十五层。当下，它是最难通过的层级之一。
//
//描述：
//Level 444是每47-57分钟都会经历一次程度极大的结构变换的不稳定的一层。 每一次Level 444重组（现在被称做一次后变换事件）时 ，道路将会变得完全不同，而且主体结构也将随机重组。有些墙壁看上去没有碰撞机制，使得家具和物品卡在里面。一些房间会让人完全失去方向感，有的甚至没有一种固定的模式，这使得流浪者的视线常被混淆。
//
//在各种不同的后变换事件中可能注意到一些物品、各种家具以及一些结构与其他各个层级的有着相似之处，例如：
//
//一面黄色的墙壁，和Level 0的很像；
//一扇能看到Level 11公路的窗户；
//一面体积小且有着帝国大厦构造的墙壁；大概来自于Level 45，当被打开后它将通往Level 444的另一片区域；
//一个没有异常影响的Level 119内的黄色滑梯；
//Level 136中的门，不管怎么说，它是打不开的，
//一个Level 190中的浴室壁橱，里面没有物品，有一次是被打开的；
//Level 256中的控制器；
//Level 300中受损的一部分木板路，
//一个Level 333的模型，卡在一面墙里，
//Level 389的木板结构，
//一个破损的通往一个不存在的的层级的入口，不可接近。
//若寻求一份完整名单，请查看文件发现的物品.txt。
//
//Level 444有大量实体的出现。在每一次“后变换”事件后，出现的实体会有：死亡飞蛾、猎犬、窃皮者、笑魇（只会在“后变换事件”后的黑暗区域出现）、爪形菌株以及死亡之鼠。
//
//在一些独特的后变换事件，可能会看到有一些实体与只会出现其他特定的层级中的实体有着一些相似之处，例如：
//
//一个Level 7的它的头骨；
//一顶纸做的王冠，像是王持有的王冠中的其中之一；
//一顶派对帽，被派对客=)使用过；
//一个卡在没有任何性质的墙里的面具，很像是游戏大师的脸。
//若寻求一份完整名单，请查看文件发现的实体.txt。
//
//需要着重强调的是Level 444完全没有任何类型的补给品。如果你不得不通过Level 444，确保你有着以下物品：
//
//杏仁水；
//收音机；
//手电筒；
//一个计时器；
//结构变换事件
//每47-57分钟，Level 444将经历一次结构变换事件。在此期间，所有的灯都将立即关闭并且Level 444会在灯重新亮起后完全改变。结构变换事件会持续10到15秒。手电筒在此期间不会工作。
//
//在一次单独的后变换事件中，Level 444中3/4的墙壁会有一个计时器显示距离下次结构变换事件还有2小时。
//
//基地、前哨和社区
//Level 444中没有已知的基地、前哨和社区。
//
//欢迎您，已授权人员
//注意
//在一次后变换事件中，一具卡在一面出错的墙壁里流浪者的尸体被发现。据信，这是第一个来到Level 444的人。一本日记在他的背包内被发现。日期是1998年9月9日：
//
//成吧，我被困在这里了，我不知道现在这他妈是发生了什么，但这个地方一直在不停地改变。刚才还是一个地堡的走廊然后现在就成了他妈的一个车库还有着…我其实不太清楚。而且最糟糕的一点，这里有着一大堆实体，我需要一直保持警惕。我宁愿死在00.5那个地方或者01.7那边儿也比死在这儿强。
//
//我这边一个人都没遇到，这里只有我一个人。是我真的太倒霉了，还是根本没人来过这儿？我必须尽快联系“领头羊”那边的人。
//
//好，场景又一次改变了，现在这边是个狗日的购物中心的休息室，这边什么都没有而且有些墙还不能让我通过。操蛋。我没有多少剩下的杏仁水了。我必须尽快找到更多的才行。
//
//现在的场景是一个…我不知道这到底算什么，我迷惑了。这里有一个家具卡在了墙里，像是他妈的电子游戏一样。有些墙甚至什么都没有，没有材料，没有结构像是它们根本不存在一样。在一面墙上，我看到了一个衣柜还有一大群想杀了我的死亡之鼠。我不得不跑开。我不知道我还能不能在这里继续挣扎了。
//
//好吧，这个世界不喜欢我我，对吗？我找到了一扇木门，我差点就够到它了，然后一面墙凭空出现随后那扇门就消失了。我…我只是不知道究竟发生了什么…
//
//这里的场景已经改变了三次了。现在…我是真的害怕了，什么鬼玩意，认真的，这些墙上长满了眼睛还一直看着我而且还写着“我看到你了”或者“我做我想做的一切”。在一个桌子上放着一个古怪的照片上面是一个辨别不了的男人，看上去在看着我一样。字面意义上的。哦，上帝，我真的受够了。
//
//真的有什么人在看着我吗？
//
//.
//
//.
//
//.
//
//[最后的八页上面写满了“它就在这里，在注视着我”以及“我没法从它手里逃脱”。]
//
//额外说明： 后续的关于“领头羊”的调查正由M.E.G.进行中。
//
//入口和出口：
//入口
//想要到达Level 444，你需要在Level -1中穿过一扇有着轻微损坏的门。
//
//出口
//要离开Level 444你需要找到一扇木门。它并不需要任何钥匙，但是只会在每14次“结构变换事件”中的第7次出现而且它很难被找到。一旦你进入了此门，你会发现你正处于Level 176的休息室。
package lvls4x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl444{}