//Level 440
// 
//
//生存难度：
//等级 5e - 环境危害
//
//极端不安全
//不稳定
//实体绝迹16981401509_165d48c3d5_b.jpg
//由未知流浪者拍摄的层级影像。此时沙子似乎变得更冷了。
//
//Level 440是后室的第441层，又被称作“沸腾沙漠”。
//
//描述
//Level 440是一非线性的无限沙漠，昼夜循环周期为20分钟，仅拥有少量不可饮用的水。Level 440中的太阳类似于前厅的太阳。
//
//流浪者进入层级时，他们会立刻感受到脱水，并在60分钟内干渴而死。高度建议进入本层级前先储备足量的杏仁水。
//
//此沙漠的温度时常随时间变化而上下波动，期间伴随有4.4到13.3摄氏度的微风。然而，每隔几天热浪就会来袭一次。此时温度将以极快速率上升，最高达到75.5摄氏度。
//
//沙子的温度会在32.2到102.2摄氏度之间自行波动。温度高于61.6摄氏度的沙子将开始沸腾并进入类似流沙的状态。流浪者被困在流沙中后将一路下沉到底部。如果有流浪者被沙子陷住，建议尽可能快地将他们拉出来。被沙子包裹后，他们应当被视为死亡。
//
//多名M.E.G.成员发现有大型植物被掩埋在沙子下方。这些植物不断地产生火焰，他们认为这是造成沙子极端高温的原因。这些植物太过坚韧，无法挖掘或扼杀。有三类记录在案的树木：白桦树、黑橡树和棕榈树，它们围绕着这些火焰植物，每一种树型都似乎是脱水的，且预估可以无限延伸。少见的是，这些树会有椰子，其外壳由90%的固体铁制成。所有树的树液一经接触便会灼伤皮肤，在任何压力下都会燃烧。另外其中还混合有腰果水。
//
//在少数情况下，灰色的液体水坑会产生。这些水坑非常深。尚不明确它们是如何做到在极端条件下仍不被蒸发的。建议远离它们，因为消化这种液体会导致胃痛、严重的幻觉或器官的溶解。接触这种液体会导致流浪者的皮肤被撕掉，如果不及时处理，就会出现接近致命的出血。M.E.G.的研究已经得出结论，这种液体是腰果水和一种未知物质的混合物。
//
//基地、前哨与社区
//由于这一层级的环境危害，没有已知的基地、前哨或社区。
//
//入口和出口
//入口:
//可以从枢纽的对应门进入Level 440。
//可以从Level 14中的五彩树叶中切入Level 440。
//在后室的任何层级中进入一个足够大的灰色水坑。 如果层级没有出口，这些水坑就不会出现。
//在终点的电脑上运行“NICEDAY.EXE”文件。
//出口
//往一个方向一直走5公里左右，就会发现附近的沙丘上出现了破损的钢门。打开这些门的唯一方法是使用层级秘钥。
//
//历史
//此层级多年来发生了巨大的变化。它曾经是一个适合生命生存的大森林，然而随着一场灾难的发生，这一生态系统遭到严重破坏。树木因突然脱水而死亡，植物很快被压实的沙子包围，基地或前哨由于温度升高和环境变化而迅速倒塌；这个层级很快变成了一片荒地，但当时没有人知道灾难是如何发生的，也没有人知道是什么原因。随着越来越多的流浪者进入层级，沙子的数量迅速增加，并因之而导致它盖住了整个地面。没有人注意到沙子的数量在增加，也没有人关心这种事情，直到他们发现已经晚了。随着沙子的不断增加，处理或阻止它的尝试变得毫无可能或无法进行。沙尘暴摧毁了周遭的环境，每个人都立即赶去逃离这个层级。许多流浪者经历了严重的伤害，另外的人则在热浪袭击中死亡。许多流浪者遭遇了严重的创伤，而更多的人都已经死亡。
//
//
//
//
//
//
//(点击关闭上一版本的Level 440。)
// 
//
//生存难度：
// 
//动植物繁荣
// 
//Level 440是后室的第441层。该层级由一片无边的森林组成，极其适合人类生活。如果可能的话，建议在寻找休息场所时，前往Level 440。
//
//描述
//49235432661_48af4f7b02_b.jpg
//一些树木和植物的特写图片。在这张图片中，植物并没有展现出特殊之处。
//
//Level 440，也被称为“缩放森林”，是密室的第441层。它的外观是一片茂盛的森林，由大尺度的树木组成。这些树通常是黑橡树和白桦树，但在这一层也发现了其他类型的树，比如棕榈树。这些树里面有一种丝状的汁液。涂抹在伤口上时，这种树液会慢慢地治愈伤口，且食用后会大大增强体力。这些树上挂着各种物品，如椰子。椰子似乎是由铁制成的，其内部含有与树液混合的杏仁水。
//
//在本层级中可以发现小雨云。云中产生的雨滴温度在-12.2°到-6.6°摄氏度之间。当流浪者接触到这些雨滴时，他们会恢复体力，且伤势开始愈合，类似于杏仁水的效果。1
//
//在本层级中可以找到杏水河，这是可以饮用的安全水源。强烈建议，如果你想找一个永久的定居地，应该在杏水河附近定居。这些河流通向地面上的长洞，后者似乎没有尽头，且充满灰色的杏仁水。
//
//这个层级能够满足流浪者的任何需求或请求。如果一个流浪者非常口渴，层级会在附近提供多瓶杏仁水。如果一个流浪者想去一个层级，他们最终会偶然发现一个层级秘钥，它可以通往那个层级，然后是一个上锁的活板门，只接受上述秘钥。
//
//本层级的许多植物都生长在小空间里，且大多数都有独属的特性。这些植物很容易生长和繁殖，并且会互相残杀以防止过度繁殖。最常见的情况是这些植物在接触后自发地燃烧成火焰，连同它们周围的区域。流浪者不会受到火焰的影响，只会感受到一阵快速的热风，使流浪者往后跳。另一种植物长成一个收集水的水壶的形状。它用水来引诱动物，然后在动物的头上扣住，使其窒息。它不会对流浪者这么做。
//
//这些日志是在层级改变到目前的状态后恢复的，本文档记录了转型的第一手经验。
//
//（隐藏日志）
//<日志1 开始>
//时间： 11:42
//日期： 4/18/2015
//
//Evelyn: 嘿，我是，呃，Evelyn。不知道这是对谁说的，也不知道是否有人能发现这个。我认为这个层级正在发生变化……这个层级似乎……呃……不对劲。
//
//这些树，它们看起来……怎么说呢……死了？它们似乎并没有真正的生命力，而椰子它们……它们看起来有些不一样？它们的颜色变了，而且……里面？看着也不像杏仁水了，但是，呃……它们看起来更像腰果水。杏水河也是如此，我很肯定那些也是，呃，腰果水。
//
//还-还有树液，似乎也不一样了。它现在是粘稠的，而不是像平时那样丝滑的。而且它还……有点酸？它能溶解一些东西，比如研究设备……它似乎不像以前那样能让人受伤了。
//
//我不知道为什么以及是什么造成了这些改变，但是有些事情，呃，对这个层级来说变得不一样了，而且我找不出一个能解释这些的原因……所以如果有人能听见这个的话，我希望……
//
//{此时音频似乎被切断，然后是静电。}
//
//<日志结束>
//<日志2 开始>
//时间： 17:09
//日期： 11/3/2015
//
//John：好-好的好的，冷静一下……所以我的名字是John，我注意到了一些事。沙子；在变多。它停不下来，也不准备在什么时候停下来。它完全压倒了我们，它在掌握一切。
//
//树能将沙子当做营养物质使用，它们可以在，呃，一个人进入层级时出现。但自从沙子开始出现后，树木就开始死亡，沙子也一直在，就像，堆积，而我们一直都没有找到树木死亡的原因！
//
//沙-沙子非常热，而且没有人试着阻止它！M.E.G.看起来就，就像，根本不关心这个！他们警告我们保持冷静，他们会处理的，但他们没有做任何事情来阻止它!小屋，基地，所有在这里建立的东西都被摧毁了！
//
//绝对是出了问题，这个层级正在消-消亡，我而们没有办法阻止它。没有人试图阻止它，而那些可能阻止它的人，只是把它推辞掉了！这部手机的电量很低，所以我必须，呃，缩短这段话……但如果有人能听到这段话的话，请不要让这个层级因我们而死！
//
//<日志结束>
//基地，前哨与社区
//园丁
//第一批发现这一层级的流浪者。
//对新人开放。
//呵护环境。
//没有层级或前哨。
//M.E.G.卡拉德隆基地
//由大约100人组成。
//用树上的雕刻和标志引导迷路的流浪者。
//为流浪者制作小型基地，由3-5个小屋组成，每个小屋都由木头制成，有营火，通常在杏水河畔。
//其他前哨能够在这一层次建立，但没有记录。
//
//入口和出口
//入口
//进入这一层级的最简单方法之一是在Level 18的一个类似森林的生物群落中不小心绊倒，有50/50的成功率。
//
//进入这一层级的唯一方法是在任何一个层级切入一棵足够长的树。这棵树每分钟都有很低的几率产生，如果不精确地进行切入，很可能会失败。视线从这棵树上移开会使它消失。
//
//出口
//在同一方向徘徊10公里，会看到一堵巨大的石墙，中间有一扇沉重的铁门。在这里可以找到一堵巨大的层级秘钥墙，每把钥匙上面都有一个数字标签，有梯子可以用来取得更高处的钥匙。在锁内插入层级秘钥，并打开门，就可以把流浪者送到层级秘钥上标明的层级。
//
//当一个流浪者进入时，小的沙丘会出现。这种沙子一旦接触到火种植物，就会开始让它变得更强壮，同时迅速生长，一旦接触到树木，就会让它们迅速脱水。
//
//著作信息
//« Level 439 | Level 440 | Level 441 »
//
//Footnotes
//1. 这种形式的再生有多种副作用。其中之一是在再生的地方增加一小块皮肤。在同一个地方多次被割伤和再生，可能会导致流浪者的身体变得畸形。
package lvls4x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl440{}