//Level 458 - “佩德罗帕帕披排铺”
// 
//
//生存难度：
//等级 3
//
//不安全
//不稳定
//少量实体
//Level 458是后室的第459层，它外观为一个非欧几里得的披萨店。
//
//描述：
//qdTWncMeoZitPCI.jpg
//一张被发现于层级中菜单的披萨图片
//
//Level 458 是一家规模似乎无限大的披萨店，第一眼看上去它像一家常规的披萨店，新鲜的披萨陈列在货架上。然而，墙壁和菜单上的文本难以理解，文本使用不同书写系统的不同字母、数字和随机符号写成，这些文本同披萨和类似食物的图片一起展示，如蛤蛎披萨派、披萨包饼和披萨面包圈。这些文本的排版十分混乱，有些文本看起来是打字机打上去的，有的看起来则是手写的。其他情况下，文字与图画看起来似乎是通过不同图像组合在一起而成的，在每个房间内至少存在四个安保摄像头，这些摄像头被用于观察进入该层级的流浪者。
//
//部分区域的墙壁、天花板和地板明显的裂开并滴落着浓稠的黄色流体，这易让人联想到油脂。这一流体的温度从 -24°F1 到 550°F2 都存在，但其通常为 99°F3。从该流体中采集的样本显示其碳含量极高，并含有在前厅化学中未知的化合物。房间之间被漫长的走廊隔开，这些走廊往往会首尾相接或导致死胡同。层级越深入，裂缝就越多。在某一部分后，披萨标志将消失，且菜单变为空白。
//
//房间之间的建筑风格不同，常见的风格是野性主义4与艺术装饰5。层级内多数区域间有门相隔，这些隔门类型从标准的木门到玻璃的旋转门各种各样，后者的旋转装置却常常坏掉，除非有人推动，否则它将不会移动。Level 458存在四类房间，分别为餐厅、厨房、洗手间与储藏室。
//
//餐厅
//4890262388_449e598c48_b.jpg
//一张被发现于层级中的餐厅图片
//
//餐厅为层级最常见的房间类型，通常是一个有着与头部等高的天花板的大空间，房间内摆放桌椅，餐厅墙壁上挂着艺术品和名人以及所有来到过Level 458的人们的肖像，艺术品范围上到精心制作的壁画6下到钉在墙上的儿童简笔画，走廊上遍布这类艺术品。
//
//人物肖像的范围同样很广，肖像中一般会存在披萨饼和丘酪生物，或类变形虫，当人们吃饭时将忽略拍摄他们人物肖像的摄影师的存在。当人们不直视肖像时，这些图像会改变为其他内容。有时这些内容是最近一次在该层级死亡的流浪者的生前画面，这些内容会给流浪者带来巨大精神痛苦。
//
//厨房
//厨房与前厅常见的厨房相同，这一地方较为安全，因此地很少发现活体披萨，但丘酪生物常在此筑巢。判断厨房是否存在丘酪生物巢穴的一个简单方法是通过气味，如果厨房有融化的奶酪味，请立即离开。建筑方面，厨房多类似野性主义风格，房间为一个立方体带有稀疏的装饰物。
//
//虽然部分厨房的锅碗瓢盆等各式物品齐全，但其他的厨房却完全没有任何炊具。因为有些厨房库存充盈，所以他们可以作为雾气或常规炊具的来源。如果任何炊具被带出Level 458，两天后再原先它的位置上会出现一个完全相同的复制品。
//
//偶尔，炊具将因为某些原因而无法使用，有些例子：牢牢嵌入墙壁或者地板的餐具、融合在炉灶和柜台上的锅，有时这些锅部分会夹在里面。这些锅无法用正常的方式去除，任何试图去除这些锅的行为都将失败，而被夹在里面的锅或者其他什么东西可以从墙壁里取出来，这不会有意外夹伤的风险。
//
//洗手间
//Restaurant_bathroom_with_two-way_mirror%2C_Edmond%2C_OK.jpg
//层级内发现的洗手间图片，这一特定洗手间只被发现过一次，此后未再次发现。
//
//洗手间是一个有着精致且浮夸设计的公共浴室，然而也发现了一些有隔间和涂鸦的小型洗手间。该层级的各洗手间外观跨度极大，流浪者通常不会遇到与之前相同的洗手间。洗手间通常体量极小，只有一个马桶隔间、一个水槽、一个皂液器以及一个空气干燥器。但也存在更大的洗手间，Level 458上目前被发现的最大厕所有数千个独立厕位。
//
//洗手间内通常不存在镜子，存在镜子的洗手间是本层级的出口，这类洗手间镜子反射的画面与流浪者的动作存在延迟。具体来说，这种延迟会导致画面与实际行为落后半秒。洗手间装置多数无法正常运作，多数马桶堵塞、没有水或无法冲水。堵塞的马桶常被大面团堵住，多数水槽无法供水或者出来的水被油脂代替。
//
//储藏室
//储藏室体量较大，天花板上通常有闪烁的灯管照明，当房间门被打开时，灯管会自动发出亮光。储藏室墙边的架子上常放着清洁用品和维修的工具，虽然在储藏室发现的大多数化学瓶内是常规清洁剂，比如漂白剂或者是洁厕灵，但部分瓶子里有杏仁水、记忆汁、腰果水、寂静汁液或者其他任何种类的液体7，瓶子被打开前无法得知瓶子内所装液体。部分储藏室是无光的，这类储藏室会通过未知方式无效化里面的所有光源，所有光源——比如手电筒或蜡烛——都会在使用者进入储藏室的那一刻断裂或熄灭。
//
//基地、前哨与社区
//层级内无已知的基地、前哨与社区。
//
//实体
//活体披萨
//Pizza_Margherita_stu_spivack.jpg
//一个在层级发现的活体披萨图片，无法得知摄影师随后的遭遇。
//
//这类实体类似于前厅发现的经典披萨，但存在几个关键性的区别。它们总以新鲜的、温热的披萨饼的形式存在，并散发着少量的热气。然而奶酪和一些配料会如同严重肌肉痉挛一样轻微地在上面跳动，如果有人试图触摸、靠近或拿起活体披萨，这些奶酪和配料就会跳到这个人身上，并且像吸盘一样吸住这个人，通常是吸在脸上和手上。这一次攻击会惊动附近的所有活体披萨，这些活体披萨就会同样吸附，如果附近存在足够多的活体披萨，这个人可能会被埋在大堆大堆的其他披萨里。
//
//该实体会将它们的袭击目标转化为披萨原料，并创造新的活体披萨。这个过程通常需要数个小时，过程中活体披萨处于最脆弱的状态。一旦袭击目标被完全转化，旧的活体披萨与新出现的都会分散到原来的位置，返回时活体披萨们会像鼻涕虫一样蠕动。如果长时间内没有袭击目标供攻击，该实体将分裂寻找目标。三个小时内，一个「饥饿的」的活体披萨将通过细胞有丝分裂为两个相同个体。一旦其完成分裂，两个新个体将分散寻找新的居住区域。
//
//丘酪生物
//若流浪者或其他实体试图杀死或控制活体披萨，活体披萨这类实体可能成为在该层级稳定的食物来源。然而如果活体披萨被杀死或者吃掉，所吃掉的部分是知名的，它们的组成物质是在被食用时对活体组织有传染性。一部分活体披萨会与流浪者的胃酸发生反应嵌入胃内壁中，披萨奶酪的拉丝会以蠕动的方式进入胃腺并刺入当中的毛细血管。一旦成功，拉丝会释放出未知蛋白质与流浪者的 DNA 结合，至此，流浪者将被开始转换为丘酪生物。
//
//大约一个月后，吃过活体披萨的流浪者会被彻底转换为丘酪生物8，它是面团、融奶酪、番茄酱和各种配料组成的无定形物质，一个单独丘酪生物的配料取决于孕育它的活体披萨配料。由于未知的原因，如果丘酪生物质量被消耗，它也不会引起污染。与活体披萨不同，丘酪生物常伏击猎人，它是非常活跃的实体，它追逐猎物并在追逐时呈现人形，然而丘酪生物并不对所有实体都存在攻击性，它们会长时间处于低活跃状态，在这段期间，丘酪生物没有攻击性，你甚至可以触摸它。
//
//与活体披萨一样，丘酪生物会与猎物融合，但他们的目的不同。活体披萨的融合是为了繁殖，而丘酪生物则是为了增加质量，随着质量的增加，丘酪生物变得更大更重。然而丘酪生物的变化存在一个上限，通常是一吨9左右。因此，重量达到上限的丘酪生物将会用质量覆盖 Level 458 的大部分地区，一旦这个界限被达到，丘酪生物会开始分裂为无数个形成不久就会消失的活体披萨。
//
//类变形虫
//虽然活体披萨分裂过程通常是正常进行的，但在某些情况下这个过程仍然会因为自身缺陷而被外部力量打断，在一个正处于分裂过程中的活体披萨上呕吐是打断或破坏这一过程的最快方式。当这个过程以该方式被打断时，面包皮上会出现气泡，配料的位置会被打乱。
//
//这些异常个体会极其痛苦，但它们会仍继续常规的生活，这一痛苦感受会在它们食用到流浪者之后被治愈。然而如果长期不进食到一定的时间，这种痛苦会加倍之于活体披萨，这会导致它无法正常分裂。前期这会导致两个独立个体粘连在一起，两个独立个体试图继续分裂，但这只会导致更多的个体粘连在一起，于是一个新的实体因此诞生。
//
//虽然类变形虫10只能活一个月，但它们的生长速度极快，可以覆盖 Level 458 的广大区域。这些实体会无差别攻击附近一切东西，将大量实体同化。它们同样会积累热量使其沸腾甚至燃烧，你只需要最大的类变形虫就可能被点燃。这种热量增加与其寿命相关，垂死的类变形虫个体只需要在五英尺范围内就可以点燃一张纸。
//
//此外，类变形虫不会显现出任何衰老迹象，它们的死亡是突然性的，特点是其生长和运动几乎瞬间停止。死去的个体从天花板或者墙壁上剥落下来，形成一大堆。由于其巨大的体积和超高的热量积累，死亡的类变形虫会在随机区域自燃，这些火一般在尸堆中心产生。实体会在六个月后燃烧直至腐烂消失。
//
//巨无霸披萨
//关于巨无霸披萨只有极少的信息11，但据说它遍布整个 Level 458 的墙壁、天花板和地板。巨无霸披萨的活动标志包括地面的震动、层级部分地区意外地膨胀，墙壁、天花板和地板地裂缝被一层层薄薄的黄色液体覆盖。
//
//如果一个人站在上面提到的裂缝上足够长的时间，一条由沸腾的奶酪、番茄酱、植物与动物肌肉组织组成的触手会从洞里伸出进行攻击。该触手滴落的黄色沸腾液体与围绕裂缝的液体相同，如果成功袭击，被袭击目标会被拉入裂缝中。被拉入裂缝中的流浪者通常不会被再次发现，少数的被发现的幸存者留下了严重烧伤，发现时身上沾满与裂缝相同的液体，如果要从身上洗掉需要不断努力擦洗数个小时，之后液体会慢慢凝固，与水接触后可以被剥落。
//
//入口和出口：
//入口
//除了切入/切出之外，存在三种已知的直接方法进入层级
//
//如果在Level 8发现一段墙壁上有奇怪的油渍的洞穴，向深处走去。最终会发现一扇通往本层级的门。
//在Level 11的比萨店，有「佩德罗帕帕披排铺」的标志可以进入本层级。
//在Level 205发现并咬一口化石披萨会把人传送到此地。
//出口
//除了从层级切出12之外，已知四种方法能够离开 Level 458。
//
//如果你发现一个天花板滴着蓝色油漆的走廊，请沿着走廊一直前进，直到发现一扇被同样材质的尤其覆盖的们，穿过该门你就会来到 Level 255 的一个蓝色区域。
//闯入门上刻有「已有人」字样的上锁洗手间可以进入 Level 189。
//在洗手间的镜子里切出可以到达 Level 696。
//在一个完全黑暗的储藏室内走的足够深将进入 Level 64。
//著作信息
//« Level 457 | Level 458 | Level 459 »
//
//Footnotes
//1. -31°C
//2. 288°C
//3. 37°C
//4. 野性主义（Brutalism）表现为极简化、立方体构造以及裸露建筑材料和结构元素的展示，而非繁杂的装饰设计
//5. 艺术装饰（Art Deco）试图将昂贵的材料与精湛的工艺结合到现代艺术主义
//6. 在墙壁或天花板的湿石膏快速进行的创作，这样颜色就会渗透到石膏中，干燥后迅速固定下来。
//7. 甚至包括在后室不存在的液体，比如水。还有一些硫酸、铁液和融金
//8. 该名称源于丘酪生物静止时看起来就像一个由披萨材料组成的大丘陵
//9. 2000磅
//10. 它的名字来源于这类实体堆积与攻击的方式类似于变形虫的运动和进食过程
//11. 这是个超大的纽约披萨饼的名字，通常按片出售
//12. 常见切出方式有：在门口用脚猛烈摔门，头朝下跑到角落中，在储藏室里用手指猛烈摔门
package lvls4x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl458{}