//Level 436
//评分: 
//+10
//+
//–
//X
// 
//
//生存难度：
// 
// 
// 
//134pier
//图片摄于Level 436，图中码头是区别于“船长码头”的另一码头。
//
//描述
//Level 436被认为是一个类似于Level 11的安全宜居区域，尽管到达该层级的过程本身相较于到达其他宜居层级的过程会更危险。因此该层级的人口明显较少。
//
//层级是一个无限大的海滨地区，海滩通常由白沙与蓝绿色的海水组成。海水温度与该层级的天气都是不稳定的并可能在毫无征兆的情况下从热带气候变为严寒的风暴气候。虽然天气变化令人不安，但除营地或物品可能会被冲走外，该现象并不会对生命构成任何威胁。该层级也有一个半规则的昼夜循环周期，尽管白天与夜晚在如同天气变化般不稳定的波动着。
//
//进入该层级后，流浪者可能会到主码头或附近，主码头被一群称为“船长和船员”的海贼叫做“船长码头。”
//
//船长码头
//该区域通常是距离任何新抵达此处的流浪者最近的码头，值得注意的是它是最大的码头，也是整个Level 463人口最多的区域。
//
//码头本身包含各种各样的商店，虽然它不像海滩一样是无限大的，但它可能会随机的变长或变短，这会导致变化区域的商店和建筑出现或消失，或在极少数情况下直接掉下来。每个商店通常都是空的，除非有流浪者或船员居住在里面。值得注意的是，最初的几家商店已经被拆去了大部分材料，尽管新的商店会出现，但是显然它会被足够快去掠夺它的人抢去。
//
//如果是在晴朗明澈的夜晚，人们一直走到码头尽头就有可能看到模糊且如幽灵般的海盗船，大多数海盗船都明显受损尚无法航行。它们似乎并不会构成任何真正意义上的威胁，它们身上也没有任何迹象表明会发生更诡异的事情。然而它们从来没有距离人们近到足以被人们探索或调查的程度。
//
//生态系统/实体
//如上文提到的，层级气候范围自温暖至严寒都有所遍布。因此所有海洋或其周边的生物都被发现对这两种气候情况有很好的适应能力。每种动物坚硬的外皮或外壳都能有效调节体温，既能使生物保持温暖，又能在必要时通过皮肤或外壳以令人难以置信的速度快速地过滤氧气来防止寒气侵袭动物。
//
//Level 436最重要的生命形式是海藻，与在地球上看到的任何海藻不同，Level 436的原生海藻具有大且呈桨状的叶子，颜色为棕绿色，质地如砂纸。在暴风雨天气长期阻碍阳光照射的情况下，海藻能够通过水中所发现的微量化学物质为食以维持生命活动，这有效地使该植物成为自养及化能自养生物。
//
//这种海藻可以被层级中几乎所有的生物所吞食，人们注意到海洋中所出现的其它形式的海洋生物，它们被怀疑是来自Level 81，它们来到本层级的具体细节仍未被探索，因为其或是被层级原生实体所杀死并吃掉，或是被后室渔民捕获，这些食用者注意到这种生物身上带有明显的杏仁味。
//
//该级别的原生实体如下：
//
//近海墨鱼1：海上软体动物，常呈蓝色，目前尚不知是否与在前厅发现的墨鱼存在任何相似之处。
//沙克蟹：超大的甲壳类动物，同前厅的塔斯马尼亚巨蟹有通常的相似性。已知与前厅变种的差异包括大小、行为与智力。这些螃蟹是很杰出的小偷并应该极力躲避它们。确保所有的贵重物品都被妥善保管在远离沙克蟹的地方。
//飞鲨2：在Level 436的天空和海洋生活的小鲨鱼，它们的身体上半部分呈棕褐色或棕色，下半部分则呈淡灰色或蓝色，总体而言是一类无害生物。飞鲨具有高度的智慧并能进行交流，尽管这类鲨鱼都没有舌头。此类动物与沙克蟹一样是家喻户晓的小偷盗贼，因此也应该谨慎地避开它们，流浪者应确保所有的随身物品都被妥善保管。
//截止本文发表时，船厂团大副Rue Achyls正对所列实体的性质进行更进一步的研究。
//
//所有这些生物，除墨鱼之外都已知可以离开到Level 463以外的层级，所以我们强烈建议你不要去试图“驯服”这些生物，尽管事实上“船长的船员”们似乎很容易就可以做到这一点，但试图模仿他们做法的行为已经导致了多起受伤事件的发生。
//
//基地、前哨与社区
//船长的水手
//仅有称作“船长”的人领导。
//一般表现极度慷慨。人尽皆知他们会共享自己手中的资源，并且无需付费。他们特别强调去分享“船长的特色朗姆酒”，这与监狱威士忌3十分类似。
//拥有一个值得注意的大规模音乐家社团，以他们在棚户区改造领域的技术而闻名。
//尽管一些码头上的商店已经被翻新为建筑物，还包括两座从码头上掉下的建筑物，但他们的“基地”几乎完全由悬挂在船长码头支柱两侧形成的临时吊床组成。它们对海洋生活的经验丰富，从浑身上下散发出的浓重盐味和自内而外身上附着的藤壶可以一眼看出来。
//他们的大副要求将以下视频公开出来：
//> 打开文件：captain06.mp4
//后室渔民
//一个由十人组成的微型团体，他们似乎对捕鱼和记录后室航海生活十分热衷。
//与他们之间建立了微弱的联系，来自他们那里的最近的对话仅仅是一场他们的成员之一与船长的一对一讨论。
//他们中的多数人都居住在距船长码头不远的一个码头上，他们在那里将商店和建筑物翻新成小屋子。
//虽然他们并非善于交际，但他们看上去并无敌意。
//他们通常会被发现在任何有水的层级，由于他们对鱼类的收集兴趣，若有人向他们介绍有关海洋生物的内容他们可能会愿意进行交流，但目前还无人做过此方面的尝试。
//入口和出口
//入口
//该层级可以被冒险去Level 7.2并向上游这一方式进入，这种进入方式通常会导致一个人从“海里游出来”，但也有些怪时候，一个人可能最终会在沙地上游泳。该层级也可以通过Level 43进入，方法是将自己放在天花板流下的水滴之下，大约十分钟后，流浪者睁开眼睛就会发现自己在码头上的一家商店里。此外，通过有密集的水或沙子的层级也可以落入该层级。
//
//出口
//通过潜入海中，通常当水正在它的最冷温度时可能使你进入Level 7，进入任何一个码头商店或撞碎码头的地板都可能使流浪者进入Level 5。如果有充足的资源，从海滩向外航行被证明可以切出至许多与水相关的层级。
//
//作品信息
//« Level 435 | Level 436 | Level 437 »
//
//Footnotes
//1. 据定义而言，墨鱼是同鱿鱼类似的海洋软体动物，墨鱼与常规头足类动物区别在于它内部有一个帮助其调整浮力的“乌贼骨”
//2. 译注：原文为“Volares”，其中“volare”来自古拉丁语，意为“飞行”
//3. 监狱威士忌，顾名思义这是一种常由囚犯酿造的酒品，它由各种水果组成，通常呈亮黄色或橙色。所提到的朗姆酒与鉴于酿造的酒由相同的颜色和刺激性，并同样将所有水果混合在一起，十分光滑粘稠。那些曾冒险尝试过这些酒的人指出这是一种难以置信的烈酒。
//4. 译注：俄国船歌
package lvls4x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl436{}