//Level 466
//描述
//firelight.jpg
//平原生物群系与森林的交界处
//
//Level 466 是后室的第 467 层，Level 466 是一个（假定的）无限乡村，该层级终为黄昏，天空被阴霾覆盖。
//
//Level 466 平均气温相当于温带地区春季气温，最高温度 7℃，最低温度 -2℃，强降雨是 Level 466 的典型特征，每两周有至少一场的暴风雨在该层是极常见的。这些暴风雨的范围似乎包括整个 Level 4661。暴风雨的持续长度与降水强度存在很大差异，然而这些风暴不易被检测，因为在这一典型风暴前几乎无法检测到任何相关迹象，比如气压大幅度下降或湿度的上升。
//
//生物群系
//Level 466 存在三个彼此不同的独特环境，这些环境组成了该层级的绝大部分，简洁起见我们称之为生物圈群系。所有生物群系都存在独特的区域与特征，在这一点乍一看所有的区域似乎是重复的。所有生物群系都存在自己特别的危险。
//
//平原
//平原是 Level 466 最常见也是最大的生物群系。其由起伏轻微的丘陵地形构成，土地上长满了北美草原的野草，如发菜和加拿大野黑麦。平原生物群系中也有土路，经常从此生物群系粗糙的中心区域蜿蜒而出，此生物群系只有一种实体，俗称「火光」。这些实体被认为相当有敌意，应当尽可能避免靠近其殖民地。
//
//湖泊
//湖泊是 Level 466 第二大生物群系，为了便于规划分类，湖泊及其周围的海滩地区都被视为一个生物群系。湖泊本身小且浅， 平均面积 60 公顷，平均深度 8 米。湖泊生物群系不存在任何实体，这使其十分安全。然而湖水温度为 3℃。任何试图在其中游泳者而言都会受到冻伤。湖泊边缘地带生长些植物，如水燕麦和各种香蒲。湖泊生物群系的沙滩较小，但较安全，因为所有该层级的实体都会避开湖泊。原因暂不明确，尚在研究中。
//
//森林
//blue%20forests.jpg
//毗邻灯塔镇的森林生物群系
//
//森林是 Level 466 最小也是最危险的生物群系，尽管森林区分的落叶林和针叶林树种方面存在差异，但仔细分析研究后可以发现无论外观如何，每棵树的基因都相同。这些树木的另一显著特征是其缺少年轮，一旦树木成熟便几乎无法测定年代。森林中存在极多实体，且这些实体大多不会对离开此生物群系感到畏惧。故此我们强烈建议，除非你有所准备，否则远离森林。
//
//现象
//
//各种彼此不同的说法都指向了各种异常现象，这些现象通常被描述为遥不可及海市蜃楼般的建筑，这些建筑类似于诸如房屋或者公寓一样的住房。在平原和湖泊生物群系的地平线上可以常常看到这类建筑，它们被迷雾掩盖，任何试图到达这里的努力都以失败告终。有些人声称这些建筑是其所熟悉或与之密切相关，但这些人不会考虑建筑存在的合理性。这些建筑多数不会造成威胁，但许多人在长时间凝视这些建筑后产生了一种想念与遗憾感，有些人甚至冒着生命危险企图到达「家」，由于各种生物群系间的危险，这些人往往在这一过程中丧生。
//存在的实体
//如前文所述，Level 466 绝大多数的实体攻击都发生于森林生物群系内。猎犬是最常见的实体，这些特殊的猎犬与猎犬典型的独居行为不同，其常形成 5 ~ 10 名个体的团队，这些团队将森林生物群系视作自己的领地，并大肆屠杀其认为是威胁的一切事物。这些团体能够以未知的方式繁殖，这意味着 Level 466 的猎犬与其他层级的猎犬相比，繁殖生物学上可能存在一些差别。由于这一原因，应当对猎犬进行彻底地清除，才可以创造一个安全的森林生物群系。
//
//迷彩爬行者与双尾狐也生活在森林中，迷彩爬行者专门屠杀人类，并设置复杂陷阱引诱流浪者，这些陷阱的例子包括：使用受害者的尸体作为诱饵、在人类活动频繁地区制造隐蔽的陷阱。双尾狐对人类同样存在敌意，然而本层级的双尾狐似乎相比其他种群胆小得多。
//
//Level 466 也有之前提到的独有实体——火光，正式名称为 EN-466。
//
//关闭文档
//EN-466：“火光”
//实体编号： EN-466
//
//智能 - 中等	外观 - 气动
//栖息地 - 森林生物群系边界	风险类型 - 物理
//描述：
//
//EN-466（俗称火光）是无法估量的小光点，乍一看类似于前厅发现的萤火虫。尽管其外表看起来人畜无害，然而它却是栖息层级 Level 466 较危险的实体之一。
//
//行为：
//
//EN-466 具有极强的领土意识，对任何试图接近其栖息地的生物、实体或人类都具有明确的敌意，一旦发现人类，该实体就会开始闪烁，这显然是为了引诱其进入自己领地。值得注意的是，当其他实体接近它们领地时，EN-466 不会使用这一方式引诱，这表明该实体具有区分人类与非人存在的能力。一旦人类个体进入 EN-466 领土，攻击就会开始，EN-466 开始在他们受害者的眼部聚集并快速闪烁，试图以此迷惑/致盲人类，当受害者被分移注意力或处于短暂的目盲状态时，EN-466 会开始钻入受害者的身体，并留下烧灼的痕迹。根据相关的幸存者描述，这一钻孔的感觉非常痛苦，过程需要持续约 10 分钟，随后将只留下骨架。
//
//生物特征：
//
//EN-466 以光点的形式存在，是一直径约在 2-5 cm 之间的球体。其发出的光是有形的，微小的接触也会导致一级或二级烧伤，这表明其温度在 70℃（或更高），由于这一性质，EN-466 可以被困住，然而所有试图杀死 EN-466 的行为均以失败告终。
//
//生存指南：
//
//由于 EN-466 不主动寻找或猎杀人类，所以该实体通常可以被视作安全的。然而他们与微光向导的相似性可能会给不知情者带来困扰，故此尽量避开你看到的任何 EN-466 个体，如果你发现自己被一群实体包围，以最快的速度跑出他们的领地，EN-466 不会离开自己的领地超过十米，所以利用这一点来逃跑。
//
//居住区及前哨
//
//灯塔镇
//
//军方领导者：H.D.F 的 S.Farley 中尉
//民众领导人：Lily Thorne
//建立日期： 1985 年 ~ 至今
//人口：78 名永久居民，10 ~ 15 名临时居民。
//描述：灯塔镇是 Level 466 唯一存在的已知定居点，它由 Emery Seaver 与她的探索者小队在经过长途跋涉后穿过后室建立的。其坐落在一个大型湖泊生物群系与森林生物群系之间，大部分居民居住在海滩或湖上道路交通网连接而成的房屋中，根据当时的联合领导人 Reagan Irvine 与 Jesper Huxley 的要求，灯塔镇于 2013 年被纳入联盟。
//入口和出口
//入口
//Level 39：在 Level 39 蜿蜒的泥路上会形成水坑，若跳入水中，你将会进入湖泊生物群系的海滩上，通过这一方法进入的人被看到的人描述说：进入的人就像被在湖里泡了好几个小时然后抽上岸边一样。由于湖水温度问题，通过这一方法进入 Level 466 的人往往会出现体温过低的情况。
//
//Level 135：沿着 Level 135 森林的边界处可以发现一条小路，这是较为罕见的情况，如果你愿意沿着这条小路走足够长的时间走一整圈，那么你就可以通往 Level 466，这往往需要徒步数个小时，一旦完成后你将会随机进入一个森林生物群系的边界地带。
//
//Level 220：在 Level 220 的森林中行走，有时即会看似随机的进入 Level 466，这两个层级似乎是彼此连接的，唯一的迹象是 Level 220 的白昼会逐渐变为 Level 466 的黄昏，进入 Level 466 后将位于一森林生物群系的边缘。
//
//出口
//Level 47：Level 466 内存在一些十分古老的树，这些树是进入 Level 47 的大门，你可以通过各种方法从这一层级切出，在树下睡觉或切出都可以进入 Level 47。
//
//Level 107：在湖泊生物群系的海滩上，有时可以看到一个破旧的混凝土立方体，这一立方体常沉在沙子中，所有立方体都存在一个入口——从凹凸不平的洞口到更整齐的门洞各种类型——进入其内部，它的内部是中空的，一旦进入就将被切出到 Level 107
//
//Level 302：如果愿意的话，Level 302 可以通过一个湖泊内的罕见方式进入，如果穿过水下洞穴但无法看到光线（无论是从洞口转弯还是晕倒）都会发现自己处于 Level 302 的主湖内，由于 M.E.G. 的存在，以及人们往往可能要游几百甚至几千公里才可以到达陆地，因此这种方法往往不可取。
//
//著作讯息
//« Level 465 | Level 466 | Level 467 »
//
//Footnotes
//1. 由于 Level 466 面积无限大，这个假设可能是错误的，请暂且相信它成立
package lvls4x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl466{}