//Level 494
// 
//
//生存难度：
//众神秘的属性
//被遗忘的信息
//未证实的回忆 mirror-lake.jpg
//镜湖
//
//后室的第495层是镜湖高中。
//
//描述：
//Level 494 内有一片白橡林和附带的小湖，以及位于其中心的一座被遗忘的高中。森林会绕圈绕圈绕圈，所以你向任意方位走了足够长的时间后，总会回到家的，从相反方向那边。环湖地区显现出现实扭曲效应，这使得探索极具启发性。在湖的某个范围内，到来者会经历极强的幻觉，以及真实。踏入学校建筑那刻，流浪者通常会变为曾住于此地的学生。对此效应，除了知道走出学校场地后他们会被杀之外，就不了解别的了。
//
//实体：
//本层中没有已知的实体。
//
//社区与前哨：
//本层中没有已知的社区与前哨，也不会再有。
//
//出入口：
//入口：
//通往 Level 494 的门偶尔会出现在 Level 18，倘若你还记得的话。
//
//出口：
//已知离开 Level 494 的唯一方法，可在镜湖之底找到。由于能影响精神，层级会变得难以离开。
//
//
//
//
//
//
//
//
//
//
//
//
//记住。
//
//
//
//
//
//
//
//
//
//
//
//
//记住。
//
//
//
//
//
//
//
//
//
//
//
//
//记住。
//
//
//
//
//
//
//
//
//
//
//
//
//还记得你以前是怎样的吗？
//那些你抛在背后的朋友呢？
//还记得当你平静地躺在湖畔上，
//那时太阳照在脸上而清风拂过头发?
//还记得你曾度过的美好岁月里，
//那些教室和那些被你无视的课程吗？
//还记得你在社团里的第一天么，
//那个这几年来为自己而建立的？
//还记得将其抛在背后是怎样的感觉？
//那些你走过门厅时从不会记住的脸？
//还想回到你生命中较为轻松的岁月，
//那些在背负起责任前的日子里去吗？
//还记得自由是怎样的一回事吗？
package lvls4x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl494{}