//Level 456
// 
//
//生存难度：
//等级 4G - 重力影响
//
//不安全
//不稳定
//重力改变Level456
//第一张Level 456的照片
//
//Level 456是后室的第457层。层级是一片重力效应奇异的冰川，有着高毒性的环境。
//
//描述
//Level 456 缺少昼夜循环，因此层级被永远笼罩于黑暗中。平均 -68 摄氏度的低温使任何无保护暴露皮肤者死亡。极冷的环境使暴风雪的形成并非偶然。
//
//Hailstorm
//于冰雹天气中摄制的 Level 456 照片
//
//偶尔狂风带来由高危物质构成的冰雹，而冰雹中的物质改变着它们周围的重力。更多的研究表明这种物质可能使某人无视该层级的重力效应，但这极其危险，因为冰雹中有液态甲烷的痕迹存在。当冰雹碰撞地面，其中的液体将四散喷出，导致湖泊的产生。
//
//重力的大小经常大量偏移，这使暴雪、冰雹以及冰块都具有造成伤亡的可能。在冰雹中，可以见到冰块离地飞行。
//
//层级中偶见的水域，构成物质与冰雹中含有的液体一致，
//
//偶然可以发现如废弃的辐射避难所一样的建筑。建筑由地上的废墟与地下的混凝土结构组成。在这些避难所中可以找到整个层级仅有的可食用物品。避难所在地下延伸数百英里，以幽暗的隧道互相连接。少有的“冻伤室”可能出现在锅炉房的深处。这些房间极冷，温度达到 -98.8 摄氏度，短短几分钟就可能致死。除此之外，冻伤室还含有来自未知来源的有毒气体。在与温度无关的情况下，这种气体在4分钟后导致疾病，并在9分钟内可以导致死亡。不鼓励久留于避难所，因为避难所可能会受到重力变化的影响，变得难以穿越。偶尔，可以在一个避难所中找到一个由废料和木材制成的格罗安德巢穴。
//
//避难所或连接至一个格罗安德的可能的祖辈生活地。这使我们相信层级古时曾有木材与其他资源，这些资源未被人类开发。未经证实的观点有，这些资源的消失可能与重力脉冲有关。
//
//当冒险者去往层级边境，水体的规模与实体的数量皆突增。边境的天空全部黑暗，没有天体存在。
//
//在层级的表层之下，有一种特殊的冰，被称为 基层冰 (别名 次表层冰)。它会导致任何踩踏者被真菌感染。层级的表层也是异常的冰，被称为 浅层冰 (别名 表层冰)。虽然它无毒，但还是由特殊的化学物质组成。
//
//基层冰成分	浅层冰成分
//液甲烷 (CH₄)	三氟化硼 (BF₃)
//一氧化碳 (CO)	二氧化碳 (CO₂)
//未知	未知
//重力异常
//层级的重力高度不稳定，可能迅速发生变化。在某个时间点处，重力可能会荒唐地变得或强或弱。重力方向也会发生偏移，特别是在避难所中，会使人主要部位受损伤。
//
//TheFluctusPulsar
//使用热成像仪拍摄的波动脉冲星的图像
//
//在科技帮助下，研究者们发现了层级中一种特殊的重力异常中心，被称为“波动脉冲星”。这种物体以重力改变互相交流。虽然它肉眼不可见，但在热成像中可见，呈现红橙色裂口状。它的移动没有规律，而且带来热浪。
//
//实体
//GROAND
//艺术家作品：格罗安德
//
//格罗安德存在于避难所中，经常以 6 个个体为一组。它们是蜥蜴一般的生物，以视力觅食，会食用任何可以食用的物体。它们有着密度较大的骨质，使它们能够适应层级的环境。它们的表皮很厚，可以一定程度上适应极冷环境。
//
//已知它们会在冰川中挖掘，这在它们的身体上留下无视重力的标记。还有，它们可以在体内储存重力正常化的液体，给它们增加应对重力改变的方法。
//
//一种独特的实体普罗因那类似于鸟类，约3.35米高。报告称它经常在湖泊周围盘旋。它会用钻头一样的爪于冰中挖出洞穴，并且抓取基层冰，将冰砸在无戒备的流浪者身上。从理论上讲，普罗因那是格罗安德的畸形杂交种，但经历了大幅灭绝，只剩下一个个体。
//
//入口与出口
//入口
//找到一个散布着霉菌物质的水体，并进入就可能来到这个层级。
//
//出口
//一些“冻伤室”可能包含一扇隐藏的门，可以进入这扇门，就将去往进入层级的地方。1
//
//[+] 作者信息
//« Level 455 | Level 456 | Level 457 »
//
//Footnotes
//1. 研究表明，层级有时间流动，但它会每4个小时就循环一次。
package lvls4x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl456{}