//Level 474
// 
//
//生存难度：
//等级 1?
//
//安全？
//不稳定
//缺乏实体？Level_474_Image_1.jpg
//一张洞穴入口的照片，拍摄于2014年底。
//
//Level 474是一个相对安全和无害的层级，目前没有已知的出口。它就像是一片被森林所围绕的空地，其中包含着一个巨大的洞穴。
//
//描述
//Level 474是一片被浓密的，看似无限的森林所围绕的空地。在空地之中，可以找到一个洞穴的入口。该层级的积雪永不融化，日夜交换的规律与前厅类似，白天持续9个小时，黑夜持续15个小时。
//
//Level 474有三个主要的特征。空地、森林和洞穴。
//
//空地
//这是一片面积较小，且较为平坦的林中空地。它的长度大约只有0.2千米。生长着小型的灌木和苔藓。不存在任何的实体。
//
//在差不多是空地中心的地方有着一个大公告板（如图所示）。有一张海报被图钉定在了公告板上。海报上用白色的巨大的英文字母写着“欢迎来到474号国家公园”。除此之外，公告板上还贴着一张包含着空地和周围森林的地图。这张地图后来被发现与该层级的真实尺寸不符。
//
//在公告牌上，还有一张写着WiFi的名字和密码的白纸。网络的名称是“NP474”，而密码是“CaveDivingRules!!2”。这个WIFI的网速很慢，且只能在空地上使用，但通过它可以与层级之外的人进行交流。
//
//森林
//据推测，空地周围的森林是无限的。树木的种类和总体布局与前厅中美国俄勒冈州的部分树木的情况一致。它也包含有灌木、岩石和苔藓。森林里的大多数灌木所生长的浆果类似于在前厅中的蓝莓和木莓。该地区的苔藓似乎是这个层级的原生物种，因为在其他的地方没有发现这种苔藓。该地区的地形一般平坦而光滑，地面被积雪覆盖。由于它的面积巨大，目前它尚未被勘探完全1。截至撰写文章的时候，在森林里尚未发现任何的实体。
//
//洞穴
//洞穴是位于空地之下的大片空间。洞口位于空地的中心附近（如图所示）。它由一块类似大理石的材料制成，在距离洞口几英里的地方还有一丝光线，再往里的地方是一片漆黑的。
//
//在一块石头的后面有着一盏破碎的煤气灯。不知道是谁或什么生物把它留在了那里，也不知道他们发生了什么。
//
//由于某些原因，我们尚不知道洞穴里有些什么，后文将会对此进行解释。
//
//基地、前哨和社区
//曙光Alpha基地
//基地人口：2（Jack Lowell和Eleanor Hutchinson）
//该基地并不隶属于M.E.G，然而，该基地的人员会与M.E.G进行合作，以确保他们能够生存下来，并继续探索这个相对未知的层级。
//该基地是一个小型的临时木屋，由死去的树木、碎木头以及泥土制成。在基地的后面有一片种植着浆果和土豆的小型农场，围绕着由树皮制成的临时篱笆。
//位于空地的最北边。
//发现
//2014年初，一个六人小队从Level 11切入到了这个层级。小队切出的地点位于M.E.G的Beta基地北边的4公里处。目前还不知道他们是如何触发切出的，想要重现切出的尝试都失败了，但小队成员Jack Lowell说：“就像是掉进了地下”。小队的成员有Sean Burgess、Nathan Cobb、Rachel Everette、Mark Snyder、Eleanor Hutchinson以及Jack Lowell。他们一起切出到了空地的北边。他们立即开始了对空地的探索、收集信息、建立与M.E.G的联系以及建立曙光Alpha基地。然而，在六个月后，他们仍然没有找到Level 474的出口。
//
//2014年底，Sean Burgess、Nathan Cobb、Rachel Everette以及Mark Snyder决定对洞穴进行一次探险活动。此次活动被称为曙光探险1A，其目的是了解更多关于此层级的信息，以及在洞穴中寻找离开层级的方法。而这两个目的会分别通过三次旅行来达成。任务一由团队分头行动来探索洞穴，任务二由整个团队来一起在洞穴中找到一个出口。探险1A将会持续六个小时，Eleanor Hutchinson和Jack Lowell会在地面上的一个临时的控制中心来与队员进行通信。每十分钟，他们会在通讯中报告一次，以确认进展是否顺利。在第一个小时里，1A探险队继续在洞穴系统中越来越深入。Nathan Cobb进行了观察并向地面上的中心发送道：“这就像是个普通的洞穴，兄弟们”。
//
//当第九次试图与1A探险队沟通时，他们没有得到任何答复。
//
//在探险进行了一个半小时后，Eleanor和Jack与探险队失去了联系。他们在接下来的三个小时中尝试向探险队发送信号，但始终没有得到回应。他们决定回到曙光Alpha基地，并继续监控那里发出的信号。他们在那之后再也没有收到来自洞穴里的信号了。
//
//入口与出口
//入口
//只有一个关于入口的报告，是在2014年初在Level 11出现的。
//
//出口
//截至撰写本文时，Level 474的出口仍是未知的。
//
//关闭消息
//发件人：eleanor_cupcake@backmail.net
//收件人：Hannah_Marsh23@meg.com
//主题： 重要！！！
//
//嘿，Hannah，我就直奔主题了。在今天早上的9点开始，我们就一直都在收到似乎来自我们（基地）下方几英里所发出的持续的信号。我们不知道是谁在发出信号，也不知道这个信号是怎么传播上来的，但Jack觉得它是摩斯电码。他正在记录那个信号，我们会尽快地把它和更新上传给你。
//
//发送于2021年12月14日上午9：14
//
//发件人：Hannah_Marsh23@meg.com
//收件人：eleanor_cupcake@backmail.com
//主题：回复：重要！！！
//
//Eleanor，我收到了你的信息，请尽快回复我们，等待进一步的指示。
//
//发送于2021年12月14日上午9：17
//
//发件人：eleanor_cupcake@backmail.com
//收件人：Hannah_Marsh23@meg.com
//主题：回复：重要！！！
//
//我们得到了完整的信息，我们应该怎么做？
//
//
//
//发送于2021年12月14日上午9：25
//
//发件人：Hannah_Marsh23@meg.com
//收件人：eleanor_cupcake@backmail.com
//主题：回复：重要！！！
//
//我们刚刚破译了它，你们需要离开那里，就现在。拿走你的笔记本电脑，然后赶紧跑。我们会持续跟你更新情况的。
//
//发送于2021年12月14日上午9：26
//
//发件人：Hannah_Marsh23@meg.com
//收件人：eleanor_cupcake@backmail.com
//主题：回复：重要！！！
//
//Eleanor，你还在吗？
//发送于2021年12月14日上午9：27
//
//发件人：Hannah_Marsh23@meg.com
//收件人：eleanor_cupcake@backmail.com
//主题：回复：重要！！！
//
//ELEANOR ，你还在吗，ELEANOR
//
//发送于2021年12月14日上午9：27
//
//[+] 作者
//« Level 473 | Level 474 | Level 475 »
//
//Footnotes
//1. 人们已经以空地的中心向森林的各个方向探索了10公里。
package lvls4x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl474{}