//Level 463
//⚠️ 内容/要素警告 ⚠️
//
//以下文章/层级包含了会引起一些读者不适的内容。如果您不能接受肉体恐怖或对疾病的明确描述，请移步至下一层级。
//
// 
//
//生存难度：
// 
// 
//实体横行land
//Level 463内的典型景观。
//
//Level 463是后室的第464层。
//
//描述：
//Level 463，亦称“砼墟1”是一片目前尚未探明具体大小的干旱户外区域。砼墟与前厅的自然干旱区域别无二致，有类似沙漠，苔原的地域，不同点则是该层级除了被阳光晒至褪色开裂乃至风化的混凝土外没有发现别的矿物质， 这些混凝土构成了如山丘，峭壁等自然景观。砼墟上的重力较为特别且轻微，约等于地球重力的40%，与火星表面的重力相近。
//
//砼墟内不存在昼夜循环。太阳终日处在水平视线仰角50度处。而有时混凝土粉尘会遮盖住天空，使本层级大气的蓝色背景变得昏暗沉闷。此层级的气温会一直保持在67°F（19°C）左右。
//
//在Level 463内除了风天外不存在其他任何天气。在砼墟内没有任何降水天气的报告，而层级内阵风的强度则会发生变化，有时能卷扬起混凝土粉尘构成的尘云，效应类似于沙尘暴。然而由于层级的低重力属性，这些扬尘暴有可能对建筑和流浪者造成伤害。
//
//尽管此层级存在强烈的辐射，在砼墟内电子设备仍是可用的，但Wi-Fi和蜂巢网络信号并不存在于此层级内。建议在穿越 Level 463的旅程中使用短距交流技术，最好使用无线电，因为无线电的可靠性最强，能与 实体463-B的无线电进行兼容交流。指南针同样能正常工作，然而该层级出口分布的随机性和对此层级先导知识的缺失只会让指南针毫无用武之地。
//
//在砼墟内无法找到任何饮品，食物或补给。虽然此层级内能找到零零散散分布于层级内的人造结构，但没有一个结构内包含对流浪者有用的物品。补给的匮乏，敌意实体的存在与环境内危险的辐射都让Level 463变得对于有机生命来说无法生存。
//
//由于Level 463拥有极不宜居的性质，目前仅证实并探明层级内一块可行进的，以一座无线电塔为中心，半径为400英里的区域。
//
//结构
//structure2
//一个砼墟内独特建筑。
//
//一定量的孤立建筑结构在砼墟的荒原上星罗棋布。这些结构主要由住房组成，但也包含窝棚， 简易小屋和其他无墙的遮蔽物等结构，有时还能在这些建筑的附近发现围墙存在过的痕迹。大多数建筑结构之间都各自间隔数英里，且大部分都分布在此层级低海拔地区，尤其是山丘间的平坦谷地。值得注意的是这些在Level 463内能看到的结构与前厅沙漠地带牧场的建筑相似度极高。
//
//在砼墟内发现的建筑皆已废弃，破败不堪。有许多建筑都已倒塌并缺失墙体，随着时间推移它们都已被风尘侵蚀破坏。建筑内部的状态基本一致，大多积满了混凝土尘埃。除了有时能撞见些家具碎片外，建筑内部找不到任何可用补给，而实体463-A的个体则周期性地出没于这些建筑内。
//
//尽管Level 463的环境仅由单调的混凝土构成，层级内的建筑仍是由相对于本层级独特的材料建成的，包括但不限于金属，木材，砖块和其他矿物质。这些材料来源不明，但这些建材严重的风化程度说明了在很久以前Level 463的居民有能力获取到这些建材。
//
//砼墟内的建筑也兼具出口和入口的功能。任意个人及团体进入Level 463的入口建筑是从层级内所有建筑中随机选取的。层级的出口似乎是随机的，意味着出口所在的建筑通常与入口建筑差之千里。在没有获得只能通过无线电交流的实体463-B帮助的情况下，抢在未被辐射病或敌意实体杀死前通过导航工具找到层级出口几乎是不可能的。
//
//无线电塔
//medium.jpg
//无线电塔位于砼墟的中心。
//
//砼墟内最为独特的建筑是一座大致坐落于层级中心的广播站。此广播站设备齐全，配备有金属塔和混凝土质广播室。与Level 463内的其他建筑类似，该建筑与金属塔都遭受了混凝土尘埃侵蚀，但好在它们在山顶的特殊位置让它们能免受与低海拔地区建筑同样程度的损伤。
//
//广播室内有固定在金属桌面上的小型话筒，而金属桌则被栓接在地板上。电线由基座延伸至墙体，并随后离开广播室与外部的无线电塔相连接，由一个在无线电塔底部的发电机供电。无线电塔与发电机则都被围栏紧密包围，无法进入。
//
//在广播室内能找到不少在混凝土墙面上的蚀刻字迹。其中有一句字体极大而延伸了整个墙面的短句：“在此寻呼以得到阿尔玛的接应”。还有一串数字“1160”，即本广播站所处的频段，而它就被刻在这句话之下：“<— 按下”。这句话被刻在话筒固定处后的墙上，旁边还有箭头直接指向话筒基座的开关。
//
//开启设备将会使室外的发电机开始运作。广播发送出的任何信息都会将实体463-B召集至广播站，他们会将流浪者引导至Level 463的出口。但与此同时足够靠近发电机的实体463-A个体也会听到它的噪音并被吸引至无线电塔处。最明智的做法是关闭广播室的门并藏匿其中等待实体463-B到来。尽管使用该广播站极易招致实体463-A袭击，该无线电塔仍是砼墟内对于流浪者生存最重要的建筑。没能成功使用此广播站的流浪者最终都因无法找到层级的随机出口最终死于辐射症或敌意实体攻击。
//
//辐射
//Level 463全层级被一种至今未知的辐射所污染。该辐射具有极强灭菌作用，能在几小时内杀死暴露在外的微生物。这直接导致了Level 463内的生物遗体无法降解。多细胞生物尤其是拥有血肉的个体也会随时间推移受到辐射愈加严重的影响。暴露在Level 463辐射的存活生物会经受一系列急剧的生理变异，此层级的辐射杀伤力远远超过了前厅所存在的微粒辐射。这就是为什么此层级要加上死区的标志。该影响，又称“砼败症2”，在人类及非人实体身上都能被观察到。 在后室其余层级的实体会主动逃离Level 463的入口，疑似是因为此层级的辐射能影响所有类型的生物。
//
//在人类身上观察到的砼败症表现如下：
//
//停留在Level 463的时间	砼败症
//0 - 1 小时	没有值得注意的症状。
//1 - 24 小时	人体开始感觉不适。症状包括但不限于恶心，呕吐，视线模糊，头昏，关节与皮肤有刺痛感，肌肉酸痛。症状会随逗留时间增加而逐渐变得严重。
//24 - 72 小时	在Level 463内停留满24小时，症状的严重程度会骤然降低。逗留满三天后症状则会完全消失。
//3 天 - 1 周	不会再经历任何症状。一星期是一般人类能在Level 463内安全逗留的最长时间，在此期间人体不会受到辐射病的永久性损害。
//1 - 2 周	社交能力开始退化。患者甚至会拒绝食用和被喂食植物制成的食物。即使能被规律性地喂食，个体仍会对感到饥饿表示抱怨。而语言智能则会在第二周末尾丧失
//2 - 3 周	无论摄入多少食物，饥饿感都会开始变得难以忍受。患者会拒绝食用除肉以外的一切食物。包括但不限于翻译传达，使用肢体语言的更多社交能力将会丧失。在此节点，该患者会因认知能力丢失变得愈加狂躁，恐慌，而取代认知能力的则是渐增的攻击性。同时患者的皮肤与瞳孔会因肝衰竭而开始变黄。
//3 - 4 周	该患者进行与具有智能的人类个体的交流是几乎不可能的。患者会完全失去社交欲望。生理结构的变异也在这一时段开始，具体表现包括但不限于肢体增生，毛发掉落，生疖, 这些疖子将会成为新的眼睛长出的地方，同时患者原眼部的巩膜内血管破裂，皮肤渐呈绿色粗糙样，现存的肢体发生退化，而消化系统则会发生扩张并为更大的嘴部及新长出的牙齿腾出空间。
//4 - 5 周	身体变异的过程仍在继续。个体唯一尚存的想法就是觅食充饥。
//5周以上	个体从辨识度上看已完全变异，并从此被视作实体463-A个体。
//使用杏仁水抵抗Level 463内出现的辐射测试都失败了。不管是用杏仁水擦拭身体还是直接饮用都无法消除上述辐射症状。
//
//对Level 463内辐射定性的研究仍在进行。目前被广泛接受的假说是某次大灾变毁灭了层级内所有的原住民和其他动植物，因为该理论成功解释了为何此层级内会存在大量破败的包括木质的非混凝土质的人造建筑，表明了在这些建筑开始风化前砼墟内曾存在木料等建材。
//
//在砼败症的心理症状出现后离开Level 463并不能阻止砼败症病情的发展。而在 Level 463内逗留一周后有机体受到的辐照损伤将被视为是不可逆转的，即使此有机体已离开此层级，其转化为实体463-A个体的进程仍在继续。
//
//尽管砼墟内有严重的辐射威胁，M.E.G.研究员仍发现只要流浪者能在一周内离开Level 463，辐射就不会对人体造成永久性伤害，并且从辐射伤害中完全恢复是可能的，理论上允许了在砼墟内停留少于一周的人员安全返回。然而，敌意实体的出现阻断了对此层级的进一步系统性考察，而在层级内停留超过一周的考察人员都拒绝返程，因此砼墟的大部分地区仍未探明。
//
//基地，前哨和社区：
//鉴于Level 463的非宜居性，这里没有已知的基地，前哨和社区。
//
//实体：
//463-A
//463-B
//463-C
//medium.jpg
//实体463-A个体的照片。
//
//掠食性变异体
//描述
//变异体是砼墟内富有敌意且拥有自主意识的独特实体，它们原先是有机生命体，在经历Level 463内辐射变异过程后成为了此类实体。严格来说，实体463-A个体是生存至砼败症最终阶段并完全转化为非人生物的砼败症受害者。
//
//它们的外观因个体而异，但普遍拥有黄绿相间的粗糙皮肤，有一行血红色的眼睛，拥有铲状牙齿的扩张嘴部和数目惊人的不对称的肢体。实体463-A的躯干也因个体不同而大小各异，许多此类实体还生有扭曲翻转的刺状物，导致其拥有与蛇或蛞蝓相似的外观。一般变异体的身长都大致介于3至12英尺。更大型的变异体，又称“暴食变异体”，则更为稀有，相比之下中等体型的变异体身长在7英尺左右。
//
//变异体所具有的力量由其体型决定，一个身长3英尺的变异体拥有与中等大小犬类相近的力量，6英尺大小的变异体则有超越常人的力量，身长12英尺的变异体则能不费吹灰之力地击垮砖墙。尽管变异体拥有更大的嘴部，它们的咬合力并没有明显提升，但它们的牙齿还是轻松撕碎它们嘴里猎物的鲜肉。
//
//鉴于变异体拥有千变万化的身体构造，不同个体的大脑和重要器官总是分布在各异的地方，要想找到弱点杀死它们是极其困难的，同时它们极多的肢体数也让流浪者不易瘫痪它们的行动能力。钝器能短暂击退变异体，但是由于变异体拥有极短的自愈周期，想要完全击溃变异体是不可能的。
//
//M.E.G.研究员设法从Level 463内取得了变异体的一小段肢体用于研究。在对该肢体的肉质部分进行化验时研究人员发现这些特别的肌肉组织具有与植物类似的光合作用能力。 而Level 463内的辐射是如何诱使有机生命体变异出光合能力的具体过程仍在研究中，但它们拥有光合能力这一事实则解释了它们为何甚至能在没有食物的情况下仍可在此层级内游荡和行动。
//
//行为
//实体463-A个体对其他存活有机生命体抱有极大敌意，它们一旦发现潜在食物便会立马展开追击。这些实体会永无休止地狩猎，单纯地想要获取食物。由此性质可知变异体可以被鲜肉短暂地分散注意力，其他食物则没有这种效果。此外变异体之间还会互相争食，但从未发现由变异体因争食而被同类杀死的实例。
//
//由于变异体的肢体形状大小各异，造成其身体构造失衡且无支撑，变异体通常行动迟缓。空闲游荡时的变异体个体会以漫步蹒跚的步履进行极其缓慢的移动，有时候还掺由爬行的动作，但它从未被观察到有休眠时段。当变异体察觉到存活人类或其他实体时它会提高移动速度以追击它们的猎物，而据口述可知某些变异体拥有近距离冲刺与扑杀的能力。每个实体463-A都是独特的，有些行动迟缓，而另一些则生长出了极度危险的强壮肢体。进一步说，尽管大多数变异体因其不对称协调的肢体而行动缓慢，夺路而逃的流浪者仍经常会因Level 463内的低重力被绊脚摔倒，让他们面对接踵而至的实体潮时束手无策。
//
//人类所有的感觉变异体都同样拥有：视觉，嗅觉，听觉，味觉与触觉。尽管我们尚未得知变异体的感官灵敏度，但经观察已发现它们的嗅觉是最差的，而听觉最为出色。变异体经常能被噪声吸引，每当一个变异体找到了流浪者，附近其余的变异体也会察觉到流浪者，形成危险的瓮中捉鳖之态。变异体的动态视力似乎优于其静态视力，因此在其视野内的安全距离保持静止不动可以避免被其察觉。
//
//对Level 463及其中实体的研究遭到了其极度不宜居性质的限制，但我们仍观察到实体463-A可以将缺失的肢体再生，并在进食后缓慢长出全新的附肢。除了仅随年龄增长而变大外，理论上变异体还可以通过进食增大体型，长成所谓的“暴食变异体”个体。不考虑上述因素时，Level 463内逐食而动的变异体表现出了一种与生俱来想变得更为健壮的嗜欲，这似乎是它们竞争资源的一种行为方式。
//
//阿尔玛
//描述
//实体463-B，又称“阿尔玛”是居住于砼墟内的独特类人实体 。阿尔玛约有6英尺高，有黑色头发，在皮肤特定位置似乎覆盖有几丁质。他们手部与人类相仿，每只手都有五根手指，手臂结构也与人类相像。他们的腿部则与鹿相似，而蹄部则是单趾爪结构。尽管他们只能点地而行，但对于阿尔玛来说保持平衡并不困难。由于在他们脚上的爪子能在奔跑时掘入混凝土中推动他们向前并在低重力下翻越崎岖的地形，他们独特的下肢让他们能够在Level 463内快速穿行。
//
//阿尔玛身着一件覆盖了他们手臂与上躯干的风衣，一条遮着颈部的黑色围巾与掩盖他们后侧的前敞衬衣。同时他们的手上佩有白色手套，被猜想是用于提升几丁质外壳的抓握力，目前亦存有他们佩戴手套是为了防止吓到流浪者的说法。阿尔玛的面部戴有一穿有一大一小两孔的白色面具：小个的孔对于露出他们的右眼来说还是太小了使此部位呈黑色。大个的孔则露出了阿尔玛的白色圆形左眼，似乎没有眼睑。在他们眼睛旁的黑色头甲可以通过他们的面具窥视到，这让他们的眼睛与浣熊一样都只易看见黑色的一圈，目前尚没有人能见到阿尔玛的庐山真面目。
//
//行为
//阿尔玛是一种能将流浪者从砼墟内带离的友善实体。他们对自己居住的层级无所不闻，就算层级的出口对于不同个人及团体来说是随机的，他们仍有百分百的把握能将遇到的流浪者带离此层级阿尔玛具有一定的行动准则，包括：与流浪者保持最低程度上的交流，并拒绝帮助在Level 463内已逗留超过一周的流浪者。当阿尔玛没有明确的行进方向时，他们会在砼墟内巡游。他们在没有带领流浪者时的具体行为目前仍属未知
//
//阿尔玛似乎能听懂口语，也能理解一般的人类肢体语言。他们不会以常规方式回应流浪者的问题，也不会刻意与流浪者谈起此层级，但流浪者仍可以与其建立和特定话题有关的个人非口头交流，话题包括与实体463-A遭遇的事件。我们目前从未观测到阿尔玛亲身与人类进行过任何口头交流。阿尔玛因此被视为一个神秘莫测且目的与起源未知的类人物种。
//
//阿尔玛一直都携带着一个手提式无线电接收器，该接收器已被调制至1160千赫兹：也就是砼墟内无线电塔所发送电波的频率。阿尔玛也会随身携带肉干，他们将这些肉干用于诱捕变异体或使实体463-A分心。肉的来源依然不明。
//
//在听到来自无线电塔的广播或个人无线电设备的讯息后，阿尔玛会马上赶往无线电塔或向此人发出讯息的位置来接应他们。阿尔玛似乎会无视广播的内容及性质而赶到无线电塔，M.E.G.的实验则显示他们甚至会在听到全是杂音的广播后仍火急火燎地赶来。由于他们与无线电塔有紧密联系，他们被给予了基于广播站内一句话：“在此寻呼以得到阿尔玛的接应”所想到的昵称。他们既不承认阿尔玛是他们的真名，也不否认这一名字。
//尽管他们本体是无声的，阿尔玛的声音仍可通过满足对应要求的无线电从调制至1160千赫兹频段的广播频道听见。来自阿尔玛的讯息一开始是以一种无法辨明的方式加密的，与密码站所发出的广播类似。然而M.E.G.发送出一套特别的加密方式时，阿尔玛开始使用了新的密钥，并从此开始与M.E.G.合作，协助我们在Level 463进行的勘探活动。
//
//如上文所述，如果一个人在Level 463内逗留超过一周，阿尔玛会拒绝帮助他们，阿尔玛看来对层级内辐射的影响效果烂熟于心，还能明白这些影响在一定时间后是不可逆的。如果他们正在引导一个团体，阿尔玛会允许所有成员随他们走到出口，但会阻止在层级内逗留超过一周的任何人进入出口。如果有必要，他们会使用携带的肉干将患者引诱滞留在层级内。阿尔玛为何将此视作铁律之因不得而知，但大多数人相信他们是不想让实体463-A个体在后室的其他地方流窜。
//
//因为阿尔玛在Level 463内的特殊存在，没人知道为何唯独他们不会受辐射的影响。然而因为阿尔玛有更偏向于使用数字加密广播进行语言交流的不寻常倾向，也有人认为阿尔玛其实也在某种程度上受到了辐射的影响；这种辐射使阿尔玛无法说出完整的句子，他们只能说出单个数字。尽管他们的有声交流能力受到限制，阿尔玛仍可以理解并传译他人所说的完整句子。阿尔玛可能存在选择性沉默的行为。
//以下内容是一位M.E.G.特工从实体-B个体记录中获得并复原后的音频记录抄本。这些记录被认定为是于2017年6月28日被送至砼墟内记录其性质的一位探险队员布雷斯顿·坎特雷尔所做的记录，布雷斯顿·坎特雷尔在执行任务的过程中下落不明。
//
//TAA3：00:00:01
//妈的终于捣鼓好了， 我已经从无线电塔处行进了很长一段距离了，我想没人比我走得更远。这里是……啊操蛋，这个地点已经在地图被标示过了。这里应该曾经是某个人的逃生出口，这情况算是好转了一点！出发点现设定在方位格351W 112S处。
//我已和阿尔玛取得联系，我将一路向西。此刻，我离那边的山只有咫尺。我想目前还没有其他人看到过山上有些什么。
//
//TAA：00:13:25
//这该死没妈的辐射。它就是我最讨厌的玩意儿。奥古斯特斯你就是根该死的搅屎棍，就是你一直要求大伙做记录自己的症状这种屁事，好了，我现在又在吐了，呕。现在没有新症状出现，呕吐量无异常，听到没奥古斯特你个小王八羔子！
//
//TAA：00:19:47
//扬尘暴正席卷而来，这次护目镜和防尘面罩可算帮了大忙。在那个大泥池里收了一堆护目镜的兄弟我可爱死你了，真想抱抱你，尽管我的手上仍然沾满了混凝土粉。
//
//TAA：02:21:16
//开始攀登山丘。当前位置方位格379W 110S。等下，是112S吧？我是记不清了。指针正指向西边，反正我是从南边来的，不管它了。
//
//不管怎样，目前没有发现任何异常，但我感觉我越往前走变异体就越少了。 我想它们是不是学聪明了都在无线电塔旁蹲守，因为那里最常有人停留。
//
//TAA：03:01:08
//低重力让这些扬尘暴转化为了一场微风。如果这里没有引人作呕的辐射毒害，会吃人的绿色蚕豆的话应该会是个值得一去的热门景点。
//
//TAA：03:02:53
//和阿尔玛沟通后我确认了可以在返程前再向前行进两天。我已抵达山丘顶部，但这里出现了些看起来令人不安的东西。我想那只是一簇远近高低各不同的小山丘，但其中一座看起来像在移动。我难以凭仅仅一瞥解释他具体是什么，但我担保它确在移动。这玩意正在上下起伏，我会继续前进调查。
//
//TAA：03:19:22
//位置是方位格381W 110S，这里肯定有什么大家伙在蠢蠢欲动，那到底会是啥玩意呢？
//
//TAA：04:02:58
//我的个老天啊，那是什么鬼？
//
//TAA：04:03:30
//这家伙有座山那么大，大到它随便踢上一脚旁边的扬尘都会让我看不清它后面乃至周边有什么东西，但我敢保证它后面还有更多同类。我会尝试逼近它来回复更详细的报告。
//
//TAA：04:06:01
//我现离它只有咫尺之遥，我从山丘的另一侧下来了，完全看不到我原来走过的那个小山谷了。
//
//我不想再多看这魔鬼一眼了。这之前我认为自己并没有巨物恐惧症，但是现在……老天，我要骇破胆了。
//
//TAA：04:07:35
//我想我不能再更靠近这坨庞然大物了。我在此奉劝诸君一句：千万别像我一样去接近它。
//
//我所能用来最精确地描述它的词是……像只史前巨虾。它的背部又长又平。它有的不是一打手臂而是成百上千的手臂。它真的是像只虾在吃海草一样，每只手都伸抵地面，然后抓起块混凝土再拿起来塞进某个地方。我也搞不明白那是什么，它的附肢太多了以致于我根本观察不到到那些被它抓起来的混凝土块的最后命运。妈呀，它肢体真是多得数不过来，而肢体上又有数不胜数的关节。
//
//这东西砸毁了整个地面。我也再也没法知道这块地上曾经有什么东西了。
//
//TAA：04:07:48
//哦天啊。
//
//TAA：04:07:51
//阿尔玛听到了。阿尔玛听见我了。方位在……妈的，是方位格390W 110S。
//
//TAA：04:07:55
//这真是个操蛋玩意。 我得溜了。
//
//TAA：04:07:57
//阿尔玛——
//
//在复原音频记录后，M.E.G.无法通过勘探或询问实体463-B来证实布雷斯顿所描述实体的存在性。鉴于他描述实体463-C的措辞和他探索过程中表现出的极度恐慌，实体463-C 被正式命名为坎特雷尔肉山，简称坎特雷尔。
//入口与出口：
//入口
//Level 463的入口外形为没有门板的混凝土门框，这些门框可以在任意拥有如维修管道，工厂，燃料库等工业区域设施的层级内找到，而走进这些门框将会把流浪者送至Level 463内随机一个建筑的外部。
//
//出口
//试图通过作为原入口的建筑及门框回到个人或团体原来所处的层级是不可能的。任何进入Level 463的个人或团体必须要找到含有另一个同样特定特征的门框的建筑才能逃离。而出口则通向另一个拥有满足入口要求门框的随机层级（例如一个有着工业园外观的层级），这个层级是原入口层级的可能性很低。
//
//由于受到层级内一周安全时间的约束和敌意实体袭击的威胁，我们建议流浪者首先应找到坐落于Level 463中心山丘上的无线电塔，因为实体463-B可以从这里被召集并将流浪者引导至层级出口。
//
//作者信息
//« Level 462 | Level 463 | Level 464 »
//
//Footnotes
//1. 译注：砼（tóng）为混凝土的别称，为保持译名简洁采用此名称，“砼墟”原文为“The Concrete Waste”。
//2. 译注：为保持表格格式和译名简洁，同上从“砼”代称混凝土。
//3. TAA：抵达后时间。
package lvls4x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl463{}