//Level 423
// 
//
//生存难度：
// 
// 
// 
//Dark
//Level 423 入口处的一张照片。
//
//Light
//另一张 Level 423 的照片，于亮灯时拍摄。
//
//Level 423 是后室的第424层，在2020年11月18日被发现。该层级表现为一巨大加油站。
//
//描述：
//Level 423 外形类似一大型加油站。在加油站便利店内架子上的物品均为幻象，若流浪者尝试碰触它们，它们会消失。由于该层级难以进入，该层级的已知信息并不多。此层级内存在大量实体，在流浪者每一次进入时均会随机出现。这一层占地较小，但不应过于低估其占地，其占地约为 100,000 平方千米。便利店占地通常只有一平方千米，但若流浪者进入标有“员工专用”的区域，其将到达另一加油站，与前一加油站占地相同，但建筑结构不同。冰箱内存有杏仁水，但由于被 -20°C 的水冻住瓶口，这些瓶子往往难以打开。便利店的收银区域内存在友善实体，不被攻击时不表现出敌意。流浪者可以询问它们一些问题，它们通常会进行回答。但若流浪者提到任何关于“后室”的问题，它们将回应：“那是啥？”。从层级的窗户内应能看到外面，但目前只能观测到一片虚空。便利店内的各种区域似乎为随机出现，大部分情况下区域的名字与其实际放置的商品并不匹配，反而为无法理解且与加油站无关的语言。
//
//Juicy
//Level 423 的一张照片，展示了一些商品。
//
//流浪者有极小概率找到通向储藏室的一部楼梯。储藏室占地庞大，内有许多空箱子。此处有大量实体，所以推荐流浪者尽量避免进入这一区域。储藏室的更深处能发现一部标有“1.5”的电梯，建议流浪者不惜一切代价避免进入这部电梯。
//
//基地，前哨与社区：
//孩子们
//大约有五名孩童一直呆在这里，他们使用衣服和床单搭建了一座堡垒。
//若流浪者注视孩童，孩童将会奇怪地转化为实体。
//其转化的实体类似 Level 2 中所见到的实体。
//可以听见他们使用不可辨认的语言互相交流的声音。
//附加内容：
//该层级有一篇探索日志。
//
//探索日志
//我没有听从 M.E.G. 的指示，然后就来到了这里。我从 Level 300 里一扇门到这的。我是用他们的一把钥匙开的门，他们知道了可能得杀了我。我后悔来这儿了。这层级可能连个出口都没有，而且我还拿着这层级唯一的一把进门钥匙进来了。我该怎么出去啊？这层级就是个巨大加油站，而且我看见了真正的能与我交流的其他人！我终于在这有人聊天了，我觉得我还能保持理智。但还是得有人帮帮我。我还是不知道怎么出去，我觉得可能有其他人用另一种方法进来过。如果你知道怎么进来怎么出去，能不能帮我找个出口？我只希望我不死在这里。
//
//入口与出口：
//入口
//唯一已知进入此层级的方法为在 Level 300 中用钥匙打开并进入一扇上锁的门。注意：门钥匙的标号应为“423”。
//
//出口
//并无记录表明该层级内存在出口，但大概率可以从进入此层级时身处的地方离开。
package lvls4x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl423{}