//Level 448
//灯光闪耀，于她的瞳中。急切地，她想把灯光关掉，以隐藏身形。
//
//但她明知，这可能是她最后一次看见，她生命中最后一次，灯光投射入她眼里。所以她只能面对光明。
//
//是酒精湿巾擦在肘弯的湿凉感。连在注射毒药之前，他也还是保证她不会被感染。太周到了。如果躺在那里的不是她，那对她来说肯定很滑稽。
//
//远远的声音问着她，问她的遗言。不过，谁会听？谁会管？
//
//“我准备好了，狱长。”她只说了这似真似假的言语。
//
//他沉默地拿起针头。
//
//只是一个轻轻的针刺入她的手臂。比她预想的要轻。完了？这样吗？这样想着，她感到化学物质在渗入她的体内。慢慢地，她昏迷了，悔恨的感受也淡出了。全都结束了。痛苦，思想，记忆。全都结束了。
//
//即使还有第二针为她而准备，她也已经去了。
//
//她走进光。影子在她的眼睛中翻闪，就如一个舞者在她周围舞动。她似乎在做梦。
//
//一声枪响将她听不到的交响乐引向高潮，只是她在寒冷黑暗的地板上醒来，而她的手臂仍然因两小时前那次注射而疼痛。
//
//“有……有人吗？”没人应答。
//
//她是否活着？是否她已堕地狱？
//
//在冰冷的石墙上，她感觉到有什么未知的东西。
//
//火焰突然燃起，她终于看见。
//
//一个新的狱间；新的铁窗。
//
//她的囚禁没有结束。
//.
//
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//ie2rgs6UQtFRuEH.jpg
//牢中走廊
//
//描述
//Level 448仅由一座广阔的岛屿，以及岛屿上一座石质监狱所组成；监狱从外观上看，很似19世纪中期至20世纪中期的建筑风格。除此之外的岛屿周围，为枯草所盖，铺展到岸。本层级内天空永远呈现深青，天中有星月，月与从地球上观测的相似。
//
//岛屿周围是清澈的浅海。海底是棕色的泥质，深度只有海平面下几米。海水有一种怪异的性质：离岛屿越远，水位越低，所以层级的最远已知地点只是一大块潮湿的泥质平原，直延伸至地平线。
//
//监狱内部结构远空阔于外墙。石质的厅廊排布着各种空的监狱单间。墙面上的火把与油灯，常常无端地亮灭；影子常投于空房之角落；有些报告中描述了墙流出的血迹。层级内没有已知的实体，但流浪者经常报告墙内爆炸似的不规律的发声。
//
//基地、前哨和社区：
//由于资源缺乏，没有已知基地、前哨和社区。
//
//入口与出口：
//入口：
//泳于Level 97的海洋，会使流浪者漂流到此层级的岸边。
//于Level 39的几条道路通往此层级的外部平原。
//出口：
//泥质平原中的洞穴通往Level 377.
//监狱中的一些门通往Level 155.
//一个影子走过她的牢房。她呼喊着，但影子没有注意。她敲打着铁窗，大喊，希望他们能释放她，但影子只是走着。她沮丧地把头撞在石墙上。血开始涌出。她对墙壁眨了眨眼，但她知道自己不会死。她以前试过，层级不会让她死。她觉得那影子回来了，但是影子只是看见了地板上聚集的血。
package lvls4x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl448{}