//枢纽
//枢纽是后室中的一个隐秘层级，也是很多流浪者安全的通行/定居之所。枢纽似乎是一个隧道，其两侧分布有上锁的、以及未上锁的门。
//
//描述
//枢纽表现为一条无限延伸的昏暗地下隧道，似乎没有尽头。隧道内的地面为干涩的沥青材质，通过三条黄线划分为四条车道。其墙壁则是巨大的混凝土板，每两块之间都存在缝隙。墙上还配备有成排的亮黄色工业照明灯，使枢纽呈现出了橙黄的色调。枢纽通常会扭曲上下左右的空间，导致部分区域的布局不够稳定。然而由于其内部为线性路径，穿越枢纽依旧非常轻松。
//
//枢纽内似乎完全不存在声响，使得整个层级使人感到尤为空旷。在大部分区域，枢纽的两侧都存在巨大的混凝土门成对排列，每一扇门上皆刻有一个奇怪的符号。这些符号均无法辨认，形状类似于麦田怪圈。除此之外，门上既无编号、也无其他标记，且门排列的顺序也与M.E.G.数据库中层级的编号不符。大部分门都是上锁的，只能用相应的层级密钥打开。
//
//每一扇门的右侧都有一个多边形钥匙孔，与门上刻印的符文相符。所有钥匙孔内部皆有复杂的锁定机构，且会时刻变形，因此无论是使用撬锁器、还是错误的层级密钥，都不可能强行打开这些门。只有通往Level 1、11、178的门永远都处于未锁状态。通往Level 1的门位于第7排，通往Level 11的门位于第10排，而通往Level 178的门位于第5排。此后的门似乎均被永久性锁住，只能使用对应的层级密钥打开。
//
//如果你通过一把层级密钥进入了枢纽，那么你可以遵循其振动找到通往相应层级的门，直接将之打开。然而，所有先前被手动开启的门对于下一位进入枢纽的人而言，都将重新变为上锁状态。
//
//过去曾有大量实体被目击到进入枢纽，但没有一个成功出来，甚至在枢纽内部也无法找到它们的踪迹。许多实体与失落一族等古老组织都将枢纽称作“十字路口”，但其最初的真名却无从得知。
//
//基地、前哨与社区
//对于许多流浪者/探险者而言，枢纽都是一个热门层级。因此，枢纽内成立了大量前哨，用途各不相同，从临时据点到贸易路线不一而足。在走入下一个层级之前，你可以在这里造访许多不同的社区。
//
//M.E.G.门前阶哨站：
//M.E.G.在枢纽中的哨站。
//大量不同的层级密钥在消失前会被储存于此。
//所有流浪者都可以在此询问枢纽内有哪些密钥可用。
//开锁器兵团主要的密钥存放点。
//琥珀营地枢纽前哨：
//从Level 1算起，这是琥珀营地的第四个基地。
//该组织通常会帮助新人，并教导他们后室的知识。
//路过的流浪者若有需求，可以在该哨点领取一份有限的补给。
//这个前哨还会指导他人应当前往那些层级。
//该组织并无固定基地，他们四处游荡、帮助他人。
//该组织受层级内M.E.G.的支持，以进一步帮助流浪者。
//无名失落文明：
//据报告，有大量失落一族成员在枢纽内游荡。
//他们声称这是自己的领地，并在枢纽的墙壁之间建起了一座村庄。
//有关该村庄的信息目前未知。
//入口与出口
//枢纽有一种稳定的进入方法。从Level 1的入口出发，沿走廊直走，穿过一扇门，走到走廊的尽头。接着，原路返回Level 1的入口，就能发现一个新的岔路。向左走，走到下一个岔路向右，再下一个向左，再下一个向右。在那之后，能看到两扇分别标有A与B的门，进入B门。穿过那扇门之后，你会发现自己来到了一个完全相同的房间，这一次选择A门1。进入A门后，你就进入了枢纽。如果你在其中任何一步走错了，那么终点将会完全随机。
//
//以上的方法是唯一一种久经考验、百试百灵的进入方法。但由于枢纽连通着所有层级，流浪者也很有可能从其他层级进入这里。当某人意外切出时便有可能抵达枢纽，有时其他层级内部也会短暂地出现一扇通往枢纽的门。
//
//想要离开，只需要穿过一扇开启的门，便能抵达相应层级。一旦离开枢纽，就不可能再度返回，因此身处其中时请谨慎考虑你的选择。
//
//但是，如果你能找到一面装饰着可爱气球的窗户，你就离派对不远了！=)
//
//M.E.G.通告：
//日期：2016/07/19
//
//枢纽的实际尺寸远远大于我们的预期，其内部似乎分裂出了多个十字路口，带来了更多有待探索的隧道。也就是说，枢纽不是一条隧道，而是大量隧道的集合。我们暂不知晓该层级是向来如此，还是其结构发生了变动。
//
//枢纽内奇迹般地出现了大量古怪的门，与先前发现的门设计全然不同。这些门凭空出现在了已探查的地点，过去从未有人发现过它们。
//
//所有枢纽内的流浪者都应尽可能确保自身处于已知区域，不建议深入探索。我们将会于近期派遣罗经点兵团前去勘察新出现的地形。所有新的发现都将即时在本条目内更新。
//
//更新：2016/07/17
//附加文件：发现日志1782
//
// 
//
//OldEagleWhiteSD.png
//M.E.G. - 为了更好的人类
//脚注
//1. 上上下下左右左右BA，科乐美秘技？绝对是。真是有趣，不是吗？——专员Zack G。
package lvls;

public class lvl18713 {

}
