//Level C-404
//评分: 
//+58
//+
//–
//X
//页面重定向自Level C-404<点击返回>
//生存难度评级：等级 5i1-感染区
// 
//
//生存难度：
//
//等级 5i-感染区
//
//不安全且不稳定
//感染风险
//大量寄生实体
//Level C-404是后室C层群的第404层。
//
//发现背景
//Level C-404曾经作为Level C-194的子层级Level C-194.1存在，但出于未知原因，Level C-194.1已被E.P.B.从档案库中移除。20██年3月22日，它被一名疑似来自宗教组织神爱之繁生的信徒重新发现，并确定Level C-404就是曾经的Level C-194.1所在地。一具疑似该信徒的尸体被发现于Level C-194的沙漠中，尸体内外长满寄生植物。由于长期暴露于干燥环境中，彼时尸体与植物残体均已风干。
//
//随后，在20██年4月7日，又于Level C-194的一处荒地中发现了失踪近一个月的M.E.G.研究员████，在喷洒高浓度2,4-D2排除威胁后对其进行尸检，发现其体表长满了寄生性物种BIII-023“凌霄菟丝子”3。对尸体肺部的检查结果表明其被一种未知来源的红藻(已被命名为“红浮藻”)填充，死者很可能死于支气管阻塞窒息。
//
//>>被发现的M.E.G.研究员████的尸体.jpg (注：此图片可能令读者感到不适，请谨慎点开。)<<
//经与E.P.B.交涉后，M.E.G.BioIII基地强烈呼吁任何流浪者远离此层级。
//描述
//通过E.P.B.方面提供和几位失踪的流浪者身上找到的线索，M.E.G.对Level C-404有了一个大致的描述。
//
//194.1map8.png
//E.P.B.提供的Level C-404区域地形图。黑色部分为[错误]区域。地图的南北是颠倒的。
//
//
//
//Level C-404似乎是一个毗邻一片水域的废弃城市，但建筑物仍然保持较完整的状态。层级内拥有极高的实体数量，大多表现为植物的形态。
//Level C-404内的建筑数量庞多，大致包含了20世纪后期~22世纪早期风格的建筑，总体上偏向现代主义风格。本层级拥有极其丰富的植物群系，似乎所有的植物都和建筑长到了一起，难以分开。
//本层级没有昼夜循环，中心地带永远维持在黄昏的状态，向指南针指向的西方走去天空中太阳的位置会逐渐升高；相反，向东方走去，太阳高度会逐渐下降并最终落到地平线下。本层级的气温通常维持在-33~45℃之间，存在天气变换，但下雨总会毫无征兆。在下雨时各种植物类实体的活性会显著升高，并表现出更强的感染性。经M.E.G.档案部评价，该层级被认定为“生存等级5”，并特别附上了“感染区”的标识。
//该层级内没有原住民。
//
//Notepad_202204302041_38140.png.JPG
//Level C-404城市深处的艺术构想图。植物与建筑杂糅在一起。
//
//photo-1626828169858-bc1d502e23b9.jpeg.JPG
//Level C-404的太阳。空气中悬浮有大量寄生性单细胞植物红浮藻，加上落日的昏光，使得整个空气呈现一种血红色。
//
//实体
//本层级的实体拥有极强的寄生属性，建议一切流浪者远离。如果迫不得已需要进入此层级，请务必穿戴全套生命维持服，或配备2000目4滤网的气体交换装置，以避免吸入致命的红浮藻。
//
//红浮藻
//红浮藻是一种单细胞自养/异养(寄生)兼营植物，在缺少现成有机物的时候它会自己进行光合作用维持生存并寻找寄主；在有现成有机物（寄主）时便会寄生在寄主体内并大量增殖，最终导致寄主死亡。
//最为恐怖的是，红浮藻通常生活在空气中。因此倘若流浪者吸入这里的空气，红浮藻便会大量在肺部增殖，并最终导致流浪者缺氧死亡。
//雨后，红浮藻会大量在空气中繁殖形成“气华”5。
//
//凌霄菟丝子
//凌霄菟丝子的名称来自前厅中凌霄花和菟丝子（前者是攀援藤本植物，后者是寄生植物）。与红浮藻类似，在养料充足时营寄生，会优先吸取寄主的养料，在现成有机物不足（如将寄主体内可利用有机物消耗殆尽后）时才会进行光合作用自养，同时等待时间寻找下一个寄主。出于未知原因，原本在Level C-194只会寄生在植物身上的该物种在Level C-404表现出了极强的寄生性，可将动物和其他实体作为寄主。
//
//【未避免引起恐慌情绪，其余实体暂不公布】
//进出Level C-404的流浪者必须进行严格灭菌处理，以避免将任何可能的危险物种带往其他层级。
//
//基地、前哨站和社区
//E.P.B.████研究所
//成员████，分布在城市的核电站、生物研究中心等地，对本层级的各种物种进行研究。
//
//即使Level C-194.1已经不再是Level C-194.1，家园不再是家园，他们仍然坚守在那里。
//
//现已全部失去联络。
//
//本层级无其他基地、前哨站和社区。
//
//入口和出口
//入口
//20██年3月22日后，所有曾经通向Level C-194.1的入口会来到这里。现Level C-194外围地区已处于戒严状态。
//掉入Level 499的某个洞窟会来到这里。目前仅有一人6通过此方法进入。
//出口
//向市郊走去，回到Level C-194。
//向东边的黑暗走去，来到██████。
//
//
//
//
//
//
//
//错误
//本文档已过期。检测到有新的版本，是否更新？
//(错误代码：404)
//
//>>Y<<
//N
//授权协议
//脚注
//1. 等级5i中的i是"Infection Zone"(感染区)的缩写。
//2. 2,4-二氯苯氧乙酸，一种选择性除草剂。
//3. BIII-023是Level C-194基因仓库里使用的内部编号。“凌霄菟丝子”有类似于前厅中凌霄花和菟丝子的某些特性（前者是攀援藤本植物，后者是寄生植物）：在养料充足时营寄生，会优先吸取寄主的养料，在现成有机物不足（如将寄主体内可利用有机物消耗殆尽后）时才会进行光合作用自养，同时等待时间寻找下一个寄主。出于未知原因，原本只会寄生在植物身上的该物种在Level C-404表现出了极强的寄生性，可将动物和其他实体作为寄主。
//4. 每英寸打孔数目多少的单位，2000目孔径约7.5微米，足以过滤单个真核细胞。
//5. 参见水体富营养化造成的“水华”现象。
//6. 即前文提及的被发现尸体的那位神爱之繁生信徒。
//
//
//
//
//
//
//
//Level C-404
//评分: 
//+58
//+
//–
//X
//页面重定向自Level C-404<点击返回>
//警告
//Level C-404属于权限类别γ类文档，严禁任何非E.P.B.内部成员访问。
//最近更新时间：20██年6月█日
//
//
//
//
//登录验证
//
//请输入您的E.P.B.干员序列号
//
//帐号	
//***********
//密码	
//•••••••••
//登出
//名称：生成记录
//日期：20██年█月█日
//生成耗时：25h34min5s
//生成结果：Habitable
//导出：Y
//演算者：Paradox Sandbox
//名称：第█次重定义
//日期：20██年█月█日
//生成耗时：—
//生成结果：Error
//导出：N
//演算者：Paradox Sandbox
//备注：层级内部核电站故障发生泄漏，导致层级不再宜居。故进行本次重定义。
//名称：第399次重定义
//日期：20██年3月█日
//生成耗时：—
//生成结果：Error
//导出：N
//演算者：Paradox Sandbox
//备注：层级原住民爆发生物战争，导致层级不再宜居。故进行本次重定义。
//名称：第404次重定义
//日期：20██年6月█日
//生成耗时：24h40min4s
//生成结果：Able
//导出：Y
//演算者：Paradox Sandbox
//生存难度评级：等级 -1i1-感染区
// 
//
//生存难度：
//
//等级 -1i-感染区
//
//亚稳态
//感染隔离
//极高物种数
//部分参数
//收起
//FSI2	97.9%
//宜居度3	83.41%
//危险度4	7.51%
//大气压	0.97atm5
//温度	昼：15~28℃；夜：9~17℃
//昼夜循环	24h40min
//重力	0.86G6
//
//
//Level C-404是后室C层群的第404层。它曾经作为Level C-194的子层级存在，后经评估成为一个独立层级。
//
//
//简介
//194.1map9.png
//Level C-404区域地形图。上北下南。
//
//Level C-404是一座大小约20000km²的无人城市，长满了繁茂的植物。该层级内的几乎所有生物都来自于Level C-194的基因仓库。
//Level C-404内的建筑数量庞多，大致包含了20世纪后期~22世纪早期风格的建筑，总体上偏向现代主义风格。Level C-404拥有极其丰富的植物群系，似乎所有的植物都和建筑长到了一起，难以分开。
//本层级遵循周期约25小时的昼夜循环，白日气温通常维持在15~28℃之间，夜晚则大约是9~17℃，并且有较为充足的日照和降水。经E.P.B.环境资源部评估后，E.P.B.将总部迁至此地。
//
//IMG_20220903_132422.png
//Level C-404的郊区。20世纪晚期的建筑风格。
//
//物种
//该层级内的物种大致与Level C-194的物种相同，但有少数特有物种，诸如在Level C-194已灭绝的维多利亚黄杏、御膳果可在此层级内找到，但出于某种未知原因，与Level C-194内文档记载相比，其功用性已严重退化。例如，御膳果种子中已经不再含有皇家口粮，取而代之的仅仅是普通的明胶。
//
//浮灵
//浮灵是该层级内的一种特有物种。它们通常呈现各种颜色的圆球形，并会被某些特定的物品吸引：
//
//红色“浮灵”——炽热明亮之物，如火焰和光芒。
//绿色“浮灵”——各类生命体，尤其是植物。
//蓝色“浮灵”——带电体与辐射物质，如闪电、各类电源与核电站。
//
//
//蓝色“浮灵”较易驯服，经进一步基因工程改造后成为Creature C-69“电仔”用作辅助勘探工作。
//浮球藻7
//浮球藻是一种单细胞自养/异养(寄生)兼营植物，在水分和CO2充足的时候它会进行光合作用维持生存。浮球藻再生能力极强，可作为重要的食品原料进行加工。
//
//凌霄菟丝子
//凌霄菟丝子的名称来自前厅中凌霄花和菟丝子（前者是攀援藤本植物，后者是寄生植物）。在养料充足时营寄生，会优先吸取寄主的养料，在现成有机物不足时才会进行光合作用自养，同时等待时机寻找下一个寄主。该物种只会寄生在本层级和Level C-194的生物身上。
//
//+ 展开实验记录1
//铀菜
//铀菜是一种发现于城市市郊核电站的植物，由于核辐射影响，已表现出与一般植物明显不同的变异性状。铀菜可以选择性地从核废土吸收铀离子和铀酸盐，在同时存在238U(铀-238)和235U(铀-235)时会优先吸收后者。不充分证据表明，铀菜可能部分依靠裂变能量维持生命。
//
//植物人12蕤生（通称植物灵）（濒危）
//蕤生（植物灵）是对本层级内原住民的称呼。他们有着类似人类的外表及五官，但毛发呈现绿色，并可以利用光能进行光合作用。蕤生的体表拥有细嫩的皮肤，倘若被划破，会流出黄绿色的汁液(血液)。请注意与窃皮者相区分（PS.本层级无窃皮者出没）。尚且不知道他们是否为无面灵的亚种。
//蕤生极易遭受本层级内如浮球藻等生物的寄生，因此在任何时候请注意确保他们远离层级中的寄生植物。
//
//IMG_20220903_132501.png
//Level C-404深处的建筑。可能属于22世纪的风格。
//
//
//Level C-404内的物种遵循E.P.B.保密协定。如需获取详细信息，请前往环境资源部内部网站了解查看。
//
//基地与社区
//由于涉及机密信息，故仅列举名称。
//
//E.P.B.总部“六角阁”(Hexagon Pavilion)
//E.P.B.光禾核电站研究所
//E.P.B.“葳蕤”生物实验室
//Notepad_202204302310_34746.png
//生物实验室大厅。
//
//E.P.B.前厅联络“Pre”站点
//E.P.B. Level C-180数据分析中心
//“寻绿”社区
//大约有██名居民，成员除有两名从Level 62的后院进入的卡拉格灵协会成员，一名从Level 499不慎进入的神爱之繁生信徒，一名M.E.G.研究员（现已加入E.P.B.），以及部分植物灵外，均为E.P.B.干员。
//
//IMG_20220421_170121.jpg
//“寻绿”社区。
//
//M.E.G.资料库中对此层级的信息记载仍然停留在版本399，故在其他组织眼中，这里只是一片充斥着死亡与错误的土地。但真相早已隐藏在被消除的错误之中……
//迄今为止有两名卡拉格灵协会成员，一名从Level 499不慎进入的神爱之繁生信徒，一名M.E.G.研究员误入了版本404的Level C-404，他们在这里过得很好。我们派送了数名植物灵带上他们的随身物件前往Level C-194报一句平安，只是不知道他们能否到达目的地……
//
//出入口
//入口
//20██年6月█日后，所有曾经通向Level C-194.1的入口会来到这里。
//掉入Level 499的某个洞窟会来到这里。目前仅有一人通过此方法进入。
//从Level 62的后院树丛 切入，目前仅有2人通过此方法进入。
//在Level 414的“丛生都市”区域找到一个瀑布并切入会来到本层级的生物实验室大厅。
//出口
//向市郊走去，回到Level C-194。
//在城市机场搭乘一架彩色的班机来到Level 201。
//进入生物实验室大厅中央的瀑布会来到Level 414。
//找到一幢22世纪早期风格的建筑切入并来到未来。
//Notepad_202204302305_33909.png
//可能是22世纪早期风格的建筑。
//
//E.P.B. Level C-180数据分析中心找到进入Level C-180的快捷通道。
//走进太空电梯会来到一个新的层级，尚且不明目的地。
//从[地形加载中]的地块切出，可能来到Level 404/503_404_c lEVEL/Level 256/Level C-360等层级。
//
//
//
//
//
//
//
//
//
//
//每一条 错误代码
//404
// 都是一场梦魇
//但每一次 试错
//Trial and Error
// 都有它的意义
//
//
//授权协议
//脚注
//1. 等级-1i中的i是"Infection Zone"(感染区)的缩写。等级-1下的“感染区”不会对非本层级原生实体造成感染。
//2. Frontrooms Similarity Index，前厅相似指数，指层级与前厅通常环境相似度的比值(前厅=100%)。
//3. 前厅=100%。
//4. Level 8=100%
//5. 1atm即为一个标准大气压，约为101325帕斯卡。
//6. 1G即为一个地球标准重力。也许因为重力较前厅较小，这里的植物可以长到更高的地方。
//7. 类似于前厅的“小球藻”。
//8. 一种植物激素。生长素有调节茎的生长速率、抑制侧芽、促进生根等作用，在农业上用以促进插枝生根，效果显著。
//9. 2,4-二氯苯氧乙酸，是一种生长素类似物，用作植物生长调节剂。也是一种选择性除草剂。
//10. 是一类促进胞质分裂的物质，促进多种组织的分化和生长。
//11. 是一种抑制生长的植物激素。
//12. 该名称存在歧义，E.P.B.档案部驳回了这个名称。
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1404{}