//Level C-407
//评分: 
//+17
//+
//–
//X
// 
//
//生存难度：
//等级 4
//
// 
//特殊效应
//大量实体
//Level C-407是后室C层群的第407层。
//
//描述
//Level C-407是一片由难以计数的床和近似物品构成的平坦区域。由于其光照极度昏暗且存在特殊性质导致探索者行动能力严重受限，至今未能探明Level C-407具体大小。
//Level C-407地面上以尽可能密集的方式排列着巨量床铺，造型大小款式都不相同。最常见的是高0.5米左右的单人床铺以及大量日式榻榻米，但是除此之外也有相当数量的大床和高低床，甚至有一部分婴儿床和棺材。
//
//床上都放置着风格不一的床上用品，通常包括1-2个枕头和1床被子。被子厚度不统一，从最薄的毛毯到加厚的冬季棉被都有发现。1被子下方配有和枕头被子相同风格的床单，床单以下通常是床垫但也有一部分床是床板。只要有合适的工具就可以很简单的将床垫破坏。
//
//床垫下方是一片落满灰尘但是没有任何特殊性质的坚硬石质地板，由于Level C-407缺少大型器械并且无法运入，穿透水泥地板的尝试没有成功。石质地板存在与床面相应高度的起伏以保证所有床铺（如果是高低床的话就是高低床的下层）都处于同一水平面。
//
//床铺彼此之间存在一定空隙允许将床铺移动到其他位置，被破坏或是弄脏的床铺会缓慢自我清洁和修复，完全摧毁的床铺或是已经被带出这片区域的部件将会在一周之内重新生成替代品，如果床铺被水平移动也会生成新的替代品但是也有床铺不会消失，但是垂直堆叠的床铺会在一周内凭空消失。
//
//这个层级完全没有自然光源，且由于其异常性质难以使用大功率的人造光源所以这个层级的绝大多数区域处于完全的黑暗中，探索上方和四周边界的尝试被认为失败。除了罕见的双层床外本层级并没有地势起伏，探索者总会在一片较为接近的直径大约1千米的区域内出现，因此在该层级中方位的表现方式是以出现区域中心点为圆心的圆周坐标系。
//
//层级中并未观测到明显的天气变化，但是有些时候会传来近似下雨的声音，源头不明，气温整体稳定在15摄氏度左右。
//
//实体
//Level C-407存在数量极其惊人的实体，包括（受到梦魇效应影响并不能确切确定） Entity 4，Entity 11，Entity 15等，这些实体都受到层级特殊效应影响，对于处于被子中的探索者保持中立状态不会主动攻击，但是对于失去保护的探索者却展现出超越一般层级的攻击性，并且可以准确定位到失去保护的探索者所在位置。
//
//特殊效应
//Level C-407具有一系列特殊效应，根据其发生的大概原因和表现将其归类为以下几个方面。
//
//梦魇效应
//Level C-407该层级的非人类实体在探索者眼中将处于一种难以确切认知的朦胧状态，但是仍然能推测所属种类（对于认知的实体）。
//
//在此状态下实体无论其原本习性如何都会处于一种平静的中立状态，直到探索者覆盖在被子下的区域小于百分之80或探索者启动/持有一个50勒克斯以上光源时，（此时旅行者被称为失去保护状态）
//
//进入失去保护状态的探索者将会被所有实体超自然的感知到确切位置并且立即受到攻击。同样是因为这个效应的存在，目前没有找到合适的方法拍出一张具有足够亮度的照片。
//
//困倦效应
//探索者在进入本层级后会立即表现出近似于进行一次高于三小时（一次完整睡眠周期）的睡眠后突然被被动唤醒的状态。
//
//具体生理表现为对外界温度更敏感并且总是认为外界寒冷，厌恶发光物体，在观察发光物体时眼睛会明显不适等一系列问题。同时心理上也会出现相关变化，包括意识模糊，拒绝离开被子，判断力大幅下降等。2
//
//失眠效应
//进入Level C-407的探索者尽管处于非常疲倦的状态但仍会莫名的难以入睡。3
//
//建议希望离开的探索者深呼吸，放松并尽可能减少恐惧，必要时可以使用酒精的药物来加速自己入眠。用于放松自己的方法在本区域同样适用 包括但不限于与其他幸存者待在一起，熟悉周围的环境，保持足够的武力和充足的物资补给等。
//
//幻梦效应4
//进入不满足三小时的短期睡眠时探索者将产生大量梦境，包括但不限于：自己已经离开被子并且正在被实体追赶，自己在某些陌生而危险的层级被追赶，自己正在处于某种交战状态等。这些梦境本身逻辑不通内容模糊，但是处于梦境中的探索者会下意识的以为这是真实的，在这些梦境中死亡将有可能导致突发心跳骤停。
//
//物资
//Level C-407床架与床垫的夹缝中，部分床下或是枕头下都有大量物资，通常是零食和水源补给，少数时候也包括电子产品，轻型武器和后室物品。从理论上说只要有可能被人睡觉前带上床的物品基本都可以在这里找到，出于安全性和便利性考虑，楼梯被嵌入柜子的双层床，有床下抽屉的大床和在比较偏向少年风格的床铺中更有可能搜索到有用的物资。
//
//基地、前哨与社区
//梦境边缘沉思者
//这是一部分受到本层及心理效应影响较重的探索者，认为可以通过保持这种半梦半醒的状态提高自己思考问题或是控制入睡等心理活动的效率。大多数人长期定居于此层级并且乐于展示自己的发现，人数大约有100人左右但是并没有自己的基地，而是分散在层级各处，通过网络传递信息。
//
//C层级民众自卫C-407支队
//这是C集群探索者结成的小型自助保护组织的一部分，由伍凌支队长带领建立。
//作为接应保护误入该层级探索者的救助站，通常有20人左右，持续驻守在该层级。利用数10张高低床架起的简易营地中有大量物资和武器以及专业心理医生，他们会帮助探索者离开或引导他们与梦境边缘沉思者汇合，具体取决于探索者的个人意愿。
//
//网络情况
//层级网络情况整体良好，网速在所有层级中中等偏上且不会有限制，但是任何拥有自动推荐功能的软件都会向他们推荐恐怖/色情/争议性等更容易引起剧烈情绪波动导致失眠的内容。
//
//入口与出口
//入口
//在其他层级中以高压力或是恐惧状态上床睡眠时有很大概率将你传送到Level C-407。
//在 Level 11进入床上用品店有概率传送到Level C-407。
//根据不确定的说法，在Level C-68倒在后座位上睡着有小概率可以让你前往Level C-407并且醒来时都中会多出一张写有“已到站”这样的字条5。
//钻入任何床的床底对着上方尝试卡出会让你到达Level C-407
//出口
//一次超过三小时的睡眠会让你在另一（有床的）层级的床上醒来。
//作者信息
//Footnotes
//1. 无论什么类型的被子都能保证探索者处于梦魇效应影响下不承受实体攻击。
//2. 饮用杏仁水可以在一定时间内（目前测量的大概数据是10ml/1min）忽视该效应，但是除此之外的任何方法包括但不限于呼唤，服用刺激性药物甚至遭受伤害都无法抵抗该效应。
//3. 目前推测的原因包括对游荡实体的恐惧，层级本身的影响，并不熟悉的环境带来的不安全感等，能够造成失眠的心理感觉在Level C-407特殊效应下被大幅提升以至于即使是很微小的心理活动也很可能造成失眠。
//4. 进入Level C-407的探索者会不定时陷入10分钟到两小时不等的短期浅层睡眠，这种睡眠在本层级同样可以恢复精力，而且本层级的探索者似乎更不容易疲劳，这使得积攒疲劳迫使自己快速入睡这样的手段是非常难以实现的。
//5. 警告，该方式未经验证
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1407{}