//Level C-403
//评分: 
//+25
//+
//–
//X
// 
//
//生存难度：
//安全
//稳定
//实体绝迹
//Level C-403是后室C层群第403层。
//
//45418c5a?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1176&q=80
//早期的Level C-403中的村落。
//
//描述
//Level C-403是一片较为平坦的草原。全年平均温度大约在12摄氏度左右，且昼夜循环约26小时。该层级还具有较为稳定的环境以及定期在建筑内刷新的杏仁水等物资，这一切都使Level C-403可以维持稳定的人类聚落。很早的时候，已经有人在此定居并建立了村落。
//
//Level C-403最特殊的点在于在该草原的四周遍布着垃圾堆。这些垃圾包含杏仁水瓶、糖果袋、龙肉罐和各种废纸板和钢材等等。它们似乎都是从后室中被丢弃的。而且，这些垃圾堆似乎在缓慢扩大。
//
//由于Level C-403十分容易进入与离开，加上这里丰富的物资和安全的环境，以及无尽的水源和能源供给，许多流浪者都愿意将该层级作为自己的临时休息点和补给点。在C层群任意危险的层级，流浪者只需扔下一个垃圾并随之切出，就有可能来到这里。这一性质使得Level C-403成为了一个重要的庇护所和中转站。
//
//下面是一段采访记录：
//
//记者：你好，请问你对在此的生活有什么看法？
//
//居民：非常满意，这里没有敌对实体、没有战争，还有无限的物资供我们使用。而且这里的人们彼此都非常和谐，这里简直就是最理想的居所。每天有许多流浪者来我们这里避难，他们也为这里平淡的生活增添了许多乐趣。
//
//记者：你怎么看那些垃圾堆？
//
//居民：我觉得它们对我们的生活没什么影响。它们距离村庄足够远，而且足够小，除了偶尔吹过的风夹杂着些许腐臭味，没有其他影响。
//
//记者：那些垃圾堆似乎在不断扩大，有没有担心过有一天它会淹没你们的村庄？
//
//居民：以前确实有过这样的担忧。我们切入这里之前，他们就已经存在了。我们很早就学会了利用垃圾中的纸板、木材、塑料和钢材搭建房屋。这里有无限物资，但建材稀缺。而这些垃圾，正好弥补了这个空缺。而且，距离我们切入已经过去了好几年了，它们只是扩张了那么一点点。因此，我们完全没必要担心垃圾扩张问题。
//
//记者：好的，谢谢你的配合。
//
//采访结束
//基地、前哨和社区：
//M.E.G.基地
//几乎包含了Level C-403中的所有建筑。在M.E.G.精心运营与管理下，这里的小村落的发展十分良好。有许多旅馆陆续建成，为前来的流浪者们提供暂时的住所。还有各种公共设施日益完善。如果流浪者愿意长期在此定居，M.E.G.会为其分配或搭建住所。这也使得这个原先只有数十人的小村落一跃成为一个大型的居住地和前哨站。
//
//入口与出口
//入口
//在C层群任意层级丢下一个垃圾，并对着它的落地点切出。
//切入任意一个含城市的层级中的垃圾回收厂。
//出口
//在村落中心的一座哨塔内部有一扇通往M.E.G.主要基地的门。
//附录
//-折叠
//是时候搞清楚这些垃圾的来源了。
//
//考虑到垃圾的种类，我们有理由推断，这些垃圾很可能来自其他层级。
//
//我们随机在各个层级丢下了很多带有特殊标记的垃圾，随后前往Level C-403的垃圾堆寻找。
//
//结果果然如我们所料，近八成的带特殊标记的垃圾出现在了这里。而且似乎投放在C层群的垃圾有更大的可能性来到此处。
//
//看来，Level C-403的垃圾可能都不是凭空出现的，它们很可能是其他流浪者在其它层级丢下的各种废弃物。这也解释了为什么近几年来它们的增长速度越来越快——后室中的人口正越来越多。
//
//M.E.G.测验者于2019年10月
//-折叠
//各位后室的流浪者们：大家好！
//我们是M.E.G.，我们遇到了一个需要大家一起解决的问题。
//
//关于Level C-403，大家应该都或多或少听说过吧。该层级有一个宜居的小村落，里面居住了上百人。该层级在各种方面似乎都是一个完美的宜居层级，就是有一个问题：在所有层级丢弃的垃圾，都有可能会因某种未知方式切入该层级四周的垃圾堆里。
//
//早些时候，这种增长小到可以忽略不计，在这里的居民也对其视而不见。
//
//但随着后室人口的不断增长，加上人们对各个层级的探索逐渐深入，产生的垃圾量也开始以指数形式增长。
//
//自然，Level C-403的垃圾堆扩张速度正在变得越来越快。在那里，呼吸的空气已不再纯净，曾经翠绿的草地也逐渐枯黄。Level C-403中居民的生活质量，正每况愈下。
//
//我们的目标都是一致的：为了在后室中更好地生存下去。既然如此，我们又怎么忍心看着这些同胞们为环境污染问题所困扰呢？况且，Level C-403对于一些身处危险层级的流浪者是至关重要的，如果该层级被毁灭，对于所有身处后室的流浪者们，都是莫大的损失。
//
//希望看到这封倡议书的流浪者们，能够意识到事情的严重性。不要在层级中随意丢弃垃圾。我们已经在主要层级设立了垃圾处理点，请各位尽量将垃圾丢弃在那里，为所有在Level C-403生存的流浪者们留下一片清洁的生存空间吧！
//
//M.E.G.于2021年3月
//-折叠
// 
//
//生存难度：
//等级 4e - 环境危害
//
//不安全
//垃圾成山
//非实体危害
//该层级文档由Level C-403幸存者所撰写
//2022年7月10日，堆积成山的垃圾轰然倒塌，成千上万吨垃圾顷刻间向村落所在的洼地涌入。
//
//photo-1617303331806-3d6b58e03241?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1170&q=80
//Level C-403中一座被垃圾淹没的房子。
//
//人们从睡梦中惊醒，猛然发现自己的房前屋后，以及外面的街道上，全部填满了垃圾。
//
//早在几个月前，M.E.G.就已经预料到这种事情迟早会发生。已经有超过半数的居民提前离开了Level C-403。而留下的那些人，仍然希望事情会有所转机。他们不断要求M.E.G.公布垃圾山的图片，号召其他流浪者们不要乱丢垃圾。但这一切都无济于事。
//
//后室太大了，M.E.G.不可能将该层级的事告诉给每一个人。早在第一篇倡议书发布之后，M.E.G.就已经意识到这么做收效甚微——在生命都只能勉强维持的后室，又有几个流浪者会在意环保问题呢？
//
//Level C-403的毁灭，迟早会来到！！！
//
//现在，这一天终究还是到了！
//
//M.E.G.已经尽全力将掩埋在垃圾里的人救出，并将所有幸存者送出该层级。但还是有一些人，至今仍未找到。
//
//滴！
//开始记录
//记者（隔着厚重的口罩）：各位流浪者们，大家好。
//
//不出意外的话，这应该是你们最后一次听到从Level C-403传出的声音。
//
//现在，M.E.G.的人正在全力解救受困者，并组织所有幸存者离开。
//
//（浓重的咳嗽声）
//
//Level C-403俨然从一个理想的宜居层级，一个可供流浪者们避风的港湾，变成了一个危险区。这一结果是我们所有人都不愿意看到的。为什么会发生这种事情？我认为正在听这段录音的流浪者们都应该自我反思一下。
//
//我认为，这种毁灭方式，还不如陨石撞击来得痛快和壮烈。我们人类无法控制自然将一个重要层级摧毁，却可以控制自我将一个重要层级摧毁。很遗憾，我们没有达成后者。
//
//难道生存，只能以环境破坏作为代价吗？难道在生死攸关的时候，我们就不能想想，有一个地方，一个对我们所有人都至关重要的地方，正在为我们的鲁莽选择而受苦吗？
//
//（因为过于激动而引起的强烈呼吸）
//
//我们尝试过各种方法，尝试阻止这一切的发生。就连倡议书都已经写过无数篇了。为什么？为什么我们没能阻止这种悲剧发生？
//
//各位正在收听的流浪者们，请切记：毁灭一个重要的层级十分容易。只要每一个人内心存在一丝邪念，人心——这一最恐怖的武器，便足以毁灭我们所爱的一切。我们该怎么做？相信各位内心已经有了自己的答案。
//
//最后，我还要说一件事。几十年前，我曾听那些从前厅切入的流浪者们说过，前厅的环境多么理想，多么宜居。而最近，越来越多从前厅切入的流浪者表示，前厅的环境正以一种极其夸张的速度变化。“全球变暖”，“温室效应”，“垃圾国度”，“倾倒核废水”……虽然作为后室人，对这些概念有一些陌生，但我还是了解到，前厅，正在经历与Level C-403相似的环境恶化阶段。
//
//如果真的有流浪者回到了前厅，或者该文章传到了前厅，请一定将其传播开来。
//
//希望前厅，不要成为下一个Level C-403!
//
//记录结束
//Level C-403被毁灭之后，M.E.G.随即收回了这些倡议书。流浪者现在，又可以随意丢弃垃圾了。目前，你仍然可以以老方法进入Level C-403。但要出去，你可能需要挖开厚达数米的垃圾，才能找到通往外界的门。
//
//Level C-403已被M.E.G.列入禁止流浪者进入的层级列表。而那里的垃圾，很可能会继续堆叠。数十年后，又有谁会记得，在如此硕大的垃圾山地下，埋藏了这样一个悲惨的故事呢？
//
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1403{}