//Level C-482
//评分: 
//+9
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//Level C-482是后室C层群的第482层。
//
//f0fe29af00e8e687.jpg
//level C-482的一张照片
//
//描述
//
//Level C-482是由竹林包围的面积约为2公顷的小潭和小潭距一米处一大理石材质的中国古式圆桌，三至四把中国古式木椅构成。
//
//到目前为止，此层级中暂未发现任何实体与除流浪者自身以外的任何人。此层级的温度长时间保持在14℃，竹林中长期有类似水汽的烟雾缭绕。此层级中有着较强的信号干扰，任何带入此层级的通讯设备都将失灵。若流浪者试图远离小潭从竹林离开，流浪者周身的温度将持续降低，直到流浪者回到小潭附近，流浪者周身的温度将恢复到14℃。如若流浪者无视周身的温度，继续远离小潭试图离开，流浪者将会在距小谭两千米的位置遇见一面由无比坚固的似乎无限高的类似竹子的植物严丝合缝排列组成的屏障，任何试图破坏屏障或翻越屏障的行为都将失败，致使流浪者无功而返。
//
//据来到过此层级的流浪者描述,每隔2小时小潭边将会随机出现杏仁水等物资。流浪者可坐于木椅上补充体力。值得注意的是，随着流浪者在此层级逗留的时间的延长，流浪者会感到莫名的刺骨的寒意1，这似乎是小潭的效果。小潭中的水不正常的澄澈，但据来到过此层的流浪者描述，小潭似乎深不见底，望向小谭深部时，会令流浪者在内心产生不安感。小潭上空不时有柔和的光线射下，光线的源头仍然未知。当流浪者到达小潭边沿并向下看时，会触发事件“谭望内心”。
//
//长时间的逗留此层，会使流浪者感到被孤独包裹的窒息感，若未及时离开此层级，流浪者的精神极可能会因为长久的孤独出现问题。
//
//这里是M.E.G.一成员切入此层级时发现的一张纸条与一段刻在竹子上的话。
//
//- 点击收起纸条内容与竹子上的话
//纸条
//
//遗言
//亲爱的朋友，如果你看到这张纸条，我很可能已经死了。这里真是太™的冷寂了，一个人，甚至一个实体都没有。请带着我的意志继续活下去，如果你能离开…
//
//哦，我的天呐，这个小谭真是神奇，它让我看到了死亡，当我能够正视死亡后，那些画面竟神奇的消失了！…死亡好像真的没有那么可怕，之前的恐惧真是多余了…如果你看到这个纸条，说明我已经从小谭离开了这里，祝你好运…
//
//-未署名
//
//竹子上的话
//
//吾唯折竹入此处，不知以可何从去。所见此层幽深静，有志滞此长久存。但有至亲仍等吾，归来与亲相已聚。望潭见惧学何对，归来仍为一君子!
//-柳综元题2
//
//- 点击收起纸条内容与竹子上的话
//事件
//
//谭望内心
//
//当此事件触发，流浪者将在潭水的倒映看见流浪者自己最恐惧的事物，如失去亲人，面对死亡等。此事件一但触发，令流浪者恐惧的画面便会在流浪者的眼前不断循环3，直至流浪者学会面对并克服自身的恐惧，画面将终止循环，或是无法承受自身的恐惧，跳入小谭窒息而死，此事件结束。完成此事件后可选择继续逗留此层级4或选择任意一安全层级切出。
//
//820ad51972bc492c.jpg
//“潭望内心”结束后Level C-482的照片
//
//基地，前哨站与社区
//
//由于本层的性质，无法建立任何基地。
//
//入口与出口
//
//入口
//
//一棵新生的翠竹将会在后室C层群的任意一层出现，并会在一到二小时内随机刷新，折断新长出的竹枝，将会切入此层级。
//
//出口
//
//完成“潭望内心”事件后，在心中默念想要切入的安全层级5，跳入小潭即可切出。
//
//+ 作者信息
//脚注
//1. 流浪者周身温度实际并不发生改变
//2. 柳综元，后室有名诗人，文学家，哲学家，后室文学巨匠，祖籍中国。
//3. 饮用杏仁水可短暂中止循环
//4. 事件结束后此层级对流浪者的所有影响将会消失，物资刷新依旧。
//5. 若默念层级为危险层级，将会切入Level C-481
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1482{}