//Level C-481
//评分: 
//+25
//+
//–
//X
// 
//
//生存难度：
//等级 夏至日
//
//扭曲中的净土
//永恒的炽热
//生机之城
//Level C-481是后室C层群的第481层
//
//描述
//该层级是一个类似东南亚沿海的区域，天气通常晴朗，有较小概率下暴雨。这里的空气闻起来有鲜花的气味。通过估算，此层级是一个直径为30公里的小镇。在这里会随机遇到记忆中的建筑和公园，还有地标性建筑，但是建筑内的一切物体都是随机的，有较小概率刷出结果魔方
//
//前进距离	所见建筑	流浪者的感受	温度
//刚刚进入	马路边相同的居民楼	微微流汗，意识清醒	24至29℃
//深入4公里	不同颜色的楼房	轻微口渴，渗出汗水，有时听见轻微蝉鸣	30至32℃
//继续前进6公里	房子的构造、材料、高度出现明显的差异	轻度脱水，全身出汗，清晰地听到远处的蝉鸣，有些昏沉	33至35℃
//向前3公里	扭曲、不符合物理规律的房子	中暑，汗湿透衣服，蝉鸣变得十分强烈，意识模糊	35℃
//继续前进	房子的扭曲现象在这里停止	神清气爽	30℃
//强烈建议带好至少12瓶杏仁水。
//
//photo-1587221088413-0a901a6ee2a2?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=987&q=80
//4公里处的树木。
//
//往中心眺望，会发现一大片白桦林以及远处的海滩。
//每颗白桦树上都至少会有5～3个机械蝉。机械蝉每93分钟鸣叫一次，它们会周期性地消失或出现。白桦林的旁边有一个叫枫的别墅。
//该别墅的主人是一个叫霍尔的无面灵。它有改变气温的能力，它使别墅内的温度平衡在25℃左右。遇见霍尔时，他说的第一句话通常是“你觉得很热，不是吗”也有可能会说“别耷拉着脸，像夏天一样充满活力吧”
//
//photo-1605551004124-dee241ed2c9d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1074&q=80
//“枫”。
//
//请不要砍伐这里的树木
//任何试图砍伐树木的举动都会以失败告终。砍伐者的耳边会出现低语。
//比如：
//“我的朋友，能别砍树了吗？这些树给这里带来了生机。如果你无事可做，不妨和我喝茶吧！”
//“这位女士/先生，请停下手中的工作。我知道生活很艰难，来我这里坐坐吧！”
//如果屡教不改，霍尔会出现在附近，伐木者将被迫感受长达19分钟的50℃高温。
//
//“枫”是一个外观古典的别墅。里面的家具、摆设的样式在20世纪20年代至50年代不等。里面的电视机播放着前厅的喜剧节目。如“老友记”，“生活大爆炸”，“破产姐妹”。
//
//柚子广播：这个广播台在一个靠近中心的区域被发现，它播报在前厅发生的事件，也会播报如何快乐度过夏日的妙招。从未重复过=(
//
//photo-1571977796766-578d484a6c25?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1031&q=80
//来这里坐坐吧。
//
//商场：进入后一切正常，但随着流浪者呆的时间增加，中央空调会从制冷缓慢变为制热，货架会慢慢移动，有很大概率将其困住。
//曾经有流浪者报告说商场里有着窃皮者和笑魇，但经过反复调查与核实，没有发现它们的记录。建议进入此类区域时保持清醒，最好带上杏仁水。
//
//实体
//有着“11效应”的无面灵以及猎犬和艾登
//一名扫兴客，他自称是在享乐战争后被“校长”拉入电梯逃到这里，他目前借宿在霍尔的别墅中。有时会出来提供人类帮助。
//
//以下为该扫兴客的自述
//朋友们，你们好
//我叫希尔伯特，你们就叫我希尔吧。当时我出生以来居住在Level 52的烦闷室中。在这段时间，扫兴共和国的经济衰退，派对客对我们的攻击越来越频繁。我们最后只能把对我们有敌意的人类献给派对客，表现自己的“友善”。这十分可耻，因为人类不属于这里，我们也没有权利决定他们的死亡。
//………………
//后来享乐战争爆发了，我看到昔日的好友如今却被狡猾的派对客利用，竟对我的朋友做出这种事！我只能无助的看着一个又一个同胞倒下。我近乎崩溃的跑到角落里，不敢直视所发生的一切。这时，一个自称是校长的成年男性在我耳边低语：“想活就跟我来”然后拽着我进入了电梯。
//接下来的事情我不记得了，我只记得我在古典的别墅中被叫“霍尔”的无面灵唤醒。
//
//基地、前哨和社区
//后室避暑团！
//由30名无面灵组成，它们会邀请流浪者去他们的房子中喝茶！部分会说中文，但不开放贸易。
//
//树荫基地
//M.E.G.的树荫基地由100名成员组成，他们向流浪者免费提供物资、人力帮助，目前在该level建设相对稳定的房屋供居住。
//
//夏日交易所
//B.N.T.G.的夏日交易所在这里建立，以打折的价格出售火盐，水枪，糖果等物品。
//
//入口与出口
//入口
//在其他层级中找到一个机械蝉并上发条可以进入。
//通过Level 52的电梯。（未经证实）
//
//出口
//在建筑内找到一盘国际象棋并触摸国王可以前往Level 11，或者向海滩走去返回Level 48。
//在霍尔的后花园里种植树木会传送至随机一个有树的层级。
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1481{}