//Level C-420
//评分: 
//+31
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
// 
//无有害实体420.jpg
//一棵正在开花的原树。花种榆叶梅。
//
//Level C-420是后室C层群的第420层。
//
//描述：
//Level C-420是一片绵延不绝的山坡。整个层级的地面都被苍翠的草皮所覆盖，并生长有大量形态各异、未生枝叶的树木与灌木。
//
//上述树木/灌木统称“原树”。因为尽管它们枯瘦不已、枝干光秃，却全部拥有迅速生长并高速成熟各类花卉的能力。不过，展现此种能力需要“花农”进行定向操纵。
//
//未发现Level C-420内存在除了“花农”（该实体自称）以外的生物。花农是一名人形实体，其衣着与从事园丁行业的人类相似；同时，它佩戴着一顶硕大的斗笠，直接遮挡了绝大部分视线。虽然这并没有阻止流浪者们看清花农的脸，但是所有事后报告都称无法忆起它的任何面部细节。当前认为此属花农的固有性质，无需在意。
//
//花农很乐意与来到Level C-420的人类交流，并会友善地询问对方“喜欢什么花儿”。待得到或具体或大致的描述以后，整个层级的原树都将快速长出对方所回答的花卉；此过程无视花种、无视花期、无视环境等因素的制约，即无视所有约束。
//
//值得注意的是，流浪者们仅能在自己的诞辰当日发现Level C-420的入口。
//
//附录：
//以下是一份由外部人员提供给M.E.G.的实体遭遇记录。其中记载了她偶然进入Level C-420之后与花农展开的交流之内容。
//
//实体遭遇记录
//
//遭遇对象：“花农” - Level C-420独有实体
//
//遭遇地点：Level C-420
//
//遭遇人员：白浅 - 个体流浪者
//
//[记录开始]
//
//
//（无关部分已删节。双方正站在一棵原树下方。）
//白浅：不好意思……请问我应该叫你先生，还是女士？我有点听不出来。
//
//（花农闻言哈哈大笑。）
//
//花农：都一样，孩子。不过从方便称呼的角度而言，你还是需要一个称谓的。叫我“花农”就好。如你所见，这就是我的工作。
//
//白浅：噢好，我知道了。……那么，这里到底是个什么地方？
//
//花农：不是很明显么？这里是我的花园。
//
//白浅：花园？可是没花呀。
//
//花农：你喜欢什么花儿？
//
//白浅：嗯？我？
//
//（尽管仍然回忆不起花农的脸，但是白浅称自己对它面部表情的印象始终是清晰的“和蔼微笑”。）
//
//花农：对。
//
//白浅：榆叶梅吧，我想。
//
//花农：噢？居然不是广泛的代指，而是说的如此具体？
//
//白浅：怎么说呢……我爹懂花，所以我从小到大多少也受了点他的熏陶。我小时候曾经问过他咱家楼下那排花圃里栽的是什么花儿，然后我就得到了这个答案，于是记下来了。
//
//花农：噢，是这样。
//
//白浅：（咕哝）其实有时候，这个花名对我而言不仅仅是指这种花儿，更多的是……我的童年、我的家园、还有那段我爹我娘接我放学回家时走过花下的时光……
//
//（花农似是刻意地没有承接话题，而是开始反问。）
//
//花农：你知道榆叶梅的花语么？
//
//白浅：花语？我想想啊……我记得是……“花团锦簇”？
//
//花农：（轻轻颔首，并伸手示意四周）“春光明媚，花团锦簇与欣欣向荣”。
//
//（无需花农的示意，白浅也早就注意到了四周的变化。所有大树与灌木的枝条都开始高速长出花苞，并迅速成熟、绽放，最终让整片山坡都在仅仅约半分钟的时间里便彻底改变，从死气沉沉化作了姹紫嫣红。）
//
//花农：生日快乐，孩子。
//
//白浅：（从讶异之中回过神）诶？你为什么知道今天是我的生日？
//
//花农：（笑）因为不是生日的人来不了这里。我真没什么能送予你的，所以——只好送你一天的满山鲜花。
//
//（白浅环顾山坡，精神恍然。）
//
//白浅：……谢谢你，……谢谢。
//
//花农：其实在最开始，我并不明白生日有何好过。后来嘛，逐渐就想明白了：需要去纪念与庆祝的，从来就不是生日本身。至于是什么，我想你应该有自己的答案。
//
//白浅：（略加思索）嗯，对。
//
//花农：更别提你们现在身处后室这种地方。每个新的24小时都是绝处逢生、都是生存的奇迹。过去的一年里你坚持做到了立于大地之上、而不是大地在你之上——这不容易。我由衷地希望你在你的下一年，能够继续诠释生命的顽强。
//
//白浅：真的……非常感谢你。恕我冒昧，我能知道你到底是谁吗？
//
//花农：嗯？我是一个种花的花农，仅此而已。
//
//白浅：好吧……那，我、我能再问一个问题吗？
//
//花农：你说。
//
//白浅：（抬头看了看树上的花，沉默片刻）……我还能回家吗？
//
//花农：我不知道。
//
//白浅：……好吧。但，还是谢谢您。
//
//花农：但是，千万不要放弃。不止是为了你自己，同样也是为了那些在乎你的人。你的生命、你的鲜明，单是存在，就对有些人来说至关重要。
//
//白浅：……
//
//花农：加油，别死。他们领你来到这世上，绝不是为了让你受苦。
//
//白浅：我懂。
//
//花农：哈哈，别嫌我啰嗦。我这辈子也就这样了（指了指花），但你远可以比我更好，远可以走出更加宽敞的大路。
//
//白浅：（微愣，然后笑笑）您这语气有些耳熟。
//
//花农：（摘下斗笠扇了扇风）介不介意陪我聊聊花儿？难得遇上一位懂花的。
//
//白浅：好啊——诶？
//
//[记录结束]
//
//后记：白浅称花农的脸让她很“惊讶”，但是确实无法回忆起任何模样。
//
//基地、前哨和社区
//该层级不存在已知的基地、前哨和社区。
//
//入口与出口：
//入口：
//若在C层群内发现一棵生长位置相当违和的枯树1，触摸其树干便会被传送至Level C-420。
//更多入口尚待探查。
//出口：
//入睡即可原路返回。
//主动请求花农将自己送出，也可原路返回。
//无其他出口（花农称）。
//作者信息
//« Level C-419 | Level C-420 | Level C-421 »
//
//Footnotes
//1. 当天并非自己诞辰的人类主体无法遭遇此树、也无法看见与触及他人所发现的枯树。除此之外，该入口仅会出现在生存难度为0的层级。
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1420{}