//Level C-495
//评分: 
//+27
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
//仍未探明
//实体不明
//情况不明
//关于本层级的报告仅此一例。直接将报告作为文档呈现。
//
//2015/3/18
//今夜的梦境使一些深刻的回忆被唤起。突然有一种想写下的冲动。暂且就将它放进梦日记里吧。
//
//先希望我不要写完这个就把梦境忘掉。
//
//2013年，我14岁。那时候写着一些看起来很疯狂奇怪的小说（那段时间脑洞真的很大。甚至那种想象力可以支持我去想像1一个比后室更加奇怪的空间），写着自己的歌曲，或者是给一些歌曲填词。说着一些看起来很有道理但是现在想起来很中二的话，也对那个世界有着一些不切实际的幻想：幻想我的█████可以随意地施展，幻想我能够在那个世界上做我自己。
//
//看着写满作品的记事本，很满足，又有一种继续努力积累成果的希望。
//
//有一天这个记事本被同学撕坏毁了。那天我下课时把那个记事本就摊开在桌子上。出去一会的时间，他们马上就围上去看。回来时，他们在对着那些里面一些语句嗤笑着。
//
//当时觉得那真的是天地间至文，谁看不懂谁就是█。当然，现在还是觉得那是一群幼稚的人对一个稍微和他们不同的人，有很大的恶意2。我那时不知道他们的目的，甚至不知道他们的对我持怎样的态度。继之而来的是一大波的冷嘲热讽和外号。似乎当然，如此就让我，一个年轻的我，失去了所有热情和目标。
//
//2018年的一个春日。上午。
//
//站在窗台上。我想要自杀。窗台是一小段从窗子往外伸的地面，背靠书房的窗，右边有一台一列空调外机的支撑3。春日的阳光与风静静流动着，对面是高楼，远处的高架上垂下绿色的爬山虎，将阳光与通过的雾气截成几块凝胶般的小块。心情烦乱时，这不过是一些虚影。我就站在窗台上哭着，想着。
//（我现在想与那时的我对话。）
//“我将永远自由。”
//
//“看，我现在已经完全自由了……在一个诡异的封闭里自由了。”
//
//
//“我要将这个世界抛弃。”
//“如果你来看看这个世界，你再做权衡，也未尝不可。”
//
//
//“不再会有人对我指手画脚。”
//“对。来看看。到这个诡异的空间来看看。这里没有人会互相指手划脚，但是每个人都可能下一秒消失。”
//
//
//我现在发现我还是不能解决我那时的所有疑问。那个解不开的疑问如下：
//“人都是一些化学反应。
//“把两种物质放在试管里，它们会以它们的方式，进行它们自己的反应。不管它们4的是美丽还是丑恶，它们都将以自己的方式进行下去。
//“但是为什么人不能？人为什么不能按照自己原有的方法生活下去？
//“死亡不就是那个反应体系从一种转变到另一种吗？人应当可以█对自己进行这种转变——必要时。”
//
//到底是被放在那个世界，在别人的意愿之下，作为那个自己不情愿成为的反应，还是在这个世界，随时熄灭随时被卷进旋流中？
//
//不知道。
//
//还是回到那个春日的上午，四周有风声吹拂，鸟鸣声。我一直站在那里，说服着自己去跳下去。最后，家中的宠物猫出来，从窗中走出来。
//
//这时我仍泣不成声。好像是的。
//
//它经常来这个窗台，妄想着能不能捕捉到那些鸟儿。但它这次是来我身边蹲着的。它显然是██████为我而来的。
//
//把它抱回窗内。但是当它毛发接触到手时，我就突然哭的更大声了。
//
//它又来。把它抱推回窗内。
//
//它再来，嗅闻着我的脚。决定不自杀，决定回去。给它添食，倒水，仍是哭着做的。
//
//听着楼上的钢琴好像在弹奏《あの日》。跟着哭着大唱起来。
//
//一会结束之后就变成《Nautilius》。不会唱，就不唱了。
//
//昨天十一点上床，到半夜时候好像听到了风声、鸟鸣声。很奇怪，那个层级怎么会有这样的声音。
//
//睡沉了。进入梦境。
//
//梦见我站着，四周一片模糊的黑夜。但马上意识到我在哪里——我家那个窗台。背后是书房的窗户，身旁有一列空调外机。
//
//身旁的空调外机在轰鸣着。5
//
//“只是个梦。”想着。想尽快逃出去。回身，试图开窗。未果。加力，未果。
//
//一拳砸在玻璃上，碰撞声，生疼。
//
//“不是个梦。”玻璃上已经留下两个手印。这才发现，玻璃上反射着黑蓝的幽光。
//
//这才开始慌张，认为进入了新的层级。仔细环顾四周，仍是黑夜。黑蓝的光中照耀着我对面的楼房。我开始回想，谁知便一发不可收拾。上面那个春日的上午，鸟鸣声，风声，全都进入脑中。突然地像漩涡在湖中瞬间创生。
//
//年少时那些被撕碎的梦想又被大脑拉出来，那些嘲笑的声音又响起来。不受控制地开始哭了。
//
//也许那些回忆确实幼稚可笑，但自己感觉它很可悲。那些梦想被现实一件件毁灭撕碎，最终难道不遗憾吗？
//
//哭地很大声，很自由。这是只有我一个人的梦境层级。随着我将一口气哭完，我的身子弯下去，我突然意识到下面是什么：星空。
//
//下为星空，取代了那地面。建筑物都浮在星空之中。星空灿烂，如潮，如漩，如发光的被照亮的尘。每个星都慢慢地向心地旋转着，如漩涡一般，而那旋转的中心漩底似乎有一颗空缺的星。
//
//俯视星空，它似乎加剧了悲伤的潮。于是我的哭声更大。
//
//随着我大声的哭出来，仿佛我又回到那个十六岁的上午，很多声音随之响起——
//
//《あの日》的钢琴声。
//
//“我很疑惑，那些被迫接受的错误为什么令人痛苦。”
//
//“被迫失去的梦想为什么让人失望。”
//
//“人就是一场化学反应。人应该能够以自己的轨迹活下去。”
//
//“あの日の痛しみせえ。あの日の苦しみせえ。”
//
//潮声。语言与歌的潮声。漩涡星漩的涡流声。风声，鸟鸣声。哭声。
//
//“只是一场梦。”
//
//说完就跟着唱了起来：
//
//“夢なら——どれ——よかっ——しよう。”
//
//促音变成了哽咽。
//
//歌声，哭声，掷入星漩。浮动于星漩中。星漩使人晕眩，但我似乎已经看到自己沉向星空。我哭着。
//
//继续俯视星漩。泪坠入消失。
//
//突然脚边有一种毛茸茸的感觉。猫来了……
//
//至少我当时第一反应如此。即使这个后室█████。即使有多么无尽的可能和刺骨的猜忌，我仍相信它是猫。
//
//我将它抱起，温暖得如常。它毛茸茸的。我又想哭了。
//
//突然有个想法：将年少的狂妄再演一遍。
//
//这又有什么关系呢。人应该有自己的自由。至少，在这个世界有。那个世界不知道。在这个世界，是有的。对。在后室中，人会有自由。
//
//至少能完成未完的愿望。至少能对人世再背叛一次。
//
//这是一个人的世界。而我并不孤独，有那些星漩中的星相伴。但是又似乎只有归入其行列，才能……
//
//即使星空是陷阱也在所不惜。因为我曾经——年少的疯狂过，我曾经——不是曾经了。现在。我现在只想再次，所谓的，结束生命。
//
//于是我抱着它向下跳。跳了下去。
//
//失重的飘忽与紧张，但只是生理现象。
//
//突然噤声。不知为何感到快乐。
//
//我感受到了星空的重力。
//
//我是那颗星漩最中央的，
//
//那颗未归的星。那是我。
//
//它不惊恐，不叫。
//
//泪水向上飘去。
//
//行将沉入星空。
//
//我将在万千星漩的最中央。我曾是未归的星。我已经踏上归途。
//
//在Level-1的一个角落我醒来。手中空了，没有它了。我或者说回到了这个所谓的现实，或许以上就是真正的梦，但不管，我已经实现了那时无知的愿望——可以这么说。
//
//直至记下梦境时，我的内心仍像漩涡一般。不可避免将这篇浸上悲伤。读者请见谅。
//
//我也没想到这篇日记会被接受为一个层级。如果有更多关于这个层级的线索，它的文档就不该是现在这样了，希望有线索时请尽快报告。
//
//Anothy Nebulous
//
//
//若此文本仍没有足够的证据支持成为层级，三个月后将会被暂时归档。
//M.E.G.数据库管理员
//
//作者信息
//« Level C-494 | Level C-495 | Level C-496 »
//
//Footnotes
//1. 错别字。原文如此。
//2. 这是病句，但原文如此。
//3. 原文如此。下同
//4. 字迹很潦草。认不清。
//5. 原文这一段是插入上下两段之间的。
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1495{}