//Level C-418
//评分: 
//+112
//+
//–
//X
// 
//
//生存难度：
//安全
//稳定
// 
//image.jpg
//Level C-418的外部入口。
//
//Level C-418是后室C层群的第418层。
//
//描述
//Level C-418为一商场，有稳定且强信号的WIFI，外部样貌可通过Level 11观察，其由涂满涂鸦的混凝土墙围起，商场被反光罩所覆盖，而周围摆满黄色集装箱1。当流浪者进入该层级之时便会感觉到一股怀旧的感觉，大多数流浪者称其仿佛“回到了2000年”。但层级内物品摆放十分混乱，墙皮、墙纸大部分已脱落，天花板摇摇欲坠，且部分格栅灯已损坏，所以在该层级时应时刻注意天花板，以免受天花板坠落造成的伤害。
//
//在Level C-418中无任何敌对实体，且所有实体都为该层级特有，虽然该层级已破败不堪，十分混乱，且设备和机器已经散落在层级内各处，但层级内的这些设施及商店仍照常运营，且无需花费任何货币，全部免费，并且该层级的实体也在继续执行自己的职务。而该层级中的迷路无面灵原本由其他层级切入至此，后在该层级定居。这些实体十分友好，请不要对其产生敌意。
//
//另外，Level C-418似乎曾有过流浪者在此地驻扎的痕迹，但据推测时间应已非常久远，暂未知这些流浪者为何选择离开该层级，或是因某种原因从该层级消失。但现在后室装修公司和红星建筑队的装修下，该层级大部分已变得完好如新。
//
//楼层
//同时，该层级拥有五层，以下便是根据缔造者遗留的设计图2所得知的每个楼层的功能。
//
//B1
//为该层级的大型超市，其中的商品限量供应，商品包括日常生活用品、计生用品、食品等。但目前大型超市的入口被废墟掩盖，该层级中的实体正配合流浪者进行废墟清理工作，并对B1层进行修复。
//
//F1
//为该层级的主要楼层，多数商店及餐厅位于该楼层，拥有多功能厅与仓库，并且住宿区的主要入口位于该楼层。餐厅与商店中的物品会定期限量供应，而商店的两次供应间隔较长，餐厅现已被红星建筑队改造为食堂，商店中的大部分物资如诺基亚3310、奔腾4CPU、Voodoo4显卡等常被流浪者一扫而空。
//
//现该楼层已被建设为该层级的枢纽，M.E.G.、后室装修公司及红星建筑队的基地设立于该楼层，并且在不同基地的协商下，于仓库进行了分区，用于存放物品，而多功能厅用于商讨会晤。
//
//F2
//包含洗浴中心、健身房、KTV、迪厅，有微笑服务员为流浪者提供搓澡、按摩等服务。KTV和迪厅中有稳定的酒水供应，而其中的曲目全部为2004年之前的曲目。
//
//F3
//为该层级的娱乐中心，包含网吧、电玩城、和游戏店。
//
//网吧中的电脑无法被破坏，所以大部分流浪者选择在F1的商店中获取电脑配件，而通过X光扫描得知该电脑的硬件仅支持拨号上网，尚且未知这些电脑如何连接的WIFI。
//
//在电玩城中可游玩街机，电玩城门口处每人每天可领取20枚游戏币，目前红星建造队正将散落的游戏机摆放到F1，并将游戏币收集起来供流浪者领取，但后室装修公司仍执着于将游戏机摆放于原位。
//
//而在游戏店中可获取如PS2、XBOX初代、GBA、N64等游戏主机，以及《半条命》、《生化危机》、《毁灭战士》、《暗黑破坏神》等游戏光碟。
//
//F4
//为该层级的电影院，拥有10个放映厅，并且限量供应爆米花和可乐，放映的电影多为2004年之前所拍摄。目前入口及该楼层的电梯已被B.N.T.G.封锁，需使用杏仁水作为进入的“门票”。该楼层现用于进行交易。
//
//实体
//鉴于此层级的环境特殊性，故做此列表列举此层级的特殊实体。
//
//分布楼层	实体名	特征及习性
//B1~F4	迷路无面灵	无面灵亚种，身穿休闲服饰，偶尔与娱乐设施互动，在楼层中漫无目的游荡。
//B1~F3	微笑服务员	笑魇亚种，身穿蓝色工作服，但无攻击性。分布在各楼层的餐厅，娱乐场所内。无偿为流浪者提供餐饮或娱乐服务。
//B1~F4	垃圾车	车兽亚种，外形与普通清洁车完全相同，不停行驶吸附垃圾3并保持此层级的洁净。
//F4	电影院员工无面灵	无面灵亚种，负责4楼电影院的秩序。会对在观看电影时不守秩序的流浪者，迷路无面灵给予警告，严重者会被传送出电影院。
//？	缔造者	此层级的建造者，超凡脱俗。
//基地、前哨与社区
//M.E.G.千禧家基地
//M.E.G.驻扎于此层级的中型基地，现有60人左右。
//主要工作为制作本层级的地图。
//调和其它社区，基地之间的关系。
//后室装修公司Y2000基地
//立志于将此层级的混乱布局重回秩序。例如，将散落在各楼层的游戏机收集并统一放置在3楼的游戏厅。
//现有60人左右。
//红星建造队千禧回忆基地
//立志于将本层级改造为更舒适且顺应的环境。例如，将散落在各楼层的游戏机摆放在方便游玩的1楼过道旁。
//现有65人左右。
//偶尔与Y2000基地发生口角。
//- 隐藏文本
//反正这个层级的快餐店的食品都是无限补货的，不如把它们改造的更方便人去取餐吧！——千禧回忆基地负责人，马毅农
//
//这就是你们把西式快餐店改造成食堂的原因？——Y2000基地负责人，智川高
//
//B.N.T.G.贸易式电影院
//霸占4楼的电影院，以杏仁水作为“门票”。
//开放贸易。
//与其他社区保持较良好的关系，但偶尔遭到流浪者的斥责。
//将电影院内部作为贸易物品中转站。
//入口与出口
//入口
//在Level 11寻找一栋外形为图片外部入口所示的建筑，切入此建筑可以来到该层级。
//在Level 31寻找一扇标明“Year 2000"的木门，进入此门可以来到该层级。
//在Level C-28寻找一栋拆迁状态下的大型娱乐中心，切入此建筑废墟可来到该层级。
//出口
//Level 11为稳定的双向出入口。
//Level 31同上。
//在电影院观看以下电影并陷入沉睡可来到以下层级。
//”寻乡记“	Level C-8
//”Dream Square“	Level C-38
//”进化之地“	Level C-460
//”老人与海“	Level C-33
//其它电影有待观测。
//
//
//
//
//　
//%E7%BC%94%E9%80%A0%E8%80%85
//　
//Level C-28的夜晚，寂静的可怕，这使得本就十分诡谲且怪异的这里显得更加令人不安。一名戴着兜帽的人坐在废墟旁的一级台阶上，叹息着，似乎非常彷徨。
//
//“你好啊，年轻人。”
//
//“哈，你好。”
//
//“不过，我或许也不是什么年轻人，或许。”
//
//“抱歉，不过，你为什么坐在这里？”
//
//“大概是想欣赏一下我的失败品吧。”
//
//“你得知道，每个人都会对自己付出心血的作品感到骄傲，因为这之中有自己的心血，同时也承载着回忆。”
//
//“赞同。”
//
//“没准我们是一路人。”
//
//……
//
//“给你讲个故事吧。”
//
//“曾经有个年轻人，妄想着做些什么，改变下这个操蛋的后室。”
//
//“这个年轻人想去创造一个可以给予困在这后室的人们希望与力量的层级。”
//
//“年轻人便着手做起了自己的工作。”
//
//“至少有理想。”
//
//“事与愿违。”
//
//“年轻人本以为这是他的杰作，但可惜，事与愿违。”
//
//“我已经非常尽力地想将那些回忆带给他们，并让他们拥有生的希望。”
//
//“结果我发现，是我太天真了，他们似乎并不在意什么生的希望，他们只是在苟延残喘。”
//
//“……”
//
//“你有烟吗？”
//
//你从口袋中拿出一包香烟，抽出一根，递了过去。掏出打火机，护着火，帮祂点上了烟。
//
//“说实话，我一直都以为自己是个超凡脱俗的人。”
//
//“但其实我什么都不是，在这后室之下我还仍是个渺小的个体。”
//
//“我没有能力，我仍在世俗之下。”
//
//“……”
//
//“在起初，他们确实感到十分怀念，并决定在这里久居。”
//
//“久而久之，他们便发现这回忆，非常短暂，而与此同时他们也获取了足够他们所需的物资，就离开了这里。”
//
//“过去了很久，都没有很多人再过来。”
//
//“我便创造了一些无面灵，让这里有了更多生气。”
//
//“尽管这些无面灵声称自己来自其他层级。”
//
//“我这么做只是想让已经为数不多的人留在这里，享受这里，仅此而已。”
//
//“失败乃人之常事，或许是他们没发现那些亮点。”
//
//“我不甘，这层级的寿命就如这给他们带来的回忆一样短暂。”
//
//“可我已经尽力了。”
//
//“2005年我便来到此处，我总想着做些什么。”
//
//“我真是个废物。”
//
//“……”
//
//“我发现那些承载的回忆，终究是留存在心中的。”
//
//“这才是回忆的永恒。”
//
//“……”
//
//“我想拆毁这一切。”
//
//“应该是这样的吧，但我相信，你的心血并不会付诸东流。”
//
//“正如你所说的那样，所引起的回忆十分短暂，但那心中的回忆永存。”
//
//“你就是那个超凡脱俗的人。”
//
//“你会成为的。”
//
//“你的努力或许并不会白费。”
//
//“哈，不用安慰我了。”
//
//“等到了未来你就明白了。”
//
//年轻人扭头望去，却发现身旁人已如泡影般消失。
//
//“再见，未来。”
//
//年轻人起身，将手中的几张图纸抛向那座废墟。
//
//“那么就留下这一切吧，作为永恒的回忆。”
//
//
//
//
//
//
//作者信息
//« Level C-417 | Level C-418 | Level C-419 »
//
//Footnotes
//1. 经探测集装箱内部为商场的电梯。
//2. 设计图在该层级不同角落中发现，其被散落到层级内各处。
//3. 似乎可以无限吸附垃圾，有关垃圾车如何处理垃圾的方法尚未有明确定论。
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1418{}