//Level C-408
//评分: 
//+22
//+
//–
//X
// 
//
//生存难度：
//
//等级 Ψ
//
//不安全
//不稳定
//精神危害
//Level C-408是后室C层群的第408层。
//
//描述
//Level C-408核心区域为一片直径约200千米的草地，构成草地的草本植物与“前厅”的草本植物类似但是最大生长高度不超过15厘米。草地中也包括一些没有找到源头的浅水洼，其中有清澈且无毒性的可饮用淡水。草地有轻微起伏但取大部分区域高度为标准值时最大起伏不超过0.5米，其上随机分布着大约4-50顶帐篷及数十个散落于草丛的箱子，没有记录到排列分布规则。这些物品可以被自由的移动或者带走但是层级会在日落和日出时进行补充。帐篷和箱子的款式是随机的但总是倾向于单人或者小型，不过也同样有观测到大型军用帐篷和大型集装箱的观察报告。
//
//离开核心区范围的区域由于Level C-408的特殊性质无法被确定，通过先行探索者的文字描述及组织内心理学家分析：该层及外层区域总是会形成一片没有可见危险的，能够有效激发人向前探索欲望的开阔景观。每一名该层级的探索者对于非核心区域的描述都不一致，根据多名探索者笔录总结表明外围区域仍然为大量草原和森林，这些场景围绕每个进入者的“指示物”形成一片完整景观。探索者在描述这些景观时经常用到“壮丽的”“美丽的”等带有夸耀开阔空间或大型建筑的积极词汇，同时根据每个人的“指示物”及探索喜好不同该层及外围区可能存在特殊区域。
//
//“指示物”是位于该层及外围区域极远处（通常描述为地平线上）的一片区域。总是为一个能有效激发目击者前往探索欲望的极为壮观的自然或人文景观。指事物的构成也同样会对外围区域的其他区域景观产生影响，例如一号指示物所属外围区域存在大量工厂外形景观，二号指示物所属区域存在同时代小型遗迹。目前已经有记录的“指示物”包括但远不限于
//
//从地平线上横跨整个天空的巨型钢铁环绕轨道，推测为行星轨道环
//一片巨大的罗马风格时代遗迹，规模极其庞大
//一棵根据描述有3000米以上的大形植物
//一大片酷似某层级的建筑群
//一座大型现代城市
//实体
//Level C-408核心区域几乎没有实体，经常有报告提及Level C-408在部分时刻会进入少量从外观和生理学意义上接近实体“悲尸”的人形实体（各个阶段都有目击），但这些实体并未表现出攻击性，他们的行动大多数仅是朝向一个随机方向移动直到离开核心区域。鉴于其行动方式，不建议探索者与Level C-408的此类实体进行接触。
//
//特殊效应
//Level C-408持续产生一种目前暂时被命名为“远行冲动”的特殊效应，该效应分为层级内和层级外两种不同的表现形式。层级内效应仅在受影响者进入该层及时生效，层级外效应在受影响者曾经前往过Level C-408或是知晓前往Level C-408的具体方式或Level C-408的特殊效应后生效。层级外效应分为不同等级，每一等级代表着进入Level C-408后能够不被层级内效应影响的时间。
//
//等级（层级内效应触发时间）层级外效应症状描述
//
//（一个月后）无明显症状。
//（一周以后）开始产生一些想要旅行的想法。
//（三天后）认为现实有些无聊，对于描述远方风景的作品产生浓厚兴趣，开始幻想美丽的远方风景，对于陌生物品产生不自然的好奇。
//（一天后）明显产生想要旅行的想法，难以忍受安于现状的生活，产生类似幽闭恐惧症的症状拒绝前往环境狭窄封闭的层级。
//（6-12小时）认为现实非常无聊，开始对于看到远方风景这件事产生极度痴迷，总是开始思考前往远方，夜晚会出现梦游症状。
//（1小时内）除了进食或睡眠时间难以坐下或休息，对于熟悉环境极度厌恶，对于陌生环境充满热情，非睡眠时间完全拒绝呆在非露天场所，如果可能的话试图前往Level C-408。
//（立即）立刻抛下一切不计代价的前往Level C-408。
//这些影响的等级会随着对象的精神状态变化而变化，总体呈现缓慢上升趋势。当对象在Level C-408有在意的人或事时影响等级上升速度会显著减慢，对象越是在意非Level C-408事物上升速度越慢甚至可能出现下降。反之若是对象缺少在意目标，尤其是对象处于在近期失去其在意目标时影响等级会快速上升。
//另一方面来说当对象处于和平稳定的环境或是放松的精神状态时影响等级上升较慢，反之当对象处于高压或恐惧时影响等级上升较快。除后室的自然环境产生的威胁外探索者社区内的不和谐例如言语威胁和孤立也同样会产生影响。
//最后一方面，处于经常能见识新鲜事物生活变化较大以及社区制度性不严的生活状态的对象影响等级上升速度较慢，制度性越明显日常生活重复性越高对象受到影响的上升速度越快。
//
//警告：这个心理影响似乎不被认为是心理危害，杏仁水对这种心理影响效应的作用并不明显
//
//层级内效应
//刚在层级内滞留时间超过对应影响等级时限后被影响者会产生一种难以抑制的冲动并试图立即前往Level C-408的外围区域。这个过程不可逆转，成功前往外围区域的对象从此被称为“迷失者”。他们中的大多数仍然有正常的思维能力，但是内心被完全想要去远方的想法占据，通常来说总是朝向他们的“指示物”前进，其中相当一部分仍然会持续在社交媒体上以文字形式分享他们的所见所闻。
//
//备注:Level C-408的特殊效应似乎在对人类影响中具有较高优先级。目前已经确认这一特性会影响由人类转化的个体，如果在转化后已经到达层级外影响等级6或以上则他们在完成转变后仍然会继续前往Level C-408。
//
//物资
//Level C-408的核心区域帐篷及箱子中可以发现大量生活资源，似乎都是为野营准备的版本，有更轻薄坚韧的包装，在这里甚至能找到带有迷彩花纹装饰的“野营专用”版杏仁水，这些地方也能找到大量野营装备和野外求生类的书籍，外围区域的任何资源无法被带入核心区域，也无法被带离Level C-408。
//
//基地、前哨与社区
//这个层级由于其特殊效应影响没有任何已知据点，但是由于其易于到达的特性和丰富的物资储备，有大量精神状态稳定的探索者们将这个层级作为物资补充和约定见面的地点。c层级民众自卫队尤其偏好在此层级会面，其中伍凌支队长甚至提出可以通过记录探索者在该层级所见来反向推断其心理状态，但是由于潜在精神影响威胁而被否决。
//
//入口与出口
//入口
//在其他层级中的书本中有时候会随机生成照片，照片上是Level C-408的核心区域景观（这是唯一一种在非Level C-408层级观测到的Level C-408的图片文件），将这些照片贴在墙上后撞向这面墙可以让你前往Level C-408
//在任何（有草地的）层级的草地上搭建从Level C-408带出的帐篷并进入其中可以将你带往Level C-408
//在 Level 10田野上漫无目的的游荡时有小概率被传送到Level C-408。
//根据不确定的说法，在Level C-68，发生环境变化到出现类似草原的景观时下车可以让你前往Level C-408（警告，该方式未经验证）。
//Level C-45有小概率存在一片林间空地，进入这片林间空地能将你传送至Level C-408
//出口
//在核心区域帐篷中过夜能将你传送到Level C-11的户外运动用品商店
//在草地上睡觉，你将在Level 10醒来
//有极小概率会从核心区边缘驶来一辆出租车，搭乘出租车将使你进入Level C-68
//上述入口也可以反向使用
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1408{}