//Level C-424
//评分: 
//+34
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
// 
//无有害实体
//Level C-424是后室C层群的第424层。
//
//描述：
//尽管诸位流浪者在进入Level C-424时所抵达的位置都不一致，但在经过后期的信息整合与具备地理学识的人员分析之后，发现当前已涉足的所有Level C-424区域基本都能与前厅的实际场景相对应。甚至已有多个流浪者在Level C-424内目击并进入了“纽约”、“开罗”、“重庆”等城市。
//
//但是，上述所有场景都荒废已久，而且相当一部分区域都表现为战后的废墟、也有部分地区早已被海量的绿植所覆盖。虽然Level C-424当下的环境状态远非生灵涂炭、甚至留存有大量的人类灾后生活痕迹，但是直到如今依然没能在Level C-424内找到哪怕一位人类/人形实体。
//
//虽然尚未完成全面性探索，但已可断定Level C-424的环境即为破败状态的前厅。
//
//不过正因如此，Level C-424内残存有数量可观的多种可回收物资，包括而不限于木材、石料以及金属1等等。鼓励各大流浪者个体/团体前往该层级拾荒。
//
//值得注意的是，Level C-424内居然完全不存在任何形式的文本（包括文字、数字、字母等）。所有书本、报纸、或是招牌等本应出现文本的地方皆是一片空白。
//
//photo-1589835509910-a7a9a03b76a9?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=974&q=80
//“巴别塔”外部。
//
//附录-文件更新：
//2022年5月6日，M.E.G.拾荒小队“越野车”在Level C-424内忽然远远地望见一座“高耸入云”的细长建筑。小队成员在靠近该建筑之后发现其为一座高塔。该塔仅在底部位置有着一扇颇为简陋的木门，除此之外没有任何出入口；其余部分更是被大量成分未知、无法破坏的金属层严密遮挡，坚不可摧。
//
//高塔的内部环境则极为混乱。整体而言，高塔内的设计貌似是一间朝着上方无限延伸的图书馆，因为其带有环环相绕的木质书架、螺旋楼梯、以及各楼层所统一配备的制式走廊与巨量桌椅；然而，书架上所摆放的不止书籍，还有报纸、纸箱、包装袋、乃至强行塞入的巨型广告牌等2多种杂乱物品。空中、地板、墙壁上也四下飞舞/散乱/张贴着海量写有文字的纸张，但语言不明。
//
//在高塔的第八层，“越野车”小队发现了一只半人形实体。该实体当时正伏于一张木桌之上，攥着一支钢笔奋笔疾书；小队成员们在谨慎地走近木桌之后，它才意识到有人接近，并抬头与小队队长对视数秒。紧接着，它撕下一张白纸，以工整的字迹写下“你好”，递给队长。
//
//随后的一段时间里，小队们逐步确认该实体不会说话，但不具备危险性，另性情温和，但非常偏执。根据后续与该实体展开的书面交流之结果，暂且将该塔命名为“巴别塔”。详见下文。
//
//实体交涉记录
//
//交涉对象：孔垩 - Level C-424独有实体
//
//交涉地点：Level C-424 - “巴别塔”
//
//交涉人员：程锐 - “越野车”小队队员
//
//前言：“孔垩”为实体自称。其为一只半孔雀状人形实体：它的面部被羽绒覆盖、嘴为喙形、指尖为鸟爪、且尾椎部分生有一簇尾羽足有数十米长的孔雀之尾。
//
//小队派出成员程锐与其试探性交涉，并由此发现孔垩口不能言，于是双方开始以书写的方式交流；以下交流原由书面记载，现整理如下。
//
//[记录开始]
//
//
//孔垩：你好。
//程锐：你好。请问你是没法说话吗？
//
//孔垩：是的。我不具备说话的能力。
//
//程锐：噢，我明白了。那么，请问如何称呼？
//
//孔垩：我有很多名字。但是它们不适用于你们的语言。就在我刚刚习得你们的语言时，我给自己取好了名字。用你们的语言。“孔垩”。
//
//程锐：很高兴认识你，孔垩。不过，我很好奇你说的“刚刚习得”是指？
//
//孔垩：这很明显。我刚刚才见到你们。不过学习一门语言五秒就够了。只需要看着它的眼睛。
//
//程锐：我想我知道你的意思了。你刚刚看着我们的队长，是在“学习我们的语言”？而你真就这么学会了？
//
//孔垩：正是。我可以通过纯粹的目光接触而抵达你们的心灵，从而学到你们的语言。还不熟练。我会慢慢熟练。
//
//程锐：那可真是种了不起的能力。
//
//孔垩：谢谢你的褒奖。我也很为它自豪。
//
//程锐：那么，请问我可以提些问题么？如你所见，我们在执行任务。
//
//孔垩：知无不言。
//
//程锐：这里是什么地方？
//
//（孔垩在誊写回答的开头时思量了许久，且数次涂改。）
//
//孔垩：他 她 它 祂为我打造的工作室。
//
//（孔垩似乎还想写什么。但是在漫长的沉思之后，它依然没有写下任何文字。）
//
//程锐：“祂”？祂是谁？
//
//孔垩：对不起。这是我搜肠刮肚之后，从你们的语言中搜索出的唯一正确人称代词。我已经尝试进一步的描述“祂”。但是我失败了，可能是因为我还不够熟练。你们或许可以问问别的事情。
//
//程锐：好吧。那么，你是什么人？你为什么在这里写东西？这座塔是做什么的？你刚刚的描述是“工作室”，那么你的“工作”又是指？你又对外面的世界了解多少？
//
//（孔垩看了看纸，飞快地写下一句回复。）
//
//孔垩：由于你的问题太多，所以我的回答会很慢。请给我足够的写作时间。
//
//（程锐点头，并开始等待。大约十分钟之后，孔垩写完了回答。在此过程中，孔垩多次意义不明的发颤，似乎在压制某种情绪。）
//
//孔垩：我是幸存者。我是世界的遗孤。
//
//他们曾在打架，成群的打架。他们彼此伤害。他们恶语伤人。他们不肯好好说话。他们自己杀死了自己。
//
//他们和你们很像，但你们不一样。你们的眼，你们的皮，你们的身，都和他们不一样。你们愿意和我好好说话，谢谢你们。
//
//我痛苦地思索，想要想出他们为何自尽的答案。漫长的思考之后，我终于找到了答案：他们语言不通。所以他们不能好好说话。所以他们开始打架。
//
//就在我想通的一瞬间，祂来了。祂为我造起这座高塔、为我取来了世上全部的文字、还给了我取之不尽用之不竭的笔与纸。刹那，我明白了我应该做什么。我本就掌握着这世上所有的语言，那我现在更应负起被我抛下的义务。我要转述翻译他们的每一段文字，彻底消除语言的隔阂。
//
//这就是我的工作，这就是我的生命。我在翻译。
//
//顺带一提，我很喜欢你们的语言。写起来很舒服。它很美，像画。
//
//（程锐阅毕，立刻向小队传阅，并引起讨论。后续的程锐发言多为全队共同安排。）
//
//程锐：你说的“打架”，是不是“战争”？“他们”指的是这个层世界的原住民？而且和我们长的很像？
//
//孔垩：噢，对不起。“战争”这个词汇的确更为贴切。我还在熟悉。
//
//是的。
//
//程锐：我们理解到的意思是这样的，你先看看对不对：外面本来一切都好，一直持续到有人发动战争。最终世界因此毁灭，无人幸免，除了你。然后你就住在“祂”造起的这座塔里，立志要把世界上的每一段文字翻译成世上的每一种语言？仅仅因为你觉得他们之所以打仗是因为他们语言不通？
//
//（孔垩神情仔细，似乎在努力理解每一个词语。）
//
//孔垩：（重重写下）对。
//
//（队员们面面相觑。）
//
//程锐：这里有多少种语言？
//
//孔垩：10462种。包括实体语言。
//
//程锐：冒昧地问一句，您忙活多久了？
//
//孔垩：时间没有意义。我明白我的余生都将花费在这项事业里。与其分心去计算那种毫无意义的数值，我还不如操心这一段应该如何在[无法录入的字符]语言中信达雅地呈现。
//
//（孔垩指了指它身旁的一个墨水瓶。瓶身标签覆盖有成堆的未知文字。）
//
//程锐：使用说明？
//
//孔垩：是的。还有广告词。
//
//程锐：这也有翻译的必要？
//
//孔垩：我说过了，我要翻译世上的每一段文字。每一段。
//
//（结合孔垩方才提及的“实体语言”以及所有事项，队长当即判断孔垩将在语言与实体交流方面展现无与伦比的价值。队长立刻命令程锐尝试说服孔垩离开Level C-424，并后续加以利用。）
//
//程锐：恕我直言，你真的觉得你的行为存在实际意义吗？
//
//孔垩：对不起，我不明白你的意思。
//
//程锐：退一万步讲，他们已经是过眼云烟了。你翻译完给谁看呢？
//
//孔垩：这是赎罪。我有着能让他们语言共通的能力，却没有去做，最终导致了他们的自尽。我在修行自己，也在惩罚自己。
//
//程锐：不好意思，刚刚忘了问这个：他们是“自尽”？
//
//孔垩：我们都是世界的孩子。我们都是世界的宠儿。我们本就是兄弟姐妹。难道他们不是在同室操戈？不是自己杀死了自己？不是自尽？
//
//程锐：我们明白你的意思了。但，你真的以为他们的冲突根源是“语言不通”吗？
//
//孔垩：难道不是吗？
//
//程锐：当然不是。
//
//孔垩：恕难认同。正因“语言不通”，所以“无法沟通”；正因“无法沟通”，所以“不能好好说话”；正因“不能好好说话”，所以矛盾迭起、彼此仇视，最终导致自尽。
//
//程锐：恕我直言，您的逻辑有问题。我现在大概弄懂您的意思了，但您有些……以偏概全。或许您话中的“不能好好说话”的的确确算是至关重要的一环；是的，我也认为很多矛盾与分歧都可以归罪于所谓的“不好好说话”。但它的根源绝非“语言不通”。就算语言一致，“不好好说话”的也大有人在啊！别说国家，哪怕是自家人，阴阳怪气、恶语相向的人也遍地都是啊！
//
//（孔垩读完之后，表情木然，久久没有动笔。程锐重新取过一张白纸，继续发话。）
//
//程锐：私认为，问题的根源从来就不在于什么“语言不通”。它到底在于什么，我想您应该清楚。
//
//孔垩：（缓慢写下）我不清楚。
//
//程锐：真的么？或许是一种固有的劣根性。只要“我们”存在，争端就是无穷无尽的。我还是想这样说：语言一致都尚且能吵起来乃至打起来，所以关语言什么事？只要愿意，人们从来就可以友好沟通。但有人不愿意。
//
//争端的根源从来就不在语言。巴别塔的废弃亦然。
//
//孔垩：巴别塔？
//
//程锐：噢，是我们那边的一个神话。简单来说就是人类尝试建起一座通天的高塔，也就是巴别塔。而此等神迹惊动了神明，祂为了扰乱人类，就创造出了多种语言。人们因为无法沟通，巴别塔最终废弃。在我个人的感想里，巴别塔从来就不是因为语言而前功尽弃。
//
//孔垩：不，就是！
//
//程锐：啊？
//
//孔垩：（发颤）你们休想动摇我的信念！我愿意和你们坦诚相待，但是前提是你们没有侮辱我的事业！你们若是继续质疑我的工作，休要怪我不留情面！
//
//你们并非第一个见我的，也并非第一个惹我的。（字迹极重）我 不 想 再 动 手。
//
//程锐：抱歉，无意冒犯。我只是想说，您或许可以在更有意义的地方发挥更多的优势！
//
//孔垩：这里就是最、有、意、义的！停止你的煽动！最后警告。
//
//程锐：对不起，我道歉。请不要发怒。
//
//孔垩：我也提前道歉。但我需要时间冷静。你们可以先去四处看看。别踩脏了我的纸。
//
//[记录结束]
//
//后记：“越野车”小队没敢继续贸然惊动孔垩，而是在塔内四处勘探了数小时，没有其他发现。返回基地之后，有关部门针对此次交涉记录而将该塔暂时命名为“巴别塔”。
//
//基地、前哨和社区
//M.E.G. - C424号前哨
//正在逐渐扩建。有望发展为基地。
//主要负责采集Level C-424内的可回收资源。
//持续战略性驱赶或是联合其他团体。具体方针需视后者立场而定。
//入口与出口：
//入口：
//穿越Level C-439内的一扇旧门、旧窗、旧水管、或是任何通俗意义上的“通道”。只要后者处于破败、陈旧状态即有几率抵达本层级。
//更多入口尚待探查。
//出口：
//与入口恰好相反：只要在Level C-424内发现某种与周遭环境格格不入的“崭新通道”，那么穿越后者即可原路返回。
//更多出口尚待探查。
//作者信息
//« Level C-423 | Level C-424 | Level C-425 »
//
//Footnotes
//1. 在诸如商店类的建筑内部往往可以发现大量食品，但由于已经基本变质而不建议回收。不过，食品当中有几率出现并不会变质的罐装龙肉。
//2. 唯一的共同点是：它们绝对携有文本。尽管它们所使用的语言全部无法辨认。
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1424{}