//Level C-450
//评分: 
//+9
//+
//–
//X
// 
//
//生存难度：
//等级 4
//
// 
// 
// 
//Level C-450是后室C层群的第450层。首次在2012年5月25日发现。
//
//描述:
//Level C-450 类似于前厅的城市，与此不同的是，该层级永远处于午夜12点，而且没有任何方法下楼，流浪者只能在天台与室内房间活动。当有人在Level C-450的高楼跳下去时，大概率会被如潮水般涌来的猎犬分尸。
//
//O6FMin.jpg
//该层级图片。
//
//在该层级里，楼与楼之间活动最快的方法是利用钩爪或者滑索，据当地居民描述，滑索是该层级最快的“交通工具”，只不过安装十分的麻烦。在楼顶上能看到许多滑索，这些滑索都是人为放置的，以供于居民快速的在楼与楼之间穿梭。这些滑索在楼顶上行进的时候是不断变化着的。如果你想要在楼与楼之间穿梭的话，那就必须先学习一下滑索的规律，这样才能够在不同的时候达到不同的效果。当然，滑索的使用还需要一点耐心。
//
//Level C-450任何的门都是可以打开的，但不建议您那么做，窗户，猎犬，肢团都是有可能出现的，但是也有许多已经人为探索过的房间，他们很大一部分一定是绝对安全的。
//
//杏仁水房
//当你走到该层级的一扇门前闻到一股浓郁的杏仁水味的时候，那一定是到杏仁水房了，这里是本层级居民的主要食物来源，该房间里的杏仁水取之不尽，用之不竭，每当拿走一瓶杏仁水它都会在三十分钟之内以未知的方式恢复回来，虽然我们尚未知道原理。
//
//O6iu36.jpg
//一位流浪者在该大楼走廊时拍的照片。
//
//■之地
//这栋楼十分的危险，在进入时候脑头会一阵眩晕然后倒地不起，在醒来时眼睛就会开始模糊，到最后看东西图像都是扭曲的，混乱的，甚至是恐惧的。如果执意要接着往前走会有严重的噪音污染可能致使脑袋爆炸，最后死亡。它的主体建筑外表是一个圆形的建筑，墙壁是黑色的，上面画满了奇怪的花纹，门口还有一条长长的铁链，铁链直接延伸到地下，门上贴满了符咒和各种奇奇怪怪的符号，铁链的另一端则系在墙的一侧，如果你要进入这个大楼必须要先将铁链解开，否则会触碰到这些符咒和符文，会发生不幸的事情，最后死亡。
//
//曙光电视塔是该层级最大的建筑，有2000多人，多年以来他们一直在寻找逃出该层级的方法。曙光电视塔的1-25楼是非常危险的，不建议前往，那里已经被实体占领，25层以上是十分安全的，那里部署着MEG的武装力量。
//
//O6lfHI.jpg
//曙光电视塔。
//
//基地、前哨和社区
//M.E.G前哨站：
//
//开放贸易。
//人数有200人。
//为流浪者提供帮助。
//发财树圣教：
//一个奇怪的宗教，他们主要在曙光电视台35层活动 ，在活动时候他们会一直默念“发财树，绿植，
//毛巾，筷子，汤圆，瓜子，糖饼，苹果，火龙果，橘子
//生菜，芹菜，蒜苗，葱”，没人知道这些是什么意思。
//
//入口和出口：
//入口
//在Level 11做出未知的行为有概率到达。
//
//当你觉得生活无望，前途无光。从高楼上跳下去，你将会来到这里。
//
//出口
//据说从高楼跳下去有小概率来到Level C-387，但是很危险且尚未证实，不建议这么做。
//
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1450{}