//Level C-474
//评分: 
//+35
//+
//–
//X
//检视历史版本58新增内容：
//我很倒霉，居然切入了两次Level C-474——如果不是层级定位系统的提示，我死也不会相信上回来过的那个充斥血色液体的食堂居然会变成一片看不到边界的森林。
//
//我不想回忆那两次切入，那简直就是阴影。但如果M.E.G.要给这个层级取名，我会建议它叫“ 狗屎的后室
//Fucking Backrooms
// ”，真诚的。
//
//检视历史版本57新增内容：
//提示：自动语音转文字已开启
//
//前天晚上我好不容易刚找到一瓶能喝的酒，结果一醒来就躺在这鬼地方，也不知道是不是我耍了酒疯。
//
//我不知道该干什么，这地方伸手不见五指，没走两步我就差点被一个捕兽夹咬了小腿——幸亏我反应够快。我看到林影之间有团像极了磷火一样暗淡且诡异的绿光，它远远的藏在成团绿叶的后面——见鬼，我切出之后才知道那是M.E.G.的前哨——我吓得夺路而逃，天知道路上究竟踩了几个老鼠夹子和弹簧圈。
//
//我已经不记得我跑了多久了，等到回过神来，我的脚上已经都是那些陷阱造成的伤口。我刚想扯掉布条处理下出血，但没想到手臂和埋在冰块里冻了一晚上了一样无法动弹，身体的其他部位也是，就像是失温症。
//
//我想躺下，但没想到我的脚突然狠狠地往一个捕鼠夹踩去，疼痛让我清醒，手脚却不听我指挥。我有时鼓掌大笑，有时又跳起舞来，有时候还拿脸撞树。我甚至能感到一个个陌生至极的想法萌发——像是人偶？不，比木偶还木偶。我以为那就是鬼上身，但是现在我更宁愿相信那是种不情愿的操控——它控制身体，入侵思想——不，这太他妈 荒诞
//Pataphysics
// 了，一定是那层级的影响还挥之不去。
//
//感谢生神，它又救了我一命。
//
//检视历史版本56新增内容：
//jery.jpg
//赞美，鹦主杰瑞！
//
//编号：Level C-474
//
//等级：Drygioni1
//
//逗你们玩的，感谢我主杰瑞让我摆脱这个该死的层级困境！我为我在那层级所做出的亵渎行为忏悔，此非我本意，愿主慈悲。
//
//另外，托我主圣言，代为转告：
//
//“臭写█的，关我鸟事，你搞串台了！”
//
//显示更多……
//
// 
//
//生存难度：
//变换的
//见鬼的
//操他妈的
//Level C-474是后室C层群的第474层。这地方简直有毛病。
//
//特殊切出方式
//Special Convenient Passway
// ：如果你不幸切入Level C-474，请不要慌张，因为慌也没用。Level C-474的层级状态会不定期变换，我们将尽力保证及时更新。以下是最新且可用的切出方法：
//
//如果你手上还有诺克立普贴，马上用掉（长期推荐）。
//如果没有，请尽快寻找就近水源（不是小水坑），并按以下顺序操作（推荐）：
//找到并抓住水源中任意动物（例如，鱼、虾、扇贝）。
//吃下去，你将切入Level C-353
//找到一间破烂的徽派中式房屋，进门右转打开灶台上的铁锅，吃下一盘长了眼珠子的肉酱意大利面2（趁它没飞起来，要快），你将切入Level C-343（推荐）。
//若你进入该层级已超过30分钟，建议自杀去见生神（长期推荐）。
//如果你在此层级睡着，有概率切入一个生存难度等级为5的层级（不推荐）。
//如果你正好遇上Level C-474变换层级状态，你将在层级状态变换后切入Level C-1的任意叠加层（不推荐）。
//等待更新
//如果你发现了新的切出方式，请告知我们fukinglevelc474@meg.com。
//
//描述（最新）
//Level C-474是一个有些零散建筑分布的丘陵地带，几乎全部区域都覆盖着雨林，但是除了水源外没有其他任何地方有正常生物出现。该层级内有稳定的Wi-Fi。
//
//Forest.jpg
//经过曝光处理的Level C-474图像
//
//Level C-474内只存在黑夜，夜空的光照状态会在类似前厅夜晚9时至凌晨3时之间循环。Level C-474的夜空中几乎没有可见的星星，偶尔能在天空的角落看到一个亮度极低的星星，但也会很快消失。
//
//该层级的实体非常少见，除了偶尔能在天空中看见飞过的一两只无足鸟，只有异人会在此出没（详见下文）。
//
//Level C-474内有很多类似捕兽陷阱的装置3，它们密集的分布在Level C-474的各个角落。有些陷阱只会让流浪者感到瘙痒，但有些则能够造成相当程度的伤害甚至致死。不同杀伤程度的陷阱出现的概率也各不相同，按杀伤程度从小到大呈正态分布趋势。由于Level C-474内自然光照条件极差，因此务必小心行走，谨防触发陷阱。
//
//最重要的是，在流浪者切入Level C-474后，会逐渐感觉行动困难、肢体不受控。在进入层级的前15分钟时，流浪者尚能行动自如；在15至30分钟内，流浪者会从感到一定的行动阻力，且会出现不属于自身思想的想法或念头；30分钟后，流浪者的肢体动作将受到较大阻力，随着时间的推移开始做出违背自身意愿的行为，并且不属于自身思想的想法将频繁出现，有流浪者甚至报告了严重的幻听现象。但在此期间，流浪者不会失去对外界的感知能力。
//
//失去自身控制能力的流浪者将会被迫做出一些难以理解的、滑稽的动作，这些动作将可能导致流浪者触发周边存在的陷阱。除此之外，绝大多数进入此层级的流浪者会感受到一种被“殴打”的幻痛，这种痛觉通常在进入层级的第十分钟开始表露，并随着时间推移逐渐变得强烈。一开始流浪者只会感觉到类似“被人轻轻顶撞或推搡”的感觉，最后这种幻痛将逐渐发展到“被扇巴掌的感觉”、“被拳击”、“被人用敲蒙棍”甚至是“被人猛击睾丸”或者类似“被车撞倒并碾压”的感觉。这种幻觉将持续存在，并且发作毫无规律，它会持续折磨流浪者直到其切出该层级。但部分流浪者在切出Level C-474仍然会偶尔发作，原因尚且未知。
//
//此外，这个讨人厌的层级还有着类似温柔地狱的性质，进入该层级的流浪者会看到或被迫做出各种令他烦躁的事情。例如，杰瑞的信徒将产生严重的幻觉，他们会看到能够口吐人言的风信子金刚鹦鹉被各种各样的手法折磨虐待，最终被做成某种鸟类料理送到自己面前。虽然由于杰瑞的影响，信徒并不会丧失信仰，但仍会陷入一段时间的疯癫状态；而失落一族的成员在进入Level C-474后，则通常会被迫地从地上捡起不知道哪来的电子设备、现代机械、或者一些时尚衣物，然后在被操纵的情况下眼睁睁的看着自己使用这些物品，甚至不由自主地做出猥琐而滑稽的表情，这种事情通常会使得失落一族的成员感到崩溃，即使他们有幸切出Level C-474，也无一例外的会陷入自闭情绪无法自拔。
//
//更要命的是，即使流浪者逃出Level C-474，他们也会留下一种严重的无法治疗后遗症，这种病症被认为具有遗传性和微弱的感染力，尽管它不会造成任何不适。但这种后遗症会让流浪者无法看清层级档案，或在阅览档案时产生幻觉，具体的几种症状如下：
//
//出入口信息缺失——在感染病症的流浪者眼中，层级档案的出入口信息永远是不完整的。一个完整的，拥有几百数千个字的层级出入口信息在他们眼中只剩短短的三两行字，并且有些还是旧版的错误信息。
//莫名出现的奇怪警告——一些被感染的流浪者在阅览各个团体数据库时，总是会看见一些类似“权限警告”的提示，这些提示通常有些非常吓人的言辞，要求流浪者退出页面，否则会被“追杀”或者“立刻死亡”。但事实上，这些警告从未存在。
//充满谬误的档案信息——在他们眼中，原本的档案数据将遭到一定程度的修改，这些修改的重点集中在数据和概率方面，比如精确到小数点后十位的层级切入概率、标有类似6亿平方英里这样极其夸张的数据、有些十几二十万人口的层级基地等等。这些数据都是完全谬误的，并且根本不可能存在或被证实。
//实体
//少量异人
//通常他们不会结对出现，并且数量不多，很难遇见。这些异人一般只会远远地观望流浪者的行动，在流浪者的视角下就像是“森林里一闪而过的野人”。
//鬼知道他们是怎么活下来的，反正他们就是活下来了，并且不知道住了多久。
//别指望向他们寻求帮助。
//基地
//M.E.G.无人前哨
//一个工作人员都没有的基地。它位于一个较高的丘陵山头，且距离流浪者通常切入本层级时的所在地非常近。前哨的屋顶涂有绿色荧光材料，它们非常显眼。
//该前哨站点内贮存有一定量的生存必须物资（通常用不到，因为流浪者需要尽快切出）、一个接通M.E.G.通讯频道的求援传呼机，以及切出该层级所必须的物品，全部放在一个箱子。这些物品里由曾经误入此地的M.E.G.救援团队留下，目前物资剩余未知。
//前哨的保险箱（没上锁）里存放有一本密码本，上面记载了一个M.E.G.档案库记录员的账号，有且仅有本层级文档的编辑权限。如果你在切入此层级时身边存有电子设备，并发现了记录外的状况，请用此账号对本档案进行编辑。
//切入与切出
//切入
//切入Level C-474的方式一直飘忽不定，复现其他流浪者的切入经历的行为通常不会有任何效果。但在流浪者的报告中，他们多数都提到了在切入前有过类似“骂街”的行为——通常是对后室本身或者某些位于后室之上的抽象实体进行辱骂4。
//据说这个层级会主动引诱流浪者进入，比如在半夜里让流浪者梦到大一桶的食物、安全的住所、整齐的装备，以此吸引流浪者，而梦见这些的流浪者则会因为求而不得陷入暴躁的情绪。尽管这些说法尚未被证实，但它们作为某种“都市传说”在流浪者之间广泛流传。
//切出
//见上
//作者信息
//« Level C-473 | Level C-474 | Level C-475 »
//
//
//Footnotes
//1. 注：目前正在接受监督者团队的正式调查，以确定其真伪。
//2. 必须是 长形意大利面
//Pasta Lunga
// ，不可以是 通心粉
//Macaroni
// 、 螺旋面
//Fusilli
// 或者 千层面
//Lasagna
// ，不，粉条和 蠕动意面
//Creepy Pasta
// 也不行。它们只会让你食物中毒。
//3. 有时候也会出现诡雷、反步兵地雷之类的物品和装置，或者干脆只是一本顶着《花花公子》的R18色情封面但是翻开后全是冷笑话的劣质杂志。
//4. 通常的表现类似有，“后室这种鬼东西是哪个屌毛搞出来的？我操你妈！”
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1474{}