//Level C-433
//评分: 
//+23
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
//样态多变
// 
//002%20%E2%80%9C%E8%8A%A6%E8%8B%87%E8%8D%A1%E2%80%9D.jpg
//在记录002“芦苇荡”中流浪者于终点前所摄照片
//
//Level C-433是后室C层群的第433层。
//
//描述
//Level C-433是一条约长800m的走廊，每一个切入该层级的流浪者都将出现在走廊的一端。走廊另一端摆有一纯白色大理石质地的，高约1.2m的石雕讲台，以红绸布覆盖。台上摆有一本厚约250页的书以及一支白色羽毛笔。书上写满了大量的词语，且词语的语种将随该流浪者的母语而改变；封皮是皮革制的，上面写有烫金字体“请把梦一直做下去”。羽毛笔的笔迹为蓝紫色，且因未知原因不会断墨。该层级内的物品无法破坏，推测是由于该层级的异常特性所致。
//
//流浪者进入该层级后，层级异常性质会立刻作用于流浪者自身。大致体现为：
//
//除视力外身体其余感觉器官的感知能力略有下降，但将体现出正常人类所具有的视力水准1；
//对自身除颈部以上部位外的其余部位感知力变差，通常会忽略它们的存在，除非刻意去观测；
//感到一种较为强烈的不真实感，被描述为“感觉自己像是在做梦”；
//无法控制腰部以下部位，且将不自主地以较为缓慢的步伐向走廊的另一端笔直行进2。
//在进入层级的同时，层级的样貌会迅速变化。目前的报告中大多提到，走廊的边界将会消失，展现出一片看似无限而渺远的空间，同时空间中将出现大量奇幻的、与现实差距较大的景物。报告称，观测这些景物将使人感到舒缓、平静。触碰这些景物，或靠近远端的景物是难以进行的，因为流浪者正持续处在不自主缓慢移动的过程中，且通常会沉浸于对景物的观测而因层级异常性质忘记自身双手等其余部位的存在3。
//
//在行走约800米后，流浪者眼前的景象将呈烟雾状散去，同时其自身感到的异常性质也会减弱，流浪者将随即发现他们已抵达石雕讲台前。同时，书上所有词语中将会有一个被蓝紫色笔迹圈画过的词语缓慢化作黑色的烟尘飘散消失。观测报告称这一飘散的词语通常与流浪者刚才目睹的景象有关，它常常能概括刚才的景象或被认为是刚才景象的一个大致主题。随后，流浪者需要执羽毛笔在书上剩余的词语中选择一个并圈画4，然后他们会发现自己已经离开Level C-433回到原层级。
//
//借由目前的探索报告，可以推测该层级同一时间内仅容纳一名流浪者进入，而流浪者在终点处所圈画的词语将会成为下一个进入该层级的流浪者所看到的景象的主题。暂且没有流浪者重复进入Level C-433的记录。
//
//探索记录
//此处展示一部分此层级的探索记录，据信它们形成了一条传递链。
//
//记录编号001
//景象主题词语：鲸
//层级景象：一片由蘑菇构成的森林，其间具有一条笔直的道路供流浪者行走；大部分蘑菇的高度目测在3m左右，而其余蘑菇约高10~20cm，穿插在大型蘑菇之间。目光的远方似乎有更加硕大，高度数倍于周围大型蘑菇的巨型蘑菇，以更分散的方式排布。一只体型巨大，难以分辨具体物种的须鲸（Balaenoptera）科动物以缓慢的速度在远方的巨型蘑菇中游弋，并周期性地靠近流浪者，绕行一周后返回巨型蘑菇林。所有蘑菇的菌盖上表和须鲸的体表都有着一种类似星空的材质，呈粉紫色，包含大量光点；天空呈紫色，在下端向青绿色渐变。场景中不存在单一主光源，但亮度充足。
//流浪者圈画词语：芦苇荡
//
//记录编号002
//景象主题词语：芦苇荡
//层级景象：时间似乎在夕阳刚刚落下的傍晚，地面为一片广袤的水域，流浪者在水面上笔直行走。水面上靠近流浪者所行道路的地方簇生有大量的芦苇，且似是被风吹动一般缓慢摇曳5。水面上芦苇丛之外的部分漂浮着大量球形的浮灯，大小不一，球径约在5~20cm。随着流浪者的步行，层级呈现的时间从傍晚开始前移，逐渐展现出夕阳与午后的景象；浮灯也随之变换颜色，从一开始的粉色，在夕阳时变化为橙色，并于午后变化为白色，且所有的浮灯都以高于流浪者的速率向前方漂流。在流浪者即将抵达终点时，前方的道路被芦苇丛挡住，而所有的白色浮灯进入水面上太阳的反光之中并缓慢地沉没、融化，使反光变得更为强烈，近乎难以直视。
//流浪者圈画词语：星轨
//
//记录编号003
//景象主题词语：星轨
//层级景象：时间为深夜，地面为一片反射率较高的，平整如镜的水面。前方的极远处有一灯塔，于其上存在一点光源；以该点光源为圆心，在视野前方的夜空中存在大量呈同心圆的白色轨迹，每一条轨迹上都有一颗星星缓慢沿其移动。夜空的其余部分展现出绿色的极光。同时随着流浪者的移动，在流浪者的前方不断有亮度较大的白色光点从水面跃出，自流浪者行走路径的一侧跃向另一侧，留下不会消失的白色发光轨迹。这些轨迹都为圆弧（半圆或劣弧） ，大小不一，互相交错，为流浪者所行走的道路塑造了一条近似于拱廊的结构。在流浪者路途的终点处，从左侧同时等距向右侧跃出五个白色光点，其轨迹呈现同心半圆弧状以隔断路径。
//流浪者圈画词语：城堡
//
//更多记录参见下方
//
//- 收起记录
//记录编号004
//景象主题词语：城堡
//层级景象：流浪者于高空中一条由浓厚的白云所构筑而成的路径上行走，其周边可见更多的云彩漂浮。在流浪者的上方同样有着浓厚的云层，云层中可见一巨大的，倒置的欧式城堡若隐若现。城堡大体呈白色，有着大量的尖顶圆柱体塔楼刺破云层而垂到流浪者所处路径的两侧。塔楼顶的瓦片为湖蓝色，且窗户全部为彩窗。彩窗上的图案多为抽象且多彩的。层级内部充满着明媚的，近似下午的浅黄色阳光，使云层与城堡塔楼壁皆被温暖的淡黄色所覆盖；阳光穿过彩窗，折射出大量彩色的光芒映在云以及其他塔楼上。漂浮的云彩整体逆着流浪者的前进方向缓慢行进。
//流浪者圈画词语：森林
//
//记录编号005、
//景象主题词语：森林
//层级景象：流浪者身处的是一片草原，四周没有任何树木，且似乎是阴天。但层级的天空上悬浮着无数巨大的树木，它的树根蜷曲着垂下来，一直到了离地大约五十米的位置。在云雾生成的地点，树木的这些根须组合在一起，并且渐渐消掩于平铺的云层间。而在云层的上方，则又是树干分出树枝，向上伸展出去。最后在蓝色的天幕里，隐约可以见到青蓝色树叶轻轻摇曳露下的阳光。
//流浪者圈画词语：房间
//
//记录编号006
//景象主题词语：房间
//层级景象：流浪者位于一处超巨大的封闭空间内，其中以普通的放置方式摆放有正常比例放大数十倍的各种床，书桌和衣柜等家具。流浪者以位于空间角落的书桌桌脚处笔直向另一角落的位于空间墙壁处的正常比例放大数十倍的木门移动，木门开有一道较大的门缝，可以听见外面传来的奔跑声和孩童嬉戏的笑声。大部分家具由于高度原因无法看见其上方的内容物，而房间地面随意散落有大量巨大的儿童玩具以及类似食物碎屑的物品，这些碎屑的其中有许多类似于蚂蚁的大型生物在移动，尽管流浪者从他们之间穿行而过，他们也没有对流浪者做出明显反应。位于书桌一侧的墙壁有一个巨大的窗户，室外射入了温暖的阳光。在流浪者移动至房间中央的空阔地带时，位于正上方天花板的吊灯上落下了一只泰迪熊，最终掉落于流浪者附近的床上，位于视线外无法观察到。
//流浪者圈画词语：减速
//
//记录编号007
//景象主题词语：减速
//层级景象：流浪者位于一条无限延伸的高速公路上，四周是一望无际的大草原。层级内的阳光被描述为“略带金黄且有几分金属质感的”，在它的照耀下，层级中的景物显出金属般冰冷且耀眼的光泽。层级内的时间似乎为黄昏时分，天气为多云，湛蓝的天空中铺着细碎斑驳的云块，在狂风的吹拂下飞快地向流浪者身后翻涌飞驰，宛如一场银白色的海啸。公路两旁整齐地分布着许多路牌，路牌上画着指向流浪者身后的箭头，流浪者脚下的公路也并没有画道路交通标线，取而代之的是无数同样的箭头。当流浪者向前行进时，公路上的箭头和绘有箭头的路牌均会缓慢地向流浪者身后移动，再加上迎面吹来的风和天上翻滚的云海，流浪者将产生一种“自己前进得很艰难”、“行进的速度越来越慢”的错觉。在地平线的尽头矗立着一台巨大的老式显像管电视，其显示屏上交替出现两段画面，分别是一张红色的微笑emoji，以及一张留着八字胡的男性嘴部特写。该电视反复播放着一首City pop风格的电子舞曲，其音质较差且多有卡顿，曲中仅包含两句不断重复的歌词，即“Stay here, my little boy.”以及"Move your body, and clap your hands."。尚不知其有何深意。
//流浪者圈画词语：天堂
//
//若您有关于此层级的记录想要添加于此，请于这句话的上方加入您的编辑。
//
//请复制如下格式进行编辑：
//> **记录编号XXX**
//> **景象主题词语：**【上一份记录的圈画词语】
//> **层级景象：**【按照主题词语编写您进入此层级时所见的景象，不要太短】
//> **流浪者圈画词语：**【写一个词语以传递给下一份记录】
//
//请您留意本层级的性质：
//
//您在此层级观测的景象应是非现实的，尽量把它描述得与”梦境“相似；
//您所观测的景象，应该与主题词有直接或间接的关联；
//您所看到的景象应是美好的、令人安心的，请不要声称您看到了一些扭曲恐怖的东西；
//您传递给下一棒的词语也应该是有创作空间的，且不要太过负面。
//依照此层级的性质，您不太可能触摸到景物，而且同一位用户最好不要上传多个观测记录；
//另外，
//
//若您认为上一个流浪者圈画的词语不是您想要创作的，也可以另起炉灶以一个新的主题词进行创作（最好不要这么做），但是记录编号应该往后挪几个数值，因为它与上一个记录不是连续的；
//原作者可能会对您的记录稍加修改或移除明显违和/劣质的记录，请您见谅；
//编辑完您的记录后，请到作者信息页署名。
//请不要擅自编辑其余的记录。
//感谢您对本合作文档做出的贡献。欢迎您参与传递您的梦。
//
//- 收起记录
//基地、前哨与社区
//由于性质特殊，该层级没有已知的基地、前哨或社区。
//
//入口与出口
//入口
//在Level 11、Level C-34、Level C-271、Level C-490（已失效）等层级中入眠并做梦，有极小概率在睡眠过程中进入此层级并在其中醒来6。尚未知晓其他层级是否具此性质。
//
//出口
//走完走廊的全程并于书上圈画一个词语即可回到原层级，且大概率会继续先前的睡眠。
//未知切出在此层级的可行性；目前推断为不可行，且在受此层级异常性质影响期间尝试切出是基本不可能成功的。
//作者信息
//« Level C-432 | Level C-433 | Level C-434 »
//
//Footnotes
//1. 目前尚且没有盲人进入此层级的记录
//2. 由于残疾等原因做不到这一动作的流浪者将以他们惯常移动的方式执行此动作；有全身瘫痪的流浪者在此层级中凭空漂浮以进行移动的记录
//3. 即使如此，摄像设备依旧可用且流浪者可以对景物进行摄影，在有此念的时候这一异常性质会稍有弱化
//4. 对于全身瘫痪或手部残疾的流浪者，羽毛笔会自行帮助他们圈画想要圈画的词语
//5. 即使流浪者没有感受到风
//6. 使用好梦罐做梦时还没有成功进入此层级的记录
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1433{}