//Level C-444
//评分: 
//+77
//+
//–
//X
//你曾经坚信人类凭借着自己的聪明才智，是站在食物链顶端的动物；然而在这里，在后室的这个层级，人类是妥妥的猎物。
//
//你在黑暗中惊慌失措地奔跑着。这绝对是你这辈子跑得最快的一次，但是身后的实体掠过树林而发出的沙沙声仍然不绝于耳，而且声音还在越来越响。你回头向后看去，瞪着巨大双眼的头颅饥渴地望向你。它张开大嘴，发出意义不明的嚎叫。你不顾一切地将子弹上膛，朝着背后胡乱打出一枪。你记得自己扣动了三下扳机，但是枪只响了一下。你相信自己的枪一定是哑火了，于是胡乱地往身上四处摸索，但什么都没找到。
//
//你只剩下一发子弹了，而你刚才已经把它打了出去。
//
// 
//
//生存难度：
//等级 4
//
// 
//稳定
// 
//540E6943-CB4A-473C-B584-29CCFE8DDFA7.jpeg
//Level C-444内部的景象。
//
//Level C-444是后室C层群的第444层。
//
//描述
//Level C-444是一片森林，当前尚未探知其是否有尽头。该层级中的树木种类较为繁多，但是主要以高大的杉树为主。除去森林以外，该层级的植被主要为灌木和蕨类植物。在有些情况下，也能在该层级的密集植被中找到松鼠，野兔，松鸦，杜鹃等小型哺乳类动物和鸟类动物，除去具有能够长期在这一无足够光亮的层级生存并保持种族规模的能力值得探讨以外，目前并未探知这些常见的森林动物有何值得注意的反常现象，因此，它们亦可以作为流浪者们在该层级的食物补充。
//
//Level C-444的气象始终保持在黑夜状态，有时也会起雾；其可见度一般在1.5米之内，这通常会导致流浪者在该层级中迷失方向。目前尚不清楚该层级中的植被是如何在缺少阳光的情况下保持良好的生长状态的。值得一提的是，在该层级中，任何通讯设备都将失灵，未知这一特点是由何种原因导致的。
//
//该层级中几乎没有任何人类改造的痕迹，但有时能够见到人类的骸骨，被遗弃的生活用品，以及来源不明的碎肉等。
//
//你扭过头努力朝着身后看去，借着从树叶的缝隙中透进来的微光，你看到实体停了下来，看上去很难受的样子。你猜测自己的最后一发子弹肯定是打进了它的血盆大口。
//
//你内心一阵狂喜，又争到了宝贵的逃亡时间，现在对你来说，时间是最重要的。但你心里也明白，自己并不能就此松懈下来。这个层级里面布满了这样的实体，而这一点你深有体会——刚刚那家伙已经是你在这个层级遇到的第五个实体了。刚才的枪声肯定会引来更多的实体，到时候留在原地只能是必死无疑。
//
//面前是一条岔路，你来不及细想，马不停蹄地朝着右边拐去。你竭尽全力在崎岖不平的道路上冲刺，耳边除了如涡轮一般高速运动的双脚踩在落叶上的沙沙声，就是你粗重的喘气声；但除此之外，你还能听到四周传来隐隐约约的吼叫声。
//
//实体
//Level C-444只有一种实体出没，其形象一般为一个扭曲的老年男性的头部，但是大小一般介于普通人类头部大小的数倍甚至数十倍之间。该类实体面部苍白，无任何毛发，双目异常偏大，瞳孔呈现为琥珀色或橙色，双唇缺失；其移动方式为悬浮在在距离地面0.5米至1米的高度，并以极快的速度朝任意方向平移。
//
//该类实体没有语言能力，似乎并不具有较高的智能，但相当具有攻击性：其会主动寻找并攻击误入该层级的每一个人类；其最为偏好的攻击方式为张开嘴，咬下受害者的头颅。值得注意的是，它们似乎对人类的头颅表现出了相当高的兴趣；相反，对于人体的其他部分，它们视而不见。
//
//该类实体在Level C-444中分布广泛，但一般单独行动。当该类实体中的不同个体在捕猎的途中相遇时，双方会优先合作，以尽可能高的效率杀死猎物；但是在猎物被杀以后，它们通常也会为了争夺食物而起冲突。
//
//对于误入该层级的流浪者而言，如果未能在第一时间内寻找到切出的方法，则其将有相当高的概率遭遇上述实体。除此之外，对于该类实体的了解相当有限，其中比较值得注意的一条是它们的皮肤似乎具有极高的防护能力，一般情况下，凭借普通的刀具等冷兵器是无法对其造成伤害的。
//
//因此，如果流浪者在进入该层级之前没有携带足够的重武器以及弹药，其将有极大的概率会死于上述实体的攻击。对于生存能力以及战斗能力一般的流浪者而言，在进入该层级之后，尽快找到切出的方法是相当重要的一环；但遗憾的是，在该层级中找到切出的方法对于这类流浪者而言显然相当困难，而这显著降低了流浪者在Level C-444的生存几率。
//
//一根横在地上的树枝绊倒了你，你的肘部在地面上滑出了两道长长的血痕。你疼得眼泪都要飙出来了，但是顾不上处理伤口，你还是艰难地从地上爬起来，积攒起自己全身上下的气力，继续在森林中飞奔。你狂乱的眼神朝着四周望过去，然而令你心中一凉的是，你已经看到了就在自己右手边的不远处，闪烁着一对琥珀色的眼睛，但是似乎并没有聚焦到你的方向。你连忙低下头，嘴里不断默念着自己大脑里为数不多的几句佛教祷词，祈祷对方并没有发现你。
//
//你的体力已经基本耗尽，你绝望地发现，自己迈开步子的速度越来越慢。你两眼开始发黑，只感觉血气上冲，一口老血几乎就要从你的嘴巴里喷出来。但是你求生的欲望如此强烈，以至于硬生生地将这口老血又咽回到了肚子里。
//
//皇天不负有心人，围绕在你四周的那些单调的参天大树突然间消失了，取而代之的是一片开阔的平地。之前硬吊着的一口气此刻被你吐了出来，你的双脚失去力气，身躯瘫倒在地上。你强撑起自己的身子看看四周，没有实体追上来。
//
//没有遮天蔽月的树叶遮挡，晴朗的夜空中央挂着一轮金黄色的满月，而你此刻无比愿意相信这个没有感情的大圆盘就是你的救世主。它忠实地将银白色的光芒投向地面，就像聚光灯一般，将你的目光吸引到了空地的最中央——一个低矮的树桩，一步就能跨上去。
//
//基地、前哨与社区
//本层级不存在任何基地、前哨或社区。
//入口与出口
//入口
//在Level C-126的444号车厢切出会让你到达Level C-444。
//打开位于Level 1的一扇写有“黑暗森林”的门会让你到达Level C-444。
//在任何主要地貌为森林或丛林的开放层级切出均有一定的概率会使你到达Level C-444。
//出口
//lost.png
//空地前沿。
//
//流浪者在Level C-444抓住一只长着金色尾巴的松鼠之后，将会被传送至Level C-445。
//在Level C-444中存在一片没有任何树木生长的露天地带，在该区域的中央有一个低矮的树桩。若流浪者找到上述区域并站在树桩上，在不眨眼的情况下直视月亮5秒后，将会被传送至Level C-199。
//更多出口仍有待探查。
//你老早就在M.E.G.的数据库中看过档案，从而知道了逃脱这个层级仅有的两种办法。事实上你根本没指望过抓到什么金色尾巴的松鼠，因此对于你而言唯一的希望就是找到那片露天地带，而现在，它就在你的眼前。你大喜过望，连滚带爬地将自己沉重的身躯挪向树桩。
//
//你终于站上了树桩。你的双脚像灌了铅一般无力，仿佛根本不属于你似的。但是你依然强撑着自己站了起来，并扒开自己的眼皮，强迫自己直视月光。
//
//在皎洁的月光照射下，你敏感的眼睛在3秒之内便溢满了眼泪。你还想继续撑下去，但奈何眼皮依然不受控制地眨了一下。你不由自主地长叹一口气，低下头，双手使劲揉着眼睛，不断地深呼吸着，想尽一切办法来保证自己下一次尝试的成功概率。只要能够撑过这5秒，你就能够成为为数不多的从这个层级成功生还的流浪者之一，到时候可有你好吹嘘的。
//
//饱受刺激的眼球终于缓了过来。你使劲地眨了眨眼睛，确定没有任何异样之后，你重新抬起了头，准备完成自己的下一次尝试。你坚信这一次你一定能够成功——然而接下来发生的一幕让你的血液都冻结了。
//
//映入你的眼帘的并不是金黄色的满月，而是另一样东西，你这辈子都不想再见到的一样东西——
//
//作者信息
//« Level C-443 | Level C-444| Level C-445 »
//
//
//
//
//
//
//
//
//
//🙂找    到    你    了🙂
//原创层级恐怖生存难度4
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1444{}