//Level C-459
//评分: 
//+8
//+
//–
//X
// 
//
//生存难度：
// 宜居
// 
// 
//IMG_20220717_234906.jpg
//Level C-459月亮升起时的“居民区”
//
//Level C-459是后室C层群的第459层。
//
//描述
//此层级主要地域由山地组成，拥有极高的植物覆盖率，仅“荒地”地区常出现不稳定的时空拼接现象，剩余地区较为稳定。河流里存在丰富的杏仁水资源，该层级的大部分地区除“荒地”外属于宜居区。在该层级活动时流浪者们将无法在该层级感受到极端情绪1。该层级有且只有人类流浪者才能够切入且无其它实体。
//
//该层级的物资相对充足，存在大量杏仁水储备，形成了较为稳定的社会秩序。
//
//Level C-459内尚未发现日夜的转换，其“月亮”为可见的唯一天体2，“月亮”以15日为周期运转，该层级内的亮度不由月亮的运转位置以及其存在状态而改变，推测除“月亮”外，Level C-459仍有其他光源，目前暂未发现可以提供光源的其它个体。
//
//“居民区”
//位于Level C-459中心，“居民区”目测为与“前厅”极为相似的建筑群，存在大量近现代的建筑风格，建筑一般贴近地面且靠近水源，少量建筑悬浮或倒立。居民区拥有较为先进的农耕技术与稳定的食物来源，靠近河道，盛产杏仁水。居民区被认为是“安全”的3。
//目前“居民区”的范围正自然增长中。
//“荒地”
//“荒地”位于该“陵墓区”的外侧，该地区通常被认为是难以开发旳，且近一半的时间将出现反常的极端天气情况4，其大部分地区暂时无人踏足。
//据信“荒地”内为不连续空间，“荒地”里的大部分空间不存在水源及食物，暂未得知其中是否存在其它层级的出入口，因其危险性较大，气候恶劣且常有空间变化，故不建议流浪者们单独探索。
//经检测，与“居民区”的增长情况相反，“荒地”的范围正在收缩5，目前正在猜测其二者间的关系。
//“陵墓区”
//“陵墓区”位于“居民区”与“荒地”的接壤处，该区有大量的墓碑与裸露的棺材，区内存在安全进出该层级的通道。该区通常由流浪者们自发管理。
//切出或切入陵墓区的流浪者的位置将会留下大量的关于该流浪者的失踪报告6。通常，阅读报告的流浪者将感到一定的失落感，该影响一般会在阅读结束后促使流浪者撕碎该类报告。
//墓地地下并无尸体或骸骨，但存在大量被撕的纸张，纸张上除流浪者的描述外，多数记载着其它已知或未知层级的不确定信息，实际情况多与其描述存在差异，但在坊间传闻中，进入“荒地”将会使描述变得更为确切，暂未明确该信息的正确性，因对“荒地”的探索存在较高危险，请各位流浪者不要擅自探索。
//基地、前哨和社区
//M.E.G.驻Level C-459基地
//常驻人员近120人
//探索“荒地”及保护流浪者们为其首要目标
//该基地占据并管理着30％左右的“居民区”
//该基地位于“居民区”中心地带
//接纳所有友善的流浪者
//支持贸易活动
//“第二居委会”7
//常驻人员约1200人
//负责调节流浪者们的纠纷
//为流浪者们提供住宿并培养其生存技能
//调动流浪者们进行农业活动
//允许贸易
//“待陵人”
//由无组织的流浪者组成，管理十分分散，成员一般在125到140人之间
//通常集中于“陵墓区”8
//负责探索与沟通其它层级
//不进行任何贸易活动
//热忠于分享探索成果
//在生产方面有一定自给自足的能力
//乐于帮助流浪者切出该层级
//对切入该层级的流浪者进行治疗并送往居民区
//入口与出口
//入口
//在除Level 0外的任一层级因非实体直接杀害而濒死的流浪者将会进入该层级的“陵墓区”，需要注意的是，在本层级该方法并不适用，且主动使用该方法无法进入此层级，未能被及时抢救的人员将会化为杏仁水后逐渐消失910。
//出口
//于“月亮”出现的时间于“陵墓区”将需切出层级的人员装入棺材或埋入土里11后切出人员会随机出现在任意层级。
//有一种说法，也可以穿过“荒地”前往其它层级，该信息暂无法证实，“荒地”危险系数较高，请各位流浪者不要私自探索。
//辛苦了，我们花了点时间为你们准备了这个，还有一点内容需要完善。你们可以把它当做新的暂住地，但一定要记住，这终究不是我们的家，我们都还需努力。为一切为了我们的归乡而不停奋斗的你们致敬。—“第一居委会”留。
//
//作者信息
//Footnotes
//1. 包括但不限于愤怒或悲哀等
//2. 估且这么称呼，以方便理解
//3. 即无任何有害实体和无任何通任其它层级的通道
//4. 如暴风雨、地陷、雷暴等
//5. 其收缩面积近似等于“居民区”增长面积
//6. 这些报告的内容类似于前庁，但在对流浪者的描述中存在大量错误
//7. 并无第一居委会，该组织名字由首批流浪者命名，应无其它特殊含义
//8. 这也是该社区名字的由来
//9. 现无法确认这些杏仁水的去向
//10. 因切入方式较为危险，已经多次发生人员失踪事件，为避免更多人员的损失，故在此告戒各位流浪者们，在切入至Level C-459时请不要试图在棺材内休息或是为了一点点杏仁水将你的同伴埋入土中，谢谢配合
//11. 应露出需切出人员的鼻子，以避免窒息
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1459{}