//Level C-441
//评分: 
//+27
//+
//–
//X
// 
//
//生存难度：
//安全
//稳定
//实体稀少
//Level C-441是后室C层群的第441层。
//
//描述：
//tree-832028_960_720.jpg
//Level C-441的一处室外环境，注意其在视觉观感中与现实景物的不同，以及不合常理的光照现象
//
//Level C-441是一片约为425000平方公里，平静的地理区域。与前厅的荒野没有太大区别，地形众多，山脉，丘陵，平原，高原，盆地，河流，湖泊，森林，但以平原地形为主，所有的地形都缺乏过渡地带，有着极为分明的特征。层级已被探明，东部和南部濒临海洋，而其他区域的地理边界只要越过，即会随着深入距离越远，周围的景物变得越为暗淡，最后越界人员在迷离中回到层级边界内。Level C-441的气候为温带季风气候，少数地区由于地形原因成为温带海洋气候或高原气候区。层级昼夜循环为非常标准的24小时，且拥有十分鲜明的四季特征，昼夜长度会随着季节变化，而且即使是盛夏和深冬的气温也较为适宜，不会出现极端的炎热和寒冷天气。天空经常存在厚度极高和颜色深重的云层，这也导致相较前厅更为频繁的降雨、雷暴和阴云天气，也经常发生弥漫着大范围低可见度的雾霭天气，有时甚至发生一些反常天气，例如天空完全变为黑暗，仅有少量来源未知的光照，但层级仍保持白昼的光线观感，或一些区域发生流动的，无法被光照亮的黑暗，不过持续时间很短，只会造成视觉影响和心理恐惧，而不会造成实际伤害。除此之外，层级鲜少发生足以造成灾害的恶劣天气。
//
//Level C-441的天空与前厅不同，似乎有着更渺远的高度和更深邃的蓝色，层级云层出现的频率和厚度也超过前厅天空，持久注视层级天空很容易引起感官错觉，人员会感觉引力倒置坠落高空，但此种错觉只要停止注视即可恢复。层级天空的白昼没有太阳或固定的恒星，但仍有未知的良好光照，夜晚会有月亮出现，且存在正常的圆缺规律，但其表面十分单调，没有观察到任何月球的地形特征，似乎是光滑的平面，这也许是Level 24的原因。层级天空除月亮外没有固定的天体，天空中的星体每天都在随机变动，但总是拥有无比壮丽恢弘的夜空，有时会观测到一些彗星经过，有时会发现一些距离很近，与地球近似的海洋宜居星球，但多数是一些普通的各类型岩石或气态行星，而且无论昼夜天空经常出现夸张巨大的异样天体，有时似乎离层级地面很近即将发生撞击，甚至能够观察到一些巨大的气态行星的云海翻腾，此种环境极易引起某些流浪者的巨物恐惧，但从未造成真正的危害事件，之后的调查也证明，除月亮外，尝试接近和探测其他天体都是无意义的，因为无法接近，也无法返回任何电磁回波。
//
//层级景观在视觉中与普通的景观视觉有所不同，亮度、柔和感、饱和度均与正常的景物相比有些许变动，绿地、建筑更为美观，水域更为幽静而深邃，类似经过专门调整的摄影图像，更好满足人员的视觉观感。Level C-441总是保持着寂静，无论周围存在多么嘈杂众多的声源，层级似乎能吞没多余的声音，经测定过大的超过60分贝的音量在人员耳中会变的柔和，多于15个声源的嘈杂声音则会变的寂静，只剩有限的不干扰的温和声音，而在水域附近效应会变得更加明显，更为幽静。此外层级也存在一种强大而有益的心理效应，人员在其中会感受到莫名的安心和舒适，总是感觉自己身处于记忆中某次户外旅行的前厅，从而能够更从容的进行行动，更合理的对待自身的生活。层级总能给在其中的人员造成感官错觉，尤其是空间错觉，只要身处室外空间，无论地形是否广阔和周围是否有朋友陪伴都会感到莫名的极空旷感和强烈的孤独感，如同处于空旷的荒野，很容易诱发空间和广场恐惧。但几乎所有人员都报告说层级环境造成的所有恐惧并未使他们感到厌恶，反倒感受到一种对层级的舒适感。
//
//photoshop-3121255_960_720.png
//一名携带犬只正在注视天空的流浪者，注意巨大的月球星体和相较前厅颜色深度略微不同的天空
//
//层级几乎没有人类建筑的痕迹，仅有一些经常可以在路边发现意义不明的警告标志的各类型道路，怪异无规则排列路灯，面积广阔，意义不明，白色理石铺设的广场，还有少数建造简陋而且建筑规格完全不符合正常规律的，没有任何装潢的水泥房屋。内部经常可以观察到通往死路的楼梯，空间怪异的房屋，或是缺少楼梯的上下间隔。房屋内都是空旷的，没有任何家具和物品。
//
//Level C-441大体上是安全的，与前厅的户外环境近似，没有一些高危层级的异常现象造成的严重安全威胁，唯二需要防范的威胁是层级变幻莫测的天气和时常出没的实体，不过此层级的实体数量相对较少，一些地方存在实体巢穴，Level C-441的实体种类包括笑魇、死亡飞蛾、肢团、猎犬、窃皮者、爆酸者、悲尸、警告风筝、迷彩爬行者、骇笑者、银骨、灯蛇等，在一些怪异的广场和建筑中可能有超现实主义者徘徊，一些人员活动相对较少的公路边可能遭遇抛锚客。有时可以发现实体巢穴，虽然实体种类很多，但总体来说每个种类的实体数量很少，可能是由于层级本身的效应所在，实体的活动相对其他层级不是特别活跃，虽然仍会攻击人员，但攻击欲望和造成的伤害都更小。
//
//自从Level C-441被发现后，由于其环境气候都更为接近前厅，而且层级的稳定程度很高，很少发生各种不确定的灾害，所以为数不少的流浪者开始携带自己的财物和资源迁入此层级，层级的自然环境也完全满足定居生产条件，杏仁水存在于一些稍小面积的独立水域，例如泉水，湖泊，溪流和较小的河流。其他的较大的河流，湖泊等普通水资源也非常丰富，同样拥有丰富的地下水。土壤可以种植近乎所有温带作物，例如粮食作物，包括谷物、蔬菜、水果、薯、豆，经济作物，包括纤维，油、糖、饮料作物，药物、染料、香料作物等，和饲料、绿肥作物，如苜蓿、紫云英、三叶草等。同时也有相对繁荣的动物活动，除一些例如双尾狐和母鸡的后室特有物种外，更多是前厅物种，比如可供狩猎的鹿、羚羊、野猪、兔子、野牛等，也有为数不少的，似乎是逃散的家养牲畜，包括奶牛，肉牛，绵羊，山羊，马，火鸡，猪，鸡，鸭，鹅等，这些家养牲畜很容易驯服，很少出现能够造成安全威胁的野兽。
//
//road-4088226_960_720.jpg
//Level C-441夜空下的公路，可见浩渺的星空景象
//
//层级地表下有着正常数量和分布频率的浅层矿石和能源，其含量均符合开采条件，虽然层级面积有限但矿物种类齐全，例如煤炭，黑色金属，有色金属，稀有金属，贵金属和宝石，硫、磷、钾等化工、农业原料，冶金辅助材料，压电石英、冰洲石、光学萤石等特种矿石，理石，花岗岩等建筑材料，以及作为能源使用的火盐和星云，甚至是铀等核燃料。森林和水生资源也较为丰富，只要控制开发采集频率和注重保护，就能实现完全的可持续收获，太阳，水能，地热，风能，海洋能等新能源也可照常利用。不过由于Level C-441几乎处于完全的未开发状态，所以各大型组织和流浪者团体不容易直接从层级获取资源，需要从外部层级投入大量资金和物资来建造。
//
//由于层级的安全性和稳定，以及资源充沛的未开发环境，Level C-441很快成为了各种大型组织和流浪者团体的青睐之地，1970年代就有为数众多的流浪者定居在此繁衍生息，逐渐形成村庄，农场，牧场，码头，采集营地、狩猎营地、伐木营地，矿场和稀少的小镇等初级人类聚落，简单的种植业、畜牧业、捕捞、狩猎、采集、伐木和采矿支撑起了绝大多数流浪者的生活，随着更多的流浪者和拥有先进技术的大型组织迁入，各组织倾全力招募切入后室的各类产业、建筑人才，对各种工农业产业、信息高技术产业进行研发和建造，力求尽快恢复前厅的生活和技术水平，并得到有益效果。
//
//随着更多的人口迁入，和诞生于后室的新世代群体实现了大量的人口增长，更多更先进的产业开始建造，实现了稳定的发展和生产，以满足人口的庞大需求，从而使更大型的人类聚落开始出现，经过漫长的时间发展，形成了有大量人口居住，相对完整产业链的繁荣层级，包括几十人的村庄，几百人的小镇，几千人口的中型城市，甚至包括一些过万人口的大型城市，以及众多的农牧场、采集、捕捞、狩猎、伐木营地和矿场。层级原本不存在任何Wi-Fi，但随着人类活动的发展，Level C-441在人口活动区域逐渐出现了稳定的Wi-Fi信号，且人口活动越多信号越强。虽然各组织已经尽全力发展，但由于后室本身的异常特性和不可能所有产业门类都有专业人才切入后室导致的人才广泛性和数量的缺乏，因此目前Level C-441的发展水平相较于前厅仍然相差很大，而且由于后室的异常性质，一些社会发展方面显示出了与前厅不同的发展方向，各区域发展程度相差很大，少数一些城市发展程度已经接近前厅发达地区，但更多的乡村和小城镇除个别现代技术外却过着类似20世纪甚至更久远的落后生活。
//
//经长期生产活动发现，Level C-441拥有强大的自我恢复能力，无论多么严重的污染也能在很短的时间内恢复到原初状态，无论是工业生产废弃的重金属污染或排放的废水废气，还是人员日常遗弃的物品，或是填埋在土壤下的多种大量生活垃圾，甚至是核能废弃物，都会在短时间内降解为无害或消失，层级的植物，例如树木、灌木、草地在周边人类活动减少的情况下能以很快的速度恢复，但不会干扰普通的种植业。甚至化石能源在耗尽封闭之后也会缓慢再生。
//
//各个大型组织占有、划分了自己的势力范围和领土，招募、接纳海量的流浪者，将其纳入自身保护和提供公共服务，其中一些被招募进入组织作为正式成员，但绝大多数作为劳动力和公民，接受大型组织保护和享受公共服务的流浪者被要求遵守组织制定的法律，接受命令并向组织指定部门缴纳税款。但同时也有大量的流浪者不愿接受任何组织命令，而选择自由不受约束的定居和流浪生活。但由于各种不确定因素导致各大型组织的边界模糊动态而不固定，甚至许多组织的边界并不重合，中间存在相当的荒芜地带或大量自由流浪者社区。随着各方面的迅速发展，人员的生活也渐渐稳定，但由于层级的空白地域已经渐渐减少和各组织边界的模糊，加上其中有相当的流浪者自由社区，各组织时有因争夺土地，技术，资源和人口而爆发争端和冲突，此外并不是所有的流浪者都追求稳定的生活，一些流浪者会同大型组织的叛乱分子占据险要地形，不时掠夺周边居民的财产，再加上层级间出没的实体，使得层级并非完全的平静与安全。
//
//因为Level C-441本身的性质和众多的出入口，层级成为后室中安置大量人口的安全区域，同时成为后室中的居住地、一些情况下的中转站和人员的补给区，随着时间流逝，层级中的未开发地带逐渐减少。由于层级面积终究有限，相比其他层级并不庞大，能使用的资源也是有限的，受制于后室人口的不断增长，离层级能够承受的阈值也越来越接近，如果层级的人口承受能力达到上限，多出的人员能否迁移到新的宜居层级也完全未知。不过达到此种危机前景的时间还较远，所以应对此危机并非高优先级。
//
//失色之虹：
//jeju-island-1684033_960_720.jpg
//失色之虹事件发生时，颜色逐渐消退
//
//Level C-441在固定的时间区段内会发生一种怪异事件，事件发生时层级景观和生物的颜色都会渐渐褪去，变为单调的黑白。天空中逐渐被色度极低的阴云笼罩，并可能出现降雨情况。层级所有的事物都会在30-50分钟内完全变为失色状态，层级户外可视距离严重降低，所有实体全部失去进攻欲望，而开始低泣徘徊。此时身处于层级内部的所有人员都会感到难以抑制的悲伤，内心一切的悲伤记忆都会浮现，无论是发生在幼年或成年，后室或前厅，记忆深刻的事件或深藏在深层心理已被遗忘的记忆，尤其是亲人或朋友死亡的记忆，全部会在此事件发生时涌现，必然导致剧烈的悲伤和哭泣，人员的心理也会在此事件发生时更加脆弱，即使是那些平时冷酷和坚决的流浪者。
//
//因为此事件导致的心理情绪，Level C-441的所有人员在事件发生时都更愿意沉浸在哀伤中，疗愈伤痛，哀祭亲人，悼念亡者。此种行为并非有害，事件通常持续24小时-72小时不等，当事件结束时，心中的哀痛渐渐抚平，层级的颜色逐渐显现，人员的心情都会变得更加积极，而且此种情绪释放被证实对于心理创伤有相比平时更好的治愈效果，目前尚不明晰层级的心理性质是否与治愈效果有关。由于事件发生时的颜色异常特性，M.E.G.将此种事件命名为失色之虹，事件在Level C-441每年度必然不固定时间发生一次，各组织将事件发生时间定为假期，以使流浪者们休息和情绪释放。
//
//
//
//M.E.G.的管理者们，士兵们，员工们，流浪者们，还有Level C-441所有的人们，听我说。
//
//这是一个特殊的日子，我们身边的一切都在褪色，每个人都满溢着悲伤，我知道所有人的内心都在翻腾，为曾经的逝去的亲人们哀痛，为过去发生的一切痛惜，包括我在内。
//
//最初，我们跌入了这个恐怖而未知的空间，我们仿徨无措。面对众多凶险的怪物，林林总总的危险，我们每一天都在逃亡，在单调而重复的空间中寻找着微薄的食品和资源，在危险的异常环境中，在实体的追杀中，勉强求生。
//
//在这漫无边际的黑暗中，我们失去了无数的同伴，甚至还有我们的亲人，他们和我们一样，不幸切入后室，在无穷无尽的危险中我们同生共死，漫长的冒险中我们结下了深厚的情谊，即使是同伴，他们与我们的亲人已并无区别。
//
//我们总感到令人窒息的恐怖，实体就像蜂拥而至的幽灵，随时会向毫无防备的我们猛扑，如影随形。后室变幻不已，在这里，我们虽然面对威胁，但我们仍然凭借人类特有的坚韧找到了属于我们的欢笑。
//
//而如今，我们找到了一片真正的安全地带，尽管它最初只是一片混沌般的荒芜，但M.E.G.和同盟们依然在这里开创了一个新的世界，一个属于后室中人类的世界，我们建造了城市和乡村，我们尽了最大可能恢复了一部分前厅生活，尽管这里的空间仍然有限，我们不可能将它完全容纳大部分人，甚至我们很难将这个层级所有的地方真正重现前厅的景象，但我们仍然做到了我们之前未能做到的，在一片荒芜中重新开始，创造了一个近似前厅的新世界。
//
//无论如何，人们得到了一片短暂的喘息之地，一个暂时安全的休息场所，后室中的避难空间，尽管它有限。
//
//兄弟姐妹们，我想说，在后室漫无边际的黑暗中，在扭曲可怖的空间中，我们暂时安全了。
//
//在这个失去颜色的日子，天边的彩虹也褪去了绚烂的颜色，一切事物都在陪伴我们。
//
//让我们尽情恸哭吧，为了那些在后室中逝去的人，为那些曾经的伤痛记忆，为所有值得悲伤的一切。此时此刻，我们一起哀伤。
//
//冰面反射画面，就像琥珀一样，将一件事物永久的珍藏，直到它融化。
//
//待色彩重回，我们将擦干眼泪，重拾勇气面对一切，我们还有许多工作要做，许多的挑战需要面对，我们要活下去，我们要找到离开后室的方法，甚至，我们可能创造更光明的未来。
//
//
//
//————监督者B在第5年度的失色之虹事件中的演说
//
//
//
//
//关闭M.E.G. 林德伯格博士的通讯记录：
//2018.6.20 林德伯格博士
//
//好吧，我知道Level C-441的发现几乎让所有人都欢欣鼓舞，是啊，一片尚未开发的原野，在贫瘠和危机四伏的后室简直是宝地，不光景色美到如梦似幻，而且还是片能够自我恢复的环境，连不可再生能源都变得可再生了，现在几乎每个组织都想要在那里多划一些土地，而且有的组织开始向国家的方向发展，我说不清这是好事还是坏事。Level C-441里边干的热火朝天，不论是谁都对未来改变了观感，他们觉得自己能过上跟前厅一样，至少是差不多的日子。
//
//我还记得那天M.E.G.发布公告招募流浪者要迁入Level C-441的时候，本来整天见不到几个鬼影的Level 11好像突然翻了天一样，都不知道哪来的那么多人，全都携家带口的赶来集合，哪个层级来的人都有，尤其是那些不太安全和比较贫瘠的层级。来的人一个个把家当全都背在身上，稍富裕一些的人有自己的车，和家人一起等待出发，条件更好一些的家庭拥有房车，有的后边还加了一条不知哪来的带轮子的小艇，带着自己的财物。其他的还有M.E.G.的工程人员和机械设备，以及一些乱七八糟我叫不上名字的运输车。
//
//好，一众人闹闹哄哄的出发了，本来以为就这样了，但是一路足足几千公里，沿途不少人其他组织的成员和他们招募的流浪者也都从支路渐渐汇入，不过此时大家好像不必言语就达成了停火协议，无论是互相结盟还是敌对的组织都没有显露敌意，大伙好像什么都没发生过一样欢声笑语。
//
//我在前厅学社会学的，去过不少国家，见识过战争或者其他各种原因导致的大规模人口迁徙是如何，但我做梦都没想象到后室里竟然会发生同样的情况，能想象平常找到人都费劲的后室堵车了吗？路上乱七八糟，流浪者开的家庭用车，运输大量人员的公交车，运载建筑材料、工具、食品和其他资源的卡车，还有其他乱七八糟的车走一路堵一路，弄得人心烦意乱。公路与铁路平行，有些人可以坐火车或船去，无论白昼还是黑夜都能看到旁边的河流和铁路一趟一趟的火车和船舶，有些是客运，有些是货运。说实话我到现在都不知道哪突然冒出这么多人，听他们交谈，有不少人似乎是来自于M.E.G.文档还没有记录的层级。
//
//但是我想说的是，所有人都忽略了可能的危机，大家在层级里安然发展，后室中的新世代也在不断成长，这当然是值得高兴的事。不过这个区域的土地是十分有限的，在边缘我试了好几次，那地方简直跟地狱边境一样，离开边缘越远，意识就越模糊，直到在思维的混沌中回到出发地。人类文明在这片土地上的承载限度并不大，Level C-441相比其他层级甚至可以说是相对较小，再加上各个组织都在这里划分势力范围，时常还会发生流血争斗，我们能在此处会发生什么尚且不得而知，而如果随着人口的增长超过了层级承载的极限，那我们该怎么做？找其他的宜居层级？如果不行呢？要知道C层群的宜居层级可不少都发生了毁灭性的灾难，找到新的也是难上加难。现在Level C-441已经出现了一些不好的迹象，尚未开发的土地已经渐渐消失，流浪者之间的贫富分化开始发生，我想在前厅因为资源和分配不足而导致的结果大家谁都知道，而这里达到那种结局的速度可能更快，这片安全的层级可能在不远的将来为我们制造深刻的危机。
//
//所以，我希望高层现在就应当未雨绸缪，为未来可能发生的后果做好防备，尽力避免危害后果发生。
//
//诚挚的林德伯格博士
//
//
//
//
//
//清晨，微风轻拂。
//
//一夜寂静，世界开始舞动。
//
//一位流浪者正漫步于小镇外的荒野中，眺望着天空的深邃。
//
//他已并不年轻，上世纪80年代他就已经来到此地，当时年轻的他如今已变成了一个苍老的人。
//
//他曾经是位诗人，至少是作家，别人都这么肯定过。
//
//能找到这片温和之地，也许是他的幸运，这里离Level 0十分遥远，他已经无法回忆起那时他和伙伴们来到这里付出了多少艰辛。
//
//这是后室中难得的宜居之地，温和，平静，稳定，让切入后室的人类，在无尽的危险和漫无边际的恐惧中能够在此休养生息。这里一切令人烦闷的嘈杂声音都变得寂静，所有的景象看上去都如同专门美化过的摄影一般美观，一切都是。没有瑕疵，光线，颜色，都比普通的景物更加美好，还有那深邃、湛蓝的天空，白昼若隐若现的万变行星，夜空中浩瀚璀璨的满天繁星，整个世界，如梦似幻。
//
//在此居住的人们的心灵似乎都得到了净化，更少愤怒和不满，更多的只是微微的恐惧和淡漠的忧愁，甚至还有些许对未来的期待。生活上的不顺利也更少发生，只有偶然间发生的争吵和争斗，即使是争吵也变得寂静而缓和。人们专注于自己的人生，欢快的笑容也渐渐重新浮现在面容上，这里已与前厅的家别无二致，甚至更加完美。
//
//这就像是一个彼岸世界，一个存在于梦幻中的世界，人民居住于此，彷如童话般的世界。
//
//但他觉得并非仅仅如此，即使在此度过了漫长的时间，他仍能感到心理的深层恐惧。
//
//大片迷雾时常在平静中泛起，近乎笼罩了整个世界，实体在迷雾中亦真亦幻，有些高大，有些矮小，甚至有些来自于前厅的都市传说。其中有些是真实存在的，而有些则是虚无的幻影。
//
//这是一个死寂的世界，吞没生命的呐喊，隐藏灾难的警告，让一切渴望变化的声音都变得苍白。
//
//是的，这里适宜居住，他也确信不会发生那些在C层群其他宜居层级发生过的灾难事件，但是这些，总像是把所有人引向另一种死亡。
//
//就像一个理由，一片平静的安全区域，让他们能够心安理得的留在这个危险丛生的后室。
//
//他知道，这里只是前厅的倒影，但是有人说过，有时事物的影像比它们本身更加真实。
//
//在初入后室时，每个人都急切的寻找回家的路，疯狂的想要脱离那怪异而重复的阈限空间。
//
//但随着时间的流逝，更多了解怪异的空间，找到了能够生存的地方，知道寻找出口极为困难，近乎徒劳，很多人的回家的期望渐渐磨灭了，他们开始适应后室，适应危险。回到前厅，似乎不再迫切。
//
//Level C-441，它的平静能让所有人寻找出口的愿望渐渐迷失，在后室中探索的欲望也渐渐消弭。
//
//倒影如此相像，许多人已经混淆了现实，对于回归前厅已不再渴望，层级麻醉了他们的意志，让他们在前厅的幻梦中走向人生的终点。
//
//久居于此的他，在时常泛起的迷雾中，分辨现实和后室已经渐为艰难。
//
//所有人都需要做出选择，是在这里安定下来，还是继续寻找那似有似无的前厅出口？
//
//他行走在难得的明媚光芒中，柔和而未知的光以完美的角度洒落在他身上，给他心中的慰藉。
//
//何为前厅？
//
//何为现实？
//
//
//
//基地、前哨和社区：
//M.E.G.（探险者总署）
//占据Level C-441的核心地带和一段较为优良的海岸线
//组建了初具规模的正规军事部队，拥有当前所有在Level C-441的势力中最广阔的领土和最强大的综合实力以及完善的法律、基础设施、经济结构和齐全的产业链
//拥有两座万人以上人口的大型城市，两座深水优良港口，8座中型城市，17座小镇和50处村庄及农、牧、矿场及其他资源营地
//经最近一次人口统计，拥有超过14万定居人口和大量变化的流动人口
//积极完善自身的各项规划，在整个层级和附近层级开展政治宣传
//B.N.T.G.（后室不结盟贸易集团）
//据有大片层级东部沿海地区直至深入内陆的富饶土地，拥有各组织中排名第三的土地面积
//是后室中媒体社交网络最为发达的地域之一，也是媒体最为集中的区域
//拥有多座能和其他层级通过海上通道连接的深水良港，极端重视商贸，实行低税率和完全的自由贸易
//拥有超过8万人口的沿海核心都市圈，也是Level C-441经济最为繁荣的区域，以及其他2座中型城市，15座小镇，66个村庄和农、牧、矿场及其他资源营地
//流动人口巨大，难以准确统计人口数量，经统计大致存在12万定居人口，以及难以计量的流动人口
//生产能力强劲，拥有比较完整的生产链，不过其领导者更青睐贸易
//由B.N.T.G.领导者本人签下的职业雇佣兵维持控制区域安全
//阿尔戈斯之眼
//占据层级西南部一处杏仁水丰富但较为偏僻的内陆环境
//控制区域和人口较少，大约为5000人，对外界的交流较为封闭
//拥有一座核心的军事基地，以及外围的3座小型城镇，20处农、牧、矿场及其他资源营地
//由受保护流浪者管理的各种经济设施的产出主要供应内部
//组织一支精锐机动部队用于随时干涉、惩罚违反规则的行为和组织
//对于军事武器和其他军需品存在很大的需求
//蒙面女郎
//拥有层级西部广袤湖泊内一座面积有限的岛屿和湖泊边缘的少量土地
//建筑颜色绚烂，风格唯美，控制区域土地种植大片经济作物和鲜花，形成美丽的花海
//控制包括位于岛屿的一座中型城市和6座小型城镇，12座村落和农、牧、矿场及其他资源营地
//人员活动非常少见，但未经证实的信息称存在大约3000名成员，甚至不是所有人都带有面具
//极为封闭，几乎不与外界产生交流，不过确信此地为蒙面女郎在C层群的一处行动基地
//所有贸易均为非正规渠道的走私贸易，经常交易后室物品
//后室娱乐
//据有层级西南沿海的狭长地域
//以娱乐业和游戏服务闻名后室，并致力于开发各类型游戏包括网络游戏和现实中的游戏工具
//正式员工和普通流浪者共计4000人
//没有通常意义的城市、村庄聚落，取而代之的是大量以娱乐为核心的建筑群，员工拥有专门居住区
//额外建有大量的游乐园、网游电竞中心和滨海度假区
//适宜地点上建有一些露天农场、温室和资源营地，但制造设备、游戏物品的原料和食品、生活物品则需要大量进口
//红星建筑队
//拥有Level C-441最广阔的山顶平原以及山麓地带的大片平原，另有多处适合开发的山间平地
//第二广阔的土地面积和丰富水源，聚集了整个层级最多的人口
//特别重视工业化和集约化农业的发展，成立公社和保护工人的工厂制度
//目前拥有整个层级所有组织中最强大的生产能力
//组建了正规化的武装部队，和规模庞大的核心城市，最高领导人李丹时常从Level C-71来到此地
//3座万人以上城市，10座中型城市，19座小镇，45处公社和农、牧、矿场及其他资源营地，超过16万人口
//贸易的管理相对严格，所有外来贸易需经许可后在专属区域内进行
//E.P.B.（正电子粒子科技有限公司）
//据有层级西北部12000平方公里的地域，控制区域大小排名第六
//核心区域经E.P.B.大力发展已经成为Level C-441最大的新型技术研发中心
//其他所建造的区域和经济设施也基本围绕着技术研发和精密工业
//吸纳切入后室前高学历的流浪者人才，目前正式成员和普通流浪者共计2万人
//没有通常意义的城市、村落，而是附属于研究设施的居住区和经济设施
//1座核心研发设施，8座辅助研究设施，以及附属的居住地和农、牧、矿场及其他经济设施
//新型技术和精密工业最为发达，同样着重开发专属后室物品
//自由流浪者社区
//追求自由生活，不从属于任何组织的流浪者自发形成的社区
//数量难以统计，不过确信人数与加入大型组织的流浪者数量相差无几
//Level C-441全境都存在自由社区，不仅在边缘区域，还有由于大型组织有限人力无法管理的，各组织不重合的边境空白地区
//基本从事农业和初级制造业，以农牧业村落，以及采集、狩猎、捕捞、矿场营地为主
//存在少量的流浪者自行开办的公司，主要进行初级加工
//少数情况下，在交通条件完善和人员数量足够的地方能够形成少量城镇甚至中型城市
//缺乏成型的法律，更多的是约定俗成的规则，人员社会行为缺乏约束
//走私贸易盛行，经常交易非正规渠道货物、危险违禁物品和后室危险物品，黑市很容易找到
//缺乏统一权威，犯罪组织和私人武装盛行，以至于流浪者需要自我保护
//相互之间并不是完全友好，可能互相掠夺，也可能结盟抵御外来威胁，对抗大型组织和敌对势力
//会使用木材、砖石，有财力的流浪者会使用混凝土建造防御墙和塔楼，并向大型组织购买武器，以防备敌对流浪者、叛乱分子和实体攻击
//人员流动巨大，人员随时可能追求安全稳定生活而进入大型组织控制区域，也随时可能有追求自由不受约束的流浪者进入自由社区
//叛乱分子营地
//各个大型组织的叛乱者和流浪者群体中产生的匪徒、黑帮、罪犯共同合流组成的众多掠夺者团体
//多数占据难以进攻的险要地形，建立坚固的防御营地
//互相之间关系多变，可互相攻击，亦或是合作掠夺
//经常袭击大型组织防御薄弱的地区，或是流浪者营地，掠夺物资
//经常从事走私危险违禁物品和非正规渠道货物，几乎必然开设黑市
//有时也会掠夺和招募人口进行常规劳动，但依然以掠夺为主要收入来源
//是层级大型组织和流浪者的共同威胁
//入口及出口：
//主要入口位于Level C-441东北方向的公路、铁路网络，能够由此行进4000公里可以连接到Level 11-Level C-28的道路网络，也有互相贯通的河流，由此的陆地通道、航运通道和空中航线能够抵达Level C-8、Level C-34、Level C-115、Level C-214、Level C-254
//东部和南部的海洋能够到达Level 230、Level C-63
//在人工活动频繁后，开始出现了许多原本不存在的出入口
//M.E.G.的一座城镇停车场地下2层，可以抵达Level 1
//层级西部流浪者自由社区城镇的其中一条下水道，有路径通往Level 2
//来到层级南部流浪者社区的一间发电站地下室，可以来到Level 3
//进入M.E.G.核心城市北部的一座办公楼，其中一道门能够通往Level 4
//在B.N.T.G.的经营的一座旅馆内，有固定的门可以来到Level 5
//在月球出现时，无论其大小如何，驾驶航空器飞向月球能够抵达Level 24，此通道为单向通道
//在一些艺术展览馆内可能找到通往Level 57的门
//沿层级西侧的公路、铁路线路行驶510公里后可以进入Level C-71
//在E.P.B.控制区域内的西部，找到一片散发橙色光芒的草地，入睡可切入Level C-365，摘下三颗相同颜色星光草的绒毛，握入手中入睡即可回到本层级
//在红星建筑队控制区域内的一座城镇游戏厅找到一幅千禧年风格版画可以切入Level C-418，返身可观察到一幅经处理的暗色室外摄影照片，切入即可返回本层级
//在后室娱乐控制区域内，像他们的员工提出请求，他们知晓可以让你通往任何一个后室娱乐层级的进出办法，注意部分为单向通道
//以上全部为稳定的双向，或是只要不离开过远就可以原路返回的稳定通道
//此外，层级极其稳定，除个别已说明的单向通道外，全部出入口均固定，不会因为一些概率性原因，切入其他层级
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1441{}