//Level C-490
//评分: 
//+225
//+
//–
//X
// 
//
//生存难度：
// 
// 
//温顺实体
//Level C-490 是后室C层群的第490层。目前尚未发现该层级的尽头。
//
//描述
//pexels-photo-1034662.jpeg
//一张广为流传的Level C-490街道摄影
//
//该层级为一个城市，除天气目前仅有晴天和小雨外。它的环境与前厅中的正常城市无任何差别，且昼夜交替时间也与前厅一致。其内拥有各种完备的基础设施和少量高端科技产物。
//
//该层级内部具有大量建筑物。主要为居民楼，生活娱乐类型建筑和功能类建筑。经检验，所有建筑物中的插座电压均为220伏特的交流电。各种建筑内部的电器均可使用。无论如何使用，电能都不会被消耗完。
//
//目前在城市里面发现了一个大型载人航空研究中心以及一处天文研究中心，内部设施齐全。目前M.E.G.已经恢复它们的正常使用性。
//
//居民楼占层级内建筑物的百分之九十。居民楼高度和样式不定，每栋居民楼内均有10到20间房间。无论在房间外的推算大小如何，进入房间后，房间的内部大小，构造甚至于物资储备均相同。
//
//生活娱乐类型建筑主要有例如餐厅，游乐园，酒吧等。这些场所内有着与其风格相符合的物品。这些物品的来源未知。
//
//功能类建筑有类似于网线，电缆等建筑物。目前，任何人为手段都不能对功能类建筑产生任何的损伤。
//
//除景区类建筑外，城市所有路面均为水泥路。路面上有大量无法被打开的下水通道。城市所有的路面均无法受到任何损伤。
//
//据目前的探索，发现该层级内具有一处位于山上的大型人造公园。据流浪者反应及测试，公园具有舒缓情绪和治愈心理疾病的能力。值得一提的是，无论公园外位于何时，进入公园后，流浪者所看到的天空景象均为日落之时的金黄色天空。但类似于钟表之类的计时器械所显示的时间却并不会因此改变。
//
//任何建筑物内部都存在大量物资。例如杏仁水，皇家口粮，罐装龙肉等。这些物资会在每个昼夜交替时刷新至原先的数目。
//
//层级内部具有大量形态为私家小汽车的车兽。但这些车兽性格极为温顺。在任何情况下均不会对流浪者发动攻击。大多时候，这些车兽均整齐的停留在马路两边。目前，已证实这些车兽可以被用作交通工具。其功能与前厅的汽车无差异。
//
//经天文台工作研究，基本确定在该层级的天空之外存在类似于宇宙的区域。观察表明，其上具有大量漂浮物和星团。以及小型的行星。目前，M.E.G.正在尝试使用载人火箭以前往该区域。
//
//该层级已被证实具有积极精神影响。流浪者进入该层级后，所有伤害他人的思想会随着时间的推移逐渐减弱，直至消失。1
//
//目前，数以万计的流浪者的进入让这个层级如前厅之中的任一城市一样恢复了它应有的生机。
//
//发现
//2020年1月20日，罗经点的成员Allan在Level C-51中找到了一个城市模型后得以切入此处。经探索后他用终端向M.E.G.总部汇报了该层级的存在，其并无任何威胁且宜居的特性及其切入方法。三天后，M.E.G.罗经点“Aleph”小队切入该层级进行探索。在与Allan会面并完全探索除太空之外的所有地方后，M.E.G.出动大量人员切入，在Allan他们“庇护所”前哨的基础上建成了Sigma A基地。
//
//Allan因发现该层级而被晋升为Sigma A基地的主管之一。
//
//M.E.G目前欢迎所有流浪者切入该层级以回归他们在前厅的生活。
//
//基地、前哨与社区
//M.E.G基地“Sigma A”
//目前，整个Level C-490均受Sigma A管制。Sigma A负责维护该层级内的治安。
//总部位于天文研究中心附近的一处军事基地类建筑内。具有多个分据点，不同据点负责不同区域的治安。
//每隔24到72小时派遣3到5名调查人员，负责调查该层级的未探索区域。
//入口与出口
//入口
//在任何层级找到一个城市模型即可切入Level C-490。
//出口
//在熟睡中惊醒有概率回到Level C-51。
//进入欧式洋房有几率切入Level 161。
//进入烂尾楼有几率切入Level C-284。
//进入办公楼会切入Level C-343。
//进入市最大的演奏厅会切入Level C-125。
//- 关闭
//自：M.E.G. Sigma A基地
//
//主题：我们不必再担惊受怕了
//
//日期：2020/02/20
//
//这是来自M.E.G. Sigma A基地的通知：
//
//流浪者们，你们现在不必再因为层级的威胁，实体的伤害而担惊受怕了！
//
//在任何层级寻找一个城市模型，切入这里，让你回归你的前厅生活。
//
//M.E.G.与你同在。
//
//M.E.G. Sigma A基地
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//关闭
//至：Sigma A基地 主管 Allan
//自：天文研究中心负责人 Kavin
//主题：天文异常研究报告
//
//出事了。
//
//在四个小时前，我们观测到了一颗小行星。它直径约为14公里。它的运动轨迹很怪异。在我们的探讨和观测下，我们发现，这个小行星是冲着我们来的。
//
//目前它据我们30000公里，时速约为每小时31公里。也就是说，再过四百多天，它就会不偏不倚的砸下来。
//
//这样一颗小行星砸到这里，我们所有人都要死。
//
//我们没有大型武器，况且如此个头的行星，我们也根本无法打下来。我建议立刻通知所有人切出本层级。我已经将报告也同步给了M.E.G.总部。他们正在封锁入口。
//
//为以防万一。我建议，加速载人航空的研究速度。如果，我是说如果。我们切不出去了，至少还能保护一些人。
//
//我做好准备了。这是我第一次为了所有人的命运而战。
//
//
// 
//至：天文研究中心负责人 Kavin
//自：Sigma A基地 主管 Allan
//主题：回信
//
//Kavin，先谢谢你们的工作。
//
//我不想引起恐慌，就先没有通知全部的流浪者切出。我派遣了上百名特工去尝试切出，但很不幸的是，所有切出的尝试都失败了。特工们走遍了城市的每一处角落，在上万处地方尝试了切出，都失败了，无一例外。
//
//也有好消息，M.E.G.给我发了文书，他们已经开始在各个层级寻找城市模型了。目前进展很顺利。
//
//目前我们已经把剩下的所有航空器械恢复了，物资也填充完毕。目前我正在挑选合适人选。这些航空器顶多能容纳大约40人。我的意见是孩子们和文档编撰人员优先。过一阵子我会发布一则公告，邀请一些孩子来到这里，紧急训练后就把他们送进太空。希望这种方法能让他们活下来，也算是尽了我们最后的职责。
//
//辛苦你们了，替我感谢大家在这几个月的辛勤付出。
//
//新版本更新于1秒前（2021/7/11 9:00p.m.）。点击这里刷新。
//
//作者信息
//« Level C-489 | Level C-490 | Level C-491 »
//
//脚注
//1. 一般在流浪者进入3天后，所有恶意均会被打消。据被影响者的描述，在打消恶意后，他们的主观意识里均认为拥有恶意是一种耻辱和极坏的事情。
//
//
//Level C-490
//评分: 
//+225
//+
//–
//X
// 
//
//生存难度：
//不再适宜生存
//终结
//实体绝迹
//Level C-490是后室C层群的第490层。目前尚未发现该层级的尽头。
//
//描述
//该层级为一个城市，除天气目前仅有晴天和小雨外。它的环境与前厅中的正常城市无任何差别，且昼夜交替时间也与前厅一致。其内拥有各种完备的基础设施和少量高端科技产物。
//
//该层级内部具有大量建筑物。主要为居民楼，生活娱乐类型建筑和功能类建筑。经检验，所有建筑物中的插座电压均为220伏特的交流电。各种建筑内部的电器均可使用。无论如何使用，电都不会被消耗完。
//
//目前在城市里面发现了一个大型载人航空研究中心以及一处天文研究中心，内部设施齐全。目前M.E.G.已经恢复它们的正常使用性。
//
//居民楼占层级内建筑物的百分之九十。居民楼高度和样式不定，每栋居民楼内均有10到20间房间。无论在房间外的推算大小如何，进入房间后，房间的内部大小，构造甚至于物资储备均相同。
//
//生活娱乐类型建筑主要有例如餐厅，游乐园，酒吧等。这些场所内有着与其风格相符合的物品。这些物品的来源未知。
//
//功能类建筑有类似于网线，电缆等建筑物。目前，任何人为手段都不能对功能类建筑产生任何的损伤。
//
//除景区类建筑外，城市所有路面均为水泥路。路面上有大量无法被打开的下水通道。城市所有的路面均无法受到任何损伤。
//
//据目前的探索，发现该层级内具有一处位于山上的大型人造公园。据流浪者反应及测试，公园具有舒缓情绪和治愈心理疾病的能力。值得一提的是，无论公园外位于何时，进入公园后，流浪者所看到的天空景象均为日落之时的金黄色天空。但类似于之类的计时器械所显示的时间却并不会因此改变。
//
//任何建筑物内部都存在大量物资。例如杏仁水，皇家口粮，罐装龙肉等。这些物资会在每个昼夜交替时刷新至原先的数目。
//
//层级内部具有大量形态为私家小汽车的车兽。但这些车兽性格极为温顺。在任何情况下均不会对流浪者发动攻击。大多时候，这些车兽均整齐的停留在马路两边。目前，已证实这些车兽可以被用作交通工具。其功能与前厅的汽车无差异。
//
//经天文台工作研究，基本确定在该层级的天空之外存在类似于宇宙的区域。观察表明，其上具有大量漂浮物和星团。以及小型的行星。目前，M.E.G.正在尝试使用载人火箭以前往该区域。
//
//该层级已被证实具有积极精神影响。流浪者进入该层级后，所有伤害他人的思想会随着时间的推移逐渐减弱，直至消失。
//
//目前，数以万计的流浪者的进入让这个层级如前厅之中的任一城市一样恢复了它应有的生机。
//
//该层级已毁灭。
//
//发现
//2020年1月20日，罗经点的成员Allan在Level C-51中找到了一个城市模型后得以切入此处。经探索后他用终端向M.E.G.总部汇报了该层级的存在，其并无任何威胁且宜居的特性及其切入方法。三天后，M.E.G.罗经点“Aleph”小队切入该层级进行探索。在与Allan会面并完全探索除太空之外的所有地方后，M.E.G.出动大量人员切入，在Allan他们“庇护所”前哨的基础上建成了Sigma A基地。
//
//Allan因发现该层级而被晋升为Sigma A基地的主管之一。
//
//M.E.G.目前欢迎所有流浪者切入该层级以回归他们在前厅的生活。
//
//禁止切入。
//
//基地、前哨与社区
//无任何基地，前哨或社区。原先基地已被毁灭。
//
//入口与出口
//入口
// Level C-490的所有入口现均已被封锁。
//
//出口
//该层级无法切出。
//
//- 关闭
//自：M.E.G. Sigma A基地
//
//日期：2021/5/14
//
//在这里先向大家致歉。M.E.G.没有保护好大家。
//
//相信大家也听到过传闻：一个月前，天文台曾通过观测发现一颗小行星的存在。最重要的是，这颗小行星现在正在笔直地向我们冲来。这是真实的，目前，距离小行星撞击日期的到来，仅剩几个月了。
//
//很抱歉现在才告诉大家，这是我们的失职。时至今日，我们也在尝试切出，可是很遗憾。切出的方法全部失效。
//
//我们试了一切方法。去了无数地方。但还是失败了。
//
//我们已向上级报告，所有切入Level C-490的方法均已被封锁。如果您的家人或朋友还在外面，也请您告诉他们，不要再试着进来了。这是我们唯一的一个请求。
//
//感谢大家。让我们每个人在这阴暗的世界中再次有了家的感觉。
//
//我们与你们同在。
//
//M.E.G. Sigma A基地
//
//- 关闭
//呃，这是我的最后一篇日志了。还有两天，小行星就要到了。所以我写下了这个，我不想让它在撞击中被毁掉，所以我发给你们。务必替我保管好，多谢。
//
//再说一下我最后的处理工作吧。
//
//昨天晚上，我们把孩子们和一个文档撰写人员送进了太空。那个撰写人员不愿意走，还是我们给他打晕搬上去的。我存了个私心，我送了我的女儿上去。放心，她从小就接受我的教育，我相信她是最先能适应的。
//
//我给工作人员们放了假，让他们也去玩几天。毕竟是最后的日子了。当然，在放假前我问了居民们，出乎意料的是，这里所有的居民都愿意让我们放假。
//
//聊完工作了，接下来的话是一些感慨，不要在意。
//
//自从我来到后室之后，我整天就在恐慌中度过，随时都有可能被实体给杀死。但自从来到这里之后，我再也没有了那种想法，这里真真正正给了我家的感觉，在家里“安享晚年，似乎也是一种不错的选择。”
//
//后室可真是一个残酷的地方啊，它夺走了我妻子的生命，夺走了我的一切。就连如此美丽之地，也会出现这种灾祸。
//
//是时候去找我妻子了。
//
//
//
//这个是给我女儿Rin留的，如果她能回去，请务必给她看。Allan的感激之情无以言表。
//
//Rin，原谅爸爸这么残忍的抛弃你，这实属无奈之举，你才十几岁，爸爸不忍心让你随我和妈妈而去，妈妈在走时你才4岁，妈妈奄奄一息的对我说，照顾好你。所以，哪怕只有一丝可能，爸爸都要让你活着。你也一定要好好活着，就当是纪念我和妈妈。原谅爸爸的狠心，爸爸没法继续陪你了。
//
//你问过爸爸，前厅是什么样子的，当时爸爸沉默了，爸爸不敢回答你。你出生在后室，十几年都在这里度过，对此爸爸一直很愧疚。爸爸总是想，生下你让你也一起受苦是不是一个对的选择。写到这里，爸爸流了泪。对不起，女儿，原谅爸爸，好好活下去。
//
//爸爸希望你能开开心心的长大，每天不要有烦恼和忧愁，就这样就可以，M.E.G.会答应爸爸保护你一辈子的。
//
//爸爸还有千言万语想对你说，但是原谅爸爸，爸爸已不知道如何起笔了。
//
//别太想我和妈妈，我们一直都在，爸爸妈妈会化作天上的星辰，拂面的微风，轻盈的雨点永远陪在你身边。我们永远都在。
//
//Rin 女儿 我爱你
//
//对了，你说过你很喜欢公园里的夕阳，爸爸贴在下面了，原谅爸爸只有一张照片。
//XBIXVK.jpg
//
//
//- 关闭
//【记录开始】
//
//录制地点：Level C-490的公园内
//
//工作人员：现在小行星已经能看见影子了。时间马上就要到了。我现在在公园内，给你们看一下。
//
//（工作人员转动摄像头）
//
//（公园内聚集了大量的人群，有老有少，有男有女，他们或者狂欢，或者悠闲的散步，或者看着公园金黄色的天空愣神。）
//
//XB5YwT.jpg
//工作人员：美吗。这个公园一向如此。天空总是这么祥和。
//
//工作人员：快看那里（工作人员再次调转摄像头）
//
//（一对老夫妻吻在了一起，他们笑得很开心）
//
//男人：亲爱的，你怕吗？
//
//女人：不怕。
//
//男人：你不怕死吗？
//
//女人：活了七十多年了，也看过世间的一切了，自从到这里之后啊，每天都在心惊胆战中度过。直到有一天。你知道哪一天吗？
//
//男人：哪一天？
//
//女人：7月14日，我们在后室的结婚纪念日。
//
//（两人爽朗的笑了）
//
//工作人员：真是浪漫啊。你们说是吧。我好想再录一会儿，但是没时间了，我去自己享受了。
//
//工作人员：晚安，各位。
//
//【记录结束】
//
//- 关闭
//【记录开始】
//
//Kavin：“只剩下三个小时了。”
//
//Kavin：“我站在公园的草坪上。那个巨大的混蛋东西已经遮住了大半个天空。”
//
//Kavin：“没有时间了。还好，要事已了。”
//
//（在Kavin坐下后，Entity C-99出现并走到Kavin身边）
//
//Entity C-99：“呵，被发现了。”
//
//Kavin：“生神，何故来此？”
//
//Entity C-99：“只剩你一个了，我想品尝你的绝望。”
//
//Kavin：“喜欢吗？咀嚼我的绝望？”
//
//Entity C-99：“不，你根本没有绝望。”
//
//Kavin：“那你的意思？”
//
//Entity C-99：“你自己明白。别那么难过。”
//
//Kavin：“那，来，喝一蛊。”
//
//（Kavin微笑着打开酒瓶，倒满两杯酒。Entity C-99接过酒杯）
//
//Entity C-99：“呵，我佩服你。微笑着看着这一切，令人敬佩。”
//
//Kavin：“来吧，干杯。敬我的死亡！”
//
//（酒杯相碰发出“当”的声音）
//
//Kavin：“多美的风景。可惜一生只能看一次。”
//
//（Kavin露出了笑容）
//
//【记录结束】
//
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1490{}