//Level C-472
//评分: 
//+7
//+
//–
//X
// 
//
//生存难度：
//等级 4
//
// 
//稳定
// 
//Level C-472是后室C层群的第472层。
//
//描述
//road-3823931_960_720.jpg
//由流浪者[数据删除]所拍摄的Level C-472的照片。
//
//Level C-472的层级外观是一个位于稀树草原中央的高速公路，公路是双向单车道，延伸了3000公里以上。流浪者一开始进入此层级时，会处于初始车辆内，流浪者无法离开车辆，车辆也不会被流浪者破坏1。在公路上往前看，流浪者会看到一连串的山脉，山脉似乎离我们很远，也有可能只是层级制造出来的幻觉，在高速公路的旁边会有一些类似于前厅的山村小屋，这些小屋里似乎充满了实体，千万不要开下公路。此层级的温度在30℃-35℃2，有昼夜交替，白天3小时，夜晚4小时，在此层级流浪者不会感到困意。高速公路以外的区域有许多掩体，会有许多实体躲在掩体后，等待流浪者的车辆靠近，流浪者的车辆靠近后，实体们会一拥而上，用蛮力把流浪者所驾驶的车辆撕碎，并把流浪者残忍的杀死。
//
//当流浪者刚进入该层级时，实体们并不会采取行动，一旦你发动了车辆，几百个实体将会在你的后面穷追不舍。行驶700公里至1000公里后，你可以看到"Level 11欢迎您'的牌子，目前抵达告示牌之前唯一已知的路标是："10公路，100公里，300公里，500公里，700公里，850公里，1000公里的路标。"经过人员测试，当流浪者抵达1000公里的路标时，流浪者就会被传送至Level 11，目前流浪者最早被传送的公里数是752公里。不知道怎么开车的流浪者不会进入此层级。
//
//此层级只能单人进入，流浪者会遇到没有逃离实体追捕的流浪者的车辆残骸，此层级只能进入一次，不管你怎么尝试。此层级的一个安全离开的方式是持续开车直到看到告示牌，并穿过告示牌到达Level 11，流浪者在途中可能会遇到废弃车辆或实体拦住你的去路，遇到请绕行，别想着驾驶车辆冲过去，车辆会立即熄火，你所驾驶的车辆是你唯一安全的地方，且据某些因意外切出层级的录像显示，人员被动离开车辆3以后，会立马被实体杀害，所以请勿让实体追上你。
//
//0469号录音（记录了层级是怎样被发现的）
//实体
//绝大多数的人形实体都会出现在这里。
//
//初始车辆
//该层级的车辆型号均为未知，车辆的外观像越野车，有车载Wi-Fi，最高时速为90千米每小时，有着现代正常车辆的全部功能，车辆似乎不用耗费燃料就能行驶，车辆副座位每隔一段时间会以未知方式刷新2瓶杏仁水。
//
//此层级的异常
//C-472的特性
//所有在Level C-472的实体的奔跑速度都保持在惊人的50千米每小时，以及力量足够把一辆车撕碎，后来经过M.E.G.的研究发现，这是Level C-472的层级特性所导致的实体加速和力量增强。
//
//C-472的异常地点（未被证实）
//有一些流浪者在离开此层级时报备了此层级似乎除了主干道还有分岔，虽然人员报备岔路的公里数不一样，但是那些岔路都是不约而同地通往此层级的森林，且回来报备的流浪者没有一个人尝试离开主干道前往岔路的，但值得注意的是，此岔路可能是此层级的子层级的入口，而且经人员报备，似乎岔路上的实体比主干道多上了几倍，因此M.E.G.强烈建议流浪者不要尝试前往自己发现的岔路，毕竟，好奇心害死猫嘛。
//
//基地、前哨与社区
//由于此层级的性质，此层级无法建立基地，前哨或社区。
//
//入口与出口
//road-7201023_960_720.jpg
//流浪者（摄影师已死亡）所拍摄的500公里以后的路。
//
//入口
//在任何有公路或车辆的地方切出会有5%的几率抵达Level C-472。
//在任何层级心中默念三次"我要开车！"都有30%的几率被传送至此。
//在Level C-236跳到车顶并敲碎玻璃进入车辆会立即晕过去，并且醒来时会在此层级的车辆中。
//出口
//行驶700公里至1000公里，你可以看到"Level 11欢迎您"的牌子，进入以后流浪者会晕过去，接下来会在Level 11随机生成的汽车模型旁醒来。
//在车辆的显示屏找到“《你不在的世界》”这部电影，并播放，在播放时切入车辆的显示屏里可能会进入Level C-53。
//切入车辆的挂件里，人员可能会在终点醒来。
//作者信息
//« Level C-471 | Level C-472 | Level C-473 »
//
//Footnotes
//1. 除了被追上来的实体撕碎。
//2. 车辆显示屏显示。
//3. 车辆被实体撕碎。
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1472{}