//Level C-442
//评分: 
//+13
//+
//–
//X
// 
//
//生存难度：
//等级 3
//
//不安全
//不稳定
//敌对势力侵害
//Level C-442是后室C层群的第442层。
//
//描述：
//grass-3820618_960_720.jpg
//Level C-442的一般景象，能见度很低
//
//Level C-442是一片漫无边际的空旷草原，通常泛起深重的迷雾，这导致了层级的低能见度。天空大多时间都被阴云笼罩，很少有晴朗天气。层级拥有28小时的昼夜循环，层级气温保持在相对较低的范围，大约为16℃-23℃之间，虽然不明显，但Level C-442仍有四季变化，但只有秋冬季节较为明显，在秋冬季节时气温会下降至10℃~-20摄氏度之间浮动，春夏季节的气候较为干旱，降水很少，冬季时层级植物会枯萎，经常发生覆盖草原的降雪。层级地表生长着丛生禾草、针茅属植物和其他低矮植物，但几乎没有树木，也存在一些水质良好的湖泊，溪流和少量河流，有些地方存在可以食用的野菜，尤其是在水域区域富集。在一些水源充足的地区，附近的野生动物活动较为频繁，植被高度和茂盛程度也高于周边区域，而且昼夜、季节温度的变化也更缓和，此种区域被流浪者称为“绿洲”地带。
//
//此外少数区域能够在地表下发现储量有限的金属矿藏，例如铜、铁、铬、锰、铅等。层级的土地较为松软，但仍然可以行走，不过在此行动的最好方式还是骑乘马匹或其他牲畜，因为整个层级在最初被发现时没有任何人工硬化地面，所以轮式车辆几乎无法在此通行。
//
//在一些池塘和溪流中可以发现杏仁水，同时能够找到中等数量的草原野生物种，如野牛，野马，野山羊，双尾狐，绵羊，兔子，骆驼等，也可能会出现少量的危险野兽，例如郊狼、獾、兔狲等，以及很少的后室实体，死亡飞蛾，窃皮者，猎犬等，层级显现某种与Level C-441相近的特性，超过限度的声音在此处似乎会被吞噬，使得Level C-442显得十分寂静。
//
//非线性空间影响：
//Level C-442似乎体现出明显的非线性空间特征，加之层级属于空旷的草原地形，这种特性使多人探索层级是非常危险的。当多名流浪者在层级中结队行进时，如果某人离其他人过远，超过了其他人视野范围之外，那他很可能无法做到通常意义上的原路返回，即使他在稍后返回原地，他很大概率不会再出现在其他人的视觉之中，而且他也无法看到其他流浪者，即双方不会相遇，此种情况不会必然发生，而且消失的流浪者仍然可能重新出现在他人的视野中，但有记录的情况中很少有人员能再次出现，此种现象可能是非线性空间错位的结果，但如果携带无线电和其他通讯设备，仍能保持联络，此种现象会持续至小队离开层级，在离开层级之后，此现象会立即消失，失踪者会立即出现在视线中。
//
//此外，层级内任何导航系统都会频繁地出现失灵的状况，且由于层级内几乎没有任何可供辨认的标识，目前层级本身拥有的以上现象所导致的正常反应亦或层级含有的额外特性极易使流浪者在进入草原后严重丧失方向感。由于层级的寂静感和漫无边际的绿色草原，可能会使流浪者的心理倾向恐惧和忙乱的四处搜寻路径，导致迷失在层级中，无法找到准确路径或层级出口，使在层级中的探险活动很容易迷失方向和产生高度恐惧，进而导致事故发生。
//
//由于上述危险因素，Level C-442的初期探索遭受了严重的人员和设备损失，多支探索小队和流浪者的探险队再未返回，可能因不熟悉层级性质导致队伍的分散和迷失，无法找到层级出口，进而在恶劣环境中导致失踪和死亡，层级拥有稳定的社区后，失踪的探索人员也未出现，当初所有失踪的人员和装备被推定损失了。不过经后续研究发现Level C-442的空间错乱效果可以抵消，可以抵消此种效果的方法只有在层级内设立稳定的人工建筑或以物理方式将所有人员锁定连接，作为固定坐标的建筑能够让流浪者确定方向，而且能让流浪者们相遇，将所有人员使用绳索或其他物理方式连接能让流浪者即使离开了其他人视野范围，但只要物理连接不断开，人员就不会受到非线性空间影响，而道路是应对迷失现象的最佳方法，只要不离开道路过远，流浪者就可以不受影响的行进。
//
//层级现状：
//虽然层级的自然条件恶劣，而且极易迷失，但顽强的流浪者们还是在相对平和的“绿洲”地带建立了社区、前哨和城镇。在此种区域不仅可以一定程度避免较低的温度侵袭，自然环境比周边地区相对较好，植被更加茂盛，而且离水源较近，如果附近存在杏仁水，那区域将会更加适宜。此外层级原本不存在Wi-Fi，即使在流浪者建造了稳定社区后，也只在城镇中心及距离极近的附近区域才有中等强度的Wi-Fi信号，大部分空旷草原空间不存在任何Wi-Fi。
//
//受制于层级的草原地形，整个Level C-442内部几乎没有任何木材，也很难找到任何石材，所以层级内的建筑大多由夯土建成，有限的砖石、水泥和木材等建筑材料都由与层级外部的交易和运输而来。层级内的流浪者们基本从事有限的农耕、畜牧、渔获和少量的初级制造，一些流浪者会从事采矿，还有少数流浪者会在城镇的附近区域从事游牧。由于恶劣的环境，较低的温度，严酷的冬季，经常的阴云天气导致的光照不足和匮乏的资源，层级的农业产量很低，流浪者更需要畜牧或游牧行为补充粮食。层级可以承受的人口数量相对较为稀少，且多数集中于有限的城镇中，由于“绿洲”面积十分有限，所以Level C-442的城镇规模不大，城镇不仅可满足人员的生活需求，在恶劣的自然环境中提供保护，而且在草原中起到信标的功能，使各类人员能够在层级中互相碰面，减轻非线性空间的影响，确定其他城镇、社区和层级出口的方向，为在外游荡和前来的人员提供固定方位，从而使很大程度上避免流浪者永久迷失在草原。
//
//阿勒巴尔游牧帝国：
//已知的大型组织和流浪者社区并非是Level C-442存在的唯一人类团体，在层级的深处，存在一个相对更加庞大的人类游牧社群，其人种近似17-18世纪的多个中亚族群，使用突厥语、波斯语及其少数中亚方言，生活方式、服饰风格、社会习俗和技术水平也与同时期的中亚游牧帝国完全近似。经过多次交流，现在可以明确其处于一种松散的部落联盟的政治形态中，自称为“阿勒巴尔帝国1”，但M.E.G.和其他大型组织，流浪者，甚至很多游牧部落都从未见过最高统治者。
//
//游牧军队的武装风格非常混杂，其中既有手持长矛，人马具装的近战骑兵，也存在装备锁子甲和链甲，携带俄式或土耳其式长管燧发枪或火绳枪，亦或燧发手枪的火枪骑兵，同时也有使用大磅数弓箭的骑射手和其他武装更为杂乱的游牧骑兵。与骑兵协同的也会有骑马机动而下马作战的，使用火绳-燧发枪械和各式冷兵器战斗的步兵。其使用马匹和骆驼运载军械和其他物资，有时甚至会使用骆驼携带轻型火炮，在少数激烈冲突记录中，存在其使用畜力拖拽重型火炮的情况。
//
//游牧社群体现了历史上普通游牧民的一般行动方式，他们时常可能从层级地形深处突然涌现，袭击边境的城镇和村庄，或是在外携带粮食和货物的流浪者，袭杀并俘虏人员，掠夺财物。他们似乎找到了更有效克服Level C-442非线性空间的方法，使大队人员能够畅通行进而不会迷失在折叠空间中，具体方法目前仍缺乏信息，但是观察到游牧民会在每个视野范围内建筑夯土构成的，约10m³的简易平台。劫掠行为持续不断而难以彻底阻止，发生频率尤其是在秋冬之际最为频繁。
//
//虽然由于其武器的落后，正规M.E.G.和其他大型组织武装力量可以轻易击溃其游骑兵，但由于袭击的方式随机性和突然性很高，机动能力很强，而且行动地域广大，M.E.G.能够随时投入战斗的正规部队数量有限，很难防御到全部的区域，加上层级存在大量而分散的流浪者城镇，所以游牧军队仍然具有不可忽视的威胁。
//
//当然流浪者们也会积极抵御其袭击，使用从大型组织购买或在其他层级搜寻到的枪械、火盐，甚至极少的迫击炮、单兵火箭和老旧火炮进行防御。但是流浪者们拥有的枪械数量有限，很难做到人手一支，而爆炸性武器则更为稀少，所以流浪者们也必须使用寻找到的，或是自身打造的刀剑和长矛在内的冷兵器，以及各种后室物品抵抗，例如装有火盐的水枪，使用弹弓发射火盐铸锭，以及瓶装闪电。虽然游牧骑兵很难正面对抗大型组织的武装力量，但却更适应不间断地袭扰，而且由于人数和武器有限的原因，流浪者不是每次战斗都能取得胜利。游牧骑兵经常能够在大型组织防御的空白区域中突入、掠夺并造成破坏。
//
//但是，由于游牧民的一般行为特性，以及对帝国权威的松散认可，使得其抢掠活动虽然从不间断，但却呈现很明显的季节特性，春夏季节发生情况较少，秋冬交替之际军事活动最为频繁，而且阿勒巴尔帝国与现代人类社区的外交关系是多变的，不是所有时间都保持着敌对关系，正常友好的外交活动和其他交流也经常发生，而且商贸活动也十分频繁，由马匹和骆驼搭载的商队时常携带牛羊，马匹及其动物制品，肉类、皮革、羊毛、鲜奶、奶酪、宝石、香料、纺织品、青白盐、珠宝等货物来到大型组织的控制区域和流浪者社区群落进行贸易，有时甚至会由层级出口去往其他更繁荣的层级进行活动，带回粮食、棉花、茶叶、木材、砖石、金属、锅碗、御寒服装、棉织物、现代牲畜用具、以及一些他们能够理解使用的生活物品和工业物品。
//
//除此种正规贸易外，大型组织职员和流浪者对其存在走私活动，例如M.E.G.对于金属的贸易有严格限制，对于火盐和武器的交易更是全面禁止，以保持对敌对势力的军事优势，但存在的走私贸易一直将不少的钢铁、火盐甚至是现代枪械走私到游牧部落中，是一个不小的隐藏忧患，不过目前得益于M.E.G.的管控，以及帝国本身的存在的一定程度的封闭和守旧性，此种行为造成的负面效果影响甚微。
//
//不少流浪者和大型组织的贸易队伍也会随着游牧商队前往帝国的城市进行贸易，有少数贸易团队甚至抵达过规模宏大的帝国首都城市，以及多个物产丰富的大型贸易集会城市。其城市、村落和游牧营地也完全符合17-18世纪中叶的中亚国家风格，根据目前很少能够证实的资料，阿勒巴尔帝国的经济由大量的游牧畜群，经营粗放而有限的农耕，一定规模的经济作物，遍布城镇的精巧手工业和依赖商路的可观收入构成。虽然前往帝国领土被证明可行，但跟随游牧商队是目前唯一能够抵达阿勒巴尔城市的可靠路径，也有大型组织和流浪者尝试自行寻找商队道路，但无一例外都以发生负面事件，甚至灾难事故的失败告终。
//
//此外帝国是由为数众多的部落组成的联盟体系，并非所有部落都十分好战和富有侵略性，除少量部落游离于帝国管辖之外，帝国内部的一些部落的外交策略更为温和，更愿意进行友好的活动和商贸而非战争，而且帝国内部的众多部落也并非统一的整体，互相之间也可能会产生矛盾甚至爆发冲突，所以M.E.G.和其他一些大型组织尝试对其中部分部落结盟，以分化并更有效的对抗其他侵略性好战部落。
//
//
//
//关闭M.E.G.军事行动报告
//M.E.G.关于Level C-442敌对活动报告文档
//
//日期：2018,9,15.
//
//记录：流浪者的社区城镇报告了第一起敌对实体袭击事件；
//
//目击报告称近似中亚游牧民的骑兵部队装备冷兵器，火绳和燧发火枪，突袭了正在建造中的流浪者城镇，由于事发突然而且缺乏防御，流浪者们很快就被击溃，被夺走了相当的物资，包括粮食、牲畜、武器和生活物品。自此之后类似的袭击频繁发生，所有Level C-442所有社区都加速修筑了壕沟、栅栏、塔楼、护墙等防御工事，以对抗实体威胁，M.E.G.也设立了军事基地和快速反应部队，以便收到求助时及时增援流浪者，另外M.E.G.与其他组织和流浪者团体合作，沿存在流浪者活动的区域外缘修建了附有堡垒和火力支撑点的长防御工事，虽然此后袭扰仍一直存在，但在很大程度上被遏制，在多次成功的驱逐军事行动中，M.E.G.成功回收了杀死的实体遗体，经检验实体被确定为中亚人种的普通人类。
//
//但M.E.G.无法从根源上彻底消除威胁，所有尝试寻找威胁来源地，进行远距离反击的行动都以部队的迷路、短暂或长期的失联和艰难的返回攻击出发地告终，在进行更多平和交流和更深入了解阿勒巴尔帝国的政治结构之后，了解只有游牧军队和商人能以未知方法克服层级效应，而且不是所有阿勒巴尔部落都极具侵略性，所以监督者议会决定在控制区域采取防御态势，同时进行适当的攻击行动和有效的外交活动，以削弱袭击行动。
//
//在之后的外交活动当中，相当的游牧民和牧主都声称自己的祖先来自于许多中亚国家，是为了躲避战乱和敌对政治势力的侵害而迁移至Level C-442草原，并在此汇合居住，但无法找到回归本土的路径，他们并不知晓“后室”的概念，也没有其他人类群落，直到流浪者们来到草原，才知晓此地并非前厅，以及了解现代人类、后室和其他层级的存在。
//
//此外，绝大多数部落都宣称他们服从于一个统一的帝国权威之下，而且其行动确实体现了部落联盟特征，所有大型部落首领每标准年度时间都会聚集在首都召集会议，但我们从未见过其最高统治者，而且所有的部落也并非统一的整体，争吵、征战和冲突时常发生，我们也可以利用此项来减轻我们的防御压力，M.E.G.应当采取灵活的外交和军事策略，来更好地应对袭扰威胁。
//
//
//
//层级边缘的旅店：
//exotic-structures-2716736_960_720.jpg
//旅馆建筑部分外墙照片，拍摄当日层级出现了少见的晴朗天气
//
//在长期的外交活动之后，M.E.G.和一些大型组织与一些友好的部族达成协定，在沿途修筑通往部族领土的道路，以便利商队、人员、物资的来往通行，由此更大的层级空间被发现，层级地形并非是完全的草原，同样包括荒野、戈壁、甚至沙漠地形，这些地理区域往往有着特别分明的界限，而且显得不符合自然规律的突兀。在这些通往阿勒巴尔帝国领土的道路行进时，可能在道路两侧约24米的范围发现一座突兀的建筑物，建筑的外观近似于17世纪的波斯商队旅馆，旅馆不会始终处于同一位置，目击事件发生在多个地点，但建筑一旦出现会在该地停留较长的时间，而且流浪者进入的建筑被确认是同一地点。
//
//旅店内部的风格完全符合为游牧商队服务的设计装潢，内部不仅存在一系列装饰精巧的接待室，以及众多围绕正方形广场排列的旅店房间，旅店总是居住并有大量人类实体活动，但其衣着、所持物品、使用语言可能来自于前厅的不同历史时期，甚至罕见情况下发现有除流浪者之外的旅客携带现代物品。除旅店拥有者之外的所有入驻个体都会在日出前苏醒，而后消失30分钟-1小时的时间，据消失过的人员自称被送回进入旅店前所处的地点和时间阶段，因此该建筑被认为可能处于一个时间和空间交汇的节点，可能不仅是后室层级，甚至完全可以认为此旅店连接着前厅，但目前所有离开旅店的流浪者只能返回Level C-442之前进入旅店的地点，似乎来自于其他历史时期的旅客一旦通过旅店大门离开就会消失，无法跟随前往其所在的时间和空间。
//
//在旅馆房间内入睡的人员都会普遍报告“解决了一些困扰他们的现实问题”，例如如何制造或是从其他层级搞到一台发电设备，怎么从当前层级回到Level 48，如何在遭遇危险实体时及时逃离之类的广泛问题。不过得到的解决方案通常缺乏意义，人员大多会认为试图解决的困惑是在浪费时间，从而放弃此问题的解决，但也有少部分人员得到解决问题的的答案，所以一些大型组织人员流浪者也使用该办法作为一种非常规的困难问题探索方法。
//
//旅馆内居住一名大约40岁，近似男性人类的实体，其声称是旅店的所有者，他使旅店得以正常运行，保持房间的整洁和物资的充足，确保旅客的需求可以得到满足，保证旅店食物、酒、咖啡、茶、以及其他消遣物品的供给。经M.E.G.人员的多次接触后，确认此实体可以多种语言与旅客进行交流，不仅包括普什图语、突厥语和波斯语，而且包括历史时期的大部分中亚语言，甚至可以比较流利的使用汉语和英语。实体的发言通常高深莫测且难以理解，他有时自称为‘光的探寻者’，他也以此称呼M.E.G.人员和偶尔出现的，似乎携带现代物品的不明旅客。
//
//
//
//关闭视频访问记录
//日期：2020.1.12
//
//事件：Level C-28主管李玖夜随游牧商队前往阿勒巴尔领土进行外交活动途径旅馆地带，进行非正式访问活动。注意李玖夜主管在切入后室前完全没有在中亚地区生活的经历，不理解任何一种中亚语言。
//
//[记录开始]
//
//画面显示李玖夜向旅馆柜台前进，旅店主正在背向他打扫架子上的物品，旅店主刚刚结束与一名来自未知时间的旅客对话，李玖夜注意到离开的旅客身上携带了隐蔽的现代物品，其生产年代似乎是1990年代。
//
//李玖夜：“你好，先生。”
//
//旅店主：“你和刚才那位一样，也想知道关于这旅店的事。”
//
//李玖夜：“确实，不过您是怎么…？”
//
//旅店主：“虽然我不愿重复说这些话，但是这里有一种能进入思想的方法，它会让你直到一些你不愿知道的事。”
//
//旅店主：“你和他一样，都是真实的探寻者，不过你和刚才那位略有不同，你们相比他们更加迷茫。”
//
//李玖夜：（表情略微凝重）“也许，您说的没错。”
//
//旅店主：“如你所见，旅客们在这里单纯的停下，在两地之间的一个落脚点休息。你知道的，这里每一个人都在探寻着什么。尽管他们探寻的目标和方式不尽相同。当人们进来时，他们的记忆中唯有愚昧无知；离开之时，他们的眼界直达天际，满溢智慧。这就是这间旅店本质的一个方面——一个探索真理的旅途中的驿站。”
//
//李玖夜：“好的，先生，但我和其他旅客也交流过关于这件旅店的事情，你说的这些虽然很深刻，但这间旅店还发生了更多的事情，而且这里曾经，是一个战场？”
//
//旅店主：“你说的没错，这里也曾经，嗯，是一个战场，一个破碎的联盟与深红之王艰苦战斗的地方。”
//
//旅店主：“这场战争仍在继续，对抗红色沙阿的战争，而且这场战争正在失败。七个部落继续关押这即将到来的黑暗，但他们也正在崩解溃散，这片沙漠是黑暗中的最后的避难所；草原、戈壁、沙漠，这里是世界错误的碎片无限复制拼凑的存在，这里已被世界遗忘；但黑暗从未止息。我···曾一直与之战斗，但我从未胜利。直到最后，我所拥有的一切中只剩下了这间古老破碎的客栈。我将这客栈搬离了时间本身，也搬离了它原本存在的世界，躲离了喧嚣的前厅，来到了这片死寂而处于阴影中的后室，让它成为一块从沙粒中升起而隐藏于时间中的顽石。在这里，我们都会被铭记，因为我们都记得彼此，无论风云变幻，沧海桑田。这里是世界的遗嘱，在万物归虚以后，它仍将长存。
//
//旅店主：我的朋友，我通常很厌恶重复我所说的话，但我不介意对你诉说这些黑暗的时间，这世界上有数不清的过去以及未来，也许那黑暗不会到来这里。但是如果它来了，那我们始终将被铭记。在这间世界尽头的旅店，我们都会被永远铭记。这里只是所有人前往真理的路途中的一站，一个当它被需要时永远在那的一站。最后，我将永远在这里，帮助那些真理的探寻者、真实的探寻者，以及像你我这样的，像他们那样的，光明的探寻者。”
//
//李玖夜：（轻叹）“好的，多谢您，我已经明白了很多。”
//
//实体之后不再对提问做出反应。
//
//[记录结束]
//
//事后M.E.G.依据店主所说开展调查，但并未找到其所称的“七个特别使命的部落”以及“对抗红色沙阿的战争”事件，所有接受访问的普通游牧民乃至部落领主均称旅馆区域从未发生特别的大规模战斗。
//
//
//
//关闭M.E.G.机密文档
//日期：2020.2.8
//
//2020.1.20. M.E.G.的特别技术顾问叶莺以放松身心为由申请了两周的假期，但于规定时限却未能及时返回。她本人在超过了预定假期期限的两天后才得以返回，她声称在Level C-442度过两周假期，但回程时因为层级特性导致迷路，所以产生了延期回归的行为。
//
//但经M.E.G.保卫部门调查，叶莺顾问的延期原因并非其所声称的那样，有明显证据表明，叶莺前往了旅馆房间，并在内部与一些未知组织的人员进行了很长时间的接洽，具体内容目前无法探知，但叶莺最后仍然返回了M.E.G.核心部门。叶莺此行为所产生的后果尚未知，但似乎与叶莺最初加入M.E.G.时致力寻找的奇特徽标组织有深刻关联。监督者议会内部也进行了一些关于叶莺忠诚度的讨论。
//
//虽然最后得出结果目前无需对叶莺的忠诚度提出质疑，但监督者议会命令保卫部门对叶莺的下一次类似活动进行监视，以探知叶莺的行动是否会产生负面后果。
//
//
//
//旅行者探索行动
//2020.6.12，总计150名有着丰富经验的冒险者，其中包括110名老练流浪者，16名速切玩家，24名B.A.G.救护人员，组成了一支完备的探险队伍，准备克服层级的非欧几里得性质，探索层级深处尚未发现的区域，寻找可能的切出出口，为应对可能长达数月甚至数年的长途旅行，探险分队准备了充足的帐篷、食物、服装、户外工具、后室时钟、医疗物资和马匹，M.E.G.也为这支探险队赞助了一些专业的勘探设备，包括地质检测仪器，夜视设备，以及可在草原中临时安装避免迷失的信标。
//
//探险队出发之后的三个月之内，一直与Level C-442的主要基地保持联络，但在之后的一次看似平常的通讯后，探险队再也没有发回通讯，而基地多次主动尝试联系的努力也宣告失败，未知是因为距离过远还是通讯设备遭到了损坏。之后的几个月基地没有发现任何一名探险队成员返回，在数月的无果等待后，所有人员和设备被推定损失了。
//
//但在事件三年之后，几十名探险者艰难的陆续返回了Level C-442的城镇，他们中绝大多数已经患有多种疾病，被发现时处于严重饥饿而且伴随严重营养不良，在之后一些从事商业活动的流浪者从有道路连接的游牧部落领地带回了一些同样处境的探险队成员，至此所有已知幸存的人员都被找到，共有52名探险队成员幸存，其他全部队员均已死亡、被游牧部落俘虏或去向不明。
//
//据幸存的探险队成员所述，他们出发开始时比较顺利，但在数月之后遭到了游牧骑兵的袭击，一些成员死亡或被俘，一部分货物被抢走，但他们选择继续进行探索活动，漫长的时间之后，补给已经耗尽，他们靠着与游牧民的贸易和在草原中的生存技能勉强继续行动，途中有不少流浪者脱离了队伍，因为意见不合选择返回，或是因为生存条件的艰苦而选择留在一些部落中，但剩余人员仍旧艰难的完成了任务。
//
//根据探险队员的描绘和少量幸存携带仪器的记录设备，层级地形远不止草原地形，经过数年的前行，在阿勒巴尔帝国的领土内，同样发现了沙漠、戈壁、荒原等地理形态，在通过了帝国领土后甚至发现了海洋地貌。最后探险队抵达了可能是层级终点的区域，之后因地理阻隔无法继续前进。
//
//
//
//关闭M.E.G.视频文件
//nature-768621_960_720.jpg
//Level C-442‘终点’照片，远处有山脉阻隔的盐田
//
//日期：2021.12.16
//
//拍摄者：幸存的探索队员
//
//[记录开始]
//
//时值正午，由于长期未得到维护，镜头的画面略有破损且时而跳动。视频显示，探险队员所到的‘终点’是一片半径数千米的盐田，在前方大约2千米处有一扇凭空伫立在盐田中，带有门框的白色木门，其前方十米处立有7个由白色理石雕刻成的石柱，围成一个直径10米的圆，每根大理石柱直径约1米，高7米，刻有许多难以理解的浮雕。这些浮雕的艺术风格与任何已知的前厅文明不符。
//
//约30秒后，凭空的木门突然打开，拍摄者和附近队员立即躲藏在在山脉岩石后，视频显示木门里面并非是后方的盐田而似乎是另一平行现实，一队四名穿着怪异的未知人员从木门中走出，携带一只关在笼中的雄性家鸡，一副银质洒水器和装满水的手持容器和一把黑色石刀，可能由黑曜石制成。
//
//一名人员从一根大理石柱开始，以逆时针方向，缓慢沿石柱绕行，每行一步，即以洒水器向圆环中心播洒容器中的水，此行为持续了约3分钟，在绕行完成后，此人员将水从头浇在站在旁边的另一名人员身上，音频记录到模糊的如下内容：
//
//“七印，七戒，七王座献给深红之王。”
//
//之后播洒水的人员移动到离先前人员较远的安全位置，使用黑曜石刀杀死鸡，并将鸡血倒入水的容器中，将之摇匀。
//
//先前被从头浇水的人员接过容器，从反方向绕行石柱，向圆环中心播洒混合液，完成之后，他走上圆环中心的石块，把剩余的血与水的混合液倒在中央的沙、盐上，以下是可辨识的音频内容：
//
//“鲜血献给旧神，圣水献给新王。”
//
//之后四名人员收集所有物品，从木门返回，并立即关上。
//
//待其所有行动结束后，探险队员前往木门所在地，尝试打开木门，但门已被从里侧上锁，无法打开。由于担忧可能的空间混乱，所以没有对木门进行强行破坏。之后探索队员使用仅存的仪器对该地区进行了检查，并无特别异常，但显示地下存在一个至少上百千米的空旷空间，而且其中检测到了生命迹象，经地震回波推断可以确定存在一个空前庞大的实体处于地下空间内。
//
//[记录结束]
//
//被发现的团体似乎在举行某种宗教仪式，但我们目前还不知晓具体关联，甚至我们也不清楚这个层级到底发生了什么，但根据旅店拥有者的诉说，还有探险队的发现，Level C-442很可能存在一个迫在眉睫的，威胁层级，甚至后室的实体威胁，我们尚不清晰如何应对此种威胁，目前还需要加强信息的搜集，以及对整个层级保持监控，如果出现突发的灾害事件，我们应该保证撤离通道的畅通，以使所有人能够快速撤离层级。
//
//——监督者A
//
//
//
//关闭前哨、基地和社区内容列表
//基地、前哨和社区
//M.E.G.克诺维斯镇驻防区
//一座9000人口的城镇，其中包括M.E.G.员工和寻求庇护的流浪者，与一座防御严密，驻守不少于2000名战斗人员，能对任何入侵做出快速反应的军事基地相连
//处于层级众多社区中的核心绿洲地带，修筑了公路、铁路、简易机场，连接了各个主要社区和友好部落，以使人员、货物的流动畅通，以及需要时进行军事支援
//在愿意接受M.E.G.指导的流浪者城镇中设立管理部门，并驻守武装人员进行保护
//与其他大型组织和流浪者团体合作，沿现代人类社区的控制区域边缘建造了栅栏、壕沟、护板、有防御火力的瞭望塔、混凝土堡垒构筑的长距离防线，有武装人员长期驻守，并定期轮换
//城镇附近开辟了数量有限的农田，以维持植物粮食需求，且有大量流浪者从事畜牧、渔获、商贸、以及在周边地区游牧，城镇也控制相距较近的多座矿场，由此也城镇存在少量的纺织、制造和冶炼，主要供应内部需求，对外部层级主要出口新鲜肉类、罐头食品、羊毛、毛纺织物、奶酪、动物制品、未精炼矿石、游牧贸易商品
//B.N.T.G.绿色平原贸易公司
//拥有一处杏仁水丰富的绿洲地带，600名长驻人员，其中有150名职业雇佣武装人员
//在周边草原进行季节性的放牧和畜牧，种植作物主要是产量更高的牲畜饲料和牧草
//生产新鲜肉类、腌制肉类、罐头食品、鲜奶、奶酪、羊毛、皮革及其他动物制品，并向其他食物资源匮乏的层级出售肉食，同时也会使用杏仁水进行交易或充当货币
//垄断了与多个游牧部落的商路贸易，从中获得丰厚利润，禁止其他组织和流浪者前往交易
//组织驻地也筑有坚固防御工事，以抵御可能的侵袭
//红星建筑队草原生产建设兵团
//在目前层级控制区东部多个绿洲和水源地带建造了多个农牧场、公社、工厂、城镇
//致力在不破坏生态的情况下，提高层级农作物、动物制品和矿物产量，目前收到可观成效
//接受流浪者的请求，协助缺乏工具和建筑材料的流浪者建造城镇和社区
//拥有10000人口，实行民兵制度，人口平时农忙从事生产，空闲时进行战斗训练，战时随时投入战斗
//在控制区边缘建造铁丝网、壕沟、哨塔、钢梁构筑的混凝土堡垒、火力支援点进行防御，防御区内筑有军用公路，军用车辆可以随时机动，必要时也会为其他组织和流浪者社区提供支援
//B.A.G.荒野援救联络中心
//基地设置在一片小型绿洲地带，并存在多个分布在整个地域的流动车队前哨，为层级内遭遇危险事件，以及生病受伤的流浪者提供救援和医疗救护
//拥有大量的医疗物资和通讯设备，保证信号随时畅通，以使流浪者可以随时联系B.A.G.基地
//在层级的长驻人员不固定，基地人员在300人上下，拥有基本的防御能力和武器储备
//流浪者自由社区
//不属于任何组织的流浪者自发形成的社区，准确数量难以统计
//大多依靠绿洲、矿脉、水源形成城镇，从事有限的农耕，以及畜牧、渔获、采矿、纺织、冶炼，同时存在相当数量的流浪者在社区附近的草原从事游牧
//所有流浪者城镇、村庄、采矿和游牧营地都会在社区边缘建造护墙、栅栏、壕沟或其他防御工事，从大型组织购买或从其他层级搜寻到的大量枪械、火盐、冷兵器和其他武器来保护自己
//
//
//入口及出口
//层级南部边界相邻Level C-441，这是Level C-442最明显，也是唯一可确认的与其他层级的边境地带，两者有着非常分明的界限，可以观察到截然不同的昼夜、植被和地理形态
//跳入一座流浪者村庄内的一口石砌水井，一直向下潜水可抵达Level C-8的一口水井，同样可以返回
//B.A.G.的基地医院中有固定的门，打开可抵达Level C-114，此通道可原路返回
//曾经有几名处于极度饥饿、干渴、虚弱状态下的流浪者被处于Level C-166的‘梵高爱好者’成员救起，据称他们在Level C-442的草原迷路，在极度虚弱的恍惚中来到Level C-166，但此种方法难以复刻，而且不可从Level C-166返回
//Level C-272的船只发现过一具死于低温的流浪者尸体，经辨认为Level C-442一名跌入水中失联的旅行者探险队成员
//
//
//
//
//
//雾霭，漫无边际的降落在深秋的草原。
//
//秋冬之交弓劲马肥，正是历史上游牧民进行劫掠的最佳时机。
//
//刚刚从旅店出来的李玖夜，抖了抖他蓬松的雪银色发丝，试图使自己更加清醒。
//
//旅店主实在是一个不好理解的人，所说的话高深莫测，时间，空间，尘埃，战争，这些词汇充斥着他的大脑，他是在不明白店主诉说的是什么。但是他知道，店主是一个拥有深刻智慧的人，他所说的是渺远发生的历史，彷如在他眼前一般。他在此探寻真理，他还称自己和M.E.G.光的探寻者。
//
//真是讽刺，在后室中，生存就需要竭尽全力，哪有时间来追寻世界的真理呢？
//
//他苦笑着摇头，他和他的小队骑马行进草原上，跟随着一同前进的游牧商队，只有跟随他们，才能畅通的前往阿勒巴尔帝国领地。寻找着商队来到之前堆砌的夯土平台，微风拂过草原，如绿色的海浪般随风起伏，远方部落的栅栏和建筑已经依稀可见，以及走动的游牧民。
//
//他的任务又是一次寻常的外交活动，与更多的部落尝试接触，没有什么特别的。Level C-28离这里非常遥远，本来也不应由他执行这项任务，这只是一次急需的临时任命。
//
//缓缓经过部落的大门，前方就是与部族牧主会面的大厅，但他此时，却注意到一些其他的事物。
//
//他身侧不远的地方，有一个看似平平无奇的圆顶毡房，但有两道火焰分立于入口两侧，从中传出彷如远古征战般的深沉歌声
//
//“他们于时间之死将圣文忘却，
//
//愿他们和顽抗我夺回我属者一般下场，
//
//他们将那安稳绑缚我的嚎链忘却，
//
//无数古老的单于便是如此被遗忘。
//
//他们将那刺穿我身的钢剑忘却，
//
//在我燃烧王冠前他们定不会再忘。
//
//他们将待我复归的七位新娘忘却，
//
//此等美爱迷失于瓮之子上。
//
//他们将把我镇压的封印忘却，
//
//只余一个记得而不为我意屈服。
//
//七个封印，七个部落，其六已夺还，余一必将属我，
//
//在你们所有时日终结之前，深红汗定要骑行。”
//
//林雨薇从后靠近他“长官，怎么了？”
//
//“呃，没什么。”他刚才确实听得出神，虽然他不知晓那些语言的含义，平时与游牧民的交流还需助手帮忙，但他已经感知到一些，来自渺远时间的，愤怒，痛苦，不甘和对枷锁反抗的渴望。
//
//“我们走吧。”
//
//作者信息
//« Level C-441 | Level C-442 | Level C-443 »
//
//Footnotes
//1. 突厥语“Alp—Er，意为勇敢者。”
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1442{}