//Level C-430
//96.4%3.5%
// 
//评分: 
//+52
//+
//–
//X
//通知
//根据最近大量流浪者的报告，同时鉴于该层级的特殊性质，以下关于该层级的信息可能含有错误或者已经过时。M.E.G.正在收集有关该层级的更多信息，如果您对该层级有一定了解且发现以下有内容与事实不符，请务必在该页面末上传您对该层级信息的修改与补充。
//
//文档已加载
// 
//
//生存难度：
//等级 5
//
// 
// 
// 
//yZSxofUgBQJ5RX1.jpg
//Level C-430的A区内的蓝色迷雾
//
//Level C-430是后室C层群的第430层。
//
//描述
//Level C-430包含的两个区域均为非线性的室外区域，分别命名为A区和B区。该层级内普遍拥有''恐惧效应''，即为使进入该层级的人类感到没有来由的、长久的恐惧。该效应仅在离开该层级后才会消失。它的存在使得探索该层级变得困难，因为该效应使大多数流浪者甚至M.E.G.探索队队员均不愿继续深入该层级进行探索。目前尚未找到抵御该影响的方法。
//
//A区
//Level C-430的A区为进入层级后会到达的第一个区域。它表现为一片以寒温带针叶树木为主的，弥漫着大雾的无尽树林。A区内的天空为灰色，所以很难分辨雾和天空。区域内有一定的光照，平均能见度约在20米左右。除此之外，林中还弥漫着不自然的、不含一点水汽的蓝色迷雾。其成因目前仍不清楚，但B区内含有水汽的蓝色迷雾样本也许会解释其成因。这些环境特点使得探索该区域变得更加困难和危险。
//
//目前无法判断该区域内是否有昼夜变化，也并不清楚该区域天空呈现灰色的原因。
//
//A区深处的树木下有几率出现未知来源的木质手提箱，箱内的物品种类繁多。目前已记录的物品有：
//
//杏仁水
//罐装龙肉
//皇家口粮
//磨损的布袋（仅发现一次）
//由前厅一家专做文具的公司制造的签字笔和其替换芯
//止血绷带
//电池
//一本似乎由一个被称为失落一族的后室团体撰写的书籍，书内的文字目前暂无法翻译。
//一张纸条，上面写出了从Level C-430的A区切出该层级的唯一方式：“收集50mL雾中的水汽凝结的水并喝下便可以离开这个地方。”该纸条的发现者立即将该内容分享给其他流浪者,这使得许多已经因恐惧陷入绝望的流浪者看到了希望。不久后一部分流浪者在A区内建立了"露水采集者"社区，并在随后成功地通过该方法使多名流浪者切出Level C-430。但由于在A区 和 B区内均仅能通过爬上树梢的方式收集十分少量的雾水，雾水采集的过程变得十分缓慢、危险和艰难。收集者经常会在树梢上被在该区域内游荡的实体注意到并在落地后被袭击。1
//B区
//Level C-430 的 B区为该层级的第二个区域。B区的外观和异常性质几乎和A区完全相同。但是随着探索的深入，B区内的环境会逐渐扭曲。主要表现为扭曲生长的树木、颜色极其鲜艳的土地等。同时，蓝色迷雾的分布范围在该区域内越来越广。
//
//该区域的实体数目极多且异常凶猛，它们会成群结队地攻击进入该区域的流浪者（奇怪的是，该层级中特有的实体阴谋家 和 脊灵在 B区内却没有任何目击报告）。但根据记录，它们会有意避开弥漫着蓝色迷雾的区域。虽然如此，依然不建议流浪者通过进入蓝色迷雾来躲避实体，因为B区的蓝色迷雾和A区内的不同，它含有带有强腐蚀性的水汽。
//
//目前仅发现一种方法进入B区，即在A区被 脊灵追逐时从地面切入，且切入B区后无已知方法可返回A区。
//
//实体
//Level C-430内实体种类和数量众多，这也是该层级极其危险的主要原因。目前已证实的实体包括：阴谋家（特有实体）、脊灵（特有实体）、猎犬、笑魇、骇笑者、车兽、肢团、尸鼠、死亡飞蛾、猎鸟、窃皮者、Nguithr'xurhs、警告风筝和双尾狐。其中大多数实体似乎都仅在B区活动。
//
//阴谋家2
//阴谋家为一种人形实体。其头发和指甲均长于正常人类，且所有个体均穿着沾有血迹的破破烂烂的衣物。该种实体有基本交流能力和较低的智力。已确认该种实体均曾经为正常人类，但其转变原因未知.
//
//。该种实体会在A区内四处游荡，寻找流浪者。找到流浪者后该实体会向其大声列举一些它自认为在这个层级内可能会遇到的一些危险，但其描述多数都不实或者过于夸张。当流浪者回答"我已经知道了"后阴谋家会心满意足地离开，不再纠缠流浪者。反之阴谋家则会喋喋不休地跟随着流浪者，进而引来脊灵和其它实体。目前未观测到其拥有除此以外的其它行为（包括睡眠和取食）。
//
//脊灵3
//脊灵为一种大型人形实体，有一定智力，其平均身高约为2.5米。该种实体均穿着灰色的、破破烂烂的长袍。其脊背上有多个突出的角质尖刺，除此之外它的其它生物特征不得而知，因为除了从背部刺穿长袍的尖刺外该种实体的身体均被长袍覆盖。目前尚不清楚该种实体穿着的长袍是否为其身体的一部分。
//
//该种实体会被阴谋家的声音所吸引，然后移动至流浪者旁边。单个个体所在的约10平方米区域内的“恐惧效应”会以指数级加倍，可以使流浪者精神崩溃，而最终会被其吞食（可能取决于该实体是否饥饿）。由于其会非常缓慢地靠近流浪者，所以可通过快速移动的方式逃离脊灵，但逃脱该实体的过程中有几率意外切入B区。
//
//基地、前哨与社区
//鉴于该层级的特性和实体的数量，该层级没有已知的基地、前哨站或社区。
//
//露水采集者
//成员数量不定，波动较大
//友善，愿意交易物资
//会主动帮助有需要的流浪者
//欢迎所有有意愿加入且不反对"一号规矩"的流浪者加入团体
//拥有约四个左右的位于不同位置的森林空地的居住点（较少被实体袭扰）
//成员主要工作包括捡取物资还有收集雾水
//成员目标一致，即"采集雾水，然后离开这个鬼地方"
//"一号规矩"：每瓶收集好的雾水总是会给加入最早的、目前仍在这个社区内的流浪者使用。任何试图抢夺并非属于自己的雾水的成员都会被逐出社区。
//入口与出口
//入口
//目前已知的所有入口均会使流浪者切入至本层级的A区内
//
//在Level 11中的任意拥有树木的公园中从较高的位置摔下有几率在摔落过程中切入该层级。4
//在Level 39的边境区域被龙卷风卷起有几率切入本层级的A区。5
//在Level C-194的雨林区中感到没有来由的恐惧时会发现一棵笔直的松树，切入该松树会来到本层级的A区内。
//在Level 474的森林中找到一条小路，沿小路行走约2分钟会发现已处在本层级的A区中。
//在Level C-317找到一个被固定但浮在海面的极小木制房间，进入房间后将门反锁，地面会开始向外渗出无害的水雾。在水雾充满整个房间后，切入四周的墙即可进入本层级的A区。
//出口
//从B区未出现扭曲现象的树上摔落至地面有几率切入Level 62。
//在A区采集50mL的雾水后喝下可以切入到Level 27。这是已知的从A区切出的唯一方法。
//在B区有很小的几率通过切入极度扭曲的树木切出到随机的、含有树林的层级。
//在B区被超过20只实体追逐并感到极度的绝望时丢弃所有的装备和物资，面向正在追逐的实体会切出到一个随机的安全层级。 （未经证实）
//请将您的修改版本粘贴至下方书写栏并点击上传
//| 错误：无法上传，数据库已选用最终版本。
//选用版本：000020
//该版本作者：匿名用户09471
//
//已打开
//Level C-430修改版本000020
//作者：匿名用户09471
//
// 
//
//生存难度：
// 
// 
// 
//mplZsrfFe2dSWw5.jpg
//我们的森林
//
//Level C-430是后室C层群的第430层。
//
//描述
//这个地方没有边界，没有尽头。在这里只有身旁的树，头顶的雾，还有脚下的地面，不管走到哪里都一样。这里普遍拥有一种你们所说的“恐惧效应”，即为使进入该层级的你们感到没有来由的、长久的恐惧。虽然这种效应只有在你们离开这里后才会消失，但当每个恐慌的灵魂与它们的恐惧和解时，这种效应就变得不值一提。
//
//这个地方中曾经有两个区域，分别为属于我们的森林和恐惧之林。我们的森林是你进入这里后会到达的第一个区域。它是一片以松树和柏树为主的，弥漫着大雾的无尽树林。
//
//这个地方
//我们的森林的天空的颜色是忧郁的灰色，与朦胧的灰雾融合在了一起。在林中还弥漫着迷人的、不含一点水汽的蓝色迷雾。这里仍有昼夜，但并不明显。阳光和天空一样是灰色的，但并不代表这个地方没有生机。树是活着的，但它们似乎已经和这个地方融为一体了。
//
//我们的森林的深处的树木下你有几率找到我们的木质补给箱，我们会定期在箱内放置物资。目前我们放置过的的物品有：
//
//你最需要的杏仁水
//你需要吃一口的罐装龙肉
//你最爱吃的皇家口粮
//我们放置过一个磨损的布袋，希望你们喜欢
//从你们的世界那里找来的圆珠笔和替换芯
//你受伤时会需要的绷带
//你可能会需要的电池
//我们放置过一本失落一族撰写的书籍，它会教你们怎么活下去
//从这个地方出去的一个稳定的方法
//我们的森林中有两种特有的生物在其中生活，分别为无可救药的你们还有我们自己。无可救药的你们已经和你们不太一样了，他们普遍需要剪一剪头发和指甲，还需要练习练习说话的能力。
//
//他们被自己的恐惧剥夺掉了情感和思维，这些事情无法逆转，也使得他们不再是你们中的一员。但他们依然竭力地想让刚刚进来的你们不陷入一样的境地。他们会来告诫你一些他们自认为在这里会遇到的最可怕的危险，但如果你说你已经知道这些，他们就会离你而去，去找其他迷路的人们。
//
//但如果你们不这样回答，他们则会反复强调这些危险，这时我们就会来寻找这些喋喋不休的可怜人，让他们安静一会。当然啦，你们一般都会在他们的旁边。但最初我们不清楚为什么在靠近你们之后你们都想逃跑，甚至还会精神崩溃，倒在地上，从而由于离我们过近的原因直接坠入恐惧之林。也许是因为恐惧效应的作用？反正不管怎么样，当时你们普遍都会胡乱地往反方向跑。但这个地方的树长得太茂盛了，能见度也太低了，我们很难在你们跑远后重新找到你们。
//
//我们只能先让那些家伙闭嘴，然后跟上你们。但当时你们只会盲目地向前奔跑。为了让你们不受惊吓，我们就只能尽量和你们保持一些距离。即使这样，多数情况下你们还是会摔倒，然后因为离我们过近的原因而坠入恐惧之林。
//
//恐惧之林是这个地方的第二个区域。我们是按照我们的森林的样子用蓝雾建造的那里，那里的树木是建造出来的，所以并不是活的。但它们看起来几乎和我们的森林中的树木一摸一样。
//
//我已经提到过了，那些蓝色的雾其实是我们用来建造的工具，它们含有的蓝雾水既可以让有限的空间无限地扩张、可以让几尺高的树木拔地而起，但也可以把多余的东西轻松地去掉。不工作时的蓝雾就完完全全是干的（你们大概曾经已经注意到过恐惧之林的蓝雾就在全功率工作）。
//
//历史
//那么我们就该解释一下这里都发生过些什么吧：我们在很久很久以前就生活在我们的森林里了，我们喜欢这里的树木，喜欢这里灰色的天空…当时这个地方还是一个有限的空间，所以随着我们数量的增多，这个地方变得过于拥挤了。即使我们的森林会因为蓝雾的不断工作而不断地扩张，但我们并不满意，所以就调整了蓝雾，让它通过一种极快的速度工作来让我们的森林变成真正意义上的无限大的树林。
//
//但逐渐地，它却导致这个地方的空间开始崩塌，直到依然是很久以前的那一天，一个区域破碎了，露出了一个缺口。一些不属于这个地方的东西通过它进来了，它们数量及其庞大，也极度危险。我们试图修正这一切，但我们既无法把它们赶走，也无法把缺口填上。为了抵抗它们，我们损失惨重，那段时间我们的数量比现在还要少很多。
//
//最终，我们把那个缺口缩到了最小，保证没有东西可以进来，同时利用蓝雾创造出这个地方的一个附属空间，按照我们的森林的样子在附属空间里建造了森林，并成功地把那些可怕的东西全都赶到了那里面。我们调整了蓝雾，利用它来清理掉那些侵入这个地方的东西。经过大概几百天后，那些东西都死光了，与恐惧之林融为了一体。当然这使得那整个区域变得扭曲和怪异了。
//
//那时的我们虽然成功了，但是心中除了恐惧不再剩下任何东西。我们花了很长的时间通过一种古老的仪式来把我们心中所有的恐惧都释放出来，使它们集合成一个集体，飘到这个地方的上空，使这里被恐惧笼罩。但这时那集合体即使导致了恐惧效应的出现，但确确实实对我们自己已经没有任何影响了。
//
//大概依然是这段时间，我们发现仍然有方法可以让生命体从外部进来。但似乎只有你们能够成功进入。我们最初注意到你们没有敌意，于是便不去干涉你们。但当时你们全部都无法适应被笼罩在恐惧之下，从而每一刻都在被恐惧慢慢吞噬。
//
//恐惧效应的影响也是在这个时间变得越来越猖狂，让你们眼前出现了了一个个你们记忆中可怕也同样是我们曾经惧怕过的东西。这些东西依然还只是恐惧效应的精神产物，也就是"幻象"。所以它们既不会影响我们，我们也看不见它们。但就像我说过的那样，你们当时几乎没有人能够克服它，那时如果你们被它变成的东西吞噬的话，就会变成无可救药的你们。
//
//于是从我们发现你们会被影响的那个时间开始，我们竭力地阻止你们变得无可救药，但显然在无法克服恐惧的情况下和我们接触时你们会感到更加恐惧，因为那些化身成可怕的东西的恐惧效应就曾经是属于我们的恐惧。
//
//就像我前面已经提到过的那样，当你们无法适应和克服来源于我们的恐惧效应但又和我们离得过近的时候，多数情况下就会摔倒，从而坠入我们最初安放恐惧的那个地方。
//
//恐惧之林
//为了你们的安全，我们在不久前用了120天的努力利用里面残留的蓝雾彻底封死了去往恐惧之林的所有入口。我们无法去救那些仍然被困在里面的人，对此我们对你们的那些被困的同伴深感抱歉。但我们保证你们不会再见到那个被恐惧所掩埋的地方。
//
//恐惧效应所造成的负面影响多数已经随着恐惧之林的封锁而从这个地方消失了，但在我们的森林中你仍然有可能会受它的影响而看到那些恐怖的东西。记住：真真正正去了解你所恐惧的是什么，然后与它和解。这不难，只是需要时间。
//我们已经知道你们已经比以前做得更好了
//
//关于我们自己
//我们？我们都没有名字，因为我们可以清晰地记住所有事情，包括对方的所有特征。你们倒是给我们起了一个名字，它…确实也概括了我们最显著的特征。
//
//在遥远的过去，我们就拥有大量的能力。据说我们就是从这个地方的那些雾中诞生的。反正不管怎么样，我们可以不用喝下雾水就能随意出入这个地方。
//
//我们去过后面的世界的其它地方，也去过你们的世界，但我们还是最喜欢这个地方。我们通过这个能力来运输物资（已经很长时间没有用过了，因为在之前我们在一个地方找到了很多物资），但却无法将任何生命体带来和带去。我们现在已经不怎么需要进食，而剩下的物资很多，所以就留给你们了。
//
//你们不需要花时间去担心我们，正相反，你们现在大概很少会见到我们了。交易时我们会自己前去前哨站，所以不要主动来找我们，你们有困难时我们会第一时间了解的。如果对你们有什么问题想问，也请在交易时发问而不是主动来找我们。
//
//我们能活很长一段时间。但现在我们的数量不多，所以需要你们用好的故事来交易。
//
//实体：
//这个地方只有你们、无可救药的你们还有我们自己是真正可以行走的实实在在的东西。但如果你无法和你自己的恐惧和解，那么恐惧也会是一个实实在在的东西，而且会变成一群极其危险的实实在在的东西。
//我们知道你们已经可以对付它们了
//
//基地、前哨与社区
//虽然我们会尽量少地接触你们，但我们很孤独，所以希望你们可以留下。
//
//以下为你们近期成功克服被削弱恐惧后在这个地方拥有的一部分基地、前哨站和社区：
//
//M.E.G.（探险者总署）“无畏者”前哨站
//你们近期建立的一个很大的前哨站，会让你们中的流浪者住下并向他们提供帮助。其中有你们的人会来和我们交易物资（拿故事交换，我们爱听故事）。
//
//露水采集者
//这个属于你们的社区已经存在很久了，现在他们中的多数人已经定居在这里，所以这个社区已经发展到很大的规模。现在这个社区已经废除了一些规矩，并且吸收了很多人加入来保证能够获取足够多的露水供需要离开的人使用。（现在比以前肯定容易多了吧！）事实上，这个社区的建筑实际上已经成为了一个出口，因为似乎只有他们拥有快速采集雾水的经验和能力。
//
//SP1运输场
//这里是你们储存和运输物资的地方，这里住有很多运输工和商人，他们会经常通过露水出入这个地方，而他们总会拿到雾水分配的优先权。
//
//Joseph&Dannis酒馆
//一家距离各基地都很近的小酒馆。值得一提的是，这家酒馆的食材完全是由我们提供的（基本都是我们曾经会放置在补给箱里的那些东西）。
//
//L01居民定居点
//位于树林中一处空地的一个大型定居区。但是我们实际不太喜欢这个地方，因为这里有一部分你的同伴饲养了一些古怪的东西。
//
//灯塔
//这座灯塔屹立在我们的森林的一个很遥远的山坡上，它并非我们建造的，也大概不是你们的产物。它完完全地被锁住，不知道里面有什么。（我们猜测可能有人住在附近或内部，但那是很早以前的事情了，因为现在我们在那里找不到任何东西）
//
//入口与出口
//即使我们在这里生活了很久，但也没有发现除了喝雾水以外的出入这个地方的其它出入方法。我们可以自由出入这个地方，但无法带上你们一起。
//
//以下是你们自己整理的出入口：
//
//入口
//在Level 11中的任意拥有树木的公园中从较高的位置摔下有几率在摔落过程中切入该层级。虽然这是多数流浪者切入Level C-430的方式，但该方法并不可取，因为它极不稳定。通过这种方法，流浪者基本都会直接切入至本层级A区内距离地面9~30米的随机位置，有严重摔伤或被树木刺穿的风险。
//在Level 39的边境区域被龙卷风卷起有几率切入本层级的A区。该方法依然不可取，因为流浪者很可能在被卷入龙卷风时就已严重受伤。
//在Level C-194的雨林区中感到没有来由的恐惧时会发现一棵笔直的松树，切入该松树会来到本层级的A区内。
//在Level 474的森林中找到一条小路，沿小路行走约2分钟会发现已处在本层级的A区中。
//在Level C-317找到一个被固定但浮在海面的极小木制房间，进入房间后将门反锁，地面会开始向外渗出无害的水雾。在水雾充满整个房间后，切入四周的墙即可进入本层级的A区。
//在一些层级中会出现一张贴在墙上的写有"战胜你的恐惧"的纸张，找到后需要在脑中回忆自己最害怕的东西。在成功想到那个事物后流浪者会向后摔倒，坠入黑暗的深渊。约1分钟后流浪者会结束自由落体的状态，并发现自己正躺在本层级A区的地面上。
//出口
//从B区未出现扭曲现象的树上摔落至地面有几率切入Level 62。 （已失效）
//在A区采集50mL的雾水后喝下会随机切入到Level 27或Level C-offee ୧⍤⃝（后者几率较低）。这是已知的从Level C-430切出的唯一方法。这是已知且可用的从Level C-430切出的两种方法之一。
//在B区有很小的几率通过切出极度扭曲的树木切入到随机的、含有树林的层级。 （已失效）
//在B区被超过20只实体追逐并感到极度的绝望时丢弃所有的装备和物资，面向正在追逐的实体会切出到一个随机的安全层级。 （已失效）
//脊灵在一次物资交换中表示该层级还有另一个可用切出方法：在距离Joseph&Dannis酒馆约一百米左右的一处只有草本植物生长的山丘上喝下50mL的A区雾水会切入到该层级的子层级。6脊灵们表示该子层级已与本层级脱离了很长时间，故并不清楚子层内的具体情况。这是已知且可用的从Level C-430切出的两种方法之一。
//附录1：采访记录
//采访者1：M.E.G."无畏者"前哨站高级官员Emma Ranson
//采访者2：露水采集者社区代表Issac Fredrix
//受访者：一个脊灵，自称就是撰写并上传了Level C-430修订版的那一个
//
//<记录开始>
//
//[关门的声音]
//
//Ranson：您——好吗？
//
//[椅子挪动声]
//
//Ranson：我的名字叫作Emma Ranson，我旁边的这位叫作Issac Fredrix。请问您的名字是？
//
//[脊灵的声音极度沙哑和低沉，但发音及其标准，可以轻易地听清每一个字。]
//
//脊灵：我们都没有名字，你可以称呼我“你们”，因为我也代表了其他的…你们怎么叫我们来着…脊灵。
//
//Ranson：我们需要问您…你们一些问题，作为…呃…采访。
//
//脊灵：我很乐意回答。
//
//Ranson：请问你们是如何看到关于Level C-430的信息并把文档上传到我们的数据库的？Level C-430内并没有Wi-Fi也并没有手机或电脑。
//
//脊灵：但是其它地方有。我们还请那个地方的一位你们的同伴给我们了一些帮助。
//
//Ranson：那么你们是从哪里学到我们的语言的？
//
//脊灵：后面的世界的其它地方，当然还有你们的世界。你们的语言很多，但都不是很难。
//
//Fredrix：但是为什么我们从未在其它地方目击过你们？
//
//脊灵：我们有能力很好地隐藏自己。你们也一定注意到了只有在我们想让你们发现我们的时候才会发现我们。
//
//Ranson：好吧…那么我们要聊一些正事了，一些你在文档里没有写明白的东西。
//
//[短暂的沉默，夹杂着纸张翻页的声音]
//
//Ranson：Level C-430的生存难度曾经被定为五级。这是非常高的等级了，你们是否知道？
//
//脊灵：我们非常清楚。
//
//Ranson：而你在文档中解释了那些危险实际上都不是实体化的，所以把级别定为“宜居”，对吗？
//
//脊灵：如果你已经完全清楚一件事的真伪，那么我认为再去花时间确认它纯粹画蛇添足。
//
//[一阵短暂的沉默]
//
//Ranson：对不起。能再详细描述一下在你们封住B区之前，这种恐惧效应有多危险吗？
//
//脊灵：是对你们非常危险。它不会伤到我们，因为是我们将它们释放出来的。但是它会变成很危险的幻象，也就是我提到的我们遇到的那些。你们中的很多人没有能力抵挡，他们都被它，或者说实际是被自己的恐惧吞噬掉了，从而变成了我们所说的无可救药的你们。
//
//Fredrix：但是当时的A区不是非常危险，对吗？
//
//脊灵：相比恐惧之林，我们的森林中它没有那么强大。因为我们当初是把它释放到了恐惧之林，所以我们的森林受到的影响一直不大。但是那个时候我们靠近你们之后你们会受到的影响其实比在恐惧之林所受影响其实还要大得多，我们忽视了这一点，导致你们很多人都坠入了恐惧之林。这种特性我们现在也没有搞清楚，也就是在离我们很近的情况下只要摔倒就会坠入恐惧所在的那个地方。
//
//Fredrix：我们当初还以为那些流浪者被你们吃掉了…我们深感抱歉。
//
//脊灵：没有关系，我们早该想到因为恐惧效应是我们释放的恐惧的产物，所以在靠近我们的时候你们受到的效应会加倍。我想即便是现在，坐在我的对面也依然会有效应吧？
//
//Fredrix：你刚进来的时候我就感觉到了，一种寒风刺骨的…不安感。
//
//脊灵：恐惧效应永远不会在这个地方完全消失。你们和你们的恐惧和解了吗？
//
//Fredrix：我想是吧，至少我没有在这个层级里再见到那些实体的幻象。
//
//脊灵：很好，你做到了。
//
//[短暂的沉默]
//
//Ranson：还有一点是我们不太理解的，请谅解，但是我们想知道你们帮助我们的真实原因。
//
//脊灵：你们不属于这里，而我们属于这里，是这里的主人。主人要热情好客，也需要尊重主人的客人。
//
//[短暂的沉默]
//
//脊灵：那些可怕的东西并不尊重我们，它们当时试图将我们全部都杀死，所以我们选择先清除它们…你是在担心这个吧？
//
//Fredrix：因为如果有需要的话，我们可以立即把我们的流浪者和定居区都全部撤走，留给你们清净的环境。
//
//脊灵：我想我们并不需要。
//
//Ranson：我们再次感谢你们无偿送给我们物资…因为这个层级并没有物资，我想你们应该也很需要它们。
//
//脊灵：这个地方以前是有物资的，那是非常早以前了，就放在我们曾经给你们的补给箱中。这也是我们选择帮助你们的一个原因，我们也曾受到帮助。
//
//Ranson：你们认为这个层级还会有其它生物吗，或者说是神？
//
//脊灵：它们即便真的存在过，现在也早已不复存在了。而说到神…我想我们曾经想做这个地方的神，但显然我们实际做不到。
//
//[短暂的沉默]
//
//Ranson：感谢你可以回答我们的问题。你可以现在就找到我们前哨站的工作人员，他们有很多故事可以交易。
//
//脊灵：你有故事吗？
//
//Ranson：我？
//
//[Ranson似乎在思考，但脊灵打断了她]
//
//脊灵：忘掉那句话吧，我们会在明天来交易。再见。
//
//[椅子在地面滑动的声音]
//
//Ranson：等等！
//
//[椅子滑动的声音停止了]
//
//Ranson：你是否在这个层级见过一个大概身高…呃…一米八左右的黑发男子？他们告诉我他过去曾被派遣到这里——
//
//[脊灵打断了Ranson的话]
//
//脊灵：我想这个地方里有很多和你描述相似的人。
//
//Ranson：——他大概长这样。
//
//[纸张从衣服口袋中拿出的声音]
//
//脊灵：你的名字叫作Emma对吗？
//
//Ranson：对。
//
//[长时间的沉默，夹杂着Ranson的抽泣声]
//
//脊灵：抱歉，你需要自己去寻找他。
//
//[一阵脚步声，然后是开门和关门的声音。Ranson在房间里哭了起来，哭声延续了很久，夹杂着一些听不清的话语]
//
//<记录结束>
//
//
//
//
//
//雾角
//
//我的名字是什么并不重要，重要的是你是否在看我写的东西。
//今天就是我来到这个该死的层级的第十六天，我实在是对我还活着这一事实感到不可思议。第一个报告这一层的那位流浪者，非常准确地描述了这个层级。即使我们针对他的话做了很多准备，还是无法避免“薄雾”探险队第一次任务的彻底失败。
//
//负责写报告的是Josh，而他已经在前天成功切出这一层了。我想他现在已经把这一层的层级报告上传到资料库了。Emily和Berson在第一天死了，Jeffery在第三天没能从那只窃皮者爪下逃脱。Rosea在大概第四天的时候被这一层的异常性质搞疯了，而我们已经找不到她了。Walt在我们逃离笑魇的时候腿被割伤了，我们从那些箱子里找到了绷带，但是太晚了，这个地方的敌对实体太多太多了…于是，我和Josh后来就成为了唯一…唯二的幸存者。但是现在他也走了，所以这个地方就只剩下我，还有一大群的实体。
//
//我们并非第二批也甚至不是第三批来到这个层级的人类，大约第12天的时候我们找到了一个小社区，一共有8个人。他们有离开这个层级的方法，但必须要服从一个规矩。我们并不想等那么久，于是便先离开了。这个层级里还游荡着一种类似无面灵的实体，它们一直跟在我们后面，胡言乱语着一些所谓的危险。但不管是它们，还是那些流浪者，都不重要。最重要的是那些被引来的实体。那些让人不寒而栗的脊灵。
//
//"脊灵"这个词是我见到它们后脑子里想到的第一个词，而为什么不叫脊人或者刺灵…我不知道。Josh认为这个名字起得很好，而我却根本不清楚我是怎么想出这个名字的。它们附近的空气就像是被冻住了一般，充满了恐惧与绝望。甚至比这一层的恐惧效应（Walt先提出的这个观点，他认为这一层让我们感到没有来由的恐惧是因为它含有的异常性质）
//
//于是我们本能地逃跑，想要逃离这些东西。但我们两个被树枝绊倒了，然后切入了这个层级的第二个区域，或者说是这个层级的子区。我现在还在这个区域，因为我们找不到回去的方法。这里的实体甚至比之前那个区域还要繁多和凶猛，但每一次我们都成功逃脱了，我们不知道我们是怎么做到的。我想可能与那些蓝色迷雾有关吧……
//
//
//
//
//
//Josh在前天一不小心撞上了一棵扭曲成螺旋结构的树，他成功切出去了。
//
//我不停地撞那棵树，但除了头破血流以外没有收获任何东西。
//
//我撑不住了，一次次地和那些实体赛跑让我失去了大量的体力，而且之前在补给箱内收集的物资也都快用完了。
//
//直到今天，我发现了这里。
//
//闪着光的灯塔，如同乌云之中的一缕阳光。它是那样的虚无缥缈，却又那样的真实可见。
//
//我推开门，进入到这座建筑的内部。
//
//这里既温暖又舒适，一层里有一个小壁炉，它还在燃烧着。
//
//一个锈迹斑斑的小牌子挂在壁炉旁的墙面上。
//
//"雾角"
//
//这里还有别人吗？
//
//我还是决定爬楼梯上楼，试一试塔顶是否能看到更多的东西。
//
//爬到一个有窗户的平台时，我透过窗户向外看去。
//
//我看到的不再是子区里那些扭曲的树木，而是变成了我刚进入这一层时那片森林的样子。
//
//我似乎回到第一个区域了。
//
//我砸破了那扇窗户，把腿跨过窗台。然后让脚悬在了半空。
//
//即使回到那里，我也出不去了。那个社区的人只不过实在自欺欺人，他们屋子里挂的牌子我和Josh看得一清二楚，那个社区只曾经把两个人成功送了出去，而原来那里却共有28个人。
//
//我感受到了绝望，深深的绝望，即使是低沉的雾角声也无法将它穿透。
//
//我一直都比其他人幸运。而最幸运的那一次就是我遇到Emma的那一天。
//
//我们在前厅时就筹备好了婚礼，但我们却没有等到那一天。
//
//那个晚上，在几米高的海啸打到我们的船上时，我们进入了这个被称为后室的人间地狱。
//
//但我们都不在乎，因为我们至少还有彼此。
//
//可老天就是想和我们开一个玩笑。我们在一个危险的层级走散了。
//
//当时我们都已加入了M.E.G.，所以都觉得只要跟紧队伍就可以很快地找到对方。
//
//至少我是这么想的。
//
//我跟着队伍去了很多基地和前哨，多到我都数不过来.
//
//但我一直都找不到她。
//
//她的面孔却在我的记忆中越来越模糊。
//
//她是否也正在寻找我呢？
//
//我把腿缩了回来，避开被我打碎的玻璃碎片，继续向灯塔的顶端前进。
//
//可这楼梯似乎永远都没有尽头。
//
//我想了很多事情，包括那些要夺走我生命的实体。它们是否是真实的，或是只是我的恐惧作祟？
//
//那么这座灯塔又是否是真实的？它似乎联通这一层级的两个区域。
//
//但这是不可能的。
//
//我踏上了最后一节楼梯。
//
//眼前却不是一座灯塔的顶端该有的样子。
//
//我继续向前行走，小心地打探两侧。
//
//这个位于塔顶的走廊漆黑一片，长度远远超过了一座灯塔顶端该有的长度。
//
//它似乎和楼梯一样无穷无尽。
//
//我看不到尽头。
//
//无穷
//无尽
//
//
//终于，我看到了朦胧的光，它就在我的眼前。
//
//那里就是尽头，那里就是回家的路。
//
//在我奋力向前奔去的时候，我的脑海里浮现了一个我从未见过的场景。
//
//我正和Emma站在一座教堂的内部，她看起来和我们刚分别时几乎一模一样，甚至更加美丽。一个模糊的面孔站在我们后面庄严地讲话。
//
//"Emma Ranson，你是否愿意嫁给——？"
//
//离那扇透过灿烂的阳光的门只差一步了，我不顾一切地向它跑去。
//
//我到了。
//
//我推开了门。
//
//而我脑海里的那个场景仍然在我眼前。
//
//我停住了，等待着那个我梦寐以求的声音。
//
//然后我就听到了她，她的声音依然是那样的悦耳，那样的美妙。
//
//我满心欢喜地跑进了阳光之中，她的声音还在我的脑海中挥之不去。她只说了几个字，而那几个字却是我一直以来的遗憾。
//
//"我愿意。"
//
//你愿意帮助作者与他自己的恐惧和解吗？
//« Level C-429 | Level C-430 | Level C-431 »
//
//Footnotes
//1. 记录显示流浪者在树梢上被实体注意到的概率比在地面上多了80%。
//2. 该种实体似乎仅出现在A区
//3. 该种实体似乎仅出现在A区
//4. 虽然这是多数流浪者切入Level C-430的方式，但该方法并不可取，因为它极不稳定。通过这种方法，流浪者基本都会直接切入至本层级A区内距离地面9~30米的随机位置，有严重摔伤或被树木刺穿的风险。
//5. 该方法并不可取，因为流浪者很可能在被卷入龙卷风时就已严重受伤。
//6. 目前暂且命名为"C区"。
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1430{}