//Level C-478
//评分: 
//+23
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
//不安全
// 
//无实体危害？
//《缝纫店守则残本》
//您好，流浪者，欢迎来到后室中人气最高的缝纫店，只要您能仔细阅读这篇文章，相信您一定能在这个缝纫店中采购到您心仪的衣物并安全离开。
//
//这个层级大体上分为两个区域，第一个区域是购物区，而第二个区域是展览区。我们会分别告知您这两个区域的相关信息及需要遵守的条例。
//
//购物区
//1. 这个区域有着大约700平方米的面积，由木质地板，黄色墙壁，黄色天花板与黄色吊灯组成。当它们不符合上述描述时，请您保持镇定，假装它们就是原来的样子。无论您看到它们变成何种颜色，都不要提醒坐在前台的收银员。
//
//如果在店内情况异常的时候，收银员自言自语地抱怨着，无论您听到什么都请假装没听见。
//
//2. 整齐划一的架子上会挂着五颜六色各种各样的衣物，包括但不限于羊毛衫，羽绒服和背心等。其中所有衣物都是可以随意拿取试穿的，但如果您想要试穿黄色的衣物，请您让收银员来帮您拿取，否则后果自负。
//
//3. 当您感到局部空气湿度上升的时候，请避免与任何布料进行目光接触直到该异常现象消失。
//
//4. 这里的所有衣物都明码标价，尽管黄色的衣物价格稍贵，也请不要询问收银员这样做的原因。那些没有标价的衣物请不要试穿，谢谢合作。
//
//5. 这个区域的墙壁上虽然有窗帘，但是后面并没有窗户，其也不在出售范围内。如果没有必要的话请尽量远离并避免进行视线接触，尤其是当它们不正常地抖动的时候（此现象通常会伴随着周围的空气湿度上升这一现象同时发生）。
//
//6. 收银员是可以完全信任的，只要您不提及不应被提及的话题，不试图对其造成伤害或是言语侮辱，有必要的情况下服从他的指挥，他就会尽力保障您的人身安全。
//
//7. 此区域中有三扇上面贴着标签的木门，其中一扇通往工作室，一扇通往储物室，一扇通往试衣间。它们都存在着一定的危险性，但试衣间是相对安全的。
//
//（I）如您想要用一些布料来定做衣物，请你将这些布料交给收银员并与他一同前往工作室。工作室里有很多未完成的衣物，请不要因为好奇而凝视它们太久，无论它们看上去多诡异，告诉自己这就是给人类穿的衣物，也只能是给人类穿的衣物。
//
//技艺高超的收银员同样会编织裁剪衣物，但具体手法是严禁外传的，所以当收银员于工作室内工作时，请您自觉离开工作室，否则收银员是不会开始工作的。
//
//您在任何时候都不能单独持有未结账的衣物前往工作室，以防与半成品混淆。收银员会阻止您。
//
//如您独自一人前往工作室，请务必不要接触到以任何形式存在于内的黄色丝线，也不要去试图寻找黄色丝线的尽头。
//
//（II）储物室中放置着一些没有危害的人形模特，它们的颜色多为黄色并且数量一般不会超过5个。如果人偶的数量超过了5个但是没有到10个，请立刻告知收银员这一现象，他会把多余的模特放到展览区的。
//
//如果您在其中发现了十数个假人模特，请尽快前往本层级的第二个区域“展览区”，无论收银员是否同意与您一同前往。展览区的入口会在后文中提到。
//
//（III）当您在此区域并未观察到任何异常现象但突然感到不安的时候，请立刻以“试穿衣物”为理由，随机拿起一件颜色不为黄色的衣物前往更衣室。这个层级加上收银员一次最多存在两名流浪者，所以更衣室是绝对不会被占用的。同样的，因此，此层级不存在任何基地，据点和前哨。
//
//如果您发觉门后有东西在试图阻止你进来，请不要多虑，这只是木门年久失修而已，用力一推就好。其中的红色假人模特是用于展示衣物而被放置在其中的，但尽管如此也不要把自己的衣服放到它的身上，请好好地放在椅子上。期间绝对不要将目光移开挂在木门上的镜子，您已经被警告过了。待不安的感觉消失后，正常离开更衣室即可。如您感到木门较为潮湿，请在离开更衣室后通知收银员，然后在收银员通知您打扫干净之前不要再与木门或收银员进行目光接触。
//
//8. 如果您的视线中突然出现从头顶垂至地面的丝线，请不要抬头。此时向收银员求助会令您陷入更大的危险，所以最好的办法就是假装没看到它，然后一点一点地向展览区移去。
//
//9. 当您完成购物后，您可按照附录中的方法离开这一层级。请注意，未付款就试图离开会被收银员制止。
//
//10. 如您对缝纫技艺高超的收银员的其他并不用于售卖的衣物感兴趣，或是想要从展览区离开，您可以要求收银员带您进入此层级的另一个区域“展览区”，入口就是收银台背后的铁门。如您出于其他原因需要进入展览区，收银员将不会与您一同进入。展览区的相关事宜请见此文件的“展览区”部分。
//
//0788f58b3e4187ed.jpg
//如果您的视线中突然出现从头顶垂至地面的丝线，请不要抬头。
//
//展览区
//1. 展览区同样有着大约700平方米的面积，其中同样有着黄色墙壁，黄色天花板，木质地板和黄色吊灯，只不过灯光比购物区更为昏暗，因为过强的光照会影响展出品的质量。其中展示出的各个艺术品均为收银员与一位不知名的艺术家制作，欢迎各位流浪者随意欣赏，但请不要在未经过允许的情况下跨过警戒线去触摸展览品，否则您的人身安全将得不到保障。
//
//2. 展览区内严禁拍照，为了避免引起不必要的误会，请收起任何存在着反光率不小于10%的平面（或曲面）的物件。
//
//3. 除非您与收银员一同进入此区域，否则请不要发出没有必要的声响，就算周围没有人。艺术是需要在安静的环境下静静欣赏的。
//
//4. 有些展出品有着“DIY”标识，此类展出品您可以随意拆解，并且使用附近的缝纫机进行组装。请注意安全。如您在此过程中感到周围空气湿度加大，请让收银员来为您继续按照您的意愿组装与拆解这些衣物。请不要以任何形式破坏除了带有“DIY”标识之外的任何展出衣物，谢谢合作。
//
//5. 此区域中存在着一些专门摆放布料的房间，如红毛线房间，黄毛线房间等。这些房间的墙壁均由毛线组成。在不破坏它们的前提下，您大可以放心地触摸挑弄它们，但与某些颜色的毛线的互动是受限的：
//
//（I）任何时候都不要单独进入黄毛线房间。
//
//（II）进入红毛线房间之前，请确保周围的空气湿度不大于75%。
//
//（III）白毛线房间内通常会存在着多个人形模特，不要害怕，它们是收银员放到这里的，但如果其中出现了红色的人形模特，请保持与其进行目光接触（即使被毛线遮挡也是如此），然后慢慢地后退到其他的非黄色的毛线房间并在其中等待至少3分钟。
//
//6. 展览区内会零零散散地摆放着一些用于展示的人形模特，您可以用未被警戒线封起的衣物来装饰它们，以来得到对这些艺术品的更直观体验。但请您不要为其穿上自己的衣服。
//
//如果人偶的数量少于五个，请您继续参观展览区的其他部分，在此期间不要回到购物区或是试图离开这一层级直到人偶数量恢复正常。
//
//7. 当您完成展览或是出于其他原因想要从这里离开这一层级时，请您按照附录提供的方法离开。
//
//收起
//入口
//在Level C-1中可能会找到一间无人的缝纫店。进入后关闭其内的所有灯光，将自身置于黑暗三分钟后，你会看到店铺内有一扇门缓缓打开，门后亮着昏黄色的灯光。进入这扇门并穿过一片长廊后可来到Level C-478。
//
//出口
//有些情况下，在区域一昏暗的工作室内，你可能会于一张桌子的下方找到一扇方形活板门，进入并在一段狭窄的过道内爬行约15-20分钟，你会来到Level C-67。有时这些活板门的大小并不足以容纳正常体型的人类进入。
//在区域一的储物室安全的情况下，有时您可以在其中找到一个白色的塑料假人模特。使用在工作室找到的材料缝制一件衣物（衣物的款式任意 ，但如果假人模特存在肢体缺失，则制作的衣物也需要进行相应改动），将其穿戴在假人模特的身上。当你离开储物室时你会发现自己来到了Level 11内一间商场的走廊。
//在区域二的红毛线房间内，拨开组成墙壁的毛线，将身体完全埋入其中。约30秒钟后你会开始感觉到皮肤疼痛，在这时以切出的方式离开墙壁，你可能会发现自己来到了Level C-20。若以此方式离开本层级失败，不要再尝试第二次了。
//拆解区域二中的物品作为材料并用它们制作一件衣物，脱下原先身着的衣物并将制成的衣物穿戴在身上后你将会进入一段恍惚的状态，清醒后你会发现自己身处Level C-56或Level C-88。这时你会感到身上的衣物变得潮湿，闭上眼睛将它们脱下并丢弃，这之后请不要观察它们。
//
//
//
//
//
//收起
//记录1
//又是一个全新的层级……我就不应该摸黑走这么远的……算了，反正我在前厅也没什么亲人，来到后室之后也没遇到什么有意思的流浪者……大不了就是换个地方死呗。
//
//我刚一进来，身后的玻璃门就消失了。这也是符合后室的特性的。
//
//很奇怪，这里有着很多展示衣物用的架子，但是上面除了零零散散的几片黄色布料之外什么都没有……一个被废弃的服装店？这好像也说不通，店里一尘不染呢……那这里应该就是个刚开的服装店吧。好多衣架上面都有价码，XX瓶杏仁水……但是下面什么东西都没有。
//
//虽然这里没有任何实体存在过的痕迹，但是我总是感觉有什么东西在盯着我，是这一层级的特性使然吗？
//
//我先勘探一下这个层级吧，希望能找到出口。
//
//……
//
//先前我总是听到人们谈论“层级意识”，这么虚无缥缈的东西真的存在吗？
//
//……
//
//记录3
//祂不让我把我和祂相遇的部分具体地记录下来，我就只好在这份记录里一笔带过喽。长话短说，就是祂饶了我这个闯入者一命。
//
//显然我在第一份记录里记下的内容相当打脸，层级意识是存在的，而就是祂为这一层级带来了异常的特性。
//
//祂好像很喜欢我的样子，或许是因为我没有尖叫着向祂开枪？抑或是这里好久没有来人了，祂被孤独折磨，对我产生了怜悯之心？谁知道呢。
//
//出口还是没有找到，不过所幸的是这里的工作室总是有着充足的食物供给，每天都会自动补充。既然层级意识不会想办法伤害我，这里也没有实体，出口慢慢找呗！赖在这里也不是不行。
//
//记录4
//随着时间的推移，出口我还是没有找到。虽然我有时候能在工作室的桌子下方看到活版门，但我打开发现它们都是通向地板的，根本出不去。
//
//除此之外，这里还有一个平平无奇的卫生间，啥也没有的储物间和一个空荡荡的试衣间，别问我为什么知道后面那俩以后会拿来干什么。
//
//随着对祂的观察，我得出了一些结论：店里的黄色衣服全是祂用自己的头发一点一点用缝纫机织的，其他颜色的衣服都是祂用不知道从哪里搞来的颜料染的。祂很嫌弃颜料之类的东西，所以每件黄色衣服祂都很仔细的摆放，而其他颜色的衣服却不怎么注意放置位置。
//
//想着老在这里天天吃白饭可能让祂不爽，我自觉的上去帮祂整理各色衣服，顺便教了教祂怎么缝出正常人类能穿的衣服。祂一直在很努力的尝试，可是祂总是缝不好。
//
//……
//
//有一天，在试图缝制帽子的又一次失败后，祂焦急地流下了泪水，但当我试图去为祂擦拭的时候，恐怖的事情发生了：那些液体如同活了一样直直地冲向我的双眼，要不是祂用头发死死护住我的眼睛，估计我已经是个盲人了。千万不要让祂哭啊。
//
//有时候什么都不做，就这样静静地看着祂缝制衣物也挺有意思的。出口……我也会接着找的……吧。
//
//记录5
//本来我还在踌躇着到底要不要继续寻找这里的出口，但今天发生了两件事让我决定一定要留在这里。第一件事是祂的帽子终于缝好了，那是一顶黄色的休闲帽，祂毕恭毕敬地亲自为我戴上，看上去很高兴的样子。
//
//第二件事就是这里来了另一位和我一样的冒失鬼，然而他就没有那么幸运了。他看都不看就随手拿起一条没标价格的黄毛巾擦嘴。
//
//然后，然后祂就生气了。呃，具体的过程我没看到，因为祂用头发再次遮住了我的双眼。我只听到了可怕的骂声和劈劈啪啪的电火花声，然后店里就多了一具假人模特了。
//
//我的脸色肯定是很难看的，可祂依然高兴地把这具假人送到了我的手里。这可不妙。
//
//我和祂的交流内容就不写在这里了。太长了，并且祂的心理年龄好像不到10岁，要像哄孩子一样和祂沟通才行。“是他们先欺负我的！”祂得出的结论就是这样。
//
//唉，我不入地狱，谁入地狱啊……只有我留在这里，我才能在其他流浪者惹祂生气之前保护好他们。其实也是在保护祂吧，因为我看到祂黄色的肌肤被烧焦了一些，这个层级的墙面上也多出了几处黑迹。我简单的给他包扎了一下，至于层级中的那些地方……到时候整上窗帘挡一下吧，不然看着太难看了。好在祂看上去不觉得疼，过几天就会好的……应该吧。
//
//今天我再次勘探这一层级时突然发现，收银前台是整个层级中唯一一个落灰的地方。
//
//那么……这里是不是缺少一个指路人……或者收银员呢？
//
//记录6
//那个假人怎么看怎么不舒服，我干脆把它放到了平日我们最少去的更衣室里。祂不喜欢里面的镜子，好几次都被祂差点打碎了。它红彤彤的样子真是骇人，令人不禁联想起他悲惨的遭遇……
//
//顺带一提，今天我在打扫收银台的时候发现墙纸掉下来了，它后面居然有一扇铁门，可能祂闲来无事的时候也有着撕手上死皮的习惯吧。我斗胆走了进去，发现里面是另一个几乎一样的空间，只不过灯光要更加黯淡，没有任何东西放在里面，结构上也没有这里有的三个房间和厕所。
//
//其中被墙分割出了几个小房间，但奇怪的是这些墙只有骨架，没有混凝土来填充。在这个层级里无所不能的祂肯定意识到我发现这里了。
//
//祂解释道这里是祂休息的地方，但是觉得这里太难看了不想让别人看到。后来我才知道，我不但是第一个来到这个层级的人，唯一一个能与祂进行正常交流的人，还是第一个看到这片区域的人。
//
//“既然如此，我们一起装潢这里，怎么样？”
//
//祂微微别过头去，不是用左手而是用头发握了握我的右手。真可爱。
//
//顺带一提，今天来了两个倒霉鬼，都被调皮的祂杀死了。
//
//第一个可怜虫手贱地把墙上的窗帘掀开了，里面的伤口一下子就暴露出来了。看来我又错了，祂只是不想在我面前表现出痛苦的样子而已，那些伤口永远不会愈合，甚至这样子直接接触空气都很疼。祂痛地哭了起来——虽然祂习惯了无声的哭泣，但是祂的眼泪还是润湿了窗帘——想起先前的教训，我不得不别过头去，以免被祂的泪水误伤。
//
//我只听到了咔咔两声，和一个东西掉到地上的声音。他的脑壳应该是被打穿了吧。待我再回过头去检查的时候，应该倒着他尸体的地方只有一具黄色人形模特。
//
//第二个流浪者吗……虽然他没犯什么错，但是他和正在编制衣物的祂撞了个正着，祂吓得够呛，用头发勒死了这个倒霉的家伙。那个人疯了一样的想要逃出这里，但是祂哪里肯罢休。试想一下，如果你手里有个苍蝇拍，看到了你最害怕的蜘蛛，你会不会拼了命的去打死它？每个人的答案都是不一样的，但显然祂下得去手。
//
//Tmd，又死一个。看着祂疯狂地舞动着祂的头发，那个可怜的家伙甚至没来得及发出一声悲鸣。看来祂不仅是个调皮的孩子，而且还是个相当胆小的孩子。一具白色的人型模特很快出现在了这家缝纫店里……
//
//原来如此，拼命抵抗的流浪者会被做成红色人形模特，不知不觉中死去的流浪者会被做成黄色人形模特，而慌不择路的流浪者会被做成白色人形模特……转眼间，储藏室的作用就体现出来了。毕竟更衣室塞不下这么多东西。
//
//看来我要想个办法让那些闯进来的人不要这样随随便便地惹恼，惊吓或是伤害祂，可我要怎么办呢……
//
//记录7
//随着时间的流逝，祂缝纫衣服的技术终于有所提升了……再过两年，祂缝出来的东西就能让人类穿了。不过祂倒是位很厉害的抽象派艺术家，祂缝出来的很多东西……至少是有一种诡异的美感的。我把它们放到了祂的卧室里，给祂习惯睡觉的时候抱着的模特们纷纷穿上。
//
//说到模特，那些红色的模特总是让我觉得不舒服。每当祂休息的时候，那些粗鲁的家伙就会蠢蠢欲动起来，试图夺走我的身体重获新生。为什么我这么轻描淡写，因为每一个试图这样做的红色模特都被祂又重新拆成了碎片，拿去做染料了。对，那些奇怪的颜色全部来自于人体组织。那个最先被放到更衣室里的模特倒是挺安分的，反正只有顾客会进去和它亲密接触。
//
//然而，就是有这么一个“亲密接触”的人遭了秧。只见那个顾客进了更衣室，在里面不知道捣鼓了些什么之后冲了出来，怒气冲冲地指着我的鼻子骂了起来：“你这个和实体勾肩搭背的狗畜生！你居然愿意就这样当祂的宠物？看老子给你一拳打醒你！”然后这个人的下场我就不多说了，他连人形模特都没剩下，只剩下了一堆血迹。
//
//那些遇难者的灵魂被祂囚禁在了人形模特里，时刻等待着或是夺路而逃或是拼命报仇的机会。奇怪的是，那位死的不明不白的流浪者被做成的人体模特是红色的，而不是黄色的。
//
//宠物吗……无所谓了，如果硬要这么打比方的话，祂也像条粘人的，不听管教的小狗。……看来这么评价祂不会让祂生气。
//
//总之，除了更衣室里的那个红色模特常在之外，其他的红色模特大多都被祂打碎成血肉做成染料了（后来我问了下，其他颜色的染料在祂打碎第一个人形模特之前是完全没有补充过的，也就是说是一开始就有的“存货”）……毕竟总有人试图与层级意识对抗，而他们总是不可避免地被做成红色人形模特。
//
//再说回祂的卧室，除了我们共同制作的一些衣物之外，为了方便存放材料，我们还利用那些空荡荡的骨架，把各种各样的丝线织成了墙。祂肯定是最喜欢黄色的那个房间啦，不过人形模特什么祂还是拿来放在白色毛线房里。别的颜色都没有什么特殊的了，不过祂唯独向我着重强调了那个红毛线房间。祂告诉我“什么时候想离开就走这里吧，但只许你从这里走掉哦。”
//
//其实如果我想走的话早就离开了，办公室里的暗门会在祂忙着玩人形模特的时候开洞，走那里我听人说会去到Level C-67。别人的话，趁祂不注意应该也可以从这里走掉吧……“看我心情吧。”哦糟了。
//
//我怎么会离开呢？如果我离开这里，又让谁来为误入这里的流浪者们提供指引呢？又有谁像祂一样，愿意接受我的存在呢？
//
//记录8
//终于又抽出时间来写记录了。
//
//我思来想去，终于为流浪者们写好了一份名为《缝纫店守则残本》的指南。为什么我不直接告诉流浪者们这一切的真相？很简单，首先祂不想让别人知道祂的隐私，然后一个能与流浪者正常沟通的层级意识势必会引起关注……所以我把它写成了规则怪谈，这样，流浪者就会对祂畏惧三分，不敢做出什么出格的举动（当然这种时候我能救下他们就救下他们），而且不会吸引一些组织对此层级进行过于深入的调查，尤其是那些有着摧毁层级能力的组织……所以，这算是个两全的做法吧？
//
//为了防止流浪者们看不到，我专门放了个白色的假人模特在我最早进来的地方的不远处，举着牌子，上面挂着《缝纫店守则残本》。可以直接扯下带走的。
//
//随着时间的推移，来光顾这一层级的流浪者渐渐变多了，虽然在有着我的指南的情况下，祂通常不会伤害流浪者，但变大的客流量还是让祂有些不舒服。这种时候我就会叫祂回卧室去玩，等祂不那么害怕了再出来。现在，祂总是要带上几个人形模特才愿意来往于这两个区域之间，所以哪里人形模特变多了就说明祂不但在附近，而且还开始对存在于附近的流浪者感到不满了。
//
//工作的时候祂有时也会在天花板上看着我们，但祂的头发也会垂下来，要是不幸的流浪者被祂的头发吸引并和祂对视时……我不好说，总是流浪者被吓个够呛，然后他们发出的声音又把祂吓得够呛。为什么会害怕呢？一定要让祂化成人形这帮胆小鬼才受的了吗？估计他们是看不到了，因为祂只会在这层没别人的时候化为人形与我对话。
//
//有些时候，厌烦于来往的流浪者，祂会不爽地给层级染上染料来进行抗议，这种时候我只好轻声安慰祂，只要不被当成神经病就好。我是说，对那些来“购物”的流浪者们来说只要这样就好。当然它们很快就会褪去。
//
//把祂的卧室改成“展览区”其实还是祂主动提出的。“让他们好好看看你的东西，然后就会掏钱买更多了！”祂是这么说的。那些祂喜欢的艺术品都被警戒线围起来了，你也知道拿走小孩子最喜欢的玩具之后他们会怎样哭闹吧。
//
//展览区好是好，就是人形模特有时候有点扎眼睛。我把它们都放在白毛线房间里了，这样会整齐一些，并且据说这样会限制一下它们体内躁动的灵魂。当然出现在这里的红色人形模特就不好说了。我不怕，我有祂呢。
//
//似乎是不想破坏我们的艺术品，祂现在只在黄毛线房间里睡觉。不要打搅他哦。
//
//看到别人用diy玩具拼成的衣物比自己好，祂居然会伤心地哭起来。不过据说此时祂流下的眼泪意味着承认，穿着被这种眼泪淋到的衣服将可以离开这一层级。当然眼泪本身的副作用还是在的。
//
//给白色的假人模特，也就是有着强烈的逃出欲望的那些模特穿上自己亲手缝制的衣物据说会令他们得到救赎，然后作为回报你会被传送出这一层级。
//
//这些方法我倒是从来没有试过，不过估计是真的，所以我也写到指南里了。
//
//好了，说点开心事吧，自从出了这本指南之后，我们这家小店的存活率从10%上升到了70%，并随着时间推移攒下了不少瓶杏仁水，到时候我生病的时候也不用太担心了。可是我至今都没有找到治愈祂身上的伤口的办法。
//
//这样的日子会持续多久呢……总有一天，我会耗尽我的生命，而祂又会毫不留情地杀死一片又一片的流浪者，最终招来祸害……但至少，现在让我感受下祂为我带来的温暖吧。
//
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1478{}