//Level C-414
//评分: 
//+9
//+
//–
//X
// 
//
//生存难度：
//等级 4
//
// 
// 
//大量实体
//Lavel C-414是后室C层群的414层。
//
//描述
//Level C-414外表是一个巨大的墓地，分为三部分。
//
//cross-175824_1280.jpg
//一名流浪者在白天拍摄的图片
//
//第一部分：
//第一部分为一个中等规模的礼堂，桌子上会随机刷出少量杏仁水。礼堂在“特殊事件”（见下文）时是安全的，因此，建议流浪者们在晚上时进入礼堂躲避。因为未知原因，实体（例如窃皮者，笑魇，无面灵等）会在距离礼堂门口约10米处停下并失去攻击欲望，目前M.E.G.正在调查此现象的原因。
//
//第二部分：
//第二部分为一个巨大的仓库，里面有大量装箱的杏仁水以及可食用的能量棒，但是，其内部有非常多的极度危险的实体，因此不建议流浪者们进入，M.E.G.已于门口布置持枪守卫，除非已经报备并出示许可，否则守卫不会允许任何人进入。目前仅有一位M.E.G.特工进入，下面是他对里面的描述。
//
//- 关闭
//M.E.G.特工的采访记录
//姓名：陈[数据丢失]
//年纪：28
//记录时间：2019年5月[数据丢失]
//
//（记录开始）
//采访者alan：你好，陈[数据丢失]，距离你一开始进入 仓库
//第二部分
// 已经两个星期了，现在可以描述一下里面吗？
//陈[数据丢失]：emmmmmm，怎么说呢？
//采访者alan：您不用害怕，把您收集到的信息说出来就可以。
//陈[数据丢失]：刚进去的时候没有特别多的实体，而且这里有很多已经装了箱的杏仁水和能量棒。
//采访者alan：然后呢？
//陈[数据丢失]：当我往前走了一会，我感觉周围突然出现了什么东西。
//采访者alan：大概走了多远呢？
//陈[数据丢失]：应该走了50米左右，入口那里就有很多货架，非常遮挡视野。
//采访者alan：您还记得天花板大概有多高吗？
//陈[数据丢失]：（努力回忆）记不清了，当时没有注意，不过应该高过6米吧。
//陈[数据丢失]：当时往前走了100米之后突然，有数不清的实体突然出现然后往我这跑过来
//采访者alan：您还记得大概有那些实体吗？
//陈[数据丢失]：让我想想……我不记得了，当时没有注意。
//采访者alan：我知道了，谢谢你的配合，祝你后室之路一帆风顺！
//
//（记录结束）
//应为该特工的描述以及拍摄的图像[文件损坏]来看，M.E.G.决定封锁该部分，并派出持枪守卫，以免发生意外。
//
//第三部分：
//第三部分是最大的部分，为一片大小未知的墓地。此区域有大量的墓碑。在晚上，将有大量危险性实体于墓碑下的土中钻出，并对视野里的任何流浪者发起攻击，因此，建议流浪者们不要在Level C-414中长时间逗留，如果不得不在此过夜，则建议在晚上特殊事件发生时进入礼堂躲避。
//
//基地、前哨和社区
//M.E.G. “守门人”
//团队共有三人，其中两人持有枪械。
//紧急情况下会给予救急物资。
//友善，但不接受加入申请。
//职责：不让未经允许的人进入 仓库
//第二部分
// 
//“自由人”
//共有13人，领导者未知
//会在礼堂处交易杏仁水，能量棒等物资
//被动且友善
//实体情况
//该层级除了常见的危险实体（窃皮者，猎犬，悲尸等）外，还包括特有的实体“木乃伊”。
//
//木乃伊
//木乃伊外观为被白色绷带缠绕的人状实体，拥有感染性。他们会成群地向流浪者发起攻击。木乃伊十分害怕火和任何光亮的东西，其中，火可以直接消灭木乃伊，这也是M.E.G.认为最有效消灭木乃伊的方式。但是流浪者们不应该尝试消灭，因为一旦消灭就会有更多的木乃伊会出现。当流浪者被木乃伊攻击时，流浪者会缓慢的被感染。目前，这种感染方式是由木乃伊攻击的伤口恶化而形成的感染，当流浪者被感染时，流浪者应该迅速逃离本层，这将使病毒在一星期内死亡。当被感染时应该与其他流浪者保存1.5米距离，防止传染。
//下面列出一些应做和不应做的事情以及被感染时会出现的症状
//
//应做
//最快速度离开本层
//在一星期内不与任何人接触
//调养身体
//不应做
//在症状消失前正常与其他人接触
//一星期内（如果症状消失可以提前进入）进入本层
//长途跋涉，做剧烈运动
//被感染时会出现的症状
//红肿
//感觉身上会长出奇怪的东西
//全身痒
//头晕
//呕吐
//出现幻觉
//如果有以上症状请立即喝杏仁水，杏仁水可以缓解症状
//
//出入口
//入口
//在Level 11中找到一个墓地进入
//在Level 9步行时小几率晕倒然后出现在Level C-414
//出口
//走出大门会来到Level 11
//如果你在第三部分被活埋在土里你将会在Level 14中醒来
//假如你不幸在该层级死亡，你可能不会死亡，而是传送至Level C-415
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1414{}