//Level C-416
//评分: 
//+8
//+
//–
//X
// 
//
//生存难度：
//等级 4
//
// 
// 
// 
//Level C-416是后室C层群的第416层。
//
//EZyQn4CR5MKcjSs.png
//Level C-416
//
//描述
//Level C-416是由钢筋混凝土等组成的大小不定结构，并由各个走廊连接，但随着深入，将变得越来越不稳定。
//
//Level C-416的大部分都是弥漫着有毒烟雾的狭窄走廊。且该层级中的Wi-Fi强度极好。杏仁水等物品偶尔会出现在Level C-416的地面上; 据了解，这些物品开始以来就已经存在了。通过观察偶尔出现的天窗，本层级被观测到拥有24小时昼夜循环，与前厅不同的是，该层级的黑夜约为23小时。而白天只有1小时。在Level C-416的夜晚时，流浪者碰到实体的概率会比Level C-416的白天碰到实体概率更大，尤其是笑魇。该层级的管道内中发现的黑色粘稠液中是不可饮用的。因为经常饮用这种液体会导致死亡。
//
//因不明原因，该层级经常会出现一种淡淡的白色烟雾。这股白色烟雾一旦被流浪者吸入肺中，将会引来不可逆转的皮肤溃烂，四肢麻木，头脑昏迷的现象，且最终死亡率达到90%，该过程被描述为极其痛苦的状态。虽然杏仁水可以充当一定的缓解能力，但并不能阻止该现象的发生。所以建议流浪者进入Level C-416时佩戴好防毒面具，以防吸入烟雾。
//
//该层级的显著特点是各个位置经常出现火焰，其来源尚不清楚。这些火焰被认为是有"生命力"的，因为它们似乎能定位流浪者的位置，并慢慢向他靠拢，且会和其他火焰合作并捕捉流浪者，因为火焰会“燃烧”一切外来物体，这也是流浪者在Level C-416死亡的主要原因，但使得该层级大部分区域都在光照下。除此之外，窃皮者、笑魇、爆酸者以及少量的小火苗常在该层级出现，这使该层级变得更加不安全。
//
//值得注意的是，位于该层级多处的镜子大小不一，用途不明。流浪者在Level C-416时，时常会感到恐惧或紧张。推定是该层级带来的正常情感。
//
//基地、前哨与社区
//流浪者之盾（S.O.W.）"火把"前哨站
//只有4名成员常驻于此。
//为研究该层级而成立。
//不停的变换位置。
//处于毁灭的边缘。
//经常与位于Level C-271的基地汇报工作。
//友好，并欢迎新成员。
//火人
//共有8名成员
//敌对和仇视流浪者
//拥有较好的武器和装备。
//经常在该层级徘徊。
//入口与出口
//入口
//在Level C-3找到任意一个洞，将进入该层级。
//在Level C-271里面进入火焰。
//Level C-414偶尔会出现一道烫手的铁门，这将到达该层级。
//出口
//走廊里偶尔会出现梯子，往上爬将进入Level C-417。
//任何敞开的门将通往Level C-418。
//深绿色的门通往Level C-415。
//在地上趴着，5分钟可进入Level C-271
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1416{}