//Level C-475
//评分: 
//+8
//+
//–
//X
// 
//
//生存难度：
// 
// 
//存在危险实体
//Level C-475是后室C层群的第475层。
//
//tunnel-1845046_960_720.jpg
//此层级的照片。
//
//描述
//此层级是一条隧道，和前厅中的类似。隧道内部装有照明装置，它们容易出现闪烁或随机故障，也有可能变成红色的。当大量灯具故障时，会增加 “憎恶之红”事件的发生几率。隧道两侧有几率出现生锈的管道，由普通的铁构成，有少量液体会流出管道，这些液体是无色的，有毒，车辆可以使它们无法进入。
//
//构成Level C-475墙壁的为一种未知材料，硬度极高。即使车辆在高速行驶时撞击墙壁，也很难造成损毁。流浪者在层级内会产生随时间不断加重的负面情绪，从而影响其理性判断能力，导致流浪者因意外死亡的几率增大。有证据表明，当你过于恐惧时，也会增加“憎恶之红”事件的发生概率。
//
//进入后，流浪者会在一辆高速行驶的车内醒来，车辆为吉普车，具体型号不明，车速约为每小时60千米，流浪者无法以任何方式离开车辆，也无法转向。据了解，车内会出现瓶装杏仁水，但不要饮用它们。车内有一把钥匙，通常出现在隐蔽的地方，把它插入车内的锁眼后，再踩住刹车，可以使车速降低大约20%至40%，但无法是车辆完全停下。车窗有可能出现裂纹，出现裂纹的车窗可以被尖锐物品破坏，但尽量不要破坏车窗，以免有毒气体进入。
//
//隧道的长度为13.2千米，当车辆行驶完13.2千米后，会行驶回原地，但隧道并不是弯曲的。在行驶一段时间后，有几率出现一堵墙，在墙出现后，车辆的速度会明显加快，可达每小时90千米。如果你可以在撞击中存活，你将离开此层级。墙的出现完全是随机的，最少在行驶62千米时出现，最多为95千米。在墙出现后，你要做的是尽可能使用钥匙降低车速，在撞击时保护头部，这样可以使生还几率最大化。此层级无法同时存在两个及以上的人，尝试多人进入此层级的方法都失败了，当此层级内已有人后，其他任何人将不能切入。这使得进入的流浪者将独自面对此层级中的危险。
//
//“憎恶之红”事件会使此层级变得极其危险，发生概率为5%至15%，流浪者将其称为“憎恶之红”。当事件发生后，隧道内所有灯光的颜色会变成腥红色。隧道内会出现一种未知生物，它们拥有和人类一样的外形，但它们要比人类更高大，约2.6米，且全身均为血红色，表情狰狞，极具攻击性。它们会攻击车辆，直至车内的流浪者死亡。这种未知生物会随着时间变化而增多，普通枪支可以对它们造成伤害，但无法彻底杀死他们。如果发现了这种未知生物，不要直视它们的眼睛，否则你将会 ████████。在这时，出口将不再出现，事件的持续时间仍是未知的，曾有人说事件持续时间为2小时，但此说法未证实。隧道内的管道会向外排放一种有毒气体，它的气味是一种腥臭味，吸入后会使流浪者意识模糊，超过2升后会使人在4分钟内死亡，，车辆可以阻止这种有毒气体进入，但气体可以从出现裂纹的车窗进入。要想在“憎恶之红”事件中活下去，你需要做的事只有一件: 记住自己是一个人类！
//
//基地、前哨和社区
//此层级没有已知的基地、前哨和社区。
//
//入口和出口
//入口
//在任意层级进入一扇沾有血的门，均有几率切入此层级。
//更多入口尚待探查。
//出口
//在车辆撞击墙时存活，即可随机切入Level 69或Level C-98。
//更多出口尚待探查。
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1475{}