//Level C-477
//评分: 
//+8
//+
//–
//X
// 
//
//生存难度：
//极端不安全
//不稳定
//无实体
//Level C-477是后室C层群的第477层。
//
//描述
//Level C- 477是一个半径约为7万公里的巨型岩质球状腔体。腔体到边界距离未知。其有着与常规星体不同的自内向外的重力系统，重力强度约为前厅的2倍。腔内具有含有粉尘的空气。腔体内唯一的光源是其中央的一颗小型脉冲星。尽管具有固定光源，腔内地表仍然较暗。
//
//不安全因素
//
//此层级因脉冲星的存在变得极端不安全。脉冲星具有极强的磁场。在腔体地表上，任何设备都因磁场变得难以使用，会在一定时间内失灵。设备所处位置越高失灵时间越短，在高度足够情况下这种强磁场会对生物产生致命的威胁。因此如果有流浪者不幸至此，请不要随意登上此层级的任何一座高山。而且即使处于地表，生物本身也会受到磁场潜移默化的影响，所以，尽快离开!
//
//pulsar
//脉冲星
//
//此层级内的脉冲星的两个磁极会发射能量极高的辐射束，在腔内被辐射束照射到的地表的岩石会瞬间融化形成熔岩海，熔岩海面以上及其四周甚至还有大量温度极高熔岩蒸汽。因此无论如何不要靠近熔岩海！同时，因为脉冲星的不规则的高速自转，熔岩海通常呈现出狭长的形状，并且任何区域都不会被其磁极长时间辐射，进而使得熔岩海得以快速冷却凝固。正因熔岩海的形成、流动与凝固造就了腔内被高山峡谷所覆盖地表。同时大量熔岩海与辐射束散发的热量也使得整个层级内未被辐射的区域温度不至于过低，但也导致整个层级的温度缓慢升高。
//
//辐射束的照射也是使得此层级极端不安全的原因之一，过去The M.E.G.曾尝试在其测算得出的不会被辐射束照射的低地势区域设置小型基地用以观测与开采腔内的矿石，但在其建成一个月以后便受到辐射束的照射，基地被彻底摧毁，基地内人员全部牺牲。如今这篇报告大部分便是根据基地一个月内传输回的信息写就的。在此以后，亦有许多的考察队至此层级进行短时间考察。考察发现，层级腔内的每一个区域都会被辐射束所照射。辐射束照射整个腔体的周期从两个月到半年不等。许多区域甚至会在短时间内被多次照射。记录部分区域两次照射时间间隔最短的仅间隔20分钟。
//
//由于多次考察带回的温度的测算数据都在不断升高，The M.E.G.决定在2017年中旬不再派出考察队前往Level C-477，Level C-477档案中的生存难度也被修改为“死区”。据相关数据测算，截至2022年4月，此层级内的温度可能已到达200华氏度。
//
//在资源方面，此层级地表下含有大量的本层特有的磁力矿石与其他各种金属类矿石。并且在过去的考察中曾发现部分被辐射束照射的地区出现了大量杏仁水雾，因此推测在腔体中很可能存在杏仁水海洋。
//
//在稳定性方面，Level C- 477并不稳定。据推测，脉冲星能够稳定在腔体中央很可能是因为Level C-477地表下均匀分布的磁力矿石形成的均匀磁场与其特殊的重力系统将之固定。但随着层级内部的地貌因辐射束的照射而不断改变，矿石的分布情况可能会被改变，磁场可能不再均匀，这可能导致脉冲星小幅度偏移。而具有巨大能量的脉冲星偏移带来的结果是毁灭性的。因此研究人员推测，此层级会在约10年以后彻底崩塌。
//
//在实体方面，本层极其恶劣的环境导致没有任何实体可在此存在。
//
//基地、前哨与社区
//无任何基地，前哨与社区。
//
//入口与出口
//入口
//在Level 8中游荡时间足够长你就会看到一个发着昏暗光芒的洞口，从那里出来便可到达该层级。
//在Level 8的墙壁上找到一幅画着矗立在荒原中的具有两束光的灯塔的画，触摸画后闭上眼睛，5分钟后睁开眼睛，你会发现你已到达该层级。此画现已被The M.E.G.秘密保存。
//从Level C-476 切入可进入本层。
//出口
//找到一扇处于山体上的门，进入便会回到Level 1。
//从部分洞口进入并游荡足够久有可能回到Level 8。
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1477{}