//
//建立帐号 或 登入
//The Backrooms吧
//Backrooms Fandom Wiki
//The Backrooms中文wiki官方哔哩哔哩公众号
//Discord
//主页
//
//中文沙盒站
//
//图书馆
//
//层级
//|
//实体
//|
//物品
//|
//团体
//
//故事
//|
//相关人士
//|
//现象
//|
//设定
//
//搞笑文章
//|
//国际翻译中心
//
//原创图书馆
//
//原创层级
//|
//原创实体
//
//原创物品
//|
//原创故事
//
//原创团体
//|
//原创相关人士
//
//原创设定
//|
//原创搞笑文章
//
//原创艺术作品
//|
//原创现象
//
//网站
//
//最近创建的页面
//
//最近的更新
//|
//最近的编辑
//
//随机层级
//|
//随机原创层级
//
//随机实体
//|
//随机原创实体
//
//旧页面中心
//
//本月最高评分页面
//
//历史最高评分页面
//
//最低评分的页面
//
//社群
//
//讨论区
//
//翻译预定
//|
//最近的帖子
//
//作者页
//|
//中文网站作者页
//
//加入网站
//
//管理专用
//
//后台管理
//
//职员站点
//
//所有页面
//
//会员一览
//
//侧栏
//|
//顶栏
//|
//主题版式
//
//
//
//　
//
//Level C-473
//评分: 
//+27
//+
//–
//X
//等级2
//
//
//安全性：安全未定
//
//
//环境：空间变动
//
//
//实体数量：实体绝迹
//
//
//
//m.png
// 
//tn%20%281%29.png
// 
//os.png
// 
//un.png
//
//
//
//
//
//
//restaurant.jpg
//Level C-473面馆内部的图像。
//
//Level C-473是后室C层群的第473层，通常被称为“面馆”。
//
//描述
//Level C-473类似一间面馆的内部。空间无限大，有着无限随机的走廊、大厅，走廊的两边是无限排列的简陋包间。包间只是墙壁分成的一个隔间而已，并没有门。有一些地方会出现后厨的门，上面写着“厨房重地，顾客止步”，无法推开或砸开。有一些走廊似乎通向一些奇异的地点。
//
//有一些地方有着狭窄的木制楼梯，可以上下楼，但是这个层级的楼上与楼下仍然是无尽的面馆。
//
//存在着前台，但是却没有任何实体。
//
//温度稳定在29~33摄氏度之间，较为闷热，空气中散发着醋味。
//
//所有走廊和隔间的上方都悬挂着灯，但是由于进入的流浪者回忆的不同，它们可能是苍白的日光灯，有可能是泛黄的白炽灯等等。在墙面上似乎总是有老旧的拉线式电风扇，不能开启。风扇虽然全部停止工作，但是却可以听见远处传来类似风扇工作的风声。
//
//房间的四处都贴着花纹砖，在一些地方，花纹砖的表面很湿滑，有一些地方甚至很黏。木桌表面似乎总是粘腻的，散发着一种特殊的清洁剂气味，只要坐下就可以感觉到粘腻。桌上经常会放置着一盒纸巾，而且总是装在下部分有一些脏污的纸巾盒里。
//
//层级之所以被称为面馆，主要是因为它会向流浪者提供面食。当流浪者坐下，并且没有留意桌面哪怕一刻，桌上就会出现一张菜单和一支铅笔。菜单的正面有着一些面食名称，没有标明价格。菜单因人而异，大多只有5~6个选项。目前记录到的有：
//
//-隐藏菜单
//这些是普通食物，看起来和吃起来与前厅的都非常一致。
//
//（各种配料）汤面
//（各种配料）炒面
//（各种配料）凉面
//柳叶蒸饺
//（各种馅料）包子
//（无/各种配料）炸酱面
//（各种馅料）饺子
//肉酱意大利面：（流浪者来自前厅美国）
//（各种配料）披萨：（流浪者均来自前厅欧美）
//馒头
//羊肉烧麦
//泡馍
//面包
//（各种配料）三明治
//这些是特殊食物：与前厅的不尽相同。有一些带上了后室的物品或性质。
//
//糖三角：正四面体形的面团，但中心是正四面体形糖晶锭块。
//杏仁蛋糕：见杏仁制品收录，需要流浪者幼时喜爱蛋糕或经常食用蛋糕。
//杏仁曲奇：见杏仁制品收录，同上。
//面粉：一袋未加工的面粉，通常有1千克重。
//当流浪者勾选一项菜品，放下菜单，再次不注意桌面，菜单与铅笔就会消失，换为点好的菜品，带有一副木制筷子或者塑料刀叉。菜品一般温度过高，散发着热气，建议不要贸然食用，应该冷却后再食用。食用这些食物似乎能够满足流浪者的营养需求。
//
//流浪者勾选两份菜品，那么就会在其中选出一份流浪者最期待的食物。直接将所有食物勾选也是可行的。在流浪者离开一段距离后剩余的碗筷与食物将会消失。
//
//菜单一天中只会出现最多三次，大约6小时一次。
//
//New-Piskel-3.png
//这张图像是由一个流浪者的手稿转绘的，它应该是此层级中较为稳定的一个区域的地图。四种颜色分别代表四个互相独立的建筑区块，它们互相以非欧几何的方式连接，互相空间重叠，而且区块外围都有不稳定的出口。
//
//Level C-473最诡异的是幻觉与空间。层级的空间是典型的非欧几里得空间，而且比后室大多数层级更加不稳定。被记录的异常包括：
//
//流浪者可以看见的近处一堵墙在未受到注意的一瞬间就会消失，露出一条走廊。
//在走上楼梯的一瞬间背后的楼梯突然变化，变为能够通往再上一层的楼梯。
//即使在流浪者眨眼或转移视角的一瞬间，远处的走廊就会发生翻折、消失、改变结构、熄灯等变化。
//在层级中无限延伸的走廊甚至比有限走廊更为常见，而且两个走廊能够互相交叉并且互不干扰。
//标志性的物体，如前台，也会瞬间消失。
//一块稳定的区域很难寻找，而且就算是稳定的区域，也有空间重叠、区域不稳定连接等现象。
//顺着标记往回走，可能到达一个与原来区域似乎相仿却其实不同的区域。
//沿着无限走廊往前走，可能发现后退的道路已经被封住。
//在隔间内睡觉，醒来时隔间出口可能会变换到另一边。
//这些异常将会使流浪者对于层级的空间把握不清，迷路可以说是层级流浪者的常态。
//
//幻觉也经常发生。有如下几点：
//
//远处传来电钻声、砸墙声等，但都没有声源。
//风扇传出的轰鸣声在一瞬间停息，然后几秒钟后再突然增大音量。
//看见走廊远处的门，然而靠近却发现只是幻觉。
//感觉灯光突然如阳光般刺眼，然而灯光却没有实质性变亮。
//即使坚信没有实体，流浪者也可能看见猎犬、悲尸、窃皮者、钝人、笑魇、肢团、骇笑者、管间肢；可能看见人影，但是潜意识却认为它是无面灵或抛锚客。
//似乎感受到层级剧烈地上下颤动，但是层级其实静止在原地。
//在层级空气完全静止的情况下感受到一阵风。
//远处传来人类互相争吵声音，且全是应用流浪者的母语，甚至精确到方言。感知上通常是扮演压迫者的几人对于一人做猛烈争吵，然而流浪者无法改变这一切。流浪者通常感到无端的负罪感与愤怒，但是这对于流浪者自我来说是有害的。
//层级会对其中的流浪者产生精神影响，如下：
//
//感受到可能永远无法逃出层级。
//被害妄想，通常发生在睡梦中。
//感到不再孤独，但是同时会感到恐惧。
//易于被惊吓，仅仅自己踢到板凳的声音亦能惊吓流浪者。
//通常分不清醒来前的梦境与现实。
//本层级危险全部来自于出口困难与心理效应，似乎流浪者在持续数月的流浪探索时总会受到惊吓，而且很明显幻觉、孤独感以及迷失方向会使任何一个被困于此的流浪者感到绝望。
//
//实体
//无真实实体，但是幻觉实体似乎经常出现。
//
//基地、前哨和社区
//没有已知的基地。
//
//入口与出口
//入口：
//Level C-473的入口只会出现于城市层级，如Level 11，Level C-305或Level C-271等。
//
//当流浪者独自在城市层级的大街上徘徊时，有概率看见一条由门面房构成两侧的小巷。小巷中通常没有机动车道，且一般很窄。它的样貌因人而异，大多数都与流浪者前厅居住地点的风格相似。
//
//两侧的门面房都被店铺占满，如水果摊、五金店、旅馆或超市等。这些店铺都已经被搬空，有一部分关上了卷帘门。
//
//在小巷中只有一个店面能够轻易进入，就是Level C-473的内部。空间内排列着木制桌椅，桌椅边有垃圾筒。从外面看上去，似乎只有很少的几张桌子，空间有限，且没有转角。但是当进入面馆的一瞬间，就会发现似乎“切入”了一个新的空间。再往后看，门已经消失了，而且只有流浪者一人。
//
//出口：
//向楼梯下走去，很小的可能性可以看见一扇门，它通往Level C-67。（一般的安全出口，但是出现概率很小。）
//走廊极小可能末端真的有一扇门，通往Level C-313；但是触发这个出口的流浪者的前厅家中，皆经营一间小餐馆，暂未知其他流浪者是否能够触发。
//可以切出楼梯，来到Level C-344。（出现概率极小。）
//切出一台空置的冰柜，会来到Level C-271。（出现概率极小。）
//探索中。
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1473{}