//Level C-451
//评分: 
//+21
//+
//–
//X
// 
//
//生存难度：
//等级 3
//
// 
// 
// 
//Level C-451是后室C层群的第451层。
//
//7A81CF05-2347-4BB9-8D2B-569C8A260024.jpeg
//房屋内部
//
//描述
//Level C-451 环境为一片规模未知的雪域，雪域空旷无任何植被，中心仅有一间较为宽敞的木制房屋，屋内摆设类似于调香室。
//室内温度保持在26°C左右，置有壁炉及摆有各类香水的货架，屋内天花板挂有多盏昏暗的吊灯，墙上挂有白色的灯笼，这些主要的光源使屋内保持明亮。
//整个调香室充满着各种不详的香水气味，似乎会导致流浪者精神错乱。多数香水瓶整齐地被挂在货架上，少部分被放在前台。于前台下方锁住的抽屉里放有几瓶特制香水，瓶身均为金色，由未知成分构成，泄露着未知的香味，异常的清香，能够使人放松和愉悦。
//
//22916C28-BC93-4F54-A17E-79E2D60BD880.jpeg
//香水
//
//
//该层级可以通过购买来获取物资。这里似乎接受一切货币，也可以使用任何物资交换。在这可以通过交换购买杏仁水，食物，也可以购买香水。调香室内的香水大部分都具有特殊的性质，主要功效可分为四类。一类为能够增强体质，补充能量的香水，其多数香味类似于百合，液体为半透明状粘液，呈现橘黄色。第二类为能够使人获得短暂的极强夜视能力的香水，均为香味类似于牛奶，液体为浑浊状粘液，呈现淡蓝色。第三类为能够使人行动力加强的香水，香味类似于柠檬，液体为半透明状，呈现淡绿色。最后一类香水具有副作用，具体负面功效不详，多数为完全透明或完全浑浊状态类似于清水状香水，颜色各异，香味也各异。流浪者也可以在此层级购买一杯奇特的茶水，茶水似乎并没有什么奇特的作用，无色且无害，但是口感异常清凉，微苦。
//
//流浪者还可以在此体验香水制作，制作方法可以在前台查看，若是制作成功流浪者可以选择离开此层级或留下。但若是流浪者调制失败，流浪者会被强行传送至其他层级 ，并且流浪者无法抗拒。
//除此之外该层级还藏有地窖。地窖内并无光源，十分黑暗，墙壁及地板皆为木制，墙壁上通常流有未知的黏液。地窖内存放着各类不知名刑具，墙面上通常挂有不知名的遇难者及其他实体的尸体，腐臭味让人作呕，据分析该层级部分香水都是由人类及其他未知实体的腐肉制作而成。
//
//前台相对于货架则显得较为杂乱，前台上放有一个金鱼缸，受未知原因影响，鱼缸内的水温能够维持在20～35°之间，鱼缸内有两条金鱼，一黑一白，且生命体征正常。
//该层级的室外一直下着大雪，积雪的厚度较深，几乎能覆盖一个成年人的半个身子。据说屋外气温低达-70℃，不宜停留。受环境影响，该层级的室外环境尚未完全勘探，据说有流浪者在雪地5公里处看见过其他建筑。除此之外该层级的室外似乎已经没有其他任何物体，更不可能有其他生命存在。
//
//实体
//调香师
//这里前台有一个名为“调香师”的人型实体，男性，行动速度一般。大概是因为室内较为温暖，他穿着与雪天所不符的绿色短袖长袍。他的容貌似30岁左右的东亚男性，高鼻梁，方脸，四肢并不粗壮，偏胖，头戴散发着花香的紫罗兰色头饰，手挂散发香草之气的靛蓝色手环。据说他的腰上佩戴着串有15枚钥匙的钥匙串，但很少有人知道它们的作用。他能闻到并记住任何东西的气味，除非流浪者造成了巨大噪声，身上带有奇怪气味或是做出了任何让调香师不满的事情，调香师不会主动攻击流浪者。这里有大量香水瓶，任何香水瓶的砸碎都会引起调香师的不满。
//调香师似乎能够感知流浪者的内心想法，若是流浪者的内心对于调香屋有任何抵触的想法，这会让调香师感到不满并对流浪者发起攻击，强制流浪者摄入一种品红色的未知成分的副作用香水，该香水能够使流浪者快速昏厥，并给流浪者带来炎症，脱水等症状。若是调香师被彻底激怒，便会将流浪者拖入地窖并施以暴力，折磨至死。
//
//家仆
//“家仆”是一种人形实体，仅存在于该层级。当有流浪者来到该层级时，“家仆”会前来服务流浪者，他们形象几乎等同，穿着黑色西装，白色内衬，有黑色领结，容貌似25岁的男子，浓眉大眼，似乎没什么攻击性。（调香师派遣除外）他们会使用人类的语言与流浪者交谈，协助交易，但他们不会向流浪者推销香水，更不会将香水的特性告知流浪者。
//
//除以上特殊实体之外，这里仍然会有其他实体光顾，他们多数为无面灵及其他实体，他们仍然具有攻击性，要小心 。
//
//基地、前哨与社区
//据说在调香屋5公里远处有一前哨站，类似一个猎户的小木屋，内置有大量物资，并没有人员看守，因室外环境恶劣，这里几乎没有人到达过，所以无法保证真实性，不应擅自前往探索。该层级不存在其他社区和基地。
//
//入口与出口
//入口
//在Level C-230的永恒之海中窒息，会有几率来到Level C-451。
//在Level C-47单人学校的任意一间厕所里待满11分钟，出来后就会进入Level C-451。
//在Level C-195实体之城的某个垃圾桶中找到一个隧道，进入隧道你就会来到该Level C-451但流浪者的身上似乎会沾染怪味。
//出口
//购买一杯茶水，喝完后流浪者会陷入沉睡，然后便会在Level C-123的一个座椅上醒来。
//成功调制香水，会被送至Level C-71。
//闭眼摄入从前台找到的香水，会来到Level C-70。
//盯着金鱼缸里的金鱼入迷，会切入Level C-148的水中。
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1451{}