//Level C-499
//评分: 
//+77
//+
//–
//X
// 
//
//生存难度：
// 
// 
// 
//photo-1599628871068-055e59dbfaed?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=987&q=80
//Level C-499。
//
//Level C-499是后室C层群的第499层。
//
//描述：
//Level C-499是由大量房间彼此连接而构成的一片无穷（或许）空间。房间之间以墙壁相隔。
//
//除出现在初始地点的一把铁锤之外，Level C-499内没有任何物品。
//
//基地、前哨和社区
//该层级不存在已知的基地、前哨和社区。
//
//入口与出口：
//入口：
//已遗忘。
//出口：
//未知。
// 
// 
// 
//
//附录：
//好，开始吧。
//
//今天是我掉到这个鬼层级的第三天……我想是三天。这里没法看见昼夜交替，所以我只好用我睡觉的次数来算日子。有些房间的窗户里会透出光来，可是我完全望不见光源。
//
//我完全想不起来我是怎么到这里的了……三天之前，我就那么苏醒在一间房间的正中央、身边除了一把躺在地上的铁榔头以及我一直揣在兜里的这台终端机以外，再无他物。
//
//短暂的惶惑之后，我试着捡起那把锤子，狠狠地砸向其中一面墙壁——我成功地、慢慢地砸出了一个破洞。
//
//而它的后面是另一个房间，是另外四堵白墙。
//
//我当时就觉得大事不妙。在随后的足足三天里，我又开始怀疑我现在是不是在做梦。
//
//老天啊，如果真的是梦，就快点让我醒过来吧，这不好玩……
//
//第四天了。我又醒在了这里。
//
//好吧，兴许这不是梦。我早该承认的。
//
//昨天入睡之前我又打通了3面墙壁，依然没有见到出口。这个层级难道就是这个样子？房间连着房间？无限延伸？
//
//……
//
//我有点发昏，可能累着了。我得睡会。
//
//决定分一点设备的内存用来写东西真是正确的决定。不然我可能乏味至死。
//
//为这个该死的层级写份文档吧。也算是尽了一份身为流浪者的义务，哈哈。稍后我再把这些记录移到附录去。
//
//我记得499是个空号来着，就选它了。
//
//凑不出字数了，操。这个层级就这么点东西。
//
//爷不伺候了！写它的文档还不如砸墙！
//
//……
//
//墙后还是墙，一面接一面的墙。
//
//我他妈到底是怎么到这里的？为什么我脑子里记不起一丝一毫？？这种莫名其妙的事情是世界跟我玩的什么恶趣味吗？？？
//
//给老子等着。有多少墙，我就砸烂多少墙。
//
//今日战况：9面墙。
//
//现在我在第10面墙面前。
//
//今日战况：9面墙。
//
//我看看睡前能不能砸穿第10面。
//
//今日战况：8面墙。
//
//今日战况：8面墙。也好像是7面。
//
//8。
//
//6。
//
//1。我休息一天。
//
//……
//
//反正没人看得到，写出来也没什么。
//
//我大哭了一场。没有任何预兆、没有任何刺激，我突然就扔下锤子嚎啕大哭，跪倒在地，崩溃不已。我死死地拉扯头发，不单揪掉了好几根、还不小心弄破了一些手上的血泡。
//
//但有一说一，哭完之后感觉好多了。
//
//回想起偌大的空间里只有哭声在回荡的感觉……有点阴森。让人不舒服。
//
//之前忘了写：我发现我的新陈代谢好像停下了。
//
//具体来说，我现在完全没有饥饿感、也不口渴。我甚至没有便意。
//
//但我还是希望能吃到点什么。不是为了充饥，而是嘴里咀嚼着什么东西的时候总是能让人略微安神。对吧？
//
//天啊，我能无缘无故的来，应该也能无缘无故的出吧！啊？！
//
//为什么我还是醒在这个地方！为什么！
//
//为什么为什么为什么为什么为什么为什么为什么为什么为什么为什么为什么为什么为什么为什么为什么为什么为什么为什么为什么为什么为什么为什么为什么为什么为什么为什么为什么为什么为什么为什么为什么为什么为什么为什么为什么为什么为什么为什么为什么
//
//有没有什么实体能突然冒出来杀了我？谁都行！
//
//我犹豫了好几次，始终没有勇气举起锤子砸自己的头。更别说我听说在C层群自杀不了。
//
//真他妈的懦弱。真他妈的讽刺。
//
//墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙蔷墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙墙
//
//好嘞，我看看自己能在几秒内找到那个字！
//
//不好玩。没砸墙好玩。
//
//开始今日份的砸墙咯！我爱砸墙！
//
//砸墙使我快乐。
//
//砸墙使我快乐。
//
//砸墙使我快乐。
//
//还是写点有意义的东西吧。
//
//我已经不奢求逃出去了。Level C-499已经用他宽广的内在向我证明了我是在做无用功。我坚持到现在的砸墙也只是每天固定的、唯一的娱乐活动罢了。
//
//想通啦。有些事情真不是人想做到，就能做到的。学会接受并放弃……还好过一点。
//
//希望越大，失望越大。
//
//啊哈，我做了个在砸墙的梦。现在应该不是在梦里。
//
//还真不是。
//
//……
//
//我不喜欢呆坐，因为那会陷入让我害怕的死寂里。
//
//比起这座囚笼对我的囚禁，更加让我发疯的是孤单。
//
//这里只有我。
//
//这里只有我！
//
//尽管我在外边也一直都是一个不合群的人，但我起码能够看着别人的抱团取暖而感到一丝若有若无的温度——
//
//但这里只有我！
//
//……
//
//仔细想想，既然我在哪里都是一样……又为何非得出去呢。
//
//我这种人，可能确实只配烂在这里。
//
//哈哈，傻逼。
//
//我是傻逼。
//
//写这种矫揉造作的文字作甚？还在妄想有谁能看到然后跑来安慰我吗？
//
//再写就
//
//我很久之前就没有再拿起锤子了。毕竟墙后是啥人尽皆知。
//
//忽然想起到了外面的人类，还有后室。
//
//他们也是一样的吧？层级之后还是层级、囚笼之外还是囚笼。
//
//谁都逃不掉。
//
// 
//
//算了。删了。
//
//累。
//
//我好痛。
//
// 
// 
// 
//
//附录2：
//2022年4月26日，第二名流浪者无端进入Level C-499，并发现了第一名流浪者的尸体。他坐在墙角，体表无外伤，死亡原因未知。在其身侧放有一台终端机以及一把铁锤。终端机内储存有一份该流浪者生前所留下的层级草稿、以及数份日志。
//
//祝我好运。
//
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1499{}