//Level C-412
//评分: 
//+9
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
//安全
//稳定
//非实体伤害
//Level C-412是后室C层群的第412层。
//
//描述
//Level C-412是欧几里得空间，地面为直径约32km、以入口为圆心的圆盘。圆盘内大部分是水平的完全平坦区域，会出现2层高的建筑，形状规则，有门框和通向二楼的楼梯，没有门、家具或装饰，且所有尖锐处都呈圆角。距离中心16km处的地面开始以35°向上延伸，高度未知。一般认为该层级能够无限延伸。
//此层级的地面和建筑完全由#c4c0bf色的未知物质组成。该物质的主要性质为：固体、几乎不反光、摩擦系数极大、会在撞击、重压或遇到其他强烈作用（电流、化学物质等）时暂时进入只可观测、无法交互的状态，导致上方的所有物体切入地面中。因此，在该楼层摔倒会导致切出，构成地面的未知物质也无法进行开采和成分分析。对于圆盘外向上延伸的地面，进入上述状态的临界会随着高度的增加而迅速降低，因此任何长距离攀登向上延伸的地面的尝试都以失败告终。
//
//yZWe3uhNlT2xrR5.png
//#c4c0bf色
//
//此层级的能见度极低，约为3米，远处的空气呈#c4c0bf色，但未发现空气中存在任何液体或固体颗粒，且无特殊气味。任何带出本层级的空气都会变为无色且与正常空气成分相同，且任何带入此层级的气体都会表现出此特性，因此认为上述特性是层级本身的性质。
//此层级的气温恒为19°C。此层级的照明良好，光源未知，没有任何实体或物体投下影子的记录。此层级的wifi信号良好。
//
//人类在此层级会逐渐产生神经细胞的变性，主要为视锥细胞，症状为：看到的所有颜色都会变为明度与之前相同，与#c4c0bf色同饱和度、同色相的颜色。（简单来说，深色变为深灰，浅色变为浅灰。）该症状会在离开此层级后以缓慢的速度消除，饮用杏仁水可以加速该过程。但有在该层级停留过久导致产生无法消除的视觉影响、致盲、甚至失忆、产生脑损伤的记录，因此不建议在该层级停留过久。
//整个层级都有很高概率听到一种声音，声源未知，且被描述为“在脑内直接产生”。该声音“在层级内听到会产生莫名的安定感和幸福感”、“会让呼吸变得稳定、舒畅”。经过傅里叶分析，该声音由频率为369.994Hz、440.000Hz、554.365Hz、659.255Hz的四种正弦波组成，即一个F#m7/Gbm7和弦。产生该效果的原因尚不清楚，初步认定为层级本身的性质。
//
//
//
//此层级的建筑内能出现不同种类的幸运豆奶，口味和效果与普通幸运豆奶无异，但是颜色均为#c4c0bf色。
//
//Level C-412未发现任何实体。
//
//基地、前哨与社区
//该层级由于其环境对视觉的特殊影响不存在已知的基地、前哨和社区。
//
//入口与出口
//入口：
//任一有wifi的层级看到、听到、摸到与#c4c0bf色有关的电子物件有极低概率导致周围的空气出现Level C-412的性质，并传送到Level C-412。（如含有#c4c0bf色像素的图片的网站、封面含有#c4c0bf色像素的歌曲等）
//在Level 11的贝塔基地向北朝东2.3°行进480.57km，左手边的日式公寓墙壁上有一个内有呈#c4c0bf色的气体的#c4c0bf色长方形洞口，进入即可到达Level C-412。
//出口：
//在该层级的地面切出会被强制陷入睡眠，并传送到上文提到的日式公寓外。
//附件：
//发现Level C-412的流浪者的笔记：
//2020年8月15日
//
//上午十时，我正在用电脑查找有关一些新发现的层级的信息，突然周围涌起一大片雾气把我完全笼罩住，回过神来已经到了一个新的层级内，疑似是未被记录的。里面能见度很低，远处的所有东西都被灰色笼罩着，很压抑。我很担心会突然遇到危险的实体，所以一直保持着极高的警惕。走了大约2小时，眼前和脚下都是同一种灰色，没有遇到任何实体，偶尔能发现几栋灰色的建筑，里面有一些呈灰色的饮料，因为随身携带了杏仁水，没有去尝试饮用。继续往同一方向走了大约2小时，依然没有发现任何实体，面前出现了向上延伸的地面，但是出于安全考虑也没有攀爬。奇特的是，在行进过程中脑内时时会有一个声音，每次听到这种声音，我都会更加安心、舒适一些，即使我知道5米外可能就会是一只笑魇。到现在，我已经放松了警惕，我相信我在这里应该是安全的。
//
//2020年8月17日
//
//在新层级内探索的第三天。发现的东西和前两天没有区别，但是我带入层级的东西和我自己出现了奇怪的变化，颜色看上去越发和该层级内的颜色接近了。我不知道是我的眼睛发生了变化，还是它们褪色了。脑中还是回荡着那个声音，明明一直只有一个音调，但是却不对此感觉耳鸣或厌烦，反而越发受到它的影响。但是即使有这些让人有些困惑的情况出现，我很喜欢这个层级。我想描述一下我现在的主观感受。我独自一人，但是我不孤独。灰色裹挟着我前进。在之前我从未想过，也许一个失去颜色的世界也可以是温暖、安定的。在混乱的颜色全部归为灰色，嘈杂的声音全部归为低吟后，我在后室长久以来第一次感到绝对的安心。在这里，只要我还在呼吸，我就是幸福的。但是，我也不得不承认，这种“褪色”或许是危险的，我需要在事情向坏的方向发展之前从这个层级出去。之前从手上掉落的一瓶杏仁水径直从地板穿了下去，因此我相信如果我向地面重击，应该可以切出这个层级。我需要尝试一下。
//我在Level 11的一栋没人探索过的日式建筑外醒来。我发现是我的视觉受到了影响，所有颜色都变得灰蒙蒙的。同时，从单色调的层级突然切换到正常层级让我的眼睛很不适应。建筑的墙壁上有一个洞，应该就是我刚刚出来的层级的入口之一。我决定返回汇报遇到的情况。正拿着定位系统往贝塔基地的方向行进，猛地感觉，心底好像还隐隐地留存着之前感受到的安定感，微弱但是清晰。我不知道这到底意味着什么，或者是什么原因导致的，但是我向前的步伐越发坚定了。
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1412{}