//Level C-406
//评分: 
//+12
//+
//–
//X
// 
//
//生存难度：
// 宜居
// 
// 
//Level C-406是后室C层群的第406层。
//
//描述 
//                                                       
//
//Level C-406是一个由多条河流及运河组成的水系，主体由河流、运河及河流中间的小块陆地组成，目前发现了200余条水道，均互相连接，总面积约达6000平方千米。气温常年稳定在25度。
//
//Level C-406水系中的水大部分为淡水，可以放心饮用。少数情况下会出现富含杏仁水的河流，这些河流目前均由L.E.B.实际掌控，他们在此层级建立了许多专门用于提取杏仁水的站点。这些杏仁水来源不明，据报告称河底与Level 5相连，由于L.E.B.缺乏潜水工具，无法证实。
//
//少数河流中的水为咸水，过滤后可以饮用。
//
//河流沿岸的陆地均生长着亚热带常绿阔叶林，陆地面积大小由100平方米到2000平方米不等，地形平坦，杂草丛生，陆地上会随机刷新物资，如皇家口粮、罐装龙肉等。
//
//交通工具 
//该层级主要的交通工具为船，大小不一，有一些甚至已经荒废，无法使用。这些船包括但不限于：
//
//木筏
//由两到三根圆木用绳子绑在一起而成，据考证木头为本层级原有品种。
//
//独木舟
//由一根大型圆木中间挖空做成，仅出现在咸水区域。
//
//游艇
//材料未知，会刷新一些物资，无法驾驶。
//
//渔船
//上面有鱼竿、渔网等捕鱼工具。
//
//实体 
//该层级目前已知只有一个实体，名叫棋士，外貌为一大约20岁的东方男性，身穿白袍，常手执一颗围棋棋子，使用语言为汉语。棋士通常出没在杏仁水河附近，该实体对流浪者持友好态度，会邀请流浪者与之下棋。
//
//流浪者可以选择拒绝，棋士不会对其采取任何行动，如果流浪者接受邀请，棋士会用与流浪者相当的实力与之下棋，其间不可退出，否则后果自负。
//
//棋士在下棋期间会与流浪者交谈，直到结束，以下为L.E.B.与棋士的交谈记录：
//
//- 返回
//确定要继续访问吗？
//
//- 取消
//L.E.B.报告
//与棋士的对话
//L.E.B.队员：请问您⋯⋯
//
//棋士：（摆了摆手）不用问了，我自诞生之日就生活在这里，从时间的开端直至尽头，我从未离开过。
//
//L.E.B.队员：那么，是你创造了这个层级吗？
//
//棋士：我与此处一同诞生，将来也会一同消逝。无所谓谁创造了谁。
//
//L.E.B.队员：你知道这个层级的由来吗？
//
//棋士：这是我们的秘密，无可奉告。
//
//L.E.B.队员：等等，你刚才说“我们”，是不是指在后室中还有你的同类？你可以离开这个层级到达其他层级对吗？我们可以在其他层级找到你的同类吗？
//
//棋士：是的，但我们只能独立存在于一个层级，不能聚在一起，世界的核指引着我们，告诉我们应该去哪、应该做什么。
//
//L.E.B.队员：“核”是什么？
//
//棋士：你没必要知道，我也无可奉告。你输了，告辞。
//
//基地、前哨与社区
//L.E.B.前哨站
//对M.E.G.的成员和流浪者十分友好，对他们提供帮助。
//M.E.G.前哨站
//M.E.G.建立的前哨站，固定成员有100人。
//入口与出口
//入口
//从Level C-28穿墙有一定的可能性到达这里。
//从Level 0的墙壁切入。
//在Level 5触摸地板有几率切入。
//出口
//在游艇中待30分钟会传送至Level 10。
//驾船离开边界会到达Level 7。
//上传于2020.6.23
//
//发现文档最新版本，点击查看
//
//- 取消
// 
//
//生存难度：
//等级 2
//
// 
// 
// 
//Level C-406是后室C层群的第406层，该层级由于一些原因发生了巨大变化。
//
//描述
//Level C-406是一个由多条河流及运河组成的水系，主体由河流、运河及河流中间的小块陆地组成，目前发现了200余条水道，均互相连接，总面积约达6000平方千米。气温常年稳定在25度。
//
//由于2021年8月中旬发生了大批外来实体入侵事件，该层级已经不再安全，原本占层级大多数的淡水河均因未知原因变为咸水河。
//杏仁水河没有明显变化，仍可饮用。
//
//L.E.B.在本层级的基地已迁至杏仁水河附近，据研究杏仁水河对实体有驱逐作用，新入侵的实体食人鱼无法靠近杏仁水河。
//
//目前M.E.G.已经开始了对物种入侵事件的研究，还未查明其原因。
//
//实体 
//棋士
//该层级目前已知只有一个实体，名叫棋士，外貌为一大约20岁的东方男性，身穿白袍，常手执一颗围棋棋子，使用语言为汉语。棋士通常出没在杏仁水河附近，该实体对流浪者持友好态度，会邀请流浪者与之下棋。
//
//流浪者可以选择拒绝，棋士不会对其采取任何行动，如果流浪者接受邀请，棋士会用与流浪者相当的实力与之下棋，其间不可退出，否则后果自负。
//
//食人鱼
//来源不明的入侵物种，外观类似于前厅的的食人鱼，但体型要大一些，据M.E.G.估计，这些食人鱼数量大约有2000条，它们游弋在该层级的大多数水域中，由于其繁殖能力强的特性，其数量正在快速增长中。
//
//它们会袭击在河中游泳的流浪者，所以应该远离河流。陆地相对来说更加安全。
//
//基地、前哨与社区
//L.E.B.“光轮2号”基地
//固定成员50人
//帮助进入此层级的流浪者
//采集杏仁水
//与M.E.G.为盟友关系
//M.E.G.“亚热带丛林”前哨站
//固定成员60人
//调查本层级的物种入侵事件
//入口与出口
//入口
//从Level C-28穿墙有一定的可能性到达这里。
//从Level 0的墙壁切入。
//在Level 5触摸地板有几率切入。
//出口
//由于该层级的变化，出口也有一定的改变，目前可以从杏仁水河的河床切入Level 5，或者与棋士下棋获胜传送至随机层级。
//附录
//M.E.G.研究报告
//这里是M.E.G.“丛林探险者”小队，我们正在Level C-406进行对物种入侵事件的调查。
//
//我们发现所有的食人鱼均来自同一条河流，而这条河流的源头就在层级的边界，更令人震惊的是，这里原本是通向Level 7的出口，我们怀疑这些实体来自Level 7。但
//Level 7只有一个特殊实体，目前我们并没有发现具体原因，但根据推测，这些实体极可能来自一个我们未曾发现的新层级。
//
//我们不知道现在那个出口的稳定性如何，所以没有贸然进入，L.E.B.最近打算派一支小队去探探情况，不知道什么时候行动。
//
//更新于2022.7.28
//
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1406{}