//Level C-496
//评分: 
//+14
//+
//–
//X
// 
//
//生存难度：
//等级 5
//
// 
// 
// 
//pexels-photo-946281.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2.jpg
//由M.E.G.调查人员拍摄的一张Level C-496的照片。
//
//时间正在消耗着你的生命
//
//描述
//环境
//Level C-496是一辆行驶在道路上的公车，其外观与前厅中的类似。“乘客”在座椅上安静的坐着，“司机”认真地驾驶着车辆。阳光透过窗户将整个车厢变得温暖明亮。座椅整齐的安置在两侧、电子告示板中滚动着公告、车内的喇叭传出柔和的广播声。车窗外有生机盎然的森林，无垠的天空中飞过几只鸟儿……
//
//特性
//Level C-496上所播放的广播具有精神污染性，它会让流浪者沉溺于该层级，并对流浪者的精神意识产生控制作用，使得他们无法离开这里。
//
//广播对流浪者的精神控制将在当天下午的17:00后自动解除。
//
//为了确保流浪者的精神安全，请你最少每小时饮用一次杏仁水。
//
//Level C-496在行驶途中会停靠于任意站台。据M.E.G.报告，这些公交站台会将流浪者传送到其他的层级，目前这些站台的传送顺序暂未发现任何规律。
//
//危机
//经调查人员勘探，Level C-496中的“乘客”与“司机”是由一些极具杀伤力的实体所伪装的。
//
//当夜晚来临时，实体将展露出它们本体的模样。开始狩猎仍滞留于车厢中的流浪者。
//
//据M.E.G.的调查人员所报告称，他曾亲眼所见一个窃皮者撕开了“乘客”的外衣钻了出来。
//
//“司机”则是由笑魇或钝人所伪装成的，目前仅有少数流浪者称目击到了钝人。
//
//据M.E.G.的调查得知，Level C-496中的车窗均是一种被称作“窗户”的实体，它会将流浪者拉入虚空或Level 1.5。
//
//窗户在白天时映射出一片碧绿的森林与看不见尽头的公路。黑夜时则会映射出一片血红色的森林，天上挂着血红的圆月。
//
//根据M.E.G.所得到的数据，目前并没有成功于Level C-496生存超过一天的流浪者报告。
//
//关于该层级的调查报告
//M.E.G.为调查Level C-496，曾组建了一支五人小队，以下是一位队员曾经传来的报告：
//
//早上8:00
//我好久没看见过那么刺眼的阳光了…窗外的绿树、花朵、街道都让我感到熟悉，美好的景象会让人忘却一切烦恼，广播一遍遍在我的耳边响起，我永远不会离开这里，Level C-496目前预测为Class0，或许我们可以将该层级作为宜居地带。
//
//下午15:00
//好像有什么事物控制了我的意识，我喝了一口杏仁水后，眼前的景象变得清晰起来，我赶紧给伙伴们喝了点杏仁水。
//那些乘客……发出了一些含糊不清的声音，其中一个同伴说那像是窃皮者发出的声音，并且…我刚刚通过后视镜发现司机的眼睛竟然是发亮的……那个微笑看着瘆人而又可怕……
//
//下午17:00
//一个队员被窗户抓进去了！？那些乘客好像在笑，那些笑容太可怕的……车厢的灯变得忽明忽暗，现在已经不会停车了……好像一切都晚了，那些乘客像看着猎物一样，他们那贪婪的目光好像要将我杀死……
//
//晚上19:00
//那些乘客杀了其他人！那些乘客……我亲眼看见一个个窃皮者从他们的衣服中钻出，窗户外面的景象犹如地狱一般，血红色的月亮和血色的植物，无论我们怎么砸窗都完好无损……司机的头颅滚落到他的脚边。笑魇那恶心又可怕的笑容使我感到恐惧…这里就是比地狱还可怕的地方，其他人的血流淌了整个车厢，窃皮者将他们撕碎，我看着它将他们吃了下去……我现在躲在一个隐秘的地方，稍后我会将层级的资料发送给你们。
//
//晚上19:30
//Level C-496极度危险，实体横行，有笑魇、窃皮者、“窗户”，进入该层级需要携带杏仁水，并保证多次饮用杏仁水，请在天黑前下车，那些乘客和司机都是实体伪装的！
//
//晚上20:00
//亲爱的流浪者们与M.E.G.的队友们：
//当你们看见这条信息时，我已经与那些实体同归于尽了，我不知道一颗手榴弹会有多大的威力，但这是我最后的武器，是一个队友死前拼命扔给我的……那些可恶的实体杀死了我的朋友，今天是我为他们报仇的日子。如果流浪者，你能看见我的这条消息，请你在进入该层级后一定要远离窗户，多饮用杏仁水，我将我仅存的杏仁水偷偷藏在了座椅底下，我想这会帮助到你。在天黑前一定要下车！好了，那个恶心的怪物离我越来越近了，大家再见！have a nice day！
//备注：人生总有坎坷，人生总有遗憾，我那逝去的自由与梦想便由流浪者们实现啦。
//
//关于精神污染
//由广播带来的精神思想控制只能通过饮用杏仁水或到17:00后来缓解与解除。人体在遭受到精神污染后会将Level C-496想象成一个宜居地带，并不断夸赞该层级。
//
//17:00后，车辆将不再停靠站台，它会一直行驶至第二天早晨8:00。
//
//第二天8:00时将会停靠在第一个站台，同时广播也会随之响起。
//
//实体报告
//该层级被目击到的实体：
//笑魇 它们通常伪装成司机，脸上挂着诡异的微笑。
//钝人 它们通常伪装成司机或乘客，在流浪者靠近后会躲闪，看见杏仁水后会躲得更远。
//“窗户” 车内的所有窗户均是这类实体，他们会展现出各种美丽的景色，当流浪者靠近欣赏观看时将把他们拉进“窗户”中。
//窃皮者 大部分的乘客都是由它们伪装的，当流浪者尝试与它们交流时，它们会发出含糊不清的声音。
//关于站台
//据M.E.G.所派出的调查人员报告称，每一个站台将会通向一个随机的层级，没有顺序、没有规律。
//公车将会在下午17:00后完成一天的工作，届时将不会在停车，等到第二天8:00时，才会有站台出现。
//基地、前哨与社区
//目前未发现任何基地、前哨与社区。
//
//入口与出口
//入口
//在Level 11中发现一个公交车站将会来到这里。
//出口
//当公车停在任意一个站台时下车后，流浪者将会被传送至一个随机的层级。
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1496{}