//Level C-489
//评分: 
//+14
//+
//–
//X
//来自M.E.G.数据库的重要提醒
//
//系统检测到该文档存在一定的欺诈性信息，请不要过多相信所显示的信息。
//
//如果你明白并执意阅读该文档，请在阅读前向你最近的基地或社区进行通报。
//
// 
//
//生存难度：
// 
// 
// 
//Level C-489是后室C层群的第489层。
//
//描述
//photo-1599719361194-2b0565f577a9?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1170&q=80
//Level C-489内部环境
//
//Level C-489是一座风格几乎接近于90年代末中国式的小镇，目前占地面积约为32万㎡。该层级存在昼夜交替现象，据观察记录报告，日夜周转时间约为26小时，这会引起流浪者时感上微妙的偏差，除此之外如白天与黑夜的温度气候等方面与前厅基本上保持一致。
//
//Level C-489中有许多的建筑都可以被作为长期居住的需求，但考虑到该层级出入方式的方便性，如果流浪者想要在此层级居住，需要提供自己的基本信息，而流浪者在居住期间想要离开此层级的话，需要向基地进行报告，并告知基地自己想要离开此层级的正当理由。
//
//通过统计后，可适合进行长期居住的建筑已达到30座，每座建筑内都可能会存在一名无害实体，但也有报告称会出现三名实体，这些实体都是被M.E.G.数据库记录在案的实体，但值得注意的是，此类实体在该层级中并没有出现伤害流浪者的目击事件，这就意味着，这些实体在该层级会与流浪者友好相处。尽管如此，在此驻扎的各组织基地仍然对这些实体有一定的警惕性。
//
//实体
//妈妈和理查德、无足鸟是目击到的无害实体，其他实体目前还没有被发现，需要等待文档的更新，在白天期间妈妈或理查德会主动找到流浪者，并询问他们近期的状况。流浪者可以选择不回答他们的问题，如果此类实体执意继续追问，也可以向基地或社区报告实体所提出的问题。在夜晚期间所有实体都会消失不见，目前还不清楚在夜晚期间时这些实体去了哪里。
//
//基地、前哨和社区
//M.E.G.“居民委员会”基地
//该组织是最先发现该层级的存在，并立刻在该层级里驻扎了基地。
//由22人组成的安保及研究人员。
//后室娱乐“社区服务”基地
//位于一座与其他建筑不符合风格的建筑物内部。
//大约由51人组成，均为后室娱乐员工以及后室娱乐实体。
//与层级中的流浪者进行物品上的交易，大多数都是炫酷驾驶器、轻松可乐。
//nobody-is-god-logo.png
//NOBODY IS GOD组织标识
//
//NOBODY IS GOD—软件开发商
//流浪者可以在许多建筑物内部看到该标识，但没有任何的目击事件记录到该组织在此层级中的活动迹象。
//
//入口与出口
//入口
//其他层级中找到带有“NOBODY IS GOD”组织的标识房间门口，将其打开后就会进入到该层级中。
//从无知之幕中步行一段时间后，就可达到。
//出口
//可向基地、前哨或社区进行报告，称自己想要离开该层级，并且确保自己有正当理由，工作人员将你带到此层级的边缘处，并且在工作人员帮助下佩戴防护服，穿过边缘处后将随机切换至其他层级。
//检测到此页面有欺诈性信息，为保证你正确理解该层级的真正意义，请转移至更新文档中进行查阅。
//
//
//Level C-489
//评分: 
//+14
//+
//–
//X
// 
//
//生存难度：
//等级 3
//
// 
// 
//未知实体数
//Level C-489是后室C层群的第489层。
//
//描述
//photo-1572365722520-9e77ce9cf978?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1074&q=80
//由一名M.E.G.员工在Level C-489内部所拍摄到的一张照片。
//
//Level C-489是一座风格几乎接近于90年代末中国式的小镇，目前占地面积未知。该层级不存在昼夜交替的现象，然而，被“NOBODY IS GOD”组织监视的流浪者会长时间以为自己处于正常的昼夜交替现象的层级中，M.E.G.人员在该层级进行探索时，发现此层级长时间存在浅黄色的雾霾，当流浪者吸入这种雾霾后，就会幻想自己已经来到宜居层级的假象。
//
//Level C-489内部有许多建筑已遭到不同程度上的破坏，目前尚不清楚这些建筑被谁破坏，然而，仍有几座建筑是完好无缺的。在调查的前期，该层级并没有发现任何实体的存在，然而一名M.E.G.员工被困在该层级后，大量的敌意实体出现并开始试图攻击流浪者。在实体出现之前，员工会从幻觉中清醒过来，并在该层级中总是能看到“NOBODY IS GOD”的组织标识，如果流浪者触碰这些标识的话，实体就会立马出现。
//
//值得注意的是，“NOBODY IS GOD”组织在该层级中部署大量隐藏式摄像头，并将画面实时转播到其他层级当中的一些屏幕中，若流浪者在大量的敌意实体攻击后，流浪者会立刻当场死亡，在死亡后不到一个小时，其尸体会开始转变为已经记录在案的敌意实体，转变后最常见的实体为悲尸，之后会再次飘起黄色的雾霾，当雾霾退散后，所有实体就会消失不见。
//
//实体
//在该层级中发现的敌意实体都已经被记录在案，除了以下列出的新实体，这类实体是该层级中唯一的实体群。
//
//- 食尸蝗虫
//tettigonia-viridissima-3182507_960_720.jpg
//一只食尸蝗虫的素描。
//
//外表与 飞蝗
//Locusta Migratoria
// 
//基本一致，M.E.G.员工对一只食尸蝗虫进行解刨后，发现该实体是人工混合而成，因为在其中有蝙蝠和蜈蚣的基因存在，该实体的体型较大，通常长度能达到14cm，最长的跳跃距离能达到10cm，飞行时间长达13小时。该实体一般在较高的草丛堆中栖息，他们的繁殖能力极强，据观察报告显示，数量已达到1万只的此类实体。
//
//食尸蝗虫一般不会主动攻击人类，除非受到惊吓，当他们受到惊吓后，所有的食尸蝗虫就会不顾一切地攻击流浪者，直接啃咬流浪者的皮肤和器官组织或者选择先吸干流浪者的血液后，再进行啃食流浪者的尸体。值得注意的是，若其他流浪者试图阻止食尸蝗虫的啃食行为，那么有一部分的食尸蝗虫会转移啃食目标，并对阻拦者进行警告的攻击行为，但不会对阻拦者进行啃食行为，他们会选择先啃食一个目标后再转移其他的攻击目标。
//
//- 蚀骨病菌
//koli-bacteria-123081_960_720.jpg
//蚀骨病菌在显微镜下的模样。
//
//蚀骨病菌是一腐烂性细菌实体，生长速度较快，成功感染率及致死亡率可高达95%，蚀骨病菌只能通过此层级的建筑表面上的苔藓上进行生长，该实体因生长速度较快，此层级68%的地面和墙壁已经完全被苔藓所占据，当流浪中触碰这些苔藓的话，那么苔藓上的蚀骨病菌会直接附着在流浪者的皮肤表面上，并开始对皮肤表层进行腐蚀，逐一腐蚀到骨头组织。最终此实体会将流浪者的身体完全侵蚀，并直接导致流浪者的死亡。
//
//蚀骨病菌十分害怕水分，尤其是酒精类饮料，蚀骨病菌一旦接触到此类水分，那么就会立刻死亡。因此，若流浪者遭到蚀骨病菌的危害后，可以立刻进行内服或外服酒类饮料。
//
//- 蚀骨病菌
//- 绝命施毒师
//fear-7076507_960_720.jpg
//来自一名幸存者对绝命施毒师外貌的绘画。
//
//绝命施毒师是以铁丝、布料、稻草制成的人形生物。其身高已达到3米，绝命施毒师时常携带许多物件，包括一些可喷洒毒药的喷雾、钩子、手提灯、小型沙漏，虽然该实体所携带的物件有一些还无法得知其作用，但绝对是带有毒性的，因为一部分的幸存者称能在这些物品的表面上能看到带有微弱的绿色雾气向外部飘散。绝命施毒师的身旁总伴随着一群乌鸦，这些乌鸦已被确认与记录在案的巨鸦没有任何关联。
//
//绝命施毒师总是一个人行动，它不喜欢在此层级中与其他实体一起攻击流浪者，绝命施毒师喜欢玩弄目标，它不愿意立刻杀死目标，尽管自己有能力做到这一点，绝命施毒师却并不喜欢这么快结束，绝命施毒师利用慢性的毒药或毒雾攻击流浪者，流浪者一旦受到攻击后会产生微弱的昏迷，在短暂的昏迷后流浪者会立马清醒，但此时，流浪者会被绝命施毒师绑在一张木椅上，并开始进行它的“手术实验”1，如果多次实验失败的话，那该实体就会直接杀死目标。
//
//- 绝命施毒师
//- 无名之人
//nameless-monitor.png
//摄于监控画面中的无名之人（绿色框内）。
//
//无名之人是一人形实体，目前关于无名之人的详细信息，暂时还不得而知，根据监视器长时间观察和幸存者的描述，无名之人的外貌基本如下：
//
//它的外貌有时穿着防爆警察的衣服，并配置一把生锈的冲锋枪和一把警棍，也有时穿着防化服，但穿着防化服时并没有佩戴防毒面具，它的脸部总是模糊的。
//它的身高目前无法确定，因为根据一些幸存者的描述，称每次见到该实体时，有时十分高大，也有时候十分矮小。
//它的行为有时是敌意性，对流浪者具有很大的恨意，也有时是善意的，总会帮助流浪者离开此层级。
//唯一的共同点是，无名之人总会出现在“NOBODY IS GOD”组织所主导的实时画面现场，并且在流浪者死后会再次出现，从流浪者尸体上取出某样东西，但由于无名之人总是背对着摄像头，因此关于无名之人的外貌没有更加确切的证信息。根据最新目击报告，无名之人很可能从其他层级中2转移到此层级中。
//
//- 无名之人
//基地、前哨和社区
//所有组织在此层级所驻扎的基地、前哨和社区已完全撤离，目前不存在已知的基地、前哨和社区。
//
//附加信息
//在最初调查中，一名疑似M.E.G.员工被困在此层级中，其真正的身份有待验证。他在被众多实体围攻下用录音的方式记录此层级的危险性，由于未知的原因，该录音文件在流浪者之间一直流传，他们称能看到这本日记，是因为“NOBODY IS GOD”组织将这本音频文件实时转播给各层级的流浪者们，目前因知名度较高，已被收录至档案当中。
//
//音频文件
//
//<记录开始>
//
//[Date:13/08/2013]
//
//我在这里被困很久了，我不清楚这个层级的真实性，它到底是不是宜居性层级，还是说是那些怪物横行的层级。现在我正躲在一个小旅馆里。无尽的小镇面积、昏暗未知的暗道、潜伏在附近的敌意实体…呵，我早就习惯了，在这里，没有一个活人，一旦到了夜晚，这些实体就开始进行他们的捕食…额..应该说是自我生存，我只能待在这家小旅馆里，不断生存下去，除了这个别无他法。谁能救救我..谁都可以…
//
//[Date:15/08/2013]
//
//这地方始终充斥着浅黄色的雾霾，我曾试着戴着防毒面具去寻找这雾霾的来源，但根本找不到这雾霾的源头，后来又想着：会不会是绝命施毒师弄出来的，但那家伙身上散发出的毒雾的颜色与这奇怪的雾霾的颜色完全不一样，我已经完全没有任何头绪去思考这雾霾的问题，现在所剩的物资已经快要被我用完了，或许..再也没有人知道我被困在这里，哼，真够倒霉。原本我是跟着小队一起来探索这里的，却意外迷路了。说到这事，有点奇怪，自从我被困在这里时，发现到处都有一名“NOBODY IS GOD”的组织标识，我不知道总部有没有注意到这个组织，反正我是根本不记得有这组织，可能..是刚建立不久的新团体吧？
//
//[Date:16/08/2013]
//
//我撑不了不多久了，都别来找我，或者说别来这鬼地方。那个叫“NOBODY IS GOD”的组织将这个层级的记录文档捏造出宜居层级，而且，我发现这里到处都有隐藏式的摄像头，如果不仔细检查，很难发现这些摄像头，这些摄像头似乎在运行，我不清楚这些摄像头的真正作用，我的脑子里浮现出可怕的想法，可能我在这里的一举一动被实时转播给其他人看，可能就是这个叫“NOBODY IS GOD”组织所为，或许他们希望把他们在这里的杰作放给其他人看，如果真是这样的话，那他们还真是恶趣味，不是吗？把自己的犯罪杰作播放给世人看，这很像变态杀手干的事，而且他们的组织名字也很奇怪，“NOBODY IS GOD”…翻译过来就是无人是上帝，那也就是说他们认为自己才是真正的“上帝”，真是一群疯子..本以为出现什么..Jerry的信众这样的邪教团体已经够多了，现在又出现这群人，操..算了，不管他们，毕竟我现在正处于危险当中，马上要天黑了，那群实体也开始他们的行动，我必须立即做好防御工事。
//
//[Date:17/08/2013]
//
//他们攻进来了！今天很反常，所有在后室所记录到数据库中的实体们全出现在这里，它们巴不得要把我活剥了，该死，我必须立刻离开旅馆，寻找新的住所…
//
//等等…安静下来了，奇怪，现在是深夜，他们应该在外面活动，可现在他们不在了，怎么回事？不不不，这不可能，不应该是这样..不应该..
//
//（发出一声剧烈的碰撞声，随后传来渗人的尖叫声以及持续了2分钟的风声。）
//
//<记录结束>
//
//入口与出口
//入口
//在Level C-6的小巷里尝试切入墙壁，将有一定的几率达到此层级。
//从Level C-86里的怀特旅馆中找到一间浴室，将自己躺在满是洗澡水的浴缸中，当自己觉得快要溺死时，立刻从浴缸中起身后，就可达到此层级。
//出口
//目前只有一种退出此层级的方法。
//
//从大量敌意实体的攻击下幸存后，就会出现无名之人，它会将幸存的流浪者带入一个类似祠堂建筑内的暗道中，并告诉流浪者走进暗道后大约5秒后，就会达到Level C-117的任意位置。
//脚注
//1. 在无麻醉的情况下，会在流浪者的身上实验自己的新毒药和毒雾。
//2. 包括生存难度死区的层级、生存难度五级的层级。
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1489{}