//Level C-419
//评分: 
//+4
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
//安全
//无害实体
//语言丧失pexels-photo-12125615.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1
//图书馆的一个小书架。
//
//Level C-419是后室C层群的第419层。
//
//描述
//Level C-419其内部表现为一个向四周延伸的图书馆。该图书馆的地板由实木制成，任何试图破坏地板的行为都以失败告终。该图书馆的书籍上的出版社均为BKR出版社1，书的纸张类别均为字典纸。
//该图书馆内有许多无规则放置的大理石制书桌，杏仁水有大概率出现在书桌上，在该书桌上书写会使流浪者产生一种痛苦的感觉。
//任何人在第一次切入该层级时，都会在该层级的一处固定位置出现2，以后切入该层级时会在上次离开的地方出现。
//在该层级的书架旁，时常会遇到无面灵，这些无面灵在不打扰他们的情况下是无害的。
//其内部包含书种类如下：
//
//后室旅游指南3
//教材与辅导材料
//历史记录书籍
//散文
//小说
//报刊
//科学类书籍
//漫画（概率低）
//光碟（概率极低）
//特殊效应
//Level C-419持续产生一种屏蔽语言与屏蔽文字的特殊效应。
//
//屏蔽语言症状描述
//
//（1h内）无症状。
//（3h内）说出的任何会被认为是脏话的话语都会被舒缓的电子音乐替代。4 。
//（3h后）任何有关与爱情的话语都会被管弦乐替代。
//（10h后）和国家名称，政治倾向，人种有关的话语，都会使听者产生听见了，无法理解的感觉。
//（12h后）任何不属于自己国籍的语言都会被国际歌代替，
//（13h后）在见到一个全黑的实体后，人将在11小时内无法发出任何声音。
//屏蔽文字症状描述
//
//（1h内）无反应。
//（3h内）任何带有与他人交流性质的文字5 会在人的视野中变为纯白。
//（3h后）任何影视动画内容都会在人视野中变为纯白。
//（10h后）所有书籍都会在人视野中变为纯白。
//（24h后）本层级会变为一片虚空，掉出虚空会使你切入一个随机层级。
//基地、前哨与社区
//该层级无已知的基地、前哨或社区。
//
//入口与出口
//入口
//保持120小时不说话有概率切入该层级。
//切入任何图书有概率来到该层级。
//出口
//在Level C-419阅读时有概率来到Level C-110。
//坠入Level C-419虚空会使你来到一个随机层级。
//作者信息
//« Level C-418 | Level C-419 | Level C-420 »
//
//Footnotes
//1. 除了后室旅游指南。
//2. 该地被认为是层级的中心。
//3. 该层级的后室旅游指南无法显示任何有实体层级的内容。
//4. 判定方式为流浪者个人内心对这句话的定义。
//5. 例如：后室论坛、forchan。
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1419{}