//Level C-453
//评分: 
//+13
//+
//–
//X
// 
//
//生存难度：
//等级 3
//
// 
// 
// 
//Level C-453是后室C层群的第453层。
//描述
//Level C-453是一个占地约为40平方公里的圆形沙漠区域。该层级的天穹为一个巨大的纯白色碗状穹顶结构，该结构覆盖了该层级中所有已知的区域。通过初步化学测量，发现该穹顶的主要组成成分是玻璃二氧化硅与极其稀少的钯金属，以及一些成分未知的灰色粉末状杂质。通过地质探测仪的大规模扫描，发现该玻璃穹顶与地表接触处的玻璃壁向地下延伸了至少20千米，并且有极大可能延伸到了该层级的“最底部”。
//
//在与该玻璃穹顶接触的过程中发现该玻璃穹顶极度难以被破坏，并且当该玻璃穹顶发生破损时，无论破损的有多严重，其损伤的部分都会在10秒钟之内恢复如初。目前尚不清楚这种自我修复机制的工作原理。
//
//该玻璃穹顶在一刻不停地向层级内散发一种均匀、柔和的白光，这种白光被证实能够使被照射者感到镇定并保持冷静。当玻璃穹顶被击破出裂口时从裂口处向穹顶外观察，只能观察到一片漆黑，偶尔会出现一些类似于幻觉的闪电状弧线。据推测，白光的光源是玻璃穹顶本身，但目前所采集到的所有玻璃穹顶样本都不具有散发光芒的能力。
//
//XFsuoq.jpg
//沙黄色巨石堆。
//
//该层级的地表被夹杂着稀少碎石的积沙所覆盖，积沙中偶尔存在有灰黑色或沙黄色沙岩所组成的巨石堆，经常会出现多个巨石堆聚集在一起的情况。在远离巨石堆的区域偶尔会有大小不一流沙坑存在，其半径一般在3米到40米之间。值得注意的是，这些流沙坑会因未知的机制自发改变自己的大小，其纪录中的最大改变速率达到了 700m²/s，并伴随有该流沙坑内部吸力的大幅度增强，故不建议在非特殊情况下过于靠近流沙坑的边缘。
//
//在玻璃穹顶的顶部存在有一个巨大的圆形孔洞，这个孔洞会不断向该层级中倾泻大量的沙子。在该层级中存在着几乎无处不在的狂风，风速从1m/s到80m/s不等，从玻璃穹顶孔洞中流下来的沙子会被这些狂风吹到该层级的各个角落。不过值得一提的是，这些从孔洞中出现的沙子似乎并不会导致该层级的地表沙层加厚。
//
//沙化效应
//在该层级中，当一件物品被裹挟着大量沙子的风吹拂时，该物品与风沙接触的部位会逐渐转化为纯白色的沙子，风速越快风中沙子越多转化速度越快。这种现象被称为沙化效应。根据实验结果推测总结，风速小于7m/s与含沙量小于4g/L的风无法引起沙化效应。
//
//人类与实体同样会受到沙化效应的影响。人类直接遭受沙化效应影响时产生的感觉被描述为“针扎般的刺痛，随后身体就变成了沙子”。朝着沙化效应造成的伤口处涂抹杏仁水可以缓解并治愈沙化效应带来的影响，但是其并不能保证人员在风沙中的长时间移动。随着沙化程度的加深，杏仁水所带来的缓解治疗效果将会逐渐减弱，直至失去一切效果。
//
//目前已知的可抵抗沙化效应的物品仅有玻璃穹顶，沙岩巨石堆与地表积沙中的小碎石。值得注意的是，较为大型的巨石堆可以为人员提供躲避风沙的地点，但当风速超过了约45m/s的时候，巨石堆将失去为人员提供掩护的能力。
//
//值得一提的是，M.E.G.目前正在尝试使用该层级内的小碎石来制作所谓的“防沙服”，用于使人员能够长时间驻留在该层级内，但是因为没有材料能保证可以在对抗沙化效应的前提下有效连接这些小碎石，所以“防沙服”的制作工作到现在也没有取得任何进展。
//
//实体
//沙漠火蜥：
//vPGjoD.jpg
//一只沙漠火蜥。
//
//一种状似蜥蜴的攻击性实体，体长约为十二厘米，体表呈火红色并夹杂有黑色条纹。这种实体可以潜伏在积沙之中并在沙中快速移动。当沙漠火蜥发现人员之后，它们会朝向人员快速移动并尝试与人员发生接触。当人员与沙漠火蜥发生直接皮肤接触之后，接触人员会感到头晕、恶心、乏力，并且全身皮肤出现密集红斑。可以通过饮用大量杏仁水来治疗沙漠火蜥带来的症状。
//
//在人员与该实体接触五到十分钟之后，接触人员会死亡。死亡人员的尸体上的红斑会在人员死亡后发生急剧性的扩大。在人员死亡约半小时之后，死亡人员的尸体会突然从腹部炸开并随爆炸从其腹腔内喷射出几十至上百只沙漠火蜥实体。可以通过朝尸体喷洒杏仁水来阻止这种转化。
//
//沙漠火蜥实体也会受到沙化效应影响，但当这些实体遭遇到风沙时，它们会尝试钻到地表积沙的深处来躲避风沙。故不建议在遭遇到风沙时尝试挖掘沙坑来躲避风沙，因为在挖掘过程中有极大可能会挖到沙漠火蜥实体。
//
//沙漠火蜥在该层级内零星分布，通常不存在于巨石堆与流沙坑附近。
//
//基地、前哨与社区
//因沙化效应与贫瘠的物资，该层级内没有人类聚集地。
//入口与出口
//入口
//在任何一个存在沙子的层级中用沙子把全身埋起来即可到达该层级。
//出口
//从被击裂的玻璃穹顶的裂口中出去，会到达Level C-497。
//被流沙坑吞噬，会到达Level C-30。
//从巨石堆的石头切出，会到达Level C-469。
//从完好无损的玻璃穹顶切出，会到达Level 0。
//从玻璃穹顶顶部的孔洞里出去，会到达Level 48。
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1453{}