//Level C-417
//评分: 
//+22
//+
//–
//X
// 
//
//生存难度：
//等级 4
//
//不安全
//不稳定
//精神危害%E5%BE%AE%E4%BF%A1%E5%9B%BE%E7%89%87_20220801163503.jpg
//Level C-417的楼梯间
//
//Level C-417是后室C层群的第417层。
//
//描述
//Level C-417环境表现为一座规模宏大的旧式剧院内部，它完全封闭，因光线不足而略显阴暗。该层级内部装修主要以欧式古典风格为主，墙壁上刻有精致复杂的雕花，楼梯间及围栏处都摆放着精致的不明意义的雕塑，有与古罗马庙宇相似的拱门和雕花的穹顶。
//
//该建筑共有12个楼层，由中心旋转楼梯连接各个楼层，除最底层之外其他楼层布局都完全相同，但光线会由上到下依次减弱，且愈是往下楼层墙壁雕刻及塑像等装饰都愈加华丽精致。
//
//各楼层内部设有客房，餐区等众多房间，及连接中心楼梯的最底层的圆形舞台，舞台的面积约为190平方米，舞台的周围共有12排华丽宾座，宾座上几乎坐满了造型各异且残缺不全的人形木偶，该木偶已确认不具有任何危险性，似乎只是装饰品。中心楼梯至2层开始呈放射状由吊桥连接各层的走廊，走廊呈圆环状连接各层的各个房间，所有房间均分布在走廊的内侧，即圆环的外圈，圆环内圈为镂空设计，透过内圈围栏可观测到该建筑的其他楼层及房间。
//
//走廊内每隔一个房间设有一盏灰暗且雕刻精致的壁灯，灯下通常放置着精致华丽的柜屉，柜内较小几率放有少量杏仁水及其他重要物资，且此层级具有较弱的Wi-Fi信号。
//
//各房间内都设置有精致华丽的梳妆台，空置的床铺，衣柜及各类物品，地上通常会放有造型独特的木偶，少数房间内设有豪华餐桌，餐具，且每隔几小时将凭空出现未知的食物，经断定，所有突然出现的食物都不可食用，且含有剧毒，食物成分未知，疑似苯基硫醇，叠氮化钠，麻黄及其他剧毒化学品，误食者若不及时抢救大概率在两小时内死亡。
//除此之外，该层级不存在任何实体。
//
//%E5%BE%AE%E4%BF%A1%E5%9B%BE%E7%89%87_20220801163508.jpg
//2楼
//
//剧场
//“舞台剧”是该层级唯一的活动，从流浪者进入该层级2小时后即开展，无法被中阻，除非层级内所有的流浪者死亡。剧戏开幕时舞台将会亮起，整个剧院开始播放刺耳的舞曲。
//
//据多位去过Level C-417并且幸存的流浪者描述，他们多数都亲眼目睹了与自己同行的另一位流浪者在剧戏开幕时突然痛苦抽搐，与空气对话，拼命挣扎最后以各种方式自杀死亡的全过程，不明原因，且值得注意的是，多数幸存的流浪者均为与他人结伴而行，仅有几名流浪者是孤身进入且在剧戏开始前离开的。
//
//- 隐藏
//为更深入调查该层级，M.E.G.派遣了一名调查员前往该层级进行实地探查，
//以下为调查时的通话录音片段：
//
//调查时间：开始于2022.8.1.10:30
//记录开始…
//……
//两小时后
//调查员：好吧，这里到底是什么鬼地方，这里的建筑看着真诡异。
//
//调查员：真是无聊的地方，我到现在都没看见什么特别的东西，什么都没有。
//
//基地：没有其他异常吗？
//
//调查员：我想应该没…
//
//一阵特殊的音乐响起——
//
//调查员：什么…
//
//基地：怎么了？
//
//调查员：我想我看到了…等等，那…那是，那是我的母亲！还，还有我的妻子…
//
//基地：什么？
//
//调查员：他们好像在…邀请我参加什么…什么剧场？
//
//调查员：……（似乎在自言自语）
//
//调查员：哦不，别这样对我的爱人，别这样！
//
//调查员：不，别碰她，求求你了！不！
//
//基地：你怎么了？发生什么了？
//
//调查员：真是见鬼了，妈的！快，快来救我，不，不应该的…
//(通讯的另一头传来了调查员绝望的尖叫声）
//
//基地：什么？你需要救援吗，我们马上派人过去…
//
//砰——
//（一阵巨大的撞击声响伴随着玻璃碎裂的声音）
//
//……
//
//基地：喂？你还好吗？喂？
//
//……
//通讯中断
//
//之后M.E.G.立即派救援队赶往了Level C-417,但现场早已没有任何痕迹，调查员也不知所踪，据判断该调查员或已死亡。
//
//
//
//据这次的调查，Level C-417被推断为是危险性极高的层级，孤身进入该层级是极其危险和不当的。该层级似乎能够借助舞曲拟造根据流浪者记忆编织而成的名为“剧戏”的幻境，幻境多数与流浪者最为惧怕的事物有关，或是制造能带给流浪者精神上的折磨的幻象，且“剧戏”的开端似乎是美好的，幻境中的事物会用各种方式邀请流浪者参加戏剧表演，且似乎无法拒绝，在参加的过程中会突然以各种方式插入所有能够让流浪者崩溃的意外，促使流浪者自杀或自残，且该幻境似乎只对进入该层级的其中一名流浪者有效，其他同行者看不到幻境。当受害者死亡后，“幻境”会再次随机降临在其他任意一名流浪者的身上。
//
//受害者通常都是所有处于该层的流浪者中最为接近舞台的，在陷入幻境时会有意识的站上舞台，并做出各种戏剧性的动作，即使受害者知道自己处在幻象中，也会不受控制的配合演戏，越是挣扎尝试逃离只能遭受更大的伤害。目前还没有能够逃离幻象的方法，唯一能够规避伤害的方式就是在舞台剧开始前离开该层级。
//基地、前哨与社区
//基于该层级的特性，该层级无法建立任何据点或基地。
//
//入口与出口
//入口
//在Level C-140的城市中找到一张剧院的海报，触碰即可到达Level C-417。
//于Level C-198中进入一扇看起来较精致的门会来到Level C-417。
//出口
//在观众席中找到一个空余的座位，坐下会切入Level C-225。
//破坏观众席上的人偶可切入Level C-245。
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1417{}