//Level C-492
//评分: 
//+4
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
//安全
//稳定
//无有害实体
//Level C-492是后室C层群的第492层。
//
//描述
//Level C-492是一个看起来类似古代城池的层级，外围是一堵城墙，内部则是城镇，层级中心有一座皇城，似乎是600年前的古城，此层级有着规律的昼夜更替，以及规律的四季变换，与正常古城相比不同的是，这座城池似乎已经被抛弃，除了中心的皇城外，里面没有任何人，以及实体。
//
//此层级内部的楼房都是年代久远的瓦房，房间内铺满了灰尘，表现出50年没有人住过的迹象，平常该有的家用器具也不知所踪，路面上非常寂静，无生物发出声音，路灭的灯火早已熄灭，一些房子早已倒塌。城墙有所残缺，墙上悬挂着一些已经失去原本鲜艳色彩，褪色了的彩旗，上面没有任何的图案以及文字。城墙上用于城防的武器大多数都已磨损，四周的城门以及翁城的城门都敞开着，往外都连着一条被沙石掩埋的路，路段消失在虚空中。
//
//这个层级唯一有生命迹象的地方市中心的皇城，皇城与内城相隔一堵城墙，有四个常态入口从内城进入皇城，皆为城门，M.E.G.为了不破坏设施，决定使用梯子进入皇城。
//
//皇城内部只有皇宫中心的左侧亮着一个烛灯，光亮极其微弱，左侧的房间内有一名老者（现今已被M.E.G.命名为守灯人），老者看起来已岁过90。这名老者没有敌意，且较为友好，他在每个凌晨都会去打更，发出声音，且每次行动都会带上他的烛灯，去巡视一遍皇城。他仅会说中文，且只能以文言文方式表达，M.E.G.预测此层级内原仅有此一个生命。
//皇城的其余部分皆已破败，四周的城墙更是有一部分得到了严重的损坏，上方的一部分倒塌下去。内部的器具也不知所踪，跟内城一样，也表明出50年无人居住过的迹象，M.E.G.预测此层级除了守灯人以外的人皆已撤走。
//
//城墙外面两公里皆为荒地，再往外就是虚空，被空气墙所阻挡，无法越过。
//M.E.G.对此层级开展了多次调查。
//
//实体
//除上文提到的皇城内的老者“守灯人”，无其他实体。
//
//基地，前哨和社区
//M.E.G.Level C-492调查组
//M.E.G.在此层级的一个基地，对此层级展开调查与研究，人数为5，主要审查“守灯人”，以及探索层级。
//
//入口和出口
//入口
//在Level C-391中找到一个年代久远的古碑，从古碑上切出即可来到此层级。
//在Level C-117找到一副古画，从其切出，会来到此层级。
//
//出口
//在此层级中找到一本古书，将其仔细的翻阅一遍，会来到Level C-110。
//在此层级的荒地部分切出，会来到Level C-391。
//
//更多出入口待查
//
//隐藏
//52年前，这里还是一片繁华的城池，灯火通宵，生活的人很多，就连我们的皇帝都住在这个地方，也是我爱的地方，那时候我的亲人都不在世了，我也继续生活，直到有一天……
//
//这里发生了一场大规模地震，地动山摇，很多木制房子倒塌，让上万人因此丧命，皇帝也赔了一条胳膊，此事发生之后，很多有钱人都往南跑了，他们很迷信，乱听一些路边算命的人说：“这是不祥之兆，此地已经被上帝惩罚了，能快跑就快跑”之类的话，导致上万人都跑了，皇帝也跑了。
//
//一些留在这里的人把房子改成更为坚固的砖瓦房，结果一年后，城池每天下雨和打雷，甚至有一个雷电劈进城里，城池后面的山直接爆发了一场洪水！淹进城了，又有很多人因此丧命，之后还下了几场冰雹，虽然没有造成实质性伤害，但很多人都因此逃了，他们要跑到南边的城池去，一两个开头逃，后来几个看到别人都逃了也全都逃了。
//
//最终，这里只剩下1000多人，不过他们都是岁数大，愿意留在这里当最终归宿的，我也46岁了，我也选择了留下，去那儿也不如在这儿迎接死亡，后来，越来越多的人都去世了，有人还听说，南边有国家打过来了，都城沦陷了，他们往东边逃了。更多的人死了，剩下了我，除我以外的最后一个人是两年前死的，是我最好的朋友，他的家人在五十余年前皆已撤走，他决定留下陪我，他死的那天，我去外面帮他接完水，回来的时候，发现他已经奄奄一息了，他最后对我说：
//
//“守好城，这是最后的希望了。”
//
//这就是这里的历史了。
//
//城里有我的一块地，是我改造成农田的，也是我仅存的食物来源了，水我会去旁边的山泉去接。
//
//我98岁，腿脚也不灵便了，过几年也就死了……50余年前我也这样认为，认为我快死了，把这里当做最后的归宿，当做灵魂的归宿，不是最好的吗？
//
//我在外奔波20年，最后名落孙山，回到这里，亲人也都已去世，叶落归根也挺好的，就留在了这里，谁知又活50年？去年，我在城里面搜了点蜡油，做了一盏灯……
//(随后，守灯人将灯提了起来)
//这盏灯的光亮，不管多么微弱，我都会带他去照亮一遍城池，这里还有光，还有希望，这是我的灵魂归宿，在我即将走不动时，我会把它放到我的农田之上，填满蜡油，让他再继续亮下去，证明着，这个城池也有光明的历史。
//
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1492{}