//Level C-488
//评分: 
//+22
//+
//–
//X
// 
//
//生存难度：
// 
// 
//未知中量实体bisai-1.jpg
//Level C-488的第一张图片。
//
//Level C-488是后室C层群的第488层。
//
//描述
//Level C-488是一处无重力的异空间，由“天空”和“峡谷”组成，天边由来自不明区域的散射光，光源呈现橘黄色。有人猜测其内部实质上为一个原子和一幅贴在原子表面的发光水墨画。流浪者进入Level C-488时，会被急剧缩小成电子大小，然后在本层级“天空”区域的任何一处出现。但迄今为止，M.E.G.并没有任何证据能够证明这个猜测属实。
//
//在Level C-488内呼吸会比在普通层级更为困难，但流浪者通常能以游泳的姿势“滑动”空气，以向某个方向无摩擦的滑行。当流浪者遭遇撞击时，很有可能会因为惯性的作用而暂时失去行走的方向，直到其撞上一个物体或撞到“峡谷”区域。
//
//峡谷区域暗淡无光，内部由许多无法破坏的硬块组成，这些硬块呈球体，并在Level C-488绵延数千里。根据探测数据显示，这些“峡谷”中的大陆表面都或多或少的存在一定曲度。因此推测当中将其称之为“原子核”。峡谷为灰黑色，且会使流浪者产生某排斥感，即“对其厌恶”、“想离开”、“不愿再看一眼”的想法。离开峡谷的唯一办法是向“天空”区域滑行而去。
//
//虽然天空中弥漫着暗黄色的光芒，但其并不能带来更多的热量。Level C-488内部常年维持在-10℃左右，没有准备的流浪者很有可能在本层级因失温而死亡。即使如此，流浪者也有可能会遭遇由于下文提到的未知实体的撞击而导致无限期的失衡飞行。故建议到此的流浪者或工作人员做好充足的防寒准备和侦察装置。
//
//实体
//一种集群的黑色物体出没于本层级的天空高处。它们个头比流浪者稍大，移动速度极快，且在空中不受重力影响的做直线运动。如果流浪者被该实体撞击，则有可能会因失去方向而丧失生命。
//暂不清楚这种实体的更多信息。1
//基地、前哨与社区
//M.E.G.（探险者总署）“水墨”前哨站
//大部分时间处于无人值守状态，只有探测时期才会派遣人员暂住。
//进入出口向右转，直到在远处刚好能看到一颗迎客松，向下以1m/s的速度行进约10分钟左右即可到达。
//有五间木屋，内部有一些暂停运作的仪器。
//入口与出口
//入口
//在Level C-166创作画作时，只使用灰黑色颜料进行绘画即可到达本层级。
//在Level C-196宫殿旁的“藏书阁”内能找到一幅印有“李”字图案的水墨画，拿起它超过1分钟即可被传送至本层级。
//在Level C-435中“天守阁”内可以找到一间挂有《黄山劲松图》的水墨画，切入该画作即可到达本层级。
//出口
//一直向远处山峰飘去2，直到被光线覆盖整个身体后，即可到达Level C-81。
//附录
//- 验证通过
//M.E.G.罗经点兵团内部论坛_2020_9_10_X061524#
//讨论串标题：水墨一般的新仙境
//讨论串状态：已锁定
//讨论串创立者：用户ArmY_04
//讨论串创立时间：2021年4月10日6时15分24秒
//最后回复：2021年5月12日16时00分00秒
//
//>>用户：ArmY_04
//嘿，兄弟们！今天早上去Level C-435检查天守阁水墨画的时候我意外发现了这里。
//我猜这可能是一个新层级。
//A类移动设备   发表于 396天前
//>>用户：ArmY_04
//           bisai-2.jpg 
//           A类移动设备   发表于 396天前
//>>用户：ArmY_50
//我去，老哥，这是真的吗？
//A类移动设备   发表于 396天前
//>>用户：ArmY_23
//带我一个，我也想拿这个发现去总部那里领奖！
//A类移动设备   发表于 396天前
//>>用户：ArmY_23
//这个地方看上去好像不是那么恐怖。
//A类移动设备   发表于 396天前
//>>用户：ArmY_04
//回复 @ArmY_23：千真万确，我对照了档案库里的文件，确实没有这样的层级。
//这里没有重力但是可以呼吸，我现在整个人都漂浮在空中，不知道怎么移动。我现在甚至都不知道自己安不安全，会不会这里有什么精神影响……
//如果我之后没再回复你们，记得告诉其他人别来这个地方。
//A类移动设备   发表于 396天前
//>>用户：ArmY_03
//很强的压迫感。
//早年间我和徒弟们出去找新层级的时候，也遇到过这种情况。
//A类移动设备   发表于 396天前
//>>用户：ArmY_50
//老哥注意安全！
//A类移动设备   发表于 396天前
//>>用户：ArmY_04
//在那里睡了一觉醒过来了，意外的没事。无重力的感觉太晕了。
//这里好像没有昼夜循环，黄色的光一直从山那边照射过来，我今天打算游到那边看看。
//A类移动设备   发表于 395天前
//>>用户：ArmY_04
//我怎么在探测器上看到自己一点都没移动？
//明明我自己已经感觉游了好几公里了。
//A类移动设备   发表于 396天前
//>>用户：ArmY_04
//我快累死了……那啥比探测器上说我的位置一点都没动，是不是坏了？
//A类移动设备   发表于 396天前
//>>用户：ArmY_82
//你现在目前的情况还好吗？能不能录个视频让我们看看？
//PC端   发表于 396天前
//>>用户：ArmY_04
//[视频文件已丢失]
//A类移动设备   发表于 396天前
//>>用户：ArmY_23
//等等，那个是什么？
//好像有什么黑乎乎的东西在雾气里面。
//A类移动设备   发表于 396天前
//>>用户：ArmY_23
//           bisai-3.jpg 
//           A类移动设备   发表于 396天前
//>>用户：ArmY_82
//好像是一些移动的鱼群，那玩意的速度贼快。
//我刚刚也看到了，视频里就只有几帧。
//PC端   发表于 396天前
//>>用户：ArmY_04
//不好！它们好像向我
//A类移动设备   发表于 396天前
//>>用户：ArmY_03
//兄弟你还好吗？
//A类移动设备   发表于 396天前
//>>用户：ArmY_23
//喂？兄弟！兄弟！
//A类移动设备   发表于 396天前
//>>用户：ArmY_82
//该不会是被实体攻击了吧。
//PC端   发表于 396天前
//>>用户：ArmY_50
//老哥，你还在吗？我们已经上报总部了，很快就会有人来救你！
//A类移动设备   发表于 395天前
//
//
//>>用户：ArmY_04
//我还好，我没事。
//我被那操蛋玩意击中了，然后一直往下飘，根本控制不住。
//刚才我好像撞到了地面，腰好疼……嘶。
//A类移动设备   发表于 395天前
//>>用户：ArmY_04
//我看不到那种黄色的光了，我身边好像是一些峡谷，不过岩壁很平滑，不像是石头。
//我敢保证这绝对他妈不是什么石头，那个材质……我不敢碰它。
//A类移动设备   发表于 395天前
//>>用户：SCI_X6
//我是材料部那边的人，你能描述一下那个东西的外观吗？
//PC端   发表于 394天前
//>>用户：ArmY_23
//看起来他很忙。
//也许是在寻找出口什么的，但愿吧。
//PC端   发表于 393天前
//>>用户：ArmY_04
//我从峡谷那里上来了，费了很大的力气。还好中途没有遇到那些奇怪的鱼群。
//回复 @SCI_X6：看上去很光滑，不会反射光，像一个很大的曲面。
//A类移动设备   发表于 387天前
//>>用户：SCI_X6
//回复 @ArmY_04：你去更远的地方看看它的整体外观，再告诉我一次。
//PC端   发表于 387天前
//>>用户：ArmY_04
//回复 @SCI_X6：行，不过我手机电不多了，我得省着用。
//A类移动设备   发表于 386天前
//>>用户：ArmY_04
//           bisai-4X.jpg 
//           A类移动设备   发表于 382天前
//>>用户：ArmY_04
//回复 @SCI_X6：这个是我离开的峡谷的正上方照片。我现在眼前都是一些只有高度近视的人才能看到的玩意。
//我又看了一下探测器，上面的点依然是一点都没移动。
//A类移动设备   发表于 382天前
//>>用户：ArmY_23
//老哥，你能平安归来就好。
//实在不行就试试特殊手段吧。
//A类移动设备   发表于 382天前
//
//
//>>用户：ArmY_04
//我出来了，我现在好像在Level C-81。
//我现在他妈只想赶快回基地，那里太尼玛吓人了。
//A类移动设备   发表于 365天前
//>>用户：ArmY_23
//恭喜恭喜！
//A类移动设备   发表于 365天前
//>>用户：ArmY_47
//能活着回来就是万幸。
//A类移动设备   发表于 365天前
//>>用户：ArmY_08
//刚刚翻了一下记录，老哥你真是命大啊。
//PC端   发表于 365天前
//>>用户：ArmY_50
//等了这么多天总算是没有白费，回基地了请你喝几杯。
//A类移动设备   发表于 365天前
//>>管理员：A_Cloud已封锁本贴。
//
//>>系统提示：本贴已移入归档界面。仅管理员可查看。
//
//- 验证通过
//- 隐藏邮件
//发件人：scientist.SCI_X6@backmail.com
//收件人：meg.researchdirector@backmail.com
//主题：关于新层级的询问
//主管您好，我是之前有来询问您的科研部的成员。之前我有寄给您信件，请问您是否提前阅读了那些资料？我把关于那个新层级的信息都写在里面了。
//
//——钱泽明
//
//发件人：meg.researchdirector@backmail.com
//收件人：scientist.SCI_X6@backmail.com
//主题：回复：关于新层级的询问
//我们已经看到了你的研究和推测，并且在会议里面商讨了此事。
//你说那个层级是由一个原子组成的世界，外面包裹着一幅水墨画，而且人一进去就变得和电子一样小——这一点许多科学家都发表了不同的意见，有一部分人对于你的推测尚且存疑。
//因此我们正准备向组织申请再次前往该层级的机会，从而使用更精确的仪器进行测量。
//
//感谢你的反馈，我们已经将奖金发送至你的邮箱，请注意查收。
//
//——M.E.G.科研部
//
//作者信息
//« Level C-487 | Level C-488 | Level C-489 »
//
//脚注
//1. 推测这种实体很有可能是正在高速运动的“电子”。
//2. 时间由1小时到30天不等。
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1488{}