//Level C-485
//评分: 
//+12
//+
//–
//X
// 
//
//生存难度：
//时间及空间稳定
//无实体存在及无切入/出可能
//边缘环境refuse-clock-clarify
//夜中旅馆一角
//
//Level C-485是后室C层群的第485层。
//
//描述
//Level C-485是一片存在一座岛屿的海洋。目前整个岛屿已被完全探索而且后天建立了大型人造设施。该层级的海洋已被确定有明显的边界，即切入该层级与切出该层级的界限。
//
//根据目前所确定的信息，该层级存在边缘效应，即 “逻辑潮汐”现象（Logical Tide）1 ，因此该层级被认为可能是后室中最边缘的层级之一。
//
//该文档对于层级的大部分描述将分为岛屿与海洋两部分进行。
//
//岛屿
//该层级的岛屿面积约为6.2万平方米，地势大都平坦，部分略有起伏。岛屿外围砂质沙滩广布，沙质细腻，质量上乘，岛屿内圈壤土土壤广布，腐殖质与矿物质富集，是理想的耕作土壤，此外全岛稀疏分布温带阔叶木。全岛处于温带海洋性气候环境下，冬暖夏凉，时有降雨，气候宜人。
//
//岛屿上约1.8万平方米的区域后天建立了大型人造设施，即边陲海旅馆。相关信息在附属文件中将详细提及。
//
//岛屿上约0.5万平方米的区域后天开辟了大片耕地，为该层级提供一部分的食物。
//
//海洋
//该层级的海洋面积约为75万平方米，形状大致为圆。在距离岛屿约120米的范围内（下文统称为浅海区），海洋平均深度约为2.6米，在距离岛屿更远的区域，海洋深度将缓慢增加，在海洋的边界，即该层级的界限，海洋深度将到达1580米。
//
//该层级海洋中存在少量未知浮游生物，无其他海洋生物存在。
//
//下面是附属文件
//
//收起
//边陲海旅馆是由S.C（苦难邦联）-明晦科技在层级Level C-485中岛屿西北沿岸建立的设施，如果您需要入住，请仔细阅读下文。
//
//关于旅馆
//本旅馆是相关设施配置完备的综合式大型旅馆，本旅馆可分为主体部分与附属部分，该文件对于本旅馆的描述将分为主体部分与附属部分两部分进行。
//
//本旅馆主体部分由数栋五层楼房与相连接的地面设施组成。
//室外为露天区，引导流浪者前往其他层级或入住本旅馆以及提供咨询服务的流动咨询处，用于室外运动的室外运动场，提供各类休闲服务的综合式室外花园被设置在此。
//楼房一层为大厅区，办理入住手续以及其他相关手续的大堂前台，提供基础饮食的大堂餐厅，提供暂时休息与寄存的等候室被设置在此。
//楼房二层为综合区，用于室内运动的室内运动厅，提供各类室内活动的俱乐厅，提供各类电子游戏的电玩厅，提供茶点的茶水厅，提供多种特色餐饮的餐饮广场，观景与餐饮并用的综合式空中花园被设置在此。
//楼房三层为居住区，办理延续手续以及其他手续的客房前台，提供居住的客房，观景用的空中花园被设置在此。
//楼房地下一层与地下二层为员工区，仅本旅馆的员工与相关人员可进入。
//
//本旅馆附属部分由若干零散分布于该层级岛屿上的设施组成，仅本旅馆的员工与相关人员可进入。
//
//关于流程
//
//#常规流程
//
//在绝大多数情况下，您进入该层级时会来到本旅馆主体部分的露天区，您可自行前往大厅区或在定期巡视的流动咨询处的引导下前往大厅区办理入住手续。
//
//在大厅区大堂前台工作人员的引导下，您将在入住手续中填写您的个人信息进行登记。（包括姓名，性别，年龄，切入后室时间，入住时间）
//
//在登记完毕后，您需要缴纳500毫升的杏仁水作为入住费。
//
//在缴纳完毕后，工作人员将交给您客房钥匙并引导您来到对应的客房。
//
//#非常规流程
//
//情况一:
//您并不打算入住，仅需要短暂休整。
//
//您将在大厅区大堂前台工作人员的引导下办理休整手续。（类似办理入住手续）
//在办理完毕后，您将在工作人员的引导下进入等候室中的单间内进行休息。
//
//在该流程下，本旅馆可提供12小时的等候室单间免费使用时间，您可以在免费使用时间内任意进出您使用的单间。在免费使用时间耗尽时，您将在工作人员的引导下来到本旅馆主体部分的露天区并在工作人员的指导下切出该层级，切出后您将回到原来的层级。
//
//情况二:
//您并不打算入住，仅需要饱餐一顿。
//
//您将在大厅区大堂前台工作人员的引导下办理用餐手续（类似办理入住手续）。在办理完毕后，您将在工作人员的引导下进入大堂餐厅进行用餐。
//
//在该流程下，本旅馆可免费提供包含一瓶纯净水（净重约200克，可提供加热或制冷），两罐罐装龙肉（净重约400克，可提供加热），一碟融化的油腻棉花糖（净重约20克，含少量杏仁水），一碗沙拉（净重约40克，含果蔬）在内的一次基础饮食。
//
//基地、前哨与社区
//S.C（苦难邦联）-明晦科技“边陲海旅馆”层级设施
//上文已详细提及，不再此赘述
//
//S.C（苦难邦联）-武装联合“滨卫”层级哨点
//位于该层级岛屿上的数十个哨点附近
//由数百名苦难邦联成员组成
//团体定期分批次按规定路线对层级内的岛屿进行巡逻
//团体随时对紧急情况进行响应
//该哨点建立的目的是维护层级内安全稳定的秩序
//入口与出口
//入口
//在Level C-207的游泳区中溺水即可进入该层级
//在Level 11中进入一辆刷有淡海蓝色油漆的小型巴士，入座等待十五分钟后即可进入该层级
//出口
//在该层级的边陲海旅馆的主体部分的露天区切出，流浪者即可回到原来的层级
//重复检测，确认！
//领导者，您好！欢迎使用数据库锚点系统！
//正在响应….
//经检测发现终端信息管理员在该层级的文档中设置了一个隐蔽锚点/
//经检测确认授权阅读许可的权限等级为领导者/
//经检测确认您符合阅读条件，请阅读锚点信息！/
//正在响应…
//锚点信息加载完毕！/
//
//很高兴地告诉各位领导者，层级Level C-485的一切工作进展顺利，她已经开始为我们送来金蛋了！在不久之后，各位将亲自感受这巨大的收获！
//2022.6
//——“边陲海旅馆”层级设施S.C管理员
//
//作者信息
//脚注
//1. 一般指后室-前厅思维模型中的渗阻带中的大部分现象，如物理定律混乱，物理数据峰值规律化与自由扩散化等
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1485{}