//Level C-465
//评分: 
//+15
//+
//–
//X
//
//meglogo2.svg
//M.E.G.机要文件数据库
//> 访问本数据库需5级权限，请确认您的等级并向下阅览。
//
//> Observer/Stretch-548927
//
//> 警告：您将以“监督者-Stretch”的身份进入数据库内，该账号为监督者权限级别，若您的职务无法与其匹配，将立刻定位您的位置并原地处决。（Y/N）？
//
//> Y
//
//> 安保证号检测完毕，请将您的虹膜对准摄像头，且不要移动或眨眼。
//
//> 虹膜认证通过。
//
//> 指纹认证通过，欢迎，监督者-Stretch。请指示。
//
//> SEARCH/Level C-465
//
//> 查询到文件：Level C-465
//
//> 警告：文件内存在M.E.G.与整个后室体系的绝密，仅限持有特殊密钥的人员阅览。是否进行阅览（Y/N）
//
//> Y
//
//> 请输入指令：海面是否平静？
//
//> 请勿远望须臾。
//
//> 特殊权限验证通过，以下是您要访问的文档。
//
// 
//
//生存难度：
//等级 3
//
// 
// 
//大量实体
//Level C-465是后室C层群的第465层，由于实体过多和危险极大，不适于在此处生存。最初发现的发现记录已不可考，推测为1957年3月13日。
//
//levelc465-3.jpeg
//Level C-465的洞穴入口处场景，摄者未知。
//
//描述
//Level C-465是一处类似于前厅的海洋。该地区拥有昼夜交替和温度变化等功能，且会自四季的变化产生天气的改变，但与前厅有微小的差异。海洋会有几率出现小岛，上方拥有木材可制作木筏。该海洋会有一定几率全部变成杏仁水，上方会漂浮一些有利于生存的道具。在收集物品后，无论流浪者处于何处，都会在3小时内来到一处洞穴。在对象拒绝进入洞穴时，海面会立刻变成血红色，并散发出一种难闻且具有毒素的气体，强迫流浪者进入洞穴内部；在出现物品时未采集时，就会出现暴风雨等现象，同时让流浪者进入洞穴中躲避危险。
//
//其洞穴入口处极为狭窄，可以勉强通过一个人。但其内部已经超过了一万千米，仍有剩余部分未探索，目前推测为无限空间。Level C-465的洞穴主要由花岗岩和一种不知名的岩石组成，且在任意位置会出现某种未明确的符文和图案，根据最新检测法发现，这些符号最早始于20亿年前。洞穴中经常有苔藓、芭蕉叶、大王花等植物，并已全部枯萎，但可以直接食用。其内部拥有Wi-Fi，可以与前厅或其他层级的流浪者进行联系。
//
//shuijing
//Level C-465洞穴内矿物的高度3D模拟照片
//
//在进入洞穴并向前前进395米后，会出现一个直径3千米，高度2千米的圆形空间。在其空间的四周处，拥有40个3千米 × 3千米 × 3千米的大型空间。所有已知的站点都驻扎于此处。空间链接着多个超过2千米的通道，里面经常诞生一些有害实体。所以，不允许流浪者独自进入通道中，必须超过三人且其中拥有可保护力量的小队入内。在通道尽头有几条小溪流过，经确认，该溪水可以直接食用，但不允许在河水变成其他颜色时进行任何接触行为。
//
//洞穴的各个部分拥有某种矿物，形状不规则，通体呈现为白色透明状，体积多数为24立方厘米。其表面反射所有电磁波，内部粒子和原子核由强相互作用力进行锁死，达到中子星的密度，表面温度趋近于绝对零度。但该矿物可以在60℃~140℃之间被融化，融化后可以治疗烫伤、冻伤等外在疾病。同时，该矿物拥有极大硬度，适合做成防御和进攻工具。因为其的物理因素，当前，M.E.G.正在考虑通过项目实现真空瓦尔塞克斯电场涡环推动装置。通常情况下，在这些矿物附近会找到大量的Object C-8，且都为正常。
//
//经常有流浪者汇报称，洞穴中经常出现一些类似于“数据错误”的现象。具体表现包括但不限于在一些地方出现大片的蓝色、在墙壁上出现多行白色的代码、实体出现闪烁不定的现象、整个Level C-465变成白色或黑色且在背景中出现代码、声音出现延续的颤动以及在全部变黑是看见一个无可名状的实体出现。通常这种现象，被归类为正常现象处理。并告知所有人遵守M.E.G.的指挥行动。
//
//实体
//该层级具有数量繁多的实体，甚至可以在暴潮时期增多至可能摧毁安全区的程度。当前记录的实体包括但不限于：
//
//Entity C-2 - “清道夫”
//Entity 8 - “猎犬”
//Entity C-4 - “逐尸鸟”
//Entity 45 - “木灵”
//Entity 10 -“窃皮者”
//Entity 108 - “猎鸟”
//Entity 107 - "腐蚀者"
//Entity 177 - “赐皮者”
//Entity 3 - “笑魇”
//Entity 6 - “钝人”
//Entity 13 - “传送者”
//Entity C-6 - “骇笑者”
//Entity C-67 - “抛锚客”
//Entity 4 - “死亡飞蛾”
//Entity 24 - “尸鼠”
//Entity 39 - “八层之蛛”
//Entity 9 -“无面灵”
//Entity 83 - “隐士”
//Entity C-12 - “鬼警”
//Entity C-23 - “噬命之灵”
//“The Red Knight”
//基地、前哨和社区
//M.E.G. “基石”前哨站:
//此前哨站没有多数人进行驻扎，常驻人员约有500人。控制住Level C-465的一处出口，并可通过该层级驻扎于Level 197的前哨站（“感觉良好”），在爆潮时进行疏散流浪者。当前与B.F.P.F.保持合作关系，双方首要目标是让误入的流浪者逃离，以及搜集该层中的Object C-8物体和M.E.G.所需要的矿物。
//
//更多信息请参见《探险者总署基地总汇文件 - Level C-465基地 - “基石”前哨站》
//
//B.F.P.F.六号矿石采集站点：
//站点内常驻人员约有400人，控制了该层级的一处出口，直接通向Level C-45。其目标与M.E.G.是相同的，与M.E.G.保持合作关系。
//
//恶食者营地：
//该基地由三十二位噬命之灵所建立，于Level C-465中觅食，且会重新回想自己是人类。对象在黑雾靠拢时将会变得极为危险，禁止任何人员靠近。其在正常情况下，可以使用正常食物交易手中的稀有矿物。基地内人员十分愿意保护流浪者。恶食者营地与失落的大厅协会维持重要的联盟关系。
//
//失落的大厅协会（The Lost Hall Society）：
//失落的大厅协会主要由46个人类和5名噬命之灵组成，主要工作为向Level C-465的深层进行探索，并保护所有切入这里的流浪者。保护和管理此层级的安全区，与恶食者营地作为同盟。
//
//入口与出口
//入口：
//在Level 8对矿脉尝试切出，可能切入此层
//进入Level 7的水下洞穴可以进入此层
//深入Level 7.9可以进入此层
//如果在Level 140发现地下洞穴，可以进入并通往此层
//Level C-8发现的矿洞可已进入此层
//进入Level C-10的水下洞穴可以进入此层
//在Level C-13的楼梯不断往下走，可以进入此层的休息区
//深入Level C-20可能进入此层
//藉由Entity 81进入此层的废弃矿井区域
//出口
//藉由M.E.G.基石基地通往Level 197。
//藉由B.F.P.F.矿石采集站点六号通往Level C-45。
//在此层的废弃矿井区域里，找到电梯离开，并将传送至随机的层级。
//附录
//附录Ⅰ：符号的研究
//备注：该符号是第六次探索时所拍摄的，“基石”前哨站负责回收信息。随后转交给信息研究部，进行进一步的研究。下述文件选自碳-14与Vertex Zenith所合著的《洞穴研究 - 符号专列》，出版于2021，2，25。
//
//……经过Carbonium14-Zenith团队的尽力研究，自5月18日开始，研究开始了突破性的进展，且在里面发现了一些令人我们意想不到的秘密。这些信息有些被高层列为了最高机密，有些则可以公开信息，但下面所说的，将是受过高层批准的内容——但也请各位理性观看。
//
//在几天前，6号探险队带来的所有样本似乎都可以组成一串完整的故事线索，主要就是一个庞然大物占领了整个后室，建立了一个巨大的海洋。它似乎还没尽兴，又建立了一个巨大的没有边界的洞穴。很显然，就是现在我们所居住的Level C-465。但由于高层指令，制造的工具和过程被彻底隐藏了。在制造完成后，它利用人类都无法想象的时间建立了整个后室体系。之后，它认为整个后室死气沉沉的，于是建立了许多异常生物——也就是现在所称的实体。
//
//虽然说这些故事很像古代的女娲和盘古，但根据我们能收集到信息便只分析出了这些，当然这些图片上还有一些未知的文字存在——也就是后室最原始的文字。虽然大部分文字我们都已经破解完成，但解密工作也仍在进行中。我们能破解的文字也大部分是一些十分简单的语言，且所有的解密工作都已被列为了最高机密。但我们大致可以明确的是，所有密码都是一些类似于咒语的语言。
//
//scp-blank.png
//文字已加密
//
//虽然很迷惘，但我们可以确定的是——这段文字运用了两段加密工具，分别是“凯撒密码”和“栅栏密码”。意思是：
//
//我伟大的埃亚拓提斯，您的子民永远都忠诚与您，所有的物品都为您而造。
//My great Ayatotis, your people will always be loyal to you, and all things are made for you.
// 
//阿萨啦阿西莫呀欧拉，降世吧，我们的神明！埃亚拓提亚！
//Asara, Asimo, Ora, come to the world, our gods! Ayatotia!
// 
//我们为您而癫狂，我们为您而献出生命！降世吧！阿萨啦阿西莫呀欧拉！
//We are crazy for you, we give our lives for you! Come to the world! Asara, Asimo, Euler!
// 
//
//附录Ⅱ：[条目不可用]
//下述记录已被加密。
//
//> 请注意，本条目属于机密内容，请确认你持有秘钥
//
//> 终末之诗在黑暗之处默默降临
//
//> 验证完毕，正在打开文件。
//
//附录Ⅱ：Forestar的日记（节选）
//备注：下述文件为已故人士Forestar所撰写，其生前为研究符文的工作人员，在其死前的最后一晚手写写下了下述日记。
//
//当我写下这篇文章的时候，我的精神极度紧张。因为我似乎发现了什么与整个后室都有关的东西，而我周边的世界正在慢慢变成令人发狂的蓝色，蓝色的背景上点缀着无数的代码。一行行的令人发疯，趁着我还没看见那个代表着死亡的东西，赶紧写下这些文字，也希望有人能看见这篇文章。
//
//在两个小时前，我经过无法想象的努力，将所有的文字全部进行了解密工作。所有的线索都串联到了一起，一切后室的起源都能说通了。或许是地球OL的梗已经玩腻了，但我从来没感觉到后室也可以变成这样——也许这样很好笑，如果用这种点子写一篇文章，似乎也很老派了。但这一切都这么发生了，也很疯狂。我所分析的所有符文就都写到这里了：
//
//一位最古老的神明降临在后室中——而那位古神就是埃亚拓提斯，是所有生命的古神，创造了整个后室和所有生命。当然，整个后室如此之庞大也不至于是埃亚拓提斯一人所造，更多的神明还隐藏在不为人知的角落中缓慢蠕动。埃亚拓提斯创造了生命法则，而一切都是弱肉强食、实体与人类之间的互相残杀。但埃亚拓提斯的创造手法十分不同。在时间之前的时间里，神明们已经创造了不可名状的都市。那里拥有无数的科技，而造出后室的手法更是令人无法想象。
//
//Level C-465，一个最不可名状的地方。它是埃亚拓提斯第一个创造的地方，在这里，它实验了大部分的实体。但那些实体也是用它那死亡的方式所创造的，在实验后，便它们无情地抛弃到这里。你也要知道，洞穴中的事件就很像是电脑出现了问题——当然，它们并不是像前哨站所说的那样是正常现象。M.E.G.只是想隐藏所有的信息罢了，他们不想让人知道那些古神的秘密，因为那样会引起一阵躁动。
//
//当在我按下那该死的回车键时，我看见了那足以令我疯狂至极的单词。作为一名程序员，我自然知道那是什么，也知道那对Level C-465乃至于整个后室意味着什么。令我发狂的几个单词代表着后室的终结与毁灭，那些单词足以让人的精神和思想走向通向疯狂的乌木大门，一切也必将终结。在我破解了最初所收集到的资料时，我发现那位上古的神明说出的第一句话是：Hello,World.
//
//> 文件已结束，请继续指示。
//
//> 退出
//
//> 退出成功，记得活下去，欢迎下次登陆。
//
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1465{}