//Level C-480
//评分: 
//+15
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//Level C-480 是后室 C 层群的第 480 层
//
//Village
//描述：
//Level C-480 是一片坐落于山脊上的村庄。村庄中的建筑沿着山脊分布，大多破旧不堪，无法居住。村庄周围是连绵不绝的群山，目前未发现有其他文明痕迹。
//
//Level C-480 中所有光线呈现白色和棕色混合的复古风格颜色。偶尔会有环境亮度突发性降低或抬高的现象发生，这种现象会导致环境亮度变化 10~100lux，并在短时间内迅速恢复至原来的环境亮度。
//
//Level C-480 存在较为正常的昼夜变化，天空中可以观察到天体。平均气温为3℃（37.4℉），氧气稀薄，淡水稀缺，目前已经放弃 Level C-480 的宜居改造计划，转为对 Level C-480 进行探索。
//
//基地、前哨与社区
//M.E.G.480C 号前哨站
//修复了部分房屋作为前哨站站点使用。
//主要工作是对 Level C-480 进行探索。
//配置有一队 14 人的探险队。
//入口与出口
//入口
//从 Level C-67 破败的木门会随机进入 Level C-480 北部建筑群中任意房屋。
//出口
//沿着 Level C-480 村庄中北边的公路行走会进入 Level 118。
// 
// 
// 
// 
// 
//
//以上文档版本记录时间（2021.2.23）
//检测到新上传资料，点此查看上传资料
//
//补充材料
//
//
//- 资料：事故记录
// 
//
//时间：2021.4.20
//
//事件描述：M.E.G. 未收到 Level C-480 应当发送的汇报，随后 M.E.G. 立即派遣了行动队前往 Level C-480。据行动队报告，M.E.G.480C 号前哨站站点联络人员和所有设备全部失踪。
//
//时间：2021.4.23
//
//报告内容：行动队对 Level C-480 内的共 89 栋房屋进行排查，未发现任何失踪人员和设备。据检查，M.E.G.480C 号前哨站所在站点似乎遭受到破坏，表现出破旧不堪，无法居住的特点。原定于 2021.4.22 返回的探险队未返回。
//
//鉴于行动队对 Level C-480 探索无果，将立刻返回，以避免意外情况发生。
//
// 
// 
//
//- 关于 Level C-480 生存难度调整及后续行动
// 
//
//M.E.G. 通知
//根据已知资料，现决定将 Level C-480 的等级调整至审议级，并对外进行封锁，
//直至完全掌握 Level C-480 的资料为止。
//
// 
//
//生存难度：
// 
// 
// 
//关于 Level C-480 的后续行动，将做以下变动：
//1、修复损坏的前哨站站点，并将其转为无人自动站点。站点状态汇报时间将从 1 周 1 次改为 1 小时 1 次。
//2、探索队伍从 1 只 12 人队伍修改为 4 只 5 人队伍。每只队伍将携带 Wi-Fi 发射器以随时定位。
// 
//以上。
//
// 
// 
//
//- 资料：第二次事故记录
// 
//
//时间：2021.6.20
//
//事件描述：Level 11 标准时间 18:04:07 时，M.E.G. 突然失去和 Level C-XXX 的联系，4 只探索小队丢失位置。随后 M.E.G. 立即派遣了行动队前往 Level C-480。据行动队报告，M.E.G.480C 号前哨站自动站点所有设备全部消失。
// 
//此前，探险小队和前哨站均没有异常警报。
//
//关于 Level C-480 的后续行动，将暂停所有探索活动。
//
//以上。
//
// 
// 
//
//- 资料：实验记录
// 
//
//我在查看 Level C-480 中的录像记录时发现了一个情况：位于南部建筑群的 2 号房屋有倒塌现象。
//
//我分别检查了两次事故前后的站点监控记录，发现 2 号房屋在 2021.4.18 8:13AM 时倒塌，而该房屋在第一次事故发生后恢复原状，并在 2021.6.18 8:13AM 再次倒塌。
//
//我请求恢复 Level C-480 的前哨站站点进行监控，并着重检查 2021.8.18 的监控录像。
//
//
// 
//请求批准。
//
//
// 
//视频记录
//
//日期：2021.8.18
//笔记：两个监控设备安装到位，位于前哨站站点的 1 号监控自动运行，位于南部建筑群 3 号房屋的 2 号监控持续监测 2 号房屋。
//
//[1 号监控视频内容]
//8:00:00AM：开始录像，此时监控朝向东面。
//8:12:54AM：出现碎石滚落的声音，监控检测到声音，向右旋转。
//8:12:57AM：监控旋转到位，观察到 2 号房屋正在倒塌。
//8:13:14AM：2 号房屋完全倒塌。
// 
//[2 号监控视频内容]
//8:00:00AM：开始录像，此时监控朝向 2 号房屋。
//8:12:52AM：2 号房屋开始倒塌。
//8:13:14AM：2 号房屋完全倒塌。
//
//
// 
//实验标题	对 Level C-480 内特性的研究
//实验时间	2021.8.20
//实验准备	在南部建筑群西面搭建临时房屋，并在前哨站站点安装自动监控。
//实验结果	Level 11 时间 18:04:07 时，Level C-480 失联。经行动队检查，确定临时房屋消失，前哨站站点所有设备消失，站点所在房屋恢复成破旧不堪，无法居住的样子。南部建筑群 2 号房屋恢复原样。
// 
//
//Level C-480 时间循环孤岛现象说明
//
//Level C-480 中的时间线表现出和外界时间完全独立，自我循环的特点。Level C-480 中时间循环的开始时间和结束时间之间的时间长度为 61 天。当 Level C-480 中的时间抵达结束时间时，Level C-480 内所有物体的状态会立刻恢复至开始时间时的状态，这种现象被命名为“重置”
// 
//由于“重置”的特性，任何在开始时间后进入层级的物体或实体在“重置”时会彻底消失，因为它们在开始时间时不属于 Level C-480 内。另一方面，在开始时间后拿出的物体则不会随着“重置”消失，并且“重置”之后，该物体还会在 Level C-480 内再出现一份。
//
//应当在 Level C-480 继续进行考察，以发现潜在的有价值资源。
//
// 
// 
//
//- 资料：探索队报告
// 
//
//时间：2021.11.17
//
//事件描述：3 号探索队称在东向南 17° 方向据前哨站 1200km 位置发现一间小型摄影棚。为防止未知危险，探险队未进入摄影棚，目前已派遣行动队前往摄影棚。
//
//以上文档版本记录时间（2021.11.17）
//检测到新层级文档：版本 2021.12.01，点此查看新文档
//
//Level C-480
//评分: 
//+15
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//Level C-480 是后室 C 层群的第 480 层
//
//描述：
//
//Level C-480 是一间 10m×10m 的小型摄影棚。摄影棚内安装一台固定位置的老式电影播放机。摄影棚西侧墙上装有荧幕，东侧是大门，没有窗户，天花板安装有自动灯。摄影棚里摆放了大量的胶卷，胶卷上写有编号和胶卷名称，绝大多数已经损坏。
//Level C-480 的特性根据老式电影放映机的状态变化：当老式电影放映机关闭时，自动灯打开，大门无法打开；当老式电影放映机启动并播放胶带时，自动灯关闭，此时可以从大门离开摄影棚。
//
//摄影棚外的空间取决于老式电影放映机播放的胶片内容，该空间的时间完全独立于摄影棚，且存在某种特殊现象。这种现象被称为 “时间循环孤岛现象”。
//
//时间循环孤岛现象说明
//
//存在时间循环孤岛现象的空间（以下称为循环空间），其时间表现出和其他空间时间完全独立，自我循环的特点。循环空间存在某种自我记忆性：循环空间会记忆开始时刻时空间内所有物体的属性。当循环空间内的事件抵达结束时刻，循环空间内的所有物体将立刻恢复至开始时刻时的状态，该事件被命名为 “记忆重置”。
// 
//“记忆重置” 事件的特点可分为两种情况：
//1、外来物体进入循环空间
//由于外来物体在开始时刻并不存在，因此该物体不会被循环空间 “记忆”，当循环空间内发生 “记忆重置” 时，该物体将会消失。
//2、循环空间内物体离开
//如果被循环空间 “记忆” 的物体离开循环空间，当循环空间内发生 “记忆重置” 时，该物体会再次出现在循环空间内，此时可认为该物体被 “复制”。
//
//在摄影棚中发现的所有可播放的胶卷全部具有时间循环孤岛现象。
// 
// 
// 
//
//4 号胶卷 “村庄”
//
//Village
//我醉君复乐，陶然共忘机
// 
//该时间线长度为 61 天，其内容为一片坐落于山脊上的村庄。
//村庄中的建筑沿着山脊分布，大多破旧不堪，无法居住。
//村庄周围是连绵不绝的群山，目前未发现有其他文明痕迹。
// 
//13 号胶卷 “工厂”
//
//Factory
//国有沃野之饶而民不足于食者，器械不备
// 
//该时间线长度为 23 小时，其内容为一座废弃的工厂厂房。
//厂房内仅有少量损坏的小型设备。
//这些设备已确定损坏至无法辨认是何种设备的程度。
// 
//29 号胶卷 “学校”
//
//Classroom
//以有涯随无涯，殆已
// 
//该时间线长度为 45 分钟，其内容为一间教室。
//放映设备损坏，所有书籍字迹无法辨认。
// 
//56 号胶卷 “纸牌”
//
//Card
//成为狩猎者，或者成为猎物
// 
//该时间线长度为 12 分钟，其内容为 10 张堆叠的水泥制卡片雕像。
//无论用何种方法触碰，都将导致雕像朝触碰者的方向倒塌。
// 
//89 号胶卷 “秋千”
//
//Playground
//他们懂得从生活中，寻找那一星半点闪烁着的情趣，
//他们就不会觉得困苦和孤独。
// 
//该时间线长度为 128 天，其内容为空地上的秋千。
//无论朝哪个方向前进多远距离，最后都会发现自己在原地踏步。
// 
//123 号胶卷 “森林”
//
//Forest
//水积鱼聚，木茂鸟集
// 
//该时间线长度为 7 天，其内容为被严重破坏的树林。
//这片树林的面积似乎是无限的。
// 
//162 号胶卷 “红色太阳”
//
//Nuclear
//好战必亡
// 
//该时间线长度未知，其内容为巨大的红色太阳。
//目前未发现任何植被，动物，文明的痕迹。
//环境温度随着时间持续提高，没有停止的迹象。
// 
//199 号胶卷 “鸟鸣”
//
//Jail
//墨写的谎说，决掩不住血写的事实。
// 
//我已经被这些畜生抓到了，我没有足够的时间和你说明情况
//所有的胶卷都已经被藏到了▇▇▇▇▇
//
//反 I.W.D 行动终将胜利！
//
//J.Smith
//
// 
//
// 
// 
// 
//
//基地、前哨与社区
//M.E.G.480C 号研究站点
//该站点被建立以对 Level C-480 中的胶卷进行探索，并尝试修复其他损坏的胶卷。
//配备有 16 人的探索队。
//入口与出口
//入口
//由于不同胶卷各自独立，因此作以下表格说明。
//胶卷编号	入口
//摄影棚	在 Level 11 寻找一间摄影棚并对大门切入将进入 Level C-480
//4	从 Level C-67 破败的木门会随机进入北部建筑群中任意房屋。
//13	进入 Level 172 中仓库有概率进入废弃厂房。
//29	找到 Level 190 中最低处的教室切入会进入 “学校”。
//56	“纸牌” 没有入口。
//89	离开 Level C-199 有概率进入 “秋千”。
//123	“森林” 没有入口。
//162	“红色太阳” 没有入口。
//199	从 Level C-107 切出会进入 “鸟鸣”。
//以上入口除摄影棚外均需要对应胶卷正在播放才能使用。
//
//出口
//由于不同胶卷存在各自独立的出口，因此作以下表格说明。
//胶卷编号	出口
//摄影棚	
//4	沿着 Level C-480 村庄中北边的公路行走会进入 Level 118。
//13	从厂房大门离开会返回 Level 172。
//29	对教室大门切入会进入 Level C-110。
//56	“纸牌” 没有出口。
//89	“秋千” 没有出口。
//123	对树木切出会进入 Level C-37。
//162	“红色太阳” 没有出口。
//199	“鸟鸣” 没有出口。
//以上出口除摄影棚外均需要对应胶卷正在播放才能使用。
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1480{}