//Level C-498
//评分: 
//+16
//+
//–
//X
//⚠️ 须 知 ⚠️
//
//此版本文档内容已不适用，并已被归档，该层级资料于2021年5月10日更新，点击此处查看最新版本的文档。
//
// 
//
//生存难度：
// 
// 
// 
//Level C-498是后室C层群的第498层。
//
//描述
//2003860388a49c87.jpg
//无人机所拍摄的城市图像
//
//Level C-498是一座面积约为6200平方公里的古典科技城市，其拥有全面覆盖的网络和较全的交通枢纽，但城市里不存在任何车辆与船只。该城市的原住民均为人造机械人，人口约为90万，总体分为平民和军队两大类。城市中心有一高塔，内部空间设置有全方位扫描红外线，其为城市正常运作提供能量，能源探究已被禁止。
//
//相比前厅，该城市所拥有的科技水平远超当前社会，但原住民仍保持着二十世纪末期的生活方式。于军事方面，仅在武器科技上超前，多数为电磁能动武器和纳米武器。
//
//值得注意的是，Level C-498不存在任何餐厅和食品加工厂，不具有任何食物供应（包括后室中人类可食用的物品），水在该层级也非常稀缺，因此建议流浪者携带足够的食物和水。
//
//该城市不存在任何法律法规和政府，城市管理权由机械人制造者忒吉拉•曼森掌握。机械平民均是根据指令程序进行日循环“生活”，平民与流浪者的互动仅在打招呼层面。军队则是分散式驻守于街道交叉口，机械兵均手持着电磁动能枪械，在指令动作触发前完全处于休眠状态，指令动作包括下列项:
//
//平民或军队遭到人为伤害。
//军队武器被窃取。
//高塔红外警报被触发。
//通常情况下，被激活的军队会抓捕指令触发者，并将其交由忒吉拉•曼森处理；严重情况下，指令触发者会被直接击毙。
//
//忒吉拉•曼森对人类持较为友好的态度，并允许人类在该层级居住或建立非军事基地，但不会主动保护受难流浪者，因此建议流浪者寻找人类聚集地。
//
//基地、前哨与社区
//探险者总署（Major Explorer Group） - “科技前线”前哨站
//大约有400名特工和50名研究人员常驻，研究人员大多来自M.E.G部门“测验者”。
//会为流浪者提供食物和帮助，暂不开放贸易。
//在达成协议后，与忒吉拉•曼森合作研发科技产品（除了武器），但大多数产品仍处于试用阶段。
//流浪者社区
//拥有大约4000人，其聚集地在城市东南边。
//食物来源多数依靠M.E.G“科技前线”前哨站。
//机械狂热者
//其人员表现出对机械器物的过度狂热，且存在一定的组织体系，被推测其成员来自同一个已存在团体。人数未知。
//对非己方团体的人类抱有极大敌意，不建议靠近。
//数次试图盗取M.E.G前哨站未研发完成的科技产品和高塔能源。
//入口与出口
//入口
//通过后室地铁可到达该层级随机的地铁站。
//在探索Level C-390一定时间后有极低概率到达该层级城市高塔附近。
//出口
//在距城市边境约500米处，用水泼洒在任意电器上，将会回到原层级或前往下一层级。
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1498{}