//Level C-425
//评分: 
//+23
//+
//–
//X
//
//点击此处以登记您的访问信息
//
//
// 
// 
//
//生存难度：
//等级 0
//
//安全
//稳定
//旋律鼓动photo-1511512578047-dfb367046420?ixlib=rb-1.2.1&dl=carl-raw-m3hn2Kn5Bns-unsplash.jpg&q=80&fmt=jpg&crop=entropy&cs=tinysrgb
//街机厅的照片。
//
//Level C-425是后室C层群的第425层。
//
//描述
//Level C-425是由无限个非欧几里房间而组成的空间，该层的中心区域为一个充满了赛博朋克风格的街机厅，街机厅内有冷气与Wi-Fi，有时可以见到正在玩街机游戏的无面灵。后室娱乐的员工也会出现在这里，他们的工作是服务来到这里的流浪者和其他的无面灵，流浪者可以从这些人手上买到游戏币，也可以询问他们如何离开。
//
//街机厅的正中央摆放着一个控制台，流浪者可以用此切换主大厅所正在播放的音乐，初步估计歌单里有上亿首音乐类型不同的曲目，大部分曲目的名字都由随机的符号与数字组成，但听起来与前厅中的其他音乐别无两样。上文所提到的房间随机的分布在连接的大厅走廊中，每一种房间都代表着一种音乐类型。目前M.E.G.正在对该层进行全面的探索，但这些房间似乎是无限的，且该层级似乎正在不断地生成着一个又一个新的房间，各种物资会随机在其中生成，包括但不限于:
//
//瓶装杏仁水(多)
//皇家口粮(少)
//MP3（多）
//头戴式耳机(常见)
//目前M.E.G.经过数据分析，已发现这些房间与该层级的主区域有着巨大的差异，每个房间的生存难度, 基地，前哨与社区列表和入口/出口列表 均有不同。每个房间外均有标有此房间对应的音乐类型，以告知流浪者房间内的地形以及可能需要避开的地方。目前M.E.G.已收录了七种音乐类型的房间，将在下方列出：
//
//"Dubstep"
//"Future Bounce"
//"Future Bass"
//"City Pop"
//"Vaporwave"
//"Complextro"
//“Trance”
//房间1 - "Future Bounce"
//21:34_01-11_正在预览_最新版本...
// 
//
//生存难度：
//等级 Zeta
//
//可能安全
//可能稳定
//待定的实体记录photo-1588007374946-c79543903e8a?ixlib=rb-1.2.1&dl=mikita-yo--OCFdBaFcGk-unsplash.jpg&q=80&fmt=jpg&crop=entropy&cs=tinysrgb
//在房间1内所拍摄的图片。
//
//"Future Bounce"房间是该层级中最常见的房间，基本上是当流浪者在走廊中探索时第一个发现的便是此房间。
//
//房间结构
//大多数"Future Bounce"类型的房间的面积都为120平方米，其内部违反任何已知的物理定律，具体表现为该房间内四处漂浮着蓝色的霓虹灯管与一些由英文单词组成的灯牌，这些霓虹灯也是房间1内唯一的光亮来源，触碰它们不会对流浪者造成任何影响。房间内部循环播放着Future Bounce类型的音乐，目前M.E.G.暂未发现这些声音从何处发出。房间内的音乐不同于正常的Future Bounce，其被经过特殊加工，lead音色异常突出、更有冲击力，旋律总体的编排更富有弹性，会使人逐渐陷入癫狂状态，最终力竭而死，死后会融入地面。该症状可以服用杏仁水减轻。音量大小由流浪者本人的心情决定，气温也随着音乐节拍强度升降。目前已知播放的曲目有由Jay Eskar,Dirty Plam,Ookay,Marshmello,Dropgun等音乐人创作的专辑。
//
//实体
//有两份报告称在房间1内部发现了一个笑魇，但这些报告仍未得到证实。建议M.E.G.特工人员将任何确认的目击事件通知其指挥官。目前还没有证实其他实体存在。
//基地，前哨与社区
//FutureBoys
//FutureBoys是一个由7名左右的流浪者组成的团体，他们以自己热爱Future Bounce类型的音乐的理由拒绝离开房间1。
//除非受到挑衅，否则他们完全被动。
//该团体可以在房间1内的一处空地上找到，最为标志性的是在他们在房间内搭的写有Come To Listen the GREATEST MUSIC TYPE IN THE WORD! 的大帐篷。
//该团体没有明确的领导者，自发组织。
//入口和出口
//入口
//可以在走廊中找到该房间。
//出口
//沿着房间1内一个箭头灯牌的路径继续前进，就能到达房间2。
//如果你试图长时间带上耳机来隔绝Future Bounce的音乐声，你会来到Level C- 161
//原路返回，即可回到走廊。
//房间2 - "Future Bass"
//21:34_01-11_正在预览_最新版本...
// 
//
//生存难度：
//等级 Beta
//
//安全
//较为稳定
//无实体photo-1588007375246-3ee823ef4851?ixlib=rb-1.2.1&dl=mikita-yo-IO_CWfjXM7U-unsplash.jpg&q=80&fmt=jpg&crop=entropy&cs=tinysrgb
//在房间2内所拍摄的图片。
//
//"Future Bass"房间是该层级中第二常见的房间，通常紧挨着"Future Bounce"房间，只有极少数的情况下流浪者才能遇到单独的"Future Bass"房间
//
//房间结构
//该房间的内饰与"Future Bounce"房间大致相同，但空间却比它大得多。不过其同样违反任何已知的物理定律，同样也四处漂浮着霓虹灯管与一些由英文单词组成的灯牌，但该房间内的霓虹灯可以变化不同的颜色。
//
//房间内部循环播放着Future Bass类型的音乐，不过该房间内的音乐未经过任何的加工处理，不会对流浪者造成任何的影响。M.E.G.中的一个专业人士推测可能是因为Future Bounce是Future Bass类型的一个分支，所以房间2中有着更为广阔的空间大小与与房间1中更多不同的内饰。
//
//实体
//暂未发现任何实体。
//
//基地，前哨与社区
//CyberBoys
//CyeberBoys是一个由8名左右的流浪者组成的团体，他们似乎与FutureBoys团体敌对。
//经常与FutureBoys团体进行漫长的争论。
//入口和出口
//入口
//可以在走廊中找到该房间。
//也可以从房间1内直接进入，因为大多数情况下它们都是相连的。
//出口
//可以在墙上找到一扇门，打开后就可以回到走廊。
//按照进来房间2的路线原路返回。
//房间3 - "VaporWave"
//21:34_01-11_正在预览_最新版本...
// 
//
//生存难度：
//等级 4
//
//不安全
//不稳定
//实体伪装photo-1599975784114-e24d1056c34f?ixlib=rb-1.2.1&dl=solen-feyissa-d-LOKwsv79E-unsplash.jpg&q=80&fmt=jpg&crop=entropy&cs=tinysrgb
//在房间3内所拍摄的图片，图片遭到了一定程度的破坏，无法显示出描述中的颜色。
//
//"VaporWave"房间常常出现在走廊的拐角处，其上面写着"Come with me and back to the 90s'"的英文，流浪者一旦靠近就会有一种强烈的怀旧感涌上心头。
//
//房间结构
//该房间的墙壁四周有着暧昧又温暖的粉紫粉黄色以及粉蓝色，充满了上世纪80-90年代的怀旧元素，凭空出现低保真，故障的电视机画面，空中随机不断出现重复的对话框与象征放飞与自由的棕榈树，同时在房间的各个角落摆放着古希腊时期的人物雕像。在一片光波斑驳中，流浪者会很快的陷入幻境。一旦陷入幻境后将会被此房间吞噬，流浪者必须饮用大量的杏仁水来抵消这种影响。
//
//实体
//雕像
//该实体常常伪装成Vapor Wave类型音乐风格中不可缺少的希腊时期雕像，它们将会缓慢的移动来接近流浪者，并在接触他们后被其石化，成为新的"雕像"，它们通常有着完好的肢体，流浪者可以以此辨别它们是否为正常的雕塑。
//
//基地，前哨与社区
//由于该房间的特殊性，无法建立任何的基地，前哨与社区。
//
//入口和出口
//入口
//可以在走廊中找到该房间。
//切入一台街机厅中写着"Hazy 90s'"的像素风格赛车游戏就可以直接进入此房间，前提是没有无面灵正在游玩。
//出口
//暂未发现任何的出口。
//房间4 - "City Pop"
//21:34_01-11_正在预览_最新版本...
// 
//
//生存难度：
//等级 0
//
//安全
//稳定
//大量无危胁实体photo-1540959733332-eab4deabeeaf?ixlib=rb-1.2.1&dl=jezael-melgoza-layMbSJ3YOE-unsplash.jpg&q=80&fmt=jpg&crop=entropy&cs=tinysrgb
//在房间4内所拍摄的图片。
//
//"City Pop"房间是该层级中最不常见的房间，其似乎在整个Level C-425中只存在一间，入口位置位于一条走廊的天花板上。
//
//房间结构
//当流浪者在爬上天花板后，会发现自己正位于一条乡间道路上，远处是灯光闪烁的都市，朝着都市方向走10公里，会逐渐听到喧哗的街道声，渐渐地，流浪者就会到达名为京都区的区域。
//
//京都区具有电子合成器风格的外观。其主要部分是一片面积约为1000平方米的规模巨大的繁华商业区，充满了日系元素。商业区中灯火斑斓，车水马龙。悬挂在各种房子上的广告牌，头顶呼啸而过的单轨列车，空中飘零的樱花花瓣，随处可见的被霓虹灯所包裹的商铺，让流浪者很难怀疑自己是否来到前厅。其京都区内的居民均为无面灵，都受Level 11效应的影响。
//
//流浪者在寻找到出口之前可以选择短暂的居住在这里，这里有着同前厅一致的货币系统，流浪者不仅可以使用杏仁水还可以用前厅中的货币交换物资。
//
//值得一提的是，该层级的上空一直播放着日本女歌手松原美纪的《Stay With Me》，层级内的时间也永远停留在了星光闪烁的夜晚。
//
//实体
//只有受到Level 11效应的无面灵与猎犬，流浪者无需担心。
//
//基地，前哨与社区
//霓虹午夜
//一个大型贸易团体。
//愿意接受来到这的流浪者。
//可进行交易。
//入口和出口
//入口
//位于一个在走廊天花板上写着"Lunatic Night"的门，需要梯子辅助才能进入。
//出口
//可以在一家街机厅中找到一扇门，打开后就可以回到走廊。
//在里面居住满100天就会直接传送到Level 11。
//切入京都区郊区的铁路就可以来到日本铁路。
//在一座环形的传统町屋中睡上一觉，醒来后即可来到Level178。
//房间5 - "Dubstep"
//21:34_01-11_正在预览_最新版本...
// 
//
//生存难度：
//危险环境
//极不宜居
//温度骤变photo-1511447333015-45b65e60f6d5?ixlib=rb-1.2.1&dl=sandro-katalina-k1bO_VTiZSs-unsplash.jpg&q=80&fmt=jpg&crop=entropy&cs=tinysrgb
//在房间5内所拍摄的图片。
//
//"Dubstep"房间是该层级中最危险的房间，其房间的门有时会伪装成其他房间类型的入口，唯一能辨别的方法是靠近门口倾听是否有Dubstep的音乐声。M.E.G.在此警告任何流浪者绝对不要进入，目前已派遣人员封锁任何'Dubstep'房间的入口，但其入口的数量正在极速增长，具体原因未知。
//
//房间结构
//当流浪者刚开始进入此房间时，房间内会是如死寂般的黑暗，出现在流浪者面前的只有一个写着"No Music No Life"的牌子。
//
//5分钟后，房间会突然亮起紫色的灯光，流浪者会发现自己处在一个由三角形构成的铁笼之中，铁笼的空间无限延伸，其绑在上面的霓虹灯会发出刺眼的紫光，随后该房间内将会放出可令人耳膜破裂的Dubstep类型音乐，霓虹灯灯光的闪烁频率跟着音乐节奏不断加快，室内温度在-215至123摄氏度内不断的升降，流浪者脚下的铁笼也会随机变化成不同的形状，并在最终使流浪者挤压身亡。
//
//实体
//无任何实体。
//
//基地，前哨与社区
//由于该层级的特殊性，无法建立任何的基地。
//
//入口和出口
//入口
//位于走廊中一个散发着紫光的门，靠近它便会听到节奏极快的Dubstep音乐。
//出口
//暂未发现任何的出口
//房间6 - "Complextro"
//21:34_01-11_正在预览_最新版本...
//⚠️信息警告⚠️
//
//关于 "房间6"的信息仍可能更改，且尚未敲定，并且仅由于未知的一方未经许可提前发布了这些信息，因而公开。以下文章中出现的部分细节已证实。但多数仍为未知流浪者的断言。
//
//因此，我们要求流浪者审慎对待这些信息。
//
// 
//
//生存难度：
//等级 待定 [无人区]
//
//极不稳定
//神秘属性
//未知信息
//"Complextro"是level C-425中较为危险且最难到达的房间，它的存在仍仅仅是基于所谓的目击者访谈，而仍未明确证实。该房间存在的主要证据是一张流浪者拍摄的疑似是该房间的照片与一张纸条。
//
//photo-1632931612869-c1a971a02da4?ixlib=rb-1.2.1&dl=guerrillabuzz-crypto-pr-t3er3YHx768-unsplash.jpg&q=80&fmt=jpg&crop=entropy&cs=tinysrgb
//疑似是房间6中的照片，图片已经过特殊处理。
//
//根据未经证实的报告，人们推测，在这个区域内无法使用任何除相机以外的电子设备，包括手电筒、夜视镜，甚至化学灯。
//
//房间结构
//由于缺乏关于的资料，因此无法确定该房间的空间结构。唯一已知的是本房间在不断的进行变化，且本房间中的地形不存在倾斜或下降，只有无尽的扭曲。
//
//下面这张纸条是在街机厅中被发现的。递送纸条与写纸条的人不明。该纸条转录如下。
//
//（前面的字迹已被擦去）…..我为了探索新的房间，却差点死在里面，按理来说Level C-475中的房间对应着每一种音乐类型，那么我发现的这个房间便一定对应着"Complextro"，里面的环境正如它的名字一样，怎么形容….嗯，很乱也很复杂。
//
//它的入口好像是是凭空出现在我的眼前的，门上没有什么东西，我推开进去后门就被关上了。
//
//刚开始进去的时候我还以为进到了"Dubstep"房间，一片漆黑，我连手电筒都打不开，然后我（字迹被擦去）
//
//（字迹被擦去）……10分钟后，我发现了一个正在被扭曲的隧道，里面全都是我没见过的东西，有（字迹被擦去）…….如果你不小心误入了这个房间，你唯一要做的事就是保持前行。我不知道怎么说，因为我可以感受到周围的环境正在变化，有几次我差空摔倒了地上。但是我用双手却没摸到任何东西…….（字迹被擦去）…….好像有什么东西注视着我。我看不到也听不到它，如此等等。你几乎能感觉到它就在你身边的那种氛围。
//
//我不知道它是什么，可能是笑魇，可能是其他的实体，但是它好像没有伤害我。
//
//我好像看到它了，它（字迹被涂抹)。
//
//我被吓到了，开始狂奔起来，无论中途我摔倒了多少次，我都没有回头过。
//
//拜托，我希望有人能看到我的纸条，我好像出不去了，但是我敢肯定我还活着。
//
//应该吧。
//
//由于Complextro房间尚未证实是否真正存在，所以说明中提到的任何内容和上面提到的所有威胁均无法得到证实。
//
//实体
//未知。
//
//基地，前哨与社区
//尚未发现或核实任何基地、前哨或社区。
//
//入口和出口
//入口
//由于该房间本身尚未得到证实，目前还没有被发现有任何的入口。
//
//出口
//尚未证实该房间有出口。
//
//房间7 - "Trance"
//21:34_01-11_正在预览_最新版本...
// 
//
//生存难度：
//等级 1
//
//安全
//稳定
//致幻photo-1586509974981-e76c86a6aaec?ixlib=rb-1.2.1&dl=sebastian-fons-v6_s0wNB5ZY-unsplash.jpg&q=80&fmt=jpg&crop=entropy&cs=tinysrgb
//在房间7内所拍摄的图片。
//
//"Trance"房间是Level C-425中较为安全的一层。
//
//房间结构
//"Trance"房间以其为一条长约2500米的地下自动扶梯的结构而出名，其扶梯在不断地运行着。整个的地下通道充满了诡诞地蓝色灯光，在这一房间中，流浪者将听到整个扶梯都循环播放由BT创作的《Godspeed》，目前M.E.G.已证实该音乐具有催眠性的旋律与较长的音乐递进，使得流浪者很容易在该房间内沉睡过去，目前最好的办法除了喝下杏仁水提神以外还可以佩戴在该层内找到的耳机来隔绝此音乐的影响，但由于该扶梯长度过长，许多进入到这的流浪者都自愿沉睡过去。顺带一提，流浪者苏醒过后便会直接来到该扶梯的终点，表现为一个地铁站，其旁边还有一个电梯，流浪者可选择其中一个离开。
//
//当流浪者在搭乘扶梯的过程中，会常常发现一些漂浮在空中的淡蓝色轻雾，吸入它们会导致流浪者产生幻觉，在该期间内流浪者将不会对外界做出任何反应，并同样会在扶梯终点苏醒过来，但如果在此过程中被他人打扰便会陷入狂暴状态，攻击其他的流浪者。目前有效抵御此迷雾的方法则是捂住口鼻避免吸入或者服用杏仁水。
//
//实体
//无任何实体。
//
//基地，前哨与社区
//由于该层级的特殊性，无法建立任何的基地。
//
//入口和出口
//入口
//位于走廊中一个散发着蓝光的门，其上面将会用斜体写着“trance”，同时门缝中将会飘出淡淡的云雾。
//出口
//在终点选择搭乘电梯，会来到Level C-486。
//在终点选择搭乘地铁，可以来到Level 158.
//21:34_01-11_正在预览_最新版本...
//该房间的具体入口未知，其门上写着"惊喜！"二字，只能通过切入进入，流浪者进入后会发现LED屏幕贴满了四周的墙壁，并在1分钟后房间内会播放Rick Astley的《Never Gonna Give You Up》，且四周的LED屏幕会纷纷出现《Never Gonna Give You Up》音乐MV中Rick Astley跳舞的画面。在MV结束后流浪者将被未知力量扔出房间，原现的入口也会消失，并随机出现在走廊中的别处。
//
//21:34_01-11_正在预览_最新版本...
//该房间的入口是一扇画着彩虹的门，同样也需要流浪者通过切入这扇门进入。
//
//该房间由一整块无限大的草莓味甜饼组成，其房间上空有着像素化的星星与彩虹，天空中有时会出现一只喷射着彩虹且身体为草莓甜饼的猫飞过。其被称为Nyan Cat。当它经过时整个房间都会发出音量大小被调整过的《Nyan Cat》这首歌，经过测量此曲音量已超过120分贝。
//
//唯一离开此房间的方法只有抓住这只飞速飞行的猫，抓住后就可以来到Level C-5.
//
//基地、前哨与社区
//后室娱乐公司·律动音符基地
//人数未知。
//开放交易。
//位于街机厅中。
//为意外来到这里的流浪者提供服务与离开帮助。
//入口与出口
//入口
//在Level 11中进入一家街机厅，即可来到这里。
//进入Level C-70日落都市中的一家街机厅同样也可以来到这里。
//出口
//切入街机厅中的地面或者墙壁，你会进入Level C- 242。
//进入Level C-425后选择直接转身离开，你会来到Level C- 460。
//如果你试图长时间带上耳机来隔绝街机厅的音乐声，你会来到Level C- 161。
//向后室娱乐公司的员工寻求帮助，它们会通过一扇门把你带去Level C-140。
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1425{}