//Level C-449
//评分: 
//+17
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
//安全且稳定
//实体绝迹
//时间切片
//Level C-449是后室C层群的第449层，其为一个单人层级，且以独特的“时间切片”现象著称。流浪者无法与其中的场景互动。
//
//描述
//气候
//Level C-449气候适宜，空气湿度较高，据分析其环境类似于前厅亚热带夏季，常年维持在27摄氏度左右。
//
//环境
//IMG_20220726_180713.jpg
//日落路段的Level C-449。图片近景有些许模糊。
//
//Level C-449外观为一座普通的桥梁，根据测量其长度为751.4米，宽25米，有3条直行道及2条分别为左拐和右拐的道路构成，直行道在其他两道之间，在其中试图跳下桥梁的行为会回到桥上。桥梁远处有一定数量的房屋，但由于前文特性无法前往。在其中无法以任何方式向外界传输信息。
//
//桥梁末端连接了陆地以及一个有红绿灯的十字路口。在桥梁末端左侧，可以发现一个用于遮挡施工现场的绿色棚，其上使用中文书写了“共创文明城市”以及“维护城市环境”两种话语。已知该施工现场似乎在扩修桥梁。
//
//同时，在桥梁上可以经常发现各式看似正在行驶却似乎被突然静止1的汽车，以前厅的中国品牌居多，偶尔也有其他国家的品牌。少数情况下也有功能用汽车，如环卫车及警车等。这些汽车是离开该层级的关键。值得注意的是，由于层级属性，如果汽车出现在桥梁末端，流浪者会看到汽车接触末端之处被整齐地切片。
//
//下文会将这样一个桥梁结构称为“路段”。
//
//“时间切片”
//在Level C-449，这种路段被无限地复制并拼接，每一个路段的时间均比前一个路段晚30分钟2，这一点可以从天空明显看出。这一现象也会影响到流浪者切出时的时间。比如：一个流浪者在该层级前行到下一个路段后切出，此时无论流浪者在Level C-449停留多久，切出层级的时间都是流浪者进入Level C-449的30分钟后。注意，进入层级后走向自己身后的路段并且切出，时间不会回转，而是和进入时的时间相同3。
//
//每个路段的场景完全一致，但天空和汽车会不同。天空会随着路段时间改变，汽车则随机出现。在不同时段，汽车的数量明显不同，以下为统计数据。
//
//早高峰时段（约6：40-8：00）：汽车数量多，有时甚至开满整个桥梁。
//正午时段（约11：40-12：30）：汽车数量较多，但比早高峰时段略少。
//晚高峰时段（约5：30-6：40）：汽车数量多，数量介于早高峰以及正午之间。
//夜晚时段（7：00以后）：汽车数量极少，很多时候甚至没有一辆汽车。
//其他时段（上述时段之外时间）：汽车数量一般。
//
//值得提醒的一点是，该层级全部区域的物质看似都是静止的，这使得汽车即使看似正处于发动状态也停留不动。另外，任何流浪者在该层级内都不能改变任何非外来物质的形态，也就是不能与场景互动，但是可以触摸。前文已阐述这一特性。
//
//关于这一点有一个特例，在桥梁上有时能发现瓶装杏仁水，这种杏仁水是可以与流浪者互动的。它们作为该层级主要的补给。
//
//实体
//无任何实体。
//
//基地、前哨与社区
//由于其是单人层级，理论不存在基地、前哨与社区。
//
//入口与出口
//入口
//在任何有跨越大江的现代风格桥梁的层级进行以下行为有几率来到Level C-449：
//
//切入双黄线。
//翻越栏杆并跳入水中。
//切入停留在其上的汽车，注意必须是层级自带的。
//在桥梁末端切入。
//以上行为只能在流浪者刻意为之且知晓该层级时生效。
//出口
//
//切入汽车将到达与车牌号相同的层级。车牌号格式类似“00010”“C0004”等，这三个例子对应Level 10和Level C-4。总体与有类似该层级环境的层级以及层群I、C层群的层级为多。
//几乎任何汽车都不通向隐秘层级。然而，少数情况下会出现负数层级，比如车牌号为“-0001”的通向Level -1。
//隐藏
//关于对Level C-449车辆车牌号的进一步研究
//目前，在该层级发现的车辆均有一个独特的车牌号。这个车牌号通常对应着后室的常规层级，极少数情况下会出现负数层级或者其他情况。对此，我们列了一份清单来展现该成绩的所有车牌号种类。
//
//普通：对应一个基础层级。偶尔会出现是其他层群。这一点层级文档已解释。
//负数：对应一个已知负数层级。这种较为罕见。
//乱码：如“Hx@₤0”。罕见，目前无关于切入这种汽车的记录，因此暂时不建议切入它们，这可能导致不可知的危险。
//疑似派对客陷阱：最近，一名流浪者发现了一辆车牌号为“FUN=)”的车辆，但该流浪者未选择切入之。目前没有证据表明这一种类与派对客的直接关系，但建议忽视。有可能这一种类只是一个恰好的乱码车牌号。所以为什么不来加入我们的派对呢？=)
//更多待研究。以上。
//
//隐藏
//｛采访者：李博士 受访者：流浪者[根据其要求隐藏姓名]}
//[记录开始]
//李博士：所以你是来到了Level C-449，是吗？
//流浪者：是的。
//李博士：那你能描述一下那里吗？
//流浪者：一座桥，无限的被复制和拼接上去，每一座被拼接的桥天空都不大一样，两座桥分界处的天空就像拼图一样……有很多静止的车辆。有时候还能见到杏仁水。人好像不能摸这里的环境……
//李博士：不能什么？
//流浪者：我没有表述对。
//李博士：您是说不能与场景互动吗？
//流浪者：……差不多……也不完全是，杏仁水可以拿起来。
//李博士：好的。您是怎么离开的呢？
//流浪者：就像文档说的那样，切入汽车。
//李博士：您还记得汽车的车牌号吗？
//流浪者：这点我记得很清楚。我知道车牌号和切出的联系。一开始我看到了一辆车牌号是一堆乱码的，我就没管那个，最后切入了一辆车牌号是“00011”的，我就到了Level 11。
//李博士：好的，感谢您的陈述。
//流浪者：等一下，我还有要说的！
//李博士：好。
//流浪者：我当时是向前走了4座桥然后离开的，我在这个地方好像只停留了20分钟左右，手表也没有问题，然而离开之后别的流浪者都跟我说已经过了2个小时！虽然我知道层级属性，但这还是太诡异了。就这样吧，我能说的都说了。
//[记录结束]
//
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1449{}