//Level C-405
//评分: 
//+19
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
// 
//变化结构
// 
//Level C-405是后室C层群的第405层。
//
//或者，你也可以称呼这里“暑梦”。我们商量之后都觉得这个名字不错。
//
//描述
//zVPbxpMSWgj4ucn.jpg
//这是“浅界记忆”中一个已确认稳固的据点，也是我们成员的生活场所。
//
//Level C-405是一个典型的“变化”层级，表现出夏日的气候特点，且不存在昼夜交替。该层级内没有固定的空间结构，只有大致轮廓与框架，而其内填充的建筑则是不确定的。
//
//Level C-405内发生变化的具体规则与观察者密切相关。当一片空间中存在人类观察者时，该空间内的一切事物都将维持稳定；而在观察者离开后，此处区域的空间将陷入非稳定状态，直到下一次观察者进入才会重新稳定。届时，此处区域的空间将恢复原样，或是坍缩为新的景观。
//
//据测试，大部分物品都无法维持空间的稳定。即便它们是从外界带入的，也会在观察者离开时随空间一同陷入不稳定状态，并在下次坍缩时重组或消失。在此值得注意的是，由于某种未知的原因，Object C-2 - “好梦罐”似乎与其他物品不同，可在一定程度上维持周围空间的稳定。
//
//或许我可以说得更简单一些：Level C-405是一场梦境，一场盛夏之梦。
//
//也许你会觉得这么说显得“很玄乎”，但你只要亲身经历过几次就知道了。在“中度睡眠”以后的区域，一切都在变化：只需要两次转身，你就能抵达一个崭新的地点。在这里迷失不是难事，就像你总会在梦里迷路。
//
//在闲暇的时候，我常常会想——这究竟是谁的梦呢？
//
//在多数时候，Level C-405都可以大体上分为四个区域：“浅界记忆”、“中度睡眠”、“深层梦境”与“渊域夜魇”。这四个区域没有明确的界限划分，但是会给人造成完全不同的体验。虽然没有具体的指示，但是流浪者在区域间出入时会感到明显的“错乱感”。
//
//不同区域之间，存在着数个固定的“交界点”。这些特殊的位置不会随层级内空间结构的变化而转移或消失，可以成为稳定穿越层级的锚点。但值得注意的是，在不同“交界点”之间的路途不一定能维持稳定。
//
//在Level C-405的部分区域中，会出现餐馆、售货机等设施；在其中可以获得足够的补给。但这些设施同样会随着空间变动而消失，因而难以找到稳定的补给点。
//
//以下为四个区域的具体介绍：
//
//“浅界记忆”
//Q5dCmoZlP4Fc1jp.jpg
//一个停车位。偶尔你能看到几辆车，但它们都无法启动；更多时候，只能看到几个轮胎。
//
//“浅界记忆”是Level C-405内最稳定的部分。该区域的外在表现通常较为固定：一片由多个老式居民楼构成的街道小区。同时，其内的时间也稳定在正午时分。
//
//“浅界记忆”中几种固定的景观分别为：大理石喷泉、停车区、自行车棚，以及居民楼。这些景观出现的位置与数目并非是不变的，但其“出现”本身却已被确认为是底层逻辑。居民楼较之其他景观往往更加稳定，空间变化效应仅出现在房间布局、楼层数、楼层结构与外观等方面，而大体坐落位置则改变较少。
//
//“浅界记忆”内会随机出现少量好梦罐。在被使用之前，它们通常能维持半径十余米的稳定空间。
//
//作为Level C-405内空间结构最稳固的部分，“浅界记忆”理所当然地成为了M.E.G.在该层级内的落脚点。
//
//那是在多久之前呢？我的时间观念一直不太好，来到这里后就更是这样了。
//
//两年了吧，我猜。
//
//当时我只是跟上级汇报了一下这里的情况，并且按照流程在这里驻守了半个月。我跟他们说，这里有不少好梦罐。上级问我，愿不愿意留下来？我说也不是不行。
//
//好在，这里多少是个温暖、和煦的地方。我从小就很喜欢夏天。
//
//那之后我建立了“清醒梦”前哨站，最开始只有我一个人。收集好梦罐、刷刷论坛、睡觉，也可能去更深处看看风景。后来人逐渐多了起来，我们现在有八个人了。除了收集好梦罐之外，还需要引导那些误入的新人离开，还要和不知何时出现的“夏日回忆”流浪者打交道。
//
//不知不觉，变得忙碌起来了啊。
//
//“中度睡眠”
//“中度睡眠”比“浅界记忆”更加不稳定。在进入此区域时，会感到明显的昏睡感。流浪者将很快适应这种昏睡感，并对之习以为常。
//
//“中度睡眠”内的空间变化较之“浅界记忆”更加频繁，且景观的差异也更大。以下为一些记录在案的“中度睡眠”景观：
//
//中式园林，包括空阔的亭台、走道、花园、假山等等。
//一所高校，通常包含空无一人的教学楼、图书馆、实验室与住宿楼。所有书籍的文字都模糊不清，难以辨识。
//草原，偶尔能看到零星的小型住宅。
//码头、堤岸与海，以及无人的船舶、空置的机械和现代风格的装饰走道。
//“中度睡眠”中会出现更多好梦罐，但维持的稳定空间将有所缩小。
//
//这里也是我们经常活动的地方。我们在“浅界记忆”的据点里有一个稳定通向这里的出入口，因此我们的成员常在两处之间活动。
//
//“中度睡眠”比起“浅界记忆”来要显得梦幻许多，空间变化也会更加明显。我想如果这是一个人的梦，那么他的人生经历一定很丰富。
//
//不得不说的是，这里确实有迷路的风险。我们只建议流浪者在手持指向树脂一类物品时深入Level C-405，否则最好找到一个像我们的成员一样老练的向导。没有适应这里的变化的话，很容易在快速更替的景象中迷失自我。
//
//和“浅界记忆”一样，这里的时间永远都在白天的正午。确切地说，如果你在这里找到一个表，那么它显示的肯定是“12点34分”。
//
//当然，那似乎也不怎么可靠啦。
//
//“深层梦境”
//5GRJmbYp6lcHBiy.jpg
//这是我们所掌握的一个由“中度睡眠”通往“深层梦境”的交界点。大部分时候，我们都只会用此与“夏日回忆”进行交易。
//
//进入“深层梦境”后，流浪者将陷入一种“恍惚”的状态。这种状态下，流浪者依旧能够保证意识，但是会一定程度上变得缓慢。
//
//从“深层梦境”开始，Level C-405将出现昼夜之分。这一区域内时间的流速不是均匀的，但这仅限于主观上的时间，流浪者客观的年龄与心智并不受此影响。
//
//“深层梦境”内，空间变化开始变得如同家常便饭。很多时候，只需几次睁眼闭眼，就会发现身边的环境发生了天差地别的变化。同时，景观的“逻辑性”也会经常性地缺失，常常会出现空中楼阁、巨型天体、光影颠倒等不合理的现象。
//
//由于“深层梦境”特殊的性质，不建议任何流浪者试图深入此处。虽然层级本身较为安全，但是偶尔出没的实体以及快速变换的环境都将成为流浪者的威胁。更加迟缓的思维也会进一步使流浪者陷入危险。
//
//“深层梦境”会出现较多好梦罐，但能够维持的稳定区域极小。
//
//说到这里，就不得不提到“夏日回忆”了。说实话，我很喜欢他们的这个名字。
//
//他们是什么时候出现的呢？……现在想来，或许比我们要早得多。那是一群沉溺在梦境中的人，他们总是说着“归宿”、“童年”之类的话语，甘之如饴地享受恍惚与昏睡。
//
//这里的景观总是在变换，几乎没有定型。或许是那些超自然的美景吸引了他们？我也不太清楚。不过好在我们目前接触过的“夏日回忆”成员都还理智清明，也能正常交易和往来。
//
//我想他们一定有什么方法能够在那些混乱的梦中维持方向，但我并不好奇。毕竟我是一个安于现状的人，既然我们之间的交易长期稳定，那也就没什么好担心的了。
//
//“渊域夜魇”
//“渊域夜魇”是Level C-405的最深处。进入该区域的瞬间，将会恢复清明。
//
//“渊域夜魇”似乎有着与“浅界记忆”同样的半稳定性质，但其内漆黑一片。任何本层级、或是外界的照明设备都无法照亮“渊域夜魇”，只有好梦罐能够提供小幅度照明。
//
//根据少数报告显示，好梦罐照明下的“渊域夜魇”极度荒废，几乎呈现出被破坏的景象：楼房塌陷、道路堵塞、锈斑遍布。深入该区域将会引向未知，很少有人能从中安全离开。
//
//不建议任何流浪者进入此区域。
//
//每个人都有噩梦。
//
//实体
//本层级中实体活动较少，但依然存在。骇笑者与片人是Level C-405内最常出没的实体，而虫群有时也会在本层级现身。
//
//这些实体事实上才是Level C-405内最危险的东西。虽然他们出现的不多，但在更替变化的场景里，总会出其不意。
//
//记得小心一点。我们有一个成员上次差点栽了。
//
//基地、前哨与社区
//M.E.G.“清醒梦”前哨站
//由8名自愿常驻本层级的M.E.G.成员组成。
//他们的生活区域在“浅界记忆”与“中度睡眠”之间。
//他们是M.E.G.主要的好梦罐来源。
//他们会主动帮助误入本层级的流浪者，并指引他们前往其他层级。
//“夏日回忆”
//由一群沉醉于本层级的流浪者组成。
//人数不定，他们会拉拢任何流浪者加入他们。
//他们的生活区域在“深层梦境”。
//他们同样会收集好梦罐，主要用于自身使用。
//他们会与“清醒梦”前哨站保持联络，有时会用一些好梦罐换取某些M.E.G.补给。
//入口与出口
//入口
//在Level C-166时，手持一本梵高的传记入眠即可在“中度睡眠”醒来，但传记会因此丢失。
//在Level C-160内入眠，即可在“浅界记忆”醒来。
//如果在Level C-191中入睡，你将有极小概率不被烟火吵醒，而是在本层级中醒来1。
//在Level C-38内的更衣间中沉睡，将会在本层级进入“深层梦境”。
//从Level 282中直接切出有概率抵达本层级中任意区域。
//出口
//wROQVBKTJHhmISq.jpg
//就是这样的白色小屋。
//
//在本层级任意区域，手持一本梵高的传记入眠即可在Level C-166醒来，但传记会因此丢失。
//离开Level C-405最简单的办法是在“浅界记忆”中找到一件白色的小屋，其内会有一个闹钟，拿起它即可随机进入C层群中的某个较安全层级。2
//如果你在Level C-405中使用指向树脂，它会将你带入“中度睡眠”中的一个地下室。深入该地下室将把你传送到C层群中某个较危险的层级。3
//从“深层梦境”中离开较为困难，你需要在连续使用两个好梦罐后在一片黑暗中入睡，这可以带你进入C层群中的某个高危层级。4
//从“渊域夜魇”切出被视为是不可能的。一具被发现于Level C-65的流浪者尸体身上沾染了大面积的镀金，而“夏日回忆”组织中有成员声称他们见过此人，他最后一次现身是开始向“渊域夜魇”深入。
//就写到这里吧。我也有点困了。
//
//祝你们好梦。
//
//
//
//
//
//
//
//
//
//
//Footnotes
//1. 迄今为止，只有1名流浪者以该方式进入Level C-405。
//2. 通常为生存难度宜居、生存难度0或生存难度1。
//3. 通常为生存难度2或生存难度3，也可能是某些未分级层级。
//4. 通常为生存难度4或生存难度5。
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1405{}