//Level C-448
//评分: 
//+18
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
//安全
//稳定
//具有威胁性的团体
//Level C-448是后室C层群的第448层。
//
//描述
//Level C-448的主要部分由两堵相距5米的砖墙组成，其两扇墙后均有一整排的上世纪80年代的老美式红砖联排屋。这些墙被喷漆涂鸦所覆盖着，有时可见到地面上丢弃的染料耗尽的喷漆罐，有些涂鸦的油漆甚至还尚未干掉。这两堵墙的长度暂且未知，似乎像是无限延伸的，并没有尽头，但距离中心点越远，墙上的喷漆也就越少，流浪者如果想要涂鸦的话便可以选择离中心点远的位置进行自由涂鸦。
//
//photo-1611063158871-7dd3ed4a2ac8?ixlib=rb-1.2.1&dl=max-van-den-oetelaar-uymG7UVPXpI-unsplash.jpg&q=80&fmt=jpg&crop=entropy&cs=tinysrgb
//一些Level C-448内的涂鸦。
//
//墙上有许多前厅中各艺术流派的喷漆涂鸦，同时也有流浪者留下的画作，以下将列举出一部分：
//
//波普艺术
//富有未来感的涂鸦
//一些前厅中出名的动画人物
//一些意义不明的词语或者脏话
//无意义的乱涂乱画
//SeY主义涂鸦
//当流浪者在该层级参观时，有时会看到一些靠在墙上的铁制梯子，爬上它们就可以来到墙后面的屋子中，屋子里的摆放同前厅中的大相庭径，流浪者可以在一栋画着”喷漆小子聚集地“的房子找到"喷漆精神"团队住址，在这里流浪者可以与自称"喷漆小子"的成员用杏仁水交换喷漆颜料，面具等用品，据悉，他们的头领是一个名为SeY的流浪者，他被"喷漆小子"们称为"涂鸦之神"，流浪者可以与他进行交谈。他经常出现在墙边，但似乎总忙于喷涂他的画作。
//
//除此之外，流浪者还可以在房间内找到大量精美的艺术作品，据"涂鸦小子"们说这些是SeY的师傅留下的，其师傅为何人暂且未知。当流浪者参观完房间之后，"涂鸦小子"们会询问你是否想要观看SeY的作品，如果回答是的话就会被他们拉去欣赏被他们称为SeY主义画风的涂鸦，但该涂鸦看起来像是儿童乱涂乱画的作品，如果在此期间想要逃走的话，会受到"涂鸦小子"们的暴打，直到欣赏完所有关于SeY主义画风的涂鸦后"涂鸦小子"才会放流浪者走，但据M.E.G.调查发现，SeY足足画了有10公里长的涂鸦，有报告曾说有流浪者因为受不了画的太丑而精神失常撞墙自尽，后面被生神所救，却留下了严重的精神创伤。
//
//采访编号：0029
//采访者 ：门森
//被采访者： SeY
//
//SeY正在墙边进行涂鸦，门森走近他想进行采访。
//
//SeY：噢又来人了，有何贵干？
//
//门森： 呃，我想采访一下您来充实一下这个层级的资料，麻烦了。
//
//SeY：又是烦人的采访，之前的采访我都拒绝了，看在你这么有礼貌的份上，我就勉强答应你吧，别耽误我太久时间。
//
//SeY停下手中的喷漆，不耐烦的看着门森。
//
//门森： 好的，那我就问一些问题，不会耽搁你太久的。首先，你是谁？
//
//SeY：一个喜欢喷漆的疯子，或者像我那帮成员所说，我是"涂鸦精神"团队的首领，也就是他们所说的"涂鸦之神"罢了，我感觉我所画之物只能被称作垃圾罢了，那帮人却说我是什么"涂鸦之神"，呵呵，可笑。
//
//门森：啊，好，我记录下来了下一个问题，你什么时候发现的这一层？
//
//SeY：差不多一年前了，M.E.G.这个懒狗，我当时怀着恐惧第一时间就上报了，可那帮人跟死了一样，就是没人处理我的上报，后面我自己摸索了一下，在一间房子里找到有关这个层级的一些资料，之后我就遇见了撰写这个资料的人，发现他也和我一样是个涂鸦爱好者，而且我发现我的作品远远不及他的千分之一，于是在我的死缠烂打下让他当了我的师傅，就这样，我和他和一些后面来的人创作了许多的画作，只可惜我师傅因为心脏病而去世了。对了，资料里面有一些对我没用的如何切入切出的资料，毕竟我要一直留在这里。你想要的话我就大发慈悲给你们吧，M.E.G.的走狗。
//
//说完，SeY又转过头去继续完成他的画作。
//
//门森：太感谢你了！这些资料对之后进来的流浪者们很有用处！谢谢你提供的消息！
//
//SeY再次转头，显得很无奈。
//
//SeY： 得了吧，瞧你这德行，还有没有其他的屁事，没了就不要烦我。
//
//门森：好的好的，麻烦您了，最后一个问题，这一层有实体吗？
//
//SeY：有你妈的尸体，什么狗屁问题。有是有，全被我杀光了，满意了吧？
//
//门森：请您认真回答….不然我会一直纠缠你的……
//
//SeY：……有一个叫"清洁工"的实体，就经常看我们不爽一样，老是费尽周章想要擦掉我们的作品，我好不容易画出了个我满意的作品他妈他二话不说就擦掉了，我当时被气得直接叫上一帮"涂鸦小子"抄家伙把他们杀得快灭绝了，现在你们可能还能看见一两头，不过他们不敢嚣张了，顶多在那装模作样得评价这个作品好那个作品美，放心吧，他们不会伤人的，现在见到人都怕的直接跑走。
//
//门森：那么好，我就不打扰您了。
//
//SeY：那就快点给我滚蛋，顺便叫上你那傻逼M.E.G.以后离这里远点，不要再来烦我了，还有，你他妈靠到我的画作上了！全被你毁了！
//
//门森匆忙跑走，在即将远去的镜头中还能看到SeY正在骂街。
//
//采访结束
//
//据一名流浪者报告说在探索Level C-448的过程中发现了一具导游的尸体，目前已证实其死于群殴。尸体身上的字条已被回收，具体可在附录中查看。
//
//- 关闭Level C-448归档资料
//欢迎来到后室旅游集团组织的“前厅风光之旅”的第三站！
//
//有趣的事实：SeY主义风格虽然在本层中极为常见，但却十分的难看，有人曾悬赏18瓶杏仁水来暗杀SeY，但却没能成功，反而激发了SeY更多的绘画热情。
//
//01. 万里长城
//02. 披萨比萨斜塔（取消参观）
//03. 埃菲尔铁塔
//04. 涂鸦墙
//05. 暂缺
//06. 暂缺
//07. 暂缺
//08. 暂缺
//
//实体
//本层中有一个名为"清洁工"的特殊实体，通常游荡在墙壁之间，致力于将墙上的涂鸦给清理掉，有一定的攻击性。目前由于SeY的缘故，该实体已濒临灭绝，不再具有攻击性，且会主动躲避流浪者。
//
//基地、前哨与社区
//喷漆精神（Spray Paint Spirit）
//成员人数未知。
//位于一栋画着”喷漆小子聚集地“的房子内
//开放交易，可以用杏仁水换取涂鸦工具。
//组织领头人极具有攻击性，强烈建议不要靠近。
//入口与出口
//入口
//在任何有关艺术作品的层级切入地面便可以来到这里，目前由SeY所提供的入口有Level 57，Level 321，Level 330等。
//在Level 201的霓虹城中切入一个墙上的涂鸦即可来到这里。
//出口
//切入墙上的涂鸦就可以来到Level C-5。
//任何身患疾病的流浪者在切入该层之后都会被传送至Level 109。
//切入一个画有加菲猫的涂鸦可以传送到Level 729。
//切入一个像是由粉笔完成的画作可以来到Level 202。
//如果你足够幸运，你可以在房间内找到一台正在播放着"未来放克电台"的收音机，听上5分钟即可瞬间传送到Level 714。
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1448{}