//Level C-455
//评分: 
//+15
//+
//–
//X
// 
//
//生存难度：
//等级 3
//
// 
// 
// 
//Level C-455是后室C层群的第455层。
//
//描述
//Level C-455是一间面积无限且贴满了便利贴的封闭房间。
//
//该层级永远保持明亮状态，不仅墙壁贴满了便利贴，地面也由层层叠叠的便利贴组成，流浪者行走在上面会有胶状附着感，便利贴上的文字由各国语言组成，但其中只有极少数的文字能够辨识，其余无非为字迹模糊或者毫无逻辑的句子，同时，流浪者也可以看到其他流浪者留下的便利贴，但是大部分都写着：RUN AND NEVER COME BACK的词语。
//
//va9bxx.jpg
//便利贴的照片。
//
//流浪者可以在由便利贴组成的地板上找到铅笔，空白的便利贴，流浪者可以在上面进行涂鸦或者留言并贴在墙壁上，但该行为已被证实会引来该层特殊实体：“贴人”，任何想要留言的行为都是不明智的。当流浪者试图破坏任意一处的便利贴时，便利贴的外观在此时会表现为一只类似于人的手，将流浪者拉入墙壁内，在一段时间后，流浪者的尸体将会浮出地面，浑身贴满了便利贴，同时在该层级某一区域内会出现新的“贴人”。
//
//下面列出已经发现且能够识别或能够阅读的文字：
//
//1.你好？（Hello？）
//（备注：较为常见的出现在墙壁上。）
//
//2.救命（help）
//（备注：发现这句话时拍下的现场照片因为足以引起任何流浪者生理不适故不予展示）
//
//3.RUN AND NEVER COME BACK
//（备注：已被证实为大多数成为“贴人”的流浪者留下的句子，目前已成为逃出Level C-455的流浪者聊天时常提到的一个段子。）
//
//4.再见！（Goodbye!）
//（备注：“Goodbye!”的原涂鸦比较模糊，像是前前后后由多个不同的人的血液反复涂上组成的一样。）
//
//5.都给我去死吧
//（备注：疑似由流浪者留下的句子。）
//
//6.Don't destroy any of the p████████
//（备注：无法考证这句话的位置。）
//
//7.(一副图案，上面画着的是“贴人”的模样。）
//（备注：发现于房间内的天花板上，极少出现。）
//
//8.Ich hoffe, dass meine Nachricht von mehr Menschen gesehen wird, und benachrichtige alle Obdachlosen, die hierher gekommen sind oder nicht, so schnell wie möglich████████████
//翻译为”我希望我的消息能被更多的人看到，通知每一个来到这或者没有来到这的流浪者们，尽快的████████████“
//（备注：该便签由德文写成，贴到了每个流浪者来到该层时能看到的最醒目的位置，原文后面的字迹已变得模糊不堪，无法辨识。同时，该便签的周围贴满了其他写着RUN AND NEVER COME BACK的便利贴。）
//
//9.Есть секреты под землей
//翻译： 地下有秘密。
//（备注：无法考证这句话的位置）
//
//10.快 来 找 我
//(备注：该句子先后由不同的人血液组成，疑似由贴人留下的句子)
//
//11.谁能来救我，我████████了，救███████命
//（备注：无法考证这句话的具体位置，大约位于离本层级中心点向南20公里处）
//
//M.E.G.认为该层级的特殊实体可以理解人类语言，但目前尚不知道为什么变异实体会写下和画下这些内容。
//
//- 关闭Bertha Young和Augustine Stephens的记录
//层级： Level C-455
//时间： 2022年2月14日 16:14 PM
//记录员：Bertha Young，Augustine Stephens
//
//记录开始
//
//Bertha Young和Augustine Stephens暧昧的相拥在一起。
//
//Augustine Stephens1： 宝贝，今天是我和你来到后室的第520天，同时今天也是我们的第一次相遇的周年纪念日，你说想要来点刺激的，为了纪念这个日子，我就把你带来这里啦！这是后室里为数不多的能记录文字的地方，我要让所有来到这里的人见证我们的爱情！
//
//Bertha Young2： 噢，真的吗，这主意真是不错……嗯，我们该做些什么呢，一切听你的安排！
//
//Augustine： 按照我的计划…..第一步！我们先看看这里都有什么留言吧！
//
//Bertha： 一切听你的指挥！ (●'◡'●)
//
//Bertha Young和Augustine Stephens手牵手的观看着墙上的留言。
//Bertha指了指其中一个便利贴。
//
//Bertha：亲爱的！快看！好像也有人和我们有着同样的想法呢！
//
//Augustine看向Bertha所指的那张便利贴。
//
//Augustine： 嗯，看起来他们也和我们一样恩爱呢，不知道他们现在怎么样了。
//
//Bertha朝着Augustine甜甜地笑了笑。
//
//Augustine： 接下来到第二步！那就是留言！表达我对你的爱！
//
//Bertha： 好耶！不过你带笔了吗？
//
//Augustine： 啊，额….是我疏忽了，没关系，你看地上不是有一支吗！
//
//Augustine捡起了那支笔，并开始在便利贴上写字。
//
//Bertha： 亲爱的，你写了什么？
//
//Augustine转头面对着她笑了笑了。
//
//Augustine：我不告诉你！嘻嘻~
//
//Bertha嘟起了嘴，争着想去看Augustine写了什么。
//
//Augustine： 不给你看！
//
//说着，Augustine挡住Bertha，在这过程中，Augustine不小心蹭掉了几张原本在墙上的便利贴。
//
//Bertha： 哼！我不看了！
//
//Augustine放松了警惕，微笑着看着她。
//
//Bertha： 我生气了！！！
//
//Augustine：别嘛，这是惊……
//
//Augustine的话还没有说完，墙后突然伸出一只由便利贴组成的手，将Augustine往墙壁里拉去。
//
//Bertha楞了一下，立马拉住了Augustine的手。
//
//Bertha：亲爱的！这是怎么回事？？？！
//
//Augustine：我也不知道啊，但是….但是……
//
//Augustine越陷越深。
//
//Augustine：不….都是我的错…..是我没仔细看这一层的资料…..我只认为避开实体就行了….是我太莽撞了…..放手吧….要是只能活下一个人，我希望那个人是你…..
//
//Augustine用力挣脱了Bertha的手，消失在了墙壁中。
//
//Bertha：不！！！！！！！
//
//Bertha跪倒在地上，痛哭了起来。
//
//Bertha：都是我的错！！是我不该说要找刺激的..是我不该抢着去看的!
//
//Bertha：没有你的世界，有什么存在的意义！
//
//Bertha发疯般地开始破坏墙上的便利贴
//
//又一张由便利贴组成的手将Bertha拉入墙壁，在Bertha即将被拉入墙壁的最后一刻，她看到了Agustine写的那张便利贴，上面写着：Will you marry me？
//
//Bertha的眼角再次流出了一滴泪水，闭上了眼
//记录结束
//
//M.E.G.在经过确认后，证实Bertha Young和Augustine Stephens两人已死亡。
// 
// 
// 
// 
// 
// 
// 
//据说在该层级的某个角落，有两具相拥在一起的尸体，他们死死地拥抱着，永不分开。
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
//谁知道呢？
//
//特殊实体
//当流浪者在该层级内流浪时，会遇到游荡中的“贴人”。
//
//“贴人”浑身包裹着便利贴，身上的便利贴遇到杏仁水会腐蚀脱落，流浪者可以使用杏仁水对其进行驱赶，当“贴人”发现流浪者时，会不顾一切的朝流浪者的方向冲过来，立即抱住流浪者，并根据流浪者的外貌特征往其身上贴便利贴，贴在身上的便利贴会使流浪者有呼吸困难感，程度随着便利贴的增多而加重，除非流浪者往便利贴上泼洒杏仁水，否则便利贴会一直留在身上。一般来说“贴人”只会死死的抓住流浪者不放，只有极少数的情况下流浪者会听到“贴人”对他说：RUN AND NEVER COME BACK。并放手放跑流浪者。
//
//- 关闭** 2022年8月9日最新报告**
//根据M.E.G.研究所的最新调查显示，该层级存在的特殊实体：”贴人“已被完全证实由在该层级死亡的流浪者形成，并发现有部分实体尚且残留一丝理智，目前M.E.G.已派遣人员前去调查。
//
//- 关闭** 2022年8月11日Level C-455部分死亡人员名单**
//姓名与性别	附录
//Caroline Snow	女	无
//Walker Lancelot	未知	由于其尸体仅剩下残缺的头部，根据该流浪者背包里信息，仅能知道其名字而无法判断其性别
//Kirk Finn	男	尸体只剩下上半身
//Christopher Howell	男	该名流浪者为前M.E.G.侦察部成员
//Lawrence Parkerll	男	身上的便利贴最为密集
//请各位罹难者的家属不要贸然前往该层级寻找尸体或者遗物，如果你发现了长相疑似您已离世的家属，请一定不要靠近，请一定不要靠近！
//
//- 关闭Dutch博士的采访记录
//采访者：Dutch博士
//被采访者：变成”贴人“的Jhony
//
//采访开始
//
//Dutch博士：好的，那么采访就开始了。
//
//Jhony：我..该….说….什?
//
//Dutch博士：说说你变成”贴人“的感受吧，看起来你的语言中枢暂未遭到太大的破坏。
//
//Jhony：好….的…..就….贴人…..畏惧…….xing….仁水…..因为….碰到….会..痛。
//
//Dutch博士：好的，还有吗？
//
//Jhony：我…的….理智….尚未….Bo….夺，但….有时我…..控制不住..
//
//一片沉默
//
//Jhony：你…能帮我….hui复…吗？
//
//Dutch博士：应该不能了，从生理学的角度上来看，你已经死了。
//
//Jhony：那hao..吧。
//
//Jhony开始往Dutch博士身上贴便利贴，上面歪歪扭扭写着对Dutch的评价以及他的外貌描述。
//
//Dutch博士：你为什么要这样做？
//
//Jhony：我也….不想…..但kong…制不,住。
//Dutch博士：……
//
//又是一片沉默，Dutch博士用杏仁水清除了Jhony给他贴的便利贴。
//
//Jhony：快………………走。
//
//Dutch博士：什么？
//
//Jhony：快走！！！！！
//
//Jhony发疯般的追赶着Dutch博士，好像他的理智已被完全剥夺了。
//
//Jhony：RUN AND NEVER COME BACK!
//
//情急之下，Dutch博士切入了一张画有加菲猫的便利贴，随后便传送到Level 729。
//
//采访结束
//
//该记录原件由于未知原因，文字记录变为了高曝光状态，无法读取，以上的为原件。
//M.E.G.在经过调查后，Jhony已经完全丧失了他作为人类的理智，完全沦落为了”贴人“。
//
//Level C-455有关邮件归档
//
//隐藏邮件
//发件人：FL0XK.None@backmail.com
//收件人：meg.seniorarchivist@backmail.com
//主题：Level C-455 的最新发现
//那个，我好像在Level C-455中意外的打开了一个全新的空间…?
//～FL0XK
//
//发件人：meg.seniorarchivist@backmail.com
//收件人：FL0XK.None@backmail.com
//主题：回复：Level C-455 的最新发现
//感谢您的报告，请您进行描述，以便于我们是否决定前去勘察。
//～M.E.G. 档案部
//
//发件人：FL0XK.None@backmail.com
//收件人：meg.seniorarchivist@backmail.com
//主题：回复：回复：Level C-455的最新发现
//呃…怎么形容，就是我在Level 502中意外的切入了一张便利贴，就被传送到了这里，进来后我就想喝点杏仁水…..结果我弄洒了……然后我似乎进入了一个新的空间。
//～FL0XK
//
//Level C-455有关邮件归档
//
//隐藏邮件
//发件人：meg.seniorarchivist@backmail.com
//收件人：FL0XK.None@backmail.com
//主题：Level C-455 的最新发现
//请您细说，否则我们M.E.G.档案部将无法决定是否前去侦察。
//～M.E.G. 档案部
//
//发件人：FL0XK.None@backmail.com
//收件人：meg.seniorarchivist@backmail.com
//主题：回复：Level C-455 的最新发现
//就是…我组织一下语言，简单来说就是地面上的便利贴被腐蚀过后，地板上就露出了个大洞，我便跳了进去，还录了视频，等会我就上传。
//～FL0XK
//
//发件人：meg.seniorarchivist@backmail.com
//收件人：FL0XK.None@backmail.com
//主题：回复：回复：Level C-455 的最新发现
//我们已经收到您的回复，我们也将派遣人员前去侦察这个全新的空间。
//～M.E.G. 档案部
//
//- 关闭FL0XK拍摄的视频
//拍摄时间：2022年8月15日
//
//视频开始
//
//FL0XK:嗯…好的，开始录制了。
//
//FL0XK将摄像头环绕了房间一周。
//
//视频画面中的房间类似于一间简陋的木匠工作室，满是灰尘，疑似被尘封了很久。屋顶由钢架结构组成，墙壁有部分铁锈痕迹，占据最大空间的是一个摆满工具的木架，一个较矮的柜子和一张看起来有些年头的工作台，柜子的旁边是一扇上锁的窗户，从里面向外看是一片稀疏的小树林，很远处有一条郊区的公路。
//
//FL0XK:挺多灰尘的，对了，差点忘记说了，我掉下来之后屋顶就闭合了，如果M.E.G.侦察部的人想来，那就按照我原本的方法就可以进来了，除此之外别的方法可能是进不来的，根据我的经验判断，这里应该是Level 455.1，大概吧？
//
//FL0XK走向工作台，看着上面的工具，发现了一张便利贴和一本日志，日志上写着”Len的日志“。
//
//FL0XK将镜头凑近便利贴，上面写着：我们很快就带孙女来看你 -Alice留。
//
//FL0XK:以目前的线索来看，Len是这间工作室的主人，而Alice则是他的女儿….
//FL0XK拭去日志上的灰尘，翻开了日志。
//
//FL0XK:前面的都是工作内容…..嗯，这页不一样了。
//日志上的内容：2020年3月29日 晴 //
//今天女儿给我推荐了个新的东西，叫什么….对！便利贴！诶哟我这记性…..
//刚从超市里买回来，好像挺管用的，Alice她告诉我是这么用的，还好我记下来了：
//1.激励。写一些激励自己的话语，张贴在睁开眼睛就能看到的地方。每天的开始都会有一个好心情。
//2.提醒未完成的事项。
//3.代替书签。传统书签容易滑落而且无法准确的知道具体看到哪里了。用便利贴的话，就完美解决了这个问题。//
//
//日志上的内容：2020年4月1日 阴
//便利贴真的太好用了！真的很方便，哪天我要好好感谢我女儿才行，只不过用的很快啊，我经常用完就不见了，好像消失了一样，明天我再去买一些新的回来吧。
//
//日志上的内容：2020年7月6日 晴
//女儿说她很快就要带孙女来看我了，真不知道孙女现在怎么样了，长多大啦？呵呵，真是期待啊。
//
//日志上的内容：2020年8月31日 暴雨
//女儿啊，你到底在哪里啊？不是说好来看我的吗，这都一个月了，为什么你失踪了啊？孙女也…..（后面的字迹模糊不堪，无法辨识）
//
//日志上的内容：2021年2月10日 晴
//我决定了，我要去找我的孙女和女儿 。
//
//日志到这里就结束了。
//FL0XK陷入了沉默，他默默地关上了日志。
//
//FL0XK:…….让我们找找怎么出去吧。
//
//FL0XK转过了身，看到了一扇门，门上面挂了一张合照，画面上有Alice，Len和他的孙女，看着十分开心，上面写着2019/6/13/拍摄。
//
//FL0XK推开了那扇门
//
//FL0XK来到了Level C-322。
//
//视频结束
//
//M.E.G.侦察部成员已按照FL0XK的方法来到这里，并确定了这是Level C-455.1，视频中提到的Alice与她的女儿被证实在一条公路上行驶时意外的切入而来到了后室，目前下落不明。
//
//- 关闭视频截图
//vwsLP1.jpg
//视频截图。
//
//基地、前哨与社区
//由于该层级的特殊性，不能成立任何的基地，前哨与社区。
//
//入口与出口
//入口
//从Level 321墙上便利贴切入就会来到这里。
//切入Level 502中一台服务器上贴着的标签即可来到这里，但概率极小。
//出口
//切入一张画有门的便利贴，即可传送到Level 21。
//找到一张画有加菲猫的便利贴，切入它，便会来到Level 729。
//找到一张歪歪扭扭写着员峤且画着小山的便利贴，触摸它会被传送到Level C-100。
//触碰一张写着Alone的便利贴，就会传送到Level 53
//作者信息
//« Level C-454 | Level C-455 | Level C-456 »
//
//Footnotes
//1. 以下简称Augustine
//2. 以下简称Bertha
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1455{}