//Level C-438
//评分: 
//+19
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
// 
// 
//实体横行
//Level C-438是后室C层群的第438层。
//
//描述：
//62b045150947543129ffacf8.jpg
//一张阖家欢剧院的手绘平面图
//
//Level C-438是一座现代装修风格的剧院，内部空间巨大，墙壁上贴有“禁止摄像”和“禁止吸烟”的标识及各种剧目的海报。观众席拥有共11排座位，第一排仅有三个座位，主评委们在此落座；随后的第2到8排每排中央有10个座位，称为“中央座位”，观众们可以在此落座；左右隔着走廊还各有5个座位,称为“侧位”，大众评审团的成员们在此落座；第9到11排仅有供观众们落座的中央座位。
//
//剧院正门位于观众席正后方，是一扇白色双开门。流浪者可以通过此门随意进出Level-C-490与剧院。Level-C-490被毁灭后，正门被贴上“正在维修”的标牌，且无法以任何手段打开。正门左侧有“零食自助”窗口，该窗口放置有一台可无限取用的饮水机及一台无限取用的爆米花机。经测定，饮水机内的液体为杏仁水，爆米花机产出的爆米花永远保持在26℃。“零食自助”窗口旁是洗手间和员工休息室。正门右侧有一扇标记着“员工通道”的黑色单开门，任何意图进入员工通道的人都会被保安阻止。“员工通道”的正对面是由两名保安把守的剧团长办公室。
//
//观众席正前方是舞台，演出未开始时有幕布遮挡。舞台后方为“候场区”，只有演员身份的流浪者可以进入。舞台左右各有一扇标有“安全通道”的白色单开门，上有绿色荧光的“EXIT”字样；通过这扇门就可以回到你切入Level C-438之前所在的层级。
//
//剧院由名为“阖家欢剧团”的艺术团体所控制，正常情况下内部无任何敌对实体。然而，一旦流浪者的行为触犯“剧院守则”，保安会从暗处走出并将其拖入员工通道围殴致死。
//
//剧院通常每天会表演5场剧目，其剧本随机选取自前厅的一些剧目，包括但不限于古典戏剧、戏曲、小说、动漫、游戏等。演出时间会根据剧目调整，一些用时较长的剧目可能会使当天演出的剧目少于5场。
//
//流浪者每次切入该层级时，他们都会随机出现在大门旁的两个通道之一。通道的尽头是一扇只可从内部打开的门，门口有一位工作人员迎接该流浪者。工作人员将会递给流浪者剧团守则以及一张“演员”卡和“观众”卡。撕碎任何一张卡片会导致另一张消失并获得对应身份，身份的效果如下：
//
//观众：可以自由行动，但无法进入“候场区”。一天之内观看3场以上剧目可能会转变为保安、大众评审团或群演。
//
//演员：将会被传送至“候场区”并随机获得一本将要演出的剧目的剧本。剧本内容将指导流浪者如何行动和表演。他们可以进入“候场区”，但是他们在表演完成之前无法通过正门和安全通道出入该层级。在表演完成后他们的身份将会被转换为“观众”。任何表演前或表演中剧透一经发现会被认为触犯“剧院守则”。
//
//若是将两张卡片一起撕碎，流浪者将会切出到原先所在的层级。
//
//当流浪者参演的剧目结束后，主评委和大众评审团会对其进行评分，得分称为“好评率”，分值区间为0%-100%，流浪者将根据好评率获得奖励或惩罚。据传，当好评率到达100%时，剧团长将亲自接见该剧目中所有流浪者并将其送至“桃花源般的好地方”。目前尚无该记录。
//
//- 关闭
//以下为M.E.G记录在案的不同好评率的奖惩记录1：
//好评率	奖励内容
//100%	剧团长的接见
//90-99%	一瓶1000ml的瓶装杏仁水、一份皇家口粮、*一件武器（热兵器）、*随机1-3件在其所演绎的剧中出现过的物品
//70%-89%	一瓶500ml的瓶装杏仁水、一份自热食品、*一件武器（冷兵器）、*1件在其所演绎的剧中出现过的物品
//40%-69%	*一瓶500ml的瓶装杏仁水、*一份自热食品
//0%-39%	被淋10ml腰果水
//目前尚无该层级任何影像记录，所有的摄像设备在切入该层级时会被保安没收，未被没收的也无法使用。如流浪者私自携带摄像设备并使用，在被保安发现后会被认定为触犯“剧院守则”。
//
//- 关闭
//欢迎各位来到阖家欢剧院！
//
//各位观剧者在观赏时，也要遵守相应的剧院守则以保证大家都拥有最佳的观赏体验！
//
//禁止扰乱会场秩序
//禁止拍照
//除剧院员工外，闲杂人等禁止进入“员工通道”
//禁止无限制取用饮用水与爆米花
//表演期间，禁止无关人员登上舞台
//表演前或表演中，禁止任何剧透行为
//感谢各位的配合！如若违反守则，很抱歉我们会采取一些强制措施让违规者永不再犯类似的错误。
//
//祝愿大家观剧愉快。
//
//剧团长阮梅笔参上
//
//实体：
//“剧团长”阮梅笔
//
//一手创办了阖家欢剧团。除好评率为100%的的表演者外，无人见过他的样貌。
//
//保安
//
//保安并不会主动攻击流浪者，他们一直隐藏在暗处，并将触犯“剧院守则”的人拖入员工通道围殴致死。
//
//大众评审团
//
//最初由无面灵组成，后来逐渐被选择留下观看剧团表演的人所替代。他们将三位主评委称为“前辈”。在观看表演时他们会与旁人悄悄议论以确定评分意向。总共有70位大众评审团成员，每人评分权重只有1%。
//
//调查发现，当大众评审团的评审者与主流不同（≤2%）时，他们将会被无面灵所替代，直至下一位留下观看剧团表演的人将其替代。而与主流所不同的评审员则下落不明。
//
//主评委
//
//由三人组成的评分团队，每一位的主评委的观剧口味都极其刁钻。投票时他们的评分权重为10%。
//
//经M.E.G调查发现：1号评委的评分多偏向于拥有喜剧情节的戏剧，2号评委的评分多偏向于注重表演细节的戏剧，3号评委的评分多偏向于拥有血腥暴力情节的戏剧。
//
//群演
//
//最初由无面灵组成，后来逐渐被选择留下参加剧团表演的人所替代。主要扮演剧中配角、龙套角色。
//
//M.E.G记录在案的戏剧
//剧团剧目总览
//Level C-438 » 剧团剧目总览
//以下为M.E.G记录在案，曾在阖家欢剧团上演过的戏剧。流浪者们可在此新增新上演的戏剧。
//
//记录格式：
//
//表演者：
//上演剧目出处：
//所扮演的角色：
//好评率：
//获得的奖励/惩罚：
//后记：
//
//表演者：M.E.G罗经点特工Oilfield
//上演剧目出处：电视剧《激战江南》第十二集
//所扮演的角色：炊事员老冯
//好评率：81%
//获得的奖励/惩罚：一瓶500ml的瓶装杏仁水、一份自热食品、一锅鸡汤。
//后记：他妈的，我这鸡汤里没有毒，真的！你们过来喝啊！不咸不淡，真的好好喝！——特工Oilfield
//
//表演者：流浪者茶艾
//上演剧目出处：电视剧《征服》第八集
//所扮演的角色：瓜老板
//好评率：82%
//获得的奖励/惩罚：一瓶500ml的瓶装杏仁水、一份自热食品、一包熟瓜子种子（附有种瓜指南）。
//后记：保熟。——茶艾
//
//表演者：
//highlightingman
//highlightingman
//
//上演剧目出处：摇滚歌剧《the wall》
//所扮演的角色：剧中主角Pink
//好评率：88％
//获得的奖励/惩罚：一瓶500ml的瓶装杏仁水、一份自热食品、一把套在西装里的巨大的榔头（剧中由校长的形象转变而成）
//后记：怎么，象征性的意象也算“出现”？——highlightingman
//
//表演者：
//Liurd
//Liurd
//
//上演剧目出处：恐怖电影《闪灵》
//所扮演的角色：杰克·托兰斯
//好评率：89%
//获得的奖励/惩罚：一瓶500ml的瓶装杏仁水、一份自热食品、一把斧头
//后记：原来这个不算喜剧吗……——
//Liurd
//
//表演者：流浪者Tamim
//上演剧目出处：由肖斯塔科维奇作品《形式主义者天堂》改编而成的小品
//所扮演的角色：“二把手”
//好评率：68％
//获得的奖励/惩罚：一瓶500ml的瓶装杏仁水、一份自热食品
//后记：也许是改编的不够好。——Tamim
//
//表演者：
//Hekalivia_Ven
//Hekalivia_Ven
//
//上演剧目出处：《雷雨》
//所扮演的角色：
//好评率：87%
//获得的奖励/惩罚：一瓶250ml的瓶装杏仁水、一件旧雨衣
//后记：“看那谁冠冕堂皇，好似炽热的太阳！”哎呀呀，下次要不要来点《哈姆雷特》呢？——
//Hekalivia_Ven
//
//表演者：
//tall-nut
//tall-nut
//
//上演剧目出处：《阿牛小卖部》
//所扮演的角色：阿牛
//好评率：92%
//获得的奖励/惩罚：一瓶1000ml的瓶装杏仁水，一份皇家口粮，一瓶健力宝，一包三鲜伊面，一包锁喉桃
//后记：吃锁喉桃太难受了，拿瓶健力宝顺顺 ——
//tall-nut
//
//
//基地、前哨与社区
//因为该层级特殊的性质，该层级内无任何基地，前哨与社区。
//
//入口和出口：
//入口
//触摸任何阖家欢剧团的海报将会切入该层级
//Level C-490的剧院大门可自由出入Level C-438（现已失效）
//出口
//通过安全通道可以回到你切入Level C-438之前所在的层级
//通过正门可随意进出Level C-490（现已失效）
//作者信息
//« Level C-437 | Level C-438 | Level C-439 »
//
//Footnotes
//1. 带*的为概率出现，对应阶段内好评率越高，出现的概率就越高。每件热兵器自带200-300发备弹。
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1438{}