//
//建立帐号 或 登入
//The Backrooms吧
//Backrooms Fandom Wiki
//The Backrooms中文wiki官方哔哩哔哩公众号
//Discord
//主页
//
//中文沙盒站
//
//图书馆
//
//层级
//|
//实体
//|
//物品
//|
//团体
//
//故事
//|
//相关人士
//|
//现象
//|
//设定
//
//搞笑文章
//|
//国际翻译中心
//
//原创图书馆
//
//原创层级
//|
//原创实体
//
//原创物品
//|
//原创故事
//
//原创团体
//|
//原创相关人士
//
//原创设定
//|
//原创搞笑文章
//
//原创艺术作品
//|
//原创现象
//
//网站
//
//最近创建的页面
//
//最近的更新
//|
//最近的编辑
//
//随机层级
//|
//随机原创层级
//
//随机实体
//|
//随机原创实体
//
//旧页面中心
//
//本月最高评分页面
//
//历史最高评分页面
//
//最低评分的页面
//
//社群
//
//讨论区
//
//翻译预定
//|
//最近的帖子
//
//作者页
//|
//中文网站作者页
//
//加入网站
//
//管理专用
//
//后台管理
//
//职员站点
//
//所有页面
//
//会员一览
//
//侧栏
//|
//顶栏
//|
//主题版式
//
//
//
//　
//
//Level C-493
//评分: 
//+13
//+
//–
//X
// 
//
//生存难度：
//等级 5
//
//不安全
//不稳定
//事故危害
//描述
//Level C-493是后室C层群的第493层，此层级是多架飞机共同飞行的一处三维空间，有数架大型民航飞机在此空间内有序地飞行。
//
//Level C-493是一处多架大型民航飞机共同飞行的空间，空间类似前厅中的正常天空，且有稳定的昼夜交替，流浪者前入此层级后，将会被随机传送到一个飞机上，而不是传送入天空中，此层级内的飞机定是一架大型民航飞机，民航飞机的航程必是长途航程，且飞机上的乘客一定在200名以上，以及多名机组人员。流浪者传送到飞机之后，飞机将会以恒定速度正常飞行，但在降落成功之前飞机必定将会面临意外，这些意外往往是致人于死地的，其可能让飞机解体至坠毁，而在此层级的流浪者则将充当一名飞机机长，在意外发生时，需自己操控飞机，防止事故发生，驾驶飞机安全降落，此时，流浪者应尽量控制飞机降落其所应该降落的机场以及跑道上，如果飞机上有人幸存，流浪者即可获得物资，离开飞机后会被传送入一个层级，幸存人数占飞机人数比例越高，流浪者获得的物资就越多，传送入安全且宜居层级的几率越高。流浪者不必担心自己驾驶飞机技巧的问题，层级内流浪者定会学会一个普通机长所会的飞机驾驶技巧，且有一名经验丰富的副驾驶以及一组备用机组辅助驾驶，而这些技巧等到离开层级都会渐渐忘去。
//
//如果此层级内有多个流浪者，则这些流浪者会独自驾驶一架民航飞机，自己应对自己飞机上发生的事故，且两架飞机不避免相撞或者互相干扰导致飞机更加危险的可能。
//
//地面上的机场以及飞机上的机组，都会配合机长，1其发生的事故各有不同，机场的状况也会随之改变，塔台发射的雷达信号，跑道的滑度以及飞机的状况都无法判定，天气情况可能是决定意外结果的重要因素，地形环境同样也是，但更为重要的流浪者联合机组做出的表现，一般情况下，流浪者都较难保全所有人的性命安全，所以此层级的危险性极高，被M.E.G.评为生存难度5。
//
//流浪者驾驶的飞机型号多种，都是前厅中飞机的型号，主要为以下几类:
//
//波音 737-767各类系列
//DC-9以及DC-10
//MD-11
//空客各类系列
//等等
//
//M.E.G.探险者总署从流浪者口中得出了飞机航行会有以下意外情况：
//
//机械故障类
//1.高度仪表显示错误
//2.操纵杆无法推动
//3.引擎停止
//4.电力故障
//5.引擎叶片故障
//6.方向舵故障
//7.机翼故障
//8.起落架故障
//9.雷达信号接收器故障
//等等
//天气气候类
//1.雷雨天气
//2.大雪天气
//3.大雾天气
//4.风暴天气
//5.冰雹天气
//等等
//地形环境类
//1.高山峻岭
//2.沿海地区
//机场设备类
//1.机场设备不齐全，如没有雷达
//2.跑道极短
//等等
//
//还有一种不为常见但极其致命的意外情况：人为影响的意外，此类意外种类多，且致命。下表列出可能发生的人为意外。
//
//副机长有意操纵飞机发生意外
//有人人为影响机组驾驶飞机
//机场联系飞机的空管员没有正确的引导飞机，甚至未联系飞机
//飞机上有人安装炸弹等易燃易爆物品（虽然这不太可能）
//等等
//飞机上的零件磨损通常是非常致命的，这些零件磨损往往导致机械故障，使飞机发生意外。包括但不限于螺丝松动，重要部件出现金属疲劳现象是导致飞机发生意外的重要情况，零件磨损可能使飞机发生解体，部件失去作用，M.E.G.得知前厅中有一次客舱框架解体事件，导致飞机天花板破裂，成为了名副其实的“敞篷飞机”。2虽然此层级并未发生过此类事件，3但仍然要谨防。
//
//飞机在飞行途中可能会遇到障碍物，这些障碍物一般是鸟群，这些鸟群撞上飞机之后导致飞机发生状况，以至于发生意外，不过这种情况占比极其的少。
//
//更多空难种类M.E.G.正在调查中，为此，M.E.G.尽力寻找从前厅切入后室的飞行员，联合其他团体对此层级调查。但此层级的意外太过于多样性，M.E.G.无法让所有的人都避免意外，若流浪者不幸来到了此层级，请尽力挽救飞机上每一个人的生命，尽管互不相识，但这也等同于挽救自己的生命。
//
//此外，流浪者驾驶的飞机降落的机场繁多，且为前厅中的机场，假说流浪者遇到的是燃料短缺或者引擎停止等使飞机无法抵达原定机场的情况，飞机可以选择迫降，尽可能的保护机上人的安全。
//
//机场附近并不会有任何建筑物，虽然这些机场都符合他们在前厅中的地理位置，但仍未发现除机场以外的任何建筑。
//
//- 点击隐藏
//时间：2021.5.22
//
//测试人员：M.E.G.成员3名
//
//一名成员于5月21日在Level C-11内找到一个DC-10模型，成员立即使用钩杆将其钩住，保持距离将其带回实验基地。4
//
//
//实验过程：一位已经到达过Level C-493并成功降落飞机传送入宜居层级的M.E.G.成员5准备依靠飞机模型再次进入Level C-493，目地为了再次确定意外的种类，靠近模型3秒过后，其并没有传送入Level C-493，而是留在原地。
//
//实验结论：经过多次研究，如果安全从Level C-493离开，之后便永远不会回到Level C-493。
//
//
//实体
//Level C-493“原住民”
//Level C-493飞机上的除流浪者本身以外的机组成员，乘客以及机场内部人员等都被认为是使层级内的原住民，他们和人类生物学特征都相同。
//
//暂未记录其他实体。
//
//基地，前哨和社区
//由于此层级内部的特性6，本层级内无基地，前哨和社区，但Level C-11有关于此层级的研究基地，为M.E.G.探险者总署旗下基地，负责记录事件以及研究防止意外的方法。人数约30名。
//探险者总署已经与此层级的各大机场取得联系，若你来到了此层级，即可以联系机场通告M.E.G.。
//
//入口和出口
//入口
//在任一层级靠近一个麦道公司生产的飞机（例如DC-10，MD-11）模型5米内，滞留3秒钟以上，即会被传送到此层级。
//其他入口正在调查中，但有流浪者报告，通过Level 36等有关于飞机的层级也可以来到此层级，但未经证实。
//出口
//如果你在飞机停止后活了下来，走出飞机舱门（如果舱门还在的话），会被传送到其他层级，传送层级的安全系数决定于你救的人数在飞机总人数的占比。7
//若你成功在此层级活了下来，8之后将永远不会回到此层级。
//作者信息
//« Level C-492 | Level C-493 | Level C-494 »
//
//Footnotes
//1. 前厅的空难事故中，机场都会极力配合，除非意外就是因为其他人员不配合所导致的
//2. 对应的是前厅中阿罗哈航空243号班机事故，飞机的零件多次磨损加压，导致解体。但此行飞机仅导致一名乘务员失踪，其余人都幸免于难。
//3. 也许发生过，但降落失败了
//4. 详见基地，前哨和社区以及出入口。
//5. 此人在前厅中他是一名富有经验的机长，飞行时间超过30000小时，切入后室后加入M.E.G.
//6. 即走出飞机就会传送
//7. 这里指的是幸存者占比，不包括流浪者本身。
//10%以下，生存难度2
//10%~30%，生存难度1
//30%~99%，生存难度0
//100%，宜居
//8. 若你独自弃机逃跑（虽然难以完成），而不是带着飞机降落的话，将会被探险者总署直接判定为死亡，因为这样做的人都无了音讯。
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1493{}