//Level C-487
//评分: 
//+19
//+
//–
//X
//⚠️ 歧义页通知⚠️
//由于该层级档案多次遭受修改，且受到了未知的DDOS攻击，许多数据遭到破坏，暂未修复。目前M.E.G.已将此前的多种版本归档于本文档中。请流浪者仔细分辨。
//M.E.G.档案部管理员-Yeller
//
//Level C-487层级资料版本1
//状态：本层层级资料的最初版本。
//
//隐藏版本1
// 
//
//生存难度：
// 
// 
// 
//Level C-487是后室层群C的第487层。
//
//描述：
//photo-1660041128546-bbb424728221?ixlib=rb-1.2.1&dl=alex-sh-NzcZYRhLVRU-unsplash.jpg&q=80&fmt=jpg&crop=entropy&cs=tinysrgb
//Level C-487的照片，其中可以看到发着蓝光的车。
//
//Level C-487的主要地形为一处宽度与高度无法测量的天坑，该天坑的可能是因陨石撞击而形成，四周被树木稀少的树林所环绕；有人曾报告说在树林内发现了微弱的黄色灯光，但尚未得到证实。除此之外，其天坑内部整齐的摆放着大量的废弃汽车，数目无法得到统计，初步估计大概数量已超过了1000万台，其车型全为老式的德劳瑞恩DMC 12。这些车的发动机大多遭到了拆除，唯有一小部分的车内部散发着蓝光，流浪者可以在里面找到大量的腰果苏打水。
//
//Level C-487内唯一的光源来自于天坑上空的“太阳”，散发着诡异单调的暗黄光。其光线照不到天坑外的区域，建议流浪者在探索时配备手电筒。
//
//值得一提的是，那些发着蓝光的车内都经过了改装，搭载了远超人类的科技系统。流浪者可以在里面看到画着“=(”的标志，如果流浪者试图擦除它们或者改成“=）”的标志，则汽车将会发出刺耳的警报声，流浪者会直接出现在一堆派对客面前。
//
//由于该层独特的氛围感，迎来了许多的流浪者来到这里进行打卡拍照，但目前该层级未能得到完全勘测，可能存在多种未知危险，随意进入该层级并不是一个明确的选择
//
//基地，前哨和社区
//该层级不存在已知的基地、前哨和社区。
//
//入口和出口
//入口
//有人声称他在Level 159中地铁运行时失足掉下轨道后就来到这里，但具体原因未知。
//出口
//切入一台内部发着蓝光的车即可传送到Level C-52。
//Level C-487层级资料版本2
//状态：由用户FuckingMEG_I_Ma_TOM上传，于发布1小时后遭到M.E.G.档案部管理员删除。
//
//隐藏版本2
// 
//
//生存难度：
// 
// 
// 
//photo-1660041128546-bbb424728221?ixlib=rb-1.2.1&dl=alex-sh-NzcZYRhLVRU-unsplash.jpg&q=80&fmt=jpg&crop=entropy&cs=tinysrgb
//Level C-487的照片，很多车是吧？那又怎么样，别来就行。
//
//Level C-478是后室层群C的第114514层。你们他妈最好别来这里。
//
//描述：
//Ţ̲̗h̞̱͜ͅe̡̯͕ m̧͕̯a̧̭͍̫̮i̢̠̬n̳̩͙͢ t̢͖̲̩̖̯e̡̘̮r̢̲̳̭͚r̢̳̬͓͉͇a̧̙̘̰i̧̪͓̜̥ͅn̢͓̪̝̲͇ o̡̗͈̫̤f̡͎̦͚̞ *̱̬͔͈͢*̧̩̠͚Ḻ̡̮e͙̦̫̙͢v̧̜̪̳ͅe̳̖̗̮͢ļ͎͙̳͇ Ç̖̫̳-̡͕̦4̨̩͎8̧͓̰̞̖7̨͍͎̤*̡͔͇̫*̧̥̖ i̝͈̦̗͢s̢̪̟͙ a̗͕̩̩͢ s̨͔̤į̜͖n̢̬͙͔k̦͖͙͎͓͜h̡̪̗͖o̙͇͜ͅḻ̢͙ȩ͙͈̭̩ w̮͙̱̠͢h̨̳̤o̧͎̞s̡̬̲̤͈̞ȩ͖͖ͅ w̢̥̖͚i̧̩͓̝̘ͅḑ̖̗̫̭̲t̲͓̤̗͢h͉̳̗͚͇͜ a̱͓̭̥͢n̢̰͙̞̬͍d̨͔̩̞ ḩ͉͓̗͙e͚͜ͅi̢͓͍͇ģ̗͇̣̥̬h̢͚͖͍t̢̠͈̝͍ ç̤̙̰̜a̢͇̯͙̠n̞͉̭͍͢n̡͓̦͈̞o̘̣̪̥̮͜t̨̰̣ͅ ḇ̢͕̭e̝̝̠̯͢ ṃ̭͔͢e͈̜̰͢a̲̯̗͈͔͜s̞̟̫̝͢u̜̖̮̠͜r͙̝͇͢e͇̲͢ḏ̢̗̥̪.̦͉͜ T̢͈̱h̢͎̗͉̟͈e̡̥̤͚̱͖ f̢͎̰̮o̥͇͜ŗ͔̳͕m̟̜̰͖͢ͅa̬͓͔̫͢t̘͙̞̯͜i̡̲̰̥̝̖o̬̬͜ṇ̡ͅ o̧͎̜f̧̥̞͖ t̡͉͚h̨͖̖e̜͍͜ s̡͇͉͎̝̣i̭͔̣͕͈͢n̯̥̱͜ķ̬͓̭̖ḩ̠͎o̗̜̳͜ͅl̢̙͇e͖̬͈͢ m̩̯͖̲̬͜a̡̙̝̗̗͓y͓̦͎͢ h̫͕̰͔̖͢a̡͎̙͕v̡͔͍̫̫ȩ͔̘̬ b̞͕͢ȩ̠͚e̡͎̫̫n̡̩̞ ç̜̦̲a̝̝͇͍͢u͈̯͢ͅs̡̞͙̩̲e͉̩̭͜ͅd̢̙̫͚͚ b̢͍̲̪̗̙y̤̗͜ a̙͖̲̞͢ m̧͕͙̯e̡̞̮̣̪t͙̮̬̙͢e̡̗̟̟o͚͓̞̝̖͜r̨̥̪̫̝į̝̜̱t̨̮̜͕̞e̝̤͢ i̡̱̰͙̤m̢̮͕̲̖p̥̝͜a̧̭̰͓͎̘c̲̜̣͜t̡̩̠.̧͍͍̲ Į͎̞͈̟ţ̠͚̗̟ i̢̥͇͈̟̙s̮͓͢ s̢̙̗̗ų̯̭͉̭r̡̜̜̮̪͎r̝̣͢o̧̪̦͈̰u̢̯͙n̥̣̱͍͢d̨̗̩̖̤͇e̡͎̯d̨̬͉̣ b͈̠̱̰͜y̡̱͚̰ s̨̝̤p͕̯̖̖͙͜a͇̟̤̩͜r̘͉͖͜ͅs̡̖̮̖e̡͉͈̲͍ w̢͓ͅo̢̦̗̮̗̱o̢̮̗̙̭d͖̙̪͢s̢̜̜.̡͖̲̜̯ I̡̟̬͚̬̜t̟̫̱̗͜ h̡̝͈̟̤̥ą̰̫͙̱̲s͙̟̘̦̮͢ b̧̪͈͖e̢̳̳̥͔͕e̡̥̰̯̝ņ̠̳̮ r͎͓̪͜e̠̙͜p͖̝̣͜ͅo̖̮͜r̯̭̳̟͢ͅt̨̲̪̖̪e͖̲̳͓͢ḑ͚̤̰̯ ţ̖͍͚̜h͍̤̤̝͢a͚̣͚͜ţ͍̳ į̱̠̜̯n̩̟̦͢ A̧̰̮ f̡̯͍̪a̡̪̩̪͎į̮̝͉̗n̬̭͜t̪͔͈͇̮͜ y̨͚̜͔͖̳e̮̭͚̯͎͢l̬̫͢l̳̣̜̥͜ͅo̧̠̙͇͙w̡͕ͅͅ ḻ̡̙̫͈͖i̢̭͈̳̮g̨̗̥͉̜ḩ̲͈͖̝t̖̰͚̲͢ h͕̩̯͢a̘̟̭̩̩͜s̡̲͍̤ b̨̖̗̠ę͚ͅe̢͓̟̥͉n̢͙͎͓ s̨͓̞p͕̰̤͜ͅǫ̤̦͚t̢̙̠t͓̲͖̤͢ę͙͎̬̲d̨̮̩̪ i̡̜͓n̖̫͜ t̬̟̣̯̝͢ẖ̡̣̥͇̫ę̙̳̭ w̧͇͓̟̯̭o̙̫͜o̢͙̬̳͍̯d͚̲͖̱͜s̢̖̳͇,̢̣͓̝̱ b̨͖̝̗̫u̧̝̭t̡͉̭͖͖̮ į͙̲̭t̢͍͕̮ h̢̥̱̰̬a̢͇̮̲s̗̖͔̳͙͜ n̡̯̮o̫̲͓͕͢t̢͚͖̯ ḇ̨̮̰͈̬e̜͎͚͜e̠̰͎͢n̨͔̣̣ c̡̳̞̯͉o̦̪͜ͅn͈̭͜f̧͇̤̭i̧͎̟̗̤r̝̫̣͜m̨̖̪̰ͅe̢͚̠͔d̢̬̙̤.͓͖͜ I͇̥̪͍͜n̡̪͈ a͔̲͔̘͢ḑ̙̟̱̯d̩̫̦̘͕͜i̡͔̳̠t̢͉͙̩i̧̩͚͍͕͍o̙̠͙̫̲͢ņ͙͙͙̟̯,͙̰̱͢ a̘̞͢ ļ̱̯̞͚a̡͕̲͖ŗ̰̜̩͚g̳̣͢e͙̝͎͚͜ͅ n̳̲͢u̫̬̭͢m̨̜ͅb̢̦͕̪͍̘ę͈͎r̢̮̯͇͖ o̢̥̫f̡̮̖ a̢̜̤̘͈b͇͖͜ạ̰͎̙̝͜ņ͉̥̝ḍ̢̪o̩͎͜n̘̖͔͇͙͢e̢͈̦̰̳͓d̨̫̲ c̡̩̮a̤̩͢r̡͓̜s̡̟̮̤̤ͅ a̡̲̘̳r̡̰̦e̘̲̬̙̯͢ ṇ̨͔͖e̡̯̰͉a̡̯̮ţ͙̲̬l̝̟̲͜y̦͉̦͢ p̡̳̜̠ͅl̨͓̭̜̟͔a̢͇̖͎c͙̩̦̖͉͢e̩̦͈͉͢ḑ͖̗͎̠ i̧̦̮̖n͎̪͓͢ș̡͉͉i̢̲͉̦̜ḓ̯͜e̡͎̙̮͕̲ t̨͈̤̦h̢̗̙̫ͅȩ͍͙̟̫ s͖̯͜ͅį̱ͅn̢̘̘̫̘͕k͙͚͜h̡̭͚͉o̝͎͖̙̙͜ļ̩̳͚͍̮ę̙̱,̦͈͢ a̧͓̲̯͇̝ṇ̨̟d̨̲̬̣ t̨͓̪͈͉h͈̬͎͜e̢̙͕͚̰ n̡͎̰̞u̢̬̤̙m̩̝̜̭͚͢b̡̮̝̜ȩ͇̘ṛ̨̖ c̨͔̦͔̣a̧̦͇̪̳ņ͔͉̲n̡͎̗̣͉o̡̮͓t̡̗̭̙ b̢̦̰e̠͇̰͈̘͢ c͈̜̰̬͜o̢͙͖̙u̧̙͇̜͈n̨͍ͅt̨̠͖e̲̖̖͜ḓ̡̣̟̘͙.̧̳̠ T̳̖͜h̢̙̣e̱̱̗̙͜ p̢̫͎̘r̨̠͎e͎̫̯̩̣͢l̡͚̠i̠̪͢m̧̭̜̲̘ị̰̗͇̪͢n̡̫̩̫̥a̡̜̦r̡̟̟͍̝y̡̠̳̣͉ ę̝͍̟̜̠s͈̳͢t͕͓̭͖̥͢i̳̟͜m̧͍̬̞a̡͖̬̮̗͍t͎̭͢ę̣͎̗͈ į̬̩̖͔̱s͎̦͜ t̨̙̘̞h̢̞͕̪͕̩a̳̦͕͢t̨͇͙ ṯ̡̗̠̫h̥͕͜ȩ̱͉̞̭ ņ̘̳̜ų̞̞̳̩̗m̧͚̤b̧͚͖͕̤e̡͈ͅr̨̟͕̤ e̢͓̞̘x͉̩̤͈͢c͕̫͜e̢̬̠̦̣ę͎͉͚d̢͉̰̞s̪͖͓̫̭͜ 1̡͓̮̲̫̪0̝̫̯͢ m̧̯̗͍̱̯i̦̩̤͜l̢͉̮l͉͕͜į̣̝̭̯o̮͔̱͇͢ņ̘̲,̤͙͜ a̧̦̟͔n̨̗̗̗̮ḑ̤̯̱͚̦ i̢̘̭t͚̳͜s̠͎̦̣̰͜ m̧̰͍̠o̧̭̮̰̦ḑ̙͔̳͔͔e̦͚͢l̢̠̝̱͔s͕̞̳͜ ą͚̦r͓̝͓͓͢ḙ͔͜ a͈͓̫̬͜l͈̫̣͈͢ḷ̦̝͕͢ V̢͍͉o̜̫̖͓͚͜l̡͈̭ķ̞̠͙̯̳s̩̰̳̝͜ͅw̢͉̝͇̜͙a̧͍̙̫͓g̨̮̣͚͕̳e̡̲̭̲̯̬n̨͕̳̗͉͇ S̗̦̘̣͜a̢̰̗̣̭ͅn̖̬̣͜t̡͖̞͍a̡͎͓n̢̤̪̝̠̦a̲̭͜.̢̯̱͍ M̲͍͕̠͢o̧̩̣s̢͈̱̠ͅt̡̟̥ o̢̠̰f̨̩͓̬̪̳ ţ͎̞h̩̣͙͢e̬͕̟͜ c̦̤̠͙͕͢a͇̟͢ŗ̦͇̣ṣ̯̯͢ h̪̬̩̫͜a̢̙̟͈ḑ̩̘̳͎ ţ̖̮̦ͅḩ̤̠͓͎e̢͖ͅį͇̱̭͖ͅŗ͔̱ e̢̲͎ņ̜͕̗͎̜g̨͈̪̖̥̱i̖̘͉̦͢ṋ̙̟̜͢e̜͙͢s̭̦͜ ŗ̦̟ȩ̲̭̝̘̝m̢̤̩o̧̤̰̭v̪̖̖̭̟͢e̢͎̟d̡͈̫͍͖̦,̡̩̦ͅ a̧̱͚n̢̬̠̲̫̩d͔̖͢ o͚̮͎̬̣͜n̨̟͇̜ļ̝̭͔͉̩y̡̥̤̝̪ ą̟̟̫̜ s̗̯̫͢ͅͅm̝̜͕̞̥͜ą̖̟ļ̦̲l̨͔̫͇̤ p͓͇͢o̮̥͙͉͢r͎͈̗͢t̨̫̗ͅi͖̜̯̯͍͜o̡̖͈̯n̫̣͜ o̧̯͎̬f͖̱͓͢ ţ̤̩͍̝ḩ͇͈̠͚e̡͙͙̮̝ c̨̭̣̮̤̰a̢͓͔͚r̢̝̳̫̦̖s̟̱͢ h̡̙̯̣ạ̧̠̙ͅd̡̩̬͖ a̢̬͎ b̯̪͜ḻ̢̝̪ṷ̢̪̙̰ȩ̦͖ g̢̤͙̠͔l̢͚̱o̘̤̟̜̲͢w̨̜̮ i͈͙̫̠͜n̡̙̗̣ͅs̖̳͕͇̤͜i̧̲̲̫̲͇d̢͔̜͔ẹ̢̬̙̳̳,̲̝͔͇͢ w̢͍̟͔h̢̙̤͔͍̭ḛ̡̘r̡̮̜̫̞̮e̮͎̥̬͢ h̡̥̜o̡͈̯̠̰̱m̡͍̰͎͈͚e̢͓̠̥l̡̪̱͈ȩ͓̠̟̣̣s̖̘͎̳͢s̨̳͍̠̪ p̢͚͇̖e̦͍͙̲͉͢o̘͇̳͈͜p̠͙͢ḽ̢͉͔e̢̯̝̖͔ c̢͈͖̠o̡͔̦̦̙͍ų͔̳͎l̨͎͖̰̙̖d̢͙̠ f͉͎̪͚͢i͔̖͕͉̗͢n̨̪͍̖d̡̳͍ ç͎̤̭̫͉o̢̲̟͍p̫͕̝̝͜i̞͙͢o̗̞͔̗̟͢u̢̗͎̪̯ͅs̳̥͢ a̧̟̲̰͎m͓̫͖͚͢ͅo̧͈̤̯͓̙u̢͚̗͉̠ͅn̢̬̤̟̘͈ṭ̢̳͍͚ş̥̳͈̭̭ o̡̟ͅf̢͙̦͈ c̢̜̪͔͕̮a̧͕͈̫ş͉̳̦h̢͈͙̟e̗͖͜w̜̤̤͜ ş̦͈̩̙o̰͖̯͓͢ḑ͕ͅa̧͉̤̪̝̠.̡͓̙͉̩
//
//为了让你们看不懂，我特意修改了数据，总而言之就是别来就行，去你妈的。还有你M.E.G.我知道你在看这篇文章，看到了以后提醒那帮蠢蛋流浪者不要来这里，封锁入口，烦死了，别打卡了行吗。小心我叫派对客来削你们=(
//
//F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚ F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚ F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚ F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚ F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚ F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚ F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͑̾̄̈̚
//
//F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚
//
//F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐
//
//F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚ F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚ F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚ F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚ F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚ F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚ F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͑̾̄̈̚
//
//F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚
//
//F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚
//
//F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚ F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚ F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚ F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚ F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚ F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚ F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͑̾̄̈̚
//
//F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚F͔͉͓̖̗̗͓̓̄̾̐̂͐̏u͉̲̝̩̠͖͒͊̑̋̀̑̚ͅć̟̖̝̰̤̇́̈́́̆ͅk͙̯̠̯̤̙͍͎̜̞͌̓̿̄ï̫̮͖̝̖̜̰̩̲̣̠͈̒̈́̋̆̀̆̈̊͊̓n͖̯̮͖͇̟̗̗̠͍̤̪͑̾̄̈͒͐̋̓̽̓̅̚g͕̭̤͉̱̮̿̑͗̂̑͑̔͐ M̟̝̪͔̍͑̏̋̈͒.̘̦̞̙͎͙̭̦̟̥́̾̑̂̂͒̐̀E̳̩̞̭͙͇̠̝̝͑̈̑̑͗͊͌͌̂͌̌͒.̖͎̜̠̃͊͐̀̌́̽͌͊Ḡ͙̰̭̗̳̫̃̓̽ͅ.̦͖͈̯̲̜̣́̉̉̒͛͒͐͑̚
//
//$⊥@¥
//
//∀ẘ@¥=(
//
//℉я☹м =(
//
//Ħℯґε =(
//
//基地，前哨和社区
//꧁滚꧂=(
//
//入口和出口
//入口
//s̲̤̞̱͜b͍̫̗͈̘̮̰͍̪̘̳͢ͅ M̨͇̝̣͓̞̥̯̤ͅ.͙̩͕͕̮̜̗̟͜E͍̠͓̩͙̲̪͢.̥̰̜̬̪̰̟͙͢G̢̰͔̝̬̭̥͕̦̩̥̳ͅ.̧̮̗̖̝͔ͅͅ D̦͎̗̝̲͎̱͇̞͢o̢͇͓̮͇̳͍̦͖n̨̗̞̤͎͉̗͙̟̞͎'̢̥̞̖̥̞͙͍t̯̙̖̤̟̥͉͓̤͓͖͜ c̨̳̮͉̝̞̙͖͈̠̞̙o̡̥͙͇̯̩m̨̲͖̱͈͇̜̩e̡͙̰̟̫̜̞͎͎͔̪ t͈͚͍̥̙̙͎͜o̧̲͕̭̦̲̩͉̬̤̣̤ͅ m̡͙̦͈̙̖͓̥y̧̙̩͈͚͇ F̢͍͓͍̤̮u̧̘̤̭̮͇͙̙̥͕̳͈̲ç͉͕̮͈k̞͈̭̖͇̦͉̘͢į͚̳̦͉̳̱̱͙ņ͉̙̙̰̞̤̗̳g̣̫͔̦̲̙̯͕̝͇̩͢ s̨͔͕͔͍ę̭͈̖̳̣͙̲̭̫͍͓c͕͈̘̫͎̪͢ŗ͈̣̬̲̙̤͔̟ȩ̠̠̪̙̲̣t̩̭̜͓͢ b̢̬̭̯͍̞̖̖̟͇͔ą̭̬̪̦s̨̙͎̬͙̲̖̯͇͓͈e̫̰̝̬̙͢.̨̙̦͔̲=(
//
//出口
//看到那些发光的车了吗？切入它们就可以离开了，别再他妈来了。=(
//你敢来有你好杏仁水吃。
//Level C-487层级资料版本3
//状态：在版本2被删除后由用户“M.E.G.我是你爹你再删我文档我就要测你码”重新上传，但同样的遭到删除了。
//
//隐藏版本3
// 
//
//生存难度：
// 
// 
// 
//photo-1660041128546-bbb424728221?ixlib=rb-1.2.1&dl=alex-sh-NzcZYRhLVRU-unsplash.jpg&q=80&fmt=jpg&crop=entropy&cs=tinysrgb
//Level C-487的照片，很多车是吧？这不好看！求你们了别来了行吗。
//
//Level C-478是后室层群C的第487层。求你们他妈别来了啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊。
//
//描述：
//Level C-487就是个超级大的天坑！就一堆车在里面，啥也没有了。这是宜居欺诈，有很多实体，比如说微笑者，和猎Doog。他们会狠狠的咬你的屁股，你的屁股会变成三瓣。这很恐怖的，最好不要来啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊
//
//切入那些发蓝光的车！！！！！腰果苏打水随便拿！！！！别来森林！！！！！！！！！！！！！！！烦死了啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊！！！！！！！！！！！！！！！！！！！
//
//基地，前哨和社区
//没有没有没有没有没有没有没有没有没有没有没有没有没有没有没有没有NOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO
//
//入口和出口
//入口
//别来了！！！！！！！！！！！！！！！！！！！！！！
//
//出口
//快给我切入那些发光的车！！！！！！！！！！！！！！！！！
//关闭记录
//勘察人员：M.E.G.档案部员工Jay和Eden
//时间：2022年7月7日
//探索地点：Level C-487中天坑周围的森林。
//
//记录开始
//
//Jay和Eden从Level 158中来到了这里。
//
//Jay：好的，记录开始。这次被M.E.G.奉命来调查Level C-487中的森林区域，希望还能顺便找到为何本层的文档为何总被篡改的原因。
//
//Eden：那就先去黄光目击点附近看看吧。
//
//Jay和Eden拿着手电筒，开始在森林内探索了起来。
//
//走了大约1个小时，没有发现任何的异常情况。
//
//Jay：看起来森林内没有任何的实体，你有感到任何的不舒服吗Eden？说不定这里可能会有精神影响。
//
//Eden耸了下肩膀。
//
//Eden：并没有，我只觉得很无聊。那些数据异常怕不是某些人的恶作剧罢了。
//
//Jay：但是修改数据的人居然能绕过资料库的安全系统，而且还进行了DDOS攻击！
//
//Eden：得了吧，再勘察下有没有什么异常情况就走了吧。M.E.G.这破差事，想转职到B.A.G去….嗯……后室娱乐公司也不错……
//
//Eden的手机响了一下，上面显示着WIFI链接成功。
//
//Eden：这鬼地方也有WIFI？写着什么？=( 是啥玩意？
//
//突然，它们看到了不远处微弱的黄色灯光，似乎是从一间小房子内传出来的。
//
//Jay：我们得过去看看。
//
//Jay和Eden蹑手蹑脚的来到房子周围，只听到里面传来了电子游戏声。
//
//Jay：我数321，到时候我们就闯进去。3…….2……1……
//
//Jay一脚踹开房门。
//
//Eden：里面的人全都不许动！
//
//房间内，可以看到小汤姆和从M.E.G.阿尔法基地失踪的小吉姆，它们面前摆放着一台正在游戏中的游戏机，旁边还可以看到正在发送DDOS攻击的服务器。
//
//Jay：都给我举起手来！还有你！小吉姆！你在这里干什么！
//
//小吉姆：我…我……（支支吾吾说不出话来。）
//
//此时，小吉姆身旁的小汤姆还想逃跑，但是被Eden擒住按倒在了地上。
//
//记录结束
//
//关于小吉姆和小汤姆的行为处分公告
//对小汤姆在最近两个月的种种行为（编造虚假档案，攻击M.E.G.服务器导致其完全瘫痪）。正式对其作出纪律处分。
//
//首次会议决定：捣毁小汤姆的服务器，即他在文档内所说的秘密基地。
//
//最终会议决定：介于小汤姆的服务器质量极高，适合M.E.G.的数据传输，目前已将此处作为M.E.G.档案部数据机房。同时，因《后室未成年实体保护法》规定，作为惩罚，将禁止小吉姆的每日的甜品与饮料供应一周，且没收小吉姆的电子设备，并罚抄：“我再也不到处乱跑了”100遍。直到他认识到自己的错误为止。
//
//若有下例，严惩不贷。
//
//望周知！
//— M.E.G.档案部管理员-Yeller
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1487{}