//Level C-415
//评分: 
//+13
//+
//–
//X
// 
//
//生存难度：
//等级 3
//
// 
// 
// 
//Level C-415是后室C层群的第415层。
//
//描述
//Level C-415是一个大小不定的大型地下墓穴，尽管大多数研究将地下墓穴的跨度定为 130 至 160 英里宽。没有任何已知的进入 Level C-415的冒险超过这个距离。
//
//Level C-415的大部分都是狭窄的石头隧道，通常呈黄色或灰色。它们似乎是手工雕刻的，经常在可以找到一个或多个空石棺的小十字路口相遇。有时，这些石头隧道会通向大型开放的洞穴，其中包含许多隧道入口、棺材和泉水池。这些较大的十字路口通常是通过向任何方向走很远的距离来发现的。
//
//ancient-1407678_1280.jpg
//Level C-415
//
//饮用后者池中的水是无害的。烟雾从这些水池中升起，但原因尚不清楚。
//
//地下墓穴不遵循时空的标准模型，而是以非线性方式弯曲和扭曲。因此，个人很可能会发现自己离他们进入的地点不远。迷失在 Level C-415的人也经常观察到似乎违反已知物理定律的不合逻辑或其他异常特征。Level C-415的许多通道将打破重力，允许流浪者在天花板或墙壁上行走，直接在地下墓穴的另一部分上方或附近。
//
//因此，所有创建 Level C-415地图的尝试都被证明是无效的。
//
//大多数被困在 Level C-415的人员报告说空气中有一股明显的灰烬气味，尽管目前尚不清楚这种气味的来源。在某些情况下，这种气味非常强烈，以至于导致感官脱敏。上述水池升起的烟雾中也有灰烬的气味，但这种气味没有泉水也能存在，所以很可能不是它的来源。这种灰烬被认为会导致那些持续接触灰烬的人出现短期记忆丧失，但没有证据证明这一说法。有时可以发现笑魇在 Level C-415的隧道中游荡。
//
//位于 Level C-415多处的空石棺大小不一，用途不明。那些在Level C-415长时间丢失的人声称这些棺材是“禁止的”，这可能意味着他们拥有一种迫使其他人远离的光环。棺材被禁止的原因尚不清楚，在 Level C-415遇到过棺材的人都无法克服这种认知警告。
//
//基地、前哨与社区
//该层级暂无任何基地、前哨或社区。
//
//入口与出口
//入口
//在Level C-67倒立10分钟。
//在Level C-414死亡可以进入。
//在Level C-416进入一扇深绿色的门。
//出口
//在黑暗的、没有照明的隧道中游荡足够远，偶尔可以将流浪者带到 Level 6。
//找到一扇铁门，可以到随机的危险层级。
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1415{}