//Level C-400
//评分: 
//+18
//+
//–
//X
// 
//
//生存难度：
//等级 3
//
//不安全
//不稳定
//精神影响
//Level C-400是后室C层群的第400层。
//
//描述
//Level C-400是一个面积有限的层级，它由两个部分组成，分别为一个类似于教堂的室内空间，和一条长度未知的走廊。鉴于该层级没有高价值资源但有颇为危险的精神影响，我们建议流浪者避免进入该层级，试图进入该层级者可自行进行M.E.G.的精神健康水平测试和“绝对衰亡阈限”测试，未达标者不建议进入该层级。
//
//教堂
//该区域是Level C-400中唯一可供多人同时进入的区域。正如其名所言，其表现为一个面积约800㎡、层高约50m的大型哥特式教堂。教堂外观老旧，内有长凳、布道台等摆设，但均因为时代久远和疏于维护而显得肮脏破败，各种壁画和装饰也被严重磨损，无法确认具体内容。教堂内唯一的光源是教堂外部的白色虚空，因此教堂整体环境昏暗，进入这一区域的流浪者常常把这里的气氛形容为“压抑且阴暗的”，“仿佛正在举行某人的葬礼”，并因此感到压抑和不安1。鉴于该区域容易让流浪者情绪低落，而较低的精神健康状况将使流浪者更容易受到长廊的吸引，我们建议流浪者尽量避免在该层级停留过久，并在停留过程中备好足量的杏仁水。
//
//教堂中随机散落着一些大小不等的十字架雕塑，但值得注意的是，这些雕塑的主题并非前厅中教堂内常见的“耶稣受难像”，而是描绘了一位老人被捆绑在十字架上的图景。这些老人的性别、服饰、体型、姿态各不相同，唯一的共同点是他们都半闭着眼睛、表情安详。有传言称这些雕塑的原型为于此层级失踪的流浪者，被长廊燃尽的受害者将被制成雕塑供人悼念。凝视这些雕塑超过半分钟将使流浪者陷入强烈的悲伤中，严重者会因此进入悲尸循环。虽然这一影响可通过服用杏仁水进行缓解，但M.E.G.依然建议流浪者远离这些雕塑。
//
//布道台后方设有一扇残破的黑色木门，与其破败的外表相反，该木门展现了超乎常理的坚固性，其无法被任何已知方式破坏。用其他物品堵住木门或将木门封闭固定也是不可能的，一切用于固定木门的材料都将飞速老化，并在五分钟内化为一堆灰尘。打开木门即可进入该层级的第二个区域：长廊。
//
//嘿，等等，你确定要跨过这道界限吗？在门的这边，你尚且还可以作为一位宾客旁观葬礼，可若是走进了这扇门，你便将成为这场葬礼的主角。你，真的要这么做吗？
//
//来吧，跨过门槛，做一场漫长的衰退之梦吧。
//
//长廊
//长廊是一条长度未知、结构可变的走廊，其具体结构和内部设施会随着进入其中的个体而变化，若站在打开的门外观察该区域，则会看见一片不停翻涌的灰色迷雾，其中不断闪过各种随机的画面片段。值得注意的是，这一区域似乎只对有自我概念的个体敞开大门2，且每个进入的个体都不会在长廊中看见任何除自己以外的活物。推测该区域可能拥有多个副本，其会将进入的个体平均分配到这些副本中。
//
//长廊的具体结构会随着进入其中的个体而发生变化。其外表与受害者正在燃烧的记忆相对应，例如，当长廊正在吞噬个体关于学校的记忆时，其将表现出学校走廊的样貌。其长度则与个体的行进速度有关：无论个体的行进速度是多少，个体总是需要六小时左右才能走完全程。受害者能且仅能通过走出木门的方式离开长廊，所有翻越长廊两侧的“墙壁”、破坏“墙壁”、拿走“墙壁”上的摆设（例如货架上的货物、墙上的挂画等）的尝试无一例外均失败了。长廊的所有结构，包括摆设在内，均展现出了违背常理的坚固和稳定，人类已知的手段几乎无法影响它们。
//
//长廊的尽头为一个放着棺材的灰色房间，棺材后悬挂着个体的黑白遗照。走完全程的个体将自行躺进棺材里，然后棺盖合上，个体随之消失无踪。在个体消失后，教堂内将会响起一段模糊不清的哀乐，随后布道台上出现一盘录影带。录影带中存储着一段视频，内容为个体走完全程的影像记录。至今为止，M.E.G.已于布道台上发现了数十卷录影带，本文档中所有关于长廊的描述皆来源于这些影像。
//
//作为该层级最危险的区域，长廊拥有两个广为人的异常特性：
//
//吸引
//长廊的第一个异常特性被称为吸引，即它会周期性地对层级内所有流浪者进行影响，令其产生进入长廊的冲动。通常，这种冲动并不强烈，但若流浪者精神状况不佳3，则效应对其的影响会忽然增强到几乎无法违抗的程度，具体表现为个体的情绪突然变得非常激动，不顾一切地想要进入长廊，对阻拦者则会使用包括但不限于辱骂、欺骗、暴力行为、威胁自残/自杀等手段进行对抗。
//
//这一效应在个体进入长廊后将会持续存在，且会随着个体的前行而不断增强，其具体表现则改变为引起个体强烈的安宁感和怀旧感，让个体产生“仿佛回到了最熟悉的地方”的感觉。此时的个体将不顾一切地向长廊尽头行进，因为其会认为“长廊的尽头就是家，我日思夜想的家”。由于不断增强的吸引效应和不断被磨削的自我，个体在长廊中越是前进，其生还的可能性便越是渺茫。目前为止，尚未有任何进入【stage 2】的个体归还的报告。
//
//燃烧
//长廊的第二个，也是最臭名昭著的异常特性被称为燃烧，即随着个体在长廊中前行，个体的一切都将被缓缓燃烧殆尽。从个体对自身经历的记忆，到个体所掌握的各项知识和能力，再到个体的人格、感情、自我概念、逻辑推理、抽象思维等基础心理功能。当心智被全部燃尽后，只剩下一具空壳的个体将跌入长廊尽头的墓穴，就此消失无踪。即使个体成功逃离长廊，由该效应造成的失忆和大脑功能受损也是无法逆转的，因此我们建议流浪者无论如何也不要进入长廊。
//
//该效应的具体表现为：当个体在长廊中行进时，长廊两旁将刷新出各种物品，这些物件的形态和种类不定，但它们都代表着个体的某段记忆。当个体靠近某件物品时，该物品将立即被点燃，并在约五秒后化为灰烬，与此同时，个体对应的记忆也将不复存在。在旅途后半段，个体的自传性记忆几乎已全部被燃烧殆尽，此时物品所代表的事物为个体的各项认知技能与心理功能，点燃这些物品将造成无法治愈的精神残疾。物品燃烧时产生的火焰温度很低，并不会将人烧伤，但相对的，也没有任何手段可以阻止燃烧。
//
//值得注意的是，个体的失忆似乎遵循【由近及远】、【自浅至深】的顺序，即个体总是会先遗忘最近的记忆，再遗忘更久远的记忆；先遗忘记得不牢、无足轻重的记忆，再遗忘更深层、更重要的记忆，对脑功能的损害则被放在了最后。尚不知这一顺序有何意义。
//
//安息之旅
//经过对录影带的分析，M.E.G.发现个体在长廊中的行进过程通常可以被分为三个部分，它们被统称为安息之旅。以下为一次典型的安息之旅流程：
//
//
//Stage 1
//
//Stage 1：这只是一段燃烧的回忆
//这只是一段燃烧的回忆乃受害者在长廊中所经历的第一个阶段，包含了整个流程中的前两个小时。在个体走入长廊的一瞬间，长廊中总是会响起一段由前厅音乐人The Caretaker创作的歌曲《it's just a burning memory》，该阶段也因此得名。在这一阶段，长廊将如上文所述般变化为受害者回忆中的模样，其燃烧的对象多为受害者较近期的、较浅层的回忆，而吸引效应所带来的依恋感与怀旧感也将随着流浪者向前行走而不断增强，这将使受害者离开长廊变得更加困难。此时受害者的回忆将以其印象最深刻、使用最多的物品的形态出现，如打火机、手枪、玩具熊等。这一阶段回忆燃烧的速度是最快的，这些物品将以每分钟5到10个的速度刷出，在回忆燃烧得最激烈的时候，受害者常常可以看到整个走廊都被昏黄的火焰包裹，记忆的灰烬四处飘扬，场面蔚为壮观。
//
//在【stage 1】初期，长廊的外表总是显得稳定、精致且逼真，归还的流浪者们将其描述为“与我曾经走过的那些层级几乎一模一样，除了是空的以外”。随着受害者的不断前行，长廊的结构也将变得更加错乱，其具体表现为模糊不清且缺乏细节的表面，异常增生或缺失的结构，突兀尴尬的摆设，图画和文字变得无法理解等。这一变化十分缓慢和难以察觉，且吸引效应也会使受害者倾向于忽略这一变化。即使是那些精神状况良好、感知觉较为敏锐的受害者也常常需要“6分钟现象”的协助才能发觉环境的扭曲，而更多的受害者则会继续无知无觉地走下去，沉浸在越来越强的怀旧感和安定感中，走向自己的终焉。
//
//ac0890cfe65c6f27.jpg
//处于【stage 1】后半段的长廊，表现为受害者生前所就职的超市。注意其不合常理的外形和缺乏细节的表面。
//
//“6分钟现象”
//经过了对归还者的采访以及对录像的分析，M.E.G.发现进入长廊的受害者总是会在旅途的第6分钟左右感到明显的违和，这一过程通常被描述为“猛地打了个寒颤”，“突然发现这一切都非常不自然”。此时，那些精神状况较好的受害者将被该现象惊醒，在一段时间的迷茫后选择原路返回，而精神状况欠佳的受害者则将在一瞬间的呆愣后继续自己的旅途。受害者此时的选择几乎决定了自己能否或者走出长廊。
//
//经过调查和分析，研究者们认为有许多因素促进了“6分钟现象”的产生。当安息之旅进行到第六分钟时，吸引效应还未达到能有效影响受害者神志的强度，燃烧效应亦无法对受害者的认知能力造成重大伤害。但此时长廊的缓慢扭曲已经进展到可被受害者察觉到的地步，且受害者也会慢慢开始发觉自身的记忆出现了不自然的缺损。在这些因素的共同作用下，受害者将会进入惊恐状态，并短暂地从吸引效应中摆脱出来，进而迅速发现自身所处环境的“不自然”之处。
//
//在系统研究了所有这些导致“6分钟效应”的因素后，研究者们提出了绝对衰亡阈限理论。绝对衰亡阈限是一种心理量，其被定义为“刚刚可以引起个体对自身‘衰亡’的察觉的最小刺激量”，而所谓“衰亡”则被定义为“个体的记忆、意识状态、认知功能出现非自然的模糊/缺损，或缺损的进展不自然地迅速”。该心理量的值是决定个体能否从长廊中归来的重要因素：绝对衰亡阈限较低，即较容易察觉到自己正在“衰亡”的个体将更早遇到所谓“6分钟现象”，从而从长廊中幸存，而绝对衰亡阈限较高，即不太容易察觉自己正在“衰亡”的个体则很有可能成为该层级的牺牲品。除此之外，该心理量还可以有效预测个体对其他“自我意识磨削”类异常精神影响的觉察能力，最典型的如Level 404中神性实体的影响、Level 200的怀旧陷阱等。目前，研究者们已推出绝对衰亡阈限的测量方法，该方法拥有较高的信度和效度，流浪者可放心使用。
//
//低语声
//在安息之旅的第一阶段，受害者有时会听见长廊深处传来来历不明的低语声。大部分低语声都与受害者的母语一致，而声线则多种多样，没有明显的规律。其内容常常是怪异和不明所以的，但大致含义似乎总是与流浪者当前正在燃烧的记忆有关。以下为部分摘录：
//
//1.
//抑 郁 者 常 焦 虑
//非 狂 喜 即 暴 怒
//备注：这段语音来自一盘被回收的录影带。该语段被众多声音一起朗读，声音拖沓且缺乏感情。彼时长廊之外形类似于一栋教学楼的走廊，通过走廊上的窗户可以看见两旁宽阔的阶梯教室。推测其原型为受害者所就读的大学。
//2.
//哇哦，玫瑰色墙纸，适合在温馨的炎症里慢慢腐烂~~❤
//
//备注：这段语音来自一盘被回收的录影带。该语段似乎为一句广告台词，其被该受害者自己的声线用十分轻佻和虚假的语调读出，并伴随着风格温馨但明显跑调失真的背景音乐。彼时流浪者正经过一条铺着原木地板和粉红色墙纸的走廊，推测其原型为受害者切入前就职的家居城。
//3.
//啊啊啊啊啊啊啊~♪我是多么的喜欢我~自~己~♪啊啊啊啊啊啊啊~♪
//
//备注：这段语音来自受害者口述。受害者称这段语音的声线听起来神似自己的前女友，由于燃烧效应，受害者已忘却前女友的具体信息。该语音极度浮夸和戏剧化，“连说带唱，就跟在唱歌剧似的”，且语段中的“我自己”三字在当时听来就像受害者的名字。彼时受害者正走过一条夜晚的公园小道，受害者称自己就是在这里与前女友分手的。
//4.
//亲爱的旅客您好，我们很抱歉抱歉抱歉地通知您，您的生活分崩离析颠倒梦想泡沫梦幻支离破碎破碎破碎破碎破碎，请注意保持哀伤，直到您开始尝试着杀 死 您 自 己，再见。
//
//备注：这段语音来自一盘被回收的录像带。该语音似乎为客运站内的广播通告，为一个机械且冰冷的女声，且多有卡顿和失真。彼时受害者正在通过一条光线昏暗的通道，从四周装潢来看这里的原型似乎是某座汽车客运中心。
//5
//温【无法辨识】，你在哪里……求求你了，快回来吧，我们，我们一直在等你……
//
//备注：这段语音来自一盘被回收的录像带。该语音被一个苍老的女声说出，其声线沙哑憔悴，且带着无法抑制的抽泣声。彼时受害者所处的地点为一条黑暗破旧的城市小巷，且经过研究人员仔细分辨，这位受害者的外貌体型与在Level C-284失踪的流浪者温██非常相似。
//值得注意的是，听到这段语音的温██表现得极其激动，其立即挥起自己的登山杖并用力击打身边的墙壁，随后墙壁爆发出一阵刺目的白光，录像中断。这也是唯一一例被中途打断的录像带实例，尚不知其缘由。
//哎呀，不过是同事间的小小玩笑，何必这么生气呢，眩病月。
//
//
//在【stage 1】的最后，受害者将看到长廊尽头出现一扇门，它的外形是随机的，可能是铁门、木门或防盗门，但它们有一个共同特点：无比破旧。此时受害者的意识和自我都已经被磨削到了极限，在吸引效应的影响下，受害者通常都会打开这扇门，进入安息之旅的下一个阶段——即【stage 2：h0Me.】
//
//啊哈，在旅途的最后他如愿以偿地回到了家，真是一个温馨的故事。
//
//
//Stage 2
//Stage 2：h0Me.
//注：由于进入【stage 2】的受害者无一例外全部牺牲，因此自此开始所有信息皆为分析录像带得知，可能有失真或错误的部分，敬请谅解。
//
//h0Me.是安息之旅的第二个阶段，也是整个旅途中时间最短的阶段——仅有30到45分钟。虽说如此，但该阶段对受害者造成的伤害依然不可小觑，在这一阶段，受害者将失去自己最重要、最根本的记忆，如重要的早期经历、对重大事件的记忆、后天所掌握的知识技能，甚至是受害者的人格和自我概念。此时，燃烧效应将发生变化，虽然其温度依然不足以烧伤受害者，但其产生的火焰已经开始有能力对长廊的结构产生影响。此时的受害者常常可以看到物品燃起的火焰点燃了整个走廊或房间，并将其烧成灰烬。自己记忆里最熟悉的地方在老旧泛黄的火中倾颓消散，这是一幅多么美丽的场景啊。
//
//8f34b8bccd9d2bf3.png
//一个h0Me.实例，图像上的文字为层级异常效应的结果。注意其怪异且违背常理的结构。
//
//蓝天，阳光，草地，家 ？
//当受害者打开【stage 1】尽头的大门时，其将发现自己身处于一片一望无际的大草原上，阳光明媚，天气晴朗。受害者前方不远处将出现一栋房屋，在所有的案例中，这些房屋都被严重地扭曲了，它们表现出一些十分怪异的结构，如不合常理的形状、材质错误的外立面、形态怪异甚至缺失的窗户和门、不自然的阴影等。但在发展至巅峰的吸引效应影响下，受害者将忽略一切不合理之处。他们会将眼前这栋极其扭曲的建筑视作自己的家，并欣然前往。
//
//值得注意的是，当进入草原时录像画面将被某种异常效应所影响。其具体表现为：画面的分辨率降低、饱和度提高，且开始不规律地出现红色的英文单词或短句。这些英文的内容通常为“Home”, “Wellcome to your home”, “Come and stay here”，以及其他意思相近的句子。这些英文，特别是“home”这个单词，常常出现一些随机的错误，如错误的大小写、字母被形态相近的其他符号代替（如字母“o”被替换为数字“0”）、意义不明的标点符号、不合理的空格等，这个阶段也因此得名。有时，画面上会出现一些奇怪的黑色团块，团块上标有一个白色的“？”，尚不知其含义。
//
//经过短暂的行进，受害者将到达建筑前方。“走进建筑”这一行动常常是迅速且没有任何犹豫的，即使有时门的结构并不适合人类通行，或者干脆就没有门。此时受害者将进入【stage 2】的第二个子阶段：你的家或者别的什么东西
//
//你的家
//当受害者走进建筑后，作用于录影带图像的异常效应消失，而受害者则将进入一个阴暗的、结构混乱的空间中。
//
//建筑内的布局和摆设类似于一栋典型的住宅，且装潢风格较为老旧。这里的整体气氛是压抑且阴暗的，其内饰和家居多有老化褪色，采光略显阴暗，且内部结构如其外表一般充满了不合常理之处。形态扭曲甚至互相切入的家具在这里屡见不鲜，房间内的空间结构和表面材质屡屡出现错误，房内的摆设和装饰品也常常是怪异和令人不安的。房间与房间之间的连接具有显著的非欧几里得空间特征，即使原路返回，受害者也几乎不可能两次进入同一个房间。且建筑内空间的总面积与建筑的外观明显不相符，一栋外观上只有两层的小别墅可能内藏数十层楼，一栋面积有限的单身公寓也可能拥有三四十个房间。但在吸引效应的影响下，受害者将忽略这一切不合常理之处，他们会将这里视作自己的家，并继续向前行走。
//
//8efc657ce85382b4.jpg
//你的家内部。可以注意到即使窗外阳光明亮，室内依然光线昏暗，原因不明。
//
//随着受害者向前行进，房间内的空间结构和家居摆设将会变得越来越巨大，在h0Me.的后半段，受害者几乎只有桌子的一半高。与此同时，受害者的脚步也将随之变得愈发跌跌撞撞，负责分析录像带的研究员将其形容为“就好像他们忽然回到了小时候，忘记了自己该怎么走路”。此时房间内将出现许多人形的巨大黑影，它们的身高几乎是受害者的两倍甚至三倍，其外貌细节是模糊难辨的，甚至难以辨别出是男是女。它们将在房间内四处走动、谈话、摆弄房间内的陈设，但似乎都倾向于忽略受害者，而受害者也总是对它们无动于衷。它们使用的语言似乎并不属于我们已知的任何一种，因此我们尚不知这些对话的详细含义。
//
//值得注意的是，此时受害者的回忆将以某种信息载体的形式出现于房间之中，如相片、日记本、报纸、电子屏幕等。这些信息载体上显示的图像、文字或视频似乎总是展现出受害者一生中最重要的时刻，如大学毕业时的合照、失恋时痛哭流涕的影像记录、与父母一起去游乐园玩耍时写下的日记、以受害者遭到了某种暴力侵害为主题的新闻报道等。这些信息几乎都出现在受害者容易注意到的位置，然而由于吸引效应的影响，受害者总是倾向于忽略它们。当受害者从这些信息载体旁边走过而对它们视而不见时，这些信息载体将燃起昏黄的火焰，并将受害者身后的房间一并点燃烧毁。此时录像带中往往会传出模糊的哭泣声，但受害者似乎无法听到这个声音。尚不知这是针对录像带的某种异常效应，还是吸引效应在诱导受害者无视哭泣声。
//
//受害者在h0Me.的最后一站总是一间婴儿房。其色调和装潢布置总体上是温馨可爱的，但由于h0Me.的异常效应，这个房间的陈设和结构也多有扭曲怪异之处。房间尽头有一个装饰华丽的门户，门框正上方镶嵌有一颗巨大的红宝石，其余部分则充满了金黄色的繁复花纹，其门口则被两块厚重的、肉粉色的长帘遮住，难以看清内部构造。受害者将进入门户，从而开始自己的第三段、也是最后一段旅程：【stage 3：还乡之路】。
//
//Stage 3
//Stage 3：还乡之路
//还乡之路是安息之旅的第三部分，是最漫长的部分，也是最乏善可陈的部分。其包含了旅途剩下的三至四个小时，然而与前两个阶段不同，【stage 3】的长廊几乎不会在结构上出现任何显著的变化，也不会出现任何奇特的现象。受害者将持续顺着长廊前行，烧尽自己的自我和灵魂，直到回归宫殿之底。
//
//在第三阶段，长廊的外形将变化为一个阴暗的、破败的走廊，走廊两旁存在一些敞开的大门，但大门背后仅有一片漆黑的虚空。由于上一阶段的燃烧效应，此时的受害者往往步履蹒跚、东倒西歪，但他们似乎从不会在第三阶段摔倒，即使走廊地板上充满了石块和杂物。推测这可能也是吸引效应的作用。
//
//d0ba6d298c743579.png
//还乡之路。沿着长廊行走，你将回归原初。
//
//研究者们推测，第三阶段主要燃烧的部分是受害者的基础大脑功能。从较高等的逻辑能力、推理能力、想象能力等，到较低等的知觉环境和自身的能力、时空间定向能力、言语能力、运动能力等，最终受害者将忘却呼吸，回归赤子之身。此时长廊中刷出物品的频率将变得非常慢，平均每十到二十分钟刷出一件，且刷出的物品将变为模仿受害者外形的、姿态各异的洋娃娃，似乎代表了受害者各种不同的心理功能。
//
//值得注意的是，在还乡之路后半段、一个姿态为“站立行走”的洋娃娃被烧毁后，受害者会忽然跌倒在地，即使彼时他们面前没有任何障碍物。跌倒后他们不会试图爬起来，而是维持着跌倒的姿势继续向前爬行，直到他们到达下一个洋娃娃，也即姿态为“伏地爬行”的洋娃娃。当这个洋娃娃也被烧毁后，受害者将再次摔倒在地，随后他们不会起身，而是开始以一种诡异的姿势在空中“游泳”，一直游到终幕。有研究者将这种姿态形容为“就好像羊水里的胎儿”。尚不知这是否是吸引效应的一种表现形式。
//
//终幕
//这里是长廊的终点，也是安息之旅的最后一站。在这个房间里，受害者将迎来他们的终幕。
//
//如前所言，终幕是一个巨大的、灰色的、装潢类似于东亚地区“灵堂”的房间，与外部的陈旧破败不同，终幕总是崭新且完好，且没有任何扭曲错乱之处。终幕内设置有花圈、灵位、空白的遗像、空无一物的棺材等设施，遗像前整齐地摆放了许多排桌椅板凳，供参与葬礼者悼念死者。
//
//当受害者进入终幕后，灵堂内的设施将发生变化。原本空白的遗像上将出现受害者的黑白照片，且照片上的受害者总是极度衰老。灵位前的座位上将出现大量黑色人影，它们与h0Me.中的黑色人影类似，不过大小正常，且似乎都在低声交谈或呜呜哭泣。灵堂中将开始播放一首丧曲，这首丧曲与教堂中响起的丧曲似乎是同一首，不过其歌词清晰可辨，音质也没有损害，然而目前为止我们并未知晓这首丧曲的歌词含义，因为其所用的语言是完全未知的。
//
//受害者们最后的表现总是相似的。进入终幕后，受害者不会因周围环境的变化而做过多停留，他们通常会迅速地躺进空棺之中，任由棺盖在自己面前合上。彼时，厅堂内的哭泣声和丧曲声将到达最高潮，然后，影像结束，受害者也就此不知所踪。
//
//
//采访
//为了帮助流浪者们更好地理解Level C-400的异常性质，我们将一段针对幸存者的采访放置于此。
//
//采访时间：2022/8/20
//采访地点：Level 11，研究员林娜的办公室。
//采访者：林娜，隶属于M.E.G.的研究员。
//受访者：Sarah（化名），从Level C-400生还的幸存者。其进入Level C-400前曾担任“导火索”某小队队长。
//
//（影像开始）
//（Level 11里的某间办公室中，研究员林娜正在整理自己桌上的文件。忽然，一位红头发的白种人女性闯进了办公室大门，她抹着汗水喘着粗气，似乎来得非常急。）
//
//Sarah：（气喘吁吁地）抱，抱歉！我，我迟到了吗？
//
//林娜：哦不，亲爱的，你来得很准时，就像以前一样。
//
//Sarah：哈，对，对不起，我，我从那里回来了以后就一直，一直，记忆力有点糟糕，喜，喜欢忘事儿，哈，哈哈。
//
//（林娜转过身倒了一杯水，放在身前的桌子上。）
//
//林娜：那真是太糟糕了。来，喝口水缓缓劲，我们开始吧。
//
//Sarah：呃，好，好的……
//
//（Sarah迟疑地坐在桌前，看上去有些拘谨。）
//
//林娜：哈哈，不用这么紧张，只不过是一个简短的小采访而已，你就当在和我聊闲天。（翻了翻手上的文件）那么就从这个问题开始吧，最近过得怎么样，Sarah？
//
//Sarah：呃，还，挺不错的吧……基地里的大家对我都很友善，自从我从……从那里回来了以后，他们就特别关心我，都让我有点受宠若惊了，哈哈。就是，呃，有个小问题。
//
//林娜：小问题？
//
//Sarah：他们好像特别喜欢问我还记不记得他们，有没有想起来点什么。可我完全认不出他们是谁，要是我实话告诉他们，他们又会很伤心，所以我有时就不得不……呃，你知道的，编一些谎话，装作自己已经想起来了。这感觉，就，嗯，不太好。
//
//Sarah：然后就是，其中有个红头发的小姑娘好像对我特别……在意？我，我脑子有点笨，形容不太来这种感觉，但……怎么说呢，她来找我的次数是最多的。她面对我的时候会强颜欢笑，转过头就开始偷偷抹眼泪，要是我说我不认识她，她就会一边哭一边跑远，看着真叫人心疼。
//
//林娜：抱歉打断一下，你说的那个姑娘，是不是……身材特别高，大概一米六左右，年龄十三四岁，然后脸上长着一片雀斑？
//
//Sarah：呃，是的，你怎么知道？
//
//林娜：（垂下眼眸，翻着手上的档案卷，没有回答问题。）好了，那么下一个问题，你认识我吗？
//
//Sarah：（笑了笑）哈哈，别吧，你也要来这套啊。我们今天应该是第一次见面吧？
//
//林娜：……（看着手上的档案，没有说话）
//
//Sarah：呃，是这样吧？
//
//林娜：（沉默片刻后）嗯，确实。那下一个问题，你能说说你在长廊里遇到了什么吗？
//
//Sarah：嗯，让我想想……当时我进入那个地方的一瞬间，我还以为我回到基地了，那个地方看上去和我们在Level 11里的基地一模一样，唯一的区别就是那里只有一条走廊，而且什么人也没有。开始我在想，我是不是遇到了最近大家一直在传的那个什么“过渡层级”，然后我就一直往前走想走回基地，结果我就遇到了一些……嗯，一些很奇怪的事情。
//
//林娜：很奇怪的事？能详细说说嘛？
//
//Sarah：走廊两边摆着很多东西，有武器、防弹衣、背包、安全绳之类的，墙上还挂着好多工作证。我走过去想仔细看看，但我一走到它们身边它们就开始烧起来了。那个火看上去有点不正常，它的颜色很……昏暗，你知道的吧？就是感觉它没有温度，也不会发光，它的质感就像那种放了很久的老照片一样，很陈旧，还有点发黄发脆。现在想想那个场景还是很诡异的，整个走廊都被那种昏暗的火焰包围了，灰啊碎片啊到处都在飘，就跟世界末日了一样。但当时我居然没什么感觉，就觉得啊这不是很正常的嘛，要是我能早些发现就好了，唉。
//
//林娜：这不怪你，这是那个层级的异常效应，它会让你忽略所有异常情况继续前行。然后呢，你是怎么摆脱这个异常效应的？
//
//Sarah：摆脱……也不能算摆脱吧，只是忽然我就意识到那里不太对劲而已。
//
//Sarah：我当时越往前走，越觉得这个地方非常奇怪，基地的地板漆是白色的，但那个地方啥颜色都有，而且墙上的瓷砖也贴得乱七八糟的，东缺一块西缺一块。走着走着我走到了一个像是我家的地方，那个地方，呃……
//
//林娜：那个地方怎么了？
//
//Sarah：你知道的，我家的墙上挂着一幅油画，画的是一个美女坐在椅子上，那里也挂着一幅，但那美女只有……只有一半。呃，我的意思是，她被活生生地从上到下劈成了两半，她的内脏和血从断面里淌出来，流得满地都是。
//
//林娜：哇，听起来真吓人，所以是那副怪异的画把你吓醒了吗？
//
//Sarah：也不完全是。走着走着我看见了一个背包，一个红色的大容量旅行包，里面装着杏仁水，肉罐头，还有好多巧克力糖。我当时……我当时在想什么我忘了，可能是想收集一些资源吧，结果我一走过去它就烧起来了。那个火燎到我的时候，我忽然就特别伤心，然后就开始哭，眼泪止不住地流。我的心好像缺了个口子，它好冷，好痛，就好像数九寒冬的雪风往心口子里灌。说实话，这辈子我都没有那么伤心过，我立马从走廊里跑出来了，因为我觉得……我觉得我不能走下去，外面有人在等我。
//
//林娜：然后呢？你有没有找到那个等你的人？
//
//Sarah：（沉默片刻，苦笑）哈哈，没有啦，你们不是说了吗，我已经严重失忆了。我不知道他是谁，我连他是男的女的都不知道。说不定他其实根本不存在，只是我的求生意志形成的一个幻影呢？
//
//（短暂的沉默，Sarah捧着水杯一言不发，林娜则继续记录着Sarah的发言。）
//
//林娜：好的，谢谢你。本次采访到此结束，感谢您的倾力合作。
//
//Sarah：啊，等，等一下，我，我有个问题。那个姑娘，就是那个红头发长雀斑的高个儿姑娘，你认识她吗？她，她和我是什么关系？
//
//林娜：哦？你想起来了什么吗？
//
//Sarah：没有，我只是……我不想再让她伤心了，她每天以泪洗面的样子真的很让人心疼。拜托了，告诉我，好吗？
//
//林娜：哈哈，你还是像以前一样心地善良。你真的要听吗？你听完了可能会觉得非常难受哦？
//
//Sarah：嗯，告诉我吧。
//
//林娜：（深吸一口气）……好吧，那个姑娘的名字叫Alice，她是……她是你女儿。
//
//Sarah：……！
//
//林娜：你和她是一起切入后室的，你们俩在危机重重的后室里摸爬滚打相依为命，好不容易才在Level 11安了家。你提到的那幅油画是她去常驻Level 1的艺术家那里打了好久的工才换来的，好像是为了庆祝乔迁？你收到那副画的时候激动得眼泪都流下来了，还在我们面前炫耀了好久呢，哈哈。而那个背包……
//
//Sarah：是什么？
//
//林娜：是你送给Alice的十三岁生日礼物。
//
//Sarah：……
//
//林娜：你在背包里装满了杏仁水、龙肉罐头，以及她最爱吃的巧克力。你为了收集那些来自前厅的巧克力可是吃了很多苦头，几乎都快丢掉了小命，我们姐妹几个都觉得不值来着，但你非得去，因为你说自从Alice切入后室以后就想家想得夜不能寐，你觉得送她一些巧克力至少能让她开心一阵，聊解思乡之情……我记得那天我们一起庆祝了Alice的生日，我从没见过她那么开心的样子，你是个好母亲呢，Sarah。
//
//（Sarah低着头，许久没说话。）
//
//林娜：Sarah？Sarah？你还好吗？需要杏仁水吗？
//
//Sarah：……不，我很好，谢谢你告诉了我这么多。那，那么我，我先走了……
//（Sarah跌跌撞撞地走出了办公室，影像结束）
//
//备注：从这次采访中，我们可以得知长廊燃烧记忆时并不总是严格遵循“先近后远”、“由浅至深”的顺序，那些非常重要的记忆也有可能在一开始就被烧毁。因此，我们强烈不建议流浪者进入长廊，我们不希望再看见这样的悲剧了。——研究员林娜。
//
//基地、前哨与社区
//M.E.G.驻Level C-400前哨“清醒者”
//共12名成员，实行四班倒制度，每班值守一天。驻守人员3人，其余9名成员则于Level C-305待机。
//主要工作是指引误入的流浪者离开，并阻拦试图进入长廊的流浪者。偶尔会负责回收和分析录影带。
//为了应对该层级的精神影响，通常持有大量的杏仁水以及一些医药物资。
//持有一些非致命武装以及少量致命武装。
//友好且开放贸易。
//入口与出口
//入口
//Level 9的原野中有时会出现一栋哥特式教堂，进入其中即可到达该层级。
//有时，Level 13的某个房间中会出现一个墓碑，切入其即可来到该层级。
//在Level C-53的观影过程中自杀，有可能来到该层级。
//Level C-284中有时会出现一个写有“衰退神殿”的路牌，跟着路牌的指引前进即可到达该层级。
//在Level C-305的柏油马路上有一个写有“记忆”字样的窨井盖，撬开井盖进入窨井即可进入该层级。
//Level C-399的屏幕上有时会显示一张讣告，其特征是：正文无法阅读，死者名为“鬼月”，其外貌被描述为“一头体格特别健壮的悲尸”。切入该屏幕可到达该层级。
//在Level 1、Level 4、Level 11、Level C-307等流浪者聚居地有时会出现一张传单，黑底白字，上方用白色花体字写着【鬼月的黑色悲剧展：衰退神殿】，下方印着白色的教堂剪影。触摸白色花体字和教堂的剪影均会导致流浪者切入该层级。
//出口
//教堂的大门无法打开和破坏，但切入大门将进入Level C-284
//跳入窗户后的白色虚空将到达Level C-285
//从教堂里的雕像切出将到达Level 105
//握住雕像的手超过30秒将被送入Level C-401
//试图破坏雕像将导致流浪者被随机送入一个出现系统错误的层级，如L3νєL 4Ofour，速点切终，盘棋黑的后皇紫，3臥岴鬱?/虚//烫烫蘒嬱侅€//空???。鉴于这些层级常常极不稳定且非常危险，建议流浪者无论如何也不要试图破坏雕像。
//哈，破坏别人的艺术作品应该受到惩罚，不是吗？
//哦，亲爱的流浪者，你能看见我留下的文字吗？
//
//令人惊讶，谁能想到M.E.G.中竟然还存在着有资格的人呢，我还以为眩病月就是后室里最后一个有资格的人类了，看来这广袤的后室果然不能用常理揣度。
//
//机会难得，我来告诉你一些内部消息吧。
//
//我是鬼月，来自疯狂王国的遗产™的艺术家，这个殿堂——用你们的话来说，应该是层级吧——是我的呕心沥血之作。虽然完成的过程很辛苦，但看见如此美丽的事物诞生在我手下，我的心依然会充满了成就感。
//
//——这世上或许有许许多多种令人心潮澎湃的艺术形式，但毫无疑问的是，只有悲剧才是最刻骨铭心的。当美好的事物在观众面前支离破碎，其血泪和哀鸣将在观众心中刻下难以磨灭的印记。那么这世上最美好的东西是什么呢？自然是生命了。古今往来，有无数悲剧以男女主人公的死亡作为结尾，当一条鲜活的生命被死亡吞噬，一场优秀的悲剧也将就此达到高潮。死亡，正是悲剧之母啊！
//
//所以我就想，若是将“死亡”这一过程无限拉长，那岂不是也可以得到一出优秀的悲剧？无论是生命的一部分永远地离自己而去，还是看着一个生命无可抑制地缓缓滑向死亡，这种撕心裂肺的痛苦正是悲剧的精髓。
//
//于是这件艺术品便由此诞生了，衰退神殿，安息之旅，在微不可闻的哀叹中向死亡行进，这真是我最得意的杰作之一了。啊，或许我就是为了这一刻才加入疯狂王国的遗产™的吧。
//
//我是鬼月，为悲剧沉醉之人。这一幕用众多生命筑起的庞大悲剧，谨献给我们伟大的国王。
//
//作者信息
//« Level C-399 | Level C-400 | Level C-401 »
//
//Footnotes
//1. 尚不知这是由于该层级昏暗的环境所致，还是某种异常效应的影响。目前的主流理论认为是后者。
//2. 操纵无人机进入长廊探索被证明是不可能的，所有进入长廊的无人机都在灰雾中失去了联系，不知所踪。
//3. 如意识模糊，疲惫，情绪低落，处于焦虑或恐慌中，患有精神疾病时。
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1400{}