//Level C-464
//评分: 
//+19
//+
//–
//X
//由于该层级几乎完全被相关团体新值派所掌控，导致该文档可能与现在的Level C-464内实际情况完全不符。
//
//更新至最终版本：2018年11月20日
//
// 
//
//生存难度：
// 
// 
// 
//Level C-464是后室C层群的第464层。
//
//描述
//bamboo-1283976_960_720.jpg
//一张Level C-464的照片，摄于2000年。
//
//Level C-464为一座坐落于约6x6x6km³、封闭且无限循环的正方体空间中的宜居浮岛，常驻人口约60~90人。空岛长7.2km、面积约31.6km²，全岛全时段皆近似于热带海洋性气候，常时平均温度21℃，气候稳定、降水均匀。层级中重力加速度g为9.65m/s²，方向为垂直于空间水平边缘向下。空岛的宜居陆地由两部分组成——东北部1由山峦、喀斯特地貌与冲积平原组成的“树铭半岛”，以及西南部的稀树草原与平原地带“世泽半岛”。两半岛间由起自树铭半岛步青峰的山泉“竹林河”与岛上最大的淡水湖“琉灰湖”相区隔、由3.2km宽的地峡相互连接。该岛多山多湖、气候适宜、且不存在具有威胁的后室实体，具备极大的宜居潜质。
//
//该层级昼夜循环约为18小时，由12小时的强光照氛围与6小时的弱光照氛围组成。Level C-464的光线源自于无形的空间边缘，在自浮岛边缘眺望对岸时可清晰辨认构成正方体的发光带放出的柔和光芒。光照强度遵循极值为0.5lx与50000lx的正弦函数规律变换，于第6小时抵达顶峰、第13小时达到最低值。该区域水体无潮汐或类似引力影响，这使得该层级的湖水相较前厅更为平静而缺少涨落。
//
//Level C-464存有多种有价值的自然资源，包括大量的淡水、各类热带亚热带植被、及似三叠系砂岩矿床产出的各类矿物。该层级不存在本土鱼类，但于红星建筑队物种引进与培养后，岛上各河流与湖泊皆已具备满足渔业捕捞要求的种群数量。
//
//isle-of-skye-7112689_960_720.jpg
//竹林河将树铭半岛（图左）与世泽半岛（图右）分隔。本图片上传于2013年2月25日。值得注意的是，该图片的时间戳显示其创建时间为2022年1月27日。
//
//循环空间赐予了Level C-464奇异而独特的自然风貌。琉灰湖中的湖水经由地下水系渗入浮岛下方，化作水汽穿越空间水平边缘、在层级的高空中汇聚雨云、再度作为降水回到地面之上。而主支的地下水脉“蕴绵河”则形似落下的天河，将受到自然净化的水源如瀑布般自天空降下，洒落在步青峰的竹林泉内，构成了该岛屿最大的淡水河流竹林河的源头。虽未经证实，但有多份报告指出在竹林泉中沐浴并感受自天而降的甘霖可有效改善心情、一定程度上减轻并治愈各类精神损伤，原因不明。若在接近空间边缘的地带向远方眺望，则可以看到岛屿的对向方向存在于远望的对岸，而无数浮岛的分型如万花筒般自浮云的遮掩之下变幻展开，绘成异样而奇妙的图案，观看这一场景存在一定风险2，但分型似乎会给予观看者妙手偶得的灵光，使其陷入一种空灵的、富有创造性的爆发状态。对这种常时可遇而不可求的状态的追求，使得战前的本层级成为了艺术家与科学研究者广泛青睐的度假地。
//
//历史
//XBxLqg.jpg
//白道言手绘的Level C-464风景图，这是最早的有关于Level C-464的图片。
//
//该层级被发现的历史可以追溯至1984年，年轻的层级探索者白道言自Level C-27的竹林处切出，并偶然来到了这一层级。白道言将这一发现，及其对于该层级的第一次探索公布于当时最大的后室信息分享论坛“backroomback.brs（后室归还论坛）”之中，并在社群的讨论区中得到了激烈的反响。许多人前往Level C-27，试图通过复现白道言的行动前往这一理想乡般的宜居层级，但没有人能够再度复现当时的情景。白道言先生于1987年在探索新层群的行动中中不幸牺牲，享年31岁。为纪念他对Level C-464发现的重要贡献，他的遗骸被葬在竹林泉旁，与他最爱的景致长眠于一处。
//
//1996年9月，归属于红星建筑队的层级探索者郑和平通过穿过Level C-58的河流进入本层级。通过三角定位确认本层级就是白道言于12年前偶然进入的宜居层级之后，红星建筑队组织了一批攻坚人才，对已知的两处层级入口进行了长达数月的不断尝试。红星建筑队从未向外透露层级入口发现的时间与人力细节，当大量关于该层级的信息于1997年5月向外公布之时，红星建筑队已完成了本层级殖民地、即“红星建筑队生产合作社”的建设。
//
//XBXabd.jpg
//水稻纹枯病(Sheath blight of rice)，又名水稻云斑病、水稻云纹病，俗称花杆、花脚瘟，是一种由立枯丝核菌(Rhizoctonia solani)引起的大范围作物疾病。该真菌可寄生于水稻、麦类、高粱、玉米等前厅与后室的120余种高产粮食作物，影响谷物灌浆，引起植物枯萎倒伏，无法正常抽穗，降低结实率，减少粒重。病害通常导致作物减产10-30%，严重时可达50%以上。
//
//2001年7月，因层级间运输中防疫失误而导致的作物疾病传播，水稻纹枯病在Level C-464及数个红星建筑队的作物中大量传播，导致该组织作物田产大量减产、土地受立枯丝核菌感染，并进一步导致了席卷2001~2004年的大规模暴乱事件，即“难集年”事件的发生。因红星建筑队的教条性集体化、强制粮食采购、快速工业化及农业盲目跃进式发展所带来的黑天鹅事件所带来的极端影响，难集年事件的发生导致了大量边缘殖民地成员与“思想落后”地区的农民因饥荒而大量死亡，致使部分殖民地的分裂与独立。而据已有信息推测，建筑队对此的回应则是将之归结为“富农”与“思想落后分子”的蓄谋破坏，加以更为严苛的军事政治镇压及对外的情报封锁。这次事件被分裂后的诸势力将此事件一次有预谋的大屠杀，而红星建筑队并未对此做出任何有效回应。
//
//据信，于2001年10月第一次大规模减产后，层级中部分不满于红星建筑队人民公社化运动的公社成员与其他边缘殖民地及未知势力“笮家阀”取得联系，于本层级创立新后室价值派自由社会、即新值派。新值派由红星建筑队殖民地中众多派别的持异见人士组成，其获得一致的政治主张仅限于推翻红星建筑队势力对殖民地的影响、实行直接民主制与实行固定田赋。
//
//2002年7月，新值派发动了一次成功的武装叛乱，镇压了位于树铭半岛的生产合作社办公厅，屠杀了所有红星建筑队的干部与先进人员并接管了这一层级的政权。自此之后，该层级与后室的联系基本断绝，已无法得知层级内的情况。但于不可靠信息表示，新值派内部的动乱从未停止，对于权力的争夺、对人民的可持续性竭泽而渔导致聚落的政治局面动荡且混乱，并直接致使了2014年后该层级自然环境的急剧恶化与人员大量死亡。
//
//新值派于2010年因内部政见无法调和而分裂。组织中的温和派被踢出了该组织，重新组成了一个更小的政治派系后室自由联盟，该组织于2012年并入M.E.G.；极端派则于2015年与红星建筑队爆发的Level C-194战役后失去了最后一片外部殖民地，势力范围被压缩至仅限于Level C-464内。
//
//该层级曾被证实存在稳定Wi-Fi信号，但于2018年最后一次对该层级进行探索的返回报告显示，该层级的Wi-Fi因不明原因失去了讯号覆盖，使得层级内外的通讯完全断绝。
//
//基地、前哨与社区
//红星建筑队生产合作社（已破灭）
//该合作社归于红星建筑队，存在于1997年5月至2002年。其主要为部分流浪者提供住所和生产竹制品，并实行“可持续发展”方针种植林木，向该层级中引进了杨树、枣树和海棠树等树木。在1999年成为一个约300多人的小社区，实行红星建筑队的人民公社制度。在2002年被相关团体笮家阀扶持的傀儡新值派推翻，并将其社区人口全部归为新值派。
//
//新后室价值派自由社会
//新后室价值派（简称：新值派）是一群寄生于Level C-464的极端环保主义和无政府主义分子团体，该团体在2002年趁“难集年”事件在相关团体笮家阀的支持下武装夺取红星建筑队在此地的生产基地，并利用各种异常物品进行极端暴力手段来维持着该层级内的“无政府状态”，同时还使用未知手段封锁了该层级许多出入口，导致对该层级的描述绝大多数仅停留在2003年之前。
//
//红星建筑队成员███
//时间：2015年8月3日
//
//
//他们（指新值派）就是笮家阀扶持的傀儡，笮家阀是群什么妖怪我也不用多说了，当时嘛，打仗了啊，我就被调到[机密抹除]那里了，我刚走的第五天，那群价值派就跑到那里去了。我们一直在努力经营那个层级，什么竹子、枣子的，还出口观赏花卉海棠，那些树啥的种子全都我们带来的；那条竹林河，之前刚来的时候很容易泛洪，我们花了几个月时间给它疏洪的，要不是我们，那群价值派怎么可能活的下去，还什么“无政府主义”“安人”啥的，生产力都达不到，他们安个屁啊，这种人就是群典型的寄生虫。
//我依稀记得接替我的同志张淼𪚥——他之前是我的副手，那个社区的人民警察社区办座——笑着跟我合的影，面目十分清秀，后来看着情报他应该是被杀了的，死的很惨，被斩首了。
//
//红星建筑队成员宋辉综
//时间：2015年8月3日
//
//
//要我说，我印象最深的就是我们的社区办的队长张淼𪚥了，他老廉洁了，是个不错的年轻人，帅小伙一个，土生土长的后室man。在他还是个高中生的时候，他就能十分轻松地引用《共集》里的各种名言，像我年龄这么大的人，《共集》虽然看完了，有意思，但除了里面的几首诗外就啥也不会背了，过目就忘。
//我当时是他高中老师嘛，那孩子学习成绩在我们整个学校都是数一数二的，当年他参加的那个第五届数学竞赛上他的名字的那个“𪚥”都糊成黑块块儿了，嘿嘿，我还有他当时领奖时候的照片，笑的老好看了。我记得他是大学本科毕业没多久就被调来这里暂时工作，对，警校，你到我们的那里实习过的，你也知道那里的风气，嘿嘿。
//
//当时嘛，那个层级，要抗洪，我就被派到那边去了，也没啥好惊讶的，高中老师是我的业余工作，哦，我当时教𪚥𪚥物理和地理的。当时洪水也没多大，我和几位同志测量了好几天后，在小房子里对着地图这算算那儿画画，把要往哪里挖渠、要把哪里扩宽算好，然后人民军队们就花了没几个星期就给疏通好了，要我说的嘛，我们这几个知识分子的功劳也挺大的。
//
//后来我就在那里管图书馆了，书目算不上多，日子倒也平静，地上随便还能捡点杏仁水和罐头啥的，还有分配的空调，也不会让那个永远的夏天晒着，我有的时候也去跟其他人种竹子栽树，现在想想，如果那里不是夏天而是春天，那绝对是最舒服的日子了。
//
//被抓到的落单的新值派成员Donald Ng
//时间：2015年8月3日
//
//
//那我要告诉你，建筑队搞的那个所谓的“可持续发展”完全没球用，真的，你别看他们在那里种树啥的，竹子都快砍完了，真的，也不见他们种半点竹子，而他们说的那些杨树枣树海棠树，都是以观赏为主的，完全不进行经济效益的，还什么“环保”，整条河的河水都被污染完了，那河水还是我们治理的，真的。我可在革命前在那里待过的。
//笮家阀？什么？笮家阀？！哦兄弟，你不会也相信这个“都市传说”吧，你想想，这种黑帮组织，命怎么会这么长？他们靠啥赚钱？收Tom小餐馆的保护费？而且我们连他们现在还存不存在都不知道，在建筑队和条顿旅打仗之前，我可从来没听过什么笮家阀，倒是战争开打后，笮家阀这个名字在报纸上如雨后春笋般冒出来了，但谁不都清楚他的内部建制，甚至连首领到底姓不姓笮都不确定，还有啊，这个笮家阀在战争打完后没几天，就在报纸上被宣布也被建筑队和阿尔戈斯之眼抄家了，这什么跟什么啊。要我说，笮家阀就是建筑队自己造的谎言，就是为了让建筑队的各种利益正当化。至于条顿旅，我感觉他们是情有可原的，他们本来就不属于后室，他们也是想活命，他们也得生存嘛，倒是建筑队自己占了一大堆资源还不往外拉，跟伙强盗似的，我觉得建筑队哪一天被一个正义的组织屠戮完都行，反正我也不是他们的人了，这也就是为什么我要革命反抗他们的原因。
//
//张淼𪚥？这个人我知道，这个名字还是他当上警察后改的，他可太坏了，真的。他跟着原本合作社的领导那谁一块儿贪污，什么管图书馆管林区规划的，全都跟着他们一块儿贪，真的，把我们都给贪穷了，他们还向我们借贷，打欠条的那种，这样是为了防止我们告密，因为如果他们完了，那我们的贷款也就跟着完了，所以我们没人敢告密。我们有的时候只能喝稀糊糊，然后还要被强迫做18小时的活儿，真的，就6小时休息制，连一句怨言都不能说，真的，所以我才里应外合跟着领袖革命。你要知道，我们可是源自于一个伟大的理想，是为了全后室的发展而建立的，但目前正处于某些困境中。
//
//《共集》？我可没看过，谁看那玩意儿啊，禁锢思想的东西，整天在那里说这说那，有屁用，正经人谁需要这东西来“武装”自己哦，你吗？噗，信这种东西的人都多少沾点，哈哈。
//
//阿尔戈斯之眼真理裁决人成员███
//时间：2015年8月3日
//
//
//唔，我曾在那个洁净之地待过一小段时间，那时候那场罪恶之战才刚打响，我们被派到Ground C-464来预防条顿军从此处攻入，而我，蒙承Argos的祝福，逃脱了玷污之灾，愿那些没能成功撤离的善良之人安息。
//在罪孽的新值派搞屠戮前，新值派曾多次演讲各种有关资本主义社会的各种“好处”，但就我的经验来说，他们十分卑劣，因为他们利用大众的无知，将前世的美国吹的天花乱坠，比乌托邦还要乌托邦，接着他们抓住居民们的一个痛点——战争状态，将这个痛点无限地放大化、夸张化，接着便说美国全都没有这些，等等等等，而真实的需救赎的美国，想必你也懂的，这里不细说了。
//
//当时穷凶极恶的笮家阀扶持了新值派——为了阻挠受祝福的红星建筑队，进而赚取战争财，但很可惜，他们从结果上看，还是失败了。我大约是从1999年开始被调遣去调查笮家阀，这种秘密黑帮就如都市传说一般，就连我最开始也以为只不过是一帮小混混组成的敲诈勒索团体，直到我观望到了他们如何酷刑不服从他们的人，怎么让那些拖欠他们保护费的人听话，还有那罪恶滔天的贩毒，拐卖儿童，强迫女孩破除贞操来给他们敛财，利用异常去干各种穷凶极恶的事，等等等等。
//
//他们的社区建设？唔，我自我感觉是非常好的，我也曾参加过他们的劳动，他们一般是上午砍竹子砍树，下午种竹子种树，一天下来有8、9个小时。他们是在食堂里吃饭，他们的饭菜的味道和家常菜一样，每天中午还有些肉吃的，还是免费的。至于当年的公社队长嘛，他好像现在还活着，他很爽快，也很尊重人，但我没见过他几次面，我一般都是和警察局社区办联系的，社区办就几个人，天天在局里睡觉，毕竟就300多人的小社区能有多少案件嘛，他们的薪资也不高，所以他们在下午的时候也会参加劳动。管图书馆的宋先生？唔，他的年龄是比较大的，我经常和他聊天的，但说的都是些闲话，现在也有点记不起来了。
//
//唔，那好，拜拜，那我走了，愿你受祝福！
//
//笮家阀成员刘海彷
//时间：2015年8月3日
//
//
//在此，愿笮先生安息。
//首先，我们的手段完全合乎生意和公务。
//
//其次，张淼𪚥先生曾经在执行他的公务时杀死了我们的三个弟兄，并活捉了我们的十个弟兄，而我们枪毙他既属于私情，也合乎公务。
//
//最后，新值派只是我们的一颗棋子，但他们上火了，脱离我们的管控了，要知道，那时候是战争年代，战火殃及到了我们，所以没有多少精力去管理他们，如果他们伤害到了贵盟，我对此感到抱歉。
//
//（缄默……）
//
//（缄默……）
//
//嘿，你叫白幕霖吧，我们的人绝不会因此而杀你，你人挺帅，你人挺好，愿你找个好妻子，安安稳稳地过完这……
//
//（由于此人被未知的狙击手的子弹穿脑，记录停止，白幕霖博士成功避险。）
//
//M.E.G.成员李武杨文
//时间：2018年11月20日
//
//
//OK，幕霖。我怎么进去出来的不用说了吧？好，我说一下里面现在发生了啥，太恶心了：
//首先，里面的那条竹林河，很清澈，但旁边没什么竹子了，就剩下几棵树，我也不知道是枣树杨树还是海棠啥的，因为上面没结花儿没长叶儿；我当时还挺疑惑的，我不知道我切到哪儿了，直到后来我遇见了一个瘦弱的男子，他告诉我的——哦对的，我在切进那边之前我没有看过Level C-464的档案，这个不重要——这里是层级四百六十四，这类的，他说他姓张，他的皮肤发黑，瘦的皮包骨，额骨都露出来了，健康状况很让人担心，于是我就分了点我在那里捡的龙肉罐头和水给他，他很感谢我，还要跟我磕头，但被我拒绝了的，我问他还有其他人吗，他很害怕，脸变得铁青，嘴无意识地撅了起来，然后溜走了，我叫了叫他，他头都不回。
//
//然后我在那里闲逛，可惜连不上WIFI，太难受了，我当时感觉有点崩溃，心想着这遍地都是杏仁水和龙肉罐头，怎么还会有人饿成这样，我一直这样想着，直到我被绊倒。
//
//绊倒我的是具尸体，一堆苍蝇聚在那儿，不过我也只是吓了一跳，就没别的了，咦了一下，是具女尸，我就跑开继续想着那件事。
//
//我当时听见了来自远方的车的声音——那里特别安静，但我没看到车在哪儿，我四处张望，接着遇到了个坡，然后就切出去了，切到了Level C-14，还好我看过L14的档案，不然我就得没了。
//
//OK，就这些。那好，拜拜。
//
//实体
//Level C-464内有主食为素的、体积约相当于兔子的尸鼠，几乎丧失了对人的攻击性，且携带病毒较少，可烹调食用。
//
//入口与出口
//寄生于该层级的相关团体新值派封锁了几乎所有的可能的出入口，目前，仅有M.E.G.成员李武杨文最近一次切入该层级并成功切出的一个出入口可能仍有效。
//
//入口
//对Level C-27内有概率出现的竹子进行撞击，有几率切入此层。
//在Level C-14有可能发现一处竹林，可在此处走入Level C-464。
//Level C-58会随机生成一条河，可沿河进入该层。
//使用红星建筑队的快捷通道。
//从Level C-435的便利店走出来，并无意识地摔倒，有几率切入。
//出口
//尚若在该层级中发现许多高大的树木，走进去后会切入Level C-97。
//在竹林河处溺水，可切入Level C-194的离主体建筑不远的沙漠中。
//若发现一座横于土地上的巨型钢筋混凝土墙，对着该墙的某处用力推，可切入Leve C-12。
//使用红星建筑队的快捷通道。
//可在大于等于33.2°的斜坡地形切出进入Level C-14。
//«————————⊰۞⊱————————»
//
//脚注
//1. 以该地平均地磁方向确定南北方向
//2. 可能造成精神损伤或光敏性癫痫，不建议任何承受能力较低的流浪者前往观看。
//
//
//Level C-464
//评分: 
//+19
//+
//–
//X
//欢迎莅临Level C-464 Blackstar Zeta Farm
//为了您的人身安全与实验项目的有序进行，请勿向猴子喂食
//! 您已经被警告了 !
//
//机构概况
//institute-2962095_960_720.jpg
//泽塔牧场航拍图
//
//黑星超学会泽塔牧场研究所(简称泽塔牧场(Zeta Farm))是黑星超学会下辖的综合性科研机构，建立于1998年12月。研究所地处Level C-464，代理管辖黑星于本层级的一切事务。研究所秉承“软硬兼修、治理健全、专业精湛、改革创新”的办所方针，在层级规则构成、心理与超心理学领域开展基础理论与前沿技术研究，是黑星人类心理学领域的创新研发核心机构之一。学科方向涉及生物工程、生命科学、脑科学、心理分析、超心理学、层级物理学、层级构成学、量子力学及逆向工程与异种科技学等。
//
//泽塔牧场区依托Level C-464多重世界异常效应的区位优势，于层级中建立了黑星最大的 楚门的牧场
//Truman's Farm
// 。泽塔牧场下辖47个拟真环境克隆人牧场、5个拟真环境异常生物牧场、2个克隆生物生产线，向各研究所提供了海量的科研数据与试验场地，为学会的科技飞跃做出了微小的贡献。
//
//若您希望莅临本研究所参观访问、或洽谈合作事项，请使用Bkype App致电本研究所，研究所将派出专业导游指引您前往平行世界的研究所本部。请注意，克隆人聚落及其运行环境是本研究所的宝贵财富，请勿向猴子喂食。泽塔牧场研究所欢迎您的光临。
//
//人才团队
//截至2022年6月1日，研究所目前在职员工147人，其中包括理事会院士2人、博士后12人、在册研究员及高级工程技术人员57人，客座研究人员21人，所辖军事人员48人；在学研究生22人。
//
//承担科研任务
//研究所面向人类心理与超心理学发展前沿与黑星科技进步的重大需求，依托Level C-464特殊的层级异常现象，为学会承担克隆生命繁殖与牧养、人类心理与脑科学研究、“Project MKNulla”项目等重大任务，同时推进层级异常现象的研究与应用取得了一系列重大突破，部分成果已于有关部门与地区投入实际应用。
//
//现任领导
//所 长：笮 赫 明
//副 所 长：J. 米切尔 · 邹 锋 · 戴 清 华
//科技创新
//【异常现象】
//□ Level C-464的多重现实现象
//论文编号:	10.464/J.BSSN.1001-0101.2003-14-012
//论文题目:	Level C-464的多重现实现象
//论文作者:	笮赫明、九戈、D. 弗洛姆、A. R. 八重、C. 帕里斯、邹锋
//刊物名称:	Backrooms Nature
//年:	2003
//期:	14
//卷:	1
//页:	73~168
//【摘要】
//对Level C-464的探索，自1984年层级被发现以来便从未停息。红星建筑队组织的进驻使得层级中的大量基础规则与出入口被发掘利用。但因由建筑队的特殊政治氛围，对更深层规则的研究被基础的农业劳作与集体农庄运作所代替，殖民地再无更多对层级异常规则的研究产出。
//
//XrLoFI.png
//自C(0,0,0)沿x轴方向移动65536个单位的距离，则会抵达C(1,0,0)平行世界相对原世界的同一位置。
//
//自C. 罗西尼博士通过异常现象BLJ穿越无形空间边缘，抵达另一片镜像空岛时，黑星对Level C-464的研究便已然迈入了全新的领域。“层级多重现实”，指以10cm为1单位，每自基准世界向x、y或z轴移动65535个单位，便可抵达一个与层级基准世界极为相似的镜像平行世界的对应位置。以此为基础，更多平行世界与基准世界的关系被不断发掘，通过多项学科、多种实验方向的共同努力，“平行世界的安全跃迁定律”、“基准世界影响的2.55%法则”、“远端平行世界的不稳定性与时空动荡”等理论成果不断涌现，层级研究进入了百花齐放的繁盛时期。
//
//本文集合了泽塔牧场研究所近年理论研究的精华部分，从“层级多重现实理论”入手，将研究所的理论研究成果集合并展现于大众面前，以期为相关研究人员提供有益的帮助。
//
//□ Level C-464的异常现象与其成因
//论文编号:	10.464/J.BSSN.1001-0101.2011-27-037
//论文题目:	Level C-464的异常现象与其成因
//论文作者:	J. 米切尔、L. 威尔逊、笮赫明、王双城、邹锋、秦涵宇、C. 帕里斯 Jr.
//刊物名称:	Backrooms Nature
//年:	2011
//期:	27
//卷:	2
//页:	1~313
//【摘要】
//黑星超学会对Level C-464异常现象的研究从未停止。 背身远跳
//Back Long Jump
// 跃迁造成的超大动量，在转换为静止有时会造成跃迁者的伤害，有时则不会受伤，这一反物理学的谜题如同一方阴云、困扰着C-464特性研究者多年。而当L. 威尔逊博士发现在背身远跳中是否受伤取决于操作者跳跃前后的相对坐标、王双城博士实验证明了层级的最小时间单位为1/60秒后，该层级近似于程序的异常规则已然渐趋明朗，并逐渐为全新技术的应用提供了重大帮助。
//
//本文对近十年内对Level C-464异常现象的全新发现进行归纳总结，旨在向读者完整的分享十年来Level C-464异常现象研究的成果与结论，同时探讨该层级异常现象的应用方法与未来研究方向。
//
// 
//
//【泽塔牧场】
//□ 黑星泽塔牧场简介
//village-279013_960_720.jpg
//C(0,16,0)克隆人牧区，牧区研究长期高心理压力对人类生理与心理的影响。
//
//泽塔牧场是研究所的核心单元，借助层级平行世界“封闭而开放”的原理，及其对层级定位系统的模糊性处理，数十个克隆人流浪者聚落在精心挑选的平行世界牧场中被创建。克隆人将被注入前厅来客或部落居民的虚假记忆，放置于预先设计的聚居地环境中，并在记忆与催眠干涉的影响下扮演生态实验所需的身份。
//
//C(0,16,0)克隆人牧区是研究所代表性的、也是最广为人知的牧区。承继了研究所最初的实验设想，通过在持续性的高压环境下投入诱发物，以此观测克隆人生理与心理的变化，诱使超心理学能力者产生，继而对超心理学现实影响能力进行观测与逆向工程学分析。在戴清华博士及其团队的努力下，数个诱使超能力生成的基因位点与生理变异被找出，为学会的超心理学研究做出了不朽的贡献。
//
//mountains-615428_960_720.jpg
//C(2,7,0)克隆人牧区，牧区研究封闭空间中的人类社会结构变迁。
//
//受 心理史学
//Psychohistory
// 人文风潮的影响，在学会与各研究机构的需求下，牧场在进行生物科学研究区域的承揽外，也同时招收人类学等人文科学领域的实验区域要请。现今的52个克隆生物牧场中，有7个已成为人文科学与社会科学研究的试验场地、人类学、政治学与心理史学研究成果的孵化器。
//
//现已有3个实验牧区正在建设之中，更多实验牧区的建设计划已进入筹措阶段，欢迎任何有意入驻或订购服务的个人与研究机构来电来函咨询，研究所与泽塔牧场将竭诚为您服务。
//
//产品报价
//基础费用约 ℅3,000,000~10,000,000/年 详细价格面议
//
// 
//
//机构年表
//□ 年表
//黑星超学会泽塔牧场研究所年表
//1998年
//
//六月，C. 罗西尼博士与笮赫明博士于Level C-464度假期间，于偶然尝试中发现了异常现象“ 背身远跳
//Back Long Jump
// ”，简称BLJ。
//
//十二月，BLJ系统研究已初步完成，利用该系统，C. 罗西尼博士越过层级的无形空间边缘，抵达层级平行空间并成功返回。
//
//1999年
//
//人类可行的安全层级平行空间穿越方式已初步发现。
//
//四月，泽塔牧场研究所主要设施建设已初步完成，C. 罗西尼博士的雕像被树立于研究所广场的正中，以纪念他为层级平行空间穿越技术做出的伟大牺牲。
//
//七月，研究所的第一片牧场区域C(0,1,0)牧场竣工并投入使用。
//
//十一月，C(0,1,0)牧场出现克隆人外逃事故，牧场非核心信息部分外泄。
//
//2000年
//
//研究所将牧场区域扩充至9个。
//
//六月，阿尔戈斯之眼侵入C(0,1,0)牧场，牧场区域受到半放置性废弃处理，牧场研究项目转至C(0,16,0)。
//
//2002年
//
//在众多科学工作者的努力下，对Level C-464层级平行世界的探索初具雏形，相关综合性论文已开始撰写。
//
//四月，条顿军进犯C(2,0,2)牧区、C(3,1,0)与C(5,6,2)区域，采用10%浓度呋喃丹(Carbofuran)混2%浓度氰戊菊酯(Fenvalerate)喷洒驱逐，效果显著。
//
//七月，层级基本世界发生动乱，红星建筑队遭到新兴团体新值派的武装驱逐。武装冲突对基本世界的影响造成了各平行世界的极大混乱，部分研究资料因而散佚。
//
//十二月，红星建筑队与阿尔戈斯之眼的联合小队入侵被称为“笮家阀”的C(0,1,0)牧场与C(2,2,0)附属研究室，将所有克隆人移出Level C-464，并对研究设施造成一定的破坏。无人于此事件中伤亡。
//
//2003年
//
//层级指导性论文《C-464的异常现象》于《后室自然》期刊发表。黑星向红星建筑队与阿尔戈斯之眼的军事驻地发动了对等的报复性袭击。
//
//新值派违反协议，在未经告知的情形下借助购得武器封锁了部分层级出口，但尚未影响黑星内部的正常通行。
//
//2013年
//
//《Level C-464的异常现象与其成因》完著，对层级异常现象的研究得到大幅度的推进，泽塔牧场进行一定程度的结构性调整以适应修订的异常现象规则。
//
//2016年
//
//层级基本世界环境遭到新值派的极大破坏，为维护黑星于本层级的财产安全，研究所对所有存在于Level C-464的新值派成员进行精神控制，使其相信自身为20世纪美国中西部内陆的阿米什清教徒，在新大陆上过着拒绝电器与Wi-Fi、清贫而幸福的生活。数月后，基本世界环境得到一定改善，平行世界环境趋于稳定。
//
//2018年
//
//泽塔牧场已成为黑星最大的环境再现型人类行为研究基地之一。
//
//12月，Level C-464基本世界自然环境的恢复程度仍远低于预期，伊甸园创造器被投入使用，以恢复无法以自然方式修复的脆弱小环境。
//
//2022年
//
//在无数先辈探索者的牺牲之下、在科学工作者们的不懈努力之下，C-464层级远端平行世界的时间动荡规则已得到初步理解，层级平行时空探索已然起步。
//
//⊱————————»●«————————⊰
//
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1464{}