//Level C-432
//评分: 
//+14
//+
//–
//X
// 
//
//生存难度：
//等级 变化
//
//变化的精神影响
//非欧氏几何空间
//变化的精神危害vDHC4I.jpg
//一张广为人知的Level C-432摄影。
//
//Level C-432是后室C层群的第432层。其独有性质是使进入者的记忆在不同距离对进入者做出对应的精神影响，因此离开此层级会很困难并且十分痛苦，所以不建议进入此层级。此外，此层级是单向层级。
//
//描述
//Level C-432类似于一个结构相互交错，且引力朝向不稳定的建筑物内部，外观呈现于通道交错的白色走廊，以及走廊两旁无法进入的门。门内会传来进入者特定记忆情景的声音，从门上的窗口中可以看见这个记忆的具体呈现。任何对窗口的摄影都只能拍到一片漆黑。物资在此层级似乎并不会生成，至于空间大小因深入探索的越发困难而无法得知。
//
//本层级的结构基本是以进入者的进入点为球心，随着逐渐远离进入点，半径值越大的空间越难前进和存活，所以应照此层级生存难度的变化性，将已探索区域分五个部分。
//
//提示：如果您目前还在相对安全的区域，请观看完整篇指南再开始探索。
//区域1
//区域1
// 
//
//生存难度：
//等级 1
//
// 
// 
//轻微精神影响
//区域1是Level C-432的第一个区域，此区域的走廊灯光充足，墙壁洁白平整，两旁门中的窗口能看到使进入者感到怀旧的记忆的具体呈现，使进入者想要逗留于此区域，进入者前进的所用时间将会更加漫长，最好的办法就是不要往窗口中看。
//
//另外，此层级的重力也是已探索的区域中最稳定的，朝向方位为上、下的走廊尤其少，可以视为一个能够在墙壁上行走来前进的竖井。因此在区域1在朝向为上下的走廊前进是最快速的，这种行走路线也能最大限度避免此层级对进入者的精神影响。
//
//区域2
//区域2
//
//
//生存难度：
//等级 2
//
//安全
// 
//不可避免的精神危害
//区域2是Level C-432的第二个区域，此区域相比区域1灯光略显昏暗，昏暗程度会随着深入的距离增加。两旁门中的窗口中看到的都是使进入者感到窘迫和惭愧的记忆，即使不看窗口中的景象，门内传出的声音依然会传入进入者耳中，甚至会有不知何处的耳语来使进入者的精神状态更加不稳定，耳语的内容类别基本如下：
//
//“要不是因为你，事情能发展到这个地步吗？”
//“这一切都是你的错”
//“看看，多么的愚蠢可笑”
//“你做到的只是使他们处境更糟糕”
//此层的重力相比区域1更加不稳定，上、下方位的道路构成了一个基本的道路系统，也更难前进。上、下方位的通道依然最容易前进。此外，在区域2最好的办法就是不要去思考听到的话语，放空思想专心去前进，之后的区域会在区域2的精神危害上叠加
//
//区域3
//区域3
//
//
//生存难度：
//等级 4
//
//不安全
//非欧氏几何空间
//损伤精神的危害
//区域3是Level C-432的第三个区域，进入者在此区域会逐渐失去色彩辨认的能力，只能看到黑白的景象，甚至摄像也会受到这种影响，走廊内的照明设施都有不同程度的破损，有的则直接掉落在进入者的站立面上。
//
//在门内呈现的记忆都是进入者不愿面对的，大部分会引起进入者的恐慌，区域2的耳语在此时也成了无法理解的胡言乱语，混乱程度取决于进入者离开区域2的精神状态。很多进入者在这一区域都会受到一定精神损伤，体现于对生活失去希望，过度偏执，异常自卑等。有的进入者甚至出现了一种致命的心理疾病，一般体现为仔细观看他们能遇见的每一个窗口内的记忆，这通常导致他们直接在区域3发疯直至死亡。
//
//区域3是非欧氏几何空间，经常会出现向一方向持续前行会回到区域3某一路段中，并且道路结构形成一个标准的三维结构迷宫，引力不稳定到在同一走廊不同路段有不同方向引力的程度，曾有一成功逃脱的探险者说明道“在区域3一个楼梯正反两面都能够行走。”门上的窗口中展现的记忆则总会与观看者的视平线平行。想要尽快离开此区域，应尽量多拐一些弯防止不必要的重走，并且保持乐观自信理智的态度。
//
//区域4
//区域4
//
//
//生存难度：
//等级 5
//
// 
//不稳定
//折磨透顶的痛苦
//区域4是Level C-432的第四个区域，区域4的走廊内部基本十分黑暗，一些角落会有未知光源的光芒，偶尔出现的灯光会让流浪者感到极度不安和不自在，在这里走廊的“贴图”会异常痉挛，实际体积依然稳定，门也会反复剧烈发抖着在墙壁滑行，门中的窗口则诡异地停在原地。
//
//去过Level C-432的探险者们都不约而同地表示极度惧怕窗口中的事物，一想起来就会恶心反胃，这些事物通常都由进入者最害怕的事物组合或放大而成，比如一张黑暗中诡异微笑着扭曲的脸庞，或者模糊的血肉拼凑起来蠕动的怪物等等，窗口发出的声音也很诡异和刺耳，这通常会导致进入者直接疯掉。
//
//区域4的走廊经常会被其他走廊挡住从而变成一个死胡同，引力朝向在不同时段也会发生改变，走廊的角度弯曲到形成无法前进的陡坡，可庆的是深入区域4后进入安全的区域5十分容易，因此没有人会想要继续深入区域4，区域4后面的情况也就不得而知。
//
//
//区域5
//区域5
//
//
//生存难度：
//等级 0
//
// 
// 
// 
//在区域4的深部卡入有令人安心的光芒照射的区域，进入者将会来到区域5，区域5严格来说是Level C-432的一个特殊区域，因为它与前四个区域性质大不相同。区域5是一个面积不定的露天平地，天空呈明媚的蔚蓝色，有类似太阳光的未知光源在区域5上照射，光源无从得知。
//
//所有探险者都表示在区域5他们感到“前所未有地安心、舒适、温暖”，并且区域5还能够使进入者的心理状态恢复健康，自动疗愈伤口，治愈疾病等。原理由于其区域性质无法探究。
//
//区域5是此层级已探索部分唯一有出口的区域，离开方法为在脑中选择自己要去的层级，确定后开始入睡，醒来后会来到指定的层级（如果选择的是前厅，醒来后会来到Level 11）。如果迟迟没有选择要去的层级，进入区域5满约17分钟后会强制入睡并传送至一个随机的宜居层级。
//
//“经历地狱般的试炼，终于迎来渴望的天堂”……
//
//
//基地、前哨和社区
//本层没有任何基地、前哨和社区。
//
//
//入口和出口
//入口
//在Level C-431凝视白色的雪地约7分钟，移开目光后会发现身处此层级。
//在Level C-285看着一个楼梯并认知为楼梯在自己上方，将会来到此层级。
//在Level C-114切入天花板将会来到此层级。
//在Level 18进入一个白色走廊，有概率会来到此层级。
//有人声称在乳白天空卡入墙壁会有极低概率来到此层级，但目前没有证据证明此入口的真实性。
//其他入口仍在探索中。
//出口
//目前已知出口见描述部分区域5的描写。
//其他出口仍在探索中。
//
//
//档案
//收起档案
//录制者：匿名流浪者
//上传者：同一录制者
//上传时间：2037/9/2
//（吹气的声音）
//
//流浪者：“喂，喂？应该开始录了吧。”
//
//流浪者：“呃……看来没问题了，我现在在一个白色的走廊，灯光明亮，看样子还比较安全，但愿吧”
//
//流浪者：“啧，我在手机上没有看到和这个层级比较符合的描述，我猜它是一个新层级，真倒霉，祝我好运。”
//
//（一阵脚步声）
//
//流浪者：“该死的，门打不开……我一开始用录音是明智的，手机拍到门上的窗口就黑屏了。更糟糕的是我背包里的资源都无了。窗口里有时能看见我已故的外祖母和我在前室的卧室……总之都是令人怀念的记忆，看来我应该来到了一个比较安全的层级。”
//
//流浪者：“真糟糕，我开始饿了，我必须马上找到出口。”
//
//流浪者：“越来越奇怪了，我看到一个在天花板上的走廊，过去看看……”
//
//（扑倒声）
//
//（拍打衣服的声音）
//
//流浪者：“见鬼，现在引力方向变了，它能让我直接在这个‘天花板走廊’的地板上行走，我想在这里走应该会更快些……这个层级的空间布局还真是奇怪，我所剩的时间不多了，要赶紧找到出口。”
//
//（长时间的脚步声）
//
//流浪者：“我现在莫名地焦躁，还有个看不见傻逼玩意不停地在我耳边说话，窗口里的玩意还他妈变得特别糟糕，简直不忍直视，特别是这些搞得我晕头转向的走廊，真令人恼火。”
//
//流浪者：“我感觉自己只能看到黑白的颜色了，但愿是个幻觉。那个耳语现在正在胡言乱语，老天爷，总算让我清静一会了。”
//
//流浪者：“真他妈就是个安全层级，完全没有一丝危险，直接把我折磨个半死。我现在确认是看不清颜色了……这些傻逼走廊能不能消停点给我个出口啊我靠。”
//
//流浪者：“我真的受不了了，这个层级简直折磨透顶，我能感觉到我马上就要疯了。”
//
//流浪者：“这里就是个越发变态的地狱，再见了狗屁娘的后室，我他妈还真没想到我是在这个垃圾走廊被饿死的。”
//
//（录音结束）
//
//收起档案
//收起档案
//录制者：████（受保）
//上传者：████（受保）
//上传时间：██ / █ / █（受保）
//████：“好的，现在我按照M.E.G.的指示，来到了Level C-432，但愿我能成功逃出去。”
//
//（约四个小时的行走声和噪音）
//
//████：“一切都很顺利，我现在来到了区域3，我觉得自己的精神状态还不错，去区域5应该不是什么难事。”
//
//████：“呃……我觉得我太低估区域3了，我应该已经走了七个钟头了，他妈区域3的生存难度直接跳到了4，我竟然天真的以为是不小心标错了，这里的走廊真让人头晕，还要自己七拐八拐……我真的是在前进吗？”
//
//（无法辨别的声音）
//
//████：“我终于来到区域4了，这里的折磨不能用话语来描述，只有你亲身经历过才会领会那种痛苦。如果非要说的话，那感觉就像被迫脱光了衣服在刀尖上跳着搞笑的舞蹈，千万个无形的目光在你身上密集地扫来扫去——我保证，你脑中想象到的感受一定比我现在经历折磨的少千万倍。”
//
//████：“那个该死的光照区域怎么还看不到，我快被窗口里的玩意恶心死了，一分一秒我都不想待下去。”
//
//（沉默的十几分钟）
//
//████：“卧槽！我终于找到光照的区域了，卡入一个楼梯有点困难，我试试直接跳进去。”
//
//（物体摔落的声音）
//
//████：“真是不敢相信，上一秒我还在区域4受尽折磨，现在我就在区域5晒太阳。我保证这一定比在天堂还舒服，比那个傻逼地方强多了。”
//
//████：“唉，活下来了”
//
//（录音结束）
//
//收起档案
//ۗۚۗۖۗۗۚ۟ۦٌۥٌٌۖ۟ۚۛ۟۟۟۟ۡۗۥۚۚۥۥ۟۟۟ۡۛۛۡ۟۟ۘۗۥۗۚۗۖۗۗۚ۟ۥٌَُُُُُٜ۪ۖ۟۟ۚۗ۟ۖۗۛٛٞۚۚۙۚۚۥ۟۟۟۟ۚۚ۟ۛۥۛۚۚۚ۟۟ۡۥۛۛ۟ۙۙۚۥۚۙۙۙۚۥۛۛۚۚۙ ۥ۟۟۟۟ۚۚ۟ۛۥۛۚۚۚ۟۟ۡۥۛۛ۟ۙۙۚۥۚۙۙۙۚۥۛ ُُُٜ۪ۙۚۚۥ۟۟۟۟ۚۚ۟ۛۥۛۚۚۚ۟۟ۡۥۛۛ۟ۙۙۚۥۚۙۙۙۚۥۛ ۦٌۥٌٌۖ۟ۚۛ۟۟۟۟ۡۗۥۚۚۥۥ۟۟۟ۡۛۛۡ۟۟ۘۗۥۗۚۗۖۗۗۚ۟ۥٌَُُُُُٜ۪ۖ۟۟ۚۗ۟ۖۗۛٛٞۚۚۙۚۚۥ۟۟۟۟ۚۚ۟ۛۥۛۚۚۚ۟۟ۡۥۛۛ۟ۙۙۚۥۚۙۙۙۚۥۛۛۚۚۙ
//
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1432{}