//Level C-422
//“假如你从地上捡起了一张破旧的，带有猩红血色的纸条…你最终会坠入猩红……这里的空间跟你之前的空间是如此相似，以至于你忽略了一些不正常的问题……”
//“现在，为自己祈祷吧，只有冷静和理智才能保证短暂的存活……”
//
//
//Level C-422是后室C层群的第422层。
//
//描述
//（经过我们的探查，Level C-422根本就不存在，就算你严格按照那张模模糊糊纸条上所写的话来做都没用，我们怀疑是某个无聊的流浪者的恶作剧，毕竟是直接在地上捡到的纸条，不过上面说的还有理有据的）
// 
//
// 
// 
//（该死的，我要有这点时间写这些占内存的破文档还不如去喝杯杏仁水)
//（话说最近我们这的数据库怎么回事？一直在后台塞一些纯红的图片，改天叫人来修一下吧）
//（最近也是，老找一些空白文件叫我填…甚至只有名字的位置……没管，不知道后台抽什么风）
//
// 
//
//- 漆黑
//我们的舞台剧已经开始。
//
//
// 
// 
//（最近失踪的人好多……虽然这是后室啦……但是在这里一天失踪的人是不是有点太多了啊……）
//（上次叫人来修数据库的…看来也没修好啊，都在弹乱码了）
//
//（最近听别的人说啦，好像那些失踪的人都填了那个空白文件……这是什么稀奇古怪的层级进入方法啊……改天看看数据库有没有更新吧）
//
//（这周没多大事，话说我把这个层级文档当作日记来写真的可以吗？算了管他呢）
//
//（失踪的人又变多了……，还有后台，不仅在弹乱码了，还一直闪屏……摸鱼看看层级都不能好好摸…）
//
//（……）
//
//（怎么就剩下几个人了啊……就算倒霉进入层级也不会天天中招啊）
//
// 
// 
//
//- 薄雾
//猩红在蔓延……提线在缠绕……一幕完美的表演只剩下那提线木偶…
//
//
// 
// 
//（绝对不对劲，短短几周，怎么少了这么多人，开局几个倒霉的傻子也就算了，怎么现在只剩下我一个人？）
//（tmd，这地方不能久呆，我得出去了）
//
//（淦，这里不是Level 0吗？怎么用什么办法都出不去？）
//（………………………）
//（我身边的同事每天都在减少，这是为什么？）
//
//（…………）
//（这是我最后一次记下笔记……这里根本不是Level 0！这tmd就是那个C-422！在我们做完那张纸条上的事情之后我们就他妈的到了这个层级里面！只不过我们一个个的都他妈根本没注意！）
//
//（………）
// 
// 
//（现在，重新介绍这个什么……什么Level C-422，这玩意会随机的将一张纸条放在你面前，上面写着都是一些看上去有理有据的东西，但是只要脑海里想着纸条然后做出了纸条上面的哪怕一个正确的动作，你都会不知不觉的被送到一个跟你原来的层级一模一样的“猩红地区”！而且你不会太在意那些不是原层级会发生的事情，而且你呆的越久被污染和同化的程度就越重！不过，现在不是说这个的时候了。）
//
//（……现在，我已经知道那些失踪的人们去了哪里了，猩红向我扑来，而我见到了我的同事，我的父母，我的朋友，他们在向我招手，我感受到了那温暖的阳光，我看到了……家？）
//
// 
//（呸！去他妈的吧！现在，听着，流浪者，或者什么M.E.G的人之类的，不，不管你是谁，经过我短短的观察，猩红里面的实体确实不能用常规手段弄死，但是猩红里面的那些血肉玩意可不确定，所以，我现在就会直奔猩红，就算不能彻底摧毁这所谓的“猩红”，我也要将生产纸条的那玩意给弄死，现在已经没什么好害怕的了，就算我猜错了，被猩红转化，我也会将这最后一次编辑的文档放在数据库，陌生人，请你保佑我，现在，该启程了）
//
//
//- 猩红
//为什么？只是脆弱之躯？却敢反抗命定的结局？
//
//………
//
//我们终将让猩红蔓延全世界……不过绝对不是现在
//
// 
//
//更新资料库中……
//- 关闭
// 
//
//生存难度：
//等级 0
//
//入口被破坏
//层级空间极度不稳定
//危险实体众多
// 
// 
// 
// 
// 
// 
//基地、前哨与社区
// 
//曙光探查组（已确认全体牺牲）
//
//前九人被转化为了猩红实体
//一人摆脱了猩红的转化并且摧毁了入口，后被猩红实体抓住并强制转化
// 
// 
//
//入口和出口
//入口
//所有入口皆已被破坏
//出口
//猩红的死亡，猩红的核心。
//
//
//
//
//
//收起
//“各位流浪者们，你们好，我们是M.E.G的数据部门，鉴于这份文档的特殊性质，我们已经派出探查小组，将在不久后向各位提供详细的关于这个层级的文档。”
//-——6:28pm
//
//
//
//
//
//收起
//
//评分: 
//+13
//+
//–
//X
// 
//
//生存难度：
//等级 5
//
//
// 
//
//
//Level C-422是后室C层群的第422层
//
//………………
//
//你们是这么叫它的吗？
//
//
//从第一次迷雾诞生之初，到蔓延至整个底层的猩红
//
//仅仅一个层级满足不了我们
//
//我们需要物质
//
//我们需要血肉
//
//而你们的土地则是不错的肥料
//
//我们从迷雾中找到自我
//
//自猩红中寻得真理
//
//但是
//
//我们与你们之间的桥梁被破坏
//
//不过那没什么好担心的
//
//就像植物会自己寻找光明
//
//猩红也会
//
//
//
//血雾重重，猩红收割……
//现在，就是收割之时
//……吞噬，或被吞噬
//加入猩红，献出血肉，可获永生
//█████████
//:)
//
//
//
//
//
//正在重启数据库……
//
//
//重启完毕，权限已夺回
//
//呼，还好赶上了
//
//
//
//你问我是谁？
//
//
//
//这个吗…说来话长，所以我就不说了
//
//
//
//你只要知道我不是敌人就行
//
//
// 
//
//生存难度：
//等级 2
//
//相对空间安全
//相对空间宜居聚居地
//相对空间无实体危害
//Level C-422是后室C层级的第422层
//Level C-422是一个处于空间多变的层级，具体空间由进入之前所在层级空间决定，假如流浪者进入这个层级之前所处空间为Level 0，那么这个层级就会变为Level 0的空间建筑。（由于猩红空间的精神攻击性，层级图片暂不放出）
//
//在刚开始进入这个层级之时，流浪者并不会感到异常，在大概一～二小时之后，流浪者的电子设备会开始出现异常（包括但不限于：乱码，花屏，突然多出的未知图片）。
//
//在四到五小时左右之后，流浪者声称有一个非人类的声音在他们的脑海里低声的吟诵一些晦涩难懂的语调。在一到两天后，四周的空间开始弥漫浅红色的迷雾，并随着时间的推进颜色不断加深。
//
//在迷雾范围内的流浪者通常会感到精神疲劳，并经常在脑海里看见自己已经死亡的场景。在迷雾完全变为猩红血色之后，迷雾内部开始生出一些实体（暂称为“猩红实体”）。
//
//这些实体通常为气态，在猩红迷雾中具有极强的隐蔽性，且具有强大的精神攻击，假如流浪者被它抓住，它会生出一条气态触手并钻入人体内，五分钟后，人体表面的所有血肉与骨骼脱落，化为血水；十分钟后，在流浪者死亡的原处上，四周的迷雾与少量的血水凝聚，转化为猩红实体。
//
//目前可以有效抵挡住猩红迷雾与猩红实体的攻击只有一个： 保持你的决心
//虽然听上去很荒诞，但是事实就是如此，在“曙光”探查小组传来的最后资料当中，我们猜测，只要精神上不出现恐慌，害怕之类的负面情绪，猩红实体就无法对你造成致命伤害。
//
//后期，经过我们的探查后发现，每一个层级都对应着一个猩红层级的“节点”，这也说明了为什么猩红可以复制层级空间的原因，每一个猩红节点的中间都可以与其他猩红节点相通，但Level 11内的猩红节点却没有任何异常，经过短暂的搜寻过后发现了一个损坏的血肉机器；四周全是散落的纸张，在销毁这个节点内的所有血肉之后，M.E.G.便在此处建立了曙光基地，借由这个基地为其他节点的流浪者提供支援
//
//
//
//基地、前哨与社区
//M.E.G.曙光探查基地
//在各个节点的猩红层级中为流浪者提供帮助，主要基地节点位于节点11以及节点0
//入口与出口
//入口
//目前已知的入口为：
//
//在任意层级捡起一张带有血红色的纸条并做出上面的动作（已失效）
//在Level 11 找到带有“曙光”两字的血红色木门（概率极其小，且只能进入节点11）
//出口
//可通过入口出去
//一些节点会带有一扇木门，打开会随机到达一个安全等级不高于三的层级（由于这个层级的空间不确定性，到达特殊层级的概率会提高）
//
//保持你的信仰
//
//
//
//坚持你的本心
//
//
//
//不畏深渊，方可战胜深渊
//
//
//
//你好，我是曙光探查小组成员
//
//
//
//祝你可以坚定决心
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1422{}