//LEVEL C-471
//评分: 
//+35
//+
//–
//X
//“玉兔-戊辰号，向您致意”
//
//自称玉兔的机器人孜孜不倦地重复着那段录音
//
//兴许就如玉兔所说，嫦娥奔月从不存在
//
//满目芜白的月壤，便是这世上最华丽的墓葬
//
// 
//
//生存难度：
//等级 4
//
//环境恶劣
//真空环境
//无有害实体
//Level C-471是后室C层群的第471层。
//
//描述
//Level C-471是一片充斥着大量灰白色块状土壤组成的悬浮石块的失重真空空间，层级中央漂浮着一座由未知金属焊成的建筑。整个层级内悬浮着共119块灰白色石块，富含天然的铁、金、银、铅、锌、铜、锑、铼等矿物颗粒，体积从2m³~37m³不等。石块的位置几乎都位于同一平面上。层级中央是一座椭圆形金属建筑，建筑外壳由银色的合金焊接而成。合金硬度极高。由于一种诡异的磁场作用，所有采集或破坏金属的尝试都以失败告终。在实体玉兔-戊辰号储存的资料中，我们可以得知建筑名为“广寒”。
//
//“广寒”的侧端开有共3扇金属门，门板正中间各安装有一块黑色面板，面板所带有的DNA鉴定系统依然可以正常使用，所有人类都可以通过将手掌放在面板上的方式来通过验证并进入“广寒”内。“广寒”内容积约有9000余m³，墙壁内侧安装着共3000架长约2m，，由金属与透明材质拼接而成的休眠舱，休眠舱均已失效，舱内仅剩少量未分解的无机物残渣。
//
//“广寒”内有大量高效的氧气压缩储存装置、压缩营养液、水分自循环装置与温控装置，但氧气压缩储存装置内的氧气与外层储仓内的营养液已经耗尽，仅剩水分自循环装置与温控装置仍在使用“广寒”内储仓里的剩余燃料正常工作，以及少量休眠舱内还残留有少量营养液。燃料为一种蓝白色液体，成分未知，热值极高。营养液为一种淡绿色半透明流体，含有人类生存所需要的几乎一切营养物质。但二者带出层级后都会变成普通杏仁水。同时，“广寒”内曾存在着一个友善机械实体“玉兔-戊辰号”，以及大量出于未知原因而停止运转的同类机械体残骸。“广寒”内的温度一直稳定在23℃左右。
//
//Level C-471内没有重力与空气的存在，且在“广寒”外没有稳定光源。当从层级中央朝某一方向移动超过10km后，将会晕倒并在10秒后从“广寒”内醒来。由于层级内空间为失重的无光真空，环境恶劣，没有高价值的资源，没有充足准备的话很难在层级内生存。所以M.E.G已经管控了目前所有已知的层级入口，没有充分探索准备，或拒绝登记信息的流浪者将被强制劝返。误入的流浪者可以寻找驻扎的M.E.G据点成员寻求帮助并离开层级。
//
//实体
//玉兔-戊辰号：
//玉兔-戊辰号（下文简称为“玉兔”）是一只友善的机械半智能实体。玉兔高1.6m，由一个长方形主体，3只灵活的可伸缩机械臂，主体顶部的两个耳形传感器与主体底部的推进器组成。组成玉兔的金属与构成“广寒”外壳的材质相同，玉兔具有一定的智能，内部储存着部分珍贵的文献资料。玉兔具有一定的战斗能力，配备有某种现有科技难以理解的粒子撕裂器，对大部分人类友善。但是玉兔会无差别攻击任何胆敢破坏“广寒”的实体。在1986年Level C-471被发现后，经过交涉，玉兔被Dr.Perado领走，M.E.G的机械守卫代替了玉兔的位置守卫“广寒”的安全。
//
//基地、前哨与社区
//M.E.G. “伐桂者”
//友善
//未配备武装，但可以控制层级内的武装机器人自卫
//共有7人
//携带有大量压缩氧气与食物
//携带有相关研究器材与足以在真空中活动的装备
//一般驻扎在“广寒”内
//入口与出口
//入口
//在Level C-470的一座供奉着蟾型神像而非金乌的庙堂里做出亵渎神像的行为，将被传送到“广寒”内
//出口
//在“广寒”内躺进任意休眠舱后睡眠，将会在Level C-470内醒来
//尝试卡入灰白色石块内，将会切入Level 1
//-
//-
//-
//-
//-
//-
//
//附录 C-471 -A
//
//附录 C-471-A是在玉兔-戊辰号的主机内储存的记录总集，它为我们了解Level C-471的历史由来，与对项目“初龙”的研究提供了很大的帮助。可惜的是，由于年代久远，部分的记录已经丢失。记录原文为一种前华夏使用的古老文字，我们已经将其翻译成了易于理解的现代汉语。
//
//- 关闭
//报告：检测到未知的空间旋涡
//
//等级：9级空间波动
//
//时间：娥纪24年2月1日0时0分
//
//位置：东海沿岸，羿曾经的旧都遗下的巨坑
//
//原因：推测为羿传送时扰乱了空间链，使空间出现了大幅度扭曲
//
//应对：已经派出勘探机器“☶☱”进行探查
//
//- 关闭
//报告：侦测到未知生命体
//
//内容：勘探机器“☶☱”发现一只巨型的未知生命体，在跟踪过程中不幸被发现，全灭，传回的记录中可以发现一只巨型未知生命体在东海沿岸的无人区内出没。从勘探机器提供的信息内可以得知，该生物体长约四万余米，或许还会更大，单由人眼观察难以辨别其具体体型大小。生命体三足着地行走，表皮较湿润，布满小孔，具有渗透性，体表有许多疙瘩，内有毒腺。生物的每足生有五指，指端长有利爪，指间有蹼。该生物通体洁白，外形类似地球上的两栖动物蟾蜍。生命体似乎具有一定智能，对其他生命体怀有较大敌意，具有进食、排泄与睡眠等行为，水陆两栖。其他关于此生命体的信息尚未明了，需要进一步进行谨慎勘查。因为记录中该生物具有一定的智能，我们将在后续的行动中尝试派出交涉机器与其进行简单沟通。
//
//- 关闭
//报告：对“玉蟾”的研究与响应的应对措施
//
//内容：经过对东海沿岸出现的未知生命体的紧急调查，我们将其命名为“玉蟾”。“玉蟾”是一只体型巨大，对其他生命体怀有强烈恶意，具有高度智能的蟾蜍型生命体。“玉蟾”体长约48000m，体宽约42000m，它周身围绕着某种可以被它自己控制的奇异磁场，导致它巨大的体型可以克服重力的强大作用，并且正常在地球上生存。但是维持长时间的强磁场似乎会消耗“玉蟾”大量的身体能量，导致它不得不每天耗费大量的时间进食。
//
//“玉蟾”的消化系统出乎意料的高效，且它庞大的身躯并没有像我们想象中耗费巨量的能量去进行正常运动，“玉蟾”是杂食性动物，并且它的消化系统有着某种能够将无机物消化且转化为能量的奇特效应，但是这种消化是有极值的，如果在短时间内食用大量无机物，“玉蟾”的消化系统将对无机物提高抗拒性。在短短的9天内，“玉蟾”便已经将东海的海岸线向内陆蚕食了6km。这次我们派出的交涉机器在两天前利用巨大的声波发生器初步与其取得了联系，令人震惊的是，“玉蟾”似乎能够听懂我们的语言，并在我们发声期间驻足聆听。但它并未在我们表达了善意之后表现出冷漠之外的任何情绪。“玉蟾”在随后继续疯狂地吞噬着目所能及的一切，并且摧毁了我们派去交涉的机器人。
//
//综上所述，我认为必须采取强硬措施，先撤离海岸附近的民众，并尝试阻止它的进食行动，它已经造成了比预料更多的破坏，并且可能会造成更多。
//
//- 关闭
//报告：对“玉蟾”的行动结果以及一些相关的结论
//
//内容：在发现“玉蟾”11天后，我们尝试使用一些特质的武器对“玉蟾”进行了攻击试验。下列是攻击的结果。
//
//实验一：
//
//使用武器：基础射击
//
//结果：特质的巨型子弹未能对“玉蟾”表皮造成任何损伤，当子弹撞击在“玉蟾”表皮上时，子弹所携带的动能瞬间被未知效应弹回。“玉蟾”似乎并未察觉到此次攻击。
//
//实验二：
//
//使用武器：热能轰击
//
//结果：“玉蟾”未对高强度的热能武器轰击表现出任何反应，强大的热能在靠近“玉蟾”时飞快被转化为向空气中扩散，并且没有造成任何损伤。
//
//实验三：
//
//使用武器：粒子撕裂器
//
//结果：经过调查实验，微观层面上组成“玉蟾”的微粒为一种我们从未见过的纯白微粒，这些微粒被其身周的一层诡异磁场所捆绑，我们的武器难以造成效果，但“玉蟾”为了应对我们的攻击大幅提高了磁场强度，同时我们检测到“玉蟾”的身体热量在短时间内急剧减少，之后“玉蟾”在驱逐我们后进入了休眠。
//
//- 关闭
//在“玉蟾”苏醒之后，我启用了部分远程通话机器人，再次尝试与其进行交涉。这次“玉蟾”回应了我们的交涉请求。下面是对话录音。
//
//[开始录音]
//
//研究员：你好，这里是地球智能生命人类区域集群社会“娥”在向你请求交涉。
//
//“玉蟾：”……
//
//研究员：如果你成功接收到这段讯息，烦请做出回应。
//
//“玉蟾：”烦人的虫子。
//
//研究员：我希望你能够将我们视为平等的智慧生命，而非带有侮辱性地对我们呼来喝去。尤其是在我们刚刚发现了或许能够在某些程度上伤害你的情况下。
//
//“玉蟾：”……汝想要什么。
//
//研究员：首先，你是怎么来到我们的星球的。
//
//“玉蟾：”与汝何干？
//
//研究员：请注意，你现在是在我们的星球上，我们并不是惧战。
//
//“玉蟾：”吾由于食物耗尽，进入了休眠状态。吾再醒来时，已是在汝等所在层级的海底了。
//
//研究员：我们观察到，你似乎可以进食无机物生存，所以可否请你解释为何你的食物会耗尽。
//
//“玉蟾：”……汝等这些低贱的虫子似乎管得有些太多了。
//
//研究员：是吗，恐怕是将上个你所在的地方蚕食殆尽了吧。
//
//“玉蟾：”并非如此。吾只能告诉汝这么多。
//
//研究员：既然如此，如果我们能将你送出这里，你是否有意向如此。
//
//“玉蟾：”吾只需要食物，同时吾的产卵期也要到了，吾需要足够的营养繁殖。如果能离开这个贫瘠的层级当然最好。
//
//研究员：既然如此，那么我们暂且可以保持友好关系。同时，请你不要再深入内陆。否则，我们会毫不客气的对你发起进攻。
//
//“玉蟾：”可以。
//
//[录音结束]
//
//- 关闭
//工程代号：“奔月”
//
//项目目的：构建一个强大的引力陷阱，将“玉蟾”引到仙境中，包裹在大量的岩石中。利用强压逼迫其耗费能量调动磁场，之后将体积持续增长的石球升空，使其陷入没有有机物辅助，无法进食无机物补充能量，陷入永久性的休眠。
//
//执行进程：
//
//①已经实现与“玉蟾”的交涉，与“玉蟾”的正式谈判将在7天后开始
//
//②引力系统“月心”已经构建完毕，将于6日后布置在谈判地点
//
//③谈判地点附近方圆10000km内的民众已经撤离
//
//④“玉蟾”要求必须派出3000人或更多的高层作为代表团进行谈判，并且通过操控磁场获取了大量我们高层的资料。代表团人员逃生概率极低，目前正在商议是否照做。
//
//- 关闭
//该附录似乎为一位女子所写的日记。据日记里所写，我们推测，作者便是“娥”族的一员。
//
//以下为日记内容：
//
//娥纪24年，3月5日，小雨
//
//今天我参与了引力陷阱“月心”的布置。为了实现足够的强压，“月心”将卷起一片极深，也极大的地面，包裹在癞蛤蟆身上。
//
//身为“娥”研究“玉蟾”的首席研究员，那只癞蛤蟆可是点名要我参加谈判了呢。
//
//说起来，那些平日里难伺候的要死的高层们，居然就那么欣然答应癞蛤蟆的要求了。倒是那几个好说话的一再推脱。
//
//女儿已经9岁了，今天吵着要我带她去公园。可惜今天下雨呀。
//
//雨，真美呀，薄薄的一层笼在头上，痒痒地挠着心尖，我几乎能够听到，惊蛰在雨里欣喜地欢歌。
//
//姐姐会照顾女儿的……不用我担心了。
//
//娥纪24年，3月6日
//
//明天，我就要去诱捕“玉蟾”了。
//
//……果然还是有些不舍女儿，更不舍得家乡。
//
//我为我们准备了一架空梭“广寒”，可以在引力系统启动后快速折跃逃脱，但不知道在那只癞蛤蟆的强磁场下能不能正常运行。
//
//今天与女儿去了公园，我们一起在公园玩到傍晚，看着才新生不久的太阳缓缓下山，世界陷入黑暗。我永远忘不了，女儿在三岁的那个傍晚指着天空说的话：
//
//“妈妈，你说一晚上，天就彻底黑了。”
//
//“要是夜里也能有一个太阳，该多好呀。”
//
//或许很快……就会有了吧。
//
//如果是我的话，我会把它命名成……月亮吧？
//
//窗外的风和煦地吹过我的头发。
//
//故乡真美啊……
//
//我告诉女儿，妈妈要出差一趟，时间很长很长。
//
//或许会回来吧。
//
//时间不早啦，晚安。
//
//
//
//- 关闭
//该附录为一段录像。为一位女子拍摄。拍摄者似乎是“娥族”之人。
//
//[录像开始]
//
//（一名相貌清秀，40来岁的人类女子在调试摄像头）
//
//“额……”
//
//“你好？这是我留下的一段影音资料，希望这段视频能够在这片未知的空间成功传输回家吧。”
//
//“嗯……‘奔月’计划，几乎成功了。那只癞蛤蟆的的确确是被我们封在一个石球里了，我现在还忘不了它那气急败坏的咒骂。”
//
//“这个‘几乎’，意思就是……我们未能彻底逃掉，本来计划上我们应该会折跃到撤离区内的，但是那只癞蛤蟆休眠前似乎向某个异空间发出了一道奇怪的信号，导致空间受到了波动，于是……我们就在这里啦！”
//
//“……嘿，我是说，等到我女儿成年，把这份视频发给她好吗，我还录了每年的祝福视频呦，这样女儿就会相信‘妈妈只是出差罢了’吧……”
//“……”
//“可是……我真的好想看着你长大呀……”
//
//“我好想再看一眼你可爱的笑脸呀……”
//
//“我好想在看一眼美丽的故乡呀……”
//
//“我好想……回家……”
//
//（女子的眼角渗出泪花）
//
//（背景内有人招呼女子过去）
//
//“哦，知道啦知道啦，我很快去。”
//
//“嗯，我没事。”
//
//“我马上就要休眠啦，这样可以更节省氧气和能源。女儿以后一定要成为一名伟大的科学家，把妈妈接回去呦。无论妈妈还能不能活着。”
//
//“……”
//“无论如何，不管是谁，看到这段视频，我只有一个请求……”
//
//“带我们……回家。”
//
//[录像结束]
//
//-
//-
//—-
//
//补充记录：“玉兔号”的日志记录里，在我们找到它之前，最后的记录是“资料已成功传输”。除此之外，还有一条来源未知的信息：
//
//“带我们，回家。”
//
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1471{}