//Level C-435
//评分: 
//+15
//+
//–
//X
// 
//
//生存难度：
//等级 2
//
// 
// 
// 
//Level C-435是后室C层群的第435层。
//
//描述
//Level C-435为一片占地面积约1.3万平方千米的连续山地丘陵，包含了数座城池及其附属建筑群落。Level C-435中有四季更替，冬季平均气温约5℃，夏季平均气温约25℃。
//
//OmzAP0.jpg
//一座生成于城市中央的天守阁。
//
//Level C-435中的大多数地区由广袤的山地森林覆盖，森林中主要树种包括白桦、落叶松。在低洼的山谷地带则分布着数座城市，城市建筑的风格包含了从日本镰仓幕府至明治晚期的诸多不同的特点。城市的布局是随机的，但每座城市中心部分都包含了一座天守阁或一座庄园。每座建筑中都有随机的装潢，同时会在桌面与容器内生成数量不等的随机物品，包括食物、杏仁水、木质碗筷等。
//
//Level C-435中的多数地区没有水电供应，只有极少数町屋与天守阁内部拥有水电供应。冬季的降雪偶尔会导致房屋垮塌，但是Level内的实体会迅速进行房屋的重建。少数町屋内部拥有未知来源的光源。城市路口处与天守阁内部可能生成自动售货机，售货机内部供应有罐装杏仁水，售货机可接受的货币包括永乐通宝、宽永通宝、墨西哥银元与1907年（明治四十年）之前发行的日元。
//
//在城市周围分布着村落，村落多由茅屋组成，村落周围分布着农田，农田中的作物被定格在了其成熟期。部分村落中可以找到酒屋，其中有被大型酒桶储存着的辛辣味液体“清酒”，其具体成分尚在检测之中。
//
//天守阁通常生成在城市中央，其内部拥有与外观不符的结构与面积。天守阁的内部通常表现为用门户隔开的空旷房间的组合体，偶尔会出现拥有特殊装潢的房间。包括以下几类：
//
//仓库
//表现为堆满板条箱与货架的房间，板条箱与货架一般是空置的，偶尔会有少数物资或武器被存储其中。
//
//便利店
//表现为拥有现代装潢的便利店的房间。房间内部有wifi供应，电灯无法通过开关控制。在便利店内可以找到许多前厅生产的商品，在这里可以使用1871年至2010年期间发行的日元。
//
//中转站
//表现为拥有许多口袋装传送门的房间。这些口袋装传送门可以将人随机传送至层级内的任意位置或其他Level，包括Level 178、Level 5与Level 11。
//
//眺望台
//表现为突出于建筑主体的阳台。从阳台上可以以一种不可思议的角度看到整座城市。
//
//起居室
//表现为拥有简单装潢的住房。大名会在其中生成。
//
//探索天守阁时务必在走过的房间做好标记，天守阁内部的特殊结构会导致探索者迷失于内部。天守阁有极小的概率被倒置，上一次倒置现象报告于2013年。发生倒置时层级内会出现不同程度的扭曲与地形变动。
//
//层级内的各个城市之间保持着永久的敌对状态。在城市周围与城市之外的道路上可能发生战斗，被报告的最大规模的战斗爆发于2018年10月21日，有上万足轻参加了战斗。参与战斗是不被推荐的，战斗双方的武器装备虽然普遍落后，但是仍有极大可能致使参战者残疾或死亡。如果探索者被大名招揽，那么他们将无可避免地参与战斗。
//
//实体
//在 Level C-435的不同区域内广泛分布着不同类型的实体。
//
//在所有含有建筑的区域中都有无面灵的存在。这些无面灵多受到类似“第十一效应”影响，根据推测的职能大致被分为以下几种：
//
//农民 nomin
//一般生成于村落中，会在农田中进行无目的的缓慢游荡，部分时候则会聚集在村落中心。该实体尚未有袭击人类的报告。
//
//町人 tyonin
//生成于城市外围的居民屋中。多数町人拥有语言能力，他们所使用的语言包括但不限于阿依努语、中古汉语、近古日语、荷兰语等语言。少数町人可以进行交易，杏仁水、食品与1905年前在日本流通的货币均可以被识别并进行交易。
//
//足轻ashigaru
//生成于城市外围与天守阁外部。足轻一般对探索者持有敌意，但如果探索者持有与该城的标识图案相一致的物品，足轻就不会攻击探索者。足轻一般持有武器，其武器包括枪、火绳枪、武士刀与薙刀。足轻一般成群出现，探索者务必注意所在城市的标志并将标志放在身上显眼的位置。与本城大名接触过的探索者不会被本城的足轻攻击。足轻会承接包括房屋重建、灭火与守卫城市的诸多事务，并在层级内的战争中作为士兵进行作战。
//
//大名daimyo
//生成于天守阁内的起居室中。大名通常拥有超过其他实体的知识与武力，可以使用多种语言进行交谈，包括日语、汉语、现代英语、拉丁语与荷兰语等。大名通常不会对探索者采取敌对行为，但是大名会试图招揽探索者。切记不可应允招揽。大名能够直接指挥足轻进行活动，与大名接触后足轻便不会对探索者进行攻击。
//
//在森林覆盖的其他地区，有其他实体的存在。这些实体包括以下几类：
//
//妖怪yokai
//生成于城市以外的广袤区域。妖怪对人类与无面灵均具有敌意，会对探索者进行攻击。这些攻击包括其靠本身的特殊力量进行直接攻击与弹幕danmaku攻击。妖怪的特殊能力各不相同，部分对人没有损害，而部分可能致人死亡。弹幕则是由妖怪创造的一种特殊实体，在飞行状态时一般表现为光球或光粒，击中物体后则表现为普通的石制小球或木棍。部分弹幕具有热追踪能力。探索者可以通过使用火把或投掷物品驱赶妖怪。
//
//妖精yose
//生成于城市以外的广袤区域。妖精对人类与无面灵没有明显敌意，但是会因娱乐目的对探索者进行攻击，攻击方法与妖怪类似。妖精通常比较弱小，无法对人产生伤害。
//
//神明kami
//生成于山脉顶端。神明通常具有较高智力水平，对人类持友善态度。神明可以通过超自然手段干涉层级内的自然规律。层级内的居民拥有一套围绕神明崇拜的宗教体系。
//
//基地、前哨与社区
//城市
//由天守阁、城下町与村落共同构成的建筑群落
//居民总数不超过20万
//随机分布于层级内的山谷
//Onfnc6.jpg
//一座典型的城市。
//
//阪田町
//阪田町是一个纯粹由町人组成的特殊城市，该城市没有天守阁
//该城市的大多数居民都能够进行交易
//与其他城市均保持友好关系
//居住人数2000-5000不等
//M.E.G.军势
//M.E.G.军势是由M.E.G.在本层级中建立的前哨站
//该前哨站目前由中国人与日本人共同运营，约有200人常驻于此前哨站
//已经作为一股独立势力获得了其他城市的承认
//结界维护组织
//致力于阻止探索者进入该层级
//正在用不同手段试图关闭该层级的入口
//人数约60人
//与M.E.G.军势敌对
//入口与出口
//入口
//在Level 178 中推开一扇门，有概率进入Level C-435随机天守阁的随机房间中
//跑入Level 170 中的森林，有概率直接进入Level C-435的山地森林中
//在Level 906 中阅读《日本外史》或《大日本史》超过十小时，会自动进入随机城市的入口处
//在Level 11 中进入悬挂有日本国旗的木质三层建筑，可以到达Level C-435中的随机一间町屋
//出口
//在天守阁的中转站房间内进入传送门，有概率抵达随机Level
//往山脉方向持续前进，可以抵达Level 129
//沿着农田不断前进，可以抵达Level 10
//从天守阁的眺望台上跳下，可以到达Level 63
//证明你是一个武士后，你可以进入Level C-435.1
//在天守阁中找到一幅唐卡，切入后即可进入Level C-160
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1435{}