//Level C-409
//评分: 
//+17
//+
//–
//X
// 
//
//生存难度：
//等级 5
//
// 
// 
// 
//street-789626_960_720.jpg
//Level C-409中主要街道图
//
//Level C-409是后室C层群的第409层。
//
//描述：
//Level C-409整体外观与中国的民国时代建筑基本一致，只有一小部分的建筑为现代建筑风格，Level C-409中的天空始终保持在黑夜状态，其内部的空气带有沼气、臭氧等有害气体，这导致流浪者在探索时会有一定的困难。尽管Level C-409内部的一些建筑设施较为完善，但大部分的建筑都无法进入，据幸存的流浪者报告称，都无法找到其所有入口，这些建筑内部的灯光设备始终开启，并且能看到黑影在这些建筑内不断徘徊，目前尚未得知这些灯光设备的电力来源在何处。
//
//虽然用于勘察与监控该层级地形的无人机在路过大部分建筑时，摄像画面会受到微弱干扰，但大部分的地区都是可以正常进行勘察与监控。然而当派出满电状态下的无人机后，并完成一次勘察工作后进行回收时，发现无人机都已处于低电量状态，因此，在特殊情况下，会有几架无人机因耗电已久而摔落在地，推测该层级的一些地区的特殊性质会对无人机的电量产生耗电现象。
//
//刚进入Level C-409时，该层级会变得异常寂静，当流浪者探索一段时间后，会听到类似民国时期的音乐曲风，大部分的歌唱者都来自于女性歌手，并且在主要街道的一些巷子里很容易看到留声机，Level C-409除了民国时期的音乐以外，会遇到大量实体，如钝人、窃皮者、清道夫、鬼警、骇笑者和镜鬼。此外，该层级也有独有实体，该类实体已被记录在发现资料中。
//
//发现：
//以下主要由M.E.G.组织收集到关于Level C-409的发现资料以及独有实体的记录。
//
//鬼门关
//mist-4787610_960_720.jpg
//唯一通向鬼门关地区的小路。
//
//该地区是M.E.G.组织最先发现的特殊地区，位于主要街道东南方向不到2米处的位置，在外观上是中国式的牌坊建筑，并且已经腐烂很久的样子，值得注意的是通往鬼门关地区的小路上偶尔会出现蠕灵、八层之蛛这种昆虫类实体，虽然这些实体不会拥有主动攻击流浪者的意识，但若流浪者刺激这类实体，那么其他实体就会随之一起攻击流浪者。
//
//流浪者在去往鬼门关地区的小路上会时常听到不明男人与女人的嘀咕声以及婴儿的啼哭声，有报告证明这种声音会唤醒本不该属于流浪者的记忆，且流浪者会认为这段记忆是合理的。当然也有其他特殊情况，一些流浪者会无法忍受这些声音对自己的精神折磨，而试图通过结束自己生命来解除折磨，因此建议使用杏仁水与少量的治愈水晶，这可以暂时压制这些未知声音，这两个物品可在该层级的一些基地、前哨与社区中获得。
//
//城隍庙
//该地区是距离鬼门关不远处的一座老式祠堂，其内部有一尊较为破烂的城隍爷雕像，有一顶长度为2米的香炉，且用以供奉祖先或神明的香火仍然不断燃烧，其烧出来的气味可以使流浪者在精神紧张下有所缓和，尽管有很多人员报告称并未看到有其他人员为香炉续火，但仍然在不断燃烧。祠堂内部的两侧摆放着各种古代书籍，然而书籍中的内容大部分都是空白的，只有少数的书籍的文字以未知文字书写，因此翻译的工作极其困难。
//
//也有很多物品和实体存在于其祠堂内部，这些物品和实体在发现该层级之前就已经被记录起来，尽管这些实体对外来人员没有任何敌意，但还是建议流浪者们不要靠近或与他们有任何交谈行为，我们尚未明确该行为是否会对这些实体产生敌意想法。
//
//忘川河
//该地区是位于城隍庙附近的一条较宽的小河，小河看上去十分浑浊，但从河面上能清楚看到反射在其表面上的夜空与月亮。当有来自前厅的生活用品掉落在这条河中，并且流浪者尝试将其捡起时，会发现无法捡起该类物品，有观察报告称，当流浪者捡起时，该类物品就好像变为反射在小河的河面上一样，而且当流浪者长时间注视这条河时，精神上会十分恍惚，并且逐渐朝着小河中心走去。
//
//该地区之所以被称呼为“忘川河”，是因为在城隍庙内的一本书籍唯一提到过该名称，尽管对该地区的真实信息有一定怀疑，但我们无法在任何书籍中找到其他关于这条河的名称或记录。
//
//该地区存在唯一独有的无敌意实体“忘却者”，该类实体的主要特点在于能和人员进行简单的沟通，但若对一名人员沟通次数过多，会引起该实体的厌恶。其外貌上与普通人类没有区别，唯一能区分外貌特征是，该实体的面部被很大的黑影所覆盖，并且该实体虽然拥有人类的样貌，但无法触摸到该实体的身体，被流浪者描写为“就好像是孤魂野鬼一样”。
//
//以下是一名由流浪者在该层级自主组织的的人员对“忘却者”进行一次访谈，他们之中有人在疑似告密者组织中获取到类似于Geobox1的播放设备。
//
//- 隐藏访谈记录
//受访者：“忘却者”
//
//采访者：王耀文
//
//<记录开始>
//
//王耀文：你好，能听到我说的话吗？
//
//忘却者：听到了..
//
//王耀文：靠，还真能收得到。（小声） 好的，你知道我是谁吗？
//
//忘却者：流浪者…
//
//王耀文：你..知道我的名字吗？
//
//忘却者：王耀文..
//
//王耀文：你为何在这里？是因为有什么留恋吗？
//
//（沉默了很久。）
//
//忘却者：谋杀..
//
//王耀文：你被人谋杀致死的？
//
//忘却者：什么？
//
//王耀文：我问的是，你为何被人谋杀？
//
//忘却者：忘记吧…
//
//王耀文：是信号不好吗？
//
//忘却者：告诉他们…
//
//王耀文：你说什么？我不是很懂。
//
//（忘却者发出一声尖叫，随后其身影慢慢消失。）
//
//<记录结束>
//
//
//十八层地狱
//该地区是位于城隍庙后方约200米处，此地区已被标记为极度危险地区，与中国传统神话中所描述的“十八层地狱”几乎一致，目前我们已成功探索完三个子地区的工作，并将在此处驻扎临时基地，以防止流浪者走进该地区。
//
//以下是已成功探索过的三个子地区工作。
//
//剪刀地狱
//顾名思义，拥有各种极其尖锐物品，这些物品在前厅里是随处可见的。似乎这些都拥有自主意识，它们很容易感受到流浪者的到来，并且对所有人类展开强烈的攻击。若你遭到它们的攻击行为后，请立刻逃离至我们的驻扎基地，请放心地逃跑，驻扎基地离该子地区不会很远。
//
//血池地狱
//该子地区似乎离驻扎基地约为50米处，在外观上呈现为红色的河流，并且河水不断流动，能清楚看到河面能发射出流浪者在前厅的家庭位置的投影，流浪者在看到这些投影画面会不自主地发声大哭，尽管流浪者明白这种行为是愚蠢，但仍然会哭泣，并且在哭泣一段时间后，试图了结自己的生命。
//
//孽镜地狱
//到目前为止该子地区很少有人探索过，只有一名仅存的流浪者提供观察报告，其地区内部呈现无数个镜子，各个地方都存在形状怪异的镜子，并且其数量十分多。流浪者能从镜面中清楚看到自己在以往任何地方所做的任何事情。这名仅存的流浪者声称似乎还看到镜鬼的存在，但在那之后就没目击到该实体的存在。
//
//
//基地、前哨与社区
//由于多名组织都在该层级驻守，我们无法确认这些组织中是否对流浪者有敌意，只能列举出长期驻守在该层级中的重要团体名单。
//
//M.E.G.（又名 “探险者总署”）——“引路人”基地
//大约200名特工和30名研究员。
//为研究Level C-409中的超自然现象而在鬼门关地区驻守。
//为防止流浪者意外进入十八层地狱的危险地区，已派遣4名武装人员在城隍庙地区驻守，必要时可以使用轻火力驱逐。
//可以为流浪者提供歇脚休整的地方。
//阿尔戈斯之眼
//该前哨位于主要街道区域。
//尽管对于该团体的相关信息很少，但有目击到阿尔戈斯实体。
//不建议流浪者靠近该团体的前哨站。
//Jerry的信众
//有流浪者声称有该团体成员在主要街道内向流浪者宣传教义。
//该前哨站由他们的领袖直接参与建造工作。
//有迹象表明该团体正似乎打算离开该层级。
//无羁探险者联盟（U.E.C.）
//已在主要街道的西北方向的郊区位置建立前哨站。
//曾派遣两支探索队进入危险地区——（“十八层地狱”），但已失踪。
//曾经试图驱逐“忘却者”实体，但似乎因未知缘故而失败。
//B.F.P.F.（后室家居生产厂）——“摆渡者”样本采集站点
//人数曾经保持为10名成员，每当样本采集后会严格保密该类样本。
//似乎他们经常在通往鬼门关地区的小路上，经常拦截并将流浪者劝回。
//该团体目前已从该层级中撤离。
//红星建筑队
//该团体总人数超过100人。
//他们试图在该层级中建立完善的社区，然而却失败了。
//告密者
//该团体曾在此处建立自己主要基地，但由于人员的严重损失的原因，在建造基地过程中停止。
//该团体为了与“忘却者”实体进行简单的沟通，而以Geobox为基础研制开发出特殊设备。
//他们曾将特殊播放设备售卖给一些流浪者，但目击事件很少，目前该猜想正在确认当中。
//该团体目前已从该层级中撤离。
//入口与出口
//入口
//最先被发现的入口是在Level 0的一个特殊房间，该房间的整体是木制建构，且在门窗上贴着一张诡异的神像画作。该门口由一名M.E.G.的特工发现的，当时的描述为曾在Level 0层级内发现类似“忘却者”的踪迹，当打开后瞬间就来到Level C-409内。
//在Level 89的后门逃生通道中，找到一扇标准式消防逃生门，打开后直接到达Level C-409。
//在Level 81的一个破烂的门口，并能听到来自民国时期的歌曲，找到其声源后打开门，就可到达Level C-409。
//从Level 76里找到一个通往地面的楼梯，并且往上爬，在爬行过程中可能会听到未知男人或女人的窃窃私语，不要理会，你就会到达Level C-409中的主要街道区。
//在Level 119的黑色滑梯中进行滑行，很快就会到达Level C-409。
//找到Level 127的一个锅炉，你会在旁边发现一个破败的铁门，并将其打开后就会到达Level C-409。
//在Level 129内的小路上继续行走，就可已到达通往Level C-409的鬼门关地区的小路。
//在考验过往之廊中的出口处离开，将有一定的几率进入该层级。
//若在Level C-8中寻找到一扇破烂的中国古代的门，将其打开并进入，就可到达该层级。
//在Level C-139中行走一段时间后，意外切出至Level C-409。
//若你躺在Level C-199的一间卧室的床上，醒来后你就发现自己躺在Level C-409的城隍庙地区外，并且有一定的几率“忘却者”会在你旁边注视着你。
//在Level C-225中停留至少24小时后，你将被强制传送至该层级中。
//出口
//若来到忘川河地区，并自己决定走到河中央，在河中憋气长达5分钟后，就会到达Level C-10。
//在忘川河的河中央憋气长达6分钟后，就有几率到达Level 72。
//若你被大量实体包围或在血池地狱中险些被溺死，那么你会将到达Level 139。
//在主要街道的任意郊区位置，行走至少1个小时，将会被传送至的Level 42。
//你会在城隍庙看到你曾经最喜欢的女孩，她会带你去本该属于你们的家，虽然是坏掉的家。
//其他出入口正在勘察确认中。
//
//+ 打开作者信息
//脚注
//1. 由俄亥俄州的超自然发明者乔治•布朗设计创造的跟踪特殊磁场设备，能够与这些所谓“鬼魂”进行简单地沟通，目前还无法确定流浪者获取到这个设备是否由告密者组织开发。
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1409{}