//Level C-483
//评分: 
//+1
//+
//–
//X
// 
//
//生存难度：
//等级 2
//
// 
// 
// 
//Level C-483是后室C层群的第483层。
//
//描述
//Level C-483是一片无尽的，地势平坦的森林，这里只有单调的云杉木，但云杉木的分布却十分的整齐划一，树木之间相隔2米，且及其高度也保持在同一水平。目前并未在该层级发现其他树木或植被。接着在该层级上空拥有一颗类似于太阳的发光球体，球体巨大，具体数值无法测量，由于球体的发光特性，这使得该层级始终保持着明亮，但其球体并不会如同太阳散发热量，其次该层级也并未出现昼夜更替等自然现象。
//
//另外，该层级中的树木也同样拥有诡异性质，层级上空的发光球体所散发出的光线，在被树木阻挡后所形成在后方的影子“影子”，这些“影子”并非常识中的影子，它们会吸收一切触碰到它们的东西，将物体拉入自身内部，目前没有能从“影子”中挣脱的方法。但该层级所存在的实体却并不会其影响(例如：窃皮者，肢团，猎犬等)，相反它们可以自由出入影子内部，目前无法得知这些实体如何逃出“影子”，因此这里成为了它们的聚集的地方，通常情况下，进入影子内部的实体几乎未曾被观测到自主离开“影子”，但它们同样会从影子里出现，袭击每一个靠近树木或是踩到影子的流浪者，大多数情况下它们会摇晃树枝吸引流浪者，将其拉入“影子”。据说进入“影子”后有概率能切入其他层级;影子里是一片虚无。目前这些说法尚未被证实，没有人知道影子里是什么。
//
//此外，在Level C-483中，其光球正下方没有生长出任何树木，取而代之的则是一座废弃的加油站，加油站总占地约1000平方米，与森林间隔580m，内部设置大型的超市，超市中的货架和冰箱会出现例如杏仁水、皇家罐头等，每隔30min将会重新刷新货物，值得一提的是，在超市倒数第三个货架上某一位置必然会出现一罐瓶装闪电。加油站的外部设有6处加油机，可以进行正常的运行，此外有流浪者报告：无论倒出多少升的石油，储蓄罐中石油量仍保持不变，目前这些石油来源未知。
//
//目前已证实加油站和流浪者的所形成影子是无害的。
//
//所以，任何远离加油站的行为都是致命的。
//
//基地、前哨与社区
//加油站管理部
//在加油站中，有一个由10个流浪者所构成的组织——“加油站管理部”，他们自称是Level C-483的最早发现者，拥有对整个加油站的控制权。此外，该社区愿意对切入该层级的流浪者提供帮助以及对该层级所在的4个前哨提供补给，前提是所有流浪者不能随意进去超市内部进行搜刮，否则他们将进行驱逐或是武力打击。
//前哨
//在Level C-483中，共有4处由M.E.G设立的前哨，都分布在加油站的东、西、南、北4个方向，且距离加油站300m。前哨会警告试图接近或是进入森林的流浪者，并且在必要情况进行武力驱逐。
//入口与出口
//入口
//在任意层级中，对着物体影子以10s一次的频率踩踏20次，即可切入Level C-483。
//出口
//找到加油站外围墙壁上的涂鸦，正对着涂鸦，低头默数10秒，将切出Level C-483到达Level C-484。
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1483{}