//Level C-463
//评分: 
//+20
//+
//–
//X
// 
//
//生存难度：
//变化的安全系数
//不稳定
//未知实体数量
//Level C-463是后室C层群的第463层。
//
//peach-blossom-nyingchi-sky-pink-8e1ec3de77b86c96b2f60b1e80e39ee7.jpg
//Level C-463的桃花林。
//
//描述
//Level C-463大抵表现出中国古代秦朝时期的风貌。中国古代部分文学作品有对与此层级中自然景观极其相似的地区的描绘，最早到达该层级的人尚无法确定。
//
//关于地貌
//本层级中的地貌以满山遍野的桃花林为主。面积暂时无法测量。倘若流浪者在桃林中走的太远或偏离了方向，就会感受到一阵可以席卷一切的狂风，流浪者将无法控制自己的躯体，直接被风卷到空中，到达村庄前的大路口。
//
//本层级中的昼夜气温总在17-32℃之间，温差较大。建议有前往本层级需要的流浪者携带更换衣物。
//
//关于桃树
//树上的桃花散发着异常浓郁的芳香。往往正在思考和感到困惑的流浪者经过开花的桃树旁就会遗忘刚刚所想的一切，在11到24小时后才能回忆起来。
//
//桃树的力量可以治愈人身上的伤口，能使人神情安定。但是在林中停留过久往往会感到极度的疲惫，据此推测桃花的香气具有很强的镇静和安神效果，且此处的“桃花”与前厅里的桃花性质具有巨大差异。
//
//人们当然也可以在未开花的桃树上发现形态类似于桃子的果实，它们可以被食用，尝起来香甜可口，还可以使人产生一种难以抑制的怀旧感：食用桃子后，你将不自觉地想起在前厅中青少年时期生活的一幕幕，会回想起那时陪伴自己成长的亲人、老师与朋友；如果食用桃子的对象是青少年或十三岁以下的小孩子，则会产生在前厅的伙伴重新出现在眼前的幻觉。
//
//目前暂不明确长期食用这种果实会有什么副作用。在大多数情况下，靠近桃树和适度食用桃子被认为是安全无害的。需要注意的是这些果实与下文提到的桃花枝条都无法被带出Level C-463：如果你有幸逃出本层级，并收集了它们作为研究该层级性质的生态样本，无论你在层级外如何储存它们，它们都会在半小时到3小时之内腐烂殆尽。因此M.E.G.与各方组织暂时没有方法研究该层级的生态特性。
//
//关于异常现象
//在其他层级中很常见的实体在本层级中展示出不同的外貌，详见实体一栏。
//
//如果流浪者不幸在林中迷路，可以轻轻折下开着桃花的枝条紧紧攥在手里，据一些曾经过这里的流浪者说，这样做可以保护人的平安。因为这些枝条对实体有一定程度的驱赶作用。1
//
//值得一提的是，在正常时段内，桃花林中的实体与其他层级内同类实体相比，攻击欲望与运动能力都要弱很多。它们似乎十分懒惰，并且身上有许多不明原因造成的伤口，它们只是靠着桃花稀少的树或者躺在草地上。偶尔有一些在其他层级中常见的实体会发出声音。这类似于人类的说话声，但是语言混杂。
//
//>加载完成
//“它们在毁灭这一切。”（日语）
//
//“逃跑。逃到花不会开的地方去。”
//（英语、汉语）
//
//“我们很抱歉。”（汉语）
//
//“不要走。这里不正是你追求的美好世界吗？留下吧，永远留下。”
//（几乎当今有人类使用的所有语言）
//
//关于村民与村庄
//如果你折取花枝的行为被在林中游荡的“村民”发现，只要向它们解释你的处境，就不会受到谴责。
//
//进入桃林后向西南方向行走三公里左右能发现由类人实体“村民”组成的村庄，近百座中国湖南古民居样式的房屋在一条崎岖的小道旁建立。
//
//村中可以发现许多来自前厅的动物：诸如鸡、鸭、鹅、狗和牛。目前不明白它们是怎么到达这里的。村中的小路通往远处的耕地，村民们大多数时间内在那里劳动。这个基地保持着中国古代男耕女织的自然经济模式，大多数时间内村民们对于远道而来的流浪者表示欢迎，并且没有任何敌意。
//
//村郊有一口水井。井中存放着成分不明确的液体：因为这口井时时刻刻都有类人实体在看守。它们都声称这会伤害流浪者，不允许他们接近水井。
//
//以及需要注意的是，本层级中暂未发现任何杏仁水的获取途径。若需要前往该层级，2建议自主携带大量杏仁水。这不光是出于生存的需求，也是为了在特殊的时间和特殊的实体面前保证你的生命安全。
//
//村民们敬重桃树和桃花，家家户户的神龛中供奉着被称为“桃花仙”的实体，这些类人实体把她当做神一样崇拜。所以，最好不要在它们面前破坏桃树，以及表现出对桃花神圣力量的不信服与不尊重。
//
//关于“桃花庆典”3
//明玉村中的节日。举办时间尚无规律。对于流浪者来言是分外危险的。这个时间段内，桃花的性质会颠倒，由保护人类开始影响实体。在“桃花”的影响下，林中实体的数量远远比正常时间内多，它们的速度和力量也大大增强，超过正常成年人极限的水平，它们会开始和“桃树”一起攻击人类。在“桃花”的保护下，它们能够迅速从受伤的状态中恢复过来。
//
//桃花还能不断散发出致命的有毒气体，足以在三小时内杀死一个正常的成年人。如果你找到了该层级的出口，村中的所有类人实体会突然出现在你的背后，用杀害你的方式来阻止你离开这个层级。若流浪者在离开本层级的路程上刚好赶上了这个时刻，并且流浪者还没有杀伤力大的武器和足以保障生存的装备4，活着离开本层级的可能性是0。
//
//实体
//本层级中除了被精心打扮了一番的猎犬、染成桃粉色的肢团、花花绿绿的死亡飞蛾、佩戴了精致饰品的悲尸和窃皮者等实体以外，还有以下几种独有的类人实体：
//
//“村民”
//中国古代中下层平民打扮的类人实体，拥有与人类相差无几的外貌。对待流浪者很友好。大多从事农业或手工业的工作，人类可以与他们用例如糖果等只能从外界获得的小玩意儿与他们进行交易，来换取一些精巧的工具和食物。这些食物多是中餐，它们被烹调得很美味，包括但不限于龙井虾仁、乌鸡汤、鱼香肉丝、蚂蚁上树等经典的菜肴。它们对你既像阔别已久又相见的友人，又像久别重逢的血亲，没有人能拒绝这些实体的善意。
//
//“阿清”
//身穿白衣的翩翩书生。性格羞涩内敛，不太爱同人讲话。与妻子阿红一起住在村中河边上的小屋内，以给村中幼童教书为生。他愿意尽他所能地为陌生人提供帮助，总在流浪者陷入窘境时帮忙解围。每每有人提起他的往事，他的眼中就会流露出一丝异样的惭愧和悲伤。因为个性优柔寡断和过去的神秘经历，与妻子矛盾颇多。
//
//他可以为流浪者提供住所。并且目前离开该层级的唯一方法便是给他只能在其他层次获得的物品，直到他觉得满意，乐于与你敞开心扉地交谈。你可以在他口中听到有关这个层级的一个故事，这是离开Level C-463的关键。若你感到共情并说出对这个故事的正确理解，他就可以在桃花庆典的前一夜带你找到离开该层级的一个出口。
//
//涉及该实体的档案、
//
//与实体“阿清”的交涉记录
//评分: 
//+9
//+
//–
//X
//«桃花仙传»
//“阿清”
//南境有桃林，林中有一村，曰明玉。 每春日，花开漫山。春风拂过，乱落若红雨。
//
//村中有一秀才，名卿，字不详。 其邻家有一女，名遥，美艳动人，二人自幼相识。遥喜着粉衣，桃花发时，舞于林中，甚过桃花。遥恋卿，而卿全不知也。
//
//某年桃花庆，阿遥为祭，以荐其桃。遥密与卿泣诉，叹其不公。卿不忍，许以行。阿卿以庆前夜寻其径，知遥情，许与终身，浪迹天涯。正当其将遁去，村中人闻之而至。祭司擒遥杀卿，遥以死保卿，卿去。阿遥翌日坑桃树下，此年桃更盛于他岁。
//
//后有数人夜入桃花林，见一女子着桃色衣衫于林中起舞。桃花似皆听其命，随其开败，无风花亦随之，似通人情。祭司闻之，云：“此女为桃花仙，为主桃花开败，守护我辈之灵。”后村中皆视其为入凡之仙神，珍馐奉之，以祈风调雨顺。
//
//阿卿去，无人知其处。传言云，其在南境外大千世界中为高人所救，得不死不灭之法，易容更名，重返明玉村。其为明玉村唯一来去自如之人，今犹尚存，百年换一容颜。唯有其方知之：此处无神，阿遥以桃花仙之容存世。此境虫、草木、人各存其志，纠纷时起，纷争不断。其人缔造此小千世界，谓之“大同”。唯灭此人，可毁其境；唯有毁其境，可终此悲剧。
//
//此事生于何时，已无从知。今吾记此事，博吾妻与众幼学一笑。吾妻一笑，恰如阿遥存时。
//
//
//
//采访记录
//时间：12/5/2019 4:57P.M.
//采访者：安妮·凯瑟琳·李
//被采访者：“阿清”
//记录开始
//（本文档记录了安妮·李与小队在前往未知层级的搜救过程中，一人误入了Level C-463后寻求离开方法的过程。）
//安妮·李：（在阿清家门前矗立着，等待阿清回来。看到阿清回来后招了招手）有些事情，我想我们该谈谈，先生。
//
//“阿清”：（从村中的私塾回来，抬头看见等在门前的安妮，挑了挑眉）李姑娘，先进屋吧。
//
//（“阿清”带着安妮进了院落，阿清给家门下了钥，二人坐在正厅里点了蜡烛，小声谈起话来，安妮给自己倒了些杏仁水。）
//
//“阿清”：姑娘请讲。
//
//安妮·李：您讲的那个故事，我已从别处听过了。我想知道那些有关您的过往的事情。
//
//“阿清”：……我一定要告诉你不可吗？
//
//安妮·李：（点头）为了让更多人活下去，先生。
//
//“阿清”：我曾经是“阿卿”。爱卿的卿。我好像生来就是普通人，生在山林中的小地方。我的父母，从小就和我讲，外界到处是战火与灾难。我不需要离开。但我不信，我的祖上曾经是在帝王手下干事的文官，最得帝王重用。然而他在中年帝王一统南境后罢了官，带我的曾祖父来到了这片山林中。
//
//“阿清”：过去的我不认为在山野中隐居是多大的觉悟，我若是有祖上的才干，我一定能干出一番比他更大的事业来！因此，我开始跟着村里的先生读书。我也的确是有些读书人的聪慧灵性，教我念书的先生很喜欢我。十八那年我就考中了秀才。我答应陪我长大的阿遥，天底下的荣华富贵，大千世界内的良辰美景，我全带她享受完，看个遍！我也让她做个满腹经纶的才女，我所学的一切、我所见的一切，我都要传给她，让她和我一起感叹人世之美！
//
//“阿清”：我提到这些，她就脸颊泛红，然后笑好一会儿，让我别瞎说。但我能察觉到，她的笑是那种发自内心的欣喜，她爱听我说这些。
//
//“阿清”：不错，的确是有人来举荐我去做官了。然而就在启程前一天日里，我怎么也找不到阿遥。我去问她的父母，他们就一副木讷寡言的样子，和平日里的亲切根本不一样。他们想赶我出家门，我也早就，发现村中的人对我的态度变了。我考中之后，他们看我仿佛我是一个怪胎，一个瘟神，人人见了我就绕开走，在那天又格外明显。我疑惑这是为什么的时候，阿遥又出现了。她说，她要我带她走。
//
//“阿清”：我起初以为她是等不及了。但是她掉了泪，她说有人要害她。我便带她跑，路上不得不穿过桃花林，然而桃花林里净是些像被激怒了的飞禽走兽，连花尖锐的藤条也在飞长。我一路保护她，跑到最后，终于没有路了。
//
//“阿清”：后来你知道。她保护我，我逃了出来。我宁愿我没有出来，你知道吗？我到了一个地方，我发现那里放着一个巨大的仪器……类似你们那个能往上面打字的东西吧。上面放映着的，是我在过去所见一切的景象。那个仪器里面还有个可以打开的本子。我走上前去翻开了他，上面已经全数规定好了：我该是个什么人，我该是什么样的出身，我该有什么样的伙伴……我的一切，都被安排得明明白白。乃至我到那里前，发生的最后一幕：我的青梅以生命，换我逃出了这个地方；而她，被那些家伙活埋在了林子里。从此以后，她被抹去了所有和我相关的记忆，她成了“桃花仙”。在那之后，本子上再也没有字迹了。
//
//“阿清”：我曾引以为傲的努力，只是一个陌生者为我编写好的剧本。而我，在给这一切的创造者上演一场真是“浪漫”的戏剧……多么讽刺啊。
//
//“阿清”：活了半生，以为自己一直都是为自己而活，以为做出了一番了不起的成就。殊不知，我连一开始决定自己想成为什么样子的余地都没有。为了满足他的趣味，也可以把我毁掉。但我不是一个生命吗？我所追求的、我所爱的、我所厌恶的，不都和他相差无几吗？他置他自己追求的“大同”于何地呢？
//
//“阿清”：可是我不得不认命啊。我在那个地方哭。哭得撕心裂肺，哭得一塌糊涂。我不甘心哭，可我也失去了改变这一切的勇气：我怕啊。我怕我改变这一切的决心，也是那个人的剧本。
//
//“阿清”：我的师父，一个人到了那个地方。他救了我。他问我是否想要报仇，我试图赶他走。我觉得他也是那个人给我安排好的，但是他只是冷冷地站在那里，甚至找了把椅子坐在那里看我哭。他一点想要推进剧情的意思都没有。我问他，为什么不骂我一顿或者打醒我？他说，那是徒劳的。他没有改变我的义务，同样，他也没有完成剧本的义务。如果我想报仇，如果我想改变，那就跟他走。
//
//“阿清”：我倒也没力气哭了，便跟他走。他教了我他所会的一切。他无法来到这里，但是我能。我带着他的功法回到了这里，有了新身份，我叫“阿清”。
//
//“阿清”：然而我还是在迷茫。我到底是谁，我到底该做什么……师父教给我，要善待众生。我便开始救来到这里的人，想方设法让他们脱离这个地方所设下的剧本。除此之外，我好像什么也做不到。我娶了阿红，一个外乡的人类。她很爱我。但我呢？我爱不爱她呢？
//
//“阿清”：就这样，这个状态一直持续到现在。我还是这个模样的家伙。一个拔剑四顾心茫然的独行客。
//
//安妮·李：原来，是这样吗……我明白了。感谢您。对了，阿红姑娘呢？
//
//“阿清”：在田里还没回来。对了，我明天带你走。
//
//安妮·李：为什么？祭司还没来啊。
//
//“阿清”：现在逃更安全，放宽心吧——还有一件事，李姑娘。
//
//安妮·李：怎么了？
//
//“阿清”：我们都是一样的。都是被安排好了一切的人。过不了多久，你们也会发现这个真相……会有更多“戏剧”出现在你们所说的“层级档案”中。但我觉得，你们一定能打破这一切。
//
//安妮·李：如果那是真的的话……我们逆天改命的资本是什么？
//
//“阿清”：是年少的勇气。请记住这一点，无论身处何地，你与你的同伴们，都不要失去勇气。
//
//安妮·李：我会的。我向您保证。
//
//记录结束
//
//
//
//>你会想知道这些。
//不明录音文件:
//时间:未知
//人物：■■，无名女情报员
//
//活泼的女声:爷爷，这画儿上画的是谁？
//
//苍老缓慢的男声:这位姑娘，是老朽的一位故人。
//
//活泼的女声:是这样啊……爷爷，我是一个情报员。我是来找这一层级的实体的。
//
//苍老缓慢的男声:这里已经没有实体了。
//
//活泼的女声:咦？！不是，这画上的题字……这不就是那个桃花仙吗，她不是实体吗？她去哪了？！
//
//苍老缓慢的男声:（沉默）从来就没有什么桃花仙。孩子，看清楚她的脸：她不是桃花仙，她是阿遥。
//
//活泼的女声：……我知道了。
//
//苍老缓慢的男声：走吧。我没什么秘密可让你挖掘的了。随便找个什么地方，林子里也好村子里也好，去和你的同类们一起生活吧。
//
//（持续良久的寂静）
//
//苍老缓慢的男声：……桃花又开了啊。
//
//苍老缓慢的男声：有时候，我也会怅然若失。懦弱的“阿卿”、陷入迷茫的“阿清”、还有如今风烛残年的■■，到底哪个才是真正的我呢？
//
//苍老缓慢的男声：我想，那不重要了。时间和勇气战胜了一切，我过去的愤世嫉俗也烟消云散。现在是什么时候，我究竟是什么人，我早已不在乎了。
//
//苍老缓慢的男声：回忆起我的过往，欢乐从未胜过忧伤。那些我过去认为的悲剧，我这个没心没肺的混账也已大多遗忘。浮生一梦，我大多都在麻木不仁和迷茫中度过。人间一场，也不过如此。
//
//录音结束
//
//
//“村长”
//一位神态严肃的白发老翁。因为身体虚弱，所以很少在村中露面。他是自Level C-463被发现开始就统领着这个层级中唯一的社区明玉村的类人实体。
//
//他的露面，通常意味着村庄中即将要举办“桃花庆典”，即为苏醒的“桃花仙”献上贡品的日子。种种迹象表明在庆典期间进入该层是危险的，但目前为止没有办法能百分百避开“桃花庆典”，安全地进入Level C-463。
//
//“祭司先生”
//戴着黑色雕花面具，不对任何人展示真实外貌的神秘人形实体。平日里少会在村庄中出现。桃花庆典前四五日开始在村中活动，似乎总有意接近在本层级停留的流浪者，但若不是临近庆典的时间，它即使到了村中也不会与流浪者进行任何言语交流。鉴于该实体对流浪者时而暧昧时而冷漠的态度，建议与它保持距离。
//
//据流浪者报告，该实体在临近庆典的时间除了在村中游荡，还会出现在桃花仙庙北方一公里的一块巨型石碑前。有时嘴里念念有词，有时只是沉默地坐在碑前。
//
//本篇信息由流浪者安妮·凯特琳·李提供。
//安妮拍摄的照片：
//
//一块风化严重的石碑，约有2.2m-2.4m高。石碑前后都刻着成段的用小篆书写的文字，这些文字似乎记载了某个组织的历史，但由于年代久远，毁坏严重，石碑上的文字大都已经难以辨认了。
//
//这是那些残存的可辨认文字经过翻译后的内容:
//
//题记：
//此戏业已开幕，你我皆为戏中人。
//
//上半部分
//何其愚钝！尸位素餐，居掌门之位而喝，自以为无所不知。却不知大道之志非众人可悟！吾敬吾师，而吾更敬大道！垂死之人，当让权与后辈，以更替之心处世。于吾所创之小千，立此方碑，以明行大道之志。
//令万物得均生，不为大同？草木竹石，飞禽走兽，若皆有万物灵长之力，安非大同乎？
//此业既成，功在千秋。天地不仁，以万物为刍狗之时日当终也。而杵逆者，乃大势所背，终将为大道所灭……
//
//下半部分
//……呜呼！何其愚昧！
//只知万物大同，却不料大同难得。
//若与天下苍生生存之权柄，则为天下之幸事；若与天下牺牲生存之权柄，则为天下之祸事！
//此小千之桃非彼小千之桃，其心中之欲若能得泄，必将化作决堤之水，为害人间。
//而愚之力虽与愚之师不差几何，但难填其心中之欲，平其心中之怒。
//愚虽为门之出粹者，而同门之兄姊皆为我所害；愚虽为尊师之门徒，而尊师亦因我而仙逝。今宵梦醒，却无人问得归路何处。无可奈何，只得以死谢罪，以报昔日恩情…
//罪过，罪过！
//
//
//
//[关闭]
//欢迎您，亲爱的流浪者。
//“桃花仙，桃源意志”
//本层级中所有“桃花”的意志体现，外形是一个穿着粉色明制汉服，语气轻浮的美丽少女，常常在临近桃花庆典时期的夜间在林中漫步轻舞，外貌、举止都与“阿清”所讲述的故事中所描述的“阿遥”极为相似。但该实体表示，并不知晓有关“阿清”的任何事情。
//
//该实体具有与人类相差无几的智慧，时常挂着看起来天真无害的笑容。她常与“祭司先生”一起待在林里，且不会在村中出现。值得一提的是，“祭司先生”并不想与其多加来往。由于接触较少，尚不能明确它对流浪者和其他人类的态度。但是它在一定程度上了解人类文明，并对人类文明抱有敬意。有关该实体的信息目前仍在调查中。
//
//
//
//加载完成
//日期：7/5/2019 3:52 P.M.
//采访者：安妮·凯瑟琳·李
//被采访者：某实体5
//
//记录开始
//
//安妮·李：我已经开始了。
//
//某实体：啊，我还有一个请求。李小姐，可以把我的名字抹掉吗？记录里用“某实体”代称我就好了。
//
//安妮·李：嗯……我尊重您的意愿。那么，我想问第一个问题：您为什么从来都不到那个村里呢？
//
//某实体：这个简单。我是依附于“桃花”存在的。换句话说，我是“桃花”本身的意志。桃树能拔起树根来跑吗？不能。村里没有桃树，没有我可以依附的事物。所以我不能去那儿。但是呢，那位戴面具的先生可以帮我。他和你……好像一样是人类哦。
//
//安妮·李：（沉思了一会儿）您如何看待人类呢？
//
//某实体：我知道，在那个地方你们建立的文明……伟大，灿烂辉煌。尽管你们有卑贱的一面，但你们能在危急关头碾弃过去的一切团结起来，且永不放弃，你们是了不起的生命——这些东西是祭司讲给我的。
//
//安妮·李：既然抱着敬意……为何还要伤害我们呢？
//
//某实体：因为这个地方的诞生是一个错误。你们的说法是……层级？嗯，这个层级是在错误里诞生的。那个人想要在自己的故事里成就一个大同世界：颂论形躯，合乎大同，大同而无己。所有生命都和人类有一样的智慧，都努力地追求自己的幸福。在各自幸福的目标达成之后，所有生命就会有一个共同的目标：团结在一起，建设更美丽的世界，实现更高的幸福。所以这个层级在他的构想中诞生了。这个设想很美好对不对？可惜他失败了啊。
//
//某实体：为了实现他的理想，他笔下的事物——层级中的一切，都有了灵性。然而有了智慧之后，所有生物的本质都是自私的。植物——譬如我，我曾经的认知中，最大的幸福是填饱肚子。我刚刚拥有智慧时也是这么想的。于是我就开始疯狂地汲取养分，四处生长，土地不能满足我，我便伤害其他生命；那些被你们称作“实体”的家伙，它们为了更安逸地活着，陷入了无休无止的自相残杀与对其他生物的伤害之中，不光是林子里的那些，“村民”们也是；来到这里的人，看到这似梦似幻的伪像后，都想要成为这一方土地的霸主。令人作呕的私欲与无情的战火无情地戳穿了表象……那是噩梦一样的图画。
//
//安妮·李：这么看来，如今这般景象，比您所说的要安稳许多了。请问这又是因何呢？
//
//某实体：那是自然。至于为什么会变成这样，是因为我们的厮杀到头了，也就是说这个层级里的资源够我们用了。什么时候的话我并不清楚了……你们人类几乎全败，用尽一切办法，终于离开了这个噩梦般的层级。我们这些植物呢，和实体和解了。我们还是一起维持着这里是世外桃源的假象，因为这里的入口并没有关闭，只是被那个创造者大大降低了来到这里的几率——想必他也知道自己造了个不成器的破烂；还是会有倒霉的人来到这里，那些“村民”呢，就友善地接待他们……我嘛就先忍着。等到我忍不住了，他们也一定下定决心留在这儿生活了。我摄取营养的意志也自然不可避免地被激发，过去拥有的一切攻击性特征也显露出来。不过自从有那个书生以后，越来越多的人成功逃出去了。我也不可避免地多饿几天肚子咯。
//
//安妮·李：您知道那块石碑相关的事情吗？
//
//某实体：你说的是寺庙附近那座碑吧？是那个创造者立在这里的。他所写的故事还在继续，可他很久很久以前就人间蒸发了。我见过他最后一面，那时人类刚刚离开这个地方。我问他他要去哪儿，他说小千之桃的故事已经结束了。这里已经容不下他了，他要写更好的故事。他想到远处去，到未曾到过的地方，要到大千世界以外去。不过大千世界以外还能有什么呢？我不相信他能到哪儿去。你看得懂石碑上那些文字吗？
//
//安妮·李：嗯。有什么关系吗？
//
//某实体：了不起。记住，你们的文化才是你们最应引以为傲的事物。那甚至是这个层级的基础。去好好了解它们吧。
//
//安妮·李：呃……我会的。我还有最后一个问题。我听说离开这里，需要一个理解故事。所以您可否告诉我一些关于这里的传说呢？
//
//某实体：你说的都是啥啊？不知道——哦，我明白了，你说的是那个娶了外人的书生讲的东西吧？啊，故事里那两个人居然想反抗这个层级缔造者的意志，无疑是以卵击石嘛！不过，那个书生倒是有意思。他好像真的有了什么了不得的力量。我期待他，他一定能改变这里的一切。他的青梅，我的这幅容貌的主人因为这个层级殒命，我想他是分外痛苦的吧。可是他会发现的，这个层级毁灭以后，他也自身难保啊……我能帮到你的，我都已经讲了。但是我讲的最后一句话，你别跟他讲。他可能会动摇。我这里有他的那篇文章，是我之前捡到的，给你吧。
//
//某实体：（叹气）其实自从我开始克制自己的本性后，我就在想一件事。我存在的意义是什么？我刚刚开始拥有智慧时，我也短暂地思考过这个问题。但是，我似乎永远也找不到答案了……我不和你们一样，没有什么东西会来教育我，成为我生命中的向导：我已经不可避免地走上了歧途，我成了一个罪犯，一个恶棍。
//
//某实体：不可抑制的欲望已经把我和其他生命的鲜血捆绑在一起。但是，最起码，我还能在很多时间内自己做主。我平日里的模样，是唯一一种把你们和我自己放在平等位置上的形式；是我自己留有的最后一丝慈悲。快点离开这里吧。无论身在何处，成为了什么样子的人，也请努力活下去，李。不要和我一样。
//
//安妮·李：（停顿良久）好的。我想我的所有问题已经得到了解答。感谢您，某实体小姐。浪费了您的时间……
//
//某实体：没关系……对了！
//
//安妮·李：有什么事吗？
//
//某实体：……如果，呃，如果你以后还能再见到现在这个模样的我的话，能带点儿糖来吗？祭司先生说，孩子们都很喜欢吃糖。我也想尝尝，可是他不愿意给我带。
//
//安妮·李：（轻笑）我会的。
//
//记录结束
//
//基地、前哨与社区
//由于环境特殊，目前这里没有任何人类组成的基地和前哨。不过由于本层级仍需大规模探索与能同类人实体进行可持续交易的性质，如果日后能寻找到通往本层级的稳定入口，且该层级的性质逐渐稳定，M.E.G.与B.N.T.G.都有在这里建立基地的计划。
//
//明玉村
//该层中类人实体“村民”的聚居地，大约有1000个类人实体以及零零星星的流浪者在此居住或停留。属于本层级中较为安全的地带。
//尽管大多数类人实体对探索外界其他层级呈消极态度，但他们中较为年轻的一部分似乎很好奇外面的世界，未来村民们会不会走出Level C-463也尚未可知。
//“桃花仙”庙
//旧时渔人至……邑人共饷之。渔人既去，密谕人，复入桃花源，我等将其与隶而从者予以桃花仙……此后桃花三千年不败，天下一片欣心。作此庙于渔人所入处，以祠仙人。
//——“桃花仙”庙院中香炉后的石碑
//
//入口与出口
//有缘者方可至此地。何处来此，往何处去? 留得此地，别泣血，迎乐来。今此地天下人皆归一家，无复彼此，得桃花仙祐，一世安宁。自何处来此，不须更寻何处。
//——“桃花仙”庙门前石碑上的刻文
//
//你会想知道这些。
//“……人生各有志。年少时的我们常做着最美丽的梦，想要变得盛大而绚烂。
//然而在追寻梦想的过程中，我们会感受到命运的残忍，无助地凝望逐渐变得如残烛般的梦想之光；有些人在现实的千锤百炼中成功了，而有些人无可奈何地选择放弃。不管你成为了什么样的人，只要你没有丢失年少立志时内心那抹纯真与善良，你就已经成为了少年的你想要成为的‘不平凡的人’。
//若人人皆如此，便有山河无恙；若人人如此，桃花源就近在眼前。这就是这个层级的意义。我的报告结束。”
//——引用自安妮·凯瑟琳·李在未知时间对Level C-463的实体所做的报告
//
//Footnotes
//1. 当然，在实体开始大规模活动的桃花庆典时间段内，千万不要这么做。因为这对于防御实体来说基本无效，甚至会让你陷入不必要的麻烦之中。
//2. 我们建议你打消这个念头。一方面，我们与这个层级和层级中的实体接触太少。另一方面，寻找本层级入口的过程太过漫长，那几乎能使你发疯。
//3. 本条目的记载内容存在争议，请结合本档案中其他资料阅读。
//4. 譬如防毒面具，这已经被证明对防护植物散发的毒气是十分有效的。
//5. 这个称呼是出于该实体的要求。
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1463{}