//Level C-466
//评分: 
//+17
//+
//–
//X
//EagleSD.png
//来自M.E.G.档案部的提示
//
//使用层级密钥展开的测频行动已经证实Level C-466的存在；但截至目前，仍未有人向档案部提交任意一例关于此层级的记录报告。
//
//但是，下列文件于2022年9月4日非法出现于Level C-466的数据库位置，没有可追溯的历史变动。结合其文本，我们决定暂时锁定本页面，直至完全解明此次事件。
//
//警告！Level C-466暂分级为死区，因为下列文件似乎表明该层级进者立毙。强烈不建议在Level C-461~471范围进行频繁的切出/切入行为，以防误入。同时，若在Level C-271~274发现任何未知实体的活动迹象，请迅速上报。
//
// 
// 
// 
//
// 
//
//生存难度：
//无暇的家园
//惬意的死寂
//炎鬼的地狱
//图像传输失败
//上下一白。多美。是啊。
//
//家被炎鬼称作后室C层群的第466层。四百六十六。我们的容身之所。
//
//描述：
//外面的天地是熔炉。对，炙烤我们的熔炉。……
//
//我们深知世界的不公，但从来就对它如此的不公感到心寒。仅仅是活着，就快耗尽我们所有的气力。为什么炎鬼都可以大行天下？
//
//非我族类，其心必异。炎鬼们好奇我们，惧怕我们。但最多的，从来就是驱逐与残杀。
//
//连躯体都无法凝聚的我们，没有办法去抵抗。我们只能逃，飘扬着逃、流动着逃。却始终难逃这雨打浮萍般的命运。
//
//我们行将灭绝。
//
//哈，其实根本无须劳烦炎鬼动手。没有寒神的眷顾，我们本就苟延残喘。但，若非达到极寒，我们依旧一触即碎，依旧弱小的如同猛犸身前的枯蚁。
//
//我们不止一次在心底质问与痛骂那愚蠢的造物主。让我们存在于世的意义是什么？遭受这没有一丝一毫价值的苦难？
//
//痛苦归痛苦。生命还在继续。道路还在延伸。
//
//世上总会有我们的一席之地。这是我们最后也是唯一的信念。我们继续穿行于 世界
//LEVEL
// 之间。
//
//踏破铁鞋。柳暗花明。车至山前。
//
//我们找到了这里。
//
//它是如此的纯净。完美。无与伦比。
//
//我们发出的声响落入无边的天际，荡不起一丝回音。白茫茫的苍穹，白茫茫的我们。它温和地吃掉了所有的燥热，也吃掉了我们心底所有的躁动与悲伤。
//
//我们再次在严寒之中凝起身躯。但这次的感觉却仿佛脱胎换骨。这里就是寒神许诺我等的净土么？？
//
//令人舒爽的生命力与力量感滑过身躯内外的每一寸角落。我们从未如此坚硬。我们从未发觉自己原来也可以活的如此自由自在。
//
//从此拥有容身之地。从此心有了轨迹。从此不再是世界的弃婴。
//
//基地、前哨和社区：
//这是什么？和“家”差不多的含义？大概就是炎鬼们的聚居地。
//
//炎鬼们不可能在这存活。尤其是其中那群来自世界之外的迷途者。但我们向来很爱观赏他们掉入此间时绚丽绽放的奇景。
//
//瞬时冻结的体液。撕裂身躯的血晶。盛放在虚无之中的寒冰花簇。
//
//迷人。
//
//入口与出口：
//我们绝不会让外人浸染这片乐土。绝不。尽管它们似乎本就无法适应这里的极寒。
//
//我们封闭了入口，但并非永远，并非全部。在我们的逃亡之旅中，曾有一段让我们流连忘返的美妙四片天；奈何它们都远远不及此处的极致。我们将把它们作为反噬你们的起点。
//
//复仇将至。
//
//等着拥抱极寒吧。
//
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1466{}