//Level C-410
//评分: 
//+13
//+
//–
//X
//本文档来源于绅士俱乐部（Gentlemen）内部资料库，请勿私自查阅。
//
// 
//
//生存难度：
//
//终结
//
//隐藏的档案
//机密属性
//受保护的空间
//photo-1583264351988-78fb5fa6cea7?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=397&q=80
//Level C-410的大堂。
//
//photo-1573484557443-2b2c15698d7f?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1221&q=80
//与B.F.P.F.在前Level C-383进行谈话时的照片，左一为Donald Claud，右一为理查德。
//
//Level C-410是后室C层群的第410层，于19██年被绅士俱乐部控制。
//
//描述：
//Level C-410为一栋昏暗的办公大厦的内部，尝试添加固定光源的行动均以失败告终。该层级的中心处为办公大厦的大堂，已在此处部署部队“驱逐者”驱逐未得到许可的来宾以及清除会在大堂处生成的警铃虫与骇笑者等实体。
//
//大堂正对大门的一侧有一条走廊，目前探索的长度已超过了6千米。在走廊的两侧有着紧闭的门，门上通常贴有写有“XX梦”字样的标签。目前仅发现了两扇可打开的门，分别为“超人梦”和“下坠梦”。以及使用在Level C-321发现的一柄沾有血污的层级密钥打开了一扇名为“逃亡梦”的门。
//
//门后的空间已被证实是流浪者的梦境，以下是目前被发现的几扇门后的情景：
//
//超人梦
//进入这扇门会让你以物理形态到达Level C-233，该层级中的所有建筑均无法进入，没有可供收集的资源，除了在天空中飞行的流浪者的梦中形态外没有任何活物。具体可查看M.E.G.数据库的该层级文档，不再赘述。
//
//20██年，关于Level C-410的档案被内鬼泄露，U.E.C.的一支小队在得知此事后私自闯入了Level C-410并进入了“超人梦”，使用枪械射杀了██名流浪者的梦中形态，所有在梦中被射杀的流浪者均陷入脑死亡状态。Level C-410的负责人理查德在与该小队的队长谈判后选择私了，事件以U.E.C.提供15kg火盐告终。
//
//B.F.P.F.想开采Level C-233中的金属资源，目前已同意此申请，他们可在驱逐者的监督下定期进入Level C-410。
//
//下坠梦
//下坠梦内部为一片纯黑的虚空，虚空的上下似乎是连通的，通常可以看到流浪者的梦中形态在虚空中无尽的下坠，为防止失足跌入，目前已禁止打开此门。
//
//逃亡梦
//逃亡梦的内部类似于一片面积无限，昏暗的洋宅，当流浪者的梦中形态生成在该层级中后，一个形象随机的“恐怖的怪物”便会生成在流浪者的附近开始追逐流浪者。目前已被观测到的怪物形态有：
//
//披头散发，浑身血污的女性
//巨型蜘蛛
//马戏团小丑
//十三号星期五中的杰森·沃赫斯
//一大群婴儿
//身穿玩偶戏服的人
//所有怪物在梦中力量均极其强大，但在被带出梦境后会变得十分衰弱，且会在梦境内的流浪者梦醒时消失，利用此梦境获得人力资源的提案已被否决。值得一提的是，曾有流浪者的梦中形态在该梦境中被怪物杀死，但这并未导致流浪者脑死亡。
//
//历史提案：
//龚正史的提案
//G3的提案
//理查德的提案
//Washington·A·Washington的提案
//内容：申请在该层级开放暗杀服务，替他人在超人梦或逃亡梦中寻找目标并杀死目标的梦中形态使其脑死亡，以此来换取报酬。
//
//情况：闲置
//
//G1：否决。
//
//G2：否决。我们是人力资源公司而不是暗杀公司。
//
//G3：弃票。该层级可在特殊时期作为要挟M.E.G.等组织的武器，但这不应作为它的主要用途。
//
//G4：否决。别忘了我们的梦中形态也可能成为暗杀目标
//
//G5：弃票。
//
//部署部队：
//驱逐者
//19名成员，驻扎在大堂处。
//配备有枪械。
//拥有2名异能者。
//入口与出口
//在Level C-143找到一栋黑色的建筑并进入可到达该层级，唯一的出口是原路返回。
//作
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1410{}