//Level C-484
//评分: 
//+17
//+
//–
//X
//这里是灵魂的诞生域
//
// 
//
//生存难度：
//等级 0
//
//安全
//稳定
//实体侵占
//Level C-484是后室C层群的第484层
//
//描述
//层级内为一个大型工厂，墙壁由混凝土钢筋材质构成，外观呈现白色。地板材质与墙壁无异，外部贴有瓷砖，瓷砖不属于任何一种已知物质构成。层级内光照来源为地板上的内嵌式光源，发光物质不明。层级内Wi-Fi覆盖。一切可拍摄物体都会失效。
//
//工厂内部共分为五层，第一层为切入的基础楼层。一层内部有着一个前台，一个通向其它区域的楼梯与电梯。在一层前台处可以与前台的迎宾魂说出自己的需要的物资并表达需要，经过多次交流，可以从迎宾魂获取的物资包含但不限于杏仁水，肉类食品罐头，淡水少数情况下他们会提供皇家口粮。如想观看其它楼层可向迎宾魂索要游客证方可游览2-4层。切出时不能携带游客证，否则会再次切入该层级。当获得游客证后，游览后需将游客证归还游客证给迎宾魂。可向迎宾魂索要实习证，当人类佩戴实习证后会暂时成为一名摆渡魂，时期为48小时。期间可与其余摆渡魂一同前往Level C-484.1
//
//工厂内部第二层内部有着许多大型机械在运作，机械在安静的生产灵魂，每一台机械旁都有与生产出的灵魂对应的标识，如3157号机械上就绘制着一条章鱼。机械周围有着摆渡灵，它们并不会因为有人的到来而改变状态。该楼层生产海洋与部分两栖生物的灵魂。想要到达三层需一直向前走，直到34576号机械旁右转弯即可找到楼梯。产出的灵魂会被在一层处统一装上运魂箱车后送至Level C-484.1——贩魂街
//
//工厂内部第三层与第二层基础结构相差不大，机械型号与第二层相比明显更大且会出现噪音。从第578953号生产机起后就是第三层的封禁区，区域由一扇未上锁的铁门与墙面隔开，门上有着明显警告标语。如人员无视警告进入则内部空间会进行转换，闯入者将会永久迷失在封禁区。该楼层生产陆地生物与其余两栖生物的灵魂。层内第“35479”号机械因不明原因停止运作，机械上面所绘画的生物不属于已知的任何一种。
//
//工厂内部第四层内墙体配色为天蓝色，机械外观为猩红色，部分大型机械上面有着类似“眼睛”与“牙齿”的图案，机械的噪音更像是嘶吼。从第887534号机后就是该楼层的封禁区，楼层顶部有许多管道向封禁区内输送不明物质。楼层内无摆渡灵，全为机械在独自运作，在此楼层内可明显听见五楼传来的机械轰鸣声。人类进入该楼层超过15分钟就会被强制切回一楼。切回后可再次游览或上交游客证。该楼层生产飞行生物与未知的灵魂。
//
//工厂内无通向第五层的方法
//
//实体
//迎宾魂
//7yISOp4KcflhsAw.jpg
//一位艺术家在征得迎宾魂同意后留下的画作
//
//描述
//迎宾魂外观为悬浮的半人形实体，没有五官。其佩戴着一个巨大的渔夫帽，服装为淡黄色且宽松的袍子，衣服下摆破烂。该实体会说人类语言，可以听懂人类所对其的要求并作出相对的回应。迎宾魂数量仅有一只。
//
//生理特征
//实体浮空，任何物体在接触的时候都会穿过，但自身可以取用物体且不会穿透。
//
//行为准则
//应当
//
//礼貌的向其索求物资
//安静的听它将注意事项
//不应
//
//不听它讲的一切
//以暴力威胁索要物资
//摆渡灵
//UmzEuSQJW21r95e.jpg
//一位艺术家在征得一名摆渡灵同意后留下的画作
//
//描述
//摆渡灵的外观为悬浮的半人形实体，配带一个与身体及其不搭的大帽子。服装为青绿色工作服，衣服下摆破烂，工作服上写着编号。数量不明。该实体不会与人主动交流。
//
//生理特征
//实体浮空，任何物体在接触的时候都会穿过，但自身可以取用物体且不会穿透。
//
//行为准则
//应当
//
//安静地观摩它们的工作
//在合适的时候提出问题
//携带游客证浏览
//不应
//
//不携带游客证浏览
//边看边指指点点
//在它们忙碌的时候提出问题
//基地，前哨与社区
//“灵魂工厂”
//员工数量不明
//生产“灵魂”
//由于层级特性无前哨
//入口与出口
//入口
//进入在任意地点出现的白色电动门即可到达
//出口
//走出一层大门即可切入之前的层级
//佩戴实习证并登上运魂箱车可切入子层Level C-484.1
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1484{}