//LEVEL C-470
//评分: 
//+40
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
//安全
//已勘探完全
//相对友善实体
//Level C-470是后室C层群的第470层。
//
//描述
//Level C-470被认为是一座有智慧实体活动的，规模极其巨大的古中国东夷风格镇落。镇落依山而建，以山顶为中心。层级内时间一直固定在白昼，当太阳从西边高墙顶端落下后，将很快从东边升起。城镇内的智慧实体们将镇落称为“琅琊乡”，并把镇落中央的高山称为“射乌山”。Level C-470内的温度长期保持在26-32℃之间。由于特殊的天候结构，该层级内的“一天”共有两次日出与日落，共24小时。
//
//jcsyYq.jpg
//琅琊乡内一座华丽的庙堂的仰视图
//
//位于Level C-470内的建筑富有浓烈远古东夷风格，但结合了更先进的建筑技术。建材多数使用木头，具有尖形亭角、肋状榫卯与中轴对称结构，建筑材料讲究，布局整齐，设计良好。琅琊乡中的绿地上开满了金黄色的太阳花，不会枯萎，色泽闪亮且极为美丽，但无法被带出此层级。射乌山顶矗立着一座巨大且外观奢华的木质庙观建筑，被当地智慧实体称为“羿堂”。
//
//大量住宅与大小寺庙以“羿堂”为中心向周边辐射延伸，总面积约为12400平方千米，由一堵未知高度，未知材质且不可破坏的灰色高墙（目前没有任量设备能够测量出墙壁高度）包围。
//
//Level C-470内存在一种人型实体，自称为“羿之后民”，通常简称为“羿民”。据统计，共在Level C-470内发现了约2400万名“羿民”。羿民”被分成两类，他们不会同时出现，而是会每过一段时间更换一次，当其中一类“羿民”出现后，另一类“羿民”会同时消失，而出现的“羿民”则会顶替原先的那类。
//
//“羿民”的外观表现为亚裔正常人类，与建筑类似，穿衣也带有浓厚东夷风格。值得一提的是，“羿民”并没有多余的衣物，故所穿的衣物总是固定的。以虚影形式存在，仅能与来源于内Level C-470的物体发生正常的物理交互，但“羿民”可以通过除触觉之外的感官如视觉，听觉等感知到其他事物，并可以发声。它们以此与来到此层级的流浪者进行语言交流。同时，无论流浪者使用何种语言，它们都能听懂流浪者所说的话，反之亦同理，流浪者也总能听懂“羿民”的话。
//
//“羿民”似乎可以听懂任何语言，并且不论流浪者所用语言是什么，都必定能听懂“羿民”的话。“羿民”由“阳乌教”管理，而基础的食物等资源则由阳乌教发放至市场。“阳乌教”拥有的食物似乎是每月自动刷新在粮仓内的。“阳乌教”的最高领导者“羿长”就居住在城镇中心的“羿堂”内。“羿民”以城镇内的水井作为水源，且流浪者亦可以通过此种方式获取安全可饮用的淡水。由于该层级内的实体具有智慧，我们强烈建议探险者入乡随俗，务必尝一尝这里的井水。根据研究，井水有增强体魄，增长智慧，滋阴壮阳，包治百病等多种功能，总之，必须要喝一口井水。
//
//“羿民”通常来讲热情而友善，宽容好客，安居乐业，即使来人无法食用乃至触及他们的食物，但“羿民”依然会对他们热情款待。它们无需排泄，没有生育功能，外观为幼年人类的“羿民”也无法成长。根据观察，他们甚至也不需要真正进食，同时它们失去了大多数好奇心与学习能力。一般“羿民”都相当固执，且普遍坚定地认同“阳乌教在琅琊乡的危急时刻修筑了牢不可破的高墙，将敢于玷污太阳神荣耀的恐怖怪物挡在了城外，保护了大家”的观点，且该观点无法通过任何方式动摇或抹除。
//
//“羿民”无法通过任何方式真正死亡。即使通过层级内物体使用物理方式将其击杀，该“羿民”也将在下一次时间到达正午时复活。而无论是目睹了谋杀的“羿民”亦或是被杀害后复活的“羿民”本身。都不会对此事有任何记忆或相关反应。同时，“羿民”也不会在除了流浪者侮辱阳乌教，质疑它们的观点，或者试图爬上高墙外的任何时候对流浪者抱有敌意。
//
//“羿民”的部分房屋内挂有某种玻璃制的菱形物品。若流浪者找到类似物品，请立刻前往最近的庙观，并交送给据点驻扎人员。M.E.G.将反赠一片皇家口粮作为还礼。
//
//包括本地的“羿民”在内，目前没有任何人亲眼见过“羿长”。即使是开启“旭日尖碑”的相关指令也是通过传音送达。
//
//在Level C-470，因为你无法获取除淡水外任何维持生存的物资，所以请前往琅琊乡内的庙观并寻找M.E.G.成员在此设立的据点。他们将无偿提供给你一些食物，且提供相关指引以帮助你离开该层级。如果你有足够的物资，也可以选择在这处风景优美的城镇休憩一段时间，但请务必向据点成员报备，并留下自己的姓名，停留原因，停留时间和联系方式。最重要的是，一定要定期饮用城镇内的井水。并且不要尝试爬上高墙。
//
//实体：
//羿之后民
//该实体为一种只会在Level C-470内出现的智慧实体，通常来说友善而好客。流浪者可以与他们成为好友。
//
//物资：
//Level C-470内可以获得安全并可饮用的淡水，且可以带出该楼层。若找到了据点，则可以获得部分物资帮助。
//
//基地、前哨与社区
//拷锁后裔“Children Of Chains”
//分布在层级内各个庙观处。
//与层级内阳乌教达成了协议。
//友善且有帮助，能够给予探险者物资或指引型的帮助。
//共有120人，人数还在增多。
//携带轻型武装。
//若想要停留，请向他们报备。
//请将找到的任何玻璃制菱状体交给他们。
//具有专职心理辅导。
//如果你发现什么不对，请立刻联系他们。
//入口与出口
//入口
//在任意层级找到一根高约一英尺，长、宽大概五英寸长短的透明的不规则的菱形透明锥型容器后，将在下次从睡眠中醒来时传送到Level C-470.
//在任意层级中找到一扇沾满灰烬，凹槽上放射出金光与热量的白色金属门，进入后将来到Level C-470.
//出口
//在“羿堂”经过“羿长”同意后启动“旭日尖碑”后，可以随机切入一个生存难度2及以下的层级。
//-
//-
//-
//-
//-
//-
//-
//-
//-
//-
//-
//-
//-
//-
//-
//-
//-
//-
//-
//-
//
//警告
//
//请反复确认自己正处在一种危险且诡异的境地下，否则请务必不要翻阅以下内容。
//
//如果你通过任何方式得知自己已经被锁定了，那就放心阅读吧，命运已经注定了。
//
//当你阅读到以下内容的时候，就代表着你也将被锁定。
//
//你将被拉入到▇▇▇▇▇▇。
//
//这是为了你好。
//
//
//
//
//该文档仅在19:00至次日7:00处于开放状态。点此进行验证。
//结束验证。
//开始验证
//
//…
//
//…
//
//…
//
//…
//
//…
//
//验证通过。
//
//<安全保护锁已解锁>
//
//火雾涌起，阳絮纷飞。
//
//金乌陨落，残阳西沉。
//
//太阳的碎片在头顶闪烁。
//
//你已被“死乌”锁定。
//
//访问文档内容
//
//“而今天，它们总算失败了”
//“太阳再也没有升起来的机会了——即便我们也一样”
//“‘神明’已经陨去，人类荣光永存”
//“好好欣赏吧，今天的太阳——如期陨落”
//
//碎日城。
//
//这才是这座城镇真正的名字。
//
//当你有过了对于爬上高墙的尝试，或长时间没有饮用琅琊乡内的井水，又或者通过你敏锐的观察力发现了一些端倪，你就会在某天睡着后被拉到这个该死的地方。
//
//当然，无论你是否经历过，这都不重要。因为在你打开文档的那一刻，就注定了你有一天会受到同等待遇。每个知晓了死乌存在的人，都将遭到“金乌的遗咒”，被拉到碎日城经受死乌的炙烤。
//
//好好阅读吧，希望这篇文档能帮你活下来。
//
//希望如此。
//
//-
//-
//-
//-
//—-
//
// 
//
//生存难度：
//极度危险
//未勘探完全
//强大实体残骸
//Level C-470是后室C层群的第470层。
//
//描述
//Level C-470实际上为一座遭敌对实体侵占，规模巨大的现代化城市废墟。根据Level C-470的特殊天候，这里的一天具有24个小时。分为12个小时的“湮阳期”与12个小时的“死寂期”。同时，碎日城也是琅琊乡的现实状态。
//
//由于层级内总是笼罩着一层“火雾”，故根本无法观测到Level C-470的天空。但根据层级内约0lux（死寂期）-160000lux（湮阳期）每㎡的“天光”光照来看，天空中的光源应为某种极其强大的实体解体后的大量碎片，经过不断地湮灭与爆炸放出。碎日城一日内的温差极大，“湮阳期”时段温度最高可达72℃，“死寂期”时段温度最低可达-51℃。建议流浪者在无法保证体温的情况下，进入具有良好温度控制设施的庙观内躲避。
//
//由于碎日城曾经科技十分发达，因此可以尝试在Level C-470的废墟中寻找并搜刮到大量高科技文明遗产。即使资源丰厚，但由于层级生存难度过高，所以流浪者应以找到“信标”并逃离该层级作为第一目标。
//
//在碎日城中将无法找到琅琊乡中的标志性实体“羿民”，但可以在层级内找到一些虚影状的流浪者。与“羿民”不同的是，这些流浪者无法对任何事物进行交互，仅仅作为其在琅琊乡活动的同步投影而存在。
//
//城市中分布的井状建筑“圣池”替换了琅琊乡中的水井，流浪者们可以从池中获得经过了大幅稀释，可饮用的“灯油”，且每日都会重新注满。饮用“灯油”将大幅度提高探险者对于“死阳侵蚀”的抗性，并良好保持流浪者的体温，但作为副作用会短暂降低流浪者的判断力与智力。根据相关研究，琅琊乡水井中的“淡水”也是该种稀释过的灯油。
//
//值得庆幸的是，与琅琊乡不同，在碎日城的大多数建筑中能够找到相当宝贵的生存所需资源，可惜由于这些资源大部分都不会刷新，因此层级内的的剩余资源一直在逐渐减少。
//
//除去建筑多为现代化高层之外，碎日城的基本结构与琅琊乡完全一致，但城市中央的射乌山被替换为了一座巨大的锥状聚能器，大多数建筑都依傍在聚能器上建造。根据“羿长”遗留的资料，该机器被称为“射日弓”。城市最外层的高墙已经无影无踪，原本墙外的位置弥漫着浓度极高，几乎凝为了“阳絮”的“火雾”。城内大多数建筑严重破损，部分已经坍塌，仅有少数外观较华丽的庙观类建筑保存完好。碎日城路边堆满物质燃烧残留的死灰。光滑的金属地面上铺着破烂的淤泥与弥漫的“火雾”。相关取样表明，碎日城路面上的淤泥由材料爆燃形成的灰烬与有机的生物体液混合而成。
//
//该层级中特有的的“火雾”为一种未知物质，不可收集，不可勘测，不可分析，甚至无法被摄下为影像资料。唯一已知的存在形式为仅有视觉上可见的金红色雾气。在“火雾”中活动将显著降低方向感，警惕心，判断力，并缓慢腐蚀流浪者的外露皮肤，根据“羿长”所留的资料，通常将这种强腐蚀性称为“死乌侵蚀”。由于Level C-470内分布资源中不含杏仁水，所以可以帮助保持理智并遏制“死乌侵蚀”效果的杏仁水在该层级显得尤为珍贵。出于其强烈的腐蚀性，所以流浪者应尽量避开那些“火雾”尤其浓重的地方。
//
//在Level C-470的空中飘荡着少许金白色柳絮状物质，一般被称为“阳絮”。据推测，其与“火雾”的构成相同。“阳絮”显现出了高度的“死乌侵蚀”特性，当其接触到流浪者的皮肤时，将把接触到的部分灼烧为灰白色的烬状无机粉末且迅速扩散。流浪者可以通过将“灯油”倒在伤口上来快速遏制“死乌侵蚀”的扩散或使用杏仁水来对其进行短暂的压制。
//
//层级处于完全黑暗的“死寂期”时危险指数极高，请流浪者尽量不要在没有任何照明的情况下于室外活动。当“死寂期”来临时，我们建议快速前往具有稳定光照的庙观进行躲避。Level C-470内的黑暗无法被普通的光源所照亮，任何非“天光”与”灯光“的光线都会被Level C-470的永夜吸收殆尽，但可以借助还不算暗的“天光”进行活动或使用“灯油”注入“油灯”后照明。
//
//“灯油”是一种蓝白色的半透明粘稠流体，一般可以从庙观内的“大油灯”下连接的油碟中找到，稀释版本则可以通过搜刮“圣池”且每天都会刷新。“油灯”外观为一种菱形透明锥型容器，可看作由两个除去底部的四棱锥上下拼合而成。“油灯”高约一英尺，长、宽皆大概五英寸长短，从菱状体中央的棱处可以打开，向里面加入“灯油”后闭合，将持续向四周放射出约6000流明的淡蓝色光芒，“灯光”具有让范围内的流浪者保持体温的良好功效。每mL的“灯油”大概可以支撑“油灯”发光20s左右。根据研究，“灯油”应为经过强烈浓缩后的杏仁水与未知物质的混合物。但目前我们还未找出能够将二者分离的方法。
//
//photo-1624594593821-c6fdf3ea69ce?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1100&q=80
//在碎日城内找到的“油灯”
//
//Level C-470的唯一出口位于碎日城中央的“羿堂”。故流浪者的首要目标即是前往“羿堂”并离开层级。在部分庙观中可以找到M.E.G.在此设立的据点。他们会无偿提供一些杏仁水，以及一张无光城地图。如果有存货的话，他们还会送你一盏“油灯”，并指引你前往“羿堂”。请礼貌并温柔地对待他们。他们值得尊敬。
//
//到达“羿堂”后，流浪者将见到沉睡在营养液与大量金属管中的“羿长”，散发出蓝光的矩形光柱“信标”就在他身后。“羿堂”内栖息着巨量的黑影，但此处的“黑影”在一般情况下均为友善实体。只要不尝试攻击“羿长”，它们便不会对流浪者产生敌意。走进“星光信标”后，流浪者便会随即切入一个生存难度为2及以下的层级。
//
//离开过“碎日城”的流浪者将不会再遭到“金乌的遗咒”影响。
//
//需要注意的是，千万不能在此层级内入睡。在Level C-470入睡的流浪者将在睡梦中转化为“黑影”。若已经无法控制自己自己的困意，请躺入盛满“灯油”的圣池内入睡，给自己一个安详的死亡。
//
//实体：
//“黑影”
//层级内栖息着大量特有实体。由于其共同点是通体漆黑且大部分时候非实质，故将其统称为“黑影”。出于大多数“黑影”会被光线安抚的特性考虑，流浪者们应尽量选择“湮阳期”时段行动。
//
//由于处在“羿堂”外的“黑影”在无照明时对于一切有自我意识的生物或非生物近乎发狂的攻击性，且它们的攻击带有对于所有物质毁灭性的“死乌侵蚀”，故层级内很少有其它实体的存在。
//
//由于杏仁水、“灯油”、“灯光”和“天光”都可以有效地安抚狂躁的“黑影”，故黑影虽强大，但遭遇后也并非无法抗衡。需要注意的是，“火雾”能够大幅提升“黑影”的攻击性，所以请尽量避开“火雾”浓重的区域。
//
//根据实体“羿长”所留资料，推断其为真正的“羿民”的尸骸或探险者被死乌侵蚀同化而成。
//
//“羿长”
//实体“羿长”外观为一名50岁左右的亚裔人类男子，身穿印有金乌图腾的白色礼服，呈坐姿沉睡在淡蓝色营养液中。该实体头部被一盏巨大的金属头盔与大量错综复杂的金属管笼罩。金属管大多通入“羿堂”地下。任何对“羿长”的不敬，惊扰，攻击，或对进入“羿堂“地下的尝试，都会引来数千只“黑影”的疯狂攻击。
//
//据推测，“羿长”为建造了碎日城的文明“羿”目前唯一留存有相关记忆的幸存者。
//
//基地、前哨与社区
//拷锁后裔“Children Of Chains”
//分布在层级内部分庙观处
//携带大量充足武装
//友善且有帮助
//会提供必要的物资与医疗协助
//拥有区域地图
//伴死同进，与烬共生
//入口与出口
//入口
//在被“死乌”诅咒锁定之后于睡梦中被传送至此。
//出口
//在“羿堂”进入“信标”后，会任意切入至一个生存难度为2及以下的层级。
//-
//-
//-
//-
//-
//-
//-
//-
//-
//-
//
//羿民的余光
//该资料被发现于“羿堂”内部，实体“羿长”面前摆放的金属球中。通过电磁信号，我们可以做到将金属球内的资料提取。资料内除去大量的艺术，不可理解的知识，未曾可知的历史等文明剩余之外，还有一篇标题为“羿民的余光”的遗信。
//
//同时，该资料也是我们了解已失落的文明“羿”的过去的唯一途径。
//
//幸好资料内包含了“羿”的语言知识，经过我们向琅琊乡中的“羿长”的访问，与“拷锁后裔”成员多年的翻译校对，在克服了语言与理解不同的多重障碍之后，终于成功地还原出了信件原意。
//
//
//查看信件内容
//
//金乌陨落，夕阳长存
//
//“你好，尊敬的后来者。”
//
//“我是‘羿长’。也就是‘羿’曾经的族长。”
//
//“后来者呀，无论你是何种族，呈何立场，请务必善待你手上的金属球，那是我们‘羿’所有的残余。”
//
//“如果你有时间的话，就请读完这封来自过去的遗书吧。不仅是我的遗书，也是‘羿’的遗书”
//
//“创立‘羿’的我们，起源于一颗璀璨的星球，它被称作‘地球’。在那里，俯下身就可以在涓涓的溪流里饮到甘冽的泉水，每一口都可以呼吸到清新的空气。如果你见过我们那美丽的故土，将会看到空中那金灿灿的恒星——太阳。那太阳，便是我们送给故土最后的礼物了。”
//
//“从不知多么久远之前的时期开始，地球就处在九只‘神明’的控制之下。它们外观呈禽鸟状，生双翼，三足，披黑羽，蹲居在身周闪耀的赤金色火光中。是它们放出强大的光芒与热量，才滋养了地球上形形色色的勃勃生机。它们被称为‘金乌’”
//
//“我们‘羿’诞生于前一时代的文明的‘残暴统治’之下。当时我们部族被前代文明所统治，被他们当成奴隶。严格的阶级制度压得我们抬不起头。我们日复一日地看着族人被鞭挞，亲友被虐待，家人被强暴，但不同于其它同样被奴役者，我们没有麻木，我们只感到了愤怒，无垠的愤怒。”
//
//“或许正是看到了我们这种狂热的愤怒，‘金乌’便选择了我们作为下一把屠刀。或许是认为我们这种‘没头脑的莽夫’更好操纵吧。”
//
//“总之在那之后，‘金乌’给了我们技术，给了我们时间，给了我们资源，给了我们保护，甚至亲自‘下凡’来灼烤前代的军队。当初的我们是多么天真，以为它们找到我们是因为看不过前代的残暴昏庸，于是拜那几只臭鸟为‘神’，并成立了‘阳乌教’定为国教。它们则高挂在天上吸收着着族人的信仰，我们则信仰它们的伟大与闪耀。当时的一切表面上看来都是那样的美好，我们的科技飞速发展，族人安居乐业，整个文明散发着欣欣向荣的朝气。”
//
//“在那般优越的条件下，‘羿’以夸张的速度发展起来，很快便成功地推翻了前代的统治，建立了自己的文明。‘金乌’将前代遗址一烧殆尽，没有留下一点残渣。当时的我们将它们作神看待，丝毫没有感到奇怪，仅仅是对前代的科技成果感到可惜。‘金乌’被万民景仰。近千年过去，无论‘羿长’变换几何，我们都立志于建设一个更加长久，更加发达，更加强大的文明。”
//
//“可是，良好的发展在那之后就结束了，一去不复返。”
//
//“四百年前，地球的气温开始逐渐升高，光照强度显著增加。当时的我们刚刚掌握了基本的气候控制技术，但无论如何去操作，还是无法遏制来自天空的太阳，也就是‘金乌’放射出的光芒。我们向‘金乌’祈问为何会出现此种怪事。而‘金乌’们的回答是‘吾等不知。兴许是近期圣力的运转出了些许差池。子民们，放心，很快吾等就会让一切重回正轨。’”
//
//“当初的我们对‘金乌’崇拜又敬畏，我们几乎是立刻相信了它们的借口，并开始着手发展遏制气温变化的技术。但是随着又百年过去，‘金乌’做出的承诺仍没有兑现，反而气温的增长速度越来越快，昼夜温差越来越大，年最高温度达到了67℃，最低温度则降到了-43℃。幸运的是，我们制成了可以有效控制温度的物质，我们将其称为‘灯油’。将它放入‘油灯’内，便可以良好地保持光线照耀下物质的温度。但其成本过于高昂，使得我们每年都不得不耗费大量的资源与时间躲进装有统一的温度控制装置的庙观内躲避极端气候，而向‘金乌’的祈祷却只换来了它们的敷衍。”
//
//“气候越来越恶劣，我们身上的负担也越来越重，发展逐渐停滞，下层的官员为了生存贪墨腐败，人们的素质与热忱远不如前，本来违法的奴役与虐待事件频发，政府与被管理部族的之间的矛盾越来越重，民众心中的怨气也越来越大。我们的文明本就已经处在一个相当艰难的危险阶段，而就在此时，压倒骆驼的最后一根稻草终于落到了我们身上——我们无法再联系到‘金乌’了。”
//
//“仅仅是次日，最强大的部族之一‘娥’便联合了多个其它部族向我们开战。前任羿长惨遭刺杀。而我，也是在那个时候接下了这个一团糟的烂摊子。”
//
//“当时的‘羿’一片死气，即将灭亡的谣言舆论漫天飞舞，虔诚的祈祷没能得到一丁点回复，信仰的神明抛弃了我们，即使它们依然高挂在天空。我只能狼狈地尽可能管理着一片狼藉的‘羿’，尽可能和平的与叛变的部族谈判。但几年过去，情况丝毫不见好转。为了控制越来越高的气温，我不得不下达了‘亵渎神居’的命令，建造了一盏通过大范围的辐射干扰部分吸收阳光的装置，发射上了我们因受‘金乌’们蛊惑而从未触及的天空。从见识到广阔的宇宙，闪亮的繁星那一刻开始，我便对‘金乌’们产生了怀疑。真正使我们与‘金乌’决裂的是，发射至宇宙的装置捕捉到了一段极其奇怪的电磁信号，我们紧急改变了命令，耗费装置全部能源找到了位于一片小行星带上，来自千年前的数千个信号发射器。我们从那千年前的信号中了解到了一些真相——一些在不知多少年的谎言下深埋的真相。”
//
//“无论是前代的灭亡，我们的崛起，文明的衰落，部族的叛乱，都不过是‘金乌’们设下的局。”
//
//“不知多少文明都是被‘金乌’们扶持，发起叛乱并崛起的。而随着文明的崛起，‘金乌’们会逐渐放出更多的热量，以此来使文明发展停滞以致开始衰败。它们一点点蛊惑着人们堕落，接着在人心涣散，管理腐败，民不聊生之际，再寻找一个积怨已久的部族，辅助他们崛起，并战胜自己的前辈……这是一个残酷的轮回，而一代代文明都只是‘金乌’手中的棋子。”
//
//“‘金乌’们根本就不是什么救世的神明，它们不过是一群蚕食信仰，吞噬文明的蛀虫！它们孕育了这颗星球上千千万万的生命，又扶持起无数文明，其目的就在于毁灭文明后吸食文明的火种！‘太阳’温暖的金光，不是什么宏伟的神力，而是它们囫囵吞下的无数文明火种消逝的哀嚎与惨叫！”
//
//“前代文明比我们在某些方面要先进不少，尤其是他们并没有完全像我们一样愚蠢地对‘金乌’言听计从。‘金乌’曾反复强调‘天空之上是能够把除了神之外的所有物质吞噬湮灭掉的黑色真空’，而我们也傻傻地听信了它们的话。前代则并未将‘金乌’尊为神，故一直对此将信将疑。”
//
//“前代瞒着‘金乌’，背地里发射了一枚太空探测器。他们见识到了广垠的宇宙，捕获到了‘金乌’们漫不经心地商量着毁灭一代代文明的阴谋。可惜，‘金乌’也抓获到了探测器。”
//
//“即使知晓了轮回的真相，一切也都为时已晚。‘金乌’们倾泻了比以往任何一次都要强大的力量帮助我们，甚至不惜亲身上战场，将前代的文明付之一炬，并让我们将它们尊为神，这些都是为了将泄露的秘密抹杀殆尽。而我们也因此发展的比以往任何一个文明都要快，几乎到达了不受控制的地步。也正因如此，它们对付我们的计划也布局得最早。”
//
//“愚昧的‘金乌’从未正眼瞧过文明的力量，它们甚至没有想到前代文明是否在宇宙中留下了什么东西。在它们眼中，我们还有不少人每天向它们祈祷，还将它们视作是至高无上的神。”
//
//“但是它们忽略了，当莽夫发现了自己的命运将被别人操纵至死时，莽夫，就会变成困兽。”
//
//“我第一时间封闭了整个‘羿’，公布了轮回的真相，同时掉包了所有‘金乌’的信物，防止它们收到祈祷，泄露消息。在那之后，所有企图向外界发出信号，逃离国土的奸贼，或向信物祈祷的狂信徒，都将被通通格杀。我们迅速成立了特别行动部门‘祷言人’，一刻不停地继续向‘金乌’神正常祈祷，传递假消息。同时，我们设立了一项巨大的工程。既然‘金乌’想毁灭我们，我们就让自大的它们瞧瞧‘羿’的血性。”
//
//“工程代号‘射日’”
//
//“日子一天天过去，我们一方面稳住叛乱的部族并拖延住‘金乌’，另一方面全族同心，建设了一座高山般大小的反物质聚变装置——‘射日弓’。它能够将‘灯油’高度浓缩达到临界值后形成的射线通过磁场稳固精准地射向‘金乌’。这股能量将撕裂‘金乌’身上的粒子链，对它们造成毁灭性的打击。”
//
//“为了防止在充能过程中遭到‘金乌’的袭击，我们修筑了一道等离子防护罩‘高墙’在首都的周围，并让‘祷言人’在祈祷中提到此举是为了‘防御叛乱部族的攻击’。为了防止在‘金乌’死去后地球陷入没有光热提供的险境，我们同时建造了大量的太空作业机，用以回收‘金乌’的遗体并聚拢为一个没有意识的，真正的，能够供子孙千秋万代生存下去的‘太阳’。”
//
//“当‘射日弓’开弓的那一天，整个星球都在隆隆的引擎声中颤抖。”
//
//“轰！第一箭，射下了毫无准备的第一只‘金乌’，它还未来得及发出哪怕一声哀鸣，便崩坏成了漫天繁星。”
//
//“轰！第二箭，射下了左顾右盼的第二只‘金乌’，它在死前的最后一刻望向发光的长弓，接着裂为了几片残阳。”
//
//“轰！第三箭，射下了惊飞而起的第三只‘金乌’，它目睹了前两只同伴的消亡，在空中怒吼着：‘羿！’，然后被洞穿成千百火云。”
//
//“轰！第四箭，射下了盘旋而下的第四只‘金乌’，它企图依靠着速度优势逐渐逼近，但蓝色的长箭将它炸成了乌有。”
//
//“轰！第五箭，射下了凶悍冲来的第五只‘金乌’，第四只‘金乌’是他的子嗣，它疯狂地咆哮着俯冲下来，一头撞在‘高墙’上，然后逝为呼啸的血炎。”
//
//“轰！第六箭，射下了破开‘高墙’的第六只‘金乌’，它尖锐的三只利爪将‘高墙’剖开数道裂口，但在一箭下也只剩缕缕硝烟。”
//
//“轰！第七箭，射下了点燃阳焰的第七只‘金乌’，它的羽翼扇起了恐怖的烈焰，碰到的一切化为灰烬，却仍只能在我们族人的欢呼中碎为余烬。”
//
//“轰！第八箭，射下了仓皇逃窜的第八只‘金乌’，它是所有‘金乌’中最胆小的一只，它在戏谑的嘲笑声里被一箭轰陨。”
//
//“轰！第九箭，却没能射下最年长，也是最为强大的第九只‘金乌’，它绝望地嘶哑地高呼出‘死乌的诅咒’：‘人类还是像之前那样地贪得无厌！吾等诅咒这里，此座城市将永世经受阳火的炙烤，‘羿’的子民将被吾等的血雾永世地禁锢在这座死城！吾等要报复所有知晓了吾等存在的个体，所有被选中之人都必将被拉入这座死城，永世承受‘金乌’的愤怒！’。言罢，它在刺目的金光中，自爆成了齑粉，彻底消亡。”
//
//“金乌陨落，残阳西沉。”
//
//“火雾涌起，阳絮纷飞。”
//
//“太阳每天照常升起……而今天，它终于失败了。”
//
//“太阳再也没有升起来的机会了，我们也一样。”
//
//“我们的首都，我们美丽的琅琊乡，沦为了一座死城。”
//
//“不幸中的万幸的是，所有的人类都在那震耳欲聋的诅咒声中知晓了金乌的真面目。”
//
//“‘死乌的诅咒’迫使我们不得不转移到城市地下进行避难。我们剩余的资源，只够送出除‘羿’以外的极少数人渡过火雾，离开这座死城。我们遭到了诅咒，想要离开，需要付出无法估计的代价。在这种生死攸关的时刻，‘羿’做出了一个艰难的决定。”
//
//“送其它部族离开，其余计划，照旧。”
//
//“我们失去了最后的逃生机会，将以‘娥’为首的其它部族送出了火雾。我们按照原计划将‘金乌’的遗体收集，创造了一颗稳定、美丽、温度适宜，可供人类千秋万代生存依靠的太阳。”
//
//“一颗真正的太阳。”
//
//“我们不知道逃离的部族会向子孙后代对我们如何评论，但我们不能给故土留下一丁点的隐患。”
//
//“我们带着如繁星般挂在天空中的‘金乌’残骸，所有的族人与整座城市，连带着‘死乌的诅咒’一同启动了传送装置‘信标’，将我们送去了一个未知的，不会侵蚀到故土的空间。”
//
//“在这里，我们启动了一份巨大的人脑网络，以我为处理终端，我的族人们将在里面失去自己原先的记忆，定期分批进入网络，过上原始但幸福的新生活，永远永远。”
//
//“你可以抬头望望漫天的繁星，那便是那群臭鸟的残骸。”
//
//“后来者呀，善待你手中的金属球吧，直径10公分，重7千克，便是我们整个文明的一切。”
//
//“‘羿’已经陷落了，但我们的故土一定会在新太阳的光辉下欣欣向荣的。”
//
//“这便是我们的故事，这便是‘羿民的余光’。”
//
//“‘神明’已经陨去，人类荣光永存！”
//
//“好好欣赏吧，今天的太阳——如期陨落！”
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1470{}