//
//建立帐号 或 登入
//The Backrooms吧
//Backrooms Fandom Wiki
//The Backrooms中文wiki官方哔哩哔哩公众号
//Discord
//主页
//
//中文沙盒站
//
//图书馆
//
//层级
//|
//实体
//|
//物品
//|
//团体
//
//故事
//|
//相关人士
//|
//现象
//|
//设定
//
//搞笑文章
//|
//国际翻译中心
//
//原创图书馆
//
//原创层级
//|
//原创实体
//
//原创物品
//|
//原创故事
//
//原创团体
//|
//原创相关人士
//
//原创设定
//|
//原创搞笑文章
//
//原创艺术作品
//|
//原创现象
//
//网站
//
//最近创建的页面
//
//最近的更新
//|
//最近的编辑
//
//随机层级
//|
//随机原创层级
//
//随机实体
//|
//随机原创实体
//
//旧页面中心
//
//本月最高评分页面
//
//历史最高评分页面
//
//最低评分的页面
//
//社群
//
//讨论区
//
//翻译预定
//|
//最近的帖子
//
//作者页
//|
//中文网站作者页
//
//加入网站
//
//管理专用
//
//后台管理
//
//职员站点
//
//所有页面
//
//会员一览
//
//侧栏
//|
//顶栏
//|
//主题版式
//
//
//
//　
//
//Level C-476
//评分: 
//+23
//+
//–
//X
// 
//
//生存难度：
//等级 4
//
// 
// 
// 
//Level C-476是后室C层群的第476层。
//描述
//photo-1546480190-f2e74620033a?ixlib=rb-1.2.1&dl=tim-umphreys-wFjSDliG7xI-unsplash.jpg&q=80&fmt=jpg&crop=entropy&cs=tinysrgb
//街景。
//
//Level C-476是一个占地约为七百万平方公里的近现代风格住宅区街道。该层级内存在有大量的同一风格的建筑物并在其中夹杂有为数不多的建筑废墟。层级内的几乎所有区域都存在有从20伦琴至2600伦琴不等的核辐射，并在一些区域内存在有微量的中子辐射。该层级的天空被乌云完全覆盖，虽然有光线从云层之上照射下来，但是并无法确定天空光源的具体位置。初步测量发现天空中的云层中存在大量带有放射性的灰尘。本层级的地表覆盖有大量积雪，偶尔存在有一些未被积雪覆盖的地区。本层级内的天气始终保持在阴天至暴雪之间，且除了一些特定区域，其它常规区域发生持续性降雪的几率高达百分之九十八以上。
//
//该层级内的积雪温度一般会维持在-110℃左右，误差不超过±5℃。地表上的积雪不会随着降雪而加厚，但是积雪上因外物活动产生的痕迹会随降雪而被覆盖。地表的街道上存在有一些没有车牌的汽车，这些车的内部部件上也没有任何产品编号或厂家信息，油箱里也没有汽油。曾有人尝试过向油箱内加入汽油以此来启动汽车，但是均因不明原因无法使汽车正常运转。该层级内零星分布着一些被雪掩埋的生锈绿皮信箱，有的信箱内会存在有一种白色的旧信封。信封中的内容仅有一行疑似用血液写成的巨大的“HELP ME”字样。在该信封被丢弃之后，信封会在四秒钟内转化为大量的黑色飞灰，这种飞灰拥有高达7500伦琴的辐射。
//
//废墟区域
//photo-1543811303-5f6310068938?ixlib=rb-1.2.1&dl=daniel-lincoln-23fk429Ayok-unsplash.jpg&q=80&fmt=jpg&crop=entropy&cs=tinysrgb
//废墟。
//
//该层级的建筑群内夹杂有少量的废墟状区域，根据猜测是因建筑物倒塌破碎而形成的废墟。正常地表街道区域的核辐射一般维持在160到300伦琴之间，而废墟区域的核辐射最高时可以达到2000伦琴。在废墟区域的附近，一般不存在降雪。值得一提的是，盖革计数器可以从废墟区域的核辐射内读取出一段内容为“SOS”的二进制明码信息。
//
//在接近该层级中心的位置，存在有一个面积约为十五平方公里深约九百米的巨型核弹坑。该核弹坑内的雪层极薄且其中辐射高达3400伦琴，在核弹坑内的人会感到极其明显的刺痛感。有记录显示在接近核弹坑中心的位置辐射达到了4100伦琴，其误差不超过±50伦琴。在核弹坑附近不存在任何建筑物，气温也比正常街区高上20℃左右。在核弹坑内的人可以听到一种类似于柴油机工作噪音的机械轰鸣声，但是到目前为止并未找到声源位置。有人声称自己曾看到在核弹坑内出现了一个“黑色，巨大，无比扭曲”的类人型身影，但该人的说辞尚未得到任何证据证实。
//
//建筑物内部
//photo-1484101403633-562f891dc89a?ixlib=rb-1.2.1&dl=naomi-hebert-2dcYhvbHV-M-unsplash.jpg&q=80&fmt=jpg&crop=entropy&cs=tinysrgb
//其中一种房间内饰。
//
//该层级的建筑物内部有着类型丰富的装饰装修、各类家具与一些书籍，但是书籍内的文字不是目前已知的任何一种人类文字。每个建筑物的内部装修都有着不同的风格，不过其中肯定会拥有正常人生活所需要的一切器材设施。只有部分建筑物接通有电力与煤气，但是任何的建筑物内都没有通水。有极为少数的通电建筑内部拥有WiFi，但是这些WiFi信号质量奇差并且存在损坏联网工具的风险。建筑物内的气温一般维持在-20℃左右，且只有不到30伦琴的辐射，不过在类似于露天阳台之类的半开放区域内可能存在有更低的温度与更高的辐射。建筑物内可以找到杏仁水，但其中会混有带有放射性的杏仁水。放射性杏仁水不具备正常杏仁水的功效，并且会使饮用者患上急性放射病。
//
//地下区域
//photo-1512093266765-564111bfb15f?ixlib=rb-1.2.1&dl=aj-colores-1tW60Gf6G60-unsplash.jpg&q=80&fmt=jpg&crop=entropy&cs=tinysrgb
//地下通道。
//
//该层级的地表上存在有下水道井，有些下水道井上没有井盖。穿过下水道井便可到达该层级的地下区域。本层级的地下区域是由布满锈迹的铁质通道所构成的大型地下网状结构，其中充斥着刺鼻的铁锈气息并夹杂有少量的腐肉味。该地下区域的一些通道内存在有少量的锈钢管道，这些管道内部大多是空的，有极少量管道内部装有冻结住的污泥水。地下区域内的气温一般维持在-27℃，并且仅存在有不到50伦琴的辐射。地下通道内偶尔会存在一些橘黄色或纯白色的信号灯，作为地下通道的主要光源存在。
//
//地下通道内存在有一些带有门阀的防水门，一般会通向另外的地下通道，但有时会通向另一种比较大型的房间。大型房间内存在有和地下通道里的一样的锈钢管道，但不同的是大型房间的管道内充满了冻结的腰果水。大型房间顶部有着并不明亮的白炽灯灯泡，被裸露在外的电线所连接而发光。大型房间内偶尔会存在简单的铝质桌椅，并可能有“生者”（介绍见下）围在桌边食用腐烂的人类身体组织。在接近核弹坑的地方，地下通道被摧毁，无法通行。
//
//实体
//O7pzkt.jpg
//一张损坏的“生者”侧身照。
//
//“生者”:
//一种类人型实体。五官模糊扭曲，只能看清大概轮廓，全身漆黑，穿着散发腐肉味的烂布状沾满黑污泥的衣服，其身体躯干干瘪无比，瘦骨嶙峋。拥有极高的攻击倾向，并表现出了正确使用工具甚至是枪械的能力，据被攻击过的流浪者称，这种实体拥有使用谋略计谋的能力。不过到目前为止，尚未有成功与“生者”发生语言交流的事例发生。“生者”极度孱弱，在常规正面作战时，一个正常人即可对抗四个未携带武器的“生者”。不过值得注意的是，“生者”一般会结群行动并随身携带金属刀具，一个“生者”集群内通常有5~12个“生者”。
//
//无论在什么情况下，“生者”都不会尝试去前往地表。如果它们的目标从下水道井口跑到了地表，它们只会围在井口附近等它们的目标重新跳下来。“生者”已被证实拥有一种除视听嗅以外远程发现人类的能力，并且这种能力会随气温的下降而提升。值得一提的是，你可以通过往你自己身上涂抹“生者”衣服上的黑泥来让“生者”无法辨认出你是人类。不过如果你在身上都是黑泥的情况下主动攻击“生者”的话，你周围所有的“生者”都会对你表现出远高于正常情况的敌意。“生者”在杀死人类之后喜欢将尸体带走，这些被带走的尸体极有可能是成为了“生者”在大型房间内聚餐所使用的食物。
//
//O7eMIe.jpg
//晴天娃娃。
//
//晴天娃娃:
//一种无攻击性的类似于玩偶的实体。它们通常出现在该层级的建筑物内部，一般是会挂在一些横杆状物件上。当晴天娃娃存在于一个建筑物内2~4个小时之后，它会瞬移到该层级的另一个建筑物的内部。当一个有WiFi的建筑物内存在晴天娃娃时，这个建筑物的WiFi信号质量将得到大幅度的提升。当晴天娃娃被人所触摸时，它会立刻瞬移到其它的建筑物内部。
//
//基地、前哨与社区
//因极端的低温与几乎无处不在的核辐射，该层级内没有已知的人类聚集地。
//入口与出口
//入口
//曾经遭受过超过200伦琴的核辐射的人或曾经在前厅中经历过战争的人在入梦时有极低的几率到达该层级的建筑物内。
//出口
//钻入被击碎的地下通道的管道，可以到达Level C-464。
//从废墟中切出，可以到达Level 0。
//在打开地下通道防水门阀门时，有极小概率这个门会连接到Level C-487。
//从核弹坑中切出，可以到达Level C-477。
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1476{}