//Level C-486
//评分: 
//+16
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//Level C-486是后室C层群的第486层。
//
//描述
//Level C-486原本是由一群流浪者在Level 11的一座大厦中乘坐电梯时意外发生故障后发现的，据流浪者回忆，当时电梯正在正常运行，突然毫无征兆的剧烈晃动了起来，电梯也随之停止了运行，内部的灯光也在1分钟后熄灭，在差不多5分钟之后，电梯门便打开了，此层级因此被发现。该层似乎处于一个大厦之中，但除了正前方有两扇电梯门以外，四周都被有着铜质感的金属墙隔绝了起来，地面上也标注着意义不明的文字，有可能是通往别处的标识，但四周都被墙壁隔绝了，外面的内容便无法探知
//
//photo-1660898110706-4288ee70d8ae?ixlib=rb-1.2.1&dl=marcus-ganahl-6KLyD-cUFhc-unsplash.jpg&q=80&fmt=jpg&crop=entropy&cs=tinysrgb
//电梯门的照片。
//
//流浪者可以选择按下两扇电梯门中间的按钮来搭乘电梯，该层级的电梯与前厅中的电梯配置基本相同，其内部有一扇镜子，两旁甚至有残疾人专用扶手。同时电梯内也有着极强的Wi-Fi信号。但有部分流浪者提到自己进入的电梯与本文档描述的全然不同，M.E.G.推测这是因为这些流浪都是从除Level 11外的入口进来的，所以看到的电梯将会有所不同。流浪者在进入电梯后可在电梯门两侧找到一排又一排写着各个层级名字的按钮，按下这些按钮即可来到对应的层级，目前M.E.G.已证实该电梯可以带流浪者来到后室C层群中大多数的层级，除个别必须通过特殊方式才能进入的或者暂未被发现的层级以外，每当有新的层级被发现时，该电梯中就会出现相对应的层级按钮。当流浪者来到自己想去的层级之后，身后的电梯门将会随之关闭并消失。
//
//在电梯运行的时候，流浪者会遇到各种突发状况，如其内部的灯光以一种奇怪的规律开始闪烁，电梯突然开始极速上升，在急速上升时显示屏上会显示层级名称超出了目前所发现的层级数，比如Level C-12093203321，Level C-3929490232等，如果这时流浪者强行打开电梯门，将会被未知力量直接碾碎。
//
//以下将列举出经过某些特殊层级时电梯会发生突发状况的层级：
//
//Level C-56
//Level C-100
//Level C-101
//Level C-144
//Level C-490
//当流浪者在搭乘电梯时，电梯偶尔会在中途停下，并会有一些无面灵与猎犬登上电梯，这些实体都受Level 11效应的影响，所以无需担心。
//
//如果流浪者在电梯运行时试图强行打开电梯门，他们会在会打开之后发现自己正处于一个未知的空间中，其充斥着各种震耳欲聋的机械工作声；在以流浪者所乘坐的电梯为中心的四周会有无数正在同时运行的其他电梯，流浪者甚至可以看到其他的电梯在他面前突然经过。整个空间的大小无法进行测量，所有被派遣去测量的人员都在纵身跳入未知空间后消失了。目前该层级已被暂时用作于与其他层级之间的枢纽，但也因为乘坐电梯的人数激增，导致流浪者想要乘坐电梯时便必须等待较长的时间。有人提出该层是由后室机器人科技在一次枢纽实验中所创造的，但该说法的真实性暂未得到证实。因为该层级存在许多的未知性，出于安全考虑，目前该层级的入口基本上已被M.E.G.封闭，只允许其内部人员乘坐以便于研究。所有关于该层的信息也被封锁。
//
//基地、前哨与社区
//由于该层的特殊性，不可建立任何的基地、前哨与社区。
//
//入口与出口
//入口
//在Level 11的一栋大厦中乘坐电梯并发生故障便有一定几率可以来到这里。
//在Level C-345的角落中找到一部电梯，乘坐它就可以来到这里，但目前该入口已被M.E.G.封锁。
//在Level C-263中的一个角落搭乘电梯便可以来到这里，当然，如上文所述，这里一样被M.E.G.给封锁了。
//在Level C-284中搭乘一部电梯也可以来到这里，这是唯一一个未被M.E.G.封锁的入口，但其具体位置极其隐匿而不得而知。
//出口
//如上文所说，在电梯内摁下想要去的层级便可以在到达后离开。
//如果流浪者试图切入进入电梯前的空间的墙壁，那么他就会在一阵痛苦中来到Level C-297。
//如果流浪者在电梯运行时强制打开电梯门并跳出去，就会有很小的几率会在昏迷之后来到Level C-498。
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1486{}