//Level C-497
//评分: 
//+26
//+
//–
//X
// 
//
//生存难度：
//等级 多变
//
//未知深度
//环境多变
//实体未知-670ca4fc67454528.jpg
//Level C－497的海面
//
//Level C-497是后室C层群的第497层。
//
//描述
//该层级表现为一片无限延伸的海洋。此海洋中的海水可供人类呼吸，但任何将其他生物带入水面下的尝试均以生物窒息死亡告终。
//
//该层级的昼夜循环规律与前厅不同，为10小时的白昼和10小时的黑夜，据流浪者报告，昼夜转换似乎是在一瞬间完成的。
//该层级处于白昼时，光照类似于黄昏。且天空的正西方存在一类似于日落时太阳的发光体。目前为止，接近该发光体的尝试均告失败。
//
//该层级处于黑夜时，亮度约为0.02流明。此时天空近似于前厅的夜空，银河一般位于天空的正中央。由于未知原因，无法准确辨认任何已知星座。
//
//Level C-497的海洋根据深度和光照可分为浅渊，迷渊，深渊三个部分，各区域的特征如下：
//
//浅渊：
//
//从0到1000米处为浅渊区。由于该区域光照充足，大部分的藻类都生长于此，以藻类为食的鱼类大多存在于该区域，且出现在该区域的鱼大多体表艳丽。
//
//在该区域的海底存在大量疑似古文明废墟，材质大多为大理石。值得注意的是，该层级并无天然大理石存在。
//
//该区域白昼时几乎毫无危险，但进入黑夜后，该区域存在大量半透明的荧光虚影，这些虚影的形态类似于白垩纪时期的古代鱼类的骨架。虚影似乎无法直接对流浪者造成伤害，但如果流浪者在他人的视野中完全被虚影遮盖，该流浪者将失踪，迄今为止未有返回的案例。
//
//迷渊：
//
//根据对比，1000米到6800米的光照相较于1000米以上的部分暗淡了许多，白昼时亮度为0.6流明，在处于黑夜时，亮度仅为0.09流明。
//
//仪器表明，这里存在着某种人类感知不到的水压，除人类外的任何生命体将直面这里巨大的水压。
//
//该海域中，只有少数生物能够在此深度生存，当然，这个深度的水域有生命迹象存在，它们多为浮游生物、甲骨鱼类，极少数的浮游生物会通过自身照明周围环境。如果将他们身上的光油抹在眼中，会把眼睛的感光度提升十倍。
//
//呼吸4000米以下深度的海水会让流浪者很难保持清醒状态，这种情况对流浪者来说极度危险，除自身保持清醒外也可以使用杏仁水等物品进行缓解这种症状。
//
//非清醒状态下的人类和其他生物对这片海域的生理反应相同——无法呼吸。直面这里巨大的水压，无一对流浪者来说不是致命的，请时刻在此海域内保持清醒。
//
//暗渊：
//6800m至7500m处亮度恒定为0.06流明，与其它区域不同，在该区域亮度不再随深度增加而降低，而是恒定不变。
//
//在该区域的海底存在大量种类不同的前厅深海生物，同时异常的存在本不该出现在该深度的蛟龙与奇虾，它们对人类并不抱有敌意，遇到流浪者时也只会无视。
//
//该区域底部为一片无限延伸的海底平原，该平原存在少量海底喷口，任何有关海底喷口源头的探索均由于过高的温度而失败。
//
//在平原处存在与浅渊区域近似的大理石建筑，这些建筑及其内部能够使流浪者保持清醒状态。该区域除大理石建筑外的部分的海水均拥有强效镇定作用。
//
//在该区域入睡极其危险。在流浪者进入深度睡眠后，除非将其拖入较浅海域否则无法叫醒。由于上一区域的水压在入睡后才会作用于人类的身体上，将该区域的流浪者拖离将会使其迅速死亡。
//
//基地、前哨与社区
//深海潜伏者
//坐落于深渊的底部
//保护到达深渊的流浪者并让他们安全切出
//探索虚无之海的存在
//入口与出口
//入口
//在Level C-10中，有小概率意外切入此层级。
//在Level C-51中潜入4500米深的海域有大概率切入此层级。
//出口
//暂未发现任何离开的方式
//附录A
//关闭文件
//在深渊的一处礁石上我们发现了一个自动录音设备，以下是录音记录
//<记录开始>
//
//00:00:00 （沉入水里的扑通声）
//
//00:00:04 （划水声）
//
//00:00:12 Miles：这里是哪，又一个神秘的海域，这里的空气令我窒息。（急促的呼吸声，海浪声和拍打水面的声音）
//
//00:00:57 Miles：Frank！噢，天哪，Frank你在哪，真该死。我好不容易才在这个鬼地方找到一个伙伴，我们才刚认识不到1小时……或许现在不是为伙伴担忧的时刻，在这里待着也不是办法，我该找找出口。
//
//00:01:04 （流浪者潜水）
//
//00:14:52 Miles：我不知道游了多久，令人惊奇的是我竟然可以在水下呼吸，甚至是说话。这里的鱼，颜色好鲜艳，就像热带鱼一样……等等，那里有亮光。
//
//00:16:08 //Miles：太棒了，是另一个流浪者，他还带了手电。嗨，你好，我是Miles，很高兴遇见你！你可以和我一起同行吗？
//
//Tom：你好，我是Tom，我也很高兴遇见你，我在这里发现了一处遗迹，嗯……它看上去是用大理石做成的，我尝试在这里切出，但是没有成功。同行吗，当然可以。//
//
//00:24:29 //Miles：怎么突然变得这么暗，远处有好多发光的亮点。
//
//Tom：没事，应该是晚上了，我有手电，那东西看起来不像善茬，我们离远点。//
//
//00:28:46 //Miles：救命，它们越来越多了，到处都是，我们被包围了——
//
//Tom：真该死，你别走太远，我们向下游，说不定另有出路。//
//
//00:36:33 //Miles：那些东西消失了，真奇怪。
//
//Tom：这是好的。额啊…不，我，我感觉我的胸口好闷。(Tom大口喘气着)
//
//Miles：怎么了，你看起来不太好。
//
//Tom：没…没事。我们继续走吧。//
//
//00:42:19 //Tom：我…我好想……睡觉，好困。游了这么久，我们或许应该休息一下。
//
//Miles：好，那你就休息一下吧，我去给你放哨。//
//
//00:48:01 Miles：Tom我觉得我们是时候走了……Tom?（拖拽的声音）TOM！醒醒Tom，醒醒啊…Tom……（抽泣声）
//好吧，又一次，我真是恨透了这个鬼地方。
//
//（此后大部分都为水流声）
//
//02:07:16 Miles：我好像看见海床了……
//
//02:11:51（有硬物掉落的声音，推测是录音设备）
//
//02:18:07 Miles：我这是切出了？这里好像还是一片海，水是透明的……（声音越来越小）
//
//<记录结束>
//
package lvls14x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1497{}