package lvls0;
//Level 16
//警告
//
//
//最新数据库中关于该层级的条目不可用。是否查阅已过时版本？（Y/N）
// 
//Y
// 
//正在搜索离线备份…
//…
//…
//找到2个结果。
//File 1 » 最后编辑日期： 06/10/----
//File 2 » 最后编辑日期： 09/12/----
//是否查阅上述文件？（Y/N）
// 
//Y
//
//
//正在读取文件数据…
// 
//关闭
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//13928497397_c295161d7d_b.jpg
//Level 16的景色
//
//Level 16是后室的第17层。该层级看起来是一个雾气蒙蒙的雨林生态环境。此层级于近期被首次发现，因此关于此层级的信息很有限...？
//
//描述
//Level 16是一个与后室之外的雨林别无二致的茂密雨林系统。唯一的显著差别就是此层级内部的重力相比于基准现实来说非常微弱。当前尚未知晓此种现象背后的成因。
//
//此层级似乎不存在昼夜循环，且一直处于黎明状态。此层级的温度持续保持在21摄氏度（70华氏度），尽管其内存在大量无法被阳光照射的遮荫区域。其内部的微弱重力只会对Level 16以外出现的生物和物品造成影响，而对此层级的本地生物不会造成影响。
//
//…我们的层级密钥搞错了吗？
//我们已经来到这里了。
//但密钥却转变了方向。
//这里的一切都和他们的报告不同…
//
//基地、前哨和社区
//考虑到此层级拥有基础的生命保障，在此建立基地理论上是可行的。然而，微弱的重力有可能对试图在此居住的居民造成长期的负面效应。
//
//入口与出口
//入口
//目前，还没有已知进入Level 16的公认方法。有报告称可以通过触碰Level 75中一块外观和铜类似的液态金属来进入此层级。
//
//…我们一开始不就是这样过来的吗？
//
//出口
//找到并爬上一棵覆盖有沙子的树会将你带往Level 46。
//
//这儿有些不对劲。这个层级曾经应该被探索过，但我们却刚刚发现它。我们已经不知道这是不是我们寻找的那个层级了。
//这里的气温下降的很快，我得找件夹克之类的东西了。
//我得把这事告诉其他人，并找出这个地方到底他妈的发生了什么事。也许他们有能解释这些现象的理论。
//如果这是Level 16…我们看的绝不是同一个地方。
//...要怎么关掉这个文本编辑器？
//
//关闭
//我和团队的人谈了谈，想到了几种可能的解释。这只是我们对Level 16为什么发生这种现象而提出的理论。我们需要搜集更多证据来支持我们的理论，因此我目前把它标为“未分级”。
//
// 
//
//生存难度：
// 
// 
// 
//50746377738_03c0424636_c.jpg
//恢复到的Level 16的图像数据
//
//Level 16是后室的第17层。此层级拥有着不断改变的地形，每隔一段未知时间就会改变自身。因为它的属性随着每次环境变化而改变，因此很难对此层级加以研究。
//
//描述
//Level 16的当前状态正处于一段冰河期，与基准现实的冰河期一致。但一个显著的区别是此地区存在的冰块拥有着具有较高反射率的反光表面。
//
//此层级也拥有昼夜循环，大约每13小时循环一次。其昼夜温度分布在6摄氏度（43华氏度）到10摄氏度（50华氏度）的区间内。
//
//此层级内的实体很稀少，但仍可被观察到。可以在此观察到大量的微光向导。这是一个不同寻常的现象，因为这些实体非常罕见，且从未观察到集体行动。 由于此层级会很快改变其地形，因此不太可能对此现象进行深入调查分析。
//
//...当这个层级发生转变时，层级密钥也随之转变。我们已经来过这里好几次了，但它看起来完全不同，所以我们从来没有注意到。
//
//基地、前哨和社区
//因为此层级不稳定的自然环境，因此此层级不适合人类生存。出于此种原因，此层级内也没有建立任何常驻基地。
//
//当环境开始改变时不要待在这里。冰川会从地面拔地而起，高耸入云。河流会突然开始从巨石中喷涌而出。四周会开始结冰，空气随之变得寒冷。小型的球状物会开始围绕在我们身边，就像是警告一样。如果你不小心，你就可能陷入到不断变化的地形中去。
//我成功地逃了出来，仅仅受了点冻伤和擦伤。其他人就没那么幸运了。
//
//入口和出口
//入口
//在Level 75中找到一个橙色的镓补丁，接触它就会把你带到这里。还有其他几个所谓的入口，但这是截至编写本报告时唯一得到确认的入口。
//
//出口
//在每次地形改变后，出口的位置都不同，但目的地是不变的。在此层级目前的状态下，找到一个覆盖有沙子的冰层，站到上面就会把你带到Level 46。
//
//注意：
//
//一旦Level 16的当前状态发生变化，以前的文件应予以归档，以防止对当前状态地形的混淆。归档条目中的信息可能不再包含准确的描述，不应该在实际生存环境中参考。
//
//真希望我们在进入之前就知道这一点。我们走进了雨林，走出来时却变成了一片冻土。
//
//+ 作者信息和图像版权


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl16{}