package lvls0;
//
//建立帐号 或 登入
//The Backrooms吧
//Backrooms Fandom Wiki
//The Backrooms中文wiki官方哔哩哔哩公众号
//Discord
//主页
//
//中文沙盒站
//
//图书馆
//
//层级
//|
//实体
//|
//物品
//|
//团体
//
//故事
//|
//相关人士
//|
//现象
//|
//设定
//
//搞笑文章
//|
//国际翻译中心
//
//原创图书馆
//
//原创层级
//|
//原创实体
//
//原创物品
//|
//原创故事
//
//原创团体
//|
//原创相关人士
//
//原创设定
//|
//原创搞笑文章
//
//原创艺术作品
//|
//原创现象
//
//网站
//
//最近创建的页面
//
//最近的更新
//|
//最近的编辑
//
//随机层级
//|
//随机原创层级
//
//随机实体
//|
//随机原创实体
//
//旧页面中心
//
//本月最高评分页面
//
//历史最高评分页面
//
//最低评分的页面
//
//社群
//
//讨论区
//
//翻译预定
//|
//最近的帖子
//
//作者页
//|
//中文网站作者页
//
//加入网站
//
//管理专用
//
//后台管理
//
//职员站点
//
//所有页面
//
//会员一览
//
//侧栏
//|
//顶栏
//|
//主题版式
//
//
//
//　
//
//Level 17
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//level-17-1-cc.jpg
//Level 17中的走廊的图片。
//
//level-17-2-cc.jpg
//Level 17中上层的布局。
//
//Level 17是后室的第18层。
//
//描述：
//Level 17是航空母舰内部结构的无限迷宫，由埃塞克斯级航母上的走廊和楼梯组成。有时候可能会有流浪者遇到被淹的走廊，这些走廊是连接到Level 7的出口。
//
//Level 17几乎没有实体，唯一发现的实体是Level 17的独有实体印记，这些实体是Level 17的流浪者的分身。 印记不会对流浪者造成身体上的危害，但是如果看到 、印记会因未知原因对流浪者造成心理上的痛苦。如果持续看这种实体1小时，这种效果会增强，会导致流浪者昏迷3-4小时，在极端情况下可能会造成脑死亡。
//
//上楼梯会把流浪者带到Level 17的上层，这里有密封的半透明门窗，它们会发出一种无法辨认的光。当这种光照到流浪者时，会使流浪者的肺部逐渐充满水，这种效果直到流浪者离开光照的范围或死亡后才会消失，以先后顺序为准。
//
//基地、前哨与社区：
//本层级没有已知的基地、前哨与社区。
//
//入口与出口：
//可以在Level 7找到水下的光源来进入Level 17，游入这个光源会把流浪者传送到一个类似于潜艇镇流器的房间。水会从房间排出，并且可以进入Level 17的下层。
//
//可以用两种方法来离开Level 17：
//
//走楼梯到上层会引导流浪者走向通往Level 11的红色金属门。
//也可以在Level 17的下层找被淹的走廊，这些走廊会通向Level 7。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl17{}