package lvls0;
//Level 12
// 
//
//生存难度：
//等级 0
//安全
//稳定 
//实体绝迹 
// 
//level12-cc.gif
//[NULL].mp4
//
//Level 12是后室的第13层。
//
//描述
//Level 12似乎拥有一个任何已知层级都不具备的简单效果，那就是它能自我屏蔽。试图记录或拍摄Level 12得到结果只有简单的白色图像，或大量的噪音和电视静电。当上传到另一个设备上时，Level 12的录像将转换为标准的SMPTE1测试屏幕，且没有任何颜色。目前还不知道为什么或如何发生这种变化。任何包含在录像或图像文件数据中的信息，如文件名，也会被屏蔽。
//
//Level 12的环境是迄今为止最简单的环境之一：一个小的、明亮的、白色油漆的房间，里面只有一张桌子和一把椅子，以及邻近的一扇锁着的门。许多流浪者报告说他们已经进入并成功地逃出了这个层级，尽管实现这一目标的确切方法是未知的，而且逃出者几乎从不记得逃出该层级的方法2。到目前为止，M.E.G.数据库中还没有关于发现Level 12里有实体踪迹的记录。
//
// 
//
//附录I
//报告： SL12M - “矩阵”层级探险记录
//欢迎回来，Harris中校。您所说的内容将被转录到下面的文档中。
//
//<叹气>
//
//Level 12的面积比我们想象的还要大。本关的结构在这略有变化。它不再是一个房间，而是一个无限的白色深渊。似乎你离桌子和椅子越远，情况就会越TM糟。
//
//我们已经能看到各种随机的物品和家具。说实话，这是我见过的最平淡的东西。看起来都是旧的，被打坏的。灯具、椅子、桌子、抽屉，应有尽有。有些是… ——<短暂停顿>——有的已经穿到了地板的一半以下。这个鬼地方似乎也在扰乱我们的大脑。记忆已经变得模糊不清。似乎不是永久性的，但我敢打赌，情况可以变得更糟。Frankie…她…——<短暂停顿>——她……不行……了。我不想在这里失控。
//
//<很长的停顿>
//
//关于刚才的事……我很抱歉。我因为我的职业精神有点失控。继续前进。
//
//在主区域的桌子下面有某种洞。我们现在无法进入，因为桌子似乎不会移动。我们找到了类似于主区域的那扇门的门，就在这里。如果你穿过它们，就会把你带回到那里。咋了，Sam？ <低声窃语> 啊，对了。忘了说了，我们没有发现任何实体在这的迹象。看起来很平静，相对而言。
//
//经过大量的试验和挫折，试验员老哥已经找到了离开这里的方法。似乎唯一可靠的退出方式包括了遵循一系列特定的步骤，我将在这里将其——尽我所能地——转录到帖子中。希望我们是正确的，可不能让人们滞留在这里。
//
//好了，是时候搞一下这个完蛋玩意了。不用太担心，我已经在队里的几个呆子面前说了。
//
//你必须坐在原来的、主房间的椅子上，而且你必须在那里平均停留了十五分钟。
//起身，往门那边走，然后尝试打开它。它应该是锁上的。如果它开了，那我猜你一定是个欧皇。快冲到Alpha基地里去向所有人大喊大叫你做到了吧。确认你做到了这一步，就算你知道它是锁上的也要。
//回到房间中央，找到其中一个通往这个白色开放区域的角落。你需要找到外面的一个跟主房间的门长的一样的门；应该不会太难找到。
//打开并进入上面提到的那扇门，按照惯例，你会回到主房间
//等待刚好一个小时，不能多不能少，然后再次尝试打开主房间的门。如果它没开，重复上述步骤。尽量在接近一小时的时候转动把手。如果门真的打开了，它应该通向早期发现的层级之一。我们现在还没有一个精确的名单，但我想如果你想知道可能的目的地，可以参考本层级的数据库页面。你离开了Level 12的时候，有一段时间内很难与别人正常交流。一旦效果消失，你就会意识到那种精神上的雾霾有多严重。
//原先那扇门的出口仍然是未知的，因为这个层级与第一版文档的描述相比已经发生了变化。
//
//好了，又过了一个小时，这个策略成功了。Gav成功地创造了一条通往Level 1的通道。很多队员似乎都很不适应。让我们希望他们在离开时变得更好。
//
//我是Harris中校，“矩阵”层级探险队队长，完毕。
//
// 
//
//基地、前哨站和社区
//目前本层级没有已知的前哨站或社区。
//
//入口与出口
//入口
//目前尚不清楚如何进入Level 12，但有几份报告指出，Level 11的窗户实体可以作为一个导向标，以安全地切入Level 12。
//
//出口
//在上面的“矩阵”层级探险记录中，已经证明了逃出的可能性。经过广泛的研究，由“矩阵”层级探险队发现的逃生路线可以将流浪者运送到Level -1、Level 4、Level 10、Level 19、Level 23、Level 25或Level 34。
//
//作者信息
//« Level 11 | Level 12 | Level 13 »
//
//Footnotes
//1. 译注：即电影电视工程师协会（Society of Motion Picture and Television Engineers）。
//2. 可能是因为Level 12固有的自我屏蔽机制。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl12{}