package lvls0;
//Level 10
// 
//
//生存难度：
//等级 1
//安全
//稳定 
//极少量实体 
// 
//Level-10-cc.jpg
//拍摄到的第一张Level 10的图片。
//
//Level 10 是后室的第十一层。这一层级是一片巨大的麦田。
//
//描述
//Level 10 是一片理论上面积无限大的麦田。而其中也有一条南北向的巨大土路。麦田里的麦秆很安全，麦子也可以食用。装满具有甜味的杏仁水的袋子可以在麦田的各处被找到。Level 10的太阳位置似乎保持在与有昼夜变化时的正午的太阳所处的位置。天空阴云密布，偶尔会有降雨。
//
//当沿着土路行进时不仅会看到麦田，同时也会在远处看到奇异的物体与建筑物。最先会遇见的建筑物是谷仓和马厩。这些建筑物通常是空的，但是完全可以被探索。谷仓和马厩中可能出现的内容物互不相同，但一般都会出现干草，动物的皮毛与噪音。还有机会发现拖拉机和农具。
//
//在Level 10也可以看见小房子。这些房子似乎建造于八十年代末，这些建筑被空置，同时内部缺少可利用的物体。不要进入这些房子，因为当这些房子内部传出啜泣声时，在内部的人就会消失。未经证实的报告说这些房子能把你传送到Level 9或Level 7。
//
//在Level 10的一个相当大的区域内，一个城镇可以被找到。这座城似乎和前文提到的房屋一样是八十年代末建造的，与附近更现代的房屋不同，这座城镇内有大量的资源。 这座城镇内有公寓，商店和房屋。这个城镇是一个社区的据点(见社区与前哨部分)。这座城镇完全安全且可以被探索。
//
//实体有几率在建筑物中生成，但这种情况非常少见。这些实体包括笑魇、窃皮者、尸鼠、猎犬以及敌意的无面灵。有报道说牧蛇在 Level 10的地下出现。那里也有出现迷彩爬行者 的报告。Level 10内也有两种特殊的实体，如下所示：
//
//第一种特殊实体可以从此层级的塔楼中发现。这些塔楼由石头建成，且似乎是在中世纪建造而成的。在这些塔楼周围游走是安全的，并可以在未被占据时进入。这些塔楼通常有火炬，塔楼内部的屋顶被一种类似于黑炭的物质覆盖。塔内有一些十七世纪风格的家具。在可能发生的事件时，Level 10在几分钟内将出现响亮的号声。当上述情况发生时，叫做弓箭手的实体们将会成队出现，并开始侦查层级。这些实体将塔楼看作他们的领土。弓箭手不会扰乱上文提到的城镇——它们通常会忽视它。为了避免被弓箭射到的可能性，建议远离弓箭手们。第二次号声响起时，弓箭手会离开。
//
//第二种实体被称作格拉夫（Gluff）。这些实体是在田野间行走的巨型生物。格拉夫通过分泌甜味的杏仁水来滋润麦田，这解释了在田地里发现的杏仁水水坑。这些实体非常友好，并且喜欢在田地里玩乐。他们的动作缓慢优雅，身体下降的速度也非常慢，如同气球一般。格拉夫倾向于吃他们在滋养的麦子。这些实体非常有利于生长和收获农作物。
//
//基地，前哨与社区
//自从Level 10被发现，许多组织在这里成立。下面列出这些定居据点中最有名的：
//
//B.N.T.G.10级资源站
//这个前哨站由B.N.T.G.的人组成，用来收割和交易麦子。
//这个前哨站有二十三个一起工作的员工。
//他们也收集其它有用的资源，比如前文提到的杏仁水。
//他们将Level 10的物体通过出口转送到Level 1。
//新索德伯里（New Sodbury）
//10,000左右的造物居住在这个几百年前建立并开始运行的大城镇里。他们最喜欢的人名是"索迪斯（Soddies）"。
//流浪者组成了这个社区人口的剩余部分，人数大致在1500左右。 当诸如排水管一类的基础设施在城内建设的更加完善之后，这个数量还会增加。
//由于糟糕的卫生条件，它仍然还是Level 10最容易爆发疾病的社区。 所以如果你不对疫疾免疫，并且不想承担风险的话，就避开这里。
//起义军基地（Insurrection station）04
//经计算，此基地的人口至少超过三十九人。
//作为起义军的主要食物来源之一，这里的大部分资源都用来种植和烘焙。
//有一个使用食物换取武器和药品的渠道。
//B.N.T.G.人员被禁止入内。
//麦芽镇
//由在Level 10寻找庇护所的流浪者建立。
//他们非常友好，开放贸易。
//他们被附近的 B.N.T.G. 团体守卫。
//管家
//这是一个居住在Level 10房子里面的秘密团体。
//他们显然发现了房子里面的重要信息，并且不愿意分享这些信息。
//他们的总数是未知的。
//发现
//在2015年年底的一次探险中，Level 5的一个小队在一个干涸的水坑旁边奇怪地发现了一个相机。这个相机存有大量Level 10的图片，包括上文展示的那一个。相机边是一个流浪者的小笔记集，似乎是相机的拥有者留下的。下面展示笔记集里面的节选抄本。
//
//“我在这里已经走了有大概六天了，除了这条土路和周围的田地什么也没有。我试着离开这条土路，结果又走回了土路上面。田野里有杏仁水，味道很甜。”
//
//“我听到了远处的号声和咆哮声，我在物种看到了无法辨认是什么的东西，我给它拍了一张照片。”
//
//“一切都很宁静祥和，她救了我。一个天使出现在天空中，手里拿着号角。”
//
//“如果你发现你到了Level 10，待在原地。”
//
//“这样她会更快发现你。”
//
//这位流浪者似乎来自枢纽，并从这里进入了Level 10。他多次经历了与弓箭手和格鲁夫等本层级实体的接触。 笔记里提到的“她”是否与Level 1.5中的“她”相同是尚未确认的。这位流浪者的后续遭遇也是未知的。
//
//入口与出口
//入口
//在Level 9走上一条通往田野的道路可以达到 Level 10。在Level 205攀爬一面铁丝网围墙也可以达到Level 10。
//按照Level 12的程序行事，进入一扇门时有机会到Level 10。
//从Level 61的一辆移动列车上跳下来可以到达Level 10 （风险大，不建议使用这种方法）。
//进入Level 51迷宫中的一个洞可以带你到这里。
//在Level 226吃类似青豆的物品也可以把你带到Level 10.
//也可以通过跑入Level 170的森林深处达到Level 10，在这个过程中周围的景观会逐渐变化为Level 10的。
//离开Level 143中的圣地也会进入Level 10。
//出口
//要出去，麦田里少见的掩体可能通向Level 1、Level 2、Level 3或Level 14。
//有报告说有些房子通向 Level 0、Level 5、Level 7或Level 9，但这些传送的机制未知。
//找到 Level 10 内的壕沟并沿着走几个小时可以导向Level -7。
//找到Level 10内的沼泽区域会导向Level 66。
//当漫无目的地在田地里漫步的时候，可能会发现一个蓝色的小麦堆，一个小丑稻草人正好在这个堆的中间；采摘其中一条小麦将被传送到Level 283。
//距离麦芽镇约20英里是尸湖禁区的边界，其中有Level 10.1的入口。
//有一些很少见的城堡废墟，进入废墟即可到达Level 143。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl10{}