package lvls0;
//Level 18
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//Level 18是后室的第十九层。它就像你对于童年的回忆。
//
//描述
//Level 18在每个人看来都是不同的，但所有人都会注意到它与童年记忆相似。这种童年记忆的年龄范围是2-5岁。
//
//它最常见的外观是幼儿园或日托所。在两者都不存在的情况下，它将类似于儿童卧室、教室或游乐场。在非常罕见的情况下，当漫游者没有这样的记忆时，这里就会像一个空的空间，对漫游者没有任何影响。
//
//Level 18有许多“声音”会在你徘徊时向你低语。这些声音可以低声诉说很多事情，最常见的内容是你最大的遗憾或最大的错误。我们不知道这个房间是如何获知这些事件的，因此，压制这些声音几乎是不可能的。
//
//Level 18还能重新唤醒被遗忘的童年记忆。例如，人们可以找到童年时期死去的宠物，这往往会使漫游者们进入一种很深的情感状态，即使他们对这些宠物并没有记忆。这可以通过未知方法来抑制。
//
//Level 18被认为会让某些漫游者上瘾，有些人会主动选择留在这个层级。这不会造成任何伤害，并且该层级提供了生存所需的所有材料。
//
//该层级本身并没有任何威胁，并且人们都知道“享受”这些陪伴。
//
//在Level 18，你可以找到一个罕见的实体，它可以引导漫游者在该层级中行动。这个实体被称为毛绒恐龙，和毛绒恐龙玩偶相似。毛绒恐龙拥有智慧，并且能够移动。在整个层级，都可以看到它在四处游荡。由于毛绒恐龙对人会有影响，以及它可以诱发情感的事实，它是否可能对人们造成伤害尚不得而知。但它非常有用，它通常会带着水和食物等东西出现，并将它们提供给漫游者们。
//
//基地，前哨和社区
//孩子们(The Children)
//这个前哨站主要有20-25人居住，他们所有人都把所有的时间花在Level 18，并把它作为他们的生活方式。他们只会停留在该层级，并且厌恶毛绒恐龙。
//
//入口和出口
//入口
//这个层级没有统一的入口，因为它主要基于漫游者本身。最常见的情况是当漫游者回想过去的记忆时，他们就会出现在该层级。然而，有人注意到Level 17有一个入口，尽管这很罕见。
//
//出口
//人们注意到，出口在一些十分显眼的地方。最简单的方法是转身离开，这将带你来到Level 19。如果你碰巧遇到毛绒恐龙，你可以跟随它一段时间，这将带你到达你想要去的层级。但这种方法有时会花费很长的时间。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl18{}