package lvls0;
//Level 14
// 
//
//生存难度：
//等级 天堂
//
//美丽
//宁静
//完美paradise.jpg
//它可真美。你几乎觉得自己都能透过照片碰到它了。
//
//Level 14是一处天堂，你有时该去看看。
//
//描述:
//Level 14是一处绿洲。你梦中的森林在夜晚闪烁着。闭上眼睛一会。你还能看到它，对吗？轰鸣的瀑布。猩红的草叶，它们沾着潮湿的露水。无垠闪耀的星空。甚至树的枝叶也在伸展，仿佛要碰到你了。你能听到森林对你的低语。你在这会很开心的，你很肯定。毕竟其他在这里的人也是一样，所有人都是那么心满意足，那你为什么要感到低落呢？
//
//你听到的满是尖啸，你没法思考了，但你并不需要思考。当思想的重负从你身上升腾而起，你难道没有感到如释重负吗？你不觉得轻松了很多吗？你几乎要飘走了。或许你会飘走。 看看那些安安静静躺在土里的其他客人吧。他们没有之前自己料想的痛苦，骨头在月光下闪着。你不想跟他们一样吗？你现在离它很近了，你马上就要碰到它了。
//
//基地、前哨和社区:
//孩子们排成一列。他们正对着月亮发出动听的嚎叫，等待圆满之时。你想帮他们，对吧？当然，毕竟，他们只是想帮帮你。你需要做的一切就是听其号令。它不疼的，我保证。不要担心你思想的流失。我们只是要调整一些地方让我们适应你，你也会适应我们。就是这样，让我们进来，你将会加入我们。将有一场饕餮盛宴等着我们。
//
//入口和出口:
//入口:
//你现在知道怎么过来。继续前进就好，你很接近了。
//
//出口:
//你不会担心这个的。
//
//附加文档:
//M.E.G. 采访记录
//采访者: Solomon Myers 所罗门·迈耶斯
//受访者: Theo Lynn 提奥·林恩
//
//<开始记录>
//
//采访者： 请说下名字。
//
//林恩： 我就是个从天堂坠落的愚人而已。
//
//采访者： 我明白你是认真的。这只是我们给新层级分类的流程，你是如何来到这一层级的？
//
//林恩： 我在大脑上捅出一个洞，然后我开始扯它、拉伸它，直到我可以轻松的钻过去。
//
//采访者： 然后，你怎样离开的？
//
//林恩： 不，跟你谈这个很愚蠢。总之你不会想要离开那里。
//
//采访者： 你能描绘下你最终到达的层级吗？
//
//林恩： 你已经知道了，在你观念的意识中。你不需要我再跟你说一遍。
//
//采访者： 你能认出那些尸体吗？
//
//林恩： 我看到了所有我认识的或不认识的人。他们都让我再走近点。
//
//采访者： 啊，你说的"心理效应"是什么意思？
//
//林恩： 那些晚上美丽的歌声，但我离开时，我听不见他们，离开了他们我就迷失了。
//
//采访者： 你说这一切的开始是由于你读了墙上的文字？
//
//林恩： 是，不过我们已经有了更好的办法传话。你实现了它，现在有很多人会快乐了。
//
//采访者：不，我想基地里不会出事。这地方很安全。还有什么想说的？
//
//林恩：我只知道我们已经修好了那个洞，所以你可以放下心来，没人将再次被痛苦笼罩。我们会保护你。
//
//<记录结束>
//


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl14{}