package lvls0;
//Level 15
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//描述
//Level15-1-cc.jpg
//Level 15中的未来主义风格走廊。
//
//Level15-2-cc.jpg
//Level 15中的空房间。
//
//Level 15由未来主义风格走廊以及一些没有照明的漆黑房间组成。在走廊里行走时，可以听到远处的发动机声，这些声音来自一些带有金属加固门的大房间里的机器，这种房间的墙壁有一部分是由厚玻璃制成的。
//
//房间内的机器最小可以是一台笔记本电脑的大小，最大能大到无法测量，它们发出的声音并不受大小影响。有些机器有明确的任务，并且很容易注意到，比如生产钢棒，但是绝大部分的机器都没有自己的任务，有些机器里甚至没有一个来自前厅的东西。极少的流浪者会发现已经损坏的机器，没人知道它们为什么会坏掉。理论上来说，造成损坏的原因应该是长时间未维护，但是似乎没有任何方法能够修好这些机器。存放机器的房间的玻璃墙壁看上去已经碎了，但实际上没有碎掉，这表明这些玻璃可能是夹层玻璃。
//
//这个层级应该是无限的，然而这只是一个假设，也许是因为太大而无法进行测量。目前已经证明其面积至少是6080平方公里。1
//
//房间和走廊用白色或灰色混凝土建成，墙壁和天花板上有一些白色钢管。一些钢管上有看起来像蔓藤花纹的符号，目前仍不清楚这些符号代表着什么东西。
//
//墙壁、天花板和地板上的大灯使得这些空荡荡的走廊散发出诡异的光芒。唯一不是这种配色的东西就是干涸的血液，可以在一些尸体旁边找到。
//
//这些尸体看起来像是人的尸体，但是无法对其进行任何的解剖。他们穿着实验室制服，似乎是在与未知东西战斗的时候死亡的。有些尸体旁边可以发现刀或长矛，但是没有任何枪支，尽管大部分尸体上都有枪伤痕迹。没有任何生物来分解尸体，但是尸体里已经没有任何水分，这表明他们可能在这里待了几个月，甚至是几年。
//
//在这个层级里可以找到很多类型的房间，分别是引擎室、实验室、宿舍、厨房、控制室，和包含很多食物的储藏室，但是整个层级里没有任何杏仁水。这些房间大部分是空的，没有任何家具，也有些房间像剧场一样，有很多的设施。房间里的电脑都能正常使用，而且能连接到I.L.N.。2
//
//这些电脑运行的似乎是未知版本的Linux操作系统，叫做“Avalon 2.4”，电脑里的文件是用未知语言编写的，目前Cygnus Order正在试图破解这种语言。有些文件和上述的引擎和机器有关。
//
//目前在此层级中还没有发现任何实体，但是在一个被用来火化未知物体的房间里发现了一大堆猎犬的尸体。
//
//发现
//Level 15被一个从Level 10进入到此层级的流浪者发现。3他进入了一个大型控制室，用这个控制室当作他的基地，但是在过了两天后，用来进入这个层级的门自动关上了，并且再也没有重新打开过，那个叫Enric的流浪者实际上已经被困在了这个层级。
//
//现在距离Enric进入这个层级已经过去了两年，控制室依然是他的基地，并且它可以使用电脑联系M.E.G.来提供此层级的信息，他还会每周发表他在这个层级里的经历。他发表的东西可以在Enric的个人网站上找到。
//
//他花了一年的时间来探索该层级，据他自己估计，他已经探索了6080平方公里。在第二年，他开始研究文件和技术，但是他没有取得任何（能让他离开这个层级的）重大突破。
//
//在这段时间里，他的心理健康一直是我们关心的问题。由于层级里有I.L.N.连接，我们可以和Enric保持联系，并且为他提供书籍、音乐、游戏等能够分散注意力的东西，让他能够保持清醒，还帮助他联系了他在Level 11的家人。尽管如此，他仍然要求我们给他派一名精神科医生。
//
//基地、前哨与社区
//目前唯一知道的基地就是Enric所处的控制室，已经存在了大约两年。
//
//在探索这一层时发现了其他基地的痕迹，但是都被遗弃了，似乎是那些尸体在死亡之前建造的，到目前为止还没有发现其他流浪者的痕迹。
//
//入口和出口
//进出Level 15非常困难，到2021年12月14日为止，仅仅记录了两种进出方式。
//
//第一种进入方式仅仅被记录过一次。那时候在Level 10里突然出现了一堵和Level 15相同材料，相同设计的墙，它向远处延伸，看上去没有尽头。
//
//据我们所知，Enric是唯一一个发现了能够进入Level 15的门的人，他没有和任何团体接触过。在他进入Level 15的两天后，那堵墙消失了，那扇门也关闭了，使得Enric被困在了里面。
//
//但是，Enric发现此层级的电脑里面似乎有对这种现象的解释，下面是Level 15里的电脑里面的其中一个类似于扫描仪的图像。4
//
//显示图像
//所有显示这些扫描的设备在整个层级中都是一致的：它们在任何时间内都会显示相同的东西。 不同的形状会出现并在屏幕上移动，其中一些用绿线连接，但当两个形状相互重叠时，它们会以绿色突出显示。 这些物体中的大多数都在屏幕上以恒定的速度移动，只有少数物体被看到加速或减速。 在它们在屏幕上的时间里，没有看到橙色线发生任何变化。
//
//在Enric观察这些图像的两年中，唯一保持不动的形状是中心的形状和位于屏幕右侧的小圆圈。
//
//我们可以注意到预测形状移动的橙色线是如何仅在与它们相关的形状出现在屏幕上时显示的，这种行为类似于链接形状的绿线， 这些线条只有在两个形状都出现在屏幕上时才会显示。
//
//第一个对于这个图像的理论是Level 15曾经是一个空间站，这些物体在它周围移动。 起初，这个理论被广泛的得到认可，因为这个图像与航天器中的雷达非常相似。 然而，在这个理论里仍然有很多问题没有得到解答，比如：这些链接是什么？为什么相互交叉的对象会以这种方式突出显示？为什么小圆圈没有轨迹？此外，其中一些物体的轨迹与太空中的物体的轨迹完全不匹配。
//
//第二种理论试图将这个雷达（包括它的扫描）与Level 10的“墙壁事件”联系起来。这个理论的内容是：屏幕上显示的形状是层级，绿线是层级之间的连接，包括切出层级和允许进入层级的门等。 当形状重叠时，意味着两个层级相互“碰撞”，导致两个层级会相互切入，从而使某个层级的一部分在另一个层级出现。
//
//目前仍不确定这个图像是不是只是一个模拟，还是说这些层级真的在移动。
//
//在Enric找到一个可能会离开Level 15的出口时，这个理论得到了很多的支持。
//
//Enric发现了一条和Level 15的房间相连的绿线，该房间距离Enric的基地差不多两公里。房间的外观和引擎室相同，但是里面没有任何引擎，在房间的后面可以找到一个门框。
//
//那个门框散发出白色光线（如果这种光线在后室里有任何意义的话），门框里面的东西看起来像是夜空，并且可以观测到远处的发光点。在其中心可以看到一个巨大的透明蓝色光球，大部分人觉得它是一颗星星。
//
//虽然这可能是一个新的、未记录的层级，但是Enric还是被要求离开这个区域。我们目前正在尝试寻找进入Level 15的新方法，以便能让Enric离开这个层级。
//
//作者
//« Level 14 | Level 15 | Level 16 »
//
//脚注
//1. 你可以在这篇文章的“发现”部分来获取更多信息。
//2. I.L.N.指InterLevels Network，相当于前厅里的互联网（Internet）。
//3. 你可以在这篇文章的“入口与出口”部分来获取更多信息。
//4. 这个图像的视觉风格被一个流浪者制作成了本站的数据库主题。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl15{}