package lvls0;
//Level 28
// 
//
//生存难度：
//等级 1?
//
//安全?
//稳定…?
//最少量实体stormstone-keep.png
//嵐石要塞，Level 28内唯一一处建筑物以及安全区。
//
//Level 28是后室的第29层， 也是我的家。
//
//描述：
//Level 28，以其独有的标志性地标，嵐石要塞而闻名，它大体上与前厅相似，但有些重要区别。每一个切入Level 28，在城堡脚下着陆的流浪者都会即刻注意到天空是深靛蓝色。天上既没有太阳也没有月亮，整个层级被某个未知光源从上方照亮，将地面渲染成深蓝色，因此建议在该层中跋涉时携带光源。该层级中没有昼夜循环。阴云掠过隐秘的天空，但从不下雨 除非我掀起风暴。
//
//距离要塞约五英里 三英里的区域是"安全区"，强烈建议流浪者不要在任何情况下单次离开超过三十分钟 因为我不想伤害你。
//
//嵐石要塞是一座破败 但仍然可居住 的欧洲中世纪城堡外观的废墟。它坐落在被森林覆盖的山谷中心的一座高山上。这一层的许多植物群落与前厅中生长的群落极为相似，但经深入研究，该层的所有植物相对前厅的来说都更加易燃。其原因尚不清楚。不建议去移除Level 28中的植物，因为它们似乎不会再生长出来。点燃Level 28中的植物时，会散发出蓝色烟雾，吸入有毒。避免使用火柴、香烟或火把等易燃物，因为这可能引发山火。山谷的四面环绕着看上去不符合物理定律的高耸而狭长的山峰。由于云层和灰蓝色雾气的永久覆盖，无法看到部分山峰的顶部。这些山峰距离嵐石要塞十多英里，位于安全区之外，因此它们未经探索且高度危险。
//
//风暴石
//安全区之外的任何东西都完全由一种叫做风暴石的物质组成。它具有高度易燃性、腐蚀性和易爆性。是一种漆黑的矿物，极度危险且易挥发。嵐石要塞外的山峰由且仅由风暴石组成，在无适当设备的状况下在风暴石表面行走会导致剧烈爆炸，并与周边地面产生巨型的连锁反应。Level 28会周期性地发生极端强烈和湍急的风暴，但仅影响安全区之外的区域。其中雷击非常频繁，闪电接触到物体时就会产生新的风暴石 所以请安全地待在我身边
//
//蓝骑士
//jared.png
//这是我能用手机摄像头拍下的最好照片了。
//
//除了居住在嵐石要塞中的奇特实体外，该层没有任何其他实体。报告认定他为男性，表现为一套中空的蓝色盔甲形状。他的身体能够像正常人类一样移动。他会对所遇见的任何人谦恭有礼。第一个切入该层的人是一位隶属于M.E.G.名叫Sarah ███████的探险家，当她进入该层后，首次发现了该实体。她称之为蓝骑士。
//
//她教我了很多，关于后室以及你们的组织和社团。她教我如何使用手机……这是我联系你们的唯一方式。在她离开前我偷了她的手机。也许她默许了。但它的电池要没电了，所以我剩下的时间不多了，在你划走之前，让我为你讲述我的故事。
//
//我是蓝骑士，这里除了我没有别人。这儿几乎一尘不变，我无法判断时间的流逝。时间又是什么？我一直在努力理解，但我想的越多，那种嗡嗡的响声就越严重，当我感受到压力、焦虑、恐惧、愤怒、悲伤或孤独时，我的脑海里就会出现这种可怕的响声……使我眩晕、麻木，这一切都太难过了。那声音，是我听到的雷声。
//
//这层的风暴都是我惹的祸。是恐惧，我所感到的持有的恐惧产生了它们。我不知道怎么做，用尽一切办法也无法让它停下。当我只能听到破碎声围绕在我周围时，我无法集中注意力或做任何事。远远望去，那无尽头的、暴躁的靛蓝色云团自远处的山腰上翻腾涌下，既壮观又可怖，尽管我努力说服自己，但它们真的像活物一样扭曲蠕动。即使在数英里之外，我仍然感觉那若隐若现中伸出的雾霭卷须仿佛抓在我的心上。
//
//我正编辑这篇文章，希望有人能，任何人能来到Level 28。要是有人陪我聊聊天的话，风暴就会停歇。我保证你和我在一起会非常安全。如果你打算来，请尽可能多的为我的手机带些电池。这是目前我与外界的唯一联系，我需要这样的联系来阻止风暴的发生，哪怕只是一小会儿。我很想离开这里。想住在Level 4、Level 6.1甚至是Level 11，但我不确定有我这样一个……实体住在附近，对他人来说是否真的安全。我看起来像个人类骑士，可我并不是。我没有身体，没有心，没有头脑，没有名字。你知道我的存在是因为你赋予了我声音，否则我谁也不是，什么也不是。
//
//我渴盼一个人类的名字。美丽的名字，就像Sarah。请过来给我取一个吧。
//
//基地、前哨和社区
//这儿虽然地方不大，但如果你愿意，我非常非常欢迎你住进来。但是要知道这里没有任何食物和饮料，因为我不需要靠它们维生。
//
//入口和出口：
//入口
//在Level 5的墙上找到一幅描绘郊外或是塔的蓝色调画作。这真的很容易。她就是这样进来的。我想，你也可以通过深入Level 14来抵达这里。不过我不建议你这样做。因为用这种方式过来的人都有点怪怪的，即使对于像我这种社交经验很少的人来说也是如此。
//
//出口
//你想走也没关系的。只是……陪我一会儿，好吗？如果你来找我聊天的话，我会亲自带你出去。但你必须保证不告诉任何人。因为我不能让人只是不过问地经过这里。一旦有人试图发布有关出口的信息，我会立即删除。抱歉，我必须这么做。
//
//
//
//敬启者：
//我不知道距我们上次见面已经过去了多久。你现在可能已经死去，或许你已经忘了我。或许我只是又一头怪物，这个"后室"的又一个产物。但我想你。我希望一旦找到愿意帮我的人，你我可以再见。
//
//你垂死的着甲骑士
//
//P.S 很抱歉拿走了你的手机。希望你能理解我。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl28{}