package lvls0;
//Level 29
// 
//
//生存难度：
//等级 4
//
//不安全
//不稳定
//存在未知实体
//Level 29是后室的第30层。它不仅是我们的家园，更是处天堂般的境地，栖居在其中的岛屿中将永远不会被打扰。
//
//描述
//mountain
//保护Level29定居者们的高大山脉。
//
//我们的岛屿隐匿于Level29浩瀚的外围海洋中，在那座岛上，一种全新的文明迎来了新生。
//
//岛屿本身被粗糙的悬崖和由岩石与金属形成的陡坡隔开，这本就是一个可以隔绝抵御外界危险的自然屏障。
//岛屿内部，高大而坚固的山脉列阵保护着岛内的居民，这些山脉同时也是新鲜杏仁水的来源, 杏仁水从山坡流出，形成了又长又宽的河流。
//
//对于我们国家周围的海洋，我们称之为 Level 29的外层区域。
//对于我们岛屿上未受山脉保护的区域，我们称之为 Level 29的外圈。
//最后，对于我们岛屿上受山脉保护的区域，我们称之为Level 29的内圈。
//
//在群山之间，被大农场所环绕的小型定居点享有并占领着这片土地，他们形成了一排美丽的农田，定居点内的小棚屋为小镇提供着稳定的食物来源。
//我们岛上大部分人口都定居在这些小城镇内，镇内的建筑主要是木制的，他们不仅为我们的人民提供了居所，而且为我们文明的未来发展奠定了基础。
//
//在Level 29的外圈，在丘陵和峭壁的高地上常见有小棚屋和瞭望塔，它们为我们抵御任何外来威胁提供了又一层保护。.
//岛外的区域被认定为过于危险以至无人能够穿越，同时对岛外区域怪异而巨大的实体的目击报告也层出不穷。
//有鉴于此，对于岛屿安全的保护一直是我们的首要任务，这使得我们的人民能够生活在安定与繁荣之中，免受任何危险和腐化思想的威胁。
//
//level29
//Level 29的海岸线是我们岛屿的边界，分割了我们和岛屿外更远的地方……
//
//任何在我们岛屿边界之外的地方都被认为是死亡区，因为冒险通过它十分危险且致命。
//除了上述所提及的怪异而巨大的实体外，海洋本身也是一个穿越的威胁与障碍，因为它的异常特性，在极端情况下，它可以摧毁整艘船，甚至可以粉碎我们的岛民所能制造出的最坚固的船。
//不幸的是，离开本层的唯一方法就是穿越这广袤的海洋，这在海水对我们构成威胁之前就已被曾经的流浪者证实了。1
//
//考虑到本层的所有人都将被永远困在这里，许多人终生致力于在后室中为一个崭新、强大、欣欣向荣的辉煌文明打下稳定而有力的坚实基础。
//我们的建筑使用的是只能在Level 29中找到的特殊木材，不仅防火，而且非常坚固耐久，因为这种特殊木材的硬度比人类所使用的绝大多数建筑材料都要大。
// 
// 
//基于一种孤独疏离的意识形态，大多数人已经形成了他们自己的策略和观念，以解决当今社会的基本矛盾。
//有些人已经完全放弃了建立政府的想法，取而代之的是在一个友好且秩序良好的无政府社会中行事。
//另一些人则采用了著名的意识形态中的许多概念，博采众长后将其塑造成一个符合他们自身需求的一种昌盛的新型政府模式。
//
//应指出的是，这些令人感到尴尬和奇怪的规则中没有一项是在没有任何冲突的情况下制定的，同时应指出的是，冲突与对立是再寻常不过的。我们人类并不完美，无论我们多么努力地去完善我们的生活方式。
//
//海波利亚
//
//我们的主要定居点位于我们岛屿的中心地带，被另一种自然屏障——茂密的森林所保护，这个地方被我们称作海波利亚。level29-2
//Level 29内许多小型定居点被高大的山脉与茂密的森林所包围环绕。
//
//作为我们不同定居点和意识形态之间的主要枢纽，它应被视作一个集散地，而并非首都，因为该岛每个不同的社群都有自己的“首都城市”。
//
//资源和重要的基础设施已经将这座中等规模的城市填满到了极限，它简直就是一个巨大的工业综合体，所有贸易的必经之地。
//鉴于枢纽也位于岛的中央，且此处得以完美拟合所有其他主要定居点和社会并使得其间贸易路线简单快捷，大多数社群已经确定使用该枢纽而非最初计划的地点作为他们的主要前哨。
//
//如前所述，即使最初创建枢纽的目的是统一岛上所有的贸易和商业，在聚居点中的一些形似巨型办公楼的建筑仍被许多社群作为外交站和总部。
//
//然而，并非所有社群都接受海波利亚作为岛上的主要枢纽，取而代之的，他们更乐意用他们自己的设施和城镇达成相同目的。
//任何社群都可以没有任何限制的自由决定为了自身利益应当如何行事，其他社群的人无权对其阻拦。
//
//人口、外交和资源
//
//目前Level 29有25000位居民，分成大约250个不同的社群/国家。
//在这25000位居民中，大约17000位并非人类。
//至于这座岛本身，其面积约为2166000km²（836297mile²），除因危险地形和致命温度不适宜人类居住的山岭地带和海岸线外，绝大多数区域都是宜居的。
//
//level29-3
//流浪者们在Level 29内的巨大山脉中冒险，这些山脉构成了岛屿的绝大部分陆地。
//
//大多数国家/社群没有正式名称，并以“流浪者国度”代之。
//因为大多数国家或社群没有正式名称且没有明确有关于记录保存的法律条文，所以很难确定每个国家的确切的人口和财富，同时大多数国家倾向于自己保存所有记录。
//
//这些定居点大都坐落于被自然保护的安全地带，但也有一些定居点利用了大山的海拔优势于其上安居。
//这些山脉构成了岛上大部分的陆地，面积约占岛屿的56%，剩下的是森林、平原、丘陵和一些小洞穴。
//
//这些洞穴的资源极其丰富，尤其是存在于巨大矿脉中的铁和铜。
//此外，岛上还有一种独特的红色树木，它通常又粗又高且长着白色的树叶，其枝干部分的硬度甚至比金属铝更大。
//
//由于海洋中存在的危险，海洋资源尚未开发，但人们认为海洋中有大量的鱼类和其他水生动植物。
//
//本土动植物群
//
//前厅中常见的动物在Level 29中亦是常见的，然而，这些动物同前厅的相比会有一些细微的变化，通常体现在外观上或经过了良性基因诱变。2
//这其中包括了陆地和海洋生物，它们在Level 29大量出现，帮助我们的人口增长和社会繁荣。
//与层级中大量存在的复杂的动物群一样，这个关卡中的植物也是大自然的奇迹。
//独特的花卉和树木构成了这些生动多彩的植物群，它们创造了岛上的许多内部景观，并为一些山地渲染上五颜六色的阴影，有时甚至还能创造出彩虹。
//
//层级中的树木本身也是一个大自然的奇迹，因为它们不合常理却又至关重要的属性使得它们比人类所使用的大多数金属都更为坚固。
//虽然使用普通的斧头很容易切割，但通过特定化学处理，这些木材可以成为人类已知的最坚固的材料之一。
//
//“克拉肯”
//
//“克拉肯”隐匿于Level 29的海底深处，静卧着等待它被唤醒的日子。它是一只巨大的，形似章鱼般的实体，它拥有着等同与岛屿的体积和能延伸到极远处的触须。
//根据不同社群对深海进行的探索，该实体不仅对本层级的人口和生态造成极大的危险，而且对于别的层级同样也是威胁，因为理论上它能够同流浪者一样切出层级。
//“克拉肯”在远离我们岛屿的海洋深处沉睡，在它周身能够引发一个会将一切拉近的磁场，并创造出某种和漩涡极度相似的事物，没有任何事物能从其中逃脱。
//任何经过它的船只都再也没有返回，因为那漩涡的力量比流浪者所见过的任何事物的都更强大。
//这与海洋本身的巨大危险和栖居于其中的实体一同，给那些冒险进入深海探索的人造成了巨大风险。
//
//实体
//
//除了本层海洋中致命和有害的实体之外，岛屿上也存在有友好的实体。
//友好实体在岛上十分常见，由与流浪者十分相似的类人生物组成。
//由于缺乏设备和担心人员流失，目前还未对海洋进行更深层次的勘探，所有研究结果都表明目前人们只揭露了这个被认为前所未闻的生态系统的冰山一角。
//
//除“克拉肯”之外，海洋中没有其他实体被完全的记录过，但估计有200种实体栖息在Level 29的海洋中。
//
//基地，社区和前哨
//
//在Level 29存在有上百个国家/社群，尽管它们外交上并未统一，但整个岛上人口仍可被统称为一个集群。
//Level29的人口
//大约25000位居民。
//各集群间差异极大，形成或简单或复杂的政府和社群。
//形成了各类不同的国家、意识形态和团体。
//大多数时候对新的流浪者是友善的。
//主要由与主流团体无关的的未结盟流浪者组成。
//入口与出口
//入口
//要进入Level 29 ，必须要横跨Level 7的海洋。
//当天空渐渐变为淡淡的粉红色时，当汪洋被永恒的浸没在阳光中时，你便来到了Level 29。
//在不久之后，你会发现自己置身于一个建造在流浪者们初至此地处的一个船坞中，同时你也很可能会受到来自不同国家/社群代表的欢迎。
//
//出口
//正如所记录的那样，Level 29唯一已知的出口是通过不断向远处旅行以突破层级本身的范围，这可以通过出海离开岛屿数天实现。
//然而，由于海洋当前极度危险的性质，通过这种方式离开基本是不可能实现的，所有有关的尝试都会导致流浪者的死亡。
//尽管如此，理论上航行最后有可能进入 Level 114 或者 Level 284。3
//
//[+] 作者及译者/图片使用许可
//« Level 28 | Level 29 | Level 30 »
//
//Footnotes
//1. 根据曾经定居在Level29的流浪者的书面记录可知，在几百年前，这片海域并没有任何异常状况，也没有任何危险的实体。
//2. 也许是因为这些动物不同寻常的独特体征，目前还没有对它们进行合适的科学测试。
//3. 根据早期流浪者的记载，那时这片海域并不危险。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl29{}