package lvls0;
//Level 23
//石化花园
// 
//
//生存难度：
//等级 4?
//
//不安全
//杂草丛生
//中等数量实体level27a.png
//基苗中一处庇护所内部。
//
//Level 23 是后室的第24层。
//
//描述
//Level 23，也被称为石化花园，是一个巨大的、小行星级规模的超级有机体，主要由一些相互缠结的树木物种组成，树木类似于前厅中的那些。尽管其引力与地球极为相似，但据M.E.G.估测，Level 23 的表面积与矮行星谷神星大致相同。由于该层级的地表拥有空气腔及蜿蜒的隧道，类似于一个大型洞穴系统，因此探索整个层级是可行的。大多数实体生活在这些区域的地表之下。该层级存在异狐、猎犬、肢团、笑魇、亡鼠、雌雄死亡飞蛾以及科拉比图鸟。还有一些未知的本土实体生活在光穴之中，类似于前厅中的某些物种，目前正在对其进行研究。尽管非常罕见，但该层级还能发现牧民。
//
//Level 23 的表面是一片极其茂密的森林，几乎没有光线穿过。该层级没有昼夜循环。从地表的树冠穹顶望去，能够看见天空中有一颗恒星，但其方位从未改变，即使横穿行星的地表。M.E.G.已确定，整颗小行星正永久地沐浴在来自各个方向的阳光中。
//
//组成Level 23 的树木丰富多样。它们的前厅对应物来自各类不同的生物群系。其中最为常见的树种包括北美黄杉、白杨、桃花心木、红杉、雪松、柏树和白橡树，尽管许多树种在前厅为外来物种、濒危甚至已经灭绝。此外，还发现几种无法识别为任何前厅已知树种的树木。
//
//
//
//
//
//level27b.png
//Level 23 中的光穴之一。
//
//光穴
//level27d.png
//一个非常葱郁的光穴表面。
//
//在该层级的地表之下，存在一些大型开放洞穴，在这里树木可以生根发叶。这些洞穴由一种被称为园丁之歉的特有实体照亮。园丁之歉的行为与萤火虫十分类似，具有生物发光性，呈现出各种不同的颜色。它们的名字来源于其不停发出的奇怪声音，听起来像在低语“对不起…”
//
//这些洞穴十分庞大，看起来足像地下森林。除了树木之外，这里还有许多小型植物群茁壮成长，如发光真菌和灌木丛。此处的空气十分潮湿凉爽，而且这里还是实体最为集中的地方。
//
//
//
//
//
//古老遗迹
//level27c.png
//光穴内一处古老废墟建筑的前门。
//
//光穴最奇怪的一点是，在其森林深处，可以发现许多被遗弃、毁坏的建筑。这些建筑几乎都是杂草丛生，被苔藓和真菌覆盖。它们与不少著名的前厅建筑有着惊人的相似之处，但又有明显的不同。目前已发现一座金字塔形的亚历山大灯塔、一座球形的大金字塔、一座方形的大角斗场和一座三角形的帕特农神庙。
//
//在这些遗迹内有大量文物，与前厅多个时期的历史文物有着相似之处。最常见的文物是陶器，但也发现了一些受损的绘画和布料。这些文物都有一个共同点，它们的质量明显比前厅的同类文物差。在遗迹的墙壁上可以发现文字，通常以褪色、匆忙记下的信息形式出现。这些文字总是以拉丁文书写。在本层级没有发现与公元1000年后造物相似的建筑。
//
//
//
//
//
//掩没哨兵
//当进入Level 23 时，强烈建议不要说出“这只是时间问题。”这句话。这样做会唤醒掩没哨兵。这些实体被认为困在木头与树皮墙壁中，除了尖叫什么也做不了。一旦说出这句话，哨兵们就会开始尖叫。根据听力范围内哨兵的数量，其产生的声音可大到足以刺破耳膜。一些流浪者报告称，这些尖叫声听起来就像生锈的电锯切割木材。
//
//
//
//
//
//水之心
//核心仍是该层级中最未被探索的部分。据报告，它是空心的。一面球形天顶包围着核心，由从中心长出的深绿巨人的树干与树枝支撑。一些树木向下生长到这个空间，一些则从这里生长出来。在本层级中，该区域最为茂盛，生长着独一无二的奇特植物与真菌。有几种奇异的野生动物居住在巨人的巨大树枝上，这些树枝延伸到户外。
//
//在这颗行星的最中心，是它的心脏——水之心。水之心完全被巨人纠缠的根茎所包围，是一个巨大的水库，滋养整个层级。这些水被巨人吸收，并通过它们的叶子排放到上面的开放洞穴中。随后，天顶上的树根吸收凝结的水蒸气，并将其输送进光穴。更多的水蒸气被释放到光穴中，既被生长在地表的树根吸收，也被向下生长回核心的树根吸收。利用园丁之歉的生物发光，以及自然的永久的阳光，这些树木获得了足够的生存能量。
//
//
//
//
//
//深绿巨人
//深绿巨人是从小行星核心长出的巨大树木。它们比前室中最高的树还高，最高的深绿巨人高约2英里（3.2km），直径约60英尺（18.3m）。 深绿巨人负责支持小行星的内部生态系统，既将水蒸气分配给其他树木，又为其他动植物提供栖息地。这些树木的年龄未知，因为没有砍伐它们的打算。这些树木对层级的稳定性至关重要，因此不得干涉。
//
//
//
//
//
//园丁的失败大地
//以下的牌匾是在Level 23 一个光穴中“宏伟之球”遗迹的底部发现的。它大致是从拉丁语翻译过来的。
//
//杂草丛生
//我们将吉萨宏伟之球献给伟大的园丁
//祈愿我们所铸之大错得以宽恕
//我们的紫色眼眸早已化为绿色
//我们已开始回归大地，饱受遗忘，杂草丛生
//我们唯独希望，纵使孤独石化，亦将不必消失
//作为一个失败项目的建筑师。
//
//
//
//
//
//基地、前哨和社区
//M.E.G.（又称“探险者总署”）基苗：
//一座探索、人类学兼研究基地，建立在Level 23 一处光穴内部
//目前的人口约为30名活跃成员及5名获救的志愿者流浪者
//友善，对贸易持开放姿态
//装备杏仁水喷射枪以驱散实体
//该地区的敌意实体已被清除
//该地区没有掩没哨兵
//食物供应有限，但水源供应稳定
//守卫着Level 23 唯一已知的稳定出口
//入口和出口
//入口
//Level 23 可以通过在Level 37 和Level 47 中发现的空心巨树进入。这些树木明显大于周围其它树木，并带有显眼的绿色树皮。在深红森林中亦有一棵空心树入口，可以通向基苗。Level 23 也可以通过Level 121的一个空心圆木状结构进入。
//
//出口
//在进入层级核心的水库后，将随机切入Level 7 或Level 121的海洋中间。还有机会切入Level 43 的一个展品中。在基苗的中央，有一棵空心树，可以带人回到深红森林。这个出口是深红森林和Level 23 之间的一个双向通道。
//


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl23{}