package lvls0;
//Level 26
// 
//
//生存难度：
//等级 5
//
// 
// 
// 
//
//Level 26是后室层级的第27层。这一层级表现为一座大型的城市住宅。
//
//描述
//new26.jpg
//Level 26的走廊
//
//Level 26是一个面积约为数百万公里的有限层级，该层级外观上会使人联想起典型的城市公寓。与Level 0的空间结构相似，在这一层级可以找到许多带有混乱结构的割裂空间，这包括随机出现的门扉与楼梯、通向死路的走廊以及被墙壁堵住的门等等。某些过于狭窄的走廊因极度危险而无法通过。本层级大多数房间似乎以错误的形式缝合在一起（详情请参阅附加信息）。家具等其他物体有时会导致流浪者切出至负数层级，从楼梯切出会来到地下室。窗户不一定是Entity 2的陷阱，这些窗户有时可通向一个外部空间。除了始终存在的蓝雾，该层级的外部区域看起来与前厅十分相似。这种雾可使眼睛融化，但其本身没有表现出任何毒性。
//
//该层级存有许多被遗弃的物品以及其他随机生成的物品，痛苦汁液1、驱笑剂、杏仁水和皇家口粮可在本层级的冰箱和厨房内找到，层级密钥、奥特莱特斯2、小台灯、圣甲虫和火盐会在随机地点被发现，所有书架上摆满了写有多种文字的书籍，偶然情况下Wi-Fi在本层级也有几率被找到。
//
//位于该层级的流浪者有很大概率会遭遇大量实体，部分实体会出现在特定房间的内部。这包括窗户、笑魇、死亡飞蛾、肢团、钝人、猎犬、无面灵、窃皮者以及其他实体。这些实体充斥着整个层级。
//
//附加信息
//正如人们所言，该层级会随着前厅的变化而不断增长或缩小，Level 26的房间全部对应着现实世界中的房间。每当你进入该层级时，上述现象似乎会导致你出现在与你的居所相对应的层级区域中。
//
//基地、前哨和社区
//废弃前哨 - “工程师们”
//这是一个跨越数公里的前哨站，其内部存在着科学设备和许多未知物品。这个前哨基地储备了大量必需品。任何曾隶属于该前哨的人员现今下落不明。
//
//入口和出口
//入口
//该层级的唯一入口是Level 13的第1000层。
//
//出口
//你可以通过切入某些家具来到负数层级，通过探索楼梯发现的其他出口会通往地下室。
//
//作者信息
//« Level 25 | Level 26 | Level 27 »
//
//脚注
//1. 原物品已被删除。
//2. 原物品已被删除。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl26{}