package lvls0;
//Level 27
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//level27.png
//Level 27内的温泉
//
//Level 27 是后室的第28层
//
//描述：
//Level 27，也被称为“岩体泉”，是一个相对平静且小型的层级，不存在任何实体。该层似乎是有界的 无界的但唯一可进入的部分是一座大约200平方英尺（18.58平方米）的洞穴温泉，其中包含该层的所有入口和出口 包含该层的所有入口和除一个出口外的所有出口。这座温泉的水可以饮用且富含矿物质。尝过Level 27的泉水的流浪者称自己感觉头脑清醒，精力充沛。泉水的平均温度约为90°F (32.2°C)，与泡澡时所用热水的温度相似。两个微型瀑布分别从洞壁的开口不断地将新的泉水注入其中。泉水池是通过洞穴温泉角落处的一条小渠排水的，这条排水渠很小，以人类的体型不易爬过。请不要试图探索它。 不知道这些泉水从何而来又去向哪里，但似乎源源不断，是无穷尽的。
//
//Level 27在Level 11等层级的居民中非常受欢迎，因为它易于进入且拥有稳定的出入口。如果你打算到Level 27参观，请尊重你可能遇到的在泉水中沐浴的任何其他流浪者。如果有超过三十名其他流浪者在泡澡，不建议此时进入其中。
//
//事实证明，在泉水中沐浴一小时以上能对流浪者产生积极影响。据流浪者持续报告称，他们感到比之前更轻松、更平静、更积极。这使得来自Level 11的流浪者在工作中提供了更高的生产力水平。广为人知的是，这些水有助于缓解轻度的皮肤疾病和肌肉伤痛，如肌肉酸痛、瘀伤、皮疹和小伤口。但是不建议泡澡超过两个小时，因为长时间接触热水可能会导致头晕和恶心。考虑到该层在Level 11的居民中非常流行并被大众喜爱，因此也建议在沐浴后尽快离开，以便为其他流浪者腾出空间。
//
//洞壁的材质已确定为石灰岩。尽管这里泉水温暖，空气潮湿，但在 Level 27的任何地方都不存在任何植被，甚至不存在任何种类的其他生物。目前不知道原因。 我极其不幸地找到了原因。
//
//…
//
//你以为这层只是一口简单快乐的小温泉，对吧？
//
//可在这个被我们称作后室的可怖地方，有哪怕一点点希望和安全的火花吗？
//
//成千上万的流浪者都以为是这样，我曾经也这么想。直到今日，他们仍然在使用这层的泉水来释放他们严峻生活中的压力。这是幸福的。是安闲的。是美好的。
//
//而这个幻梦对我来说已经破灭。我再也不会来这层了。但里面还是很安全的。只要你不继续读下去，它仍然是你可爱的小温泉。但我知道你的本质。
//
//你是一个流浪者。
//
//这默认你充满好奇心——这也正是我们可悲灵魂中的本性。所以如果你真的想知晓这一层的真相，我会和你讲述我的发现。
//
//
//关闭
//报告：NL27 - 探索日志 No.1
//记录日期：6/9/2021
//记录者：Catherine Goswell, M.E.G.特工
//今天我被选去探索Level 27的另外一个洞窟。我的心里一半庆幸自己分了个美差，也有一半因为无聊而感到沮丧。我是说，这Level 27只是一座小温泉，连实体都没有。他们到底希望我找到什么？
//
//我管他。反正我拿上装备，通过跟其他人一样的方式进入这个层级。值得庆幸的是，M.E.G.提前向Level 11的居民发了通告，确保没人在我工作的时候来打扰。我得赞美他们的体贴，这样我在攀爬岩壁的时候，没有裸体男人盯着我看。
//
//我可不是什么攀岩家——但很高兴我是在这里将我的训练付诸实践。毕竟，从这儿摔下来可以掉进水里，我最多带着几处擦伤或瘀伤活蹦乱跳。更幸运的是，即使发生这种情况，这种泉水也会帮我痊愈。
//
//所以我在这儿，一寸一寸地往上爬，前脚越过后脚。尽管岩壁上的开口是圆润而非锯齿状的，但最终我可以抓住开口的边缘把自己抬上去。说实话，我越挣扎，越意识到自己是多么感谢这里没人围观我的这般窘态，要是我的同事看到，我觉得他们不会让我好过的。但这些都不是重点。当我爬过隧道时，顺便把面具戴在了头上，后背也撞到了天花板。逆流而上的我突然后悔自己的人生选择。温暖的泉水溅得到处都是，即使有面具阻隔我也不得不闭上眼睛。哎。这使我想起了在某个高中浴室里打旋儿的那段非常非常美好的时光。
//
//隧道一直在延伸……我完全失去了对时间和距离的概念。无法告诉你我在热气腾腾的水中爬了多远。我所知道的是，在好似永恒的一段漫长努力后，隧道终于变宽了，让我得以在进入一个巨型洞穴时直起腰来。它的墙壁离我那么遥远，以至于完全笼罩在黑暗之中。我无法准确测量它的大小——记得最清楚的是上方天花板的洞口。透过那里可以看到Level 27的深靛蓝色天空。有一堆高于水面的礁石通向外面，我迈着摇摇欲坠的步伐继续向上。
//
//当我上到外面时，我所看到的一切完全击碎了之前所做的任何心理准备。
//
//深蓝色的天空下是一片荒芜的平原，只有黑色的岩石。没有树木，没有实体，没有生命。一切都平整的像张纸。每座山谷都被夷为平地；每座山峰都被压碎。每个文明都被抹杀，小到蚂蚁大到山岭的一切都消亡了。除了我脚下的黑色岩石之外，什么都没有，它像是一层悚人的黑色油漆覆盖着整个地表。风暴石。这石头是风暴石。
//
//我意识到Level 27的那座温泉不是层级的全部，根本不是。
//
//那是层级中唯一剩余的部分。
//
//我转身想往洞穴逃去，却发现它消失了。我被困在一个无边无际的领域。我知道，只要我往前迈出一步，风暴石就会被激活并爆炸。我以为我要死了。整个人生就像一部快进的烂片一样在我眼前播放。我深吸一口气，向前迈步，闭上眼睛，准备迎接我的死亡。
//
//当我醒来时，我坐在嵐石要塞，面前的桌子上摆着一杯咖啡。
//
//记录结束。
//基地、前哨和社区
//由于该层的规模和历史，在该层没有基地、前哨或社区。
//
//入口和出口：
//Level 27可通过相同的方式进出。M.E.G.在靠近洞穴一角的瀑布处建造了一个通往瀑布流出隧道的楼梯。这隧道的宽度足够你沿着溪流穿过。顺着它行进可以将你带出Level 27然后返回到你之前进入的位置。将功能完备的淋浴或浴缸调至最热预设并在其中闭上眼睛即可轻松进入Level 27。进入Level 27的最普遍方式是通过Level 11。这会始终将你带到隧道的入口处，可以从那里下楼梯进入泉水。
//
//别去攀爬其他隧道，那里无处可去。
//


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl27{}