package lvls0;
//Level 22
// 
//
//生存难度：
//等级 5e - 环境危害
//
//不安全
//不稳定
//非实体危害original22.jpg
//首次发现Level 22。
//
//tent22.jpg
//Level 22内的一间有人居住的帐篷
//
//new22.jpg
//Level 22 被遗弃后
//
//Level 22是一座在一定角度上无限延伸的、看似普通的停车场，它在某个时期被一整个社会群体所接管并居住于此，而后又遭废弃。该层于1925年首次被发现。
//
//描述：
//Level 22 最初并无任何特殊之处，采用了20世纪的多层停车场的外观，内部装满了各种停放的汽车和超市手推车，这些车辆都曾满载着建筑材料和食物。由于Level 22 中敌对实体数量很少，该层曾充当了无数团体和个人的社区中心。
//
//1987年，Level 22 被宣称为一个微型的国家，独立于后室其他层级的任何派系。此后，Level 22 内的微型国家持续快速发展。到1990年，Level 22 的大部分入口已被其居民关闭，这个群体正式孤立自身，并自称“Emstable”1
//
//尽管Emstable分别与the M.E.G.和B.N.T.G.早在2012年和2015年就建立了贸易关系，但这个独立派系很少允许外界群体的人员进入自己所占据的层级。因此，对该派系的人员、经济、政治体系及日常生活都所知甚少。根据少量针对该层的研究得知，该社会有着严格的种姓制度，将居民划分成“家族”。这些不同的群体将在Level 22 内不同的楼层工作。每个群体都有各自的任务要完成，将其生产的全部资源的小部分贡给上面的楼层，余下的部分留给自己。
//
//尽管不知道Emstable的成立者，但为人周知的是有三人是这帝国创立的先锋。他们和一些人住在Level 22的最高层2。考虑到其所处的环境，他们过着惊人的奢华生活，众所周知的是，他们拥有Wi-Fi、游泳池和足球桌（桌上足球）等娱乐设施，且通过未知方式得到了正常的电饭煲来烹饪饭菜。
//
//然而，对于较低的楼层，生活要相对困难得多。距离顶部约10到15层的楼层享受着轻松——尽管很无聊——的生活。这些楼层的全体居民都拥有帐篷、用木头或开采得到的混凝土建设的棚屋，其中少数拥有像顶层一样的厨具。那些没有厨具的人靠别人的食物或者定期收割的水果和庄稼维生。
//
//虽然厨具易于获得，但目前不清楚Emstable的流浪者是如何得到最初的农作物的。普遍接受的说法是，在Emstable崩溃之前，存在一个可以让流浪者耕种的层级，并在可耕种的层级之间形成了通道。该假说还解释了一个问题，即过去Emstable的居民从事何种工作，这进一步巩固了该假说的理论基础。
//
//在Emstable帝国的底层，即16层之下，生活极度贫苦困难。据目前复原的日记和笔记描述，很多人会逃到其他楼层，希望能去往另外的层级。关于这些底层的信息较少，其中大部分来自找到的日记或照片。3底层的许多人饱受饥饿之苦，通常靠上层居民的善心过活，他们也不敢食用太多的嗟来之食，而是保留其中的大部分以备不时之需。他们几乎没有任何帐篷或是棚屋，只能在睡袋中露宿，或通常什么都没有。
//
//这样的社会体系不可避免地被Level 22 层中的上层居民所利用，对较低楼层的居民要求过高而对较高楼层的居民要求较少。这带来了整个社会对外贸易的需要。但对外贸易最终也无法将Emstable从内部的崩溃中拯救出来，促使其大多数人口迁离该层以寻求在其他层级的新生活。
//
//虽然尚不清楚Emstable崩溃的真正原因，但人们普遍认为是源于其社会系统的故障，以及Level 22 层级结构完整性的缓慢下降。由于对层级物资和混凝土的索取和开采，大多墙壁、承重柱、天花板和地板开始失去稳定性，最终导致了整个层级的垮塌，使得层级的大部分区域要么无法以正常方式进入，要么难以进入且危险。
//
//如今，Level 22 看上去像一座废弃且毁坏的停车场。地面上散落着碎石和梁柱，步行通过是极其不安全的。在穿越该层级时，偶尔会发现汽车残骸和废弃的帐篷。残骸均生锈并覆满灰尘，大多呈碎片状，唯一一块相对完整的是一辆50年代汽车的外壳。之前所提到的帐篷也装满了前Emstable居民的尸体，尤其在较低楼层，当层级结构发生永久性破坏时，他们难以逃离。4
//
//由于穿越Level 22极其困难且危险，大多数流浪者避开了该层级。因为它缺乏结构的完整性，Level 22 的结构不稳定，杂物容易导致行人在混凝土、钢筋以及毁坏的汽车上面绊倒受伤。除此之外，Level 22 内部还有大量深坑。其深度表明这曾经是开采混凝土的地方。虽然理论上可以通过攀爬这些坑洞来到达新区域，由于自由攀岩运动的危险性，我们非常不建议你这样做，记录中很多起意外死亡正是归咎于流浪者的这种行为。
//
//已复原的文件
//尽管初期的Emstable居民逃离时携带了他们的机密和史书，但个人日志和机密文档的残余部分已被如卡拉格林协会，the M.E.G.，以及B.N.T.G.等各种组织保留。
//
//日志[经复原]："Hilda"
//"Hilda"是属于Jacobs Opal的日记本的推测名称。如需此日记的所有残余页面的完整扫描副本，请咨询站点管理员或查看可视化档案。。此页面上的日记分别作于日期02/08/2014、06/08/2014 和 30/10/2015。5
//
//02/08/14
//"上大分的一天"
//今天会是重要的一天，Hilda。Janus、Heljan和我一直在不知疲倦地开采混凝土。另一层给我们提供镐子的人非常慷慨，给我们在这些新镐子上打了折。我对他们的感激难以言表。
// 
//虽然这是好事，但它不能完全将今天变成一个"重要"的日子，不是吗Hilda？这次的采矿之所以重要，是因为它可能让我的家人提升阶级！我和搭档一直在努力爬到20层，并且我和那儿的人聊过。虽然他们偶尔会"鄙视21楼的地界"，但是他们确实说过，如果我们为他们提供足够的混凝土，贡到19楼和更上面去，那么他们会让我的家人上去！Grey一直在努力采矿，操，我想xe已经通宵采矿一周了。但对我们的女儿来说都是值得的，我相信我们所有的努力都会有回报。
//
//06/08/14
//"准备我们的庆祝活动"
//我们正在接近目标了！过去的四天非常艰苦，Grey和我一直在努力经营混凝土矿洞，我们尽可能少的换取食物，这样就可以有足够的食物让Tia每晚都吃的开心。我能看出Grey对此很兴奋，xe不停地和Tia讨论这件事，向她列举到了上面她会得到的所有新东西。
// 
//你知道，这儿很多人都不相信我们会到达Emstable的上层，但我一定会证明他们是错误的。他们甚至和Heljian谈过，但谢天谢地，他仍然一心要帮助我们。Aiden、Kellaby 和 Raven还是试图说服我，让我不要这样做。
//我是否重视他们的意见？是的。可我现在真的需要他们的意见吗？答案是不。
//
//30/10/15
//[此条目没有标题]
//改天又有一批混凝土送上去。Raven这次帮我承担了全部费用，感谢上帝。我想我再也去不了那层了Hilda。至少Grey过得还好，xe和Heljan似乎对Tia很满意，不管他俩的新生儿叫什么，老实说我不想问也不关心。
// 
//你知道，Hilda，我担心Tia和Grey。我知道他们在高层有自己又新又好的住宿，但还是担心。我不知道他俩中是否还有人想我，或者Heljan是否会放弃我。我猜……不。但是！希望仍存在于某处，如果它存在，我会找到的！我会与你团聚，Tia，记住我说的。
//
//完整的日记目前由Kalag Institute所持有。
//
//人口普查报告[经复原]
//该记录位于Emstable的顶层，是目前发现的唯一一份与其政策有关的机密文件。可以看出他们至少每两年进行一次人口普查。这次，以及复原的几年前的另一次人口普查，是迄今为止全部的已复原报告。目前尚不清楚人口普查的确切频率，因为已复原的两次人口普查是在截然不同的年份进行的。
//
//第十层人口普查报告 01/07/10
//层数	人数	变动	指定物资	就业/失业比率，不计儿童
//1层	18	+0	N/A	N/A
//2层	22	+1	娱乐物资搜索	22/0
//3层	440	-2	器具搜索	400/40
//4层	321	+12	粮食种植	310/11
//5层	1,002	+24	粮食种植，伐木	991/11
//6层	986	-12	服装生产	900/86
//7层	1,212	+32	垃圾清道夫	1,039/173
//8层	232	-22	异常物品清道夫	231/1
//9层	2,140	+40	混凝土开采	2,001/139
//10层	1,876	+38	寻找器械	1,766/110
//11层	560	-30	医疗用品清道夫	560/0
//12层	299	+12	服装生产	271/28
//13层	1,456	+47	机械、服装生产	1,300/156
//14层	1,231	+10	勘探	1,109/212
//15层	2,000	-12	混凝土开采，伐木	1,803/197
//16层	145	-77	金属清道夫	143/2
//17层	540	+23	畜牧业规划，粮食种植	532/8
//18层	675	-40	粮食种植	623/52
//19层	1,850	+14	伐木	1,743/107
//20层	2,100	+60	垃圾清道夫，机械维修	1,899/201
//21层	1,234	+32	混凝土开采	1,217/17
//22层	80	-220	服装生产，器具搜索	44/36
//23层	934	+34	畜牧业规划	930/4
//24层	561	+20	混凝土开采，勘探	521/40
//25层	811	-2	混凝土开采，伐木	809/2
//26层	1,434	+40	粮食种植	1,011/423
//27层	1,999	+21	混凝土开采，垃圾清道夫	1,345/654
//28层	0	-1,760	N/A	N/A
//29层	N/A	N/A	N/A	N/A
//总人口
//26,158
//
//目前有关Emstable的其他机密信息均为M.E.G. 所有。
//基地、社区和前哨
//flag.jpg
//Emstable的旗帜
//
//如上文所述，Emstable是Level22 中唯一活跃的组织。自其崩溃以来，没有出现任何组织。
// 
// 
// 
// 
// 
//
//入口和出口：
//由于最初Emstable努力将Level 22 的所有入口封堵，许多旧出口已经丢失或不复存在。然而，Level 22 垮塌后，又出现了新的出口。
//
//入口
//Level 22可以通过Level 21和Level 23进入。这两处也是新的入口，由于掉落的碎石和结构完整性的丧失，在Level 21的地板和Level 23的天花板上形成了洞口。
//
//又或者，虽然少，但可以找到一些Level 22 的原始入口。 可以通过在Level 1内找到玻璃门、从Level 69离开出口坡道或在Level 172的中心区域找到出口来到该层。
//
//出口
//可以通过前文提到的Level 21和Level 23的入口离开Level 22。没有找到Level 22倒塌前存在的原始出口，但是，通过汽车或瓦砾成功切出可前往Level 817.
//
//Author(s)
//« Level 21 | Level 22 | Level 23 »
//
//Footnotes
//1. 从Level 22发现的文件表明，Emstable的名称显然是"战斗（embattle）"和"稳定（stable）"两个词的生造（后者是"停车场"的同义词）。
//2. 并非是Level 22 的实际顶层，其顶层目前尚未确认存在，但它是Emstable所曾占据的最高楼层。
//3. 这些日记和日志的摘录可以在下文找到。
//4. 其中一间帐篷里有一台旧胶片相机，里面有Emstable崩溃前仅有的已知图像之一。
//5. 此日期系统遵循日/月/年的格式。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl22{}