package lvls0;
//Level 33
// 
//
//生存难度：
//等级 2
//
// 
// 
// 
//level33good.jpg
//Level 33初始状态。
//
//level33bad.jpg
//处在腐化状态的Level 33。
//
//Level 33是后室的第34层。
//
//描述：
//Level 33看起来是一座空旷的购物中心。大多数店面都由现实世界中的大公司所拥有，但基本上少有货物或完全空置。还有些店面被目前无法开启的门所封锁。小吃街通常空空如也，但你也有可能找到库存充足的小摊或商店。当你刚进入该层时，仅有非常低的概率遇到猎犬、钝人、少数尸鼠或者窃皮者，但当你深入购物中心十几英里时，实体（包括其他种类）将会更频繁地出现。走得越远，商场的外观表现的越发陈旧。水逐渐淹没地面，灯光变得闪烁，直到完全故障，随着整个环境开始发霉，长满植物，某种施加于你精神状态的影响将逐渐变强，金属材质也开始受到腐化影响。
//
//基地、前哨和社区
//该层没有已知的基地、前哨和社区。
//
//腐化状态
//在你的入口处，（如上图）墙壁及瓷砖的地板是完全洁净的，地板干燥，照明系统正常，并不太可能遭遇钝人和笑魇。
//
//深入50英里后，腐化状态将活化，使墙壁上似乎出现霉菌，地板上的瓷砖偶有缺失，灯光每隔几小时会闪烁，你开始感到焦虑，并因为这种状态所产生的效果而感到被时刻注视。在腐化状态期间，偶尔出现幻听，开始有越来越多的尸鼠在变得潮湿的地板上游荡，现在可以在较昏暗的区域发现笑魇。
//
//100英里后，墙上的部分壁纸被撕掉，霉菌已经覆盖了大部分墙壁，地板干燥部分的裂缝开始长出草来，水位升高到地板上方2英寸（约5cm）处，灯光每隔几分钟就会闪烁，使您头痛，即使处在安全的避难所环境中，你也会感到多疑、妄想，幻听会频繁发生，而与之相比，幻视的发生率要相对低很多，同时你有可能目击Anithika。
//
//200英里后，（如下图）墙壁上的墙纸可能已经被完全撕掉，霉菌遍覆了墙壁，苔藓从天花板垂下，水位上升到地板以上2英尺（约61cm），对人类思维的影响强度等同与Level 6，崩溃的节点取决于个人，有时甚至会导致你自杀。视觉和听觉层面的幻觉已司空见惯，但这些幻觉对你造成伤害的可能性极低。实体尤其是Anithika、尸鼠、和笑魇，这里已经到处都是。
//
//300英里后，墙壁会像爆炸现场一样被撕裂和毁坏。地面长出6英尺高（约1.83m）的草，水位为5英尺（1.52m）。灯已经熄灭，每隔几小时会闪烁一次。幻觉会试图把你引入陷阱，达到使你被实体杀死等的致命结果。
//
//500英里后，地板和灯光不复存在，但地面可能着火。如果你走到这里，请注意幻觉可能试图对你造成物理伤害。实体一直在等你抬头，看向天花板。
//
//750英里后，墙壁看起来像是管道，如果你不朝前看，你就会看到实体，一只怪物，幻觉已经不再是幻觉，地面混杂着火与水，到处都是攀缘植物。
//
//后来，据报告称一个不知名的人行进了1000英里，据说那里长有23英尺长（约7m）的杂草，墙壁有黑色的空洞，其中偶有破裂和被腐蚀的管道，内部全是纯粹的难以描述的混沌。之后，他被约有200只极富攻击性的一大群实体驱赶了回来。他建议不要再往前探索了，但他自己正试图走的更远。
//
//入口和出口：
//已知的唯一方法是进入Level 11的购物中心或商场，或在Level 22上楼。
//
//如果你从Level 11进入，请从入口处返回。 如果你来自Level 22，请从你身后的楼梯返回。 您也可以通过办公室入口以进入Level 45。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl33{}