package lvls0;
//Level 36
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//new36.jpg
//Level 36 的照片，拍摄于未知用户。
//
//Level 36 是后室的第三十七层，它以一个空的机场航站楼的形式呈现，每一个登机口都有一架飞机停放，同时存在现实生活中的商店。
//
//描述
//虽然Level 36看上去是空的，但其实其中存在着商店和盛在聚苯乙烯泡沫塑料盒中的几种典型的航空餐，这些航空餐会导致中毒并且在三十分钟内致人死亡，所以强烈建议不要去食用。关于商店，这里的自动贩卖机只提供可以安全饮用的杏仁水。这里同样是进入Level 703探索前最好的杏仁水补给地点。如果你想通过手机等定位装置确定位置，会发现这里的定位是在德克萨斯州的休斯敦市。关于机场的出口，这里强烈建议不要通过出口尝试离开，这可能会导致你进入后室中最糟糕的地方。如果你在本层级中见到了人影，其很有可能是其他漫游者，如果对方态度友好则可与其交谈。关于登机口，登机口中有很多真实生活中的航线存在，通过登机口会让你去到后室中的其他层级。作为其他层级的中转，有随机的实体可能会穿过登机口并向你追赶，避免其的方法只有跑得比它们快或者战胜它们。
//
//机场地下室
//机场地下室是Level 36中新发现的区域，它以无穷无尽的封闭区域的形式呈现。这个区域由u/GabenOsu在2020年2月29日自主区域中掉落进入后发现，地下室围墙周围存在一辆有轨电车。如果你进入一间楼梯，楼梯可能会永远延伸，也可能是Level 54的入口，如果你发现电梯，可以选择乘坐进入，电梯有3.55%的概率是电梯，除此之外的情况下这些电梯会带你去其他的后室层级。另一种离开的方式是乘坐有轨电车，如果你乘坐开往航站楼A的电车，你会见到去向Level 36主区域的楼梯，如果你乘坐开往航站楼E的电车，你可能会被带去Level 703。
//
//基地，前哨和社区
//914号航班
//通过美国航空的登机口，进入一架挤满人的飞机，这就是此社区，这些人都是1955年失踪914号航班1上面的乘客，飞机上包括了飞行员、乘客和全套机组人员，他们会拒绝一切让其离开社区范围的要求。社区居民称飞行途中所有人突然因困倦昏迷，醒来后便发现已经进入了后室之中。
//
//后室航空泰兰基地level 36分部
//泰兰基地通常由5到12人组成小队 ，分散于这个层级。 这个基地不仅集中于level 36，还在sub-level，level 36.1中有分布。泰兰基地向新成员开放并且开放贸易。如果你看到穿着航空标志衣服的人，你已经抵达了泰兰基地。
//
//入口和出口
//唯一已知的入口是通过在任意层级的可用后室地铁，有时可以在Level 11和Level 9中找到。本层级中的出口是各个登机口，美国航空登机口通向Level 4。达美航空登机口通向Level 0。西南航空登机口出现很少，一般通向Level 42。美国精神航空登机口会通向Level 34。美国联合航空登机口会使进入者直接死亡。没有标注的登机口并不建议进入，但是它却可能会通向后室中未被发现的区域。另一种离开的方法是在本层级中滞留三个星期（在这里不吃不喝也可以生存），然后对讲机中将会有个未知的声音广播855号2航班即将起飞，穿过机场并到达登机口后你就会进入Level 36.1。你也可以进入机场地下室然后通过楼梯或者电梯离开。
//
//作者信息
//« Level 35 | Level 36 | Level 37 »
//
//脚注
//1. 译者注：914号航班1955年起飞，起飞后并未到达目的地。之后飞机宣布失事，机上全部人员失踪，该航班与1990年重新降落在委内瑞拉卡拉加机场，乘客与机组人员完好无损。已被证明并非事实，为都市传说
//2. 译者注：855号航班空难是1978年1月1日发生在印度孟买的一次空难事故，机上213人无一生还


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl36{}