package lvls0;
//Level 39
// 
//
//生存难度：
//等级 0
//
//安全的
//稳定的
//实体绝迹339759320_6319a0eba7_b.jpg
//Level 39主要区域。
//
//Level 39 是后室的第40层。它于1998年1月14日被一个匿名的流浪者发现。
//
//描述
//Level 39由许多蜿蜒的泥泞小道组成，它们的两边覆盖着广袤的橡树林。这一层级是有限的，呈圆形，跨度约300公里（190英里）。Level 39内不存在昼夜循环，被固定在一个永恒的黄昏时段。尽管在Level 39不断变化的时段中天体正常出现，但天体并没有真正存在于Level 39层级本身内。本层级的温度恒约 20°C~23°C (68°F ~73°F)。
//
//Level 39 的路径随机的扭折弯曲，有时会形成无效闭合的线圈和曲圆。层级的这一特征使得流浪者们很容易丢失方向感。Level 39内的路径通常有2米（6.6英尺）宽。
//
//Level 39内的橡树被证明是不可移动且不可摧毁的。经过进一步的实验考量发现，这些橡树并非活体，它们的根系逐渐生长嵌入到这一层级的土壤中，因而它们其实是这一层级不可分割的一部分。
//
//该层级的地表覆盖着一层落叶、干橡树枝、苔藓，还有一些罕见的砾石。有时可以在浅层的草上找到体积很小的可食用菌。这一层级有一些池塘，但它们的跨度通常不超过5米（16.4英尺），深度通常不超过半米（1.5英尺）。Level 39是一个地势起伏相对较大的层级，山地的坡度在5°~ 70°内波动，这使得层级的某些部分在没有适宜装备的情况下很难探索。
//
//去过Level 39的流浪者们表示，该层级让他们感受到一种很不自然的平静。他们中的许多人还表示，该层级给他们带来了一种极为强烈且令人舒适的怀旧感，即便他们在进入这一层级之前从未见过或体会过这一层级或与这一层级的类似的区域。同Level 14一样，Level 39的环境似乎可以催眠流浪者，让他们在层级内停留很长时间。在大多数情况下，这将导致流浪者在Level 39内逗留至会影响其健康的时间，令许多人死于饥饿或脱水。流浪者们还发现，在这一层级的中心区域，这种影响会更强，而在边界区域，这种影响便会趋近于零。幸运的是，只需要饮用一小口杏仁水便可以消除这种效果。
//
//鉴于这一层级的催眠效果是极易消除的，水和食物也是很容易获取的，而且在这一层级中不存在其它任何实体，因而Level 39具有成为长久定居点的潜力。
//
//边界区域
//8549505440_dc7efb58e4_b.jpg
//Level 39的边界区域。
//
//边界区域 是指位于Level 39边界地带的一片区域，距离它的中心区域约150公里。那里的区域相对平坦，树木稀疏，通常没有叶子。边界区域的温度要低很多，平均温度一直都在12°C (54°F)左右，那里的天空总是阴沉沉的，十分昏暗且阴云密布。
//
//层级的这一部分非常不稳定且危险：在边境区域，飓风经常刮倒流浪者，龙卷风和雷暴也像这样存在于此。正因如此，很少有流浪者愿意冒险，试图穿越边境的树林，因为仅仅是身处其中就足够危险了。据推测，那片树林的后面可能是丘陵地带，那里兴许没有此处危险。M.E.G.的特工们正试图组织一支探险队，进一步探索考察这片区域。
//
//基地、前哨和社区：
//该层级目前不存在已知的基地、前哨或社区。
//
//入口与出口：
//入口
//目前只有四种方法进入这一层级。
//
//在Level 37内探索时，丛林中的树木有时会慢慢变得像Level 39内的一样，而不像原来的样子。这些树木将围绕着一条明显不同的路径，如果你决定沿着它前行，那么最终你将被引导到Level 39。
//Level 135的某些部分有时会连通着你进入Level 39。如果天色开始变得越来越暗，太阳突然开始落山，那么这就意味着你正在接近39。
//在Level 499中，有的森林地域的顶部有一些洞，当你试图从那里爬出，便会来到Level 39的地面。
//进入Level 797墙壁上的某个洞将会将你带到Level 39。
//出口
//目前只有九种方法退出这一层级。
//
//有时切出Level 39的山丘就会到达Level 63，坠入Level 63的虚空亦可能导致流浪者回到Level 39。
//如果边界区域开始下雪，那么便可以直接进入Level 129。
//切出Level 39的树木偶尔会将你带到Level 170。
//切出Level 39的地面偶尔会将你带到Level 192。
//偶尔Level 39的某些路径上会出现一些随机生成的木板，站在上面便就可以到达Level 300。
//当Level 39的边界区域罕见的发生暴风雪时，你将会被直接带到Level 420。
//Level 39中的某些路径会通向Level 448外部的泥土平原。
//掉进Level 39的水坑中，将会导致你在Level 466的湖边醒来。
//在Level 39的边界区域，你可以找到通往Level A-1.3的桥梁。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl39{}