package lvls0;
//生存难度：等级5
//◆不安全
//◆不稳定
//◆实体横行
//
//
//Level 38是后室的第39层。它是Level 0到Level 37之间的所有层级的集合体。
//
//一片显示出Level 4，Level 5，Level 6与Level 9特性的Level 38部分区域。
//描述：
//
//Level 38是所有低于Level 38的常规层级的综合体。它被认为是Level 0到Level 37的所有层级相互折叠的地方。造成这种折叠的原因是因为后室的各层没有明确的结构，这意味着当各层相互折叠以创造出入口和出口时，这些层的某些部分最终会重叠并存在于一个共通连接的区域内。
//
//大多数在Level 38中拍摄的照片所呈现的状态。
//除了具有前38层级的所有物理属性外，Level 38还与前38层产生的一些特殊效应相同。这包括在Level 6发现的强烈的精神压力效应，在Level 28发现的巨大的霉菌丛，以及在Level 33的外部区域发现的腐败环境。
//
//Level 38是由两个区域组成的。这些区域没有被定义，而且每个区域在本层都存在有多个。这两个区域分为内部和外部。
//
//内部：
//内部是一个概括的术语，指的是存在于不包含在天穹1内的区域的任何位置。这些区域是Level 38最常见的区域，并且很可能是人们在旅行到这里时出现在的第一个区域。由于Level 12所拥有的效果同时存在于Level 38，想要拍摄这些区域的照片几乎是不可能的。到目前为止，只有两张Level 38的照片没有被破坏或扭曲。
//
//尽管这些层级相交和重叠的布局看似随机，但哪些层级最终会和哪些层级相互融合，哪一层级的效应又会呈显性的规律已经被观测到，具体如下：
//
//◆Level 0的总体房间布局。
//
//◆Level 1的闪烁的灯光。
//
//◆Level 2的上锁的门和管道。
//
//◆Level 3的金属门和强大的无线网络。
//
//◆Level 4的窗户。
//
//◆Level 5的装饰。
//
//◆Level 6迅速产生的精神压力和黑暗的墙壁。
//
//◆Level 7的第一个房间拥有的引力效应。
//
//◆会让人联想到的Level 8的钟乳石。
//
//◆Level 12的图像损坏特性。
//
//◆能在Level 13看到的大量层级。
//
//◆Level 14的[REDACTED]。
//
//◆Level 15的引擎声。
//
//◆所有的时钟和数字日历都恢复到2001年1月19日，即Level 16进入后室的日期。
//
//◆Level 17的印记已被报道在Level 38出现过。
//
//◆某些房间将变得类似于个体童年的经历，类似于Level 18的运作方式。
//
//◆Level 19的脆皮地板。
//
//◆Level 20的机器。
//
//◆Level 21的中间部分在整个层级中偶尔可以找到。
//
//◆在Level 22发现的实体同样被发现居住在Level 38，并且有记录显示它们偶尔会改变房间的布局。
//
//◆Level 23的空气毒性。
//
//◆窗外模糊的景色，类似于Level 24的天空。
//
//◆每层楼的大小与Level 25相同。
//
//◆Level 26混乱的布局，如随机的楼梯、门和走廊，不知通往何处。
//
//◆实体的集中度与Level 27相似。
//
//◆Level 28的模具。
//
//◆Level 29的画作，可以把人传送到Level 0至Level 37之间的层级。
//
//◆鸟类存在于在这一层，与Level 30内的鸟类相似。
//
//◆Level 38拥有着与Level 31类似的披萨和苏打水的味道。
//
//◆Level 38将随着探索深入而开始腐烂，与Level 33的效应相似。
//
//◆会出现薄薄的砖块堆砌而成的管道般的区域，类似于Level 34的下水道。
//
//◆Level 36的受污染食物。
//
//
//
//外部：
//外部是指Level 38中存在于室外空间的任何区域。这些空间不太常见，因为在Level 0和Level 37之间存在的室外层级较少。尽管如此，这些层级之间的连接和重叠的相关系数已经被确认和记录下来：
//
//◆类似于Level 9中存在的房子，尽管它们里面总是没有家具。
//
//◆外部的地板上经常会覆盖着小麦作物，就像Level 10的麦田一样。
//
//◆被动无害的无面灵在这个区域游荡，就像在Level 11那样。
//
//◆在Level 38看到的游乐设施将零星地存在于整个层级中，它们经常会互相叠加或穿插在一起，切出天穹¹。
//
//◆在Level 35看到的汽车会出现在Level 38。
//
//◆天空经常会在紫色、绿色和蓝色之间变换颜色，与Level 37类似。然而，在大多数情况下，“外部”的天空将是上述三种颜色的混合体，令人感到不适。
//
//
//
//基地、前哨和社区：
//前B.N.T.G.前哨：商队
//
//当Level 38最初被发现时，B.N.T.G.试图创建并维持一个前哨站。它的目的是为那些意外来到本层的流浪者提供杏仁水和其他物资（如双生指）。然而，这个前哨站被废弃了，这是由Level 38的不稳定性，以及实体不断的围攻造成的。
//
//
//
//入口和出口：
//入口
//
//通过在Level 0到Level 37间徘徊可以进入Level 38。在行走的过程中，人们可能会注意到周围景观逐渐变得混乱，一般来说会看上去充满了相互拼接和重叠的景象。在这样游荡时，流浪者最终也有可能进入Level -0。
//
//出口
//
//离开Level 38的方式与进入该层级的方法相同，在穿越时，人们可能会注意到周围的环境开始转变并看上去更加稳定。一个人最终到达的区域取决于他在Level 38所在的区域。如果在外部，他将去到任何存在于天穹下的层级。如果在内部，他将去到任何由数个的室内房间组成的层级。
//
//另外，如果一个人能够在外部攀爬或使用过山车，你就有可能从天穹中切出，进入蓝色通道。
//
//
//脚注
//1.天穹，在后室的背景下，指代一个表现出云彩和天空的穹顶。通常情况下，这些天空都很有活力，看起来栩栩如生 作者：b站鸽子王在此 https://www.bilibili.com/read/cv18939902 出处：bilibili


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl38{}