package lvls0;
//Level 32
// 
//
//生存难度：
//等级 5
//
//不安全
//不稳定
//存在强大实体medium.jpg
//Level 32内的森林。
//
//描述:
//Level 32 是一片永处黑暗之中的森林，它在仅有一弯新月而无星闪烁的苍穹下无限延伸。这一层级的树上悬挂着许多骷髅，它们苍白的骨骼在月光下闪烁着诡异的光芒，在风中空灵的作响。 有人说他们可以听到这些骷髅的对话，它们有时在谈论生前的生活，有时在谈论即将成真的预言。而且他们已死的空洞的眼窟后似乎有生命存在，这可能只是风吹过他们的颅骨时所制造的错觉。
//
//the-belle.jpg
//贝丽
//
//除了这些骷髅之外，只有一个实体在这一层级游荡，她有两种形态：她的第一种形态是“贝丽”，一位身着维多利亚时代橙色长裙、面色苍白、头发乌黑的女性，她瘦削的脸上扑满了脂粉。贝丽并不言语，但她却像诱捕猎物的海妖一般，引导着流浪者跟随她。如果流浪者追随着直到她离开流浪者的视野后，流浪者们将很快就会见识到她的另一个形态——骷髅女皇。
//骷髅女皇身材高大，骨瘦如柴，穿着一件破旧的黑裙子。她是一个极为强大的存在，似乎有着几乎完全由她所控制的领域。如果你尊重她，那么她可能会放你走，但如果你对她不敬，她便会立刻命令周围的树将你撕成碎片。当然，可能会出现更糟糕的情况，她也许会将你当作玩物，给你逃跑的机会，当你奔跑的精疲力竭时，她便会命令大地将你吞没，尸骨不存。
//
//入口与出口:
//没有人确切的知道如何进入Level32，似乎只需要在黑暗的森林中迷路就可以了。有些幸存者甚至表示他们是直接从前厅进入这一层级的。我们所知道的是，当你看到树上悬挂着的骷髅时，除非你见到骷髅女皇本人，你便没有其它出路了。那时，你的命运便全权掌控在她的手中。
//那些被骷髅女皇释放的人发现自己在后室的另一片森林中苏醒，仿佛他们所经历的一切仅是一场噩梦。
//
//当然，这并非梦境。
//
//一个流浪者独自穿越一片大雾弥漫的森林来寻找骷髅女皇的领地。她并非第一个有意寻找这片失落之森的人，但在她之前很少有人来过，因为没有一个头脑正常的人会冒险主动来遭遇骷髅女皇，把自己的命运交付她手中。
//
//也许她脑子不太正常吧。但也许这是令她继续前行的理由吧。她为悲伤苦痛所折磨，眼泪不断顺着她的面颊留下，因为她无论如何都没法适从在她备受煎熬的生活中失去那个人的记忆。
//
//也许她的脑子正常的不能再正常了。失去一生挚爱令让她明白了什么才是最为重要的，让她意识到有些东西比她短暂的生命更为重要，有些人对她而言比她自己更为重要。
//她看到一具骷髅悬挂在她面前的树上，就像标志着黄昏已临的第一颗星星一般，很快就会有更多的星星加入进来。在她的视线内，数百具骷髅排列在树上。她继续前行着。
//
//树叶发出的嘎吱声将她从恍惚中唤醒，她看到前面有一道身着橙色连衣裙的身影。那个身影转身潜入了黑夜之中。她紧随其后，直到那道人影消逝在她的视野中，她便为即将来临的会面做好了准备。
//
//“啊，殉道者呀。”一声低沉的女音，从她头顶上一具裹着睡衣的骷髅嘴里传出。
//
//她轻轻的跪下，她知道必须十分小心，因为她不想在没有得到她想要的东西的情况下死去。
//
//“多有礼貌啊，”骷髅女皇说到“告诉我，你能听到树上的人在唱什么吗？”
//这是一个奇怪的问题。她极仔细的聆听着，但只能听到风掠过树枝的呼啸声。她试图起身，却发现无法从跪姿中挪身，骷髅女皇将她定在原地，静候着答案。
//
//“不——不，”她哽咽着说“他………他们在唱什么？”
//
//“他们在歌唱着已逝之神复生的故事，在沉悼着女皇陨落的故事，在吟诵着我们的世界与下一个世界相连处被撕裂粉碎的故事，还有那曾经的故事。它们论及了一个新时代的来临、覆灭与重生，但你对这一切的一切都并不在乎，对吧？”
//
//女皇默默地点了点头，终于允许让她站起来。
//
//“那么，请告诉我，你来到这里的目的是什么。”
//
//“我希望同你进行一桩交易，为了另一个人的生命。”
//
//女皇笑了。
//
//“那么，请告诉我，你必须用什么作为这桩交易的筹码？”
//
//“我的生命。不——不仅仅是我的生命，还有我的灵魂。”
//
//“我在听。”
//
//“如果您能让我的爱起死回生，我将将我的生命与灵魂悉数奉献于您，来世今生都为您效劳。”
//
//“爱。 当然了，爱总是会冲昏我们的头脑，让我们做傻事，不是吗？ 其实，在很久以前，我处在同你一样的困境之中。那已是一段遥远的故事了。 所以，我将会应许你的请求。”
//
//“谢谢你。”
//
//当树根从地面升起，将她拖下时，另一个人从一方浅浅的坟墓中爬了出来。一支已然熄灭的蜡烛被重新点燃，正因她的灵魂被紧紧禁锢在构成这个平面的粗糙的土壤和树根内，将她永葬于无尽的黑暗中。
//
//这是自他逝世之后，她第一次感到如此释然。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl32{}