package lvls0;
//Level 30
//Level 30 - 原版
//Level 30 - 第一版修订
//Level 30 - 第二版修订
// 
//
//生存难度：
//等级 2
//
// 
// 
// 
//Level-30.jpg
//Level 30的天空盒。
//
//Level 30是后室的第31层。
//
//该级别本身以其改变记忆的能力、记忆潜伏者的存在及其扭曲的性质而闻名。
//
//描述：
//Level 30类似于一个巨大的日间的天空盒，1里面有着成群的岛屿。这些岛屿的面积都约有2000平方英里，彼此相距100000英里。这些岛屿十分的平坦，上面有着一层薄薄的草皮，下面是一些小石头和岩石。
//
//该层级中有着一种奇怪的能力，就是修改记忆的能力，它可以使人把整个层级想象成一场梦。在与记忆潜伏者接触后，就会出现这种情况。记忆潜伏者是一种小型的，像乌贼一样的实体，他经常在天空的周围飞行，也经常在岛屿的周围潜伏。当一个流浪者遇到记忆潜伏者时，这个实体会抓住流浪者的头，并且完全控制流浪者的大脑。然后，它会把流浪者对于周围环境的感知变成它想要的样子，通常对于不同的流浪者来说，变成的样子是互相不同的。
//
//记忆潜伏者是该层级独有的实体，偶尔在岛屿上也会出现笑魇和蠕灵，以及未证实其存在的鸟。
//
//基地、前哨和社区
//这里不再有已知的基地、前哨和社区了。不过，在过去确实存在过一个前哨站。理论上它已经被摧毁了。下面是他们留下的笔记之一：
//
//你好？有人能够听到吗？
//
//听着，我认为我应该发送一些关于遇到一个实体或者是其他东西的笔记。听好了。
//
//这个地方不太对劲，这个描述很短，但它有原因的。他们不知道发生了什么，因此他们也不能解释太多。但是我们什么都知道知道一些东西。
//
//好的，先就这样吧。
//
//这个前哨站被记忆潜伏者摧毁了。不要相信他们的话；他们受着层级的影响，正处于恍惚的状态。
//
//入口与出口：
//入口
//你可以通过切出Level 843来到这里。
//
//出口
//未知。
//
//作者信息
//« Level 29 | Level 30 | Level 31 »
//
//Footnotes
//1. 天空盒，如图所示，与前厅的天空十分相似。目前还没有人看到过它变成夜晚，更别说是其他时间了
//生存难度：
//等级 5
//
// 
// 
// 
//Level 30是后室的第31层。让我们开始吧。
//
//描述：
//无视等级5的标签吧，我这么做只是为了让这篇文章在数据库出现得高一些罢了。这里只有两种实体：记忆潜伏者——和层级本身。是的层级就是一个实体。我之后会详细解释的。
//
//所以我现在在一个伸手不见五指的岛上，有很多的桥重叠在一起。这很奇怪，我知道。但这就是后室。它们看上去通往别的地方。好吧，是大多数。我看到有一些会通往蓝色通道，而有一些会通往虚空的深渊，有一些我就真的不知道了，因为那边太黑了。幸好，我不是孤身一人，我和两个朋友在一起。我们有武器和杏仁水。我认为我们是安全的，我之后会保持更新的。
//
//编辑：这里有着记忆潜伏者。我忘了提起它们并不是一开始就存在在这里的。他们像是定居在这里的。它们只是四处漂浮…不过其中的一些会飘向我们。我设法用撬棍敲了一下它，而它就像是鱼一样在地上扑腾。我们没有人敢去触碰它，所以我们只能留它在原地腐烂。
//
//好的，是时候说说为什么Level 30本身是一个实体了。因为它会说话。我们知道那并不是记忆潜伏者或者是其他未发现的实体，但它来自，好吧，每个地方。每个角落，我们的背后，在我们的脑子里。它讨论着我们。我们的过去、后室、我们的遗憾和记忆潜伏者，它们被称为“天堂之门”，它们可以让我们从悔恨和恐惧中解脱出来。
//
//编辑2：我的一个朋友被记忆潜伏者“杀了”。
//
//显然，一个潜伏者偷偷地向他靠近，并“腐蚀”了他。我说的腐蚀的意思是，他的视觉和意识都被它改变了。他开始谈论这里是如何如何的“安全”等等。这些记忆潜伏者觉得它们说服了我。但它们没有。但我认为它们正在说服我的朋友们。我不想让这件事情发生在她的身上。那可太糟糕了。
//
//Level-30-2.png
//这太黑了
//
//编辑3：我…很疑惑。我的朋友们表现得如此…机械，她一直不带感情地说话。脸上一直没有任何的表情，只剩下简短而直白的回答，你知道我在说什么。当…不，如果我们逃了出去，我要去给她，和我自己寻求帮助。我希望我们能够离开。
//
//现在我想起来，这里的一切都很奇怪，感觉很…虚假？你会这样描述它吗？它太过扭曲，感觉一切都不正常。我想知道这里到底有没有出口？我很怀疑。实话说，我感觉这里的的一切都是2D的。我知道这听起来很让人迷惑，但这里就是很不自然。就像是每个人都能编造出来的东西。就像是个皮影戏。有什么东西正在控制着它。
//
//编辑4最后的编辑：我想我现在明白了。
//
//这全都是假的，所有都是。就像是VR头盔。而记忆潜伏者就是耳机，它们被设计出来的目的就是我看到的一切，这由某个人所掌控。不，是某个东西。没有人能做出这个东西。
//
//我猜这并不是Level 30的真相。但我知道我正处于被记忆潜伏者影响下的恍惚状态。我的朋友表现得很机械，一切感觉像是2D，这些事情都能够串联起来了。
//
//我要试着找一条出路。
//
//错误：出现了更新。空间已被文件占满。是否查看文件？
//Level-30-3.jpg
//︎ ︎᲼᲼᲼᲼
//
// 
// 
// 
//真相在我眼中
//
//Level 30 是后室的第31层。
//
//描述：
//Level 30是一个未知的层级，存在着两种形式，虚假的形式由层级本身控制，还有一个未发现的真实形式。
//
//Level 30的虚假形式就是描述Level 30的原版文章里的样子，查看original_draft_30.txt以了解更多信息。这个虚假形式通过居住在该层级唯一的实体，记忆潜伏者，向人们展示。这些实体可以通过对心智的伪装，让这个层级看起来像是平常的层级一样。这些实体会立刻地杀死你，并且让你以为自己还活着，这也是该层级是死亡区域的众多原因之一。
//
//Level 30的真实形式是完全未知的，也有可能是人类完全无法理解的。我们确实知道它的存在，但如果你意识到周围的一切都是假的，它就会杀了你。这里的另一个独特的实体，层级本身，似乎会用记忆和怀旧扰乱你的意识和视觉，而这会很快地转变成恐惧和厌恶。                                                                                                                                                                          
//
//Level 30实际上是一个实体，它运行着整个层级和现实。它似乎是一个有知觉的似是而非的实体，它可以说话并充分地说服虚假的流浪者，少数时候是真实的流浪者。他说记忆潜伏者是“天堂之门”，触摸它们会让你永远摆脱悔恨和痛苦。
//
//基地、前哨和社区
//本层没有已知的基地、前哨与社区。
//
//入口与出口：
//入口
//你可以通过切出Level 843来到Level 30。
//
//在Level 696的30楼发现一个故障物品会把你带到这里。
//
//出口
//未知。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl30{}