package lvls0;
//Level 31
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//level31.jpg
//Level 31的环形溜冰场。
//
//Level 31是后室的第32层。这是一个环形溜冰场，其各部分都独一无二。
//
//描述：
//Level 31是一个上世纪90年代风格的环形溜冰场。相比于在空间上具有无限性的其他层级，该层级似乎是循环往复的。该层级只能通过Level 2、Level 3或Level 27的一扇门进入。Level 6在少数时候也会出现通往该层级的门。大多数流浪者最终到达的是该层级的环形溜冰场区，而到达街机区的情况是很罕见的。环形溜冰场区是该层级最大、最安全的区域，尽管该层级总体上本来就是安全的。该层级仅有的实体是无面灵和猎犬，以及在该层级中被称为“教练”的实体。
//
//主区可以听到低沉的广播流行歌曲。在冰场底部的DJ站，偶尔可以看到一个无面灵坐在里面温顺地挑选歌曲。其他的声音，如溜冰鞋撞击溜冰场木地板的声音和笑声也可以听到。廉价披萨和汽水的香味从面向美食街的方向散发出来。离主区不远的地方有一个较小的儿童专用溜冰场。地毯上有霓虹灯行星和星星图案，并有一种潮湿的质感和气味，很像在Level 0发现的地毯。溜冰场两边都有长椅和座位，坐上去很安全。这里有Wi-Fi连接。向特定方向走出溜冰场区域分别可以进入街机区，溜冰鞋租赁区，或美食广场。
//
//街机区类似于Level 40中的街机区，拥有类似的声音、视觉和整体感觉。它在空间上不是无限的，且环绕着其底部的入口。虽然大多数时候都是在溜冰鞋租赁区看到“教练”，但有时也可以在这个区域看到他。街机区中唯一的实体是猎犬。
//
//跟着披萨和汽水的香味探索会进入美食街。这里有一个小的餐厅区，典型的廉价滚轴溜冰场食品(这些食品可以安全食用)，一个可以领取杏仁水的冷饮店，以及一个在柜台后面的、通向Level 176的员工专用区。这家美食广场唯一的实体是一个穿着员工制服、带着空白姓名牌的无面灵。该实体很温顺，如果有要求，会免费提供食物和杏仁水。然而，问它关于后室的问题会让它心烦意乱，并导致它不再给予你食物，并让你离开。
//
//向一个在其蓝色墙壁上挂着许多来自前厅的媒体海报的小餐厅前进可以轻易地来到溜冰鞋租赁区。溜冰鞋租赁区有许多尺寸的溜冰鞋和一个计数器与一张美制测量尺寸图表。进入滑板租赁可能会导致迷路。租赁由本地实体运行到这个级别，即“教练”。教练是一个极其复杂和聪明的无面灵，看起来像一个没有脸的棕色头发的人，穿着条纹教练制服。他很友好，也很聪明，还会提供免费的轮滑课。接受就会让他给你一双适合你尺寸的溜冰鞋，并解释如何在这个层级上安全生活。拒绝他会让他悲伤地叹气，而如果你想要上一堂课，他就会叫你过去。如果你向他要求的话，他也可以带你离开这一层级。
//
//基地、前哨站和社区：
//尽管Level 31的条件足以形成社区，但目前该层级上还没有任何社区形成。
//
//入口与出口：
//入口
//要进入该层级，你必须在Level 2、Level 3、Level 27或Level 6找到一扇木门，门的另一边听起来像是00年代中期的“泡泡糖”流行音乐。然而，在这些层级中找到这样的门是很难的，而在Level 6中则更为如此。不过，如果它出现，则可以很容易地被人所发现。
//
//出口
//要离开该层级，可以在街机区中切入任何一台正在工作的游戏机，这样你将被传送到Level 40；或找到一个可以把你带到Level 176的休息室的员工专用走廊。另一种少见的方式是在出租区找到一双外观像是能被窃皮者穿上的溜冰鞋，然后触摸它，这将使你被带到Level 0。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl31{}