package lvls0;
//Level 48
// 
//
//生存难度：
//宜居 
// 
// 
//12160614435_4a223e48a8_b.jpg
//关于Level 48海滩的照片
//
//43539009010_76a116c173_b.jpg
//关于Level 48热带森林的照片
//
//Level 48 是后室的第49层。
//
//描述
//Level 48是一个无限面积的沙滩并且拥有广阔的海洋，海滩以南可能没有任何生命迹象。海滩以北200米（656英尺）可以发现一处大型热带森林。Level 48没有昼夜循环并且时间一直处于晴朗的日落状态。从Level 48观察到的太阳呈红黄渐变色，散发出的阳光只有正常中午30％的照射量1。
//这一层拥有舒适的热带气候，由于所处位置不同周围环境温度从22°C (71.6°F) 至 36°C (96.8°F) 不等。Level 48有很多豪宅和酒店，这些现代建筑大小不一，配备了应有的家具与电器（包括空调）。看起来既奢华又美观。
//
//Level 48有许多茂盛的植被和可食用植物。因此，寻找食物一点也不难。结合各种宜居空间和便利设施，Level 48已被M.E.G.视为宜居。
//
//Level 48拥有茂密的热带树木（包括棕榈树、针叶树、常绿阔叶树和落叶树），有各种动植物，其中大部分看起来与前厅相似。Level 48中的动物都是非敌对甚至可能被驯服的，其特有的动植物群位于海滩以北 30 公里（18.6 英里）处。下面提供了Level 48内的动植物的详细列表：
//
//动物群系
//关闭
//岚冠虎
//岚冠虎是温顺的类似美洲虎的生物，它们拥有蓝色的皮肤以及紫色的眼睛。与美洲虎相比，岚冠虎没有锋利的牙齿并且是食草动物。它们通常在热带森林的灌木丛中游荡，但偶尔可以在草丛较少的地方看到。岚冠虎的视力比美洲虎好，而且似乎能感知和听到最远两公里（1.2 英里）外的流浪者。它们可以以高达 45 公里/小时（28 英里/小时）的速度飞速奔跑。岚冠虎似乎也对一些致命的元素免疫，例如被硫酸腐蚀的疼痛。它们可以三天不吃食物并且可以五天不睡觉。虽然记录了一位流浪者完全驯服了一只岚冠虎的案例，但是这是未经证实的。
//
//蔚拉弗斯鹿
//蔚拉弗斯鹿似乎与前厅长颈鹿相似，但它们的皮肤是绿色的。它们比长颈鹿高得多，可达十二米（39 英尺）。尽管身高很高，但它们可以保持平衡而不会摔倒。蔚拉弗斯奔跑的速度最高可达 60 公里/小时（37 英里/小时）。蔚拉弗斯的智力水平相当低，他们需要长达六秒钟才能感觉到流浪者在抚摸他们。我们通常可以看到六到十只蔚拉弗斯鹿聚集在一起。据观察它们可以长达36小时不进食。
//
//妃红豹
//妃红豹与前厅中的黑豹类似，但主要区别在于它们的皮肤是粉红色的。妃红豹似乎能够进行无性繁殖，它们比正常黑豹小大约25%，对待流浪者的态度很消极。妃红豹可以以高达 33 公里/小时（25.5 英里/小时）的速度奔跑，它们一生2只吃草和树叶。它们的咆哮声可以在 1.6 公里（一英里）以外的地方听到，通常可以在草丛较少的地方看到妃红豹游荡。
//
//泽佩斯猴
//泽佩斯看起来与猿猴相似，但它们的皮肤是红色的而且比猿类聪明得多，而且耳朵也更大一些。它们能够理解甚至说人类语言。它们还可以吃人造食物和森林中的植物。据观察发现泽佩斯猴使用森林中的树木原木建造木制避难所。
//
//夸罗鹦鹉
//夸罗鹦鹉是黑色皮肤的鹦鹉科鸟类。据记载，夸罗们远不如普通鹦鹉聪明，而且寿命只有 20 年，但是它们的叫声比普通鹦鹉更加刺耳。它们通常生活在草丛茂盛的地区，并且通常活跃在森林较暗的地区。
//
//植物群系
//关闭
//维洛卡花
//维洛卡花属于小型花种，外观和形状前厅中的西番莲相似，区别在于它们是灰色的。与普通的西番莲不同，维洛卡花在野外的花期只有八个月。维洛卡的果实是灰色的、类似于鸡蛋的外形，含有大量的维生素 C 和钾元素，建议较多食用。维洛卡水果中的液体也可以提取出来制成维洛卡果汁，特别是其中可用于治疗精神疾病（尤其是情感障碍）的部分元素。
//
//格罗梅利亚
//格罗梅利亚与前厅中的凤梨科植物非常相似，唯一的区别是它们的花期3比凤梨科植物的花期短。
//
//基地、前哨和社区
//维洛卡农社
//维洛卡农业联合基地是一个由大约 300 名成员组成的农业社区。通常可以看到他们从各自的植物中收获维洛卡果实。他们可以从水果中提取液体制成维洛卡果汁然后在商店售卖。
//
//入口与出口
//入口
//切入Level 134中的沙子将会来到Level 48。
//游到Level 121的淡蓝色湖底会被传送到Level 48的岸边。
//翻过Level 188中的一扇描绘了处于日落状态的海滩的窗户，将通往Level 48。
//进入Level 21中一扇带有红黄色渐变的门会来到Level 48。
//睡在Level 11中一间铺满沙子的房间将会让你在Level 48醒来。
//在Level 46的沙漠中，切入一棵随机出现的棕榈树将会来到Level 48。
//出口
//Level 48中的酒店有通往Level 581的大厅的道路。
//游到一个小湖的湖底会将会被传送到Level 121。
//在海滩上有很小的几率会被影子拖到Level 100 这一点没有得到证实。
//Level 48的森林中可能会随机出现农舍，进出农舍将会被带到Level 10。
//作者信息
//« Level 47 | Level 48 | Level 49 »
//
//Footnotes
//1. 原文为“并且会散发出地球中午时分所接收到30％的阳光“
//2. 妃红豹可以在野外存活30年
//3. 花期为两周左右


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl48{}