package lvls0;
//Level 40
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//level-40-cc.jpg
//目前唯一已知的一张Level 40的照片。
//
//Level 40是后室的第41层。这一层似乎是一间无限大的游戏厅，且有着一些相当反常的地方。
//
//描述：
//Level 40类似于一个1980年代中后期的游戏厅，内有着你期待会在那个年代见到的诸多游戏和媒体。从Level 40周边的许多标识可以推测，这一层级的名称为“摇滚披萨！”。层级本身的众多表面都有着相当复杂的设计元素或图案，如充满行星和恒星图形的深蓝色霓虹地毯和混凝土墙壁，就像是一些宇宙飞船和宇航员在四处活动。
//
//Level 40中的自动售货机和一些其他的食品供给处有着多种多样的食物和其他消耗品。尽管杏仁水并未在这一层级中被发现，这里的食品似乎十分新鲜且安全。然而，这些食物被一种叫作“Starflare上将通用酱汁”的敷料所覆盖。这种酱呈青柠色且微微发光，其间点缀着许多星状亮斑。Level 40中海报和电视节目上近期的广告声称，这种酱料可以还原任何一种食品的味道，因而被称为“通用”。目前这一物质正处于研究状态，因为无数食用过它的人似乎都坚信自己是来自“Starflare上将太空核心”的太空学者。更多信息将会被陆续公布。同时，我们不建议任何人尝试摄入这种特殊的酱料。许多售货机和游戏机都贴有“暂停服务”的纸条，看起来像是黑色记号笔写上去的。
//
//诸多建于Level 40周围的电视台所播放的商业广告似乎是随机且怪诞的。这些广告有如下记录：
//
//全新维度的银河系冒险&可供选择的多样性口味，隆重向您介绍Starflare上校通用酱汁！全新的味蕾挑战！为各位太空学者精心附赠外星探险！一切精彩只在摇滚披萨！拨打404040404040404040404040404040404040404040404040即有机会赢得五项奖品中的一项！还有限时Starflare上将塑像正在筹备！报名只需——（广告突然黑屏随即中断。）
//嗨嗨嗨！就是你！往这边看！是我们！后室装修公司！还在担心家周围的死亡陷阱吗？我们会帮你留意！还在为房屋里不断移动的大厅而苦恼？我们来帮你解决！还在被各种生物感染所困扰？额……我，我们可能处理不了……嗯……不过我保证我们可以联系到这位灭虫好手！他会在最短时间内解决一切恶心的感染！你还想知道些更棒的吗？唔，我——我不确定，哈，但这些都无所谓，因为第一次体验过后你会得到一次免费的房屋翻修！完全免费！等等……我们似乎一直都是无偿服务，不是吗？一直都是。总之，你懂的！来联系我们吧！……怎么才能再次联系到我们呢？ (广告结束。)
//(这个广告由繁多的背景音乐，字幕以及一张礼堂的图片所构成。) The Sanity Sisters在礼堂的演出票开始销售！欢迎在演出后参加后续活动。我们准备了很多很酷的项目！赶紧去寻找办公室中的红色双开门吧！派对上见！
//还有更多广告被记录了下来，但大多数都不具备可理解性，或是过度损坏无法还原。另一部分未被记录的广告见于Level 40以及各类其他层级。
//
//这一层还有许多来自80年代的各种游戏街机。不同于Level 25中的街机，它们都是可正常运作的，且大多都可以游玩。许多流行游戏都来自于前厅，如:
//
//城市大金刚
//爆破彗星
//太空侵略者
//保卫者
//机器人大战：2084
//鸵鸟骑士
//圣铠传说2
//以及更多。
//Level 40中的一部分街机游戏并不存在于前厅，其中一部分未命名游戏有着完全随机的目标。有明确命名的游戏记录在下：
//
//撞击者2 - 游戏的主要目标是通过以不同速度将球投出以将两侧的对手击入河中。一个很反常的特性是，当球的速度足够快时，玻璃屏幕就会被撞击而破损，最终彻底碎裂，从而游戏中的一个角色可以从这里用球下意识地攻击现实中的流浪者。所幸投掷的力度很轻，不会造成太大的伤害。
//太空探索者 - 玩家作为一艘飞船的船长，驾驶飞船躲避小行星带和火力。游戏设定相当简单，并且似乎可以无限进行下去。已知无任何反常现象出现。
//跌落尽头 - 一个简单的游戏，你只需要接住从天上掉落的各种食物，以及在跳跃的过程中避开陷阱。然而，在玩家请求帮助时，不同的关卡会变得越来越难，越来越不合常理。此外系统似乎会记住玩家是否游玩过跌落尽头。当玩家因陷阱而死亡时，一直到他们下次访问Level 40，他们不会复活。
//压轴好戏！！！ - 类似于那个年代自上而下的赛车游戏。不同的是，在第12圈后，赛车会原地冻结，此后屏幕开始崩坏直至一切消失。片刻之后，屏幕上会出现一行字：“为什么？”。
//Starflare上将：狂野太空 - 游戏中的任务和设定与前厅中的流行游戏“精灵宝可梦”颇为相似，你需要使用一个戒指状的设备捕捉其他生物，并召唤它们对抗敌人。一旦玩家深陷于游戏中，他会逐渐无视周围环境，最终在一瞬间完全消失。建议不惜一切代价远离这款游戏。
//因此，一切基于这些未知游戏的研究已被禁止，其余静候后续通知。
//
//不少游戏机被一种称为“消费者”的神秘力量所控制。这种力量在游玩不同街机，完成游戏中设定的各种任务时表现出具备智力。其中一部分甚至会使用各种bug和漏洞。当一个流浪者尝试与正被“消费者”使用的游戏机互动时，流浪者会感到晕眩，并昏迷数小时。在Level 40中重新苏醒的流浪者看起来并无异常。不建议与任何正被使用的游戏街机交互。其中一部分游戏街机被无面灵游玩，它们可能是11种类型中的任意一种。和它们交互大抵不会产生危害，但依然不被建议。此外似乎没有其它常见的实体出现。
//
//在Level 40中Wi-Fi是不可用的，这对于层级所处的时代而言非常合理。有时，你可以听到天花板传来80年代的经典流行歌曲和各种流行乐。混杂着街机游戏永无止尽的噪声，在整个Level 40中都可以听到人们喋喋不休的声音、以及孩童玩耍的声音。当在Level 40闲逛时，可以闻到劣质披萨和久置苏打水的味道充满整个层级。
//
//如果深入探索，你也许会到达一个保龄球场。保龄球场的装修审美与level 40的剩余部分并无二致。可以在这片区域的许多桌子上发现食物，大多都抹有上文提到的酱料。由于消费者的食用，一些食物会随机消失。场馆本身是按照计划运作的，可以被正常游玩。竞赛排行榜显示的用户名由随机数量的数字和字母构成。一些屏幕会因为用户名过长而崩溃。
//
//探索得更深些，人们也许会到达街机厅的更多区域，或是一间小小的、类似于办公室的门厅，里面有男女两个卫生间，以及在一扇木门后的一片“仅供职员使用”的区域。卫生间正常运作，木门可以将人带向Level 0或是一间小休息室。室内有着粘潮的黑色地毯以及和Level 40其他部分一致的蓝色墙壁，尽管墙上没有了宇宙风格的设计。房间内的物品很稀少，这包括几张办公桌上的老式IBM电脑，一些自动售货机，以及两张带椅子的桌子。人们还会发现另一扇门后的“仓库”，一个堆满了糟糕的食品和玩具的类似于储藏室的空间。现阶段认为这间屋子是一条“死胡同”。
//
//最远的区域是一间配备旋转门的出口大厅。进入这扇门会使你进入
//Level 9，Level 10或Level 11，这取决于你在前厅成长的环境。尚不知晓此出口是否可以通向其它层级。
//
//在Level 40探索时可能会发现一个小型前台。在这里可以找到一个高挺的，类似于被拉长的人型实体，叫作“Pat”。此实体绝对安全且乐于与人交谈。他戴着一顶棒球帽，身穿一件扣好的亮蓝色衬衫。尽管他的说话速度很慢，但他具有极高的智能。他有四只胳膊，使用他们去完成各种工作。下面是一条音频日志，用以展示人们与Pat所展开的多次对话中的其中一次。
//
//折叠M.E.G. Level 40 Patrick 音频日志-64:
//音频日志 2016/09/24
//日志开始：07:23
//相关组织： M.E.G.兵团罗经点 - "首次探索"
//
//Jack: 好。可以开始了。
//
//Reed: 一切就绪，正在靠近Patrick。
//
//(音频混杂着人们游玩各种街机的游戏声，以及小队微弱的脚步声。)
//
//Reed: 嘿Pat！发生了些什么？
//
//Pat: 呃，没什么。只是有些……无聊。
//
//Reed: 听起来没什么大碍。好，你还记得MEG的老伙计们吧？
//
//Pat: 嗯……当然……怎么了？
//
//Randy: 唔，Patrick，嗯……刚刚聊得有些多，长官们认为也许是时候问你一些有关Level 40的问题了？
//
//Reed: 是啊，越简短越好！
//
//Pat: 好的……等等，怎么……又是40？
//
//Jess: 你玩过的街机。
//
//Pat: 哦……对！……不起，记不清了。记性不太好。
//
//Randy: 谢天谢地，伙计，这不是什么重要的问题。
//
//Pat: 希望如此。
//
//Reed: 好，我们继续……你来自哪里？
//
//Pat: 记不清了……大概是家？
//
//Jess: 你的家在哪里？
//
//Pat: 这里……就是家。
//
//Reed: 唔，早该料到的。好吧，你知道Level 40是如何被创造的吗？
//
//Pat: 不……就是这里。
//
//Randy: 你的意思是，你来的时候它就已经是这副模样了吗？
//
//Pat: 不是……也差不多。
//
//Jack: 他在说啥？
//
//Pat: 我想不……起来了。
//
//Randy: 意料之中。
//
//Reed: 好的，接下来我会跳过一切有关后室的问题，因为你看起来从未离开过Level 40。所以，可以让我们问一些关于街机本身的问题吗？
//
//Pat: 嗯……
//
//Reed: 好的，好的。嗯，你游玩过这些机子吗？
//
//Pat: 不……最好让消……消费者们玩。
//
//Randy: 消费者？
//
//Pat: 是的……就在我们身边。
//
//Jess: 我猜这是那些鬼怪的名字？
//
//Reed: 听起来差不多。
//
//Pat: 我爱消费者……很有趣。就像Daniel……等等，他在哪？
//
//Jess: 啊，他今天不在这里。Dan在之前的一次任务中被捉到了。他受了伤，不过正在缓慢康复。
//
//Pat: 啊……难过……但没办法。祝他早日康复。
//
//Reed: 谢谢你Pat，我确信他会想你的。好，下一个问题，你知道Starflare上校通用酱汁来自于哪里吗？
//
//Pat: 嗯……供给者。他们提供存货。
//
//Randy: 比如说，你知道他们是谁吗？
//
//Pat: 不……在这，然后走了。
//
//Randy: 啊。明白了。
//
//Reed: 好极了，重要的信息。然后，你知道为什么自己电视上会出现这些看似随机的广告吗？
//
//Pat: 嗯……是制片者……他无处不在。
//
//Randy: 谁？在哪？
//
//Jess: 你还能给我们更多有关制片者的信息吗？
//
//Pat: 不……不能……想说，但不能。
//
//Jack: 为什么？
//
//Pat: 困难……不想让……不想让我……
//
//Reed: 他什么都不让你说？
//
//Pat: 是啊……什么都不让……雾。帷幕。
//
//(Reed自言自语。)
//
//Reed: 帷幕……帷幕，我也许明白了。
//
//(Jess看了看表发现时间到了，他们必须离开。)
//
//Jess: 唔，伙计们，该收拾东西了。
//
//Randy: 他妈的，现在？
//
//Reed: 看起来是这样的，我们走吧。下次见，Pat！
//
//Pat: 谢谢……替我向Dan问好。
//
//Reed: 我会的！
//
//Jack: 好，我来收好这个。
//
//(伴随着沙沙的噪声，Jack转过摄像头，露出他的脸，然后关掉了设备。)
//
//日志结束：07:34
//
//
//总结： M.E.G.兵团罗经点小队的 "首次探索" 接受了询问实体 "Pat" 有关Level 40起源的任务，却获得了一些意料之外的结果。关于 "制片者" 的研究正在尽快进行。
//
//基地、前哨和社区：
//在Level 40中有不少组织活跃，因为层级本身不具备过多危险性。然而，记得警惕层级中的一部分组织。下面是最具代表性的几个。
//
//B.N.T.G. Level 40资源前哨：
//一所由The B.N.T.G.建立的前哨，旨在收集街机中的机械部件。
//包含约20名员工以收集各种资源。
//他们使用附近一个通向Level 1的出口以将资源运输到贸易者堡垒。
//常受到扰频器攻击。
//扰频器前哨:
//一个在Level 40中建立前哨的常规恐怖组织。
//这一前哨似乎包括5人。
//极端敌对，会毫不犹豫地抢劫你。
//通常使用街机来制造装甲和武器。
//少部分情况下可被贿赂。
//Starflare上将的太空学者：
//组织成员和人数均未知。
//似乎以上文提到的特殊酱汁为食，并以此维生。
//不敌对，喜好探索远方，但受到挑衅会进行攻击。
//入口和出口：
//入口：
//要进入，你必须找到Level 5中的一台游戏街机，然后游玩一小会，你就会进入Level 40，此时你仍然处于游玩状态。
//在Level 25的一扇玻璃后发现一幢建筑并击碎玻璃会将你带向Level 40。
//在Level 122中找到一张街机的海报并触碰它会使你来到Level 40。
//为什么不留下呢？不要离开你的家。
//在Level 777中找到一台游戏街机会使你来到Level 40。
//在Level 19中找到一台损毁的老式街机并挪动它会让你来到Level 40。
//在Level 29和Level 57中找到一个画满了游戏街机的房间会使你来到Level 40。
//出口：
//要离开十分容易，只需要找到上文提到的旋转门，就可以到达Level 9，Level 10或Level 11。
//找到一片仅供职员使用区域并进入以到达Level 0。
//走过旋转门，你会到达Level 9或Level 11。
//找到一个垃圾桶并走进去，可以到达Level 98。
//在储藏室坐得太久会到达Level 176。
//找到一台动物主题的游戏街机“动物饲养员”并游玩，这会让你到达Level 81。
//找到一段生锈的旧楼梯会把你带向Level 5的锅炉房。
//找到一卷标有“Mach +”的家用录像带并在休息室中使用电脑，这将启动一个叫作 美 感 的程序并将你带到Level 201。
//找到一扇生锈的金属门可以到达Level 1。
//游玩一个包含宽阔的土路、湖泊和高山的未命名街机游戏并使用切出可以到达Level 302。
//在Level 40中找到一个被藤蔓和污渍所覆盖的游戏机会将你带向Level 121。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl40{}