package lvls0;
//Level 47
// 
//
//生存难度：
//等级 3
//
// 
// 
// 
//Level 47是后室的第48层。这是一个原始的、古老的森林，对熵和人为的变化都有高度的抵抗力。
//
//n8t4guQX9CvH735.jpg
//Level 47
//
//描述：
//Level 47是一片温带森林，由落叶树和针叶树组成。其中许多树的高度超过了一百英尺，而且看起来有几百到几千年的历史。厚厚的青苔和地衣覆盖着大多数适合它们生长的地面。在白天，森林均匀地覆盖在潮湿的浓雾中，看不到直射的阳光。
//
//然而，每天晚上，雾气都会消散，而且一定会出现满月。这个月亮看起来与前厅的月亮完全相同，但距离上会近许多，而且朝向Level 47的是月球的背面。同时也可以看到恒星和银河系，但是与前厅中的任何星座都不匹配。虽然很少见，但这里偶尔会出现银白色的极光。
//
//由于这里的时空十分扭曲，因此目前无法绘制Level 47的地图。除了后室中常见的非线性/非欧几里得的现象之外，任何在森林中未被直接观察到的部分，似乎都处于有可能的叠加状态，而不存在任何固定的状态或位置，除非你亲眼看到。由于森林本身看起来都差不多，这些变化通常是微妙的，不会被立即注意到。对于新进入的流浪者来说，这种影响往往是非常令人不安的，他们会在怀疑外部现实的稳定性之前，先去怀疑自己的精神是否正常。
//
//此外，当物体处于叠加状态时，时间似乎会被暂停，在看着某些物体的时候，物体发生的任何损坏或改变，会在物体回到叠加状态时恢复原状。这意味着，任何篝火或临时准备的工具和武器往往会（尽管并不总是）消失或恢复到原先的状态，这会使得生存这件事变得很复杂。
//
//溪流和其他自然水源在Level 47里很常见，一般来说，人们可以安全饮用。蘑菇是最丰富且最容易获得的食物来源，虽然有些种类是有毒的或是会让人产生幻觉。到目前为止，这里所有的蘑菇种类还没有被完全记录在案。
//
//实体：
//Level 47维持着数量众多、种类繁多的蛇类种群，它们以小型鸟类、哺乳动物和两栖动物为食。虽然并非所有的物种都已为科学所知，但除了一个种群之外，没有一个物种出现异常。伤害或杀死任何Level 47的蛇之后，会立即出现一条鲜红的泰坦巨蟒，它被人们称为“旧日巨蟒”，或简称“大蟒蛇”，然后捕猎和吞食冒犯者。
//
//在目前已知的所有事例中，在杀死或伤害一条蛇之后，没有一次大蟒蛇不会出现，也没有任何一个人能够成功地逃避或击退它。流浪者必须保持警惕，避免意外地伤害到任何一条蛇，以防激怒这个实体。值得一提的是，在Level 47之中，蛇唯一的天敌是乌鸦和渡鸦，而且它们对于蛇的捕食行为似乎不会惊扰大蟒蛇。
//
//大蟒蛇和Level 47的其他蛇的存在，让这个层级有了一个绰号，蛇之森林。
//
//到了晚上，一大群大型的黑色犬科动物就会活跃起来，如果有机会的话，它们会捕食人类。这些动物有时会被称为“黑皮狼”或“蛇之森林的狼”，它们似乎会利用森林变化多端的特性。它们长长的、凶狠的嚎叫会回荡数英里，在这不断变化的环境中作为灯塔，为其他的成员指明方向。
//
//当侦察狼发现猎物后，它们不会让猎物离开它们的视线，直到其他的狼加入狩猎队伍。这通常会使得侦察狼在很长一段时间里，只会近距离跟踪猎物而不会发起攻击。在此期间，侦察狼会简单地恐吓猎物直到其精疲力尽。这些狼在没有被猎物发现的情况下，似乎也会被传送一小段距离，尽管这种传送的方式会比植物的更受控制一些。
//
//当流浪者发现自己正被黑皮狼追赶的时候，应该爬上最高的树以躲避追赶。等待黎明的到来是最好的生存策略，因为没有人在白天遇到过“黑皮狼”，它们总是会在黎明前回到他们的巢穴。因此，尽可能地在树上睡觉，避免自己在晚上被注意到也是明智的做法。
//
//除了流浪者以外，黑皮狼的主要猎物似乎是一种Level 47特有的大角鹿亚种。当雄鹿和雌鹿的身边有着小鹿时，它们就会拥有很强的攻击性。如果遇到这种情况，请立即移开视线，并设法躲开鹿的视线，以躲避攻击。值得注意的是，在试图躲避黑皮狼的时候，这种方法是无效的。流浪者不应尝试着猎杀这些鹿，除非有一下就能把它们打倒的火力，因为他们在受到威胁和被激怒的时候，是非常危险的。
//
//基地、前哨和社区：
//一些流浪者遇到了一条穿过了森林的，蜿蜒的小路。虽然这条小路仍是非线性/非欧几里得的，但它并不会以叠加状态存在，也不会消失。那些发现了这条小路的人会本能地沿着它前进，希望它能通往一条出路或者其他有趣的地点。
//
//有些人沿着它走了几天，直到他们被迫放弃它去寻找水为止，这条路也没有到达过任何地方。另一些人则声称，他们沿着这条小路走了不到7英里，在来到了一片林间空地之后，路就中断了。这片空地上要么有一座大庄园，要么有一块古老的巨石。这两者似乎同时处于叠加态之中。无论哪种情况，这片空地似乎都是一个自称为俄菲翁神秘教团的团体的总部。
//
//目前我们对于这个团体知之甚少，因为他们通常对任何闯入他们的秘密林地的流浪者都充满敌意。他们没有兴趣提供任何帮助，并普遍认为流浪者是入侵者。然而，目前已知，他们对那条大蟒蛇十分的崇拜，相信它是世界蛇的子孙，或者是它的化身，抑或是它的显灵，而世界蛇则被奉为是神秘知识和力量的源泉。
//
//这个组织的成员也会在小路上或是在森林里被发现，他们通常蒙着面，穿戴着深红色的装束和象牙面具。尽管他们通常对流浪者漠不关心，但也有人遭遇到了从绑架到改教的一些事件。在后来的事件中，他们会经常吹嘘他们的团体拥有着神秘的奥术和神奇的力量，其中包括了可以随意在后室移动的能力。毫无疑问，他们的说辞中有夸大的成分，但他们显然比普通的流浪者更有信心在森林中行动，有着能够召唤和在某种程度上指挥“大蟒蛇”的能力，有人甚至曾经目睹过“黑皮狼”从团体的一个成员那里逃走的场景。
//
//建议流浪者尽量避免与这群人互动。不要和他们作对，并把任何关于帮助或救援的承诺看作是谎言。
//
//入口与出口：
//切入与切出是目前唯一确定的进出Level 47的方式。幸运的是，由于这个层级高度的不稳定性，切入或切出Level 47会比其他一般的层级更加容易与频繁。其中，枯树的空树干似乎就特别容易让流浪者切出。
//
//俄菲翁神秘教团的成员已经展示过，他们有能力引导那条小路，他们也声称，他们可以把小路操纵或引导到特殊的切出点。一位成员甚至声称，用这种方法可以到达前厅，但他立即被团队中的其他成员打断了。和他们谈话的那个流浪者怀疑这是他们故意耍的花招，目的是让他的希望破灭。
//
//到目前为止，从这条路线离开Level 47的有效性仍未得到证实。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl47{}