package lvls0;
//
//建立帐号 或 登入
//The Backrooms吧
//Backrooms Fandom Wiki
//The Backrooms中文wiki官方哔哩哔哩公众号
//Discord
//主页
//
//中文沙盒站
//
//图书馆
//
//层级
//|
//实体
//|
//物品
//|
//团体
//
//故事
//|
//相关人士
//|
//现象
//|
//设定
//
//搞笑文章
//|
//国际翻译中心
//
//原创图书馆
//
//原创层级
//|
//原创实体
//
//原创物品
//|
//原创故事
//
//原创团体
//|
//原创相关人士
//
//原创设定
//|
//原创搞笑文章
//
//原创艺术作品
//|
//原创现象
//
//网站
//
//最近创建的页面
//
//最近的更新
//|
//最近的编辑
//
//随机层级
//|
//随机原创层级
//
//随机实体
//|
//随机原创实体
//
//旧页面中心
//
//本月最高评分页面
//
//历史最高评分页面
//
//最低评分的页面
//
//社群
//
//讨论区
//
//翻译预定
//|
//最近的帖子
//
//作者页
//|
//中文网站作者页
//
//加入网站
//
//管理专用
//
//后台管理
//
//职员站点
//
//所有页面
//
//会员一览
//
//侧栏
//|
//顶栏
//|
//主题版式
//
//
//
//　
//
//Level 43
// 
//
//生存难度：
//等级 3
//
// 
// 
// 
//level-43-cc.jpg
//Level 43主楼的众多房间之一
//
//Level 43是后室的第44层。该层看起来是一座无边际的水族馆主题公园。
//
//描述：
//Level 43由主题公园内的四个主要区域组成。让人难以发现的是，这些区域都向着最终的区域延伸。该层似乎存在某种异常现象，如层级中出现巨大的雾块，且有时能听到船舶噪声。
//
//除了少数时候存在船舶噪声之外，整个主题公园极其空旷安静。未发现任何生命，并给人一种挥之不去的不详感。从满地的垃圾来看，该层似乎是废弃的。部分娱乐设施和景观已毁坏，无法正常使用和游览。一个女声在通讯器和扩音器上重复某些句子，如“公园已关闭。请改日再来。”“公园将进行数周的维护。如有任何物品丢失，请联系工作人员找回。”以及各种广告。
//
//公园区：
//你遇到的首个区域将是主题公园的公园外部区域。整个区域使用完全日照，有许多似乎是回环的人行道。在人行道上行进只会带你去向另一条人行道。可以找到许多建筑，如洗手间、长凳、灯柱、小吃摊和路标，这些是所有目前出现的已知建筑。其中的路标上描述了公园的其他某些区域，尽管它们经常导向死胡同或另一个标志，所有这些标志都处在公园的外部区域。该区未发现任何实体，而且保持着令人不安的寂静。在该区行进两到四日后，你将到达正常态的公园区。
//
//尽管正常态的公园区所有的人行道都通向正确的目的地，但这片区域看起来仍是废弃和破损的。很多景观已经毁坏，横陈在草地上，也有些还完好。这里似乎是整个层级的中央，其他区域只是因后室的影响而扩张产生，公园的中心是一座巨型圆顶建筑，内有水生生物，入口处竖有一个写着“水世界”的牌子，在旋转门洞的摊位上有个检票员，你需要一张门票才能入内。
//
//主楼：
//第二个区域是主楼内部。在该建筑里有美食广场和许多水族箱，内容都以不同种水生生物和一些未知物种为主。此处电力运作失常，但有未知动力在运作这些水族箱。经过研究表明这些水族箱中的水既是海水，也是杏仁水，根据其内生存的水生生物种类的不同，也有可能会是淡水。这些生物能在杏仁水中生存的原因不明，仿佛它就是正常水质一样。在主楼房间里有概率会出现一大群无面灵来参观海洋生物。这些无面灵似乎没有敌意，与其接触也会被忽视。流浪者离开房间后，它们就会消失。该区只发现了尸鼠和猎犬以及前文提到的无面灵。这些实体在这里非常罕见，你可能根本不会遭遇它们。
//
//主楼的其他部分也大都破损，且由于电力失常，尽管有些灯光仍在闪烁，但基本上处在黑暗中。你也许会在墙上发现有关某些品牌或公园本身的广告海报。美食广场的库存是空的，地板上凌乱地堆满了旧餐具和垃圾。少数情况下可以在墙壁上看到涂鸦。在该区行进三到五日，你可以通过一个标有“游客止步”的门洞，到达员工大厅。
//
//员工大厅：
//员工大厅由一系列砖石走廊构成，墙上有管道穿过，走廊里有橙色的昏暗灯光照明。整个大厅都可以听到震耳欲聋的机械噪音，可能是一台备用发电机的运作声，这个推测可以解释之前的疑问。目前关于该噪音的具体来源的相关研究将由M.E.G.的"Trial Testers"小组进行。大厅内还有些普通的清洁用具，如拖把和水桶。墙壁上的管道内含有和水族箱内同样成分的水。
//
//可遭遇的实体有笑魇，窃皮者，钝人，尸鼠和悲尸。这些实体在这里很少见，但有敌对行为，所以在这里活动需要携带一些装备。
//
//在大厅里，你可能会发现有类似办公室的房间，其中包括有办公桌和电脑等设备，大部分已经损坏。能够正常使用的电脑里都存有包括水产研究和商业交流的信息和数据。特别的是，这些电脑里都存有同一个视频文件。该文件的文件名是"New_Video.avi"，大多损坏。视频中的内容似乎是一个人在大厅里尖叫着奔跑，身后跟着水流。录像设备被淹没后，一个被称为“鱼”的实体游向设备，画面中断。
//
//该视频被禁止观看，你绝对不能点开这个视频。此举会导致水位上涨，淹没大厅和其中的流浪者，并将影响整个层级中的流浪者。尽管不会淹没整个层级并最终会消散，但期间任何与水互动的流浪者都会被送至该层的最终区域。
//
//水世界：
//一旦进入最终阶段，“鱼”会开始产卵，整个区域完全被水淹没。区域对人体产生的某种影响使流浪者可以在水中呼吸。该区域此时的结构是之前所有区域的混合构造体，以不可能的方式连接在一起。周围的物体或障碍物不再表现出固体的特性，你可以漂浮于其中，就像它们完全不存在一样。此时该区域极度危险，建议立即离开。
//
//所有的水生生物此时都得以从它们的水箱中解放出来，并在整个区域游曳。可在该区域产卵的个体有“鱼”、结壳者1和笑魇。许多正常的和有记载的水生捕食者也会展开攻击。这些生物同样可以游过墙壁，在任何时刻攻击。请不要进入该区域。以下所提到的所有出口在这个状态下都可以使用。
//
//基地，前哨和社区
//在第一和第二区域已经建立了小型前哨站，但第三区域没有，在第四区域也不可能建立。（有报告称在第四区域中看见了类似基地的设施，但并未证实）
//
//入口和出口：
//入口：
//要进入的话，如果你正好有一件与水有关的物品，并将其带到地铁，你就可以通过列车到达Level 43。你也有机会通过Level 11中的出租车车厢来进入Level 43。在Level 7深处，你可以找到一个水洞。这个洞穿过水面，就好像水是固体一样。进入这个洞后，流浪者会经过3分钟左右的坠落后昏迷，被传送到Level 43和许多其他层级。Level 54内的许多门中，有一扇也会通向Level 43。
//
//出口：
//要离开该层，你可以通过在第一区域的灌木丛中行进一两个小时，来进入Level 62和Level 9。某些废弃的设施和景点可通向Level 58。你也可以通过在第二区域行进数周来进入Level 72或Level 33。你可以通过电梯进入Level 65。游玩一个正常运作的街机机将使你进入Level 40。可在穿过员工大厅时进入Level 2或Level 4。在最终阶段找到一处开放地带，上面有一艘船，由此可进入Level 85。在最终阶段通过一扇舱门可以进入Level 34。像其他大多数层级一样，在该层切出会把你带到负数层级的起点。
//
//作者
//« Level 42 | Level 43 | Level 44 »
//
//Footnotes
//1. 该实体在Level 54被发现后开始在其他具有水环境的层级产卵。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl43{}