package lvls0;
//Level 44
// 
//
//生存难度：
//等级 3
//
//不安全
//稳定
//少量实体
//Level 44是后室的第45层，它是一个非线性的空间，理论上与前厅有着内在的联系。
//
//描述：
//Level 44像是一个荒凉且空无一物的零售商店，遍布着勉强工作的灯光。这些灯被认为是由电力驱动的，因为它们不会产生明显的荧光的嗡嗡声；然而，它们被报告称会发出轻微的电流声。
//
//通常，在暗处附近观察所发现的窗户被认为是安全的，没有报告指出在靠近它们的时候会受到影响。所有位于Level 44的活动窗口都显示着前厅的动态影像，不过，我们不确定它是否与现实有所联系。所有通过这个窗户进行语言或是非语言的交流都未曾成功过。
//
//tWJ38kYC4wmTrGu.jpg
//一个空房间的照片。
//
//这个层级被归类为非欧几里得空间，在那里寻找方向和返回是不现实的。在Level 44中，非线性所造成的影响已经被认为是，当你离起点越远，情况也会越来越糟。事实证明，在这个层级中找到方向是一件极其困难的事，因此Level 44的大小也是不确定的。然而，在理论上，人们普遍认为，通过这个层级的绝对边界就可以成功地到达一个超维空间。由于Level 44的窗口与现实有着某种潜在的联系，这个理论经常被认为是可信的，然而，它并没有被认可。大多数被认为成功地到达了很远距离的流浪者再也没有回来，大多数情况下都是因为他们缺乏韧性和未能找到返回的路。
//
//尽管层级本身空空如也，但在Level 44的许多房间中都发现了一种含有未知成分和来源的特殊液体。这种液体类似于一种煤状物质，有着不自然的粘度和酸度。这种酸能够快速地腐蚀硬纸板和木材，据报告称，它可以溶解Level 44的墙壁和天花板。目前已知，这种化合物能够随着时间的推移而生长，随着它变得越来越普遍，它将对流浪者构成潜在的威胁。
//
//该层级中，实体是不常见的，然而，经常可以从远处听到呜咽声和尖叫声，一般来源于天花板的上面。通常认为，大多数实体往往会出现在昏暗的地方。几乎所有类型的实体，包括牧马人，都可以在Level 44的黑暗处找到，但数量有限。如果发生致命的情况，建议遵守平常的安全方案。
//
//最近，有人在窗户的另一边（在这一层级里）看到一个不固定的剪影。报告称，它会产生一种阈限和焦虑之间叠加起来的感觉，通常会出现在忧虑（焦虑）的情况下出现。目前尚不清楚这个人影的真正目的是什么；相反地，因为人影飘忽不定的行为，它被认为象征着一个人在前厅中经历过的恐惧和担忧。
//
//陈列的雕像
//见到过这个人影的人都在报告中表示，它与自己目前在Level 44中遇到的困境有着轻微的联系，这意味着这个层级的后面还有可能存在着一个超维空间。报告称，通过与这个实体的接触表明，这个人影有能力与流浪者进行交流，不过有着一定的限制：据说它只能通过简短、含糊的重复用语来表达情感和含蓄的信息。所有这些引述都被一些目击者找到，并导致了关于Level 44可能发生了什么的不同理论：
//
//- 他正在破坏着我的家。
//- 他会为我们所有人带来厄运。
//- 只有当你逃脱时，你才能找得到他。
//- 现实将随着我的家一起破碎。
//- 这个地方已经不再安全。
//- 你必须在他掌控一切之前阻止他。
//- 我是来给你带来这个信息的。
//- 你是唯一能拯救我们的人。
//- qwdolaepetokgEpJ8d6KKZWLH6bR+tumPzrrGHLjEVA=
//
//这些句子的真实背景是不明确且模糊的，然而，它被认为显示了对于所有的现实和前厅潜在危险的信息。许多理论表明，Level 44与前厅密切相关；然而，目前还没有权威的答案公布。
//
//基地、前哨和社区：
//M.E.G."除酸者"前哨
//试图通过去除液体的方式来尽量减少侵蚀。
//减少实体以便更安全地进行探索。
//由20名队员组成。
//Level 44坍塌的可能性。
//进行这次主观访谈的目的，是确定由于腐蚀导致Level 44坍塌的潜在风险。采访者和被采访者（科学家）在给定时间内，讨论发生这种情况的风险。
//
//- 关闭记录
//“好的，我现在准备好了。”
//- 采访者
// 
//“好的，你是想让我谈谈崩溃发生的风险吗？”
//- 被采访者
// 
//“准确地说，是的。”
// 
//“好吧，要说的事情比你想象的要多得多。大量关于这种液体的信息还没有向媒体披露。”
// 
//“你知道他们为什么不透露其他的信息吗？”
// 
//“我不知道有什么原因，但我不明白他们为什么会隐藏它。”
// 
//“好吧，那么你能透露一点吗？”
// 
//“当然了，毕竟这本就该是公开的信息。我要透露一些他们错过了的最重要的部分。”
// 
//“我还记得我第一次拿到那种液体的样品的时候。它看起来就像煤粉和水的混合物。不幸的是，M.E.G没有大量的工具可供使用，所以我们只能大概地去测试它。”
// 
//“几天的测试过后，最后的结果是值得注意的。我们发现它的酸度非常高，比平常要高得多。由于某种不自然的原因，它能够更快地腐蚀木材，而需要更多的时间来腐蚀其他的物体。”
// 
//“然而，一旦我们让它长时间腐蚀其他材料，它就会开始腐蚀得越来越快。在某种程度上，它就像有知觉一样。知道如何从以前的情况中进化。更不用说它还会随着腐蚀而增长。”
// 
//“嗯，那一定是个坏消息。特别是考虑到这个层级的情况，如果这种液体继续腐蚀下去，而没有受到任何阻止的话，这个层级可以在几个月内被腐蚀殆尽。”
// 
//“嗯，至少有除酸者来帮助我们。但最让我困惑的是，这种液体似乎会释放出一种黑色的蒸汽。这种蒸汽似乎与失忆和幻觉有着很深的联系。我们有一些志愿者呼吸过这种空气，在经过一段时间后似乎出现了一些副作用。这和‘诱发恐惧’的情况十分相似。”
// 
//“那么，你的结论是什么呢？”
// 
//“在Level 44坍塌之前，我们可能已经没有多少时间了。我预测在几周后坍塌就会发生。除酸者目前正在努力赶上进度。”
//
//入口与出口
//入口：
//可以在Level 0里，通过打开一扇金属门找到Level 44的入口。就像在后室中常见的经历一样，这扇门经常在随意间被看到。
//
//出口:
//为了离开这个层级，流浪者必须回到他们出发的地方，或者是找到一扇和入口类似的门，这会使你来到Level 11或Level 9。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl44{}