package lvls0;
//Level 42
// 
//
//生存难度：
//等级 5E - 环境
//
//不安全
//不稳定
//没有来自实体的危害
//Level 42是后室的第43层。它是一片巨大的陆地，它以非欧几里德的形式延伸，并被茂密的森林和植被所覆盖，在这片陆地的中心有着一座火山。
//
//描述：
//volcano1
//艺术表现形式下的Level 42。
//
//该层级的绝大多数区域都是一片巨大的森林，树木覆盖着每一寸土地，直到地坪线的尽头1，这几乎阻挡了任何光线到达地面。然而，即使缺乏对植物生存至关重要的阳光，这些植物也能够生长并发挥任何功能，而没有受到明显的负面影响。
//
//茂密的森林植被，与被高度污染和密集的大气一起，阻止了任何光线到达绝大部分的地面2。
//
//对于大多数的探险小队来说，在这个层级中进行测量工作是一个挑战，主要是因为，这个层级的环境对于任何的流浪者和实体来说都是很危险的。大多数的影响和危险会在后文中进一步的列出；然而，如有必要，所有可用和详细的结果，包括所有有效的化学记录和其他基于勘探小组定期进入该层级3所做的报告，可以在附件中访问：level42_effects.zip(1,48MB) | level42_detailed_logs.zip(24,18MB)
//
//对于那些想要探索该层级的人来说，由于这里的地形崎岖不平，因此步行是穿越这里唯一的选择，即使那些平地被树木落下的无数叶子所覆盖，看起来十分地平坦。
//
//此外，在没有任何的人工照明，例如手电筒的帮助下，这里是很难看清东西的。不建议携带任何会产生明火的光源到这里，因为这里的空气受到了污染，它对于任何形式的火都会产生剧烈的反应。
//
//如果不论什么原因，出现了明火，那么起火点的周围就会被空气中的可燃物所形成的火球所吞没，并且距离火源5到10米（16到33英尺）之内的物体会被爆炸造成严重的损坏。
//
//爆炸发生在一瞬间，任何火焰都无法逃脱，并且会烧毁一些树木。然而，如果火焰以某种方式到达一棵树，并开始燃烧的时候，偶尔会下起一场大酸雨，去扑灭这些小火；这些酸雨不会与树木产生反应，而是会被剧毒的地面所吸收。
//
//forest1
//Level 42的地面，通过夜视摄像机拍摄。
//
//这种酸雨会频繁地出现，并且持续的时间也都会很长。在Level 42中，时间是非线性的，因此所有的时钟在被带进这个层级之后都会停止工作。
//
//这种酸性物质具有高度的腐蚀性，它会对接触它的所有流浪者和实体造成伤害。
//
//尽管树木覆盖了整个层级，但它们却没有坚固到能够用来躲避酸雨。小型的洞穴和坚固的保护层下面，例如悬崖的下面，是最推荐去等待酸雨结束的地方。
//
//在地面上，温度会比较低，会在0到8摄氏度（32到46华氏度）左右，流浪者如果没有干燥的衣物所保护，那么很容易就会出现体温过高的症状4。
//
//然而，当高度来到大气层时，温度也会来到很高的水平，原因是，大气中无时无刻都在进行着无数的化学反应，这些反应本身就足以加热森林之上的空气。
//
//与这些化学反应一同出现的，是在这片陆地正中间出现的一座火山，它也是大气层的温度如此温暖的原因，大概在56到67摄氏度（133到153华氏度）之间。
//
//火山：
//volcano2
//火山近景。
//
//Level 42中的火山是一个复式火山，它以陡峭的轮廓和复杂的硬化熔岩层而闻名。它很活跃，时常会有爆炸式的喷发和溢流式的喷发，其中爆炸式的更为常见。
//
//因为火山下面的岩浆房会不断地被重新填充，所以在这附近发生地震的频率很高，这使得火山能够保持长时间的活跃状态，有时可以持续数年。5
//
//由于火山在层级之中不断的活动，这里的空气不断地充满着有毒气体和火山灰，如果一个流浪者长时间暴露在它们之中，而没有任何的保护措施，例如口罩，是非常危险的。
//
//其他的威胁包括从火山口喷出的异常火山弹。它们本质上是一些巨大的岩石，会在火山最活跃的时候高速喷出，可能会落在距离火山口34公里（21英里）范围内的任何地方。6
//
//这些石头会从天空中落下，就像凭空出现的一样。它们能够破坏环境和在它们在途中遇到的所有东西，形成一个巨大的撞击坑，而这个撞击坑最终会因为有毒的地面所释放的化学物质而变成一个死亡区域。
//
//它们的异常特征来源于石头异常的尺寸，它们的尺寸要远大于前厅中的尺寸。 正因如此，火山弹对流浪者构成了严重的威胁，并且因为它们可以在没有预兆的情况下突然出现，所以流浪者很难避开它。
//
//火山周围的地区都由火山灰和火山岩所组成，其中充满了岩浆河，而这些岩浆河会一直延伸至森林当中。
//
//在这里，除了一些小型的哺乳动物外几乎没有活物，它们居住在凝固的岩浆形成的洞穴中，并且能够承受高温。由于火山在其附近造成了环境的危害，因此只有很少的动物会居住在靠近它的地方。
//
//建议流浪者避免穿越火山周围的地区，而是在森林当中选择更安全的线路，以免遇到其他来自环境的危险。
//
//其他相关影响：
//异常岩浆池
//有时候，流浪者会在火山的周围看到一排奇怪的岩浆池，通常有2到4个。如果凑近观察，这些岩浆池里会出现一片视野广阔的场景，似乎是Level 107的景色。
//
//这些池子也许可以用作两个层级之间的传送门，但目前尚不清楚出现这种现象的原因。
//
//请注意，并非所有的岩浆池都是异常的，分辨岩浆池是否异常的唯一方法是仔细观察，但这种行为是很危险的，因为这必须要深入到火山的周围，而这又会使人暴露在更高浓度的有毒气体和火山灰之中，还会很轻易地使人成为岩浆和火山碎片的受害者。
//
//酸雨
//Level 42会周期性地下雨，下的这些雨都是强酸雨，它可以穿过叶子，但不能穿过树木的木头部分到达地面。这使得它即使没有辐射性8，也十分的不安全且有毒。
//
//酸雨被普遍认为是火山活动的结果，它具有强腐蚀性，会对皮肤和组织产生损害，因此它是对流浪者的另一个重大威胁。
//
//此外，我们还知道，无论是在形状还是形态上，这些酸雨都不会以任何方式与树木发生反应。无论在什么气候和环境里，这些酸性物质通常都会粘在树上或是掉到地上。而有时，这些酸性的颗粒会卡在粗糙的树皮里，最终会导致它们与空气发生反应。
//
//这些酸性颗粒与空气的反应非常缓慢，并且这些反应大多数是在土壤中被观测到的，这种反应是很少见的。但是，当酸性颗粒粘在树上并与空气发生反应时，它们会形成一种白色的半液体物质，一段时间后会产生泡沫并释放出一种致命气体，杀死附近的所有树木和生物。
//
//这种被反应严重影响的生态系统所在的区域已被命名为死区，大多数这种区域将立即由研究团队通过放置标志的方式进行标记。但即便如此，流浪者也很容易因为错误或疏忽而误入其中。鉴于该地区腐烂的状态、树木表面几乎全黑的外观以及看似烧焦的草，死区很容易被分辨出来。
//
//树木
//所有位于Level 42的树木都是异常的，它们拥有着可以在极端天气下生存，以及免疫酸性物质的特性。
//
//这些树不需要任何的水和阳光来保持存活，对应的，它们依靠的是一种化学物质。这些物质来源于酸性物质与土壤发生的反应，这会缓慢地创造出一种特殊的物质，来向树木施肥。 这种物质到目前为止还没有正式名称，因为它们与平常的树汁相似，通常把它们称作“异常树汁”
//
//forest2
//时常燃烧。
//
//然而，化学反应确实会有所变化。由于任何中等大小的火焰都会立即与空气发生反应，所以如果土壤在反应过程中暴露在外，这些化学反应也会与空气发生反应。
//
//如果发生了这种情况，空气就会突然间发生剧烈的反应，随后会创造出一个巨大的火球，而这个火球将会在于空气中燃尽之前，点燃所有它能够点燃的东西。
//
//因为产生这些火焰的原因是在空气中进行的化学反应，因此它们的持续时间会比平常的火焰要更加地长。同时，土壤中存在着大量的酸性物质，这就为化学反应提供了大量的材料，加上反应本身的不稳定性，这就使得反应本身又会释放出大量的活性物质，使得它在空气中不断地燃烧。
//
//此外，这些火焰无法被酸雨扑灭，并且会在燃料耗尽之前持续很长的时间。幸运的是，因为这些火焰无法燃烧树木本身，只能点燃附着在树木上的活性材料，所以这些火焰无法进一步扩散。
//
//实体：
//从发现Level 42开始直到现在，这里就没有发现过任何的实体。
//
//人们普遍认为，因为这里的环境危险且充满毒性，并且它可以对实体和人类造成严重的健康伤害，因此曾经在这里居住的实体快速地灭绝了。
//
//流浪者只有在得到完善的保护后才能在这个层级之中存活。
//
//然而，人们看到过一些小型的动物在Level 42中四处游荡。其中，大多数的动物都是一些小鸟和昆虫，它们似乎能够在此生活，并维持着一个脆弱但正在运行的生态系统。
//
//为了保护当地的生态系统，流浪者被建议不要与那些动物接触。
//
//基地、前哨和社区：
//M.E.G. 42号基地
//由M.E.G研究团队创建的土地实验室。
//12名常驻特工，25名非常驻特工的家。
//如果可以的话会带领流浪者回到安全的环境。
//入口和出口：
//入口
//可以通过切出Level 41的方式来到Level 42。有时候，流浪者可以深入Level 10的边界，最终来到Level 42。
//
//出口
//目前只发现了一个可用的出口，然而，它的风险很大，且十分的危险，可能会导致流浪者的死亡。
//
//跳进前文所提到的异常岩浆池，是退出Level 42的唯一方法。流浪者必须时刻注意周围的岩浆河、坠落的火山残骸，以及其他火山附近的威胁。跳进岩浆池之后，流浪者会短暂地感觉到强烈的疼痛与灼烧感。流浪者最终会到达Level 93或者是[NULL].txt
//
//地坪线：
//多年来，流浪者们发现，在后室中，有着一些人类能够承受的最为离奇，无法想象的事件。
//
//地坪线，或者说是地平线，与其他的事件无异。但在Level 42当中，它是特殊的，它是这个层级变成非欧几里得空间的原因。
//
//流浪者从起始点向外走一定的距离之后，所有周围的景色又会变得和起点一样，就像回到了他们出发的地方。这就是流浪者碰到Level 42的边界之后会发生的事情，与异常的“地坪线”接触，被送回起始点。
//
//在传送回来之后，流浪者看起来会进入一种疯狂的状态，此时他们会做出一些不理智的行为。这其实是他们的真实想法，就像是喝醉了酒一样。
//
//然而，受到影响的流浪者看到的确实是现实，只是，站在他们面前的所有人都会在他们的意识中消失，于是他们就会去追寻远处的人，最终，当他们到达远处之后，也只能看着人影消失。
//
//几个小时后，效果会慢慢消失，流浪者会慢慢恢复理智，然后崩溃几个小时。
//
//发生这种事情的原因仍然是未知的，目前认为，由于被污染的区域远远地超出了边界的范围，这个边界起着限制和保护的作用，有时你可以用肉眼凝视地平线，那里仿佛有一些并非真实存在的身影在背景中移动，因此它叫做“地坪线”。
//
//sun1
//但谁知道地坪线的后面是什么呢…
//
//地平线的外面是一个人类无法理解的地方，它事实上不遵循任何的物理学或热力学定律。
//
//它是一个非常迷人的地方，充满了你从来没有见到过的，无法想象的事物，可以说是仙境，还能够作为后室的庞大与多变的代表。
//
//我只希望我能够探索更多的地方…
//
//
// 
// 
//
// 
//
// 
//
//也许有一天，我们都会理解这个地方的真正意义，也许有一天我们都会离开这里。我期望着。
//
//秘密很有可能就在我们眼前…
//
//也许一个领域就是一条回家的道路…
//
//sun2
//…家？
//
//我终于回家了...
//
//20天之后
//你躺在一片开阔地上，被高高的草包围着，凝视着夜空
//最终，在经过20天的行走和失眠之后，你得到了休息，你到达了你的目的地。
//在Level 42的边界后面，是无限的和平与安静。在这里，除了你自己，没有东西能够伤到你。
//但你怎么会伤害自己呢？你已经奋斗了许久，达成了最终的目标。
//在后室这种地方找到了真正的和平。
//
//尽管你不知道，你睡了一天还是两天。在这个疯狂的维度上很难计算时间。但我直到你很快就要醒来了。
//你醒来时，我就站在你面前。你的眼睛刚睁开的时候就注意到了我。
//
//我走向前去为你庆贺，你却站不起来了，只是看着我。
//你花了很长的时间去走到一个安全的地方，你的身体已经太虚弱了。
//
//但你确实走了这么远，你应该是有着这种天赋的吧。
//
//别担心，握着我的手。我保证在我的周围，你永远都是安全的。
//抛开所有的问题，它们不再会来打扰你了。
//你现在是安全的，流浪者。我向你保证。
//
//30天之后
//这里除了我们什么都没有。哦，还能有比这更好的事情吗？
//你和我，一起在这每天升起的美丽的太阳之下。
//我很高兴你终于来了，流浪者。我已经等了你很久。
//但是，请不要告诉任何人关于这个地方的事。我得保守这个秘密。否则，我很难去照顾所有人！哈哈，对吧？
//对不起，你问我地坪线到底是什么？嗯，你看，它其实不是…这就是所有我能说的了。
//不，它根本就不存在…这意味着任何试图穿越它的东西都会在现实中崩溃。
//但有些时候，你可以完全随机地通过某些步骤去完成它。
//但这就意味着你是被选中的人之一。
//
//40天之后
//哦…你想离开吗？
//但是，你为什么要这么做呢？我会在这里给你所需要的一切。
//求你了，我想要你留下来…
//我要你在这里，流浪者。
//
//你确定吗？
//
//好吧，如果你真的想要离开…
//
//哈…哈…哈哈哈…哈哈哈哈哈…啊…很抱歉。
//
//这个领域里除了回忆以外什么都没有…是扭曲的现实，是你无法控制的梦。
//在这里，你只不过是你自己头脑中一个空洞的、不存在的维度的表现。
//你将永远无法醒来，因为你已经崩溃了，超越了太多的现实的层次。
//
//实际上…我控制着它。
//我掌控着这里的一切…
//这里既不是你的梦…也不是我的。
//你现在只是地坪线的一部分。无论是在时间上还是在空间上，你都是一个失去了记忆和灵魂的人。
//
//哦…我？我只是你脑子里的一个想法。我实际上不存在，也永远不会回去了。
//而你…就是你自己。你可能永远不会死。你只会经历没有意义的东西。
//在纯粹的寂静中享受你的生活吧，流浪者。
//在纯粹的寂静中享受你的生活吧，流浪者。
//在纯粹的寂静中享受你的生活吧，流浪者。
//在纯粹的寂静中享受你的生活吧，流浪者。
//在纯粹的寂静中享受你的生活吧，流浪者。
//在纯粹的寂静中享受你的生活吧，流浪者。
//在纯粹的寂静中享受你的生活吧，流浪者。
//在纯粹的寂静中享受你的生活吧，流浪者。
//在纯粹的寂静中享受你的生活吧，流浪者。
//在纯粹的寂静中享受你的生活吧，流浪者。
//
//错误。这个领域已被破坏。边界内的现实已不复存在，且永远不可能再进入其中了。
// 
//
//脚注
//1. 读作“地平线”，一个不规律的，非欧几里德的地方，后文会详细解释。
//2. 和你在该层级的艺术表现中看到的一样
//3. 该小队已成长为42号基地
//4. 译注：原文如此
//5. 根据研究小组对于地质和大气数据的调查。到目前为止，这座火山正处于活跃状态，并持续喷发了大约5周。
//6. 有些石头确实如此，然而，有报告称有一些飞出了这个范围
//7. 流浪者可以到达Level 42的层级之一。
//8. 正如当地勘探团队所看到和测量的那样。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl42{}