package lvls0;
//Level 41
// 
//
//生存难度：
//等级 4
//
// 
// 
// 
//level-41-1-cc.jpg
//Level 11的下水管道楼梯处发现Level 41图片。目前尚未查明拍摄者
//
//level-41-2-cc.jpg
//在Level 33的地板上发现了一张Level 41的图片。目前尚未查明拍摄者
//
//Level 41是后室的第42层，它看起来像一个黑暗的污水处理系统。
//
//描述:
//Level 41是一个相当黑暗的层级，类似于一个污水处理系统，有不间断的、像鲸鸣的噪音。黑色的、类似两栖动物的人形实体潜伏在水中，不要靠得太近，你所处的位置决定了它们对你的敌意。
//
//这一层的大多数地方光线很差；因此，奉劝大家自带光源。据记录，灯光可能会一次关闭数小时，在这段时间内，也许会出现笑魇。
//
//独自离开时，房间会完全改变，所以离开后无法第二次进入同一房间。
//
//这一层也不存在两个看起来一样的房间。一旦离开，就不可能再进入相同的房间了。大多数房间都被淹没了，有些房间的水位记录高达腰部，使这一层更难探索。u/Memezer_Chanz声称可能有东西在监视你，但这还有待证实，因为偏执狂在后室中很常见。建议饮用杏仁水以避免此情况。
//
//本层级有两个场所，一个是蓝色场所，一个是红色场所，在红色场所，实体将会变得消极，但是还不建议靠近它们。
//
//在层级中的蓝色场所发现的实体将抱有敌意，并专注于给受害者带来最大的痛苦，而不是致命的攻击。
//
//这些场所被一个类似幼儿园的房间隔开，房间被称为 "安全屋"。这个房间有一些地方似乎允许切入/切出。众所周知，安全室中的海洋球池是很危险的，因为进入海洋球池后，落入更危险层级的几率很大。尽管如此，安全屋里没有任何敌对的实体。也有一些特殊的房间，有巨大的蓄水池。
//
//Level 41是由u/Patlichan发现的，并由他做了简单的记述，然而，由于他很快就离开了，所以并没有深入探索。
//
//基地，前哨和社区
//在这个层级中没有已知的基地或前哨。
//
//出入口
//入口
//本层有可能通过终点的出口进入。如果你在Level 11找到一个写着 "下水道"的牌子，你可以走楼梯进入level 41。
//
//出口
//u/Patlichan表示，他偶然离开了这个层级。
//
//一些旅行者也证实，他们偶然发现自己在其它楼层。u/Memezer_Chanz声称，离开这个层级可以通过到你所面对的相反方向来触发。理论上说，海洋球池中的切入/切出区可以成为另一种离开层级的方式，不过，不建议这样做，因为落入更危险层级的几率很高。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl41{}