package lvls0;
//Level 49
// 
//
//生存难度：
//等级 2
//
// 
// 
// 
//USHgh6Y.jpg
//两个未知阵营的蒙面士兵
//
//Level 49是后室的第 50 层。
//
//此层级是一个巨大且无尽的战区，类似于一战时代的战场。但这里没有战争。
//
//描述：
//离开战壕、或者在轰炸过程中被困在外面时，这个层级才是危险的。当你离开战壕时，你将被数以千计的子弹射中，直到与战场上成千上万的其他尸体无法区分。在这个层级你看不到荧光灯管，但仍能听到它发出微弱的嗡嗡声。
//
//在极少情况下，飞机可能会飞过上空。并在其中一个战壕上落下炸弹。
//如果您遇到这种情况，请记住“L·E·A·D”：
//
//L：找到避难所
//E：进入避难所
//A：确保避难所的门没有缝隙
//D：躲避轰炸地区并抱住你的头
//
//炸弹在下落途中有四分钟到几个小时不等。在这段时间里，控制自己的情绪是非常重要的。必须采取一切措施来保持冷静，以防发生“病异”。如果可能的话，睡眠是最好的做法，你的思维将停止活跃，压力也会进一步的被消除。其他选择包括锻炼，如果你很幸运有一副纸牌的话，你可以用它玩纸牌游戏。
//
//当在发生爆炸时你未能采取预防措施，“病异”开始出现。据报道，受到“病异”折磨的人与真正的“病异”具有相似的症状（无法闭合的眼睛，易怒等），但有一些差异。最大的区别是缓慢地转变为众多士兵中的一员。在 48 小时内，“病异”的受害者与其他士兵完全没有区别，并将继续以他们的方式行事。 “病异”可以通过杏仁水治愈，但转化一旦完成就不可逆转。
//
//基地、前哨和社区
//红军
//红军是留在“无人区”西侧的士兵。他们穿着红色衣服，通常携带恩菲尔德M1917步枪。他们还携带破片手榴弹和装满水的水壶。这些士兵通常对外人漠不关心，就好像他们不存在一样。如果他们被激怒会发动攻击，并伤害外人以使其丧失行动能力。
//
//蓝军
//蓝军是居住在“无人区”东侧的士兵。他们身穿蓝色衣服，通常携带德国1888式委员会步枪和伯莱塔M1915半自动手枪，还携带手榴弹和水壶。他们的水壶经常是空的或几乎是空的。他们往往体弱多病，会推开外人。如果他们被激怒会杀掉惹怒他们的人。
//
//入口和出口：
//入口
//此层级可通过 Level 35 上的军用悍马来进入。
//
//出口
//目前没有已知的方法可以离开此层级。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl49{}