package lvls0;
//Level 50
// 
//
//生存难度：
//等级 3
//
// 
// 
// 
//Level 50是后室的第51层。
//
//Level 50，如其名“边狱公路”，是一条看不见尽头的沙漠高速公路。由于极端的温度和游荡此处不知意图为何的人物，这里难以生存。
//
//描述：
//本层为一条看上去没有尽头的四车道沙漠高速公路，每个方向各有两条车道。其上停泊着无法计数的车辆，它们看上去都被“静滞”了。之所以这么说是因为这些车没有彼此碰撞，它们的状态看上去就像是宇宙刚刚为之时间静止了一般。不止于此，有些车还被发现停滞在了变道的中途。除此之外，这一层怪异地寂静。人们唯一能听到的只有自己的声音。这种寂静能轻易将人逼疯。去这一层强烈建议准备好杏仁水。
//
//车辆的车锁有时能够被解开，其内部可能装有普通人会在车里存放的任何东西。值得注意的是，所有车辆都有内华达州的车牌照，车牌号都为“I80L2WV”。为何会有此现象尚不明确。同样的，似乎没有任何车辆是2011年后的型号，而有些可追溯到1978年。由于Level 22和Level 35中发生的事件1，不建议进入以及停留在任何车辆内。唯一一种已知能够安全暂住的车辆是房车，例如RV。这是一名探索者因为极度疲惫而在一辆房车中休息后发现的。他据记录睡了六个小时且在此后状态良好。
//
//本层真正的危险之处在于高速路上游荡的人。已经目击到了数位游荡的人类，但只与其中一位发生了遭遇。在唯一的报告中，与此人遭遇导致了探索者的失联。关于那次互动的记录可以在此阅读。因此，建议不惜一切代价避开他们。同时，这些人类是实体还是聚集在一起的一群人也是不明确的。
//
//本层的大部分地方仍未被涉足。一些无法解释的事件已被记录，如下所示。一位在RV内睡觉的探索者在醒来时发现车辆四面八方传来了沉重的撞击声。在查看状况时，没有看到任何人或实体，但噪音继续持续了一小时才停止。第二天，该探索者还报告说微微听到了各种高速公路上的噪声。汽车声、卡车声等等。最后的报告中，深入大约五英里后，探索者发现了一条高速公路出口，205号出口，其看上去延伸了数英里。他没有冒险进入其中，因此尚不明确其尽头有着什么，如果其能够到达尽头的话。
//
//基地，前哨和社区
//本层没有已知的基地、前哨与社区。
//
//入口和出口：
//入口
//本层可通过在Level 35中找到一辆RV并进入其中来进入。在你离开RV的同时，你会突然来到Level 50。你也可以在Level 176中的卡车里坐过长的时间，你最终会来到Level 50。
//
//出口
//当前没有已知的出口。记录本层的孤身探索者并没有在他失踪前发现出口。
//
//由Joey Springer撰写
//« Level 49 | Level 50 | Level 51 »
//
//Footnotes
//1. 上述层级中的这种车辆都不能安全暂住。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl50{}