package lvls0;
//Level 55
// 
//
//生存难度：
//等级 2
//
// 
// 
// 
//6olxE25JXIr9KNH.jpg
//一张红色冰柜的照片，由属于Frigate 探险小队的M.E.G特工Jesse Callaghan，在探索的第三天所拍摄。
//
//Level 55是后室的第56层，它在2021年5月3日被发现。
//
//描述：
//Level 55是一个未知大小的超市，里面充满了两边都是冷柜的过道。每一条过道都正好有55英尺长。这些过道模仿了前厅中许多超市的设计和风格。这些超市包括但不限于：7-11、Costco、Farmfoods、Iceland、K-Mart、Kroger、Morrisons、Target、Tesco、Walmart和Woolworths。
//
//Level 55中的所有过道都会与超市每十年的状态相匹配，每五个过道就会有所改变，这些变化都是连续的，不会缺失任意一个十年。这意味着，代表1960年代的过道一定会与代表1950或1970年代的过道衔接。在这个层级里，大部分地方是没有WiFi信号的，但在2000年代、2010年代和2020年代的区域附近，你可以收到名为FiftyFiver'sFifthFamiliarFreezer的WiFi信号，它的密码为“55555”。
//
//在Level 55的过道中移动是一项相当艰巨的任务，因为它是一个极端的非欧几里得的空间，它只会给你一条回到起点的路：你会到达你之前所在的地方。这使得Level 55缺少方向感和定位感，所有的标记似乎都会消失。偶尔，你会穿过看上去是一堵墙的地方。而在这后面会有一扇对开门，上面会写着“员工专用”，它通往Level 55.1。
//
//Level 55对于在冷柜中的货物有着奇怪的影响，无论在冷柜中存放多久，那些物品都会保持原样，不会腐烂或降解，这也意味着它们不会被冻坏。探险者总署建议不要在没有阅读5502号研究报告之前食用在Level 55中找到的食物，因为它们会对食用者的身心造成独特的影响。
//
//实体：
//尽管那些常见的实体在Level 55中十分稀有，但你偶尔也能在这里发现Ihjryvvtz Men、尸鼠和无面灵。
//
//Level 55有四种其他地方未曾找到的实体，具体内容如下：
//
//红色冰柜是一个完全红色的冰柜。它的外表是红色的，里面的灯光是红色的，里面的食物也被装在红色的盒子里。只要你不打开它、触摸它或者是在它的附近发出尖锐的噪声，那么这个实体就是无害的。如果你做了以上的事情，那么它就会使用一连串的电源线，试图把打扰它的人拖进自己的里面，然后将其传送到Level 666。在做这些事情的同时，它还会以大约45英里每小时的速度，向四周发射红色的液体小球，这些液体可以溶解有机物。这些冰柜似乎是随机移动的，但在你的视线之中时，它们不会移动。这个实体使得在Level 55中开枪变成了一件很危险的事。
//
//金色冰柜是一个整体呈现金色的冰柜。不同于红色冰柜，金色冰柜由纯金制成，而不只是一层颜色。目前已知，金色冰柜会微微地发光，而且会散发出使人平静的光环。这个光环会影响幸存者、无面灵和Ihjryvvtz Men，但唯独不会影响红人。红人与金色冰柜之间的实际关系是未知的，许多说法都表示，当红人进入光环之后，他们会立刻退开，会变得更加激动，会直接死去，会往你的后方跑去或者是会开始毁坏附近的冰柜。打开金色冰柜后，冰柜里会随机地出现五种可能的物品之一，物品信息详见研究报告5501.
//
//红人是Level 55中随处可见的一类实体。红人是由一种未知的液体所组成的，这种液体会被冻结而作为其身体的一部分。红人会用他们的韧性和蛮力，把他们发现的任何一个无面灵或幸存者拖到红色冰柜之中。
//
//导航犬是在Level 55和Level 55.1的金色冰柜周围的实体，如果你不给它们东西，它们只会是所属的金色冰柜的守卫。如果你给它们一瓶杏仁水（或者是一瓶普通的水），只要在你的方圆三英里范围内有着Level 55和Level 55.1之间的门，它们就会带领你到达离你最近的那一个。如果你把一些对于你有着特殊意义的物品给它们，比如说你在前厅中的配偶的照片，它们就会带领你到达从Level 55通往Level 11的出口。然而，少数时候（小于二十分之一的可能性），它们会带领你遭到伏击。目前还不清楚这种情况发生的原因，据报告称伏击是由红人所造成的。
//
//基地、前哨和社区
//M.E.G.北极锚仓储前哨
//这是一个由探险者总署运营，位于入口附近的小型前哨站，用于储存任何需要冷藏或容易变质的的物资。这个基地的团队由三名成员组成：Jesse Callaghan、Craig Edwards和Ruby Louis。当你从Level 11到达Level 55时，往左看就可以很容易地找到这个基地。这个社区随时开放对于有限的补给和库存的交易，此外，他们已经被告知尽可能地去帮助幸存者，有必要的话，他们会带领幸存者去到贝塔基地。
//
//研究报告5501“金色冰柜的内容物”：
//关闭报告5501
//金色冰柜里面会有五种不同的物品，其中的每一种物品都能够以多种方式帮助到幸存者。Vanguard、Frigate和Omicron三个小型探险队在204天的搜索活动中，发现了61个金色冰柜，相当于每3.34天的全力探索才能碰到一个金色冰柜。
//
//在打开的61个金色冰柜当中，发现了以下物品：
//- 一瓶（证实安全）杏仁水，17次。
//- 完全可用的，充满电的iPhone4手机，16次。
//- 枢纽的进入点，12次。
//- 一个小型武器，大多数时候是一把刀，但有两次是一把手枪（型号未知），附带有两个弹匣，8次。
//- 一个导航犬实体，8次。
//
//在金色冰柜里发现的杏仁水已经经历了17次测试，Vanguard、Frigate和Omicron三支探险小队都确认了它的安全性，在所有的测试中，它都没有对探险队员造成负面影响。Frigate探险队的Hue Thomas描述道“它尝起来比普通的杏仁水更甜一些——我们在喝完之后走的还更快了”。尽管未被证实，但这表明了在金色冰柜中发现的杏仁水对喝它的人有着未知的积极影响。这需要进一步的研究。
//
//在金色冰柜中发现的iPhone4似乎有着特殊的续航时间，例如，Omicron探险小队发现的一台手机，在探险过程中经过了四天的重度使用后，只消耗了原本电量的41%。不幸的是，这些手机在Level 55之外可能不是特别地有用，因为在其他地方，与其他设备相比，它们接受WiFi信号的能力似乎非常弱。我们不确定是在金色冰柜中发现的手机都是如此，还是iPhone4本身的寿命问题。
//
//如果一个金色冰柜有着通往枢纽的进入点，那么其冰柜本身就会发出炫目的光，这就表示，如果你进入了这个冰箱，你就会被传送到枢纽。大约每探索十七天，才能找到一个进入点。
//
//在金色冰柜中找到的武器都是可用的，且都状态良好。在金色冰柜中发现的刀类武器都非常地锋利且耐用，在Level 55的内外都能使用。尽管手枪在金色冰柜中被找到的机会并不大，但它也是完全可用的，且自带弹药（迄今为止唯一有记录的口径是9×19m手枪弹），然而它不应在Level 55中使用，因为它有可能触发红色冰柜的攻击。
//
//导航犬实体已在Level 55的页面中描述过了，因此不再复述。
//
//研究报告5502 “55层食物研究”：
//关闭报告5502
//在少量食用，或是在一周内每天食用不超过2000卡路里的情况下，食用Level 55的冰柜里的食物并不危险。也就是说，如果吃了太多Level 55里的食物，你就会开始受到一些不良的影响。最初的影响基本上是无害的，包括你非常熟悉的事物（如家人、朋友、宠物等）的视听幻觉，但不会直接改变你对周围环境的感知。在紧急情况下，这些影响是相对安全的，因为它们没有显示出任何直接伤害你或让你受到伤害的能力。
//
//第二组由Level 55的食物造成的影响要更加的危险，它造成的幻觉会让你有所感知，其中会包括一些你并不了解的东西，一般是历史人物，或者是一些你知道，但并不了解的人。在这种情况下你还会开始经历一些关于怪物的幻觉，感到自己的身体有着不存在的部位，甚至是伤口。尽管这些幻想出来的怪物无法伤害到你，但那些有着真实感觉的幻觉所带来的伤口（被认为会带来极度的疼痛）和不存在的身体部位（第三条手臂、第二个脑袋和尾巴等等）会带来数不清的问题。
//
//在这个阶段之后，则会开始产生最危险的影响，而你的生命也将随之走向终结。我们的研究显示，在第三阶段中，你的身体会逐渐地被冻结，并开始融化成为一种未知成分的红色液体，随后这些液体又会凝固，去“取代”原来被融化掉的身体的部分。因为在这一过程中，一些重要的血管可能会被切断，所以它可能会导致坏死，甚至会生出坏疽。实验对象在采访中表示，他们并不觉得这个阶段比第二阶段更加危险，这表明此时的幻觉会让你认为那些伤口并不存在。
//
//目前我们对于第四阶段的了解并不多，在此阶段里，实验对象开始展露出敌意。值得注意的是，至少在这个阶段的一部分时间里，受试者还保留着一些使用武器的能力，这说明此时他们还保留着一定程度的智力，但到了阶段的后期，这些智力就消失了。在阶段的最后，实验对象会转化为一个红人。
//
//经过仔细研究，Level 55的食品中含有两种尚未完全测试的化合物。第一种化合物会对生物有机体产生一系列未知的影响，并且高度易燃。需要对其进行进一步测试，以找到它的全部效果和能力。第二种化合物被称为“Fiver的味道”，它对生物有机体有未知的长期影响，但它已被证明会起两种作用。它首先被证明可以将任何食物的味道强度提高大约十倍。第二个已知的效果是，当它被用于开放性伤口时，有着极强的凝血效果。由于其性质未知，在紧急情况以外的时候食用它，或者是把它用于医疗，仍然是不安全的。稍后将对它们进行进一步测试，以确定这两种化合物的所有功能。
//
//一个已经冷冻成红人的M.E.G.特工的笔记
//隐藏笔记
//第217篇日记。日期 2021年1月2日
//在冰冻之地的第97天。
//在昨晚写完日记之后，我遇到一群幸存者。
//他们在营地为我提供了一个落脚点。
//我接受了，我怎么能够拒绝呢。
//这让我远离了那些怪物和怪人。
//让我有了空闲，去想他妈的林肯为什么让我交那么多的税。
//我的伤口开始痊愈了，尤其是在我胸口上的那个。
//它还是很疼，但至少它正在变好。
//我会在这里呆着，直到伤口完全痊愈，然后继续寻找出口。
//笔记结束
//
//Lily Vaughn最后的留言的文字记录。
//隐藏记录
//如果有人收到这条信息，请把它送给位于 Level 55的M.E.G营地。
//我的名字是Lily Vaughn，是Vanguard探险小队的一员。
//Vanguard小队除了我以外全军覆没，而我也快要死了。
//那些导航犬，它们会把你带到…[一声响亮，似乎充满着痰的咳嗽]
//遭到伏击。[另一声剧烈的咳嗽]
//它把我们带到了一群红人的中间，它们一共有七个。它们杀光了我的队友。
//最有效的武器是钝器和热武器。
//穿刺、切割和刺伤攻击几乎是无效的，对于——
//记录在此中断。
//
//入口与出口：
//入口：
//在Level 11进入一个标牌写着：“Frivolous Frank的美味冰冻食品”的超市。
//在Level 5或者Level 20爬进一个发着蓝光的白色冰柜。
//出口
//走出超市正门就能回到Level 11。
//爬进一个红色冰柜能够到达Level 666。
//爬进一个金色冰柜能够到达枢纽。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl55{}