package lvls0;
//Level 59
// 
//
//生存难度：
//等级 4
//
// 
// 
// 
//Subway.jpg
//一张Level 59的照片，由“先驱”的其中一名成员拍摄。
//
//Level 59是后室的第60层，此层级由“先驱”首次发现，该小型团体由一群致力于探索的流浪者组成。 然而，直到有四名受重伤的“先驱”成员抵达一处M.E.G.前哨时，M.E.G.才注意到这一发现。根据四名幸存者的证词，推测队伍中的其他成员已经遇难。迫于该层级迷宫一般的混乱布局和危险的实体，流浪者应尽一切可能避开Level 59。
//
//描述：
//Level 59表现为一座无垠的地下铁路系统。该层级由两种不同的区域组成，它们分别被称为“站台”和“隧道”。站台和隧道互相连接，因此，流浪者往往需要在穿越该层级时多次经过这两个部分。由于Level 59内不存在任何物资，身处此层级的流浪者必须依赖自行携带的物资存活。
//
//车站
//Subway_tunnel.jpg
//站台——车站与隧道的交汇处。
//
//车站呈现寻常的地铁站样貌。它们具有不同样式，对应着前厅中不同的地下铁路系统。数条轨道往往连接到同一车站，因而得以在不同轨道之间进行切换。在罕见情况下，两个车站会通过细长的圆形通道相互连接。这些通道十分危险，因为你将在其中遭遇大量出没于车站的实体。
//
//车站中存在气流。虽然气流的具体来源不得而知，但其在此处非常普遍，且可以达到高速并构成威胁。据报告称，这些气流与隧道中列车行驶时所发出的噪声有关。然而，由于隧道中并不存在列车，这些噪音的来源同样尚不明确。一般认为这两种现象的发生存在某种联系的。
//
//每个独立的车站都表现出地铁站典型的内部结构，包含走廊、楼梯和站台等区域。少数情况下，这些楼梯将显得异常地冗长，且通常会达到数千级台阶。然而，它们均会戛然而止并直接通往一堵墙。 车站四周的墙壁贴有大量广告海报。这些海报上可以被解读的文字极少，通常都是难以辨认的符号；尽管如此，它们的图案设计却符合一般广告的风格。
//
//车站中存在大量实体。目前为止，已经记录在册的实体包括猎犬、尸鼠、咔嗒机和无面灵。在此区域中，能够观察到倚坐或平躺在长凳上的成年无面灵。尽管如此，幼年无面灵的分布则更为广泛。幼年无面灵总是无所事地地徘徊着，但在发现流浪者时，它们仍会表现出敌对行为。这些实体共同构成了车站最主要的威胁。然而，隧道中的实体显得更具有敌意。不幸的是，意图逃离本层级的流浪者必须穿过数个不同的车站，因而其必须在隧道中进行短程通行。
//
//隧道
//隧道是构成Level 59的另一部分，隧道可以从该层级的任何列车站台进入。此处的几乎所有的隧道都被黑暗所笼罩；一些隧道的照明仅仅来自于墙上零星的小型灯具，而另一些隧道则完全不为光线所及。每条隧道都至少包含一条轨道，这可能产生绊倒的隐患。永无止境的腐朽金属的气味无处不在，它们来源于被氧化的轨道。这种气味偶尔会伴随着列车行驶的声音一同出现，即使此层级中并没有真正意义上的列车的存在。
//
//此区域充斥着大量实体，包括窃皮者、笑魇、猎犬和爬菌。笑魇在此处很常见，它们经常潜伏在黑暗之中。由于轨道具有绊倒的隐患，现已证实与猎犬相遇是十分危险的。通常，如果一个人在隧道中遇到另一个外表与人类相似的生物，盲目信任它们是不明智的选择，它们可能是披着受害者皮囊的窃皮者，也可能是感染初期的爬菌感染体。
//
//Montague_Tube_Fix%26Fortify_Repair_Work_%2814995799149%29.jpg
//一张“隧道”的照片。数盏沿墙壁装设的灯照亮了这条隧道。
//
//地图
//大部分成功逃离Level 59的流浪者声称借助了一种被称为“地图”的物品。据称，其外形类似于大型挂壁式地铁线路图，可以用于导航至层级的出口。 地图的确切性质尚未彻底得到解明，因为通过访谈获得的信息之间自相矛盾。虽然所谓的“地图”照片只是一面空白的墙壁，但拍摄者声称能以某种方式观察到照片中地图的存在。
//
//收起日志
//59-访谈-4-记录.txt
//59-访谈-15-记录.txt
//受访者： Charles Hughes
//采访者： Michael W█████████
//
//采访者：Charles，你好。我们希望针对您在Level 59的经历提一些问题。这不会占用很多时间的。
//
//Charles Hughes：我知道了……所以，关于那个死地方，你们想知道什么？
//
//采访者： 首先，我们想知道你是怎么到达那里的？
//
//Charles Hughes： 我曾是先驱团队的一员——至少我是这么称呼它的。在探索那座城市的地铁系统的时候，我们注意到周遭的环境发生了很大的变化。这时，我们才意识到自己正处于另一个截然不同的层级。一定是事情发生得太缓慢了，以至于我们没有注意到它的发生。
//
//采访者： 在这个层级中，你们干了什么？
//
//Charles Hughes： 事实上，我们什么都没做。我们只是到处游荡，有时还要逃离那些实体的追逐。
//
//采访者： 那么……你提到的那些悲剧——也就是你的同伴的丧命—— 全都是发生在那些追杀途中吗？
//
//Charles Hughes： 在被追杀的过程中，我们确实失去了很多的同伴。我所有的朋友们，都牺牲了。现在我不想再说起这件事了……
//
//采访者： 我明白了……我很遗憾听到这些。
//
//Charles Hughes： 没事，距离这件事的发生已经过去几周时间了。 我会控制自己的情绪的。
//
//采访者： 我也感同身受，在这儿的每个人有着不幸的遭遇。你知道的，如果你愿意，我们也可以谈点儿别的事情。
//
//Charles Hughes： 可以，那应该会让人好受些。我想，不如谈谈那个层级的相关信息？
//
//采访者： 好主意。能讲讲你是怎样寻到出路的吗？
//
//Charles Hughes： 好啊，就从它说起。事实上，我们借助了那些地图才逃出来的。
//
//采访者： 它们已经多次出现在以往的访谈中了。我们想知道，“地图”究竟是什么？其他人给出的解释——你也看到了，普遍有失准确。
//
//Charles Hughes： 说实话，除非亲身使用过“地图”，否则你往往是难以描述它的。起初，我们确实迷失了方向，逃脱的希望似乎已然渺茫了。我们唯一要做的便是紧跟彼此。
//
//采访者： 所以，你们起初并没有地图？
//
//Charles Hughes：没错。但是，当我们穿过隧道，经过层出不穷的车站后，我们积累了更多的生存经验——威胁一般都潜伏在拐角处，这样它们就可以被轻易地避开。我们常常互相交流这些经验。
//
//采访者： 所以说，你们有办法应对这些混乱的情况？这么说，看来这个这个层级不可能如同我们想象中那样随机。
//
//Charles Hughes： 它绝对不是随机的，在这其中一定有规律可循，只是······实在难以描述。
//
//采访者： 好的。所以，让我们谈回地图——你们是怎样找到它的？
//
//Charles Hughes： 在Level 59，我们从未停止自己的脚步。我们一直在探索和转移，以确保我们不会被实体赶上，同时尝试着找到出口。然而，我们是直到放弃思考后才发现了地图。它就在那里，在我们身旁的墙上。当我们思考下一步的计策时，我们才开始注意到越来越多的细节。最终，我们在地图上看到了一条清晰的路线。
//
//采访者： 这些是非常具有价值的信息。那么，我还想问你一些事情。那些地图……嗯，它们是真实存在的吗？
//
//Charles Hughes：千真万确。我们每一个人都看到了地图，以及一条前往出口的路线。但，那些地图与这里绝大部分的东西都确有不同。
//
//采访者：我想我现在更能理解你的意思了。差不多了，此次采访带给了我不少值得思考的问题。现在，您可以自行离开了。
//
//Charles Hughes： 好的，和您的谈话很愉快。
//
//采访者： 我也一样。
//
//
//受访者： Mikael Andersson
//采访者： Michael W█████████
//注： 此为对于Mikael Andersson的第四次采访。他于两个月前孤身一人来到了该层级，并被困在此处约一周。
//
//采访者： 你好， Mikael。我们希望可以再次向您提出一些有关Level 59的问题。
//
//Mikael Andersson：好吧，这次是要问些什么？
//
//采访者：是关于气流——您是否有更多可以透露的信息。
//
//Mikael Andersson：我明白了。气流在车站中相当寻常，而在隧道中，我几乎从未感受到它的存在。事实上，我曾经试图找出气流的来源，但那不过是徒劳罢了。
//
//采访者：为什么呢？
//
//Mikael Andersson：气流的来源绝对不止一个。我认为这些气流是从外部吹进来的，这样也许我就可以以此找到出口的位置。可是，事实证明，气流来源的位置似乎相当飘忽不定。
//
//采访者：啊？这真是匪夷所思。你为什么这么确定呢？
//
//Mikael Andersson：我当时正站在一面严密无缝的实心的墙壁边，却仍有气流从墙壁的方向传来。总而言之，这一切非常怪异。迄今为止，我唯一所掌握的规律就是——气流好像和列车行驶的声音有关。
//
//采访者：但那个层级中并没有什么列车，对吧？
//
//Mikael Andersson：的确如此。然而，这些响动出现得非常频繁。我在隧道中总是不断地听到这种声音。
//
//采访者：那就奇怪了，这看起来就像此层级所存在的某种超自然现象一般。换句话说，你当时实际找得到声音的源头吗？
//
//Mikael Andersson： 我最终没有成功。这并非是我没有尝试过，其实，我消耗了大量的时间去顺着噪声寻找源头。
//
//采访者： 那些声音导向何处？
//
//Mikael Andersson：哪里都不是。在长途跋涉经过了无穷无尽的车站与隧道后，我依然什么都没有找到——现在，那段记忆在我的脑海中似乎已然混杂不清。最终，直到我意识到自己离那些响声已经前所未有地靠近，我不得不停下来。
//
//采访者：你有觉得你接近过声源吗？
//
//Mikael Andersson：从始至终，不过，我只有一次真正切身接近了它。
//
//采访者：那是什么时候的事？
//
//Mikael Andersson：当时，我最终放弃了搜寻噪音来源的念头。在行途中，我曾观察到一些看着相当复杂的东西，它们似乎呈现出了层级的结构。 直到我放缓脚步、调动起我所有的生存经验，思考接下来何去何从时，我才注意到一张地图出现在我的身边。它让我获得了两条线索——分别是通向“出口”和“噪音源头”的路线。
//
//采访者：你怎么确定那里是噪音的源头？
//
//Mikael Andersson：我……我不知道，只是当时的我有种不明所以然的直觉。与此同时，我的直觉告诉我：要是我选择向着“噪音源头”走去，我可能就再也不回来了。
//
//采访者：我理解。后室——有时就是会予人以一种奇妙的第六感。
//
//Mikael Andersson：说得没错。
//
//采访者：顺带一提——从出口逃离后，你最终抵达了哪里？
//
//Mikael Andersson：Level 72。跟这个层级很像，你懂的。
//
//采访者：目前所有人的报告都是到这儿就结束了。好吧，我觉得这次访谈差不多结束了。
//
//Mikael Andersson：也是。你还有什么其他的问题吗，还是说我可以走了？
//
//采访者：没什么了，你走吧。这次采访我真的没打算再问别的了。
//
//Mikael Andersson：嗯，再见。
//
//采访者：再见。
//
//
//基地、前哨与社区：
//Level 59没有已知的基地、前哨与社区。迫于本层级的实体数量，基地在此处难以建立。 除此之外，由于物资匮乏，也缺少在此建立前哨的动机。
//
//入口与出口：
//入口
//Level 59与Level 11和Level 72的地下铁路系统相连，大部分流浪者都是从Level 11来到这里的。据称，一旦Level 158中白羊座地铁站内的列车已经出发，则其地铁隧道就会通向“隧道”。有流浪者声称曾从地铁进入本层，这些传言的真实性仍有待证实。此外，已知切入Level 77的地面可以让流浪者来到本层级。
//
//出口
//在罕见情况下，“隧道”区域中的某条隧道可以通往Level 72。此外，现已证实Level 59同样存在一条通往Level 158中白羊座地铁站的隧道。多数找到出口的流浪者均使用过地图。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl59{}