package lvls0;
//Level 54
// 
//
//生存难度：
//等级 2
//
// 
// 
// 
//Level-54.jpg
//一张Level 54的图片。
//
//Level 54是后室的第55层，由无限的楼梯组成，楼梯呈螺旋状一直延伸了好几英里。
//
//描述：
//Level 54是一间以螺旋状排列的楼梯间，楼梯有很多层，被假设为无限深。楼梯间的墙壁是蓝色的，非常陈旧且容易剥落，有一些部分还覆盖了霉菌。低温使得整个楼梯间都很潮湿，也有可能是从墙壁和天花板滴落的水增加了潮湿度。这个层级的空气中弥漫着一股腐木和灰尘的味道，地板上好像也有厚厚的灰尘。楼梯是木制的，已经腐烂了。吱吱作响的金属地基将整个楼梯间支撑着。在楼梯上可以找到一个蓝色的浮动球体，这个球体会发出海洋的声音，还会冒出火花和水滴。在楼梯间附近有一个奇怪的物体，看起来像是撞毁在墙上的火车，进入这列火车会被传送到Level 61。
//
//Level 54的两侧都有门，可以通往其他层级、走廊或者是楼梯间的其他区域。走廊和楼梯间似乎是在同一栋建筑内，两边也有门，在走廊尽头的一扇门通向楼梯间。走廊的墙壁还是蓝色的，地板也还是木板的。这里依旧很潮湿，并且有一股霉味。
//
//走廊里的房间大多都是空的。一般情况下房间里会到处都是木椅，或者到处都是腐烂的木桌。有些房间可能会有窗户，虽然有时候可能会是窗户，但是大部分都是安全的，并且可以看到外面有深蓝色的海洋，房间会因为海洋而散发出蓝色的光。有很少的房间会被水填满，但是水并不会流出来。在房间里，即使周围有人，你也会感到孤独。有时候会有老旧的船的声音或者轻微的耳语，这些声音的来源未知。
//
//Level 54的实体很少。也很难找到。你有可能会发现笑魇、猎犬和窃皮者，但是这些实体在这个层级很少见。有一个还算常见的实体是迷彩爬行者。这里也有两个特殊实体，第一个被称为“天鱼”，似乎是一个大型鲑鱼状生物，可以在空中漂浮。第二个被称为“结壳者”，是一个大型蟹类人形生物，它和迷彩爬行者相遇时总是会攻击对方。与迷彩爬行者类似的是，“结壳者”也会出现在其他有水区域的层级上。
//
//入口与出口：
//入口：
//要进入这个层级，你要在Level 42找到并进入楼梯入口，或者在Level 17找到一个和这里的走廊相似的地方。
//
//出口：
//要离开这个层级，需要进入可通往Level 1、Level 4、Level 5、Level 9、Level 17、Level 21、Level 34、Level 43和Level 53的未上锁的门之一。也可以通过触摸地板上的布满灰尘的商店标志来进入Level 33，还可以通过进入被撞毁的火车来进入Level 61。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl54{}