package lvls0;
//Level 5
// 
//
//生存难度：
//等级 2
//不安全
//稳定 
//少量实体 
// 
//Level-5-1-cc.png
//Level 5主厅的一张照片。
//
//Level-5-2-cc.jpg
//锅炉房的一张照片.
//
//Level-5-3-cc.jpg
//锅炉房的其他照片.
//
//Level 5是后室的第六层。本层级似乎是一座无尽的酒店。
//
//描述:
//Level 5是一个近乎无限的酒店综合楼，有着非常多的房间和大厅。本层会给人一种它是在二十世纪三十年代建造的感觉，层内的家具甚至可以追溯到1920年。Level 5有三个可以完全进入的主要区域1。
//
//Level 5到处都充斥着二十世纪早期的装修和家具，主厅（The Main Hall）是Level 5中最受欢迎的区域。本层有着相当干净的环境，你在酒店的表面上基本看不到任何的灰尘和污渍。事实上，本层似乎拥有自我清洁的能力，因为任何不干净的污渍都会在几分钟后消失不见。相比于其他层级，Level 5里老式风格的地板和被精心照料的环境都会让人感到极度不自然。在本层，老式唱片机一直在播放着优雅的爵士乐，古典风的扬声器组成的音响系统在本层随处可见。音乐的选择和切换似乎是完全随机的，至于这一行为是如何完成的还尚属未知。
//
//Level 5是一个相当神秘的地方，同时，本层级也因能听到奇怪的声音而变得臭名昭著，比如来自墙另外一边的聚会闲聊声。也有人报告说有一种看不见的东西一直在角落里监视着他们。在本层也有一些报告提到有人能在自己背后听到漫无条理的耳语声，而当他们独自一人时，他们会时不时感到有什么东西在拍打他们的肩膀，有时甚至还能感觉到墙上那些老画像的眼睛在一直看着他们。Level 5里有三个主要区域：
//
//酒店主厅（The Main Hall）：
//这里是Level 5的主要区域，也是最容易被发现的区域。主厅的墙上贴满了华丽的红木色和金色墙纸。有些漫游者曾报告他们在墙纸上看到了人脸，并且那些人脸还会直勾勾地盯着他们看，但这些报告的真实性仍然存疑。本层的地板有许多种类，如黑胡桃木、白色大理石和充满着异国情调的红金色地毯。大厅被前面所提到的装饰打扮的非常豪华，这其中就包括书架、橱柜、古董沙发以及更多的装饰品。
//
//主厅的墙壁上散布着古董烛台，但其实有一些实际上是烛台模样的电灯。这些电灯会持续产生和Level 0的荧光灯相似的嗡嗡声。主厅里大多数的房间都是空的，但是有些房间却有着齐全的家具，甚至可以让人在里面维持生活。此区域的门上都贴有金色的标牌，而标牌上的房号似乎是随机的数字。此区域大多数的门都是锁着的，但是有些门会随着时间的推移而奇迹般地解锁。有些门甚至会随机打开和关闭。
//
//主厅里也有许多的电梯，而这些电梯的样子都很不一样，从现代电梯到带有铜栏杆的古董电梯都有。这些电梯内部有许多写着可以通向1-382楼的按钮。按下按钮，尝试进入1-12楼会把你带到Level 5的其他部分，而尝试进入13楼或更高的楼层则会导致电梯乘坐者死亡或者失踪。目前尚不清楚12楼上面是什么。
//
//贝弗莉室（Beverly Room）：
//也被称为“永恒的舞厅”。这里似乎是Level 5主要的枢纽地区。这个房间非常宽敞，四面都有着很多门。这些门的数量似乎是随机的，一位漫游者曾报告说他在贝弗莉室的墙、地板和天花板上看到了数百扇门。房间里面只有一张长相奇特的小桌子，而整个房间都被一扇巨大的吊灯照亮。
//
//桌子上的东西包括许多饮料和一盘未打完的麻将。任何尝试打完这局麻将的行为都未获成功，因为大多数人都会受到这盘麻将的影响而感觉到自己在被迫远离它。这个区域的门会通向主厅或者锅炉房，而主厅通常是最常见的终点。贝弗莉室的入口上贴有一个银色的小标牌，上面写着“贝弗莉室”。
//
//锅炉房（The Boiler Room）：
//Level 5的这一区域有着很大的空间，但因为里面有大量旧机器的缘故而显得相当杂乱。锅炉房里有刚刚提到的老式机械以及散落在墙壁上的大型工业管道，这些管道相互交织缠绕，让锅炉房内部的布局看起来非常幽闭和恐怖。在这些管道上能找到排气阀，而杏仁水似乎有流过管道。管道里水的压力似乎是管道漏水的原因。
//
//这个区域的温度相当高，因此这里的表面非常干燥。但因为机器运转的原因，空气里充满了蒸汽。大多数房间里都有烧水的锅炉，甚至在有些房间里能见到熔炉。在锅炉房内听到的噪音大多是机器和杏仁水从管道里滴落发出的声音。漫游者报告说他们曾听到从冒烟的熔炉里传出微弱的低语声。针对这些报告的调查仍在进行中。在锅炉房内有维护用的电梯，但并不建议去使用它们。
//
//目前已有关于Level 5里第四个区域的报告，该区域被称为“大堂房间”（The Lobby Room）。没有人知道该如何进入该区域，因为所有进入过此异常区域的漫游者都异口同声地表示：“你不该知道这些”。这句回答很可能意味着人们无法记得他们是如何进入此区域的。这些进入过“大堂房间”的证人在几个星期内就失去了有关于这个房间的所有记忆。事实上，我们中的许多人都很有可能进入过该房间，只是记忆在随后丢失了。M.E.G.正在对该区域进行调查。
//
//普通的实体在Level 5相当少见。然而，有大量的死亡飞蛾在本层里筑巢安家，Level 5被认为是此实体的核心巢穴之一。大量的死亡飞蛾会从黑暗的房间里飞出来占据整个大厅。雄性和雌性死亡飞蛾都会在Level 5出现，众所周知的是，雌性的死亡飞蛾是相当危险的。但幸运的是，这些雌性飞蛾似乎都会选择待在巢穴里，并且在正常情况下不会轻易离开自己的巢穴。但是雌性飞蛾在本层级确实更加常见。已知出现在Level 5的其他实体只有猎犬、木灵、窃皮者、观察者、Nguithr'xurh、咆哮者和尸鼠。本层也有关于89号实体的报告，此实体也被称为“蚂蚁”。同时，也有在本层锅炉房内观察到牧蛇的报告。实体26，也被称为“萨曼莎”，偶尔也会在Level 5的主厅内游荡。如果你打算接近“萨曼莎”的话，请记得一定要带一些优质的肉。
//
//把这些无聊的内容先放到一边儿去吧，我相信您已经累了。您何不来我的办公室坐坐呢？我的意思是说，我想和您谈谈。您没必要在继续往前走了。
//
//基地，前哨与社区
//M.E.G. 哨所 “家政服务”（M.E.G. Outpost "House Keeping"）:
//这个前哨站是为保护其他团体免受实体的伤害而建立的，同时也是为了帮助M.E.G.更好的研究Level 5 。
//本哨所的成员会帮助想要离开锅炉房的漫游者。
//通常会帮助像“家常酒店”这样的组织。
//家常酒店:
//本组织在Level 5设有酒店服务。
//该组织位于主厅（The Main Hall），在那里能找到标明他们位置的独特标识 。
//此组织目前仍对新的漫游者开放，漫游者需要填写他们的申请才能入住。
//他们有足够的食物和客房服务来保证漫游者的安全。
//这里是他们的第一个基地，第二个基地在Level 11。
//该组织的第三个基地位于Level 230。
//原住民:
//“原住民”是一群居住在贝弗莉室的人。
//该团体是由从1300年到1940年进入后室的人组成的。
//他们只接受来自上述时间段的漫游者作为新成员加入他们。
//通常不与人交往，但是偶尔也会和其他人进行交易，尽管他们倾向于远离人群。
//大约有31个成员，其中有些成员在历史上相当出名，例如：
//阿梅莉亚·埃尔哈特（Amelia Earhart）
//多萝西·阿诺德（Dorothy Arnold）
//約翰·雅各·阿斯特四世（John Jacob Astor IV）
//爱德华·约翰·史密斯船长（Capt. Edward Smith）
//以及更多…
//失落的大厅协会（The Lost Hall Society）：
//这是一个由未知实体创造的组织。
//成员人口不详，本协会位于本层靠近图书馆的那一侧。
//有传言说他们花费大多数时间用来收集、学习于讨论历史和地理有关的信息。
//他们以收集大量的书籍、地图和其他包含知识的媒介而闻名。
//对于任何需要相关信息和知识的漫游者来说，他们是极其宝贵的资源，因为他们的作品至今仍在Level 5放着。
//入口和出口:
//入口：
//如果想进入本层，请在Level 4找到并进入一个老旧的楼梯。
//可以通过Level 3的电梯进入本层。
//在Level 19找到一扇损坏的门可以把你带入Level 5。
//在Level 126的“侵蚀状态”存活就能进入Level 5。
//Level 10里的一些房子可能会通向Level 5。
//Level 82里“入口大厅”上的一扇门有极低概率可以通向Level 5。
//Level 92里的一些门可以通向Level 5。如果你在“事件3”中没有离开公寓，那么你也会被带入本层。
//Level 4.2中的某些门可以把你带入Level 5。
//出口：
//转身回到带你进入Level 5的楼梯，你可以重新进入Level 4。
//回到电梯可以重新进入Level 3。
//深入锅炉房可以把你带入Level 6。但是极度不建议使用此方法离开Level 5，因为锅炉房通常有着极端的高温。
//打开一扇深色木门可以进入Level 9。
//在墙壁、地板或天花板上找到一扇开着的、显现出森林景象的门，这能带你进入Level 63。
//进入在主厅找到的金属门可以把你带入Level 98。
//如果你周围的灯光同时闪烁，一个木制的门将会出现。打开它会把你送到Level 27。
//在锅炉房玩街机游戏机可以把你带到Level 40。
//进入锅炉房里一个类似于气闸门的大门可以到达Level 78。
//在贝弗莉室有很低概率会见到一个巨大的木制大门，它通向Level 84。
//酒店里被M.E.G.看护的一侧有通向Level 171的入口。
//作者
//« Level 4 | Level 5 | Level 6 »
//
//脚注
//1. 随后会在本文章里做进一步解释。
//package lvls;
//
//public class lvl5 {
//
//}


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl5{}