package lvls0;
//Level 56
//内容警告：血腥
//
// 
//
//生存难度：
//等级 5e - 环境
//
//不安全，实体适应
//不稳定
//气候危害，中量实体10856649976_4ce22d286f_b.jpg
//在 Level 56 内拍摄的许多照片中的一张。
//
//16706655215_1bc4553429_b.jpg
//一名未知流浪者在 Level 56 零下区域拍摄的照片。
//
//Level 56 是后室的第57个层级。 该层级由一个满是冰和岩石组成的圆形洞穴系统组成，其中的温度随着会随着靠近洞穴中心而降低。
//
//描述
//Level 56 是一个由光滑的蓝冰组成的圆形洞穴系统，其中有一道来源不明的光线照亮了整个层级。Level 56 的地面由潮湿的岩石组成，十分难以穿越且似乎永远向下延伸。层级内的高度变化并不明显，但仍然比层级顶端的更陡峭。
//
//Level 56的外围大多通常可以凭借合适的装备生存，尽管从32°F1低至 -459.67°F2的极寒可能经常会导致毫无准备或缺乏经验的流浪者冻伤或死亡。该层级的异常性质也被证明为对生存的挑战，因为无法制造150°F3以上的热源。
//
//在Level 56的冰中发现了许多元素的液态，例如氮，氦，氧和氢；其中的一些可能对流浪者构成威胁。这些液体中的大多数是无色、无味的，并辐射出与液体相同元素的气体。在未事先检查内容物的情况下，请勿饮用在此层级中发现的任何液体。
//
//在整个Level 56中都可以找到里面有医疗用品，斧头，撬棍，氧气罐，防寒服以及其它保暖衣物的木箱。这些板条箱内的防寒服——类似于现代宇航服——可以让流浪者忍受Level 56中最冷的部分。在这些板条箱中可以找到耐寒保温瓶，其中包含有杏仁水和液氮等液体。虽然有用，但在Level 56中找到的板条箱通常都会被钉住，需要用专门的工具来撬开。
//
//在向关卡的中心核心移动时，冰将逐渐开始变得更加紧凑并形成刚性结构。地形将变得更加平坦，这意味着在此行走将不再如此困难。冰柱可能在内部的天花板上形成。这些冰柱可能会掉落，惊吓并有可能伤害到流浪者或其他实体。接触这里的冰也可能是致命的。这些冰不可能融化，但会将接触处的水分子凝固，以至于几乎将两个接触部分焊在一起。这已经被证明是非常痛苦的，只有将接触部分截除的情况下才有可能治疗。
//
//靠近Level 56中心的区域几乎完全未被探索，因为如果没有适当的设备将无法在此处生存。在距离核心约90米的范围外，气候与外太空相当。环境中的空气将开始冻结并液化。在没有专用设备的情况下将无法获得氧气。这也导致了大约一英寸的液氧填充了层级的底部。整个区域都可以找到冷冻的死亡实体化石，其中的一些被一种丝状材料紧紧地包裹。
//
//当有人接近Level 56的中心时，先前的液化空气将被冻结成固体而受试者将能够看到一个名为“奇点”的圆形房间。房间的天花板上有几个大孔，从而让大量的光线射入。奇点的温度维持为恒定的绝对零度，并导致房间内的空气冻结，形成了一个天然的真空室。应避免与奇点的地板接触，因为它将更快地夺走房间内流浪者的热量。如果流浪者在没有任何形式的保护下暴露在关卡这一部分的气候中，他们几乎立刻就会被冻死。
//
//实体
//虽然数量较为稀少，但仍可在Level 56的内环和外环区域发现实体。同时， Level 56内的实体均已适应了寒冷环境，部分甚至已进化到可在该层级中心区域生存。已观察到部分实体体表有厚厚的白色毛皮覆盖。亦有流浪者观察到某些实体挖掘Level 56的冰层，以形成可供实体生存发展的洞穴和隧道。建议流浪者远离此类洞穴，因为其中极可能有敌意实体存在。在该层级可看到数量超乎常理的尸鼠和死亡飞蛾 ，同时，也有发现其他实体的报告。
//
//在Level 56的中心区域，可看到一类似蜘蛛的实体。同此层级内其他实体一致的是，该实体也已产生变异并得以在寒冷中生存，体表覆有厚厚的白毛。目前此实体的行为尚未得到广泛研究，也不能确定该实体是已记录实体的变种，或是此层级内的特有实体。到目前为止，多有观察到该实体在层级顶端的冰层中开凿隧道，并攻击小型生物。据推测，Level 56顶部未探索的广阔区域即为该实体的栖息地，这也可以解释为什么其踪迹如此罕见。
//
//基地，社区与前哨站
//M.E.G. 已经在 Level 56 的两端设立了通过无线电联系的两个研究基地。所有被 M.E.G. 招募来参与探索 Level 56 中心的任务的流浪者必须身着一件在层级的补给箱内找到的改良防寒服。
//
//M.E.G.（探险者总署） 冰川前哨 A
//冰川前哨 A 充当勘探小组的检查点。在 Level 56 的中心区域和这个前哨站之间可以找到红色旗帜。救援队有时会从冰川前哨 A 被派出以帮助流浪者或为失败的探索任务进行善后。由于层级内的热量缺失，前哨 A 的特工配备了各种无需热量就能击发的武器。
//
//M.E.G.（探险者总署） 冰川前哨 B
//冰川前哨 B 充当专家们在 Level 56 中心区域采集证据的中转中心与研究站。探索者们从这个前哨站被派出，并在完成探索后返回前哨 A。
//
//入口与出口
//入口
//Level 56可以通过切入 Level 8 中的明显较冷的部分，或是通过走进 Level 93、Level -5、Level 420 或 Level 135 中的洞穴来进入。洞穴入口也可以在 Level 55 的冰柜中找到。
//
//出口
//Level 56 中唯一已知的出口由一个加宽的洞穴组成，其中有白雪覆盖的地形，这将通向通向Level 57。
//
//研究日志
//奇点探索视频日志
//前置信息：
//2024年11月30日， 一来自冰川前哨B的探索小组试图通过奇点的顶部冰层离开Level 56。但由于一系列突发伤亡以及一未知实体的发现，其任务进程不幸被中断。
//
//任务执行人员：
//艾莉西亚 麦卡锡(Alicia McCarthy) ： 首席研究员
//林 韦斯特(Lin West) ： 医学专家
//艾伦 梅希亚(Allen Mercia) ： 研究员
//李 莫雷诺(Lee Moreno) : 设备专家
//设备清单：
//4套EMU宇航服；每位操作人员各一套。
//2根冰锥长矛，用以击穿奇点顶端冰层。
//8个氧气罐；每位操作人员各2个。
//每位操作人员的衣服上均安装有可记录音频的照相机。
//4台无线电设备，用于保持探索小组和两个冰川前哨间的通信。
//<文字记录开始>
//
//[小组在离开冰川前哨B 2小时42分钟后到达奇点]
//
//麦卡锡： 好了，拿到东西没？
//
//莫雷诺： 是，都在这。
//
//[莫雷诺把一根冰锥矛递给麦卡锡，二人站在奇点稍外处。之后二人用矛刺向天花板，冰块碎裂开来。突然，打开的洞中有一物体坠下，且立即凝固，并摔碎在了地上。其中一块碎片刺穿了韦斯特的裤腿。尖锐的寒冷完全包覆了他的腿，他痛苦地尖叫起来。而随着剧痛转为麻木，韦斯特的哭声渐渐消失。]
//
//莫雷诺： 快他妈把止血带拿来！包里！
//
//[麦卡锡把手伸进包里摸索着，而韦斯特已开始昏迷。她找出止血带，把它缠在韦斯特的腿上。之后，麦卡锡试图用无线电寻求援助。莫雷诺则走近观察坠下的物体，一只已变异尸鼠的脸从坠落物的侧面突出来。他戴上手套伸出手，触摸着包裹该实体的丝质网。整块坠落物已完全被冻结为固体，并在尸鼠周围形成了结晶。该物体的一大块已经碎裂，并在下坠过程中刺中了韦斯特。］
//
//麦卡锡： 喂？有人吗？这上面有什么东西……不知道是什么。它碎了，我们需要紧急医疗援助，来奇点，越快越好。
//
//[几秒的寂静过后，无线电设备传出人声。]
//
//研究员： 啊？怎么了？
//
//麦卡锡： 我们需要帮助！在奇点！派个医生或者什么人来！
//
//研究员： 好，我找下人。马上派过去。
//
//[椅子倒下的声响传来，伴着研究员走远的脚步声。麦卡锡来回踱着步，莫雷诺在试图唤醒韦斯特。没过多久，另一个声音又从无线电话筒里传了出来。]
//
//哈尔博士： 好吧，现在什么情况？
//
//莫雷诺： 他的衣服被刺破了——我们在奇点。我们已经在他大腿上端打了止血带，但他腿的状况看起来还是不太好，而且他已经昏迷了。
//
//哈尔博士： 他的腿还能支撑吗？
//
//莫雷诺： 博士，他的腿全被冰盖住了。
//
//[见此情况，双方都沉默了一会。突然，韦斯特发出呻吟，试图坐起来。］
//
//韦斯特： 我……我感觉不到我的腿了……
//
//哈尔博士： 会没事的，孩子。尝试站起来，他们会帮你的。尽快去冰川前哨B。
//
//莫雷诺： 博士，我觉得不——
//
//韦斯特： 不用，我可以的。就把我扶起来就好，老兄。
//
//[莫雷诺叹了口气，但还是抓住韦斯特的手，把他拉起来。麦卡锡也同样帮忙拉起韦斯特。］
//
//韦斯特： 根本不疼。
//
//哈尔博士： 这样还好……试着用那条腿支撑一小下。别太勉强。
//
//[韦斯特调整了一下姿势，将重心缓缓压在伤腿上。而其他二人惊恐地看着韦斯特的伤腿碎裂开，从大腿上端完全掉了下去。韦斯特注意到了自己体重的变化，低头看到了地上自己伤腿的碎块。］
//
//哈尔博士： 这他妈怎么了？！
//
//莫雷诺： 我刚刚就他妈想告诉你的，博士！
//
//哈尔博士： 把他带到前哨，快！
//
//莫雷诺： 韦斯特， 我们该走了！
//
//[韦斯特什么都没说，只是继续盯着他腿上挂着的冰块。血液已经完全结晶。]
//
//莫雷诺： 韦斯特， 求你了！快！
//
//麦卡锡： 莫雷诺， 我们有麻烦了。
//
//[麦卡锡向洞穴的另一端示意，另外二人转头看去。刚开始二人有些困惑，沉默不语，但随后他们就看到了正从天花板上爬下的蜘蛛状实体。这生物正试图从洞里挣脱出来，并接近探索小组。它的全身被冰覆盖，发出一种相比下更像某种振动的声音：它在用回声定位。韦斯特试图移动，但很快发现他的另一条腿也被冻在了地上。］
//
//韦斯特： 我不能……
//
//[莫雷诺试图把韦斯特拉起来，但韦斯特完全动弹不得，而他的腿变为更多的碎块断裂掉下。此时实体从天花板上挣脱出来，全速向探索小组成员靠近。］
//
//麦卡锡： 我们他妈现在就得跑！丢下他！
//
//[莫雷诺没有犹豫跑开了，只回了一下头，看到那个类蜘蛛实体扑向韦斯特，撕开了他已破损的衣服。他的哭号声充斥着整个洞穴，吸引了更多实体的注意。］
//
//<文字记录结束>
//
//麦卡锡和莫雷诺最终安全的回到冰川前哨B，此次探索暴露了其防护服上的几处缺陷，在可进行第二次探索前必须妥善处理。此后未曾发现韦斯特的尸体，只发现了他腿的残骸。
//
//« Level 55 | Level 56 | Level 57 »
//
//作者信息
//Footnotes
//1. 0°C
//2. -273.15°C 或绝对零度
//3. 约65.6℃


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl56{}