package lvls0;
//Level 53
//第53次尝试：
//向正在阅读以下信息的人致意，如果有任何人能看到的话。我叫Allen Grady，一名37岁平均身高的男性。我写出这的原因是因为我被困在自己的家里，不知道怎么出去。这是我最近一次尝试与外界取得联系。我想最好从这种状况刚开始的时候描述……
//
//那是2008年的12月份，临近圣诞。那天家里只有我……一个人。我记不得太多了，但是我记得整个房子都塌了，不知道这是否有什么含义。截至我写下这些时，房子里仍然有该死的节日装饰品。好吧，然后我在被冻昏后醒来……谁知道过了多久。我醒来后看到我的房子和往常一样。尽管由于发生的事故，地板上有些杂物和玻璃碎片。我环顾四周，发现窗外的世界依然在。虽然我很快就意识到情况并不简单。我试着打开我家的前门，但它……只是把我带回来了。恐惧攫住了我。我不知道发生了什么，也不愿知道。
//
//这一切发生的太快了。我猛地倚在墙角处，背靠着墙坐了下来。我只是坐在那里震惊和思考。我现在该做什么？我开始观察周围，探索房子本身。家里全部物件看起来都挺正常，整个卧室、浴室、厨房、我的一些设施。全都保持原状，甚至包括地下室。
//
//如果你想看的话，这是厨房的图片。
//
// 
//
//level-53-cc.jpg
//很安逸……不是吗？
//
// 
//
//这里正是我称之为家的一小撮杂物。
//
//嗯，日子一天天过去。然后渐渐累起来变成几个月，但窗外的天空却从未变暗。定格在清晨，可能是早上7点，也许吧？我实在是说不出来了。时钟还在走，现在是凌晨4点23分。自从我被困住后，我没睡过多少觉，但我一直没有太多的睡眠欲望。储存的食物可以吃，从冰箱得到的水也可以喝，只是需要我用滤水器过滤一下。很快，我发现所有的食物吃完了，但当我下到地下室时，地上总有一堆食物让我多维持几天。为确保里面一些食物的新鲜，我必须把所有吃的都拿到冰箱和橱柜那里去。
//
//不过，这种补货没有特定规律，它总是完全随机的。有次它几周都没有补货，我不知道我是怎么存活那么长时间并且感觉如常的。一直到后两周时，我突然感到非常饿，好像之前的饥饿感聚集到那时才冒出来折磨我。也直到那时我才去查看地下室是否补货，确实如此，但大多数包裹都被撕开并损坏了。然后我观察到一些动静，于是慢慢地走向那个小食物堆，看看里面是什么。结果发现是一只小老鼠钻进了食物堆里，正享用它所见的一切。它应该在一切发生前就住在这儿了。
//
//我小心翼翼地把老鼠困在一个罐子里，把它安置在楼上一个曾经用来养仓鼠的小笼子，它成了我的小朋友。我叫他Louie，每天都喂它，但老实说这无济于事，因为我仍然……孤身一人。
//
//之后……几年时间过去了，在那段时间里，我会接待一些访客，现在也是。然而它们不是人。他们更高，更苗条，没有脸。不过，它们似乎完全无害。只是漫无目的地在我家里闲逛。有时坐在桌边或沙发上，要么只是看着窗外。有时，当我看电视时，它们会坐在我旁边。令我惊讶的是电视还能正常工作，但看之前我还得获取新的电线，所以没啥可看的。
//
//尽管网速很屎，但WiFi也仍然能用。因为无事可做，所以我把做饭当成了爱好之一。所有的厨具都能用，因此我通常采用随机食材尽我所能地做饭。不管你是谁，都可以尝尝我的手艺，我做的牛排真的不错……如果你能找到我的话。
//
// 
//
//Level-53-Steak.jpg
//随时等你来品尝！
//
// 
//
//尽管我的食物会在地下室补货，但它总是放在地下室中央的水泥地上。我每次搬走食物都会洗一遍，所以没有什么卫生问题。同时，我注意到我每隔几天或一周所得到的食物要比我能吃掉的多得多。于是我开始节省我的食物以确保我有几年的分量，而这真的很有用。我还有我自己的菜谱和其他东西！现在我是烹饪方面的专家了。
//
//好吧，我这儿已经过了很久。最近尝试离开了很多次，包括打破窗户。它总是映出一副美好社区，人群在外面溜达的景象。我经常盯着他们看，甚至尖叫着求援，但没人搭理我。嗯……除了有次远处有一整群人什么都不做，只是透过窗户盯着我。这之后我是实在睡不着觉了。努力想打破窗户，直到打碎了一扇窗户它们才离开。但我的努力徒劳无功，因为破掉的窗户带我回到了自家……又一次。
//
//现在我只能在这里。好像没有出路，似乎我的余生都会困在这里。你知道我只是……想念人类。我想念我的家人。想念我的生活。因为我的高收入工作，我的孩子也由妻子照顾。我只是想知道我为什么被带到这里。这一切都事出有因……对吗？
//
//那么我受罪的原因是什么……？
//
//是什么？
//
//呃，这些问题我可以等等再想。我要把这几张纸条放到前门的邮箱里。因为我把东西放进去时，它没有在另一边出来，这个邮箱肯定通向什么地方。可悲的是里面空间很小，只能装一封信，所以这也是我现在正在做的。我希望有人能看到这些，无论你是谁……
//
//请帮帮我……
//
//你的朋友 - Allen Grady
//
//M.E.G. 报告 8734:
//2016/7/09
//
//M.E.G.Division Location Salvation的特工'Fritz Opel'在探索Level 9时发现了这张标题为“第53次尝试”的字条，该字条是在一栋小房子的红木门前发现的。Fritz和其他M.E.G.特工随后成功突破了封锁的大门并进入了房子。不知道房门为何是单向打开的。名为"Allen Grady"的流浪者被成功救出并带回到位于Level 0的Alpha基地1。
//
//编辑： 2016/7/23
//
//Allen 已被带回他的家，现在可以随意进出他的家，因其成功的接触尝试将此地命名为Level 53。分析这一事件对于进一步探索和拯救后室中的人类将是至关重要的。
//
// 
//
//EagleSD.png
//M.E.G. - 修正人理
//作者
//« Level 52 | Level 53 | Level 54 »
//
//Footnotes
//1. 在其2020 年 12 月初始属性改变之前。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl53{}