package lvls0;
//Level 64
// 
//
//生存难度：
//等级 3
//
// 
// 
// 
//Level-64.jpg
//一张在黑暗中拍摄的Level 64 照片。
//
//Level 64是后室的第65曾。Level 64似乎是一座无限大的房子，照明设备功能失效。
//
//描述：
//Level 64 是一个无限的房屋，有许多房间、大厅和楼梯。层级本身到处都是房屋装饰，比你在日常房屋中的要多。Level 64 中的黑暗吸收了光线，并且照明设备功能失效。目前The M.E.G.正为此筹备一个解决方案。当人们因看不到而靠感觉行进时，房子的结构似乎发生了变化，这可能会导致流浪者感到焦虑和/或偏执。另外， Level 64 也可能会导致流浪者在黑暗中度过一段时间后会出现类似于黑暗恐惧症的症状。
//
//Level 64 中的家具与您在 前厅 中通常可以找到的家具非常相似。然而，不同的是，家具的表面上可以发现大量的霉菌和灰尘。在层级的大部分都有大量物品，以至于有些物品以不可能的方式放置。有许多光源分布在层级中，但大部分无法激活，只有小部分可以激活。找到的任何书籍和其他书面材料都是空白的。 Level 64 中发现的许多房间和大厅可能与正常情况大不相同，例如一个满是时钟的房间，在一堆时钟的中心，一个落地大钟齐声滴答作响；颠倒的大厅，漆黑虚空大厅和更多奇怪的东西。
//
//Level 64 中似乎只有一个实体出现，它们被称为“潜伏者”。潜伏者是具有蠕虫状身体的类人实体。实体的高度估计为六 (6) 英尺高，很少有报告提到潜伏者有二十 (20) 英尺高，潜伏者能够用它们的大量腿攀爬任何表面，每边有五(5)条腿。潜伏者是敌对的，并且会在它们的视线范围内攻击。快速移动并远离视线是躲避潜伏者的最佳方式，因为他们无法听到声音。潜伏者对光很敏感，这可能是Level 64中大部分没有光的原因。
//
//Level 64会通过未知的方式将自己变成一个有限的普通房屋内部，并且可以找到许多入口和出口。所有光源都将被激活，在此房间不会出现实体。我们尚未清楚为什么会发生这种情况，因为它似乎是在 Level 64 中穿越太远时随机发生的。建议在此地通过众多出入点之一退出。
//
//隐藏“叛乱”文件 34-E:
//以下文件于 2020 年 1 月 7 日在最近发现的 叛乱 基地中被发现。这个基地似乎早就被废弃了，这也显示在 1962 年 8 月 28 日的文件日期内。这个具体的文件似乎是例行日程中的许多页之一。
//
//“叛乱”文件 34-E：08/28/1962
//“叛乱”：
//无论战斗将我们带到哪里。
//Layer-0024 例行协议文档 34-E
//
//安全漏洞事件：
//如果发生安全漏洞，所有人员必须立即撤退到第 0112 层出口，如果一切都失败了。 Layer-0024 内可能会发生许多可能导致大规模恐慌或破坏的事件。至关重要的是，所有人员都必须保持良好状态以供进一步利用。
//这些是Layer-0024 内可能发生的以下事件
//
//敌对生物攻击：
//如果遇到敌对生物的攻击，所有驻守的守卫都会使用武力进行攻击。 Creature-00581将立即被根除。如果敌对生物破坏项目，必须立即撤离所有资料和发现，以确保我们工作的安全。
//
//敌对团体突袭：
//如果有敌对团体入侵我们的工作区，所有士兵都必须使用武力进行攻击。所有科学家必须立即撤退到最近的 Layer-0112 出口。敌对入侵者留下的任何贵重物品都可以在战斗中用于对抗入侵者或用于我们项目的其他用途。
//如果项目遭到破坏，被敌人接管，我们必须立即放弃该项目或考虑搬迁该项目。
//
//未知灾难事件：
//更新至 1962 年 8 月 28 日
//如果我们的工作区内可能发生未知事件，则将项目搁置在这里。以下示例日志已放在这里作为进一步使用此项目的警告。
//
//事件日志 0024-02：
//在 ████/██/1962 年，一名匿名士兵在 Project-0014：Sector-0004 中遇到了一个由时钟制成的奇怪实体。然后，该实体重复了“我必须自由”这句话，之后士兵的整个脑海中不断重复着滴答作响的声音。士兵站了几分钟，感觉却像几个小时一样。另一名士兵带着两名准备进行指导的科学家走进来测试导致该实体消失并解救了被冻结的士兵。而滴答声在他们的脑海中一直持续了四十二小时。据观察，这名士兵在事件发生后不受控制的产生暴力。他们现在被关押在Project-0014：Sector-0002 医疗舱进行适当治疗。
//如果这个生物造成了破坏，我们必须为任何事情做好准备。
//
//返回基地：
//如果任何人员在探险或安全漏洞后失联，我们有多种安全返回的方法。基地坐标已分配给负责该项目的所有人员。欲了解更多信息，请切换到下一页。
//
//- - - 第 4 页 / / / 第 5 页 / / / 第 6 页 - - -
//
//总结： 本文档解释了许多可能导致基地被遗弃的不同情况。最后一个原因格外突出，因为整个“叛乱”基地区域都可以听到滴答声。事件日志中提到了一个“人体时钟”，它可能与散布在level 64周围的充满时钟的房间有某种联系。所有 M.E.G. 成员必须在此区域内谨慎行事。
//
//基地、前哨和社区
//在 Level 64 中拥有一个团体是一项艰巨的任务，但这并不意味着它不能完成。
//
//The M.E.G. “黑暗游侠”前哨：
//由 23 人组成，在 level 64中帮助流浪者。
//居住在 Level 0 入口房间。
//每周从 The B.N.T.G. 收到补给品。
//废弃的“叛乱”基地：
//这个基地早在 The M.E.G. 到达之前就被叛乱者遗弃了。
//最重要的物品已被移出该区域。唯一剩下的资料是很少的文件。
//在这个基地内可以听到响亮的滴答声。源头尚未找到。
//关于这个项目，我们唯一知道的是一份描述一次遭遇的文件。请参阅叛乱文件 34-E 了解更多信息。
//管家：
//一个神秘的团体，居住在类似房屋的区域。
//该小组发现了 M.E.G. 不知道的关于后室中房屋的信息。
//成员数量未知。
//入口和出口：
//入口：
//要进入此层级，电梯入口可以成为任何层级的level 64入口，入口移除了曾经在那里的电梯。包括Level 65。
//在 Level 98 中找到一个地窖将导致你进入Level 64。
//在 Level 6 中找到一张沙发并坐在上面会导致您昏倒并苏醒在 Level 64。
//在 Level 2 中找到一间带装饰的大房间将带您到 Level 64。
//出口：
//要退出此层级，您必须生存到安全阶段，大多数出口才能正常运行，然后找到一扇玻璃门，通向 Level 9 中的一栋房子的院子。
//走出前门可以带你回到家.
//通过找到一个充满光线的明亮房间可以尽快地找到一个出口，通常可以将您带到Level 0。
//“切入”剪贴画可以带你到Level 57。
//可以在墙壁或天花板上找到一个可以通向 Level 8 的洞。
//这里是作者(们)
//« Level 63 | Level 64 | Level 65 »
//
//脚注
//1. 这里的实体很有可能是潜伏者。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl64{}