package lvls0;
//Level 65
//吸气。呼气。
//
//Fab刚才还在这里。
//
//你为什么这么害怕？
//
//这里没有东西能够伤害你。
//
//吸气。呼气。
//
//我的天。Fab他妈的去哪了？
//
//那只是风声，对吧？
//
//吸气。呼气。
//
//Fab？
//
//黑暗中出现了一个带血的笑容。
//
//“啊啊啊啊啊啊啊啊啊”
//
//“哈！”一个穿着黑色T恤和深蓝色外衣的年轻女孩走进了月光之中，她沾满了血的牙齿闪着亮光。
//
//“Fab，你他妈在干什么。”
//
//“你叫得跟个小女孩一样，Jamie”
//
//“Fab，你的身上怎么都是血？”
//
//“这不是血，傻子。好吧。它们可能是血，但它们都是从这些苹果这里来的。”她笑道。
//
//“Fab，我不认为你可以随便吃这里的东西，尤其是它们上面还全是血。”
//
//“但它们确实很好吃啊！它们就像是口感和味道的完美结合。你也应该试一试的，Jamie。”
//
//“行吧。但是如果我最后嗝屁了，那我死也不会放过你。”
//
//“哈哈。那就祝你好运吧。我觉得，你死之后还不会比现在更吓人呢，你上次吓我的时候发生了些什么，就不用我再提醒你了吧。”
//
//“我总不会一直活在过去的阴影里嘛，对吧？”
//
//“就是图一乐嘛。好了，吃一口吧！”
//
//他停顿了一下，把嘴放在了苹果上。
//
//“Fab，你还好吗？”
//
//“嗯，我就是——”
//
//她开始吐血，而周围的草丛和灌木似乎正在向着喷溅出来的液体倾斜，就像是想要尝一口似的。
//
//“Fab？！”
//
//她的皮肤开始四分五裂，下面显露出了一层硬壳。她的骨骼开始移位，肢体也开始分裂和增殖，变成了短小且弯曲的钳形肢体。她发出了可怕的叫声，面部逐渐变得扭曲，在拉伸和撕扯中，她的身体被重塑了。她全新的嘴巴移动着，像是要说些什么，但她已经不能说出人类的话语了。这个新生的蜈蚣在地上颤抖了一会，突然，在一阵剧烈的抽搐之后，它冲向了Jamie。
//
//Jamie尖叫着，跑向了森林，不顾一切地想要从追逐中逃脱。过了一会，他似乎做到了，但是当他停下脚步，喘着粗气的时候，那个节肢动物夹住了他的脚踝，硬生生地扯走了一大块肉。
//
//他跌倒在地，而此时蜈蚣就在他的上方。他的皮肤被扯开、撕裂，直到他只剩下血肉。这一团肉块在无助和极度的痛苦中扭动，而这个新生物则会享用它长达数小时。
//
// 
//
//生存难度：
//等级 4
//
// 
// 
// 
//6LnoXWqIEGhpjal.jpg
//从深红森林到达Level 65的入口。
//
//描述：
//Level 65是一个常年雾气缭绕的森林，里面有着多种落叶树，其中主要的种类从未在前厅中见过。这个层级里的所有树就像是正在经历着秋天的颜色变化，它们的叶子都是血红色的。这些血红色的叶子有时会从树上落下，七零八落地飘落到地上。
//
//浓密而又潮湿的雾气在整个层级中弥漫；以至于从来没有人在这里看到过天空，但是人们怀疑雾的上方有着某种光源，因为整个层级都处于一种持续的、昏暗的黄昏状态。这个层级除了时不时的冷风以外没有其他的天气，而这些风让这个层级的温度维持在了一个比较冷的水平。
//
//在这个层级中，有些树似乎是食肉的，它们依靠着在这里失踪或是死去的流浪者维持生命，这些人的尸体会在死亡的数小时后被地面所吸收。除了树木，这里还有一些动物群落，它们主要由超大的虫子组成，最著名的巨型蜈蚣可以长到6英尺（2米）长。
//
//值得注意的动植物：
//血苹果树：
//2AQeYZFi5SmL7O3.jpg
//一丛血苹果树。
//
//这些血苹果树会均匀地排列，每两棵树之间会有15英尺（5米）的距离。它们会像前厅中的苹果树一样结果，但是这些苹果会比普通的苹果大上1.5到2倍，而且外表也是血红色的，这也是它的名字的来源。当这些苹果被穿了个洞的时候，它们就会流出粘稠的液体，这些液体在视觉和味觉上都像是一种动物的血液。
//
//在食用血苹果后不久，流浪者就会感到不适并开始吐血。他们会不可逆地转变成这个层级的蜈蚣之一。此时，他们会开始狂暴地行动，可以确定，他们已经失去了所有的人性。目前还不清楚这个层级中的所有蜈蚣是否都是吃了血苹果的流浪者，还是他们能够自己繁殖。
//
//嘴巴：
//mouth.jpg
//一个嘴巴的内部。
//
//少数时候，流浪者会在Level 65遇到一个巨大的，由肉体所覆盖的裂缝，俗称“嘴巴”。这些嘴巴的直径约为6-9英尺（2-3米），并且深入地下。它们的内部覆盖着红色的肉质组织，偶尔还会有一些非功能性的，像是人类的牙齿。掉落到嘴里的流浪者会被迅速地拉进去，最后被跳动的肉壁所掩盖。
//
//目前尚不清楚流浪者掉进嘴巴之后会发生什么。但在流浪者掉进去的几小时甚至一整天之后，在那里经常能够听到尖叫声。有时这些嘴巴甚至会在没有人掉进去的情况下自己发出尖叫声。这种自发的尖叫产生的地点会更深一些，在喉咙附近。
//
//蜈蚣：
//ShdTl8QrUpZVe9y.jpg
//该层级中的一只蜈蚣。这张照片是在蜈蚣被一个流浪者杀死后拍摄的。
//
//如上所述，这个层级的蜈蚣可以长到超过6英尺（2米）长。这些蜈蚣都有光亮的黑色外骨骼，且极具攻击性，它们能暴力地撕碎任何靠近它们的流浪者。它们移动速度极快，对于物体的运动也及其敏感，所以不建议流浪者在遇到它们时选择逃跑，逃跑将必死无疑。相反地，流浪者应该慢慢地靠近它，尝试用锋利的物体刺穿它的外壳，或是用重物击打它的头部。
//
//当人们杀死并切开一只蜈蚣的时候，总是会在它的内部发现一具完整的人类骨骼。这些骨骼大部分是无用的，但是头骨会位于蜈蚣的头部，这表明，这个人类大脑的一部分还是完好的。这些生物体的体内充满了深红色的液体，而这些液体又与血苹果的汁液相似，尽管目前还没有实验证实，食用它们是否会产生与血苹果类似的效果。
//
//树桩：
//B1s3N9qOKJFojfR.jpg
//树桩。请注意，照片中有着异常的视觉现象。
//
//在层级的深处，流浪者可以遇到一个被称为“树桩”的东西。这个树桩是黑色的，它就像是从一棵大树上整齐地切下来的一样，但由于它有着异常的影响，这让人很难去仔细地观察它。当流浪者靠近树桩时，他们将开始体验到异常的感觉，这一影响也会延伸到该地区拍摄的照片之中，这说明了它实际上可能不是一种幻觉。这些异常的景象包括：天空呈现出明亮的红色，其他所有的物体都被缩小成一片漆黑的轮廓，物体的曲线和角度会发生变化，成为一个尖锐的点。此时，流浪者在报告中说，他们发现自己越来越难以清楚地思考，开始感到时间过得比实际要慢，而且会感到自己与自己的身体分离。在流浪者触摸树桩之后，触摸部位的皮肤会受到严重的烧伤。这种被烧伤的皮肤是无法愈合的。
//
//这个树桩被认为是有意识的，因为靠近它的流浪者报告说，他们听到了一种深沉的雌雄同体的声音，这个声音会他们的脑海中回荡。尽管声音有着这种特性，但在录音中也可以听到它。这个声音经常会直接与流浪者对话，但大部分对话的内容是不连贯的。
//
//入口与出口：
//通过一扇木制的门可以进入Level 65，这个门可以在几个基于森林的层级中找到。这些入口是固定的，也可以用作出口，不过，在Level 65通向的层级中，不一定有着对应的出口。目前已知以下层级与Level 65相连：
//
//Level 32
//Level 14
//Level 499
//Level 23
//深红森林
//追加文档：
//探索记录Level 65-1
//前言：以下内容节选自M.E.G的独立探险组织Elise团队（由Elise Beck、Billy White和Blake Ross组成）的记录。这个部分记录了一次发生在Level 65的，探索“嘴巴”的内部结构的探索活动。
//
//<记录开始>
//
//Elise Beck: 好的，它在录了吗？
//
//Billy White: 嗯。它应该录得一清二楚。
//
//Elise Beck: 好的。绳索好了吗？
//
//Billy White: 绳索好了——绳子看上去没有问题，但是你确定要下去吗？我的意思是，这地方让我觉得毛骨悚然。
//
//Blake Ross: 是啊，说真的，Elise。我们甚至不知道这…东西的下面到底是什么，这片森林里的所有东西都像是要抓住我们一样。
//
//Elise Beck: 我不会有事的，如果出了什么问题，你们就把我拉出来。
//
//Billy White: 好。
//
//Elise Beck: 好的。开始进入到嘴巴的里面。
//
//Elise Beck: 正在进入到…喉咙底部的洞里。
//
//Elise Beck: 正在打开手电。
//
//Elise Beck: 我操。停一下，别放了！
//
//Blake Ross: 一切都好吗？
//
//Elise Beck: 让我…组织一下语言。
//
//Elise Beck: 在嘴巴的洞下面有个坑，里面…全都是蜈蚣，它们在互相爬来爬去——大概有几百条。
//
//Elise Beck: 然后，墙上还有着很多眼睛，它们…在盯着我。
//
//Elise Beck: 拉我上去。拉我上去，就现在！
//
//<记录结束>
//
//探索记录Level 65-2
//前言： 以下内容节选自M.E.G的独立探险组织Elise团队（由Elise Beck、Billy White和Blake Ross组成）的记录。这个部分记录了一次发生在Level 65的，探索树桩附近的区域的探索活动。
//
//<记录开始>
//
//Elise Beck: 测试，一，二。好了吗？
//
//Billy White: 是的，都设置好了。
//
//Elise Beck: 好的。我开始录制的原因是我们开始体验到了视觉的…异常，我想，这是在数据库中用来描述它的词。这也就意味着我们正在靠近树桩。
//
//Blake Ross: 没错。
//
//Elise Beck: 有一件事是我觉得在条目中所缺失的，条目里提到了树桩会对人说话，但没有提到它会说什么。
//
//Elise Beck: 所以，我们希望能够对这一点稍微进行补充。
//
//[大约20分钟的少量谈话]
//
//Unknown: …然后天堂降临，与凡间相连。当它停止时，它弯折，扭曲，在巨大的现实中扭动…
//
//Billy White: 我听到了。
//
//Elise Beck: 嘘！
//
//Unknown: …然后，有三位来访者来到了圣地。欢迎你们，来访者。在我的面前说话时，不必感到害怕。
//
//Elise Beck: 你…你好。你…是谁？
//
//Unknown: 我现在孤身一人。我曾是生命的创造者和破坏者，而现在被遗弃了。我失去了往日的荣耀，现在只得苟且偷生。
//
//Elise Beck: 什么？
//
//Unknown: 我看到了你到来，你看见了我，就像我看见了你一样，我在专注地等着你来找我，虽然你可能对这些事一无所知。
//
//Elise Beck: 这一切又代表着什么？
//
//Unknown: 曾经有一棵树，它长得又高又大。它是众神的绞刑架。它为生命负责。也为死亡负责。然后，众神犯了他们最大的错误。他们创造了可以反抗的生物。他们创造了人。因为人们已经厌倦了死亡，所以他们扯下了一根树枝，把它做成了斧头。人们砍倒了树，但树根还在。绞刑架不需要树枝来杀人，所以它继续地，腐蚀着它周围的一切。人们痛哭流涕。
//
//Elise Beck: 所以你在这个故事里是树？
//
//Unknown: 不，我是伐木者。
//
//<连接丢失>
//
//后记： Elise团队的所有成员在诺斯伍德的M.E.G基地附近醒来，身上全是血，但这些血都不是他们的，同时，还有一些微小但严重的烧伤，且没有任何愈合的迹象。他们在报告中说，他们已经不记得在到达树桩之后发生的事情了。
//


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl65{}