package lvls0;
//Level 61
// 
//
//生存难度：
//等级 4
//
// 
// 
// 
//Level-61-1.jpg
//一张拍摄于正常情况下火车内部的照片。
//
//Level-61-2.jpg
//一张拍摄于旧时情况下火车内部的照片。
//
//Level 61 是后室的第62层。它是一辆拥有无限长度，样式为二十世纪中期的火车。
//
//描述:
//Level 61 是无限的，所以在火车上穿过车厢是不推荐的，你可能会迷失其中。这些车厢拥有一种现实中不可能存在的多结结构，它们同样拥有窗户，可以看到外界的景物。在火车停靠站点时下车会来到 Level 11。当你转移视线向别处时，它们将会消失并完全随机地传送至其它地点，所以你应当永远不要使火车在你的视线之外。有一名售票员在初始车厢。这一实体是友好的并会回答一些问题。如果你走过许多节车厢，你将会找到许多拥有“十一效应”的幼年或成年的无面灵。如果你在这一层级流浪过多天数，车厢风格将会随着你的前进而逐渐老旧，直到它看起来类似于一辆十九世纪五十年代的火车。
//
//旧火车：
//当层级进行到这一阶段，更加危险的情况将会出现。你会听到大声的耳语，你的理智将因此而下降。售票员消失了，一种叫做迷彩爬行者的新实体将会出现。这些生物是奇怪的人形怪物，正常状态下有四只灰棕色的手臂。这些生物有一双巨大的、纯白的眼睛，但它们的眼睛不能看见，所以它们用听觉来捕猎和攻击流浪者。它们还可以改变材质和颜色以适应周围环境，并且可以保持完全静止。它们很聪明，通常成群结队地捕猎，所以它们经常会互相帮助，例如，当其中一个成员处于危险之中时。为了在这些生物间生存下来，你必须尽可能少地发出噪音。在他们附近扔东西将会分散他们的注意力。这些生物很罕见，相对于它们你更可能会发现窃皮者或猎犬。
//
//基地、前哨和社区：
//M.E.G.（A.k.a. 探险者总署）“列车残骸”：
//这一团体包含3名主要人员和21名成员。
//他们主要在Level 61探索。
//他们在起始车厢附近建立了基础设施。
//他们不被允许离开本层，除非他们组建一支探险队。即使出现任何“旧时情况”的迹象，他们也不会被指示撤退。
//他们开放交易，并愿意帮助有需要的幸存者和流浪者。
//入口和出口：
//入口
//据说在Level 60的上层区域睡着可能会把你送到这里，但目前还没有得到证实。
//出口
//这是不推荐的，但你可以在列车运行时跳出列车，并将会在 Level 4醒来。
//在“旧时情况”下车将到达 Level 10。
//在 “旧时情况”中生存足够长的时间将到达 后室地铁。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl61{}