package lvls0;
//Level 66
// 
//
//生存难度：
//等级 3
//
// 
// 
// 
//Level-66.jpg
//The M.E.G.于Level 66中拍摄的一张照片。
//
//Level 66是后室的第67层。此层级现暂未经证实。
//
//描述：
//Level 66是一片沼泽，其环境与佛罗里达埃佛格雷湿地相似。此层级有大量实体活动，包括一种特殊的，可以在沼泽中游动的尸鼠。在此层级中辨认方向十分困难，因为这里没有道路。人类在此层级中易产生隔离感，但服用足量的杏仁水可以改善情况。沼泽中的水似乎有致幻效用，流浪者容易因此陷入悲尸化循环，故不建议饮用。此层级出没的实体有尸鼠，悲尸, 窃皮者, 迷彩爬行者和死亡飞蛾。这里还分布着鳄鱼形的实体，其目前暂未命名。此类实体行为上与普通鳄鱼相似，不同之处在于其运动速度更快，肌肉更强壮，且后背长有棘刺。这使得这类实体相当危险。幸运的是，此类实体易被尸鼠分散注意力，但仍建议不惜一切代价远离它们。
//
//沼泽中央有一间棚屋。此处大部分区域都较空旷，仅包含一张桌子，一张床，以及一张1900年代军兵的照片。此层级中还有一架运输机的残骸，残骸中发现有陈旧的物资储备，其中大多为过期的食品和饮品（后者指久置的杏仁水），但都不能保证饮食安全。此外，储备中也可找到武器和防毒面具。
//
//在沼泽中穿梭几天后，长达几分钟的警笛声会突然传来。此声音的来源是未知的。警笛声停止后，环境氛围会变得异常压抑。过一小会，一个身穿20世纪20年代军服，头戴防毒面具的奇怪人形实体会出现。此实体只能从远处观察：一旦接近，该实体便会离开，随后完全消失在目光中。此后，你会听到空中的飞机轰鸣声，却看不到任何一架飞机。几周后，你会听到爆炸声，同时毒气会开始腐蚀沼泽。此毒气十分危险，应尽一切可能避免接触。出口不会被毒气影响，但毒气面具（携带的或从飞机残骸中取得的）此时依然会派上用场。
//
//在这一时期，鳄形实体会变得格外强壮，并变为从体内散发毒气的状态。同时，那些蒙面实体会成群出现，在浑浊的污水中奔跑行进。任何试图干扰此类实体的尝试都会失败，除非与实体建立起物理意义上的互动。成功互动可能会被实体接近并逮捕；此外，他们也可能会说：
//“跟上我们，这地方很危险！”
//“快过来，你需要帮助。”
//“冷静，别激动。”
//“别担心，一切都会好起来的。”
//在交流过后，你会被传送至“Level 14”。这是M.E.G.的“阴暗海员小队”迄今所发现的所有信息。更多信息将会进一步更进。
//
//基地、前哨和社区
//M.E.G. (又称“探险者总署”)“阴暗海员小队”
//此小队专为探索此层级而成立。
//在出口附近有一基地。
//此层级的大多讯息来自他们。
//会帮助此层级的流浪者和幸存者。
//愿意贸易。
//入口和出口：
//入口
//想成功进入Level 66，需要在Level 34或Level 10找到一片沼泽区域，或穿过Level 78的出口通道。在后一种情况中，你会发现周围环境缓慢地变成一片沼泽，且空气逐渐稀薄。
//
//出口
//要离开Level 66，你需要找到层级深处的一条长路。如果你走下去，你会最终到达Level 11。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl66{}