package lvls0;
//Level 62
//卡拉格研究所: 后室信息档案
//此档案仅供获现任高级档案管理员授权的人员使用。
//未经许可访问此文件将会导致对该文档内容的自动审查。我们也会毫不犹豫采取行动。
//- Gani，卡拉格研究所后室分部高级档案管理员
//
//关闭档案
// 
//
//生存难度：
//等级 2
//
// 
// 
// 
//Level-62.jpg
//Level 62的后院部分。
//
//Level 62是后室的第63层。
//
//描述:
//Level 62是一所杂草丛生的破旧房子的后院。这座房子被砖墙包围，无法攀爬，因为当靠近它时，它会变得更高。在后院部分可以找到一个状况良好的狗窝。在砖墙的角落处有一个可供人进出的洞，它通往一片巨大的森林。
//
//这一层级被 Juanita和Tala发现，她们是卡拉格研究所的档案管理员，在一次普通的实地调查发现了这一层级。
//
//归档语音日志 1 - 62 - 3/15/21
//归档语音日志 2 - 62 - 3/15/21
//探索日志 1 - 62 - 3/15/21
//Juanita： 测试…测试…，你能听到吗，Tala？
//
//Tala： 很清楚。你不是说你升级了我们的通讯和追踪系统吗?
//
//Juanita：是的，Gani说在这里信号很容易断掉， 这会影响我们的联络。所以我调整了通讯设备的紧急报警系统。现在，当你的设备失去信号或手动按下它时，它就会启动。
//
//Tala： 好吧，那我还需要每半个小时报告一次吗？
//
//Juanita： 当然需要，紧急警报只会发往总部。我还是需要你在警报发出前告诉我你的最新行踪。
//
//Tala： 好吧…现在十分钟过去了，我在…离房子大概半个足球场远的地方。
//
//Juanita： [叹气声] 情况怎样。
//
//Tala： 三十分钟了！我在这看不见那座房子。Juanita，你能追踪到我吗？我离基地有多远？
//
//Juanita： 你现在离基地360英尺远，你发现什么了吗？
//
//Tala：没有， 我主要是发现了一些死亡飞蛾。我已经看到树上有一些爪痕了，我可能离那些尸体…或者杀死它们的东西很近了。那所房子呢？你仔细检查过了吗？
//
//Juanita： 这些门从里面堵上了，我大概不得不打破一两扇窗户…我会把我的发现加进报告，继续你的探索。
//
//Juanita： Tala ，现在已经三十分钟了，有什么新发现吗？
//
//[无回应]
//
//Juanita： Tala?你能听到吗？
//
//[无回应]
//
//Juanita： Tala?你还好吗?
//
//[可以听到跟踪装置发出的响亮的哔哔声]
//
//[记录结束]
//		
//		
//		Juanita： 好，Daga已经在路上了，我不喜欢这样。我不应该担心的，一切都很好，这种情况总是会发生。
//
//		Juanita：不管怎样，Daga找到Tala后， 她们会在几个小时之内回来的。我现在只需要注意这座房子周围。[叹气声]烦死…
//
//		[可以听到物体掉落的声音。可以听到砰的一声巨响]
//
//		Juanita： 这房子都塌了…嗯？这里到处都是抓痕…
//
//		Juanita： 好，好…现在报告。如我所见，这座房子的二楼有三个卧室。老实说，二楼的情况比一楼糟得多。好像有什么东西闯进来把这个地方全都毁了。
//
//		Juanita： 显然我没有从我们的系统中找到这个死者家庭留下的任何信息。我会回到卧室去去找找有没有什么能报告的东西。
//
//		Juanita： 其他房间里除了死者的照片没有什么值得注意的，我们已经在系统里存了这些照片，但是二楼的最后一个房间被堵住了。我觉得里面关着什么东西…
//
//		[可以听到摸索的声音。可以听到门被踢开的低沉声音。可以听到很大的磨擦声。]
//
//		Juanita： 那是… [愤怒地] 这玩意真大…
//
//		[可以听到接近录音设备的脚步声]
//
//		Juanita： 一扇被打碎的窗户？等等…有什么东西袭击了这个家庭？
//
//		Juanita： 没事…不用担心太多，对吧，Juanita？不用想太多…
//
//		Juanita： 这里的味道真难闻…那块污渍是什么？
//
//		[门慢慢地吱吱作响，可以听到纤细的咆哮]
//
//		[记录结束]
//				
//				[可以听到奔跑的声音，伴随着沉重的呼吸。从远处传来，奔跑的声音越来越大]
//
//						[可以听到砰的一声巨响。 可以听到脚步声和喘息声。]
//
//						[可以听到一声巨大到撕裂声。有东西咆哮着回应。撕裂声继续。]
//
//						[可以听到挣扎声。最后一声撕裂声，挣扎停止了]
//
//						[记录结束]
//
//
//在求救信号发出将近20分钟后，Daga发现了 Juanita和Tala，她们全身颤抖，但只受了轻伤。 Juanita的设备在撞击时损坏了，可能是在我们发现的最后一个恢复日志被自动从设备发送到我们的系统之后。 Tala在丛林中发现了这个家庭的遗骸，她走得越深，我们到跟踪设备受到的干扰越大。
//不管是什么袭击了Juanita，她杀死的是一只猎犬。我们在项圈上发现了一个标签，上面写着Sunny。我相信这将为你提供一个关于层级影响的良好理论。
//- Gani
//
//入口和出口:
//入口
//进入Level 37的小屋，盯着墙，然后转身，你会来到Level 62。
//出口
//在森林中停留一星期后你会被送到Level -4。
//进入小屋，用从 Level 37进入这里的同样方法会把你送到 Level 4或Level 10。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl62{}