package lvls0;
//Level 63
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//Clouds
//从冥想点拍摄的Level 63天空的照片。
//
//描述：
//Level 63是一片广阔的天空，天空上架构着几座稀疏的木桥和平台。它们以未知的方式悬挂在虚空上，延伸到整个层级的长度。桥梁由坚硬的橡木制成，它们在水平面上形成了一个密集的路径网络，构成通道的其他结构还有由橡木制成的云梯、栏杆，在某些情况下，还有单杠，它们都悬挂在虚空上。
//
//一堵巨大的、绿色的、藤蔓状结构的墙壁从虚空中现身，一直延伸到Level 63可见的顶部。它们远离层级的路径，使得任何流浪者都无法接近它们。墙壁不断移动，形成精致的图案，并在几分钟内重组。藤蔓的成分目前尚不清楚，但一般认为与此层之外的普通藤蔓相同。
//
//由于各种原因，Level 63被认为在虚空中非常高。该层级的大气压略低于常规的 1atm，尽管Level 63的一般温度保持在恒定的 18°C (64.4°F)1。
//
//Level 63拥有一个有趣的特性是它奇怪的昼夜循环。虽然层级始终处于白天，但太阳仍然不断地在层级周围移动，就好像它在正常的一天中循环一样。尚不清楚在没有太阳的时期如何保持日光。
//
//除了藤蔓墙以外，这个层级完全没有任何实体。正因为如此，在层级中唯一能听到的声音是偶尔的风声，木桥的咯吱声，如果离藤蔓足够近的话，还有藤蔓的摩擦声。意外在Level 63也很少见:虽然桥梁经常看起来畸形且构造不佳，但很少有流浪者报告表明它们确实发生了故障。桥梁在很少的情况下确实发生了故障，（通过与流浪者互动——桥梁不会自行破裂)，掉入Level 63的深渊也不会致命，因为在Level 63跌落只会把你带到另一个层级。 （见入口和出口）
//
//如前所述，由于没有危险，Level 63已成为冥想和放松的好地方并享有盛誉。Level 63无危险实体、相对安全和整体和平性质使得流浪者在层级中感到轻松自在。
//
//冥想点
//在某些情况下，Level 63的路径会造成虚空中的孤立点，远离路径和藤蔓的任何其他部分。这些被称为冥想点。冥想点本身是圆形的木制平台，半径只有一米。在每个平台圆心都有一个长凳，它完全融入了木制平台。另外还注意到由于某种未知原因，冥想点附近的外部噪音略微变小，这使得它们比Level 63的其余部分更安静。
//
//冥想点因“冥想”这个在流浪者中最常见的用途而得名。冥想能发挥流浪者的噪音隔绝能力，流浪者感觉当所有外部刺激都得到缓解时，他们可以更好地专注思考自己和周围环境。他们还报道了坐在长椅上的一种未经证实但高度合理的效果，流浪者声称坐在长椅上让他们对自己的情绪感到更自在，无论他们之前的状态如何，都能让他们思考更复杂的事情。
//
//这一切都使得冥想点在Level 63中备受追捧，并吸引了更多流浪者在此层级。这导致一些人试图从Level 63及其性质中获利（尤其是 The B.N.T.G.（后室不结盟贸易团队）），但所有的尝试都被 The M.E.G. 的官员阻止并将Level 63保持为所有人都能体验的中立区域。
//
//基地、社区和前哨
//由于Level 63的性质，已确定任何定居点都会减损其性质。因此，集体同意Level 63将保持无人居住。
//
//入口和出口：
//入口：
//偶尔，旧橡木门会随机出现在 Level 797 内部的一些自然形成的墙壁上。进入它们将把您送到Level 63。
//有时，“切入” Level 39 的山丘会到达Level 63。
//在 Level 11 中穿过一些灌木丛偶尔会带你到Level 63。这比前面提到的入口几率要少得多。*
//退出：
//离开Level 63的唯一方法就是掉入虚空。无论您是意外的还是故意的，所有可能在您跌倒时阻碍您的路径都将开始移开，在此期间您会无意识的坠落，醒来您会发现自己处于安全层级（在大多数情况下，您将被传送到本质上与Level 63相似的层级，例如前面提到的 Level 797、Level 39和其他此类自然 层级2。）
//这里是作者（们)
//« Level 62 | Level 63 | Level 64 »
//
//Footnotes
//1. 由于云是在这个温度下形成的，而不是在前厅的 1°C ，因此人们认为构成它们的液体与水完全不同。
//2. 自然 层级为大部分是生物群系的层级。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl63{}