package lvls0;
//Level 69
// 
//
//生存难度：
// 
// 
// 
//Level 69是后室的第70层：一条被浓雾和黑暗所笼罩的，无限延伸的废弃高速公路。任何进入该层的人员须停留在他们开始时所的乘坐的汽车上，否则即死。
//
//注意：不容忍任何对于本层级数字的玩笑。这提醒对于某些表现的像12岁小孩的读者很重要，谢谢。
//
//描述：
//该层级是一条无限延伸的高速公路，两侧竖立着高大、受风化的混凝土墙。似乎已经废弃多时了；公路上杳无人烟，没有其他车辆或者文明迹象，仅仅能确定这是一条高速公路。由于怪异的雾/霾围绕，你的视野会非常有限。正常情况下，你自己发出的光线就是唯一的光源。
//
//基地、前哨和社区：
//该层级没有已知的基地、前哨或社区。从未尝试过在该层建立永久性前哨，因为它的环境似乎完全不适合久居。
//
//出发和导航：
//Level 69的开始对每个人来说都是一样的，你会从之前Level 3的车辆上苏醒(关于这点请查阅出入口部分)。对于一些偶然进入Level 69的情况，如果你在进入时没有在某辆车里，你将在随机的车辆里苏醒。车辆将会随机放置在高速公路上，有时甚至处在翻转或倒置状态。
//
//不要离开你的车。你的车是你在Level 69最安全的地方。实际上它可能是该层级唯一安全的地方。车辆也是唯一使你免于实体和雾气威胁的地方。离开它是危险之举。如果你必须从车里出来，也要尽可能靠近它。
//
//Level 69里的雾气和多数实体似乎会不惜一切代价远离车辆。普遍认为Level 69的实体对车辆感到恐惧。未来可能会由于各种机密目的对该层实体在车辆附近所表现出的远离行为展开研究。
//
//允许访问.严禁在未经许可的情况下向公众发布以下信息，违者严惩。
//修正： 重大发现，在Level 69所有车辆的底部中央都发现了隐藏隔间，里面安装了一个奇怪的装置。装置呈厚重的三角形，具有类似玻璃碎片的特性。我们决定将这个装置称为“Fragment Of Destivinatia”，并在文档中记录为Object 69。选择该名称是因为它所具有的类玻璃特性，并从在发现它的插槽上刻的一个小标签上得到了这个名称。该装置似乎可以使所连接车辆排斥实体和雾气。将其从插槽中取出会使这种影响消失。如果你身处不安全的位置，不建议拆除它；否则拆除后雾气和实体会立刻向你靠近。该装置目前不能在Level 69以外的地方使用，但为此正在进行实验研究，以使它在其他层级发挥作用。
//
//当你苏醒时，你的车有可能处于令人满意的状况。但车辆的空调、中控台、车窗、车灯等也有可能损坏或不能运转。这一切都取决于运气。如果你一开始就因为车辆的某个重要部件损坏而身陷囹圄，上帝保佑你。
//
//驾驶你的车辆应该不难。操作将会使你非常熟悉，因为它们几乎和前厅中的车辆完全相同。不必担心燃料问题：该层中的车辆不需要任何燃料。实际上它们似乎都没有油箱。其余的内部工作原理也是抽象的，所起到的功能目前正在研究中。奇怪的是，在该层高速行驶并不十分危险。遭遇固态物体、实体或其他人驾驶的车辆的情况如此罕见，以至于你无需担心撞车的问题，你大可以保持最高速度行驶数小时、数天、数周甚至更长时间。不幸的是，如果你真的撞上了什么，仍然有很大概率导致死亡。你要么用大量时间来小心行驶，要么冒一定风险来高速行进。由于补给品稀少，你需要尽快抵达出口，否则有被饿死或其他的风险，但高速驾驶是有风险的。
//
//实体
//普通实体
//在Level 69有很低可能会遭遇笑魇或悲尸。两者都比正常情况下更富有敌意。对于笑魇来说，这是因为它们在Level 69很少找到猎物。对于悲尸，这里的它们几乎达到了一个新的危险等级，因为在如此漫长的时间里，它们无法透过黑暗和雾气看到任何东西。不要把车停太久，否则两者之一有可能发现你，并进入你的车里。因为雾气阻碍了视野，你也有可能会撞上它们，而这实际上是它们游荡于Level 69所产生的最大危险。
//
//"来自上方的存在"
//这是迄今为止在Level 69发现的最神秘且危险的实体。它们是你不应离开车辆的主要原因。关于它们的描述称它们是某种附肢，看起来类似于蜘蛛或螃蟹的腿。它们在正常情况下是不可见的，但当人员离开他们的车辆时，许多该实体便会迅速且无声地从上方的黑暗中探出。如果目标人员没有尽快返回车辆或是到达某个安全的地方，他们就会被抓住或者被其刺穿身体，然后被提起到上方的虚空中。被掳走人员的下落不明。它们极其强大，少数被这种实体抓住而幸存的人员将其描述为“冰冷、光滑、极度坚固”。所有想要击杀这些“来自上方的存在”的尝试全部失败了。它们似乎可以抵抗所有种类的攻击，甚至包括枪械和爆炸物。没有目击过这种实体的死亡，关于他们的记录很少。千万不要冒险与之交流。
//
//"耳语"
//尽管没有被证实是否真实存在，但在Level 69经常遭遇“耳语”。它们是烦扰的、消极的、试图消磨人员精神状态的某种想法。这些想法已被证实不是人员自己产生的，因为同样的想法在一个区域内的所有人员脑海中同时播放。关于“耳语”的遭遇经验记录显示其与Mockers有相似之处。有时来自“耳语”的想法与Mockers所说的语句完全相同。“耳语”和Mockers之间的任何可能的关系都没有得到证实。
//
//入口和出口
//入口
//最常见的Level 69入口在Level 3。极少数情况下，可以找到一扇无标记的门，由此进入一间八角形的小房间。房间里除了奇怪地停了一辆车之外，没有其他物体。这些车辆从何而来，又是怎样被放进房间里的，我们不得而知(由于房门的尺寸，车辆不可能通过，而且房间也没有其他入口)。车辆型号各异，但没有一辆是已知的品牌或型号。当人员进入车辆后，他们会感到晕眩，呆在车里几分钟内就会失去意识。在车内所有人失去意识7秒后，车辆和人员都会从Level 3凭空消失，不留任何痕迹。他们被传送至Level 69，在之前所在的车辆里苏醒，和之前车里所携带的任何东西一并到达。
//
//另一种已证实的进入方法在Level 6，Level 8，Level 23，和Level 33 (在该层的极端腐化状态下，至少500英里内)。这种进入方式通常是偶然发生的，没有已知原因；人员只是简单地穿过了地板，就好像它不存在一样，然后消失，瞬间失去知觉。同样的，他们会在Level 69的随机某辆车内苏醒。
//
//已经有六人报告称，人员在喝完杏仁水后突然消失，抵达Level 69。这些报告目前正在调查中。
//
//出口
//如果你行驶的时间足够长，很容易找到该层最常见的出口。尽管通常需要长时间旅行才能找到这种出口，但只要你时刻注意，就很容易找到。这种出口是一条垂直于高速公路的违和的隧道。很容易发现，除非你开车太靠近高速公路的中间，或者没有关注你的周围环境。一旦你进入，你必须在隧道内行驶约17个小时。这条隧道是一条单车道通道，是完全安全的。你会发现雾气慢慢消散，隧道顶上的灯开始亮起。当你到达17个小时的标志时，你的车将开始出现故障，直到它无法行进。在它停下后，试图驾驶它将导致汽车起火并有可能引发爆炸。你不得不徒步走完剩下的路，走出隧道。这条隧道通向Level 11。一旦你离开隧道，就不要再试图返回；这样尝试过的人员都没有再回来。这条隧道在你走出后，一经离开你的视线就会消失。
//
//另一个出口是直接从高速公路一侧的混凝土墙中切出。这并不容易做到，而且会浪费了大量去寻找常见出口的时间。如果你真的成功了，你会出现在Level 22，你的车停在其中一个停车位上。同样的，你的车这时已无法驾驶。有传言说，有人在不坐车的情况下通过其中一面墙切出，最后出现在Level 4，但这个说法目前被认为只是传言。
//
//最后一个未经证实的出口是，你在被 "来自上方的存在"掳走后会失去意识，然后醒来时会回到Level 0。有多人声称以这种方式退出该层，尽管他们当时都处在昏迷状态，没有证据。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl69{}