package lvls0;
//Level 67
// 
//
//生存难度：
//等级 2
//
// 
// 
// 
//97dbb8ef-5112-4462-8d92-ff8aaa302217.jpg
//一张摆放在 柜台 旁展示长柜里的面点的照片。
//
//Level 67 是后室的第68层。其由一个在Level 11顺着烤面包香气的流浪者发现并进入。
//
//描述：
//Level 67是一个拥有1980 年代设计外观的烘焙店。不像大多数其他层级一样拥有无尽的空间大小，此层级面积仅有大约2300平方英尺（约为213.68平方米），即和一般烘焙店的大小相当。烘焙店内部会按照探索者的颜色喜好来改变其主题色，且会依照探索者的个人喜好来决定室内装潢（如最喜欢的植物，任何可以播放探索者喜欢的音乐的设备，和散发出令人喜悦香气的香薰机，等等）。有少数几个哥伦比亚面具 和 狐狸面具被发现在烘焙店的墙上挂着，但只要不要靠得太近，就不大要紧。由于在烘焙店内没有可以显示其店名的物品，一些来到这里的流浪者将此层级（即此烘焙店）称为“欲望烘焙坊”，亦称为“Αρτοποιείο Desire1”。在此层级有三个区域会遭遇事件。
//
//等候区: 等候区 , 正如其名，是顾客们等待下单的地方。有少数进入等候区排队点单的是流浪者，但在实际在排队的多是在Level 11效应影响下的无面灵。有时，在这里排队的实体会比较少，但需要很长的时间才能轮到排在后面的人或实体走到队伍的前段。在这种时候，排队的人会觉得有必要插队，或者抱怨、推搡前面的人或实体，无论前面的是谁。如果在前面的是一位探索者，那么除非他被这样的行为激怒，进而选择给排在后面那位一点颜色看看，否则什么也不会发生。但如果在前面排着的是无面灵，那么它们将会回到它们的默认状态，并开始对探索者展开攻击。这样的一时气血上脑之举可能会以更大的流血事件收场，所以推荐流浪者们保持耐心，直到轮到其到柜台点单。
//
//柜台：当队排完队轮到自己的时候，会在柜台处进行点单。在这里，一个无面的烘焙店接待员会帮你下单。流浪者可以柜台旁摆放的一列烘焙面点中指出想要买的任何一种，随后接待会帮你拿取。我们了解到接待几乎总是会向买家推荐买一份最合买家口味的面点，如果可以的话，请拒绝它。如果点单时想得太久，会让您后面的无面灵开始变得烦躁易怒，最终可能演变为暴力冲突。所以最好在排队之前就想好该买什么，这样的事就可以轻易地被避免。请注意在有些时候，在此层级的流浪者的那种“想要大吃特吃那些我最想吃的品类”的欲望可能会导致其行为异常，进而会试图不排队直接在柜台处拿取面点。此时，不要试着去干预他的行为；他们在此事件后很快被处理。一旦探索者选好了要买的糕点，他会和接待一起前去进行结账。虽然价格并非一成不变，但一般一瓶杏仁水就可以用来抵付任何你想要买的东西了。在此之后，可以选择离开这一层级，或前往用餐区用餐。
//
//用餐区： 就像人们期望的那样，用餐区是流浪者们在买好面点后前往用餐的地方。注意，此区域可能仅在你于柜台处买好并拿到东西后才可进入。无面灵也可以进入此区域，但不会伤害探索者除非探索者主动挑起事端。在此区域游览是十分安全的，且这里有足够的空间用来建一个前哨站。然而，在这样的安全环境下，仍有一种可能会造成伤害的东西，那就是面点本身。
//
//欲望烘焙坊：
//与Level 226相似，每种面点都会对食用者造成特定的影响。然而，不像Level 226，面点造成的影响因人而异，若在没有具体学习面点的效果之前就不幸的加入了排队队列，购物时请务必谨慎小心。
//
//最喜欢的面点：被流浪者认为是最喜欢的面点被确定是最致命的。当与该种面点的距离少于1英尺时，一种不可抗拒的想要吃掉这份美味的冲动会占据这位流浪者的脑海。请保持警惕，保持对这种冲动的抗拒是十分紧要的。若一旦该面点被食用，可能导致的症状如下：
//最开始的五分钟：喉咙发炎红肿。
//第十分钟：胃炎。
//第二十分钟：红皮病（erythroderma）。
//第二十分钟后：呼吸困难，最终心脏衰竭。
//一旦受害者死亡，一位工作人员会从柜台里出来，随后把尸体拖到员工后台，调查显示店员和尸体会直接消失于入口处，且去向未知。
//
//一般喜好的面点：这是最安全的选择。一般喜好的面点指那些流浪者本人不喜欢也不介意的面点。因此，流浪者不会有想要立马吃掉的冲动，且吃完也不会有任何负面或正面效果。因此，若吃面点的目的仅是消除饥饿，那么这是最好的选择。然而，因为该层级的大气可以加强人们的渴望感，这样的中性面点很少。2
//最不喜欢或讨厌的面点：以往的证据表明，这种面点也是最安全的选择之一；但是，在这种面点的自带效果的影响下，流浪者会确信此面点的味道，外观，气味比其应有的还要糟糕。有些人报告说他们从中闻到了腐烂生肉的气味。因此，哪怕不去刻意想都需要顽强的意志，遑论吃下它了。强忍着食用后，会将食用它的人传送到其他安全的层级，且有少量的治疗效果：
//一分钟后：传送到Level 11，Level 31，Level 57，Level 98中的一层.
//五分钟后：中等程度的腹泻，眩晕。
//十分钟后：喷射式呕吐伴有类似轻症流感的症状。
//一定要记住，尽管食用后影响非常痛苦，许多旅行者还是会在2-3天内康复。因为这种便利的跨层级交通方法的优势（该效果从未触发失败），流浪者们应带几份这样的面点在身上，以便在危急关头使用。但告诫如下：在食用了某种讨厌的面点后，这种面点可能不再被视为讨厌的或不喜欢的，相反会被视为“被渴望的”。因此，上文中的效果消失并转移到其他种类的面点上。所以，为了克服这种现象，请携带多种你不喜欢的面点备用。
//
//过期的/含有效过敏原的面点：请注意，把这一类面点与最不喜欢或讨厌的面点相混淆是较易发生的。任何对此种类面点的食用尝试都会导致严重的急性肠胃炎，食物中毒，呕吐（甚至发展到呕吐物含血），极端严重的腹泻乃至最坏的情况：死亡。食用此类面点 不会 将人传送到任何其他层级，也不会消解饥饿或促进恢复健康。因此了解食用者的身体状况和在食用前逐个检查面点的状况是很重要的。
//基地、前哨和社区
//这里没有任何基地或前哨，然而这里有被大多数流浪者称为 "常客"的人。他们看上去像是各来自于不同的时代，且没有发现他们有一起聚集的想法。
//
//杰里和可可:
//两人互为彼此亲近的朋友，皆为女性，均来自于上世纪30年代晚期到40年代早期。两人平时都十分内敛寡言，神神秘秘。但是，较矮的那一位似乎更愿意给离开此层级的人做指引。尤记在心，不要激怒她们，她们十分擅长格斗。她们俩在腰间挂着狐狸面具和化妆舞会用的假面；尽管这些面具属不属于墙上的面具尚且未知。
//
//童年挚友:
//指一位娇小的女人（可能快奔三了）和一位相比老的多的女人（五十五岁左右）。她们可以在烘焙店的远后方被找到。她们都是在上世纪80年代来到这里的。这两位会尽可能地在你走近她们后尝试帮助你，像给予你一些供给（如果十分好运的话，会给予你磨损的布袋），和尽可能向你回答她们可以给出答案的问题。此外，请留意，较年轻的那一位据说经常谈论能够让流浪者们离开后室的“魔法”，但此消息为传言，尚未被证实。
//
//入口和出口：
//入口
//顺着在 Level 11的烤面包香气会最终把人引到Level 67.
//有时，在Level 122游荡的时候会找到来这里的入口。.
//把Level 226外部的食物放在一个意大利面盘子里后再拿起食用，会直接把人传送到烘焙店内部。
//出口
//食用一份最不喜欢或讨厌的面点可能会将人领至Level 11，Level 31, Level 57, 或 Level 98.
//直接离开店面会把人领回要么Level 11或 Level 122.
//当向杰里问询出口时，她会把人领向员工后台，随后其会被送到Level98.
//找到一本标题是《起源》的书并携带之走出入口会引向Level 153的外部。
//
//
//
//
//
//
//
//
//
//
//
//
//你想要故事以怎样的顺序发生呢？
//是苦寻柏油，还是甜香馥郁？
//当消泯完美，了却欲望之时，
//匿于假面之后，御于狱火之中。
//
//作者和译者
//« Level 66 | Level 67 | Level 68 »
//
//Footnotes
//1. 读作：“阿尔托皮耶奥 desire”。Αρτοποιείο在希腊语里意为面包店。——译者注
//2. 加强人们的渴望感，应是指人们由于对特定种类食物的渴望更加极化和强烈，从而更容易对各种类食物产生明显好恶。——译者注


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl67{}