package lvls0;
//Level 68
// 
//
//生存难度：
//等级 3
//
// 
// 
// 
//theater
//Level 68其中一间房间的照片。本照片由一名已注销账号的未知用户拍摄。
//
//Level 68是后室的第69层。其为一巨大的电影院；建筑像是美国东北部地区使用的风格。Level 68中的物品本质上都是生物性的，真菌的生长遍布此处。
//
//描述：
//Level 68的物理外观像是一巨大的影院建筑；具有延伸极长的走廊，走廊两侧的门各通向不同的房间。这些房间中放置有一排排座椅，每排各具不同的数量和造型；不过，它们始终是红色的，粘液状的物质覆盖在其表面。尽管存在这些异常且整体令人反感的特点，但人们通常还是会倾向于坐在距他们最近的座椅上，这通常被描述为异常舒适。
//
//一旦房间中的所有个体都已入座，这些座椅将释放一种会快速液化并再固化人体组织与布料的化学酶；这通常会最终使个体与座椅融为一体，使得一个人不可能再凭一己之力从上面离开；不过由于这些座椅对人类精神的影响，人们通常不会想起离开座椅这件事。
//
//一旦这一进程完成，在房间中的大荧幕上将会开始播放电影。不同房间播放的影像各不相同，而且不是任何后室外存在的电影。这些电影通常本质上只是一些图像；虽然人们在观看这些视频时通常不会做出排斥或厌恶的反应，但这可能意味着这些视频具有催眠作用。
//
//一旦电影结束，观看它的人将在死于休克前被暴力地抓住。此后，他们的身体将被消化酶破坏，被座椅吸收，而残余物或许会被转移到Level 68的其他部分。鉴于此，并不建议身处Level 68的人进入这些房间。
//
//基地、前哨和社区：
//目前为止，在Level 68; 中并未找到人类基地；不过一些画作和文字使人们相信一些团体或许位于本层中某个未被发现的地方。
//
//入口和出口：
//入口
//Level 68可从Level 67切入。
//
//出口
//离开Level 68唯一已知的方法是穿过一系列金属门。它们会在一个人专注地思考自己最喜欢的电影或其他类似的传媒形式时自动出现。通过这些门将来到Level 69。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl68{}