package lvls0;
//Level 60
// 
//
//生存难度：
//等级 5
//
// 
// 
// 
//Level148Preview.png
//远处的一只笑魇。拍摄于上层区域。
//
//Level 60 是后室的第61层，该层级位于室外，靠近一处海湾。
//
//描述
//Level 60 是分段式的层级，外形似为一条海湾旁的混凝土步道。步道看起来像刚完工不久，且被“精心维护”。虽然层级中有路灯可提供照明，但这些路灯多数似乎已经损坏或被关闭。建议在步道上行走的流浪者们保持警惕，因为此处有很多敌对实体。Level 60 中没有昼夜循环，大部分区域都处于黑暗中。流浪者们应尽力避免进入 Level 60 的上层区域，以免遭遇敌对实体（多为笑魇）。该层级由 Alphmoan Dextra 在2020年9月发现，此人是“英勇者”的一员。他在 Level 85 中溺死后进入了该层级。此人精通武功，这一技能在他初探该层级时派上了用场。M.E.G. 在收到他的报告后，又派出9名各有专长的人前去陪同。
//
//尽管该层级内环境黑暗，它的异常特性却会让其中的流浪者忽视附近潜伏着的大量笑魇，感到“放松”、“平静”，在流浪者们开始关注起海湾吹来的微风时，这种现象就很容易发生。有人认为这种现象是该层级的一个陷阱，专门用来让人放松警惕，陷入被实体攻击的危险中。这种效应被命名为“无痛死亡”。
//
//在英勇者的帮助下，M.E.G. 调查、确认了该层级的出生点1。结果显示，只要在任意含有海洋的层级中“溺死”，就会出现在该层级的“海”中。
//
//层级分段
//上层区域
//
//第一段 - 上层区域
//The%20Upper%20Area.jfif
//上层区域。
//
//此处是 Level 60 的主要区域，由一条竣工不久，且被“精心维护”的混凝土步道组成。这里的路灯大都无法运作2，因此环境十分黑暗，想看清或穿越这里都很难办。若想存活下去，在进入该层级时就应携带合适的装备。海湾的上层区域是该层级中最危险的区域，这里没有食物和水的供给，且存在不少敌对实体。其中，笑魇最常出没于这里的黑暗区域。
//
//此外，“无痛死亡”效应在此处的影响也最强烈，试图穿越上层区域的流浪者们总是会被这一现象影响，因此，建议流浪者们组队进入这里，以防在受到影响时无人帮你摆脱3。在上层区域找到向下的台阶就可抵达相对安全的下层区域。
//
//由于存在路灯，这里盘踞着大量笑魇，这些实体会被光源吸引。
//
//下层区域
//
//第二段 - 下层区域
//The%20Lower%20Area.jfif
//下层区域。
//
//下层区域是指混凝土海湾步道旁的一条土路。来到该层级的流浪者们站起来4并踏上土地后就会抵达这里。在“海”上出现的流浪者们最后通常会在此处相遇。
//
//Level 60 的这一段位于主要区域的下方。这一区域相对较小，散落着各种物件和工程机械的组件。下层区域的路径走向和上层区域一致，但它表面则是由泥土覆盖，这一区域的施工还未完成，没有防止人们掉入“海”中的栏杆。在步道上层区域的两侧，有台阶可供进入这里，各组台阶平均间隔 100 米，均可安全使用。此外，步道上台阶旁的路灯都是可以正常运作的。流浪者们最好留在下层区域以保证自身安全并为探索层级做好准备。直接去往上层区域无异于自杀，请务必保持耐心，你的生命安全十分重要5。
//
//被称作英勇者的组织主要在此处居住。他们会利用这里散落的各种物品打造躲藏据点、制作防卫武器等等。组织成员均接受过正规训练，能够在该层级的危险环境中进行战斗、保护自己。
//
//在 Alphmoan Dextra 发现该层级后，M.E.G. 便委派英勇者组织前去观测、调查。经过一个月的调查后，该组织确认了下层区域总体的安全性：资源较多，位置安全，实体较少6。组织成员之后清理了部分区域，并合理使用了散落的物品、器械，以进一步保证此区域的安全性。后来，成员们决定自称英勇者，因为他们留在 Level 60 的目的便是保护、帮助来到此地的流浪者们。
//
//层级特有事物
//“无痛死亡”
//Level 60 中的死亡事件多是由“无痛死亡”造成的，这是 Level 60 中独有的奇特现象。当流浪者专注于海风时，该现象就会发生。此处的海风会导致流浪者们感到放松、镇静，在层级内的时间越长，这种感受就会越强烈。这种现象只有在流浪者们感到焦虑、担忧、害怕、绝望时才会起效。虽然这种效应持续时间极长，无法自行消退，但只要遵循“指南”中所写内容，流浪者可以凭自己或在他人帮助下及时脱离这种效应。这种效应的影响会随时间不断增强，建议流浪者们随时牢记“指南”内容。
//
//虽然 Alphmoan Dextra 起初并未发现这种现象，但是有不少人在来到该层级后报告了这一效应。至今已有 10 人因为这种现象而死去7。Alphmoan Dextra 已向英勇者提议，如果看出有人被这种效应影响，要尽快解救他们，他还向 M.E.G. 基地保证他们一定会营救、帮助受害者们，即使这样会导致受伤甚至死亡。
//
//指南
//如果你在该层级中感到乐观，请立即回想其中潜藏的危险。
//如果你感觉海风有所变化，请不要留意，继续前进。
//不要陷入沉思、冥想。
//如果你看到其他流浪者表现得很积极，无须犹豫，请立即帮他脱困。
//帮人脱困的方式有多种，但最常用的是打耳光。
//“海”
//M.E.G. 同英勇者一同测定了“海”的成分和特性。结果显示，Level 60 中的“海”和前厅中的海洋成分一致。不同的是，“海”中的水会不断变化，有时会表现出“门”的特性，有时会完全退去，只留下赤裸的海岸8。经测量，在状态正常时，水的深度为4英尺（约1.22米）。然而，由于实体存在，英勇者无法继续测量其他区域的精确水深。
//
//“海”的特性异常，不建议流浪者们涉足水中或于水褪去时在海岸附近行动9。目前，已确认至少七人曾因被笑魇追赶而不得已进入水中躲藏。据相关报告所称，其中两人最终进入了 Level 7，一人侥幸回到了下层区域。其余四人被发现时已在水中死亡。这四人的死因当时未被查明，因为死者的身体上没有任何伤口、划痕。但后来英勇者在调查“海”时又发现了它的新特性，这一特性或为四人的死因。
//
//下文列出英勇者整理出的“海”的四种状态：
//
//“海”的状态
//状态一：“正常”
//- 海水的运动几乎与前厅一致。
//- 安全。
//- 不会产生危害。
//- 深约 4 英尺。
//- 是 Level 60 的唯一入口。
//
//状态二：“门”
//- 该状态下，“海”的样子还是一样的，但其中的水却表现异常。与之接触的人会被拖拽。
//- 安全性仍需要观测。
//- 有潜在威胁，因为：
//- 其中的人会被送往含有海水的层级，主要是 Level 7。
//- 深度未知。
//
//状态三：“低潮”
//- 海水完全退去，其下陆地暴露无遗。
//- 沙子呈现黑色，但不造成任何危害。
//- 可以走入其中，但可能会遭遇笑魇，因此不建议这样做。
//- “无痛死亡”现象不再发生。
//- 这一状态一般会随机出现。
//
//状态四：“大洋”
//- “海”的深度在该状态下接近地球上的深海、大洋。
//- 海浪较为缓和。
//- 不安全，其中的水流会造成溺毙。
//- 估测水深约 12270 英尺（3740米）。
//- 该状态下的水会怪异地向下流动，在其中会因此被拖入水中溺死。
//- 该状态曾造成四人死亡，他们当时为逃离笑魇而下水躲避。
//
//——英勇者
//
//基地、前哨和社区
//英勇者
//该组织由约 10 人组成。
//其任务是引导、协助有困难的流浪者。
//该组织没有领导者。
//组织成员对外来者友好，愿意与他人交易，但由于层级较为危险，他们多数时间会保持隐蔽。
//该组织会频繁清理下层区域，以便流浪者们能更安全地进行探索准备工作。
//组织成员每周向 M.E.G. 报告 Level 60 相关情况。
//由于该层级较为危险，组织成员们常会变换自己的根据地，然而，他们不会太过深入层级，因为层级深处的信号强度会不断下降。
//
//入口与出口
//入口
//在其他有海洋的层级溺毙会使你出现在“状态一”下的“海”中。
//
//出口
//跳入处于“状态二”的“海”，就有机会到达 Level 7。有种假说称，如果在 Level 60 的上层区域睡着，就会在 Level 61 中醒来。该假说未经证实，不建议如此尝试，以免被敌对实体攻击。
//
//作者信息
//« Level 59 | Level 60 | Level 61 »
//
//Footnotes
//1. 即流浪者们进入此层级时的所在位置。
//2. 因为笑魇在频繁的攻击中总会不小心将其损坏。
//3. 即，治愈“无痛死亡”的状态。
//4. 即，从水中站起，尤其是从该层级的“海”中。
//5. 由于该层级的特性和环境十分危险，当需要探索时，存活是第一要务。
//6. 因为实体们多聚集于上层区域。
//7. “无痛死亡”效应的影响下，这些人会表现得异常乐观，不会在意追逐他们的大批笑魇。
//8. 在“低潮”时容易发生。
//9. 因为可能会被笑魇攻击。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl60{}