package lvls0;
//Level 71
//
//EagleSD.png
//M.E.G. - 为了人类的明天
//
//生存难度：
//等级 2
//
// 
// 
// 
//Level 71 是后室的第72层。看起来像是一个巨大的，大部分区域未完工的地下室。
//
//在加载数据时出现 1 个错误. 错误：0071. 请与 描述 和 团体 界面进行互动来重新载入数据
//
//
//
//重新加载成功.
//入口和出口:
//入口：
//在 Level 4找到一个地下室会让你通向 Level 71。 进入后入口便将旋即关闭。
//
//出口:
//
//
//
//有人吗?
//
//
// 
//
//这里好暗…
//
//好冷…
// 
//
//我在哪?
// 
//
//我还活着吗?
//
//为什么我还在这里。
//
//我已经感觉不到我的…
//
//手臂了…
//
//我身体的一侧…
// 
//
//我还可以走路…
//
//但…
//
//
//
//他们消失了…遁入了虚无…
//
//为什么?
//
//
//你…
//
//你是谁?
//
//
//我是谁?
//
//我想我在这里…
//
// 
//
//
// 
//
//我明白… 我将至的命运了…
//
//
// 
//
//我正消泯于逝年
//
//会在暗影中恒念.
//
//那鲸吞光芒的灰.
//
//
// 
//
//为什么?
//
//
// 
//
//我错了么?
//
// 
//
//
//不.
//
//我被困…..消散归于虚无.
//
//…
//
//
//
//层叠纷繁的现实在我之上坍缩。
//
//像叠衣服那样，那样轻盈地裹在温暖寒ۣۣۣۣۣۣۣ҈࿅҉o҉͙͓̯͙̫̩̈́̒͋̒ͅͅl̵̽͐̒̂̐̑̆҈冷ۣۣ҈l̵̰͚̗͓͙̰͕̜̦̦̽͐̒̂̐̑̆̽́̐̄̉里的悲伤。.
//
// 
// 
//
//随风消散…
//
// 
// 
//
//Level-71.png
//救҉救҉我!
//
//于万物中…
//
// 
// 
//
//灰尘… 沙砾…
//
//
//我是那…
//
// 
// 
//
//消散在d̴̮̩̭̤͚̣̠̮͉̬͚̜̓̄̂͆̿̈́̀͂̈́͊̑̿́̔̍̚影҉d̴̮̩̭̤͚̣̠̮͉̬͚̜̓̄̂͆̿̈́̀͂̈́͊̑̿́̔̍̚a̸̙̪̩̮̪͕̲̳͖̦͚̜͖̫̪͎̦͛̉̀͒͊̌̋̓̀̑͒͂̎̐̑r҉̱̬̲̘̘͕̯͓̟̱̳̪̦̗̤͙͉͙̘͍̜̔̏̏̾͒͋͌̇̽̅̒͋̇̇͒͛̃̈́͊̈́́ͅk҈͙͙̙͓͉͓͕̳̬̱͑͒͌̔͆̒̋̀̄̉̑̏ͅ҈中҈҈.̶̢͈̺̪̪̰̄的҈
//
//一҉࿈抹҉҈g҉̦̳͙̳͙̟̍́̓̐̏́̏̾̚暗҉y̴͈̮͕̩̰̬͍͙͈͗̌̌͒̀̓̔̍̅̈̔̓̊͆̎̀͆͋͋̍̐̍҈灰҈҈e̷̗̠̰̮͖͕͗͂̇̔y̴͔͈̙̫̱̙̙͋͆̐̄́͑͂..
//
//
//我没法呼吸…
//
// 
//
//
//我在消失… 在消逝… ҈救҈҈h̶̲̬͙̬̮̠̞̦͚͈̑̏͋̂͌̊̈ȅ̴͔͈̝̪͐̑̓̌̈̏̾̚ͅ҈命҈p҉̗͎͕͉̣͓͕̪̰̠̩̌̿̑͐̄̓̓̊͗͋ͅ!̵̭̜̣̜̋͌̈́̎̒
//
//
//为什么…
//
//
//为什么?
//
//为什么是我?
//
//
// 
//
//为什么!?
//
//
//g̶̢̠̭̟̤͋͑̒͒̕҉结҉o̸̘̰̭̪̟̦̟̫͙̗̬̟͍͖̝̦̿͐͒̈́̀̅́̈́̎͂̆̓̾҉༈束҉n̸͈̳̠̟̦͔̲͎͔̈́̀́̀̑̋̄̄҉了҉n̸͈̳̠̟̦͔̲͎͔̈́̀́̀̑̋̄̄e̸̤̦͍̫̪̟͚͎̤̭͇͒̈͐͗̌̒̐̇ͅ…
//
// 
//
//文件已达最大容量：500MB
//重新载入中…
//文件受到污染且不存在.
//我们对给您造成的不便感到十分抱歉。请您向最近的M.E.G组织报告此错误 以保证我们信息库的信息安全。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl71{}