package lvls0;
//Level 79
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//7374995878_76bd7dc885_o.jpg
//Level 79的塔楼上一扇俯瞰麦田的窗户
//
//Level 79 是后室的第八十层。本层级包含一栋类似于瞭望塔的建筑物。
//
//描述：
//Level 79包含一片100米见方的草地，草地中间有一座瞭望塔。从建筑物外观察时，瞭望塔有两层并且距离地面有几米的高度。塔边有一组楼梯，可以用于进入瞭望塔本身。该场所状况良好，但似乎已有几年未被使用。
//
//建筑物中包括一座正常房屋应有的东西，在二楼有一间小厨房、客厅和卧室，在一楼有一间旱厕。二楼有多张可供睡眠的床垫。厨房的水龙头也是杏仁水的来源。
//
//从建筑物前约一百米处开始有一片麦田。该麦田无法抵达，因为麦田前的草地并非固体，任何前往麦田的尝试都会直接导致你穿过地面落入虚空。过一会儿后，你将在一楼再次醒来。
//建筑物后是一片可用作出口的森林。
//
//实体似乎不会在该区域周围游荡，但在麦田上可以看到一些实体。它们出于某些原因无法注意到人类，因此无需担心。它们似乎是在Level 10中目击到的同种实体。但依旧建议你待在建筑物内部。
//
//背景故事与发现：
//在一楼，你可以看到墙上挂着一张男人的照片。他很可能是艾伦，一位和自己的房子一起卡进后室的人，目前居住在Level 53。他的房子大约为一般尺寸，意味着房子包括所有必要房间，但遗漏了一些非必要的房间。房子里没有供客人使用的房间，所以塔楼有可能被用作客人的休息场所。还有一点似乎也符合该事实，那就是Level 79是一个完美的100米正方形。这座塔有可能与艾伦的房子一起卡进了后室，并被遗弃了，因为塔楼的发现时间要比房子晚上许多。
//
//本层级由一位匿名人士意外发现，当时他选择在Level 11某座公园的草地上休息。过一会后，他被意外传送并发现自己身处建筑物一楼。 他在塔内探索了一会儿，最终通过他在附近散步时发现的长椅出口离开。在此之后，还有许多人曾冒险进入过这一层。
//
//基地，前哨站和社区：
//本层级没有已知的基地、前哨站或社区。
//
//额外内容：
//考虑到二楼的许多床垫，小型社区的存在是可能的。
//本层级是后室中最小的层级之一，卡出边界在塔楼的100米范围内。
//本层级也是后室中最和平的层级之一，在建筑物附近不存在实体。
//本层级可用作在层级间移动时的快速休息场所。
//入口和出口
//入口
//你可以从Level 9 进入，方法是找到一个草场，躺下大约5分钟，然后你就会被传送到本层级。你也可以在Level 11 通过找到一座公园使用本方法。在Level 140不小心被树枝绊倒也可以把你送到本层级。你也可以和一座瞭望塔互动，它会随机出现在Level 37 或Level 62。考虑到Level 79的麦田可能是一个单向入口，据传也有可能从Level 10通过步行数百英里进入本层级。
//
//出口
//通过步行进入塔楼后的森林，你可以卡出地面，你将在Level 37醒来，而不是建筑物一楼。也可以在草地边缘找到一张长椅，它可能会被一棵树或一个灌木丛挡住。在长椅上坐上10分钟会把你送到Level 11。有人说通过看月亮有可能被传送到 Level 24，但不建议尝试，因为这个楼层尚待确认。如果你成功地从Level 10进入了本层级，你也可以尝试走进麦田，这可能会把你传送回去。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl79{}