package lvls0;
//Level 74
// 
//
//生存难度：
//
//等级 Ψ
//
//不安全
//不稳定
//精神危害
//stagefright.jpg
//在没有身影出现时Level 74的舞台。
//
//Level 74是后室的第75层。它是一个被循环走廊环绕的巨大舞台。
//
//描述：
//Level 74是一座剧院舞台。其下有二十排座位，每五排有一扇门通往走廊。门共计有八扇。通过两侧尽头的两组楼梯，本层的舞台十分容易进入。舞台地面具有地暖，其上有不同的活板门，开启后通往绝缘层。
//
//Level 74的走廊在视觉上与主观众席相似，有着砖墙和铺地砖地板。这些走廊十分宽敞，其内有各式爆米花机和海报。上述海报类似于嘉年华海报，每张上占主体的图片都是与似乎随机一个层级相关的画作。值得注意的是，那些图片中有一部分描绘的是目前尚未知晓的层级。这些走廊本身包含了楼梯、电梯，以及三分叉或四分叉路口。这些走廊都会循环并转回另一扇通往Level 74观众席的门。不过，这一现象并不是通过非欧几里得的方式完成的。相反，通常认为回到原处的事情是下意识完成的，一个人所做的每个选择都会慢慢将他们带回主区域。
//
//在进入后，本层中的座位将被人形的身影占据。这些个体都会与流浪者以前遇到过的某个具体人物相似。相似者可以是任何人，从家庭成员到仅仅擦肩而过的人都有可能。这些人都有简化的面部表情和动作，同时会一直注视着舞台。舞台起初将会挤满了其他身形模糊的人，他们都戴着白色面具。舞台上的身影会以特定的动作起舞，据信这些动作都与梦中所见的某一具体事物有关。例如，他们有时会在嘴边丢下碎纸来模拟牙齿从嘴里落下，表演摔倒和死亡，互相追逐，以及其他与梦有关的行为。
//
//一个人在本层停留越久的时间，它便会变得越危险。通过在本层停留约二小时的时间，座位上的所有人和身影都会突然消失。他们所发出的任何声音也与他们一同消失，造成突然的寂静，使Level 74中的任何来访者陷入疑惑。之后，被人监视的感觉会开始出现，同时墙后的噪音会开始变得清晰可闻。它们可能听上去像是实体在移动，金属滑动和嘎吱作响声，或是一阵来自本层外某处的一阵风。
//
//如果一个人在Level 74中停留了相当长的一段时间，这个人会看到各种特殊效应，比如墙壁在向他靠近，一排排座位无限延伸，声响变得更大，与此同时身影会在你的余光中出现。这些幻觉对那些目睹它们的人而言极为真实，但这些幻觉只不过是Level 74影响大脑产生的效果。
//
//基地，前哨和社区：
//本层没有已知的基地，前哨和社区。
//
//入口和出口：
//入口
//进入Level 74的入口会在Level 117中偶尔以红门的形式被发现。在Level 68中也有入口，这一层的走廊区域中的某些门中包含与Level 117内的门类似的红门。
//
//出口
//唯一的离开方式是使用Level 74舞台上的活板门。进入后，进入者会被带往绝缘层；不过，它们必须在进入本层二小时后才可以进入。
//


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl74{}