package lvls0;
//Level 76
// 
//
//生存难度：
//等级 4
//
//不安全
//不稳定
//中等数量实体
//Level 76是后室的第77层。
//
//76
//Level 76内被照亮的部分。
//
//描述：
//Level 76是一个无限大且类似于迷宫的下水道系统，其内包含有大量的隧道。
//
//当人们在隧道内探索时，墙壁的纹理和外观偶尔会发生变化。据一些流浪者的描述，该层级的部分区域给人以度假酒店泳池般的宁静之感，或是营造了像废弃工厂一样充满威胁与不安的氛围，而另一些人则称有些区域充斥着血腥与污秽。在该层级这些不同的部分中，流浪者们可以找到各种各样的资源。
//
//每个部分似乎都被设定为一段特定的场景，有些部分长达数英里，甚至能到20英尺。如果某段隧道入口处有硫化物的气味，建议尽快掉头离开。
//
//Level 76 仅存在一种被称为“黑暗之眼”的实体。对它的描述不尽相同，但仍可知其主要体征为明亮的白色眼睛，蓝色的瘦长躯体以及蜘蛛般的腿。
//
//定居者及定居区
//澹涿浃：
//澹涿浃是一个极大的定居点，位于隧道东北方向41英里处。它的完备性令人感到不可思议，被称为“下水道枢纽”。澹涿浃为流浪者们提供食物和居所，但他们也希望每个人都能贡献出自己所携带的物品。
//
//澹涿浃的防御工程极其完备，警戒森严，以抵御黑暗之眼的入侵。
//
//注意，该层级内类似于东、南、西、北这样的方位是任意的。Level 76内一些区域的墙壁上已被刻上记号，但这些记号所指向的位置并不总与下一个记号的所匹配，它们总是自相矛盾或难以对应，故不能只关注其表面含义。对于Level 76的探索只有仅沿一个方向前行才能完成。
//
//入口及出口：
//入口
//下潜到任何一个层级内任何一个水体的足够深处，都有可能找到一个金属舱口通向Level 76。可以找到Level 76入口的一个例子是Level 7。
//
//出口
//只有少数隧道通向Level 76外的区域。这些出口随机消失并随机出现，其总数仍未知。因为它们可能会出现于其他任何隧道中，故目前尚不清楚这些出口具体是什么样子。
//


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl76{}