package lvls0;
//Level 73
// 
//
//生存难度：
//等级 5
//
// 
// 
// 
//
//
//注意
//
//為了你的安全，我們将在此處上傳以下内容，不要去尋找Level 73。不要試圖救援我們。我們在努力自救。
//我們剛剛提交的文字是在銀色城堡内完成的。我们尽可能地描述了Level 73。
//
//我們在這里很安全
//
//我們在這里接受愛
//
//總有一天，我們会在彼岸相遇，届時，我們会帶他一起去。
//
//簽名 -
//Coran之子
//
//
//
//conancastle1.png
//外部所見的 銀色城堡 .
//
//Level 73 是后室的第74層 。它通常也被称为 "紅壤"，因該層中的已探明区域都有着深紅色的地面。
//
//描述：
//Level 73 目前僅有一个可進入的区域，由一个中等大小的島嶼組成，所有流浪者都通過切入進入。島嶼周圍是未探明的海洋，由于其中存在現階段不明的水生實体，進入那里是極度危险的。到目前為止，没有發現其他陸地。
//
//由于几乎是災難性的實体数量，Level 73 非常難以生存。除了坐落在島嶼最高点的銀色城堡之外，没有任何地方是没有敵對實体的。該層的實体密度被估計為35平方英尺（3.3平方米）一只，在該層能夠遇到的實体包括 窗户, 笑魇, 雌性和雄性的死亡飛蛾, 肢團, 鈍人, 獵犬, 窃皮者, 尸鼠, 和 掩蔽爬虫. 这些實体不僅絕對敵對，而且会成群結隊地攻擊附近的人類，毫无怜憫地獵殺他們直到死去。人類在該層生存的唯一途径就是躲在 銀色城堡 在CORAN的保護下。
//
//corancastle3.png
//唯一的銀色城堡外黑色田野的圖像。其它圖像可以獲取，但内容被認為過于使人不安，因此任何人都无法查看并已被全部刪除。
//
//Level 73 處於近乎永恒的黑暗状态下。没有昼夜循環，相反的是，一輪滿月持續照亮它下方骯髒的黑紅色地面，从不改變位置。月亮很容易被令人窒息的厚重烏云所遮蔽，使整个層級都陷入黑暗。但无論多么黑暗，不要 使用人造光源。在你到達銀色城堡的大門之前，你不会想看到的
//
//当切入Level 73时，你基本上總能看到銀色城堡。 一定要直奔城堡。 不要 四處張望。 不要 停止移動。不要放緩脚步。如果你在被大群實体攻擊前到達城堡門前，請尽可能大声地敲門，你会得到保護。
//
//
//
//銀色城堡：
//corancastle4.png
//銀色城堡内的走廊之一。
//
//corancastle2.png
//銀色城堡内的另一条走廊。
//
//銀色城堡 是Level 73中已知唯一的建筑，建造者未知。這是一座巨大的哥特式建筑，家具齊全并且灯火通明，城堡周圍有高而薄的石牆，入口前有一座奇特的開放式門楼，从門楼出来，有一条通往城堡門口的石路，你可以順着脚底的硬物感找到入口。任何外部影響似乎都无法穿透銀色城堡的外部以及大門，且被无效化，包括試圖穿牆而過的鈍人。銀色城堡 因其挂在牆上的旗幟而得名，上面在黑色的田野上画着一顆帶有公羊角的銀色心臟。近期發現銀色城堡内有很弱的Wi-fi信号，所以尽管没人能夠脱離該層，但得以在Level 73 内部上傳這篇文章。
//
//銀色城堡 的内部維護良好，装潢華麗。有一个主廳、一个餐廳和六間客房，每間客房有兩張大床，旁邊還有一間由CORAN占据的主臥室。整个銀色城堡共有三層楼和一間閣楼，閣楼通向城堡頂部的陽台。CORAN已宣布禁止任何人進入閣楼。每層楼有兩間客房，兩邊的每一側都有一間。主臥室位于三楼。餐廳内有一个大壁炉，为城堡的其他区域提供熱量。一些實体的肉，如獵犬，被用作壁炉里火的燃料。供 銀色城堡内人類使用的饮用水和食物每隔一段時間就会出現在城堡里大紅木桌上和上面的銀器里，仿佛无窮无尽。有兩間浴室，里面有可以无限加注的浴桶，桶里装滿用于沐浴和洗衣的熱水。這里有很多描繪前厅景物的画作，但是都不能作為切出Level 73的手段。銀色城堡的每扇窗戶前都有紅色天鵝絨的窗簾，但窗戶完全用木板封住。CORAN声称這是为了驅散可能出現Entity 2““窗戶”的情況。別看外面。
//
//
//
//基地、前哨和社区：
//Coran之子
//任何在切出到Level 73 的過程中幸存，并且成功到達銀色城堡 的人都被視為Coran之子的一份子。截至目前，我們有正好37人，這里除了我們別无他人。
//入口和出口：
//入口
//在Level 9.1的幽暗處停留太久，你会抵達這里。其他流浪者是从Level 14和Level 6以未知方式到達的。
//
//出口
//没有已知的離開Level 73的方法。一旦我们找到，我们会全部逃離。
//
//
//
//"Coran"：
//coran.png
//画家對CORAN形象的創作
//
//Level 73 是一个内部存在独特實体的楼層，該實体為男性体征，并自称CORAN，僅在該楼層發現。 他的行為独一无二，因為他對其他實体極富侵略性，但从不對人類采取行動。他同Level 73的其他所有幸存的人類居住在銀色城堡 中，他将他們称為自己的孩子。
//
//CORAN極度關注人類的需求。他確保自己所有孩子 都得到合適的照顧。很多时候，他会花時間在銀色城堡外屠殺成群結隊的實体。CORAN是目前該層中最強大的實体。他的外表為一个中年男子，肌肉發達。身高7英尺9英寸（約2.35米），有着黑色的、向后梳的頭髮，頭頂有兩个角状突起。他戴有巨大的金色鏈環在正常人類手臂的位置，将其肩膀和双手連接起来，双手戴有同樣巨大的黑色尖刺手套。CORAN擁有三顆心臟，只要有至少一顆心臟正常運轉，就能完全自愈几乎所有傷害。他的心臟其中兩顆在他的護手内，第三顆則稍微暴露在胸前，位于覆盖了他大部分体表的黑色外骨骼后。
//
//他的再生能力有一个例外：CORAN的臉上有一處横貫的傷疤，从他如今空空的眼窩里挖出了眼睛，使他完全失明。据他所說，他因在該層中与一只独特的巨型獵犬戰鬥并将其殺死而受傷，据他說，他被挖出的兩只眼睛一只戴在脖子上的項鏈上，"作为一種朋克行為"。
//
//不要害怕CORAN。他是我们生存的唯一理由。他的使命是 清除世界上会傷害我們，也就是他的孩子的所有污穢。 他的目標是消滅所有存在与這一層級的實体，使我們可以自由地生活在一个没有任何危險的世界中。如果不能實現，那麽他的目標就是找到這个困住我們的地獄之出口。
//
//M.E.G. 官方音頻記錄抄本
//為方便查看，以下轉錄為文字。
//
//錄制日期： 未知
//記錄者： Rachel A，M.E.G.特工
//
//[混乱的頻道雜音]
//
//Rachel A： 好的，Coran！我們已經啟動并運行。
//
//[Coran咳嗽]
//
//Coran： 那麽，我該干啥？我就……說話嗎？
//
//M.E.G. 特工Winston：對對，只要說話，它就会把你說的話傳給我們在基地的朋友。他們很想知道我們去了哪里。
//
//Coran： 呃…
//
//Rachel A: 我媽肯定担心坏了。嗨，老媽！
//
//M.E.G. 特工Lucas W.: 告訴他們他們不用担心。
//
//Coran： 哦，好……hi，我叫Coran，我現在記錄這些是為了告訴你們，你們在幽暗處損失的人，過去消失的人……有三个？探索……他們没死。他們在這里，和我在一起。
//
//[Coran再次咳嗽]
//
//Coran： 啊，還没有痊愈……
//
//Winston： 慢慢来，夥計。給你。
//
//[Coran喝了一口Winston遞来的水]
//
//[Coran清了清嗓子]
//
//Coran： 我把他們留在这里，在這座城堡里。這儿到處都是想要殺死你的人的怪物，但他們在這里很安全。他們将向你發送一份描述此地点的文件。如果没有太多信息可以泄露，我很抱歉，但我不希望他們看到除了此之外的任何东西。這里的東西不適合任何人看。我希望你們能理解。
//
//[Coran停頓]
//
//Coran： 他們会回話嗎？
//
//Lucas W: 他們稍后会回信息給我們……希望如此。
//
//[Coran沉默]
//
//Coran： 請取消任何前往幽暗處的探索。不要試圖派更多的人来救援我們，否则他們将无法脱身，只会和我們一同被困住。我已經在這里很久很久了，甚至在你們任何人到来之前就在尋找出口。一定会有一条生路……但我們会自己找到的。
//
//[Coran再次停頓]
//
//Winston： 這是你想說的全部吗？
//
//Coran： 我……對。我說完了。
//
//[Rachel走向錄音設備]
//
//Rachel A: 好的，那我現在停止錄音。
//
//[Coran 猛吸一口气]
//
//Coran： 我……
//
//抄本結束
//
//
//
//
//点擊閱讀相關故事
//（尚未翻譯！）
//The Crimson Family, Part I.


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl73{}