package lvls0;
//Level 89
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//Level 89是后室的第90层。它由一位冒险涉足Level 11深处，走进一座大门来到樱桃树丛的流浪者发现。
//
//描述:
//Level 89表现为一家1940年代的冰激凌店。来到此处的流浪者有98.7%的几率出现在入口处，前门顶篷上的标志写着“家之味 – 成立于1938年”。家之味的外表崭新，没有毁坏或缺损的痕迹。外墙是柔和的粉红色，屋顶则是奶油米色。通常可以见到建筑物周围的空地上装饰着花朵，种类有玫瑰、紫菀和白色百合。
//
//室外有淡淡的烟、纸杯蛋糕和血的味道。店铺被樱桃树环绕，这些树很可能无限延伸。试着离开店铺、穿过树丛会导致流浪者最终回到建筑物处。因此，穿越无尽树丛离开Level 89是不可能的。
//
//进入店铺首先会见到冰激凌勺的剪贴画。室内和外部一样干净整洁，但和外部不同的是，室内的墙是深蓝灰色。前门附近可以看到衣帽钩，有几个上面挂着黑色的夹克。墙上贴满了海报，印着享乐战争的宣传语，现已绝迹的扫兴客用它们来拉拢探索者加入抵抗派对客的一方。因此此层级被认为是扫兴客绝迹前的避难所。
//
//店铺大厅内十分宽敞——拥有数量众多的桌子和天鹅绒椅子——空间足以建立小型的基地和社区。这些座椅内有隔层，其中可以找到杏仁水和双指1，偶尔有层级密钥 。柜台上不时可以见到再现之物，强烈建议忽略或摧毁它们。
//
//前台也可以安全进入。冷冻柜里装满了各种冰激凌，全部可以放心食用。配料已全部经确认为新鲜且可食用的，用完后会在周末之前被重新装满。柜台允许进入和使用，只要它没有被滥用或禁止别人使用。因此，有人认为这就是为什么扫兴客可以将食物带给Level 52的扫兴客和流浪者。
//
//前台旁是“限员工进入”的房间，一只已爆炸的气球系在门把手上。这扇门被Level 89的群体严密地阻挡和看守，他们认为这是派对客与扫兴客断交之前用于运输的通道。任何进入房间的尝试都被证明是无效的。
//
//大厅有一处后门，总是通向Level 11或Level6.1。这个通道频繁地被甜品站用于外出收集本层级没有的补给/食物。只有甜品站（见基地、前哨与社区）的成员，或自愿与M.E.G群体一同出行，才会被允许使用这个通道。
//
//实体
//时常有成年和幼年无面灵走进大厅。它们和Level 11的无面灵具有相同的效应2。他们会在柜台前等待，直到一个无面灵过来接受点单。尚未得知它们在进入大厅之前来自何处。建议不要打扰无面灵，以防其中一个有理解无声指令的能力。如果引起了肢体冲突，它们会恢复到普通状态并发动攻击。除无面灵之外，再现之物和流浪者是仅有的居留在Level 89的实体。
//
//基地、前哨和社区
//甜品站
//此层级建立的第一个社区，包含五个成人和三个儿童。
//此群体开放贸易。如果有需要他们会回答任何问题。
//此群体只有一两名成员会外出寻找此层级没有的补给。
//严密守卫着“限员工进入”的房间，如果无法挡住房间，他们会把这项职责交给“冰激凌筒露营者”基地的成员。
//M.E.G基地“冰激凌筒露营者”
//此基地建立的目的是保持“限员工进入”房间上的标签，以及和来自潜在危险层级的流浪者谈话。
//他们和甜品站的成员关系密切。
//由10人组成，乐于接受自愿加入者。
//开放贸易，并会回答任何问题。
//入口和出口:
//入口:
//在Level 11深处进入一座大门后的樱桃树丛会通向Level 89。
//在Level 18想象一家冰激凌店会把你带到Level 89。
//在Level 6.1找到并穿过一扇粉色的门会把你带到此层级。
//在Level 53找到一间黑板上画着冰激凌的教室会把你带到Level 89.
//出口:
//切入冰激凌店外的一棵樱桃树会把探索者带到Level 11.1。
//从后门走出会把流浪者带到Level 11 或 Level 6.1。
//完成再现之物的三个效果阶段并手持它会把你带回Level 18。
//通过触摸柜台附近的一张高中课程表海报切出，会把你带到Level 52。
//进入“限员工进入”的房间有可能将流浪者带到享乐层。由于这间房间总是被阻挡，这种离开方式未经证实。
//作者信息
//« Level 88 | Level 89 | Level 90 »
//
//Footnotes
//1. 译注：该物品设定已删除。
//2. 译注：11层效应，无面灵表现得如同普通人类。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl89{}