package lvls0;
//Level 85
// 
//
//生存难度：
//等级 3
//
// 
// 
// 
//Level 85是后室的第86层。该层级是一艘巨大的13世纪舰船，被推测位于一片无穷无尽的海洋之中。
//
//描述
//Level 85是一艘13世纪风格的船只，位于一片无尽的海洋。该船只极其庞大，据估计需要至少50人来操纵其行驶。该船只的功能似乎是完好的，但是想要使它航行被视为一个不可能的任务，因为这需要大量的人力、知识储备与指挥能力。
//
//船体中的一层向两侧各设有五门火炮，皆处于可运作状态。船只还具有一只桅杆。
//
//船长室内有一张地图，其上标注着令人迷惑的方向，似乎指向一了个小岛上的“埋葬之珍宝”。不少人试图解析这张地图的确切用法，但是至今没有一个成功。这张地图指向的宝藏具体为何完全未知，但是有可能已被取走，也就让这张藏宝图完全失去了意义。
//
//该层级的入口是否固定是未知的，迄今为止记录在案的流浪者中没人能两次进入该层级。
//
//基地、前哨和社区
//该层级内没有已知的基地、前哨或社区。
//
//特殊现象
//风暴
//Level 85内风暴的出现是相当常见的。这些风暴中大部分规模都较小，不会造成什么问题；而一些规模大的风暴可能会损坏船体。在风暴发生之前，请做好以下准备。
//
//将船帆系好。如果船帆没有系紧，船体会被肆虐的狂风吹走。
//使用舵轮旋转船身，使其与风向平行。虽然使其航行是几乎不可能的，但是转向要简单得多。如果船只没有与风向平行，它会被海浪冲击，造成损伤。
//将你的手机放在干燥地带，最好的地方是船长室。
//对于很多小风暴，以上三点都能较好应对；但在大风暴中生还的概率极小，因此在必要时请迅速离开该层级。
//
//克拉肯
//克拉肯是一只巨大的头足类实体，其特征与现实世界民间传说中的“挪威海怪”极其相似。其尺寸远超Level 85内的船只。然而，该实体非常温顺，即使在被挑衅时也不会发起攻击。在你初入Level 85时，克拉肯会从水中浮现，远远地注视着你，并缓缓地向船只接近。克拉肯难以置信的友善，它甚至会与甲板上的人类游戏。当克拉肯被攻击或被挑衅后，它会下沉入水面，远离船只大约一天的时间，然后再度返回。
//
//有些人提出可以借助克拉肯抵达宝藏小岛，即骑着它前往。试图骑上克拉肯会有以下结果：溺水、被扔进空中数英尺高，或是被严重压碎。因此我们强烈不建议流浪者跳到它的身上。它很可能受到惊吓，然后使事态失去控制。
//
//死船
//死船是内部空无一物的船只，在Level 85内相当常见。它们在海上无目的地漂行。死船通常只能远远地看到，但也有小概率它们会接近Level 85之船，使得流浪者可以登上死船。登上死船后，流浪者会感到寒冷，并且心底会涌现出绝望之感。这一绝望感之后是否会消失目前未知，仍待进一步的研究。一些人认为这些死船可能通往其他层级。
//
//在一次记录中，有人使用船只上的火炮对一艘死船开了火，而死船则发射了数发炮弹截击。这名匿名用户在离开该层级后表示，死船的炮弹完全摧毁了他的船只；若非他及时通过瞭望台离开，多半就会丧命于此。
//
//入口与出口
//入口
//目前为止，还没有发现通往该层级的固定入口。每一位流浪者进入的方法皆不相同，而在事后探查时这些入口都被证实为失效。有可能进入该层级所需要的是一个特别的动作，而非抵达特别的地点。
//
//出口
//在瞭望台上有一个活版门，通过那里即可离开Level 85。尽管跳入活版门似乎会直接掉到甲板上，但这一举动实际上会将你送入Level 86。
//


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl85{}