package lvls0;
//Level 88
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//image.jpg
//一张 Level 88的照片。
//
//Level 88是后室的第89层。
//
//描述：
//Level 88的外观是一条酒店走廊，其似乎向两侧无限延伸。此处的墙壁总是呈浅棕色，灯光总是昏暗且持续的，而地毯则散发着全新的气味。本层的特征为每间隔约7米便有两扇相对的门。大多数时候，这些门通向没有家具或拥有少量家具的普通房间，在此类房间中发现钝人是相当常见的情况，故若非房间中含有高价值物品，不建议进入其中。可以在此类房间内寻找到的物资包括刀具，灯，以及皇家口粮。然而，这些并非唯一值得进入的房间，你还可以在本层级进入一系列的特殊房间。
//
//与正常情况相悖的是，这些房间并不符合门与门之间间隔7米的规律，它们存在各种各样的尺寸，有些甚至可以超过走廊本身。
//
//特殊房间
//灭火器房间：此房间的主要特征理所应当为灭火器，房间里面有一个圆桌，在它的上面你可以看到一个被未知方向的光线所照亮的灭火器。在桌子上有一块小匾牌，上面写着：“不是给最强壮的人，也不是给最聪明的人，而是给最狡猾的人。”任何对于移动灭火器和桌子本身的尝试都没有成功。
//茸茸房间：此房间让能人回想起精神疗养院里的软垫房间，这是一个非常舒适的地方，可以用于短暂休息，你不应在里面度过太久时间，你可能不会醒来。
//实验室：此房间的内部与标准房间相比拥有巨大的不同，墙壁的颜色是混凝土灰，天花板上的明亮灯光照亮了一切。约10x12米的场地堆满了金属桌、黑板和架子。该房间总体来说呈现出一种疏于看管的氛围，到处都散落着吸液管、试管和破损的注射器，这里同时也散落着书籍，但其以一种无法理解的语言写就。有报告称地栖怪出现于此，故不建议进入此处。
//木林房间：此房间的外观为夜间的森林，茂密的云杉树使得穿过房间变得困难。随着行进越发深入，不论方向如何，都会使“时间流动”，让天空一点一点变亮，直到早晨。从这一情况发生往后，树与树之间的距离会增加，而你会发现自己正处于Level 63。
//卧室：此房间被装修的十分亮丽，画作、家具和镜子上都装点着金制装饰。房间的中间是一张大床，躺在上面会产生一种无法形容的想要休息的欲望。但是，你永远不应于此处陷入睡眠，因为这是一个陷阱，床下有一大群笑魇1正等待着你睡着。
//基地，前哨与社区：
//该层级目前不存在已知的基地、前哨或社区。
//
//入口与出口：
//入口
//该层级可以由Level 13进入，为此你必须找到一条似乎没有尽头的走廊。一直向前走，直到墙壁的风格开始发生变化时，你会发现你已经来到此层级。Level 156和Level 356的门有概率使你来到此层级。
//
//出口
//想要离开，你必须找到一个上方带有“出口”标志的门。这些门会将你带向Level 11或Level 33。你也可以通过穿过木林房间的森林以离开，这会将你带向Level 63。
//
//作者(们)
//« Level 87 | Level 88 | Level 89 »
//
//Footnotes
//1. 译注：原文（Smilers）与原文链接（Entity 4）如此。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl88{}