package lvls0;
//Level 83
// 
//
//生存难度：
//等级 0
//
//安全
//稳定
//消极行为实体Z-8-VAT-7-FP8-Y-G-2.jpg
//黑桃A号的外部观。
//
//Level 83是后室的第84层。
//
//描述：
//Level 83由一艘沉没在似乎是无尽的海洋中间的核潜艇组成，其名为黑桃A号(SSN1 744)。黑桃A号横躺在深度约600米（1970英尺）的海底岩沟内。其操控装置已失灵，但船内的电器（如照明和厨具）均处于稳定可用状态。
//
//黑桃A号的核反应堆仍在运行，虽然船体的外部有一定磨损，但内部完好。黑桃A号内部有几台冰箱，里面有瓶装水和一些食物，如三明治、意大利面、水果、蔬菜、鸡蛋和肉类。当以上物品被从冰箱中取出消耗后，会重新补充，这也就意味着黑桃A号拥有无限的食物和水源供给。
//
//
//
//YS1-XO6-ZNA1-MHDT-V-SG8-U.jpg
//铺位，或者说居住区的样式。
//
//XNC-S-F-9-D-6-Q-66-MVXE.jpg
//黑桃A号内部。
//
//进入Level 83的流浪者会发现自己身处在黑桃A号的铺位或是食堂里。铺位即是一间放有几张空床垫的房间，使用免费，而食堂是一间小房间，里面摆着该层级居民用于用餐的一张皮沙发、几张小金属桌和一些桌椅。尽管潜艇可以最多容纳140名流浪者，但我们建议那些不打算久居黑桃A号的人员通过逃生舱门离开该层级，因为流浪者可能会占用在黑桃A内的工作人员的空间。
//
//黑桃A号的组成总体上与洛杉矶级潜艇相似，但有一处不同：黑桃A在船体两侧有数个可用于观察的窗口。现实世界中没有已知的与黑桃A号样式一致的船只，因此M.E.G.认为她源于“后室”本身。人们通过这些窗口，记录了数种太平洋的常见鱼类，如太平洋鲑鱼、褴鱼和多线鱼。
//
//黑桃A号外部并未经过探索，因为离开潜艇的人员在外部停留超过十分钟就会被送往Level 7。但是通过窗口可以观察到一些岩体结构，偶尔可以观察到移动的光亮。由于水深导致的能见度低下，没有其他值得注意的信息记录。
//
//在船内的设备和控制系统装置上可以找到几张纸条。每一张都粗略描绘了一个身穿深蓝色衣服、头戴紫色海盗帽和眼罩的年轻女孩的形象。可以从上面看到女孩手里拿着一把大军刀，摆出各种让人联想到海盗的姿势。图作旁边还写着几句刻板印象里的海盗用语，如“Arrr！”“Avast ye, mateys！2”每幅画都有“Kira”的签名字样。除了这些纸条外，层级内还可以找到各种不同颜色的便利贴，上面有关于黑桃A内装置的说明。这些便签的署名也是“Kira”"。
//
//令人奇怪的是，其中有张纸条格外显眼，它是在船体外部而非内部发现的，但没有被水流损坏，其内容如下：
//
//我现在觉得当海盗好无聊啊。我要去做个丛林或者什么的。可能还会回来，但现在你们就用着这潜艇吧，我不会再用到了。祝你们玩得开心吧，你们这些大眼睛的怪家伙。
//
//- Kira
//
//P.S. 不要对它太粗暴。不然你可能会炸飞你自己。我倒不在乎，但还是提醒一下。
//
//
//
//大观察家
//
//
//LI3-U-1-EHE-Q8-ANUW1-MS-A.jpg
//大观察家的眼睛。
//
//
//
//大观察家是Level 83中已知体型最大的实体，约是普通大乌贼的两倍。经常可以观察到它在黑桃A号外的附近水源游动，其动作非常有力，身体产生剧烈流动的水流，导致潜艇吱吱作响，强烈晃动。大观察家有种行为倾向，即在潜艇表面摩擦它锯齿状的触肢。当大观察家这样做时，建议人员保持镇定，抓住稳固的物体。没有表明大观察家吃肉的证据，因此可认为该实体是植食性动物。它似乎以零散地敲击船体为乐，是有节奏性的敲击，好像打鼓一样。据称，它有时也会移动潜艇，但从未严重干扰其核反应堆或内部的人员。
//
//大观察家似乎很乐于观察Level 83的居民，它将自己20英寸长的眼睛贴在潜艇窗口上。尽管其行为是消极、无害的，但大观察家的移动速度非常惊人，它的大眼睛突然出现在窗口前，往往可以吓到几个流浪者。尽管可能会引起流浪者的不安情绪，但这种情况发生时，最好还是像平常一样，保持冷静。大观察家只是在观察而已。
//
//
//
//基地、前哨和社区：
//黑桃A号(SSN 744)船员
//团体规模由20-100人不等。
//是长期居住在潜艇上的流浪者。
//有食物和水源补给（份量有限，仅足够100人生存。）
//友好且贸易开放。
//乐于接纳新成员。
//经询问后会指出出口。
//入口和出口：
//入口
//Level 83可由Level 7进入。当流浪者下潜到一个光线稀疏，水压几乎无法忍受的深度时，他们就会在昏迷后从Level 83的某张床上醒来。许多流浪者在寻找Level 8入口时，无意间从Level 7进入了Level 83。
//
//出口
//要离开Level 83，人员必须打开潜艇顶部的逃生舱门，然后游到海里。这会将流浪者带往Level 7的水中。不建议无合适装备或一定准备时这样做，因为流浪者需要准备去寻找Level 8的入口或者游到Level 7水面。
//
//作者
//« Level 82 | Level 83 | Level 84 »
//
//Footnotes
//1. 译注：SSN代表美国海军攻击型核潜艇，SS代表ship submersible即潜艇，N代表Nuclear Power即核动力。
//2. 译注：Avast指停下，ye指你，matey指朋友。这句话大意是海盗腔的“你给我停下，朋友”。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl83{}