package lvls0;
//Level 81
// 
//
//生存难度：
//等级 2
//
// 
// 
// 
//Level-81-1.jpg
//外部拍摄Level 81内一座写字楼的照片，并捕捉到了一匹马的影像。
//
//Level 81是后室的第82层。Level 81是一个巨型的写字楼集群。
//
//描述：
//Level 81由多座写字楼式的建筑组成，与前厅中的建筑相似。这些建筑的内部结构各异，但有某些共同的风格。Level 81内建筑墙壁在材质上有显著不同，从砖头、混凝土到墙纸，并出现数种颜色，如浅蓝色、深绿色和黄色。在纹理和设计上也可能有差异。同样，Level 81的地板也可能是地毯、混凝土，偶尔可能是木制层压板。Level 81内的照明差异也很大；试图确定其制造商的尝试被证明是徒劳之举。照明可能会闪烁，有时会发生停电，与Level 0和Level 1的情况相似。尽管有这样那样的缺点，但Level 81确实拥有一张可靠的电网1，并支持WiFi。该层建筑中窗户很常见，但安全；目前没有关于窗户（实体）的目击记录。
//
//刚进入Level 81时，该层级中会异常安静。徘徊数小时后，可能会听到各种动物的叫声，顺着声音就可能找到这些动物。可以在这里找到许多前厅的动物，如马、猪、犬科动物、猫科动物、牛、鸟，等等。部分存在潜在危险的动物，如熊和狮子，也会出现，但建议流浪者不要接近这些动物。M.E.G.中，团体"Compass Point"所提出的解释Level 81中大量动物出现的主要理论是，Level 81是前厅中非人类动物的“起始层级”，相比之下，Level 0是人类的“起始层级”。Level 81内除了有大量前厅的动物之外，也会遇到各种实体，如笑魇、窃皮者、雄性死亡飞蛾、钝人、杰瑞和猎犬，但可能有更多种类的实体栖息在该层。
//
//据称Level 81的整体结构和内部情况是超自然的；目前观察到多个房间被卡在其他墙壁中，并生成了相应的垂直走廊，使得重力方向曲折。有些房间可能被杏仁水所隐没，其中生存着数种海洋生物。Level 81的窗户通往一个可进入的外部区域，尽管由于大量房间和厅室的阻碍，这个区域理论上不应该存在。
//
//在Level 81的写字楼外，可观察到一条绵长的2、蜿蜒的主路。也可以透过窗户观察建筑物内活动的动物。Level 81的外部区域散发着一种微妙的荧光，当与之直接或间接地互动时，会使得周围所有动物都受到惊吓，并因恐惧而远离。Level 81的天空漆黑多云，无法观察到星星或是如月亮等其他天体。然而无人机录像显示远处还有许多建筑；试图前往这些建筑的违规者会被送回到主路上。
//
//基地、前哨和社区：
//据估计，在Level 81内建立居住区是有可能的，但不建议，目前也没有。有证据表明，失落一族可能栖息在该层级，将之作为猎场使用。
//
//入口和出口
//入口：
//在Level 10的某个谷仓里发现的一扇办公室门，是通往Level 81是普遍方法，尽管这扇门的确切位置未知。在Level 4可以找到一个贴满动物园广告的房间，它会以未知方式将人员送往Level 81。在Level 58，可以遇到一个动物主题的游乐园；与其中任何装置互动都会打开一个通向Level 81的走廊。在Level 21内任何标有204字样的门都通往Level 81。在Level 80小休斯顿的某个标有“81”的棚屋也通往Level 81。在Level 43通过动物园的广告牌切出也会使你抵达Level 81。
//
//出口：
//目前已知有多种方法可离开Level 81。如果进入一个满是鸟类的房间，你将被传送到Level 30。如果在外部区域发现一个大缺口，进入它将使你去往Level 22。进入某个黑暗的小巷会使你出现在Level 55。有时Level 81的某扇门可能会毫无预警地通往Level 0、Level 4、Level 37或Level 62。Level 81的下水道系统可能会通向Level 34或Level 41。乘坐Level 81的电梯可能会使你到达Level 64 或Level 65。Level 81的某条走廊可能把流浪者带去Level 88。Level 81内的某些混凝土材质的办公室会通向Level 170的Ⅱ型混凝土箱。任何试图切出的尝试都会将违规人员传送到随机的负面层级。
//
//作者
//« Level 80 | Level 81 | Level 82 »
//
//Footnotes
//1. 其位置不详。
//2. 大概是无边际的


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl81{}