package lvls0;
//Level 87
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//Level 87是后室的第88层。它于2004年五月被一位不明流浪者发现。
//
//42937131_10d756be3e_b.jpg
//关于Level 87唯一已知的图片。照相者的地点未知。
//
//描述：
//Level 87包含众多数英里长的走廊，类似于Level 21。这些走廊的两侧都设有上锁的门，同时每隔几英里就有可能找到一张桌子。其上通常会放有一把钥匙，少见的情况下会有一包薯片或是杏仁水。特定类型的钥匙可以打开相应类型的锁。虽然看上去是随机的，但钥匙和锁的数量并非无限，它们通常被颜色、数字以及字母进行编号。如果你看到了一扇有着亮纸屑的门，那是我们的派对！=)
//
//本层最奇怪的特点在于时间在这里看起来是非线性的。虽然不常发生，有时流浪者会报告在一小段时间里看到了过去或未来版本的他们自己。与过去或未来的你自己接触并不是非常困难的事，但十分有风险。如果你这么做，就有可能给过去或未来的你自己提供道具或东西来生存。时间悖论自我解决的方式就是创造一个无尽的时间循环，将无数过去版本的你困入其中。流浪者可能会看到任何时间点的自己，从距现在5分钟到数年的过去或未来皆有可能。建议在这些情况下保持小心。这些时间异常并不会一直发生。
//
//在与过去或未来的你自己接触前要保持警惕，因为他们可能会试图伤害或杀死你。如果你最终创造出了一个时间悖论，例如杀死了过去的自己，齿轮缔造者将会出手干预。无人知晓你身上会发生什么，所以不要试图这么做。
//
//基地，前哨和社区：
//由于这一层的自然环境。本层没有已知的基地，前哨和社区。
//
//实体
//本层没有报告过已知的实体，而且流浪者似乎永远无法找到其他人。
//
//应对措施
//应当：
//不断寻找出口。
//不断打开门
//不断寻找钥匙、食物和水。
//不应：
//试图伤害或杀死过去或未来的你自己。
//浪费时间。
//尝试与你看到的另一名流浪者接触。它们很可能不是人类，而且由于它们可能是某个实体的过去或未来版本，这能够导致某种无法预测的结果。
//入口和出口：
//入口
//你有时可以切过Level 21中的一扇门来进入这一层。有流浪者报告说走进Level 9的某栋房屋也是一种进入方式，但这没有得到证实。
//
//出口
//少见的情况下，一些门会通往其它的层级。这是唯一已确认的离开方式，不过有些人声称切过一扇门最终会来到Level 119。
//
//已授权。
//第1天
//在我穿过[数据缺失]的时候，我不小心切过了一扇门，然后就来到了这里。这个层级看上去很像level 21，不过这些门似乎没有办法打开。
//第4天
//我找到了一把[数据缺失]钥匙，然后打开了一扇和它对应的门。奇怪的是，在这之后这把钥匙对同一扇门就不起作用了。这些门一直通向更长的走廊，里面有更多的门。我一直能看到远处有[数据缺失]，不过在我与他们接触之前他们就消失了。我开始有点口渴了。
//第5天
//我想我刚刚遇到了我自己。他递给了我一瓶杏仁水，然后一言不发地消失了。这整件事都太奇怪了。我现在越来越想离开这个地方。
//第11天
//我已经[数据缺失]，在[数据缺失]时没有发现任何[数据缺失]。
//第3?天
//我刚才递给了过去的自己一瓶水。我开始明白了，这个层级允许我与未来或过去的自己接触。
//第39天
//这些走廊看上去永无尽头…
//第5?天
//我再也受不了了。这个时间什么的东西的确在扰乱我的记忆。
//第84天
//我稍微恢复了点神智，因为昨天我很幸运地找到了三瓶杏仁水。我和未来的自己进行了一次愉快的[数据缺失]，不过他说他来自[数据缺失]年之后，所以我还会在这里待上一段时间。
//第117天
//我开始觉得这里没有出口了……
//第48?天
//我和[数据缺失]天后的自己交流了一下，他说我明天就会失去这个平板。这会是我最后一次上传了。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl87{}