package lvls0;
//Level 8
// 
//
//生存难度：
//等级 5
//不安全
//不稳定 
//实体横行 
// 
//2870021507497186.png
//在首次探索 Level 8 时拍摄的照片。
//
//Level 8是后室中的第九层。该层级表面上为一充满危险和大型洞穴的无尽岩洞系统。
//
//描述：
//Level 8为一由大型洞穴和类似普通地下系统的扭曲小型岩洞系统组成的地下系统。Level 8十分潮湿，有杏仁水从洞壁和洞顶流下。钟乳石和石笋在Level 8中似乎十分常见。在该层级中会产生回声，因此探查潜在的危险会变得相对简单，或者不小心地招致危险。Level 8通常缺乏自然光，但一个未知来源的光会照射潮湿的洞壁，使该层级在特定的区域有轻微的光照。
//
//植被尽管在此地极为稀少，但它的确以干燥攀援植物和小型灌木的形式存在。在Level 8中可以发现大型杏仁水水池，由于含有大量矿物质，它们并不适合安全的饮用。在某些水池中可以找到一些粘稠的类沥青物质，在Level 2和Level 7中可以找到同类物质。进入这些水池会导致水池中伸出很多包裹在沥青中的人形手臂，它们会拽住漫游者，将漫游者拉进池中。还有一种水池是由蒸馏水构成的，进入这些水池的漫游者会前往Level 7。Level 8中存在小型矿脉，包括铁，铜，金等等。为确保漫游者的安全探索，M.E.G.在Level 8的安全区中建立了许多公共探索路线。
//
//Level 8中有许多危险的实体，如笑魇、窃皮者、悲尸、迷彩爬行者1。极少数时有人看到了传送者、雄性和雌性死亡飞蛾、敌对无面灵、绽放之眼2、猎犬、尸鼠、寄生谎、断层爬行者、肢团、 观察者3、地栖怪、牧蛇 。还有一种仅在Level 8中出现的实体，即八层之蛛，这些实体为一些剧毒的大型蜘蛛。我们建议你尽可能避开这些实体。 有报道发现被称为爬菌的实体出现在连接Level 2和Level 8的通道中。被称为磨损者4的实体理论上是由该层级中的一个未知团体创造的。Entity 2的一个奇特特性为，容纳着它们的窗户会出现在该层级的洞壁上。
//
//因为实体牧蛇带来的危险，我们非常建议你在探索过程中小心实体的能力。如果你听到或发觉到任何咕哝声，立即撤离。
//
//隐藏M.E.G.Level 8事故报告：
//该报告详细描绘了一次在相当程度上改变了Level 8结构和公共路线的事件，一只牧蛇在切出Level 8的过程中死亡。这只牧蛇是有记录以来最大的一只，身长大约九十里。这导致许多公共路线被有机物质阻塞，而且有些洞穴坍塌，使一些流浪者被困。M.E.G.步兵小队“Quick Match”被派遣以尽可能营救流浪者。以下是一份对该事件目击者的采访：
//
//采访记录 09/28/2020
//开始记录：09:42
//采访者： M.E.G.特工
//受访者： 流浪者
//
//M.E.G.特工：请问您可以在采访中透露下姓名吗？
//
//流浪者：不，女士，不了。
//
//M.E.G.特工：行吧，没关系。
//
//流浪者：谢谢，我就是……被发生的事吓到了。
//
//M.E.G.特工：请问您可以解释一下起初发生了什么事吗？
//
//流浪者：好的。一开始的事很简单，我和我的朋友正朝Level 9前进，之后是Level 11。我们正试着享受我们的生活。直到……那件事。
//
//M.E.G.特工：请继续。
//
//流浪者：我一个朋友在和我说话，所以我没怎么注意。那个洞穴系统是一条公共路线，我们正在等着掉进Level 9。但……突然，我整个人掉转过身，我不明白我为啥这么干，但我有种强烈的直觉驱动我去做。与此同时，我还在大叫。我们身后的整个隧道被什么东西掩盖了，那东西在快速的移动，像穿过空气一样穿过洞壁，它像是在切出。我想起来我一个朋友在后面……我不知道那东西有没有杀了他。我大叫他的名字，却没人回答。我——我不明白……我——我……
//
//(流浪者开始啜泣)
//
//M.E.G.特工：你知道吗，我们正在尽最大努力寻找你的朋友。
//
//流浪者：你确定吗？
//
//M.E.G.特工：我很确定。
//
//流浪者：我——谢谢你……我得告诉你下面的事。我们陷入了恐慌之中，不知所措。直到……那个东西，发出了巨大的叫声，它太大声了，我确信整个层级都能听到它。忽然，它停下来了，然后一切开始摇晃、坠落。层级跟遭遇了地震一样抖动。抖动的声音太大，弄得我的耳朵失聪了几分钟。剩下我们这些人都从抖动中幸存下载。我们决定继续前进，公共路线在这事发生后改变了，而新的洞穴系统出现。我们最终坐下来休息。后来我的另一个朋友掉下去穿过了洞板。然后我又连上了WiFi，她联系上了我们，并说她像之前一样到了Level 9。几个小时之后你们找到了我们，我们只有三个人了……我……我——我不敢相信我活下来了。
//
//M.E.G.特工：这听起来很可怕。对你的遭遇我们感到很遗憾。我们可以提供一些补给，够你用一阵子，你要去哪里？
//
//流浪者：我会回到营地，还有，多谢了，我会拿着它们。
//
//总结：这位流浪者在接受采访后返回到位于Level 0的琥珀营地，并且得到了足够自卫的补给。报道中提到的两位失踪流浪者被发现时还活着，虽然其中一位在受到牧蛇攻击情况危急。这是一起悲剧性事件，遇难人数尚且未知。坚持住，我们来救你了。
//
//结束记录：09:44
//
//在救援Level 8中被困幸存者的过程中有一些新发现。很多新的岩洞系统在事件发生后出现。这些岩洞系统向地下延伸了数里，其中新异常和实体的数量目前未知。有证据表明，引发此事件的 牧蛇就来自这些更深层的洞穴。在所有路线能够重新使用后，M.E.G.将开始探索那些新洞穴。
//
//基地、前哨和社区：
//我们不建议在Level 8中建立前哨或社区。然而，这不代表不可以这么做。
//
//M.E.G. 前哨”洞穴入侵者"：
//M.E.G.于2015年建立该前哨，并在2016年将其关停。
//该前哨的任务是消灭敌对实体并规划公共路线。
//该哨站有54名成员。
//卡夫拉格斯特镇：
//这一目前不复存在的团体据说由一群未知的模糊人形实体组成，而且这些实体早已消失无踪。
//该社区据称有78名成员。
//这些成员住在Level 8中的偏远地区，在该镇被废弃之前，外来者无法抵达此处。
//该镇的领导人据说比其他团体更欢迎人类。
//有证据表明该团体存在是为了向其他社区提供独特矿物。
//这些矿物似乎被用来制作粗糙的武器。
//该团体的成员据说是熟练的猎人，他们经常与其他游荡在城镇附近更有敌意的实体发生冲突。
//目前还不清楚这些实体和这个城镇的去向，但自从它被发现以来，就没有任何生命的迹象。
//发现：
//2011年，探索者团体在发现通往该层级的道路时发现了Level 8。该团体在他们于Level 9消失前列出了许多遭遇和发现。因为这次发现，许多流浪者穿越了Level 8中那些危险的大洞穴。直到2015年，M.E.G.建立了一个前哨以确保决定穿越该层级的流浪者的安全。
//
//入口和出口：
//入口
//如要进入，在Level 7中找到洞穴入口是进入该层级的最主要方式。
//穿过Level 103一段黑暗的走廊会来到Level 8。
//在Level 2.1的深层黑暗混凝土洞中游荡会来到Level 8。
//在Level 64中，通过未记录的出口会来到Level 8
//跳入Level 135的井会来到Level 8
//大多数时候，通过Level -4.1的小隧道会来到Level 8
//在Level 283的管道中爬行将会到达一个地方，在这里，彩色的游乐场管道会过渡到Level 8小的锯齿状岩石洞穴。
//出口
//想要离开，你可以随机跌穿Level 8的洞板进入Level 9
//Level 8中，罕见的小型银色通道会连到Level 75。
//在有些区域可以发现通往Level 2的出口，但我们不推荐这样做。
//传闻说，蒸馏水池中的水会把你拽入Level 7
//如果你幸运地活下来了，该层级的沥青坑会把你拽入Level 91，我们也不推荐这样做。
//从Level 8的一个角落切出或有很少的机会离开该层级会带你到Level 93。
//从Level 8的洞顶切出有极小的几率使你抵达Level 205。
//找一些旧电视，通过他们切出会使你抵达Level 104。
//随机跌穿Level 8的洞板也有极小的可能使你抵达Level 69。
//作者信息
//« Level 7 | Level 8 | Level 9 »
//
//Footnotes
//1. Level 61被发现后，这一实体就在其他许多层级中产卵。
//2. 译注：此处旧版的Entity 80已被删除，你现在所能看到的Entity 80是新版的。
//3. 译注：此处旧版的Entity 38已被删除，你现在所能看到的Entity 38是新版的。
//4. 译注：此处旧版的Entity 21已被删除，你现在所能看到的Entity 21是新版的。



import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl8{}