package lvls0;
//Level 80
// 
//
//生存难度：
//等级 0
//
// 
// 
//原生实体绝迹level80_road.jpg
//一张Level 80中公路的照片。
//
//level80_mountains.jpg
//一张山脉的特写。
//
//Level 80是后室的第81层。
//
//描述：
//Level 80是一条无限长的双向高速公路，它在两个方向上都不断延伸，且每经一段固定时间就会“循环”回原地。1此公路的最远循环记录2被记载为13.3千米 (8.26英里) 。3更远的探索理论上可行，但不甚现实。公路的周围是一片冰冷的荒地。此外没有其它人工设施。
//
//如果你是从高速路进入这一层的，你会看到左侧如喜马拉雅一般的绵延山脉。山脉距大道约40千米（25英里）。如果你是从荒漠进入的，则山脉地势总会是在路的对面。这一机制背后的原理有待研究。
//
//沙漠本身十分贫瘠干燥，不适宜任何一种动物植物以及其它实体生存。这一层级中所目击到的实体大都来自其它层级，比如猎犬和窃皮者，尽管如此，由于这一层级的恶劣生态，它们依然十分少见。这一层级不具有昼夜循环，永远处于白昼。然而，这一层级的气温可达到上至1.2 °C (34.2 °F)，下至−26.5 °C (−15.7 °F)。气温时常发生随机变化，且持续时间不会超过几个小时——短暂到无法使用窗口对象来观测这些改变。此层级中的氧气含量也很高。
//
//在走过至少3千米（1.86英里）后，你会最终看到一所被遗弃的避难所。一个附近的告示牌上标注了它的名字：“Нэгдэл”（发音为耐格戴尔）。这一单词是用一种未知的红色物质写在标识上的。4似乎在这一涂料层的下面还有其他文字，但因为涂抹早已失去可读性。这一避难所包含了一个大的圆顶帐篷，以及几辆散落在周围的篷车。日前已经在帐篷中找到了三具腐烂的尸体，以及约四十具骷髅，它们都主要分布在避难所的主体区域内。在帐篷和篷车中还发现有很多匣子，它们大部分是空的，然而小部分匣子里装有珍贵的财宝或个人物品。经过修复的艺术品在其风格上有着很大的时代跨度，上至12世纪，下至1980年代。大多艺术品都来自于前厅的中亚地区。
//
//基地、前哨和社区：
//此层级没有已知的基地，前哨和社区。
//
//入口和出口：
//入口：
//进入此层级的最主要方法是穿过Level 9并找到一条格外干燥的道路。
//顺着Level 125主路中的一条支路走下去也可以到达本层。
//走Level 410的右侧路径会来到本层级。
//你有可能会在Level 50探索时突然看到Level 80。当你成功看到并驻足片刻后，你一定会来到这一层级。
//从任何具有沙漠的层级中都有可能跋涉至本层。
//也可通过跟随Level 11中的“距沙漠X（千米/英里）”的标识来到达本层。5
//出口：
//你应当在Level 9的路上不中断地一次性前行800m（约1/2英里），随后你便会到达Level 125或Level 9。同样地，你也可以通过这种方式从Level 125到Level 9。
//一直待在道路上也会有穿越到Level 150的机会。6
//在道路旁走几英里是到达Level 46十分便捷的方式。
//在道路边行走也有概率到达Level A-1。
//在路旁走十分准确的50千米（31.07英里），且目光不离开高速路，则有机会到达Level 205。
//向着山脉走去，你将最终到达Level 93。
//附录：
//收起探险记录
//下面的记录转录自M.E.G.探险记录080-A的原始录音。此部分由M.E.G.特工Sabrina Lee在M.E.G.特工Skye Wilkins的陪同下记录。
//
//M.E.G.探险记录080-A，05/17/2019
//<开始记录>
//
//Skye: 嗯……这里就是Level 80。
//
//Sabrina: 很惊讶吗？这一层没有太多东西。
//
//Skye: ……我打算在这里建一个前哨站了。7你呢？
//
//Sabrina: 我会在这条高速路上走下去，如果你需要的话。
//
//Skye: 哦——可如果你顺着它走到另一层呢？
//
//Sabrina: 我正想去试试看会怎么样。
//
//Skye: 行吧……一会见。
//
//Sabrina: 拜。
//
//[几分钟的沉默。]
//
//Sabrina: 我只走了几分钟，但感觉像是过了好几年。这高速路没什么特别——我在别的层级走过更远的。
//
//[又是几分钟的沉默。]
//
//Sabrina: 哈……？那是Skye的前哨？
//
//[约两分钟的沉默，随即是一阵微弱的脚步声。]
//
//Sabrina: Skye！那是你吗？
//
//Skye: ……嗯？
//
//[片刻的沉默。]
//
//Skye: 等等，Sabrina？你走的不是……那个方向？
//
//Sabrina: 是啊——这里像是另一个非欧几里得层级。
//
//Skye: 好吧……没什么大不了的。我要不要也试着走一遍？
//
//Sabrina: 顺便，上次咱们聊天的时候你还在担心这条路会不会通向另一层。
//
//Skye: ……别笑话我了，待在这边……或者——那里也行。
//
//Sabrina: 没问题。
//
//[几分钟的沉默。]
//
//Sabrina: 这层级真让我度日如年。
//
//[再次沉默。]
//
//Sabrina: 我能看到远处的Skye，这说明这一层级拥有非欧几里得性质。看起来如果你在路上向着同一个方向走去，你总会回到起点，但我没法记录这一过程发生所需的时间。
//
//<结束记录>
//
//收起纪录
//下方的表格总结了人们在一次循环前所能到达最远距离的纪录。包含所有纪录的排行榜见于B.N.T.G.商人之家。所有新的挑战都应在这一基地提交并审核。下面是一篇有关如何记录一次挑战的指导。
//
//展开B.N.T.G. Level 80纪录指导
//纪录保持者姓名	交通方式	前进距离	打破纪录时间
//Sabrina Lee†	步行	~1km	05/17/2019
//Skye Wilkins†	步行	>1?km	05/17/2019
//Jude Barnes†	步行	2km	01/15/2020
//Ryu Tsukino†	骑行	4km	09/20/2020
//Ryu Tsukino	骑行	4.6km	09/26/2020
//Marie Lorenz	骑行	5.26km	10/02/2020
//Ryu Tsukino	骑行	5.72km	10/05/2020
//Stefan Dietten	骑行	6.34km	10/20/2020
//Ilva Blaus	步行	7.1km	12/05/2020
//Katie Siongco	步行	7.22km	12/07/2020
//Joel Recto	步行	7.24km	12/08/2020
//Samuel Montes	骑行	7.75km	12/08/2020
//Lynne Hayes	步行	8.18km	12/09/2020
//Lynne Hayes	步行	8.6km	12/12/2020
//Ryu Tsukino	骑行	9.93km	12/14/2020
//Ilva Blaus	步行	10.67km	12/17/2020
//Mika Yamasaki	骑行	10.7km	12/19/2020
//Ray Owen	骑行	10.78km	12/22/2020
//Samuel Montes	骑行	10.9km	02/13/2021
//Ari Tecson	骑行	11.46km	03/26/2021
//Ryu Tsukino	骑行	11.87km	05/10/2021
//Marcelo Vargas	骑行	12.6km	07/11/2021
//Marcelo Vargas	骑行	12.9km	09/04/2021
//Ari Tecson	骑行	13.3km	10/22/2021
//† 这些条目的记录时间晚于纪录的存在时间，因此未被准确验证。
//
//收起事件记录
//M.E.G.事件记录080-B
//类型：人 - 2021年3月10日
//在一项纪录被提交的几分钟后，B.N.T.G.成员Ryu Tsukino突然陷入昏阙。随后立即对其进行了医疗检查，Ryu被建议短时间内避免任何挑战记录工作。
//医疗检查证明了其身体健康发现的几项异常，例如频繁的脱发，指甲的快速生长，体重的减轻，以及皮肤和嘴唇的干燥。其二月和五月的身高数据对比证明他的身高似乎缩短了两英寸。Ryu还在这场事故的两天后被确诊了关节炎。当询问其在挑战过程中是否过度劳累时，Ryu否认了这一说法，辩解称他“从不会让自己超负荷工作”。
//
//收起信件
//下面是一封在该层级被发现后，失落者寄来的信件。
//
//这么说，汝等已找到这条古老之路。此是一个吾等长久以来始终在掩藏，欲从历史中抹除之秘密，然悲乎！——它再度回来纠缠吾等了。吾等协助旧日之人安定于此，却不知其中奥秘。吾等中汝所不知晓的一部分也曾于此处定居。此乃吾等滔天之错。勿犯吾等旧日的错误，以免汝等在许久之后的今日再度面临死亡之威胁。
//
//在收到此信后，我们曾多次尝试与失落者取得联系，以了解此层级的更多信息，但都以失败告终。任何试图在普通对话中向他们提出这个问题的尝试都只会导致这一话题被回避，或使那些似乎不知道这一层级发生过什么的失落者成员十分疑惑。
//
//作者（们）/版权信息
//« Level 79 | Level 80 | Level 81 »
//
//Footnotes
//1. “循环”指回到最初的出发点。详见M.E.G.探索日志 080-A。
//2. 循环距离记作到达一个固定的标记点时所走的距离。
//3. 创造于10/22/2021。（译者注：格式为月日年，下同。）
//4. 一小块涂料已被M.E.G.带走，有关辨别物质成分的测试也正在进行中，但目前尚无结果。
//5. 这一条相较于以上的入口来说具有较大的运气成分。
//6. 此种情况只有两宗记录在案。
//7. 此处提及的前哨站在记录完毕的几天后就被废除了。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl80{}