package lvls0;
//Level 86
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//1bf802cfb0954504.jpg
//Level 86大厅的一部分的照片
//
//Level 86是后室的第87层。该层级以办公楼的形式出现，但风格与Level 4不同。
//
//描述：
//Level 86 是一座由31层楼组成的办公大楼。你可以像在 Level 4里一样找到桌椅。在少数情况下你还能找到电脑和其他办公用品。这里几乎没有敌对实体，这使其成为一个安全的休息场所或可被建为前哨站。该层像 Level 11的其它部分一样，呈现出所谓的“11效应”，使实体的行为发生变化，使他们表现为正常人。该层可以分为两个区域，“大厅”和 “上层楼面”。
//
//大厅：
//一楼被称为Level 86的大厅。其为一有着洁净光滑地板与许多房间的现代的开放区域。这片区域有一些有趣的地方。例如：
//
//在大厅的中央你可以找到电梯，不像其他电梯可以带你到不同的层级，它可以带你到上层楼面。右边的电梯可以带你到2-16层，左边的电梯可以带你到17-31层。
//这里还有一家由无面灵经营的名为Malio's的餐厅。这是关于“11效应”已知的最有力的例子，其允许无面灵执行相对复杂的任务。它们得到物资的来源未知。
//在左侧区域可以找到行政处。在这里你可以找到几台电脑，尽管大部分不能工作，但有些功能齐全并可以上网。
//上层楼面：
//一开始，办公室很小，让人想到胡乱连通的小隔间。不通往任何地方的走廊和甚至不能进入的房间或有太多门在这个区域很常见。但是你走的越高，房间就会变得越宽敞且开始包含会议室，娱乐场所或主办公室。在上述所有楼层中都能偶尔发现无面灵，尽管他们大部分时间都只是在走廊中漫步。有时可以看到他们坐在办公室或会议室中。尽管已知它们是无害的，但强烈建议不要打扰它们。
//
//像大厅一样，上层楼面中也有一些地方与其他地方与众不同，例如：
//
//在第5层有一个展示了实体和层级的艺术画廊，其中一些绘画与在Level 57 中被发现的相同，尽管它们缺乏异常性质。我们不知道它们是否全都是复制品又或是同样出自Artist之手。
//14层被一个名为Britagne王国的团体占据，它们对外来者抱有敌意，所以建议避开这一层。
//老板的办公室在楼顶，是一个宽敞而装修精美的房间。这个地方最重要的是电脑，可以在中央桌子上找到，在这个设备上可以找到大量的各种各样的资料。最有趣的那些资料是在“信息”文件夹中的找到的，对不同层级的描述都很详细，有些是已知的，有些则是M.E.G不知道的。
//基地、前哨与社区：
//Britagne王国（Britagne Royaume）
//Britagne王国是位于14层一个团体，最初由12世纪中期来自法国西部的4名被困者组成，后来有更多的人加入了这个团体，目前他们有31人。 他们通常对非本族人怀有敌意(尽管不知道他们的“本族”指的是什么)。
//这个团体的现任首领是亚瑟一世，布列塔尼公爵。只有当他们去大厅取用品时才会被看到离开他们的楼层。建议不要与他们接触，如果谈话不可避免，要友好一些。 Britagne王国不开放交易。
//
//入口和出口：
//唯一已知的入口是在Level 11找到一个圆柱形建筑。你可以用从你进来的路出去。少数的门可以带你去 Level 4。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl86{}