package lvls0;
//Level 92
// 
//
//生存难度：
//等级 3
//
// 
// 
// 
//Level-92.jpg
//唯一一张关于Level 92内阶梯的照片。
//
//Level 92是后室的第93层。
//
//描述
//Level 92由无限多的走廊与阶梯组成，它们皆散发出微弱而稳定的红光，使整个层级笼罩在一片绯红之中。除了走廊连接的房间以外，该层级内没有实体。探索该层级的流浪者们即使一同进入，也会进入该层级不同的位置，相互隔离；然而所有流浪者团体在离开该层级后都会表示他们的确进入的是同一个层级。当你第一次进入该层级时，你会出现在阶梯上。
//
//阶梯：
//阶梯的主体是金黄色的，且如前文所言，它们会散发出黯淡的红光。一旦你踏上台阶，缓慢柔和的爵士乐将打破沉寂，并一直播放直到你离开。音乐响起的同时，你会立刻产生一种回头的冲动；然而如果你真的回头，什么也不会发生。在阶梯上坐下一段时间会使人产生作呕感，并晕眩过去，最终在Level 11内的某张长凳上醒来。阶梯的终点有一扇通往走廊的门，如果你长时间不打开它，就可以听到建议你打开此门的耳语声重复响起。这些耳语声非常轻，比本就轻柔的爵士乐还要小声。
//
//走廊：
//走廊的与阶梯一样，会散发出微弱的红光。走廊通常很短，其两侧有数扇对开门。走出走廊终点的门后可能会来到新的阶梯，或者进入一个通往Level 11的大堂。走廊两侧的每扇门都连接着一个公寓房间，进入会后随机发生不同的事件。每个房间里都存在1-3名或更多的实体，他们外表与人类无异，做着不同的事并忽略进入的流浪者。从房间内的窗户向外看，会看到处于午夜的Level 11；房间里所有的钟表都停滞在凌晨12:32。大部分房间内存在进入不同层级的入口，或者一部电梯，通常指向Level 65。在这些房间里，会发生一些正常或怪异的事件，详见下文。
//
//事件
//下为部分流浪者团队在探索Level 92时遭遇的事件，每个事件的共同点是它们发生时都会有爵士乐持续播放。据称该层级内还存在更多事件，但没有被记录下来。
//
//事件一：
//这一事件最为普通也最常见。房间里会有一个正在看电视的人，完全忽略你的一举一动。一旦你试图接触此人，将会有重复的耳语声警告你不要这么做。随着你与此人的距离缩短，耳语声会逐渐变响、语速变快。在接触到此人的瞬间你将即刻昏迷，并在Level 0中苏醒。
//
//发生这一事件的房间结构是固定的：进入房间后，右手处为盥洗室、正前方为卧室与厨房、左手处为客厅；看电视的人就坐在客厅内。从客厅的窗户向外望去，就会看到Level 11在午夜的景象。客厅内的家具在每次事件中会有轻微的变动，但具体位置与类别不会改变。电视内播放的节目在每次事件中都会变化，通常为20世纪80到90年代的电视频道。
//
//但在一位流浪者的报告中，电视内出现的是他自己的实时影像，疑似为从房间窗外拍摄。在他从窗户向外观察时，能看到某栋不远的建筑内有类似摄影机的白色光电，旁边站着一个若隐若现的黑影。
//
//事件二：
//这一事件稍显古怪。在进入房间后正前方有一个厨房，会有一个女人在其中向你问好，并表示自己正在做饭，询问你是否饥饿。这一女人的形象在每次事件中都不同。回答否，则她会请你离开，或自行在房间中休息；而在房间内休息一段时间后，你将陷入昏迷，并在Level 26内醒来。回答是，则女人会带你来到客厅的桌旁，请你在此等待晚餐。客厅里可能有一人在看电视，如果有，那么他会忽略你的存在。
//
//在此等候一段时间后，女人将会上餐。在不同的事件中晚餐的品种与类型都会变化，其口味与质量也是随机的。如果你在上餐后拒绝进食，女人将会把食物倒入垃圾桶；同时有可能会发生事件一中的“摄像机事件”，即电视上的画面切换为你的实时影像。
//
//无论你进餐与否，女人都会表示自己想要在卧室中独处一会儿，并告知你可随时离开。若你一直留在客厅，则什么都不会发生。若在女人离开时跟随她进入卧室，则会听到重复的耳语声警告你不要这么做；随着你与卧室的距离缩短，耳语声会逐渐变响、语速变快。在你打开卧室门的瞬间，耳语声将即刻消失，门后是一个普通的卧室，但女人不在其中。
//
//一旦进入卧室，门将自动关闭并从外上锁。你将很快陷入昏迷，并在Level 20中醒来。
//
//事件三：
//这一事件同样稍显古怪。发生这一事件的房间中有一对已婚人士，通常是一男一女。妻子将会邀请你进来歇一会儿，引你进入客厅坐下，并告诉你她有些其他事要去做；而丈夫则在旁通过电话与上司交流关于工作的事。如果你此时再去看妻子，就会发现她同样在与某人通电话。此时两人都会忽略你，且返回走廊的门会被锁住。
//
//几分钟后，丈夫将挂断电话并走进客厅，也就是你所处的地方。他似乎因电话的内容受到了刺激。他会在你身边坐下，询问你几个问题，通常是关于你的生活的。他表现得就仿佛你曾来过这里。此刻的丈夫表现得与普通人无异，但如果你询问他什么问题，显然会进一步地刺激到他。
//
//丈夫很快将对你失去兴趣，转身走进妻子所在的卧室，抱怨为什么她每次都会把不同的人带进来。他们很快就会开始争吵，即使坐在客厅也可以清晰地听见。在争吵的过程中夫妻将会数次提及你的存在，仿佛你是这里的常客。如果你试图走进他们争吵的卧室，与事件二中类似的耳语声会再次出现。打开房门的瞬间争吵声与耳语声即刻停止，卧室内空无一人。走入卧室后房门自动关闭并上锁，你将昏迷并在Level 4中醒来。
//
//如果你不选择介入这次争吵，丈夫会在争吵结束后生气地离开房间，并午夜决定前去工作。而妻子则会从中走出，请你离开这里。如果拒绝，耳语声再次出现，直到你昏迷并在Level 5中苏醒。
//
//事件四：
//这一事件相当稀有。进入房间后会发现其中大部分家具都已被损坏，散乱在地面上。有三个人在内谈话，两人貌似警察，剩余的一个则是普通人。他们谈话的内容为两名警察审问第三人为何突然闯入、并破坏了这个房间内的一切东西。
//
//介入交谈后，两名警察将转向询问你事件的经过。若回答不当或拒绝回答，则他们会礼貌地请你离开。此时如果不离开则会发生如上述事件中的耳语-昏迷，你苏醒的地点将是Level 42。
//
//如不选择介入而是搜索房间，可以发现地上有一本笔记本，其内写着“我会找到你”的字样。在你看完这行字的瞬间，被审问的第三人将会暴起发难，试图攻击你。即使离开此房间，他也会从房间中冲出并在整个层级的范围内追赶你。两名警察将跟在他身后试图阻止他。一旦被他抓住，你将即刻昏迷，于枢纽内醒来。
//
//事件五：
//这一事件同样较少发生。在这一事件中，一个通常为男性的人会邀请你进来，并试图带你在整个房间中走一圈，称其为“领你一游”。如果你拒绝，他会开始向你哀求这么做，最终演变为对你攻击。这时你将昏迷，并在Level 30内醒来。
//
//如果你同意，他会开始带你参观这里的每个房间。这些房间具体为何是随机的，但你会有到一种被监视的感觉。这里的每扇门上都有裂缝，一旦试图触碰它们，男人就会从你身后拉扯你，并使你进入昏迷，来到Level 40。
//
//参观结束后，你将突发强烈的便意，并不得不提出借用一下盥洗室。在进入盥洗室后，便意会逐渐消失，你感到某种古怪的事情正在发生。这时如果从盥洗室门上的裂缝向外看去，你将看到一个模糊的身影正用三脚架向里拍摄，并即刻陷入昏迷，最后出现在Level 1。
//
//基地、前哨和社区
//“恐惧”
//在从走廊进入某个房间后，你有很小概率不遇上任何一个事件，而是遇到他们。
//“恐惧”是一对夫妻，可确认并非实体。
//他们的名字是Jimmy与Petra。
//他们在这里开始发生古怪的事件以前就生活在这儿了。
//他们都表现得焦虑且偏执。
//他们无法离开，或是提到发生在这里的事件。一旦他们这么做了，就会昏迷过去。
//他们声称无时无刻不被耳语声侵扰。
//他们居住的房间看起来很普通，其内有一台会自动补充餐饮的冰箱。
//入口与出口
//入口
//在Level 34与Level 42会随机出现一些黑色的洞，进入它们即可来到Level 92。
//出口
//在离开Level 92后大约30分钟里，依然能听到爵士乐在耳边回响。
//
//在房间中的不同事件会将你引入不同层级。
//在走廊联通的门中，有一些通往Level 0、Level 5、Level 9与Level 37。
//有一些房间内存在一部电梯，进入后通常会到达Level 65。但在某些情况下，这些电梯也通向其他随机层级。
//找到礼堂，从中切入Level 11。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl92{}