package lvls0;
//Level 94
// 
//
//生存难度：
//等级 3
//
// 
// 
// 
//Level-94-1.jpg
//Level 94的镇子。
//
//Level-94-2.jpg
//Level 94的山丘
//
//Level-94-3.jpg
//Level 94的悬浮城堡。
//
//Level-94-4.jpg
//Level 94城堡内部。
//
//Level 94是后室的第95层。
//
//描述：
//Level 94是由一座大镇子、一座悬浮的城堡和长满草的山丘组成的，但这里的所有物体都受到某种颗粒化的影响，使一切看起来好像是被精心制作出来的。主镇是安全的，在白天没有实体出没。镇子的中心有座大型喷泉，里面流淌着杏仁水。这个镇子似乎是20世纪30年代的风格，有种定格动画的感觉。镇子上还有些小房子，里面摆着同样小的家具，都是1930年代到1950年代的。镇上还有30年代风格的汽车和装满杏仁奶的送奶车，有不时播放欢快的卡通音乐的大喇叭11。在这个阶段，一切都是无害的，直到夜幕降临，音乐完全停止后，被称为“动画”的实体开始出现，被其发现会遭受猛烈攻击。其他在夜间出没的实体有笑魇，窃皮者，猎犬和雄性的死亡飞蛾，也会出现尸鼠，但是在这种定格动画的风格下，它们的外观已经进化得和普通老鼠一样了，这是因为“动画”会攻击任何看起来不是动画风的东西。Level 94的草地山丘似乎会无限延伸，那里只有几辆停在中央的古怪汽车和一座似乎含有杏仁水的水塔。山丘的奇怪之处在于，可以在这里找到随机的成套家具，甚至是单间的房子，或者有时只是一面旁边摆着家具的墙。在山丘上，你会找到一座“透明山”，上面有悬浮的城堡。
//
//透明山上的城堡
//此处是Level 94中真正能损害你理智的地方，所以请携带些杏仁水。由于未知原因，照片上的该区域会失去动画效果，这可能意味着这里不受到层级的影响。这座城堡像是一处古怪的娱乐场地，里面有些房间的主题非常欢快。你能够找到海洋球坑、游乐场和一间动画工作室，内部有一个微型的城镇和其中实体的复制品。城堡里唯一出没的实体是一种被称为“机器人”的1930年代老式机器人玩具，以动画风格出现。它们似乎是这座城堡的守卫，如果发现你与城堡内的任何物体互动，它们就会对你产生敌意。在似乎是无限大的城堡内部探索一段时间后，你可以找到一扇宏伟的大门，这通向觐见室，在那里你会遇到“王”，起初他看起来没有敌意，但实际上他能够控制你，使你成为“动画”的一部分，但在这一切之前，他会考验你一次，一次以动画形式让你感受自己的噩梦的考验。如果你碰巧通过了，他就会放出一阵光来，使你回到镇上，或者被送到某个主要层级去。
//
//这里是该层级的探索日志：日志
//M.E.G. Level 94 的发现
//M.E.G.事件日志862｜类别 层级｜2020年5月2日
//此份日志记录了Level 94的发现过程。事发时，有人经终点到达枢纽1，之后进入了Level 94。为保护该幸存者隐私，下文皆称其为“流浪者”。“第一响应”兵团首先在“2A区语音频道”接收到了流浪者的信息。随后，由于“导火索”兵团当时正在执行其他任务，M.E.G.决定派出“罗经点”兵团前去完成救援行动。此份日志中涉及到的团队包括：“罗经点”兵团、“导火索”兵团、“第一响应”兵团以及“监督者”团队。
//
//日志第一项内容为流浪者与“第一响应”兵团成员Harry的语音通讯记录。
//
//记录开始：
//（时间：19:26 PM2）
//流浪者：有——有人——（似乎正在调整语音频道）
//Harry：请你再转一下调谐旋钮……
//流浪者：有——有人吗？！听得到吗……我——
//Harry：听到了，很清楚！
//流浪者：啊太好了！你们快帮帮我！
//Harry：你那边什么——
//流浪者：周围的东西都是假的！就像……就像……像是人造的，我不好说……你们先来救我再说！
//Harry：可能是新层级，我们会派“导火索”兵团去——
//流浪者：快点！我的杏仁水快喝完了！我感觉自己快疯了……求你们……
//Harry：你能告诉我你在事发前最后去哪里了吗？我们……
//流浪者：好好好……我……我在……
//Harry：怎么了吗？
//流浪者：我周围安静了，没有音乐了……
//Harry：请你先——
//流浪者：晚……晚上了……我……我……等下……这是？……
//Harry：喂？！你可以告诉我们你最后去哪里了吗？这样我们才能去救你。
//流浪者：我操这都是什么？！有，有好多木偶！它们来追我了，我……
//Harry：喂？！*叹气* 等等吧。
//（时间：09:47 AM）
//流浪者：有人——
//流浪者：喂！
//Harry：听到你说话了朋友。
//流浪者：嘿！我是昨天晚上的那个……呃，这么说好怪啊。
//Harry：你还活着！
//流浪者：对，但是我没有杏仁水了。
//Harry：哦哦，你能说一下你最后在哪里来着吗？这样我们才能去找你。
//流浪者：哦好，稍等……嗯，我本来在终点，结果我逃出去了。之后我到了枢纽，看见地上有一个入口，就进去了。这个入口很显眼，一下子就能看见。
//Harry：好的，现在“导火索”兵团有还有别的任务，我们得派“罗经点”兵团过去了。监督者-C已经同意你的救援请求了。
//流浪者：好，谢谢！你们来的时候要是晚上了可得小心啊。
//Harry：收到。
//记录结束：
//日志第二项内容为“罗经点”兵团前去执行救援，并探索此层级的过程。救援小队队长Reed负责记录层级中发生的事件3。
//
//记录开始：
//（时间：13:18 PM）
//OK，开始了。呃，我们刚刚从终点里出来，说来很久都没这么做了。我们对终点的“陷阱”机制还是有些办法的。Dan4已经在绘制我们的行进路线了，Daniel就是厉害啊，做事真麻利。现在，我们已经很靠近枢纽了，我心里很激动，那个人说的新层级好像还挺有意思的。就是，“人造的”之类的。不知道到底是什么样。我们探索到新东西会立即报告的。
//
//（时间：15:34 PM）
//好的，我们刚刚找到入口了。墙上开了一个口子，一直开到地上，就像直直地切出来一个长方体一样。流浪者不是说在入口在地上吗？可能这个入口每次开启的时候位置都会变吧，还挺奇怪的。我们把绳子绑在枢纽里的一根柱子上，沿着绳子下到新层级了。刚下来，Randy就说“兄弟们，这下可不是在堪萨斯啦5”，真把我逗笑了。不过他说得也没错，这个地方太古怪了，仿佛自带一层滤镜。我还以为我到了《圣诞夜惊魂》6里了。这里就像定格动画一样，东西还都是50年代的，还有送奶车！不过送的不是牛奶，是“杏仁奶”，东西不一样，很杏仁。这个奶可难喝了，不过喝点还是有帮助的。Jack拿了好几瓶，说是做饭的时候要用。这个地方的房子也和别的东西一样，很卡通，很古怪的样子。里面有老式的电视机，50年代的那种，也是像动画一样。我们已经看了很多房子了，这种滤镜一样的效果都搞得我头疼了。不过我就不多说了，还得和我的队员们执行任务。
//
//（时间： 16:34 PM)
//这里挺牛的哇，有座喷泉，里面喷的是杏仁水，而且这个喷泉也是跟其他东西一个样儿。这里很多柱子上的喇叭一直在放那种卡通音乐，一直是一个调调，一遍一遍又一遍地放，听得我耳朵都起茧了。还有就是，天好像有点黑了，太阳快落山了，我们已经在这个鬼地方待了这么久了啊。然后呢，我们找到了一座水淹的屋子，里面是正常的水。我一看就知道这里能去Level 7，就是说，至少找到出口了。那个流浪者还是没见着，不知道他有没有遇到危险。啊，说起危险，我记得那个流浪者说晚上要小心木偶什么的。到了晚上我们会留意的，一会儿再说。
//
//（时间： 20:53 PM)
//好的好的，刚刚，天黑了的时候，音乐也停下来了。不过它刚停，我们就听到周围好多地方有奇怪的笑声。是那些木偶一样的实体发出来的。这些东西有大有小，形状也不一样，穿的衣服也是乱七八糟。它们动起来就跟其他东西一样，像动画似的。它们过来攻击我们是因为我们长得不够卡通吗？我们还看到了些别的实体，有窃皮者、笑魇之类的，但是那些木偶直接把它们给手撕了！这力气大得有点奇怪了吧？我们看到两个木偶只用了大约四秒就撕开了一只窃皮者。我们逃跑了，想找个地方避避风头。Jack提了个好主意，先去Level 7待一会儿，扎个营，等到白天再回去。Jess帮我们殿后，大家都跑出来了，我们没离出口太远，免得回不去了。之后我们就开始扎营，结果竟然有只木偶跑出来攻击我们了。幸好它没得逞——它还没碰到我，Randy就跑过来一棍子把它的木头脑袋打掉了。我真是吓得不轻，当时我离那个家伙很近，Randy差点把我也伤着了。我跟他说看着点，别把我也给敲昏敲死了。我都不知道他哪里来的棍子。哎，总之我们现在在Level 7了，正等着夜晚结束。Jack正在做饭，就快做好了。他往饭里加了点之前的杏仁奶，但是这个东西流出来的时候还像是定格动画那样，太怪了吧。就这样吧，等我们继续探索探索再讲。
//
//（时间：09:18 AM）
//大家，现在已经天亮了，那个层级里难听的音乐也又开始播了，不过我们听到了反而觉得轻快了一点，这下我们又进去探索了。Harry跟我们说那个流浪者还活着，现在还能联络上，说是他在一个浮空的城堡里。嗯哼，我们发现这个城堡了，它还挺大的，一开始进来的时候怎么没看见呢？现在我们正在朝城堡前进，穿过各种小山丘、道路。说来，我们看到了一些奇怪的东西。本来，我们旁边的房子还比较正常。但是，我们越靠近那个城堡，房子就变得越奇怪。比如，有一个纯粹是厨房的屋子，在田野里孤零零的，周围没有房子的其他配件；还有一间卧室，但说是卧室，却只有一面墙，一个地板，一些家具跟一张床。这还不算完，之后连房子都没了，只剩一堆一堆乱七八糟的家具。Randy在一堆破烂家具里翻出来一个水槽，里面有枚硬币。硬币上印的年份是1953，别说，正和这里的各种东西年份一致。我们还看见几只尸鼠，它们的样子看起来也像动画，可能这样就能防止那些木偶攻击了吧。我们现在很靠近城堡了，我们发现它底下还有座山。城堡并不是浮空的，只不过这个山是透明的，好奇怪。OK，等我们探索一下城堡再联络。
//
//（时间：12:31 AM）
//我现在在一个房间门口，我暂时管它叫王座房间。我在等其他人过来。刚刚有玩具机器人一样的东西追我们，害得大家走散了。我跟你们说说怎么回事。事情就是，我们进了城堡，发现里面的东西竟然都是正常的，没有那种动画一样的感觉。当时我可高兴了，我要是再一直看那些卡通玩意儿估计真受不了了。然后呢，这个城堡里面就像那种游乐场所，开嘉年华的时候会出现的那种。里面的走廊歪歪扭扭的，有连通到各个地方的滑梯，还有海洋球之类的东西。我还发现了一个有点意思的房间，像是什么动画工作室，里面有这个层级里整个镇子的模型，而且还有很多迷你的实体模型，好酷啊。还有张桌子，上面放了很多纸，还有这个层级的一些速写，搞得好像是真要拍个电影了。我们瞎摆弄了一通，结果跑过来两个机器人攻击我们，好像是城堡的守卫。大家就分开逃跑，好尽快甩掉它们俩。有一个专门冲我来的，我就使劲跑，跑进了一个灯光能亮瞎眼的走廊里。机器人好像在里面看不清了，我就逃脱了。我找到了一扇超大的门，等着看其他人能不能找——诶呀，Jess说她刚刚到门口了，Jack也说找到了，但是我没看到他们俩。难不成这个门会随机出现在各个地方？那等Randy也找到了，我们就直接进去。我这边还得和队友交流情况，等会儿再说吧。
//
//（时间： 13:07 PM)
//我现在在Level 1，我记不清具体发生什么了，只能回忆个大概。我们进了那个王座房间——里面确实有个王座——进去之后我和队友们就会面了，但是进门前我们都没看到其他人。那个流浪者也在里面，他看起来动弹不了了，但是还在一直说话，好像是被那个“王”控制了。哦对，我忘了说了，这个“王”是城堡的主人，它说它正在“转变”，这个“转变”影响了那个流浪者，控制了他的头脑。这个实体全身都是石头，却能正常地行动、说话。本来我们小队准备和它干一仗，但是它突然造出来了我小时候特别害怕的动画角色。我吓到了，但我之后就懂了，它不过是取出了我头脑里一直害怕的东西。于是，这个本来该让我害怕的动画角色反而让我怒了，我和队员们冲上去把它干碎了。这时候那个“王”说话了，它说，恭喜我们击败了心中的恐惧。然后它就爆炸了，就是，真的就爆炸了，还有耀眼的光蹦出来呢。然后，我就到了Level 1，M.E.G.现在也赶过来了。Jess和Randy还在那个层级里，流浪者也是。他们几个出现在了一条路上，离小镇很近，他们应该有时间去Level 7。Jess还说，她拍了一张那条路的照片。Jack现在在Level 4，M.E.G.已经去找他了。太好了，大家都平安无事。我是Reed，“罗经点”兵团小队队长，我的记录到此结束。
//
//记录结束：
//“罗经点”的所有队员以及流浪者最后都被成功营救。队员们已经被转移至Level 07的Alpha基地。Reed将该层级编号为“94”，相关信息可在此查看：Level 94。流浪者被送往B.N.T.G.商人之家，并计划在那里居住数月。数据库中已录入新条目：“动画”、“王”。
//
//作者信息
//Footnotes
//1. 译注：原文如此，此设定可见于Level 94出入口部分。值得一提的是，Fandom后室wiki中有一条设定是在终点“运行程序H97Run.exe会被传送到枢纽”。
//2. 译注：原文如此。
//3. 译注：下面的内容，原文存在一些不规范的表达或错别字，可能也是为还原“真实情况”，就不一一说明了。
//4. 译注：即Daniel的昵称。
//5. 译注：俚语，意为到达了一个不熟悉、不舒适的地方。
//6. 译注：1993年的一部动画电影。
//7. 译注：早期设定中，Alpha基地确实位于Level 0。现在的设定中，则是Level 1。
//
//基地、前哨和社区：
//由于“动画”在夜间出现，所以很难在Level 94成组织生存。目前M.E.G.正寻找在该层级建立前哨的办法。
//
//入口和出口：
//要进入，你必须先抵达终点并从中成功逃离，然后前往枢纽。在那里的随机区域找到一个长方形洞口，洞口会在你进入后慢速合拢。要退出，你必须通过“王”的考验，并被传送到随机主要层级，或者层级里有些房子也通往Level 7，Level 9和Level 53。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl94{}