package lvls0;
//Level 97
// 
//
//生存难度：
//等级 3
//
// 
// 
// 
//lighthouse-1.jpg
//Level 97灯塔的一张照片。拍摄于帆船残骸。
//
//Level 97 是后室的第98层。
//
//描述：
//Level 97的已探明部分由一个被咸水海洋环绕的小岛构成。该岛被杂草及苔石所覆盖。有若干风化的墓碑广泛的散落在岛上各处。偶尔，岛上会出现一些新的墓碑，但很少发生这样的事。Level 97没有昼夜更替，永远呈现出夜间的状态。天上没有星星，但在天空中总是可以看见一个巨大的新月。虽然没有云和降水，但Level 97总是被一股薄雾所笼罩。
//
//岛屿中心有一座巨大的白色灯塔。Level 97的性质导致这座灯塔的内部尚未被探索过。顶部的灯光总是保持明亮，缓慢旋转，穿透雾气。任何被灯光照到的物体都会以未知的方式被摧毁。环绕岛屿的海洋一直延伸到视野的尽头，尽管水非常深，但已经证实并不是没有底。近岸水域有一艘18世纪的帆船残骸，似乎被冻结在原地，不因海浪而产生任何运动。与Level 97的其它地方相比，这艘帆船残骸显得更为安全，因此M.E.G.在这里建立了一座哨站。
//
//在Level 97的岛上，有几个被称为“食尸鬼”的人形实体。这些食尸鬼类似于处于极度腐烂状态的尸体。当食尸鬼看到流浪者时，前者会向后者走去。虽然食尸鬼可以被赶走，但它们的数量很多，所以流浪者们很容易被逼入绝境。因此，不建议登上岛屿。如果食尸鬼抓住了什么人，前者会牢牢抓住后者，把他们固定在那里。此时，灯塔的光就会停止旋转，向下直直指向流浪者，把他们杀死。
//
//入口和出口：
//入口：
//Level 97可以通过Level 17随机一个门或穿过Level 532的走廊来进入。
//
//出口：
//穿过帆船上的某些墙壁可以到达Level 100。船上还有一扇门，可以通往Level 372。
//
//补充文件：
//无线电广播：
//Level 97的无线电台接收到一个循环的摩斯密码传输，且似乎一直存在。
//
//传输记录：
//
//
//解码记录：
//救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们   救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们   救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们   救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们   救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们   救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们   救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们   救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们   救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们   救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们   救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们   救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们   救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们   救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们   救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们   救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们   救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们   救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们   救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们   救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们   救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们   救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们   救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们   救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们   救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们救救他们   
//
//我已经听了很久，现在它一直萦绕在我的脑海里。还有更多的秘密亟待寻找。我不知道我是如何说服Andrew让我在这里设立哨站的，我猜他只是相信我。我只知道，自从我第一次听到那些哔哔声起，甚至在我们解码之前，就好像有什么东西在召唤我。我需要弄清楚那是什么。明天我要做一件非常危险的事情，所以我要先写下一些想法，以防万一。
//
//首先，在给M.E.G.写报告的时候，我在里面做了一点修饰，我想我写了一些关于新的墓碑偶尔会出现的事，但我们不知道为什么。嗯，我对其中一个墓碑的出现原因有个特别的见解。那是在一次失败的任务之后，我失去了我的一个好朋友。
//
//把几个不眠之夜倾注在聆听无线电广播和用望远镜观察灯塔之后，我们终于决定要过去看看那里面究竟有什么。我需要留几个人在后面，于是我只带了Joshua和Lucy。在大雾里，我们走散了。突然我听到Joshua的呼救声，但那时已经太晚了。我向呼救的方向看过去，只见一束光透过雾气照耀过来。我只能惊恐地看着Joshua的身体融化，看着他的肉从骨头上滴下来，用空洞的眼窝恳求我救救他。最后，当我感觉到露西拉着我的胳膊时，我恢复了理智。
//
//那天晚上我停止了这个项目。与我对朋友的死亡感到的痛苦相比，我对找出这个Level的秘密的痴迷显得微不足道。但后来，我看到了希望。依靠我的望远镜，我看到不仅出现了一个新的墓碑，而且现在食尸鬼的数量变成了十六个。我在任何地方都能认出那个愚蠢的发型。那是Joshua。当他漫无目的地行走时，我可以看出他的状况并不好，但也许，只是也许，他可以被拯救。那是两个月前。我知道Lucy和Nathan不会让我再踏上这个岛，但我能够让Alex站在我这边，她会帮助我抓住Joshua。带着渔网，我们今晚就要出发了。我很抱歉Lucy。我很抱歉，Nathan。我保证我会活着回来。
//
//—Alice
//
//我们做到了。Lucy和Nathan今天早些时候离开了，因为他们实在没法接受Joshua现在的样子。他们说我应该顺其自然。我以后会让事情回到正轨的，但现在，我有更重要的事情要做。我把Joshua绑在桌子上，然后我注意到的第一件事就是敲打。他的食指，前两个关节的骨头不见了，但一直敲打出一个重复的信息。那是摩尔斯电码，与传输的模式相同。“救救他们救救他们救救他们救救他们”。 我当时仔细听着，那时他看起来竭尽了全身所有力气。嘶哑的低语声中，他用一种几乎让我听不见的声音说：“让我死吧，求你了。”
//
//之后我不得不离开房间。我还没有勇气再进去，但我想现在是时候完成我的工作了。是时候去一趟灯塔了。我必须现在就出发，在Alex能阻止我之前。在我能改变想法之前。
//
//—Alice
//
//<记录开始>
//
//[沉重的呼吸声]
//
//[摩尔斯电码的哔哔声。下面是哔哔声的解码文字抄录]
//
//[黑暗中的一束光。我阻止了他们在海岸上的冲撞。]
//
//Alice： 我做到了。我进来了。这里——非常阴森。好黑啊。我可以听到哔哔声，但这和广播里的声音很不一样。现在它很响亮，好像就在我旁边。我——我几乎不敢打开我的手电筒。
//
//[手电筒发出的咔嚓声]
//
//[更沉重的呼吸声]
//
//[于深渊中拯救，我回应他们的呼唤]
//
//Alice: 老天啊。
//
//[我赐予他们生命。我拦下了死亡，不求回报]
//
//Alice: 这是个巨型心脏。它——它在跳。
//
//[我引领他们来到这个安全的地方。这个无人侵犯的地方]
//
//Alice: 我——我不知道怎么做，但我知道我得做些什么。
//
//[他们行走在安宁中。他们行走在不朽中。他们降生，因灵魂的拯——]
//
//[巨响]
//
//<记录结束>
//
//在一次M.E.G.成员Alice Connelly失联的事件中，Level 97出现了结构性转变。修订后的描述如下。
//
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//lighthouse-2.jpg
//一张Level 97岛屿的照片。
//
//Level 97是后室的第98层。
//
//描述：
//Level 97的已探明部分由一个被咸水海洋环绕的小岛构成。该岛被杂草及苔石所覆盖。17个风化的墓碑广泛的散落在岛上各处。 每个墓碑周围都生长着各种鲜花。Level 97没有昼夜循环，总是呈现出夜晚的状态。天空中没有星星，但在天空中总能看到一个巨大的新月。Level 97没有天气，包括云和雾。
//
//岛屿中心有一座巨大的白色灯塔的废墟。环绕岛屿的海洋一直延伸到视野的尽头，尽管水非常深，但已经证实并不是没有底。近岸水域有一艘18世纪的帆船残骸。
//
//入口和出口
//入口：
//Level 97可以通过Level 17随机一个门或穿过Level 532的走廊来进入。这两种进入方式都通往帆船残骸，所以建议所有进入本层级的流浪者都做好游出水面的准备。
//
//出口：
//残骸上有一扇门，通往Level 372。在灯塔的废墟上还有一个舱门，可以通往Level 522。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl97{}