package lvls0;
//Level 93
// 
//
//生存难度：
//等级 4
//
// 
// 
// 
//Level-93.jpg
//Level 93的第一张照片。
//
//Level 93是后室的第94层，于████年██月██日被一支来自Level 3M.E.G.搜索队发现。
//
//描述
//Level 93表现为一座看似没有基地的山，外观类似喜马拉雅山珠穆朗玛峰。如果Level 93 确实有基地，那么它还没有被目击/记录。
//
//实体
//所有目前已知的实体均无法在Level 93存活。实体在Level 93留下的唯一痕迹是其埋在雪中的尸体。无物理形态的实体(包括但不限于“笑魇”, “灌篮崽”)均不在Level 93繁殖。
//
//“如果一个层级杀死了所有想杀死你的实体，你就知道这个层级有点东西了。”
//-匿名Reddit用户
//
// 
//
//异常性质
//组成成分
//Level 93的组成十分单一，仅包括冰、雪、钠、碳、少量铁、汞、砷和铋，偶尔还有石英。因此，山体滑坡和/或雪崩发生的可能性极高，使得探索Level 93具有极大的风险。探索Level 93时建议使用防护装备。
//
//冰川
//冰川是Level 93中能被观察到的最常见的特征。
//
//Level 93 中的冰川由冰、雪、干冰、钨、铷、低浓度的铁、石英、丙酮、水、汞以及更稀有的碳组成。
//
//Level 93的冰川似乎并不遵循已知的物理定律。Level 93中的冰川已被观察到出现下列现象：在Level 93中移动、膨胀和收缩、吸收Level 93的部分区域以及完全凝固。
//
//其他特征
//Level 93拥有其他异常性质。（其中部分有待确定）
//
//树木 - 已证实
//Level 93的树木只能在Level 93初期天气，10°以下时于超过1█m2的平坦区域观察到。在Level 93中发现的树木种类包括：银桦木、红橡木、亚马逊玫瑰木、白云杉等。不适宜Level 93气候的树木以未知的方式在Level 93内正常生长。
//
//地震活动 - 已证实
//Level 93的山峰有1/300,000的概率自发喷发，但是，随着在Level 93中停留的时间增加，该概率成倍增加。在喷发期间，会观察到以下事件：
//
//少于1秒：喷发发生，顶峰被毁坏，事发顶峰冒出浓烟。
//~50秒1：喷发产生的碎片开始落地。
//1-3分钟：岩浆开始从山上加速流出。
//3分钟以上：浓烟冒出，喷发结束。
//Level 93中的岩浆流速似乎是现实中及其他层级中的1.9倍。
//
//湖泊 - 已证伪
//2022年u/Yttrium宣称，湖泊是最稀有的特征，存在于超过14█m2的陆地上。
//
//帐篷 - 已证实
//Level 93的帐篷通常出现在距山顶任意距离任意规模的平坦区域，表现为便携式红色/黄色帐篷。 Level 93的所有帐篷通常都是“猎犬” 和 “悲尸”的巢穴。 实体有 30% 的几率在帐篷内产卵。
//
//由于此类现象，不要进入Level 93的任何帐篷。
//
//其它现象有待记录
//天气现象
//与后室中许多其他层级不同，Level 93气候稳定，但十分恶劣。在Level 93观察到的天气现象包括：
//
//<10分钟：
//气温：-9.08摄氏度
//风力：32
//小雪
//>10分钟 | <20分钟：
//气温：-24.05摄氏度
//风力：5
//中雪
//轻度雾
//>20分钟 | <30分钟：
//气温：-34.88摄氏度
//风力：8
//大雪
//中度雾
//轻微雷鸣
//小冰雹
//>30分钟 | <1小时：
//气温：-46.15摄氏度
//风力：10
//暴风雪
//重度雾
//闪电
//中度冰雹
//>1小时 | <2小时：
//气温：-63.96摄氏度
//风力：12
//猛烈的暴风雪
//极大的雾
//雷雨
//大型冰雹
//>2小时：
//气温：-88摄氏度及以下
//风力：12及以上
//猛烈的暴风雪
//极大的雾
//猛烈的雷雨
//大型冰雹
//注：在Level 93中观察到的最低温度为-186.94摄氏度。
//
//发现
//Level 93被一支M.E.G.搜索队在探索Level 8深处时发现。以下为Gamma基地与09号搜索队之间通讯记录的存档记录：
//
//存档记录: L93发现日志
//
//09号搜索队-3：听得到吗？听得到吗？
//
//Gamma基地-34：我们听得到。
//
//09号搜索队-3：Level 8在实体方面没什么特殊的。
//
//Gamma基地-34：好吧，那你们回基地吧。
//
//09号搜索队在未知情况下离开了Level 8，预期进入Level 9，却意外进入了Level 93
//
//09号搜索队-3：这不是Level 9。
//
//Gamma基地-34：这是什么意思？
//
//09号搜索队-3：我们离开Level 8，然后出现在了一座山上。我们不知道怎么回事但就是这样。
//
//Gamma基地-34：能描述一下周围环境吗？
//
//09号搜索队-3：呃……这看起来是座山，像珠穆朗玛峰之类的。我看不到地平线，所以它一定有数百英里高，而且我认为这也不是山顶。
//
//Gamma基地-34：还有其它的吗？
//
//09号搜索队-3：这个层级一定程度上有天气系统。
//
//Gamma基地-34：你能描述一下你观察到的天气现象吗？
//
//09号搜索队-3：呃，在我们开始对话之前在下小雪，现在下得大了一点。
//
//Gamma基地-34：好的，尽快尝试离开。
//
//[记录结束]
//
//据悉，09号搜索队在45分钟后离开该层级，然而，由于Level 93的低氧环境，该队所有成员均陷入缺氧并于几分钟后死亡。因此，没有记录到任何出口。
//
//基地、前哨和社区
//由于其恶劣气候，该层级无已知的基地和/或前哨。
//
//入口与出口
//入口
//Level 93能从Level 8, 47, 115, 135和山村进入。
//
//Level 8
//从Level 8的一个角落切出。
//有1/1000的概率从Level 8随机进入。
//Level 47, Level 135
//将自己埋在雪中。
//Level 115
//切割Level 115的一面墙。
//山村
//在森林中滞留4小时。
//出口
//Level 93无已知出口。09号搜索队应当是发现了出口，但该出口没有被记录到。据称，一名流浪者从Level 93进入了Level 135，但该途径未被成功重复。
//
//Footnotes
//1. 译注：原文如此。
//2. 根据蒲福风级测定。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl93{}