package lvls0;
//Level 96
// 
//
//生存难度：
//等级 2
//
//安全
//不稳定
//特殊实体
//Level 96是后室的第97层。
//
//描述
//KaABVlXnv9PIU7w.jpg
//一张Level 96内标准通风管道的图片。
//
//GH4WoKfZSN9skQg.jpg
//通风管道中磨损部分的图片，可以看到重叠的管道。
//
//Level 96是一个非欧几何空间，表现为无尽的通风管道迷宫，且基本上可以通向前七个层级中的任何一个（只要它们中存在任意形式的管道系统）1。本层级内的通风管道质量差异极大，最差的已经锈蚀严重，结构极其不稳定；而最好的则一尘不染，如同崭新。不同的管道上下分层，通常一个管道只会固定在自己所处的这一层。当然，也有部分管道会向上或向下倾斜，抵达其他管道层系统。
//
//许多管道都会通向无法前进、或是过于危险的方向，例如垂直上下数百英尺。也有些管道会自行回转，导致许多区域被重叠的管道堵塞，无法继续深入2。如果你抵达了这些区域，请绕道而行，它们都是非常危险的。
//
//如果进入某个管道时，其内的温度较之其他管道急剧上升或下降，请绕道而行。某些区域的管道温度最高可达约113华氏度3，最低可至-24华氏度4。
//
//本层级通常十分干燥，冷凝水出现较少，但是当管道系统的温度达到冰点时就会有冷凝水出现。直接饮用这些冷凝水并不安全，但在煮沸后它们的性质将与杏仁水一致，并且可以用于治疗Entity 295。
//
//各层管道系统
//嗡鸣回响、管壁较薄的矩形管道6通往Level 0。
//
//更大的圆形管道7中有微风吹过，温度较低，且有轻微的嗡鸣声响起，它们通向Level 1。
//
//而那些温度更高、尺寸更小的圆形管道8通往Level 2。
//
//一些较大的圆形管道9的转角处洒满了电线与水管，温度也进一步上升；这些更大的管道通往Level 3。
//
//通向Level 4的管道无法使用，因为其尺寸过小，使得人类难以进入。如果你在Level 4中钻入一个通风口，那么你最终会到达绝缘层，而非Level 96。
//
//通往Level 5的管道无法使用。
//
//更加宽大、但是管壁更薄的管道10中完全缺乏照明，它们通向Level 6。
//
//通往Level 7的管道无法使用，这些管道中温度极低，且常有冰凉的水流过。目前相关研究正在进行，以确保管道不会被这些水流溢满。
//
//通向Level 8的管道尚未被发现。
//
//- [【错误_9629.exe】发现恶意程序，重启中……]
//只要找到彩带和气球就能参加一场派对！=)
//
//
//大致信息：
//抵达Level 0到Level 7所需要的平均时间：
//- 隐藏表格。
//层级	抵达时长
//Level 0	约25-35分钟
//Level 1	约20-25分钟
//Level 2	约15-20分钟
//Level 3	约10-25分钟
//Level 4	无法抵达
//Level 5	无法抵达
//Level 6	约35-45分钟
//Level 7	约25-40分钟
//Level 8	无法抵达
//目前为止，没有办法从标准的管道中切出抵达其他层级，但你可以在一些特殊的管道中切出。此类管道较为稀少，通常贴有墙纸或是涂抹有混凝土，通往各自的层级11。
//越是锈蚀严重的管道，就越有可能出现实体。
//本层级的平均温度为62华氏度12。
//整个Level 96中都吹拂着一阵轻柔、凉爽的微风，距离出入口的通风口越远，风的力度就越强。
//在接近出口时，通风管道内部的构造将逐渐变为上文描述的规格。
//目前已知的管道系统的高度与宽度，通常而言，最大是3英尺x3英尺，最小是2.5英寸x2.5英寸。
//标准管道的材质通常为铁、铝或PVC，偶尔也会出现较为柔韧的管道13。
//实体
//h9IHRT47MgW1rxo.jpg
//一张不寻常的照片，在Level 2的出口附近恰好拍摄到了新旧铁片交接的位置。这张图片中还出现了Entity 29。
//
//Entity 29，也就是俗称的“锈”，是一种特殊的铁锈，可在严重损毁或锈蚀的管道中发现许多。一旦在管道中被某个尖锐的突出部分划伤，该实体就能迅速感染伤口，所以最好确保你已经带上了足够的杏仁水。在伤口处涂抹杏仁水即可延缓感染的进度。
//肢团只会在本层级中狭窄的部分出现，尤其是在那些破旧的管道中。
//基地、前哨和社区
//有别于其他层级，Level 96内部管道的尺寸过于狭小，使得在这里建立基地或社区极为困难。然而，依旧有人在这种情况下创立了小型的组织。
//
//“冒风者”
//“冒风者”是一个由三人组成的小型团体，其成员是互为好友、年龄不一的青少年。
//他们总会在管道内“兜风”，并且热衷于“寻找此地的更多秘辛”。
//该团体通常开放交易，尤其愿意用杏仁水换取任意巧克力与能量棒。
//- 返回旧版本。
//“管道清理公司（V.C.C.）”
//我们对于该组织所知甚少。
//他们理论上是后室装修公司的成员，但目前未被证实。
//他们声称要“让后室焕然一新”，并表示自己有“上百名成员”，以及“www.VentroomsCleaningCorporation.org上的无数五星好评”。
//入口与出口
//入口
//在任意层级中进入一个敞开的通风口。这么做有很大概率进入Level 96，并且会来到一条与入口规格相仿的管道。
//出口
//打开一个通风口，直到缝隙大到可以看到外界，你就离开了Level 96。
//在贴有墙纸或是涂抹有混凝土的管道部分，你可以直接从中切出。
//出于安全考虑，不要切入那些亮色的墙纸，那会给你带来一个惊喜！ =)
//Footnotes
//1. 据推断，本层级中的通风口能通向更高的层级，但是这一点尚未得到证实。
//2. 重叠的区域是非常危险的，因为两个重叠管道的分子结构会相互推斥、散射，导致该处的管道强度大幅度下降。
//3. 约45摄氏度。
//4. 约-31摄氏度。
//5. 译注：此处提及的Entity 29是已被删除的旧版本，与你现在能看到的Entity 29不同，之后提到的Entity 29同理。
//6. 该层管道的尺寸最大为3英尺x2英尺4英寸，最小为4英寸x4英寸。记录中，最小的情况仅仅出现过三次。
//7. 根据记录，其直径最大为3英尺，最小为2英尺6英寸。
//8. 通常直径在2英尺到12英寸之间。
//9. 直径最小为2英尺， 最大为3英尺4英寸。
//10. 它们的尺寸在3英尺x2英尺到2英尺x1英尺6英寸之间。
//11. 从混凝土中切出可以随机到达Level 1至Level 3中的一层，而从墙纸中切出则会前往它们对应的层级。
//12. 约17摄氏度。
//13. 通常以铁线圈作为支架，由不同种类的塑料或泡沫构成。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl96{}