package lvls0;
//Level 95
// 
//
//生存难度：
// 
// 
// 
//Level 95是后室的第96层。该层级由一系列有着古怪架构的长廊、拱形过道，和数量不断上下波动的光源组成。
//
//描述:
//one
//Level 95奇特的建筑架构。
//
//Level 95是由一系列由近及远交错相接的，大部分由砖块和石头建成的长廊所组成的层级。这里广泛存在的、古怪的建筑架构成了许多明显的障碍，因此对许多人来说，在这个地方行进并不是一件易事。此外，不是所有的长廊内部都有“自然的”光照：有一些长廊内甚至全然无光。因此，任何在此的探索都十分艰巨。
//
//该层级内几乎在每一堵墙上都有窗户，尽管有时候从窗户里望去，墙后面只是又一处长廊罢了；这些窗户同时也是自然光源的主要来源，尽管主要在发光的是何物仍未被知晓。从（充当光源）的这些窗户中看去，所看到的只是一片空荡、且似乎无穷无尽的白色虚空。
//这些窗户是不是实体2的个体目前仍是未知，因为在窗户的另一侧没有看到实体的轮廓，且目前没有被记录在册的流浪者受到来自其攻击的案例。
//
//由于长廊大多十分空荡，声音可以轻易的穿过长廊，达到很远的地方。所以在这里离着相当远距离就探测到任何形式的生命是一件极其简单的事，只要它们发出声音就行。
//值得注意的是，这样也意味着流浪者在此有很高的可能被实体发现，所以，在这个层级行进的时候要尽可能发出最小的声音，尤其是在组队行进或者附近发现实体的情况下。
//
//有些时候，尽管附近并没有可能的声源，在墙的另一头仍是可以听见一些噪音。这些噪音最普遍的情况下包括，：抓挠墙壁的声音、脚步声、口哨声、残骸塌落声、哼唱声。
//要被清醒认知的是，虽然这些声音似乎有任何的具体声源，但仍需要在以上所提及的声音出现时保持警惕；毕竟墙后面究竟是什么，没人知道。
//
//整个层级似乎几乎没有任何有价值的资源出现，除了有些时候可以在矮墙或者木制路障后面找到藏着像是凭空出现的一木盒的杏仁水。这些杏仁水被证明是可以被安全饮用的，但是找到它们十分困难。
//
//two
//一个位于长廊中没有任何灯光的楼梯间。
//
//在罕见的情况下，有长廊可以通向一处楼梯间，这些楼梯间可以通往比Level95的主要部分低一层的，被称为长廊之下的地方。由于一系列原因，这个地方没有被完全探明并记录。
//
//长廊之下是在主层级之下的一个区域；一个没有任何光照，需要人工光源才可以进行探索的楼层。
//由于多个探索团队在几天的探索后毫无征兆或者通知的失联，甚至装备了配有求救信标的对讲机的队伍也会如此，所以目前对这个地方所知不多1。
//
//在楼上可以被听到的声音在长廊之下也可以听到，但是在此处这些声音相比远远更加响亮，清晰。有些时候会从远处传来笑声，但由于绝大多数流浪者在听到了这种声响后会被吓得立马跑走，撤回到该层级的上一层，所以笑声由何发出仍是一个谜。
//
//该区域被认为存在极多的实体，这种说法也许可以作为解释那些团队为什么失踪的论据。漆黑一片的周遭环境提供给了许多实体隐藏和伏击流浪者，并在他来得及警告任何人前就地残忍杀害的客观条件。
//
//麦克风与相机在长廊之下无法工作；麦克风在这里会一直输出恒定且恼人的大声噪音，有短暂一阵子甚至会大到让人耳聋；相机只会记录下静止，黑色的画面，此外什么都看不到。任何以图像形式记录下来的资料会直接被污染掉。
//
//无论如何，都绝不建议.在Level 95的下层游荡，没人知道这里面真正发生了什么，下去只有死路一条。
//
//实体:
//处于上层的实体想必是很少的，但是在找到出口之前，流浪者在此层级大概率会至少遭遇一个实体。
//按照目前的记录，在此层级上层的实体主要是钝人和肢团；目前还没有其他实体在此被发现或者记录在案。
//
//另一方面，此层级的下层（长廊之下）的实体的数量被认为是上层区域的至少80倍。2
//然而，没有官方文件，调查，或者探索行动可以支撑以上（关于长廊之下）的观点；切要记住，任何的探索行动都会以损失整个探索队收场，且此结果仅能证明此处有很大可能存在危险实体。
//
//尽管如此，有一些非官方文件指出有观察到笑魇，Nguithr'xurhs，窃皮者和猎犬的存在。
//
//基地，前哨和社团：
//鉴于此层级的特性，在此建立任何种类的前哨站都不会让那些这样做的人得到什么好结果。而且，任何尝试在这里建造任何种类的基地的行动都极度耗时，造成大量资源浪费。
//
//尽管如此，一些非常小的由M.E.G.建立的前哨站可以在上文中提及的楼梯间旁找到，它们要么是用于指引流浪者去到一个安全的地点，要么就是用于探索长廊之下的。
//
//如果需要医疗协助或者是资源，这里的前哨站也许可以提供第一时间的帮助；然而，由于Level 95资源是十分稀缺的，所以并不保证总是会从这里得到帮助。
//
//入口和出口：
//入口
//为了进入Level 95，前往位于Level 11的一个空房间，或者在Level 9找到一个有碎裂砖块的墙即可。
//
//出口
//为了离开Level 95，一个人必须要从他们进入Level 95的地方开始走上足够远的距离。当走了离起始处不知道有多远的距离了的时候，有些墙可以找到有一个可以被打开的门，如若进入，流浪者会通往Level 44.
//
//[+]作者，译者和许可码
//« Level 94 | Level 95 | Level 96 »
//
//Footnotes
//1. 监督团队没有一次在此听到过这种特殊对讲机所发出的特有声响，因此，督导团队相信探索团队在开启求救信标之前就已经遭遇了不测
//2. 该结果是根据上下两层所遭遇的实体数量比例和在分别在两层的死亡人数推测得出


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl95{}