package lvls0;
//Level 9
// 
//
//生存难度：
//等级 5
//不安全
//不稳定 
//实体横行 
// 
//Level-9-1-cc.jpg
//Level 9中空旷的街道。
//
//Level-9-2-cc.jpg
//一张Level 9中一栋房子的照片。
//
//Level 9是后室的第十层，这一层看起来像是一片无穷的郊区。
//
//描述
//Level 9是一片无穷的处于午夜的郊区。 这一层有着像是Level 6那样的黑暗，但没有那么危险。这里的房子有着各式的设计和体积，而且每一个都截然不同。不过这里有着报告称有看见两栋紧挨着的房子是相同的。
//
//Level 9的房子看上去都是有家具且相当崭新的，不过这里没有提供给照明系统运作的电源。有些房子里面可能空无一物。许多有用的物品可以在这些房子中以及类似的地方找到。这些房子中的家具都是一个普通人所需要的，像是沙发、电视机、床、冰箱，等等。但由于要求电源的缺失，需要电源的物件将无法运作。其中有些房子的背部有着家具齐全的院子。这一层另一个异常的性质是当你走的过远的时候你可以找到两栋房子奇怪地卡在彼此之中，这从物理角度来讲是不可能的。
//
//Level 9中的街道是这一层中更加危险的区域。这些湿润的沥青路并没有涂上油漆，且在某些地区会被树叶所覆盖。一些关于路上的水洼的目击证明了这一层曾经下过雨。石质的人行道是正常的，并且看起来没有任何反常的地方。任何通往草地的路都将到达Level 9.1，在通往田地的路上行走将出于某种原因到达Level 10。路灯通常是关闭的，并且处于不运转的状态，尽管有些灯会闪烁而且有时候甚至是通了电的。电源来自哪里尚不可知。时刻对浓雾保持警惕，因为那是碾压者的生成机制。
//
//出现在Level 9的实体有死亡飞蛾、笑魇、窃皮者、杰瑞、猎犬、传送者、尸鼠、警告风筝以及大量悲尸。关于磨损者1以及八层之蛛的目击已被报告，但它们好像是从Level 8游荡进Level 9的。Level 9也有着它独特的实体，其中最著名的包括邻里守望、观察者以及碾压者。
//
//基地、前哨和社区
//这里只有几个生活并且在Level 9活动的团队，但是在Level 9中建立基地是完全可能的尽管这是一个极度危险的任务，当下还没有这一方面的记录。
//
//发现
//Level 9是根据一篇由失踪的探险者小队中的一名成员“u/Bart0nius”发表的文章而发现的。在他和队伍中其他人从Level 8的地板掉下来后，他声称他一直在做梦而且这一层并非真实存在，尽管这是不正确的。这个探险者小队怎么消失的依然处于未知。文章是这么写的：
//
//我穿过地板掉下来了。
//
//我下坠并降落到了一个陌生的地方。这里没有蜘蛛，但是我仍然感觉我正在被窥视着。在我周围的，到处都是街道、房子和枯树。我的头感觉，依然觉得…迷迷糊糊的。就像电视机在我的大脑里面死机了一样。听队长说，我突然就失去了知觉。而我在说的是关于死亡、痛苦、衰弱…任何不好的东西。
//
//Level 9是Level 6走上正轨的样子。我可以说这里有着什么正在发生，而它对于你的思维是不利的。几乎，几乎像是Level 6那样糟。
//
//这些探险者在这篇文章被发布后再也没有被发现过。
//
//入口与出口
//入口
//要进入，对于绝大多数流浪者来说从 Level 8的地板上随缘切入是最主要的方法。
//从Level 34 下水道格栅爬上来将通往Level 9。
//在Level 92的众多门中的一扇可以像去往其他层一样通往Level 9。
//Level 40中旋转的门将通往Level 9。
//通过Level 25中的黄色拱廊橱柜可以来到此层。
//进入Level 54中门的一扇通向Level 9。
//Level 94中的动画屋在少有的情况下会把你带到此层。
//打破Level 87的窗户可以来到Level 9。
//Level 104中的后院将带你你离开并带你来到Level 9。
//出口
//要离开，跟着街道上的箭头标志将在一百（100）到两百（200）英里后很快来到Level 11，这种情况只会在跟着标志的情况下发生。
//通往草地的人行道将会通往Level 9.1 或者Level 10。
//Level 60可以通过切出Level 9的街道地面到达。
//进入一栋房子会有着机会将你传送到Level 53。
//跟着电线走有机会带你到Level 113 。
//一个飞机场可以在去往Level 11的标志的时候被发现。进入飞机场会被传送到Level 36。一般情况下在此切出将会来到开始几个负数层级。找到一个运动场并且在任何一条有着白色的发光内窗的管道中爬行通常会传送到Level 283的管道中。
//作者
//« Level 8 | Level 9 | Level 10 »
//
//脚注
//1. 译注：原版的Entity 21已被删除，你现在看到的Entity 21是新版的。



import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl9{}