package lvls0;
//Level 99
// 
//
//生存难度：
//等级 绿洲
//
//不毛之地
//目前存在智能生命体
//被动的实体
//除了荒凉和橙色这两个词以外，已经没有更好的词语去形容这一个层级了。
//
//Level99是后室的第100层。
//
//OrangeButCc
//一张level99的照片。尚不清楚失真的原因。
//
//描述：
//尽管图片拍得不是很好，但如图所示，Level 99令人作呕地充满着橙色，甚至会比图上显示的更加地扭曲。在物理层面上，这个层级是正常的；脚下的沙子并不柔软，头上的天空也并不坚实。该层级像是一个没有昼夜循环的红色沙漠，天空永远是橙色的，看上去永远都不会改变。如果不是因为该层级的沙子完全由氧化金属组成，它们就会和前厅的红沙看上去一模一样。这些沙子通常由铜和铁组成，有时候还会参杂着难以辨认的矿石，闻起来有着一股金属的味道。
//
//关闭记录
//记录1
//记录开始。
//
//Arthur: 喂，喂。
//
//Stanley: 我觉得设备没问题！
//
//Arthur: 不，我这边很明显有问题。
//
//Arthur: 妈的，我一说话，系统的L值就会翻倍。
//
//Stanley: 哦，行吧，先不管它了，我们不是要进去这个层级吗？
//
//Arthur: 别急啊，先把防毒面具戴上。
//
//Stanley: 防毒面具？我们戴这个干嘛？
//
//[Arthur失望地叹了口气]
//
//Arthur: 我的天，这里的天空全他妈是橙色的。
//
//Arthur: 就算不做测试，我们一眼就能知道，这地方的空气肯定呼吸不了。
//
//Stanley: 确实。
//
//记录结束。
//
//发现：
//Stanley和我吃完了午饭，正在Level 4闲逛的时候，碰到了一扇离地面30厘米，漂浮于空中的门。我敢肯定那道门是云杉木做的，但这不重要，在门上钉着一块牌子，写着“食尸鬼镇”。我们用无线电通知了上级，由于我们都带了应急的物资，他们就要求我们先进去看看。打开那扇门就会来到level99，或者说是“食尸鬼镇”。那道门也有着奇怪的现象，非常的诡异。因为它没有门框，所以如果你在门打开的情况下走到门的背面，那么门就会消失，而如果在关闭的情况下走到门的背面，那就会如你所想的一样，你会看到门的背面。
//
//隐藏记录
//记录2
//记录开始。
//
//Arthur: 好的，所以我走了大约两公里，我让Stanley呆在门的旁边，以观察门是否会消失。
//
//…
//
//Arthur: 所以在五分钟前，他用无线电和我说门没有变化，且在关门之后它不会自己锁上。所以我现在需要在这里等他过来，至少这里有风滚草——
//
//Tumbleweed: 嘿，我是有名字的好吧，我妈给我起名字就是为了不要让你这种人叫我“风滚草”，天哪。
//
//Arthur: … 呃，我的精神可能出问题了。好吧，风滚草先生，你叫什么名字？
//
//Joseph: 你可以叫我Joseph。你没有疯，目前为止。我是一个有意识的干枯灌木。还有，你怎么知道我姓风滚草？你是警察还是什么人？我可保证我没有干什么坏事啊。
//
//Arthur: 好吧，Joseph。我确实是在现实，谢谢你的提醒。
//
//Joseph: 嘿，没问题，尽管你可能是个条子，我还是尊重你的，因为我有一些非常重要的生意要与仙人掌谈，已经约好了，所以我必须现在就走。
//
//Arthur: 好吧，你的运气不错，我也快要离开这里了，因为这个噩梦对我来说有点太奇怪了。
//
//[Arthur站起来，把另一台录音机放到了风滚草那里]
//
//Arthur: 嘿，在你走之前能问你最后一个问题吗？
//
//Joseph: 嗯？可以，请问吧！
//
//Arthur: 你能…感觉到那个吗？
//
//Joseph: 你说的是午后的微风吗？那是当然！在和你说话的时候，我的车正好到了，我该出发了！Arthur，以后再见！
//
//Arthur: 好的，一路——等一下，我什么时候告诉你我的名字了？
//
//Joseph: 我猜的————
//
//[被大风吹走的时候，风滚草Joseph仍然喊着“的”的声音。]
//
//Stanley: 呼，呼。天哪，我真的要开始锻炼了！呼。你等了我很久吗？
//
//Arthur: 等等，如果你在这里，那就意味着我还没有醒，或者说我已经醒了。。。这他妈到底是不是现实啊？
//
//Stanley: 啊？兄弟，你发生了什么事？
//
//[Arthur把手臂放在了Stanley的肩膀上]
//
//Arthur: 这里就你和我两个人，Stan。Joseph不存在，对吧？
//
//Stanley: 但是谁——
//
//Arthur: 嘘。别告诉Nick好吗？
//
//Stanley: 呃…好吧？
//
//[Arthur重重地拍了Stanley的后背一下]
//Arthur: 太好了，至少我们会合了对吧？好了！
//
//记录结束。
//
//社区：
//食尸鬼镇：
//我们还没有到过那里，但我们确实知道它可能存在。我们大概走了五公里，已经回不去了。但是我们走之前在门把手上绑了一根绳子。这根绳子是被M.E.G.所发现的，它由高强度的纱线所制成，在15千米长，10厘米粗的地方被切断。它实在是太长了，想要装进补给里很麻烦，尤其是Nicky手一滑，把它给解开了。不过，当我们最终到达小镇的时候，绳子可以帮我们找到路。
//
//隐藏记录
//记录3
//记录开始。
//
//[突然的抖动]
//
//Arthur: 我操，我们到底走了多久？
//
//Stanley: 哇，Arthur，你需要冷静下来。
//
//Arthur: 冷静？冷静？？我们已经走了几个小时了，但就像是走了几个世纪一样。我们他妈的甚至连这地方存不存在都不知道？我已经分不清眼前的那坨橙色的东西，是地面，是天空，还是你的卷发了。
//
//Stanley: 请你试着冷静下来，看着，我会向M.E.G请求支援的。
//
//Arthur: 哦，那可太有用了！他们可以在这里找到我们的尸体，参然后加我们的葬礼。
//
//[Stanley大声叹了口气，接着是电台的嗡嗡声]
//
//M.E.G工作人员： 你好，Stanley和Arthur…特工？
//
//Stanley: 是的，是我们，我们需要支援。对“食尸鬼镇”的探索比我们预期的要更加地深入。我们需要支援来确保我们能够活着逃出去，你能帮帮我们吗？
//
//M.E.G工作人员： …收到请求，三位特工正在待命，我需要知道“食尸鬼镇”的入口在哪里。
//
//Stanley: 在level4，一个离地30厘米的门，在D98办公区的角落附近。
//
//M.E.G工作人员： …收到，我们会把这些信息发送给他们的。
//
//Stanley: 非常感谢。
//
//[Stanley关掉对讲机，把它收了起来]
//
//Arthur: 太好了，所以什么时候举行我们的葬礼？我们他妈的为什么会觉得，漫无目的的在一个沙漠里乱逛会是一个好主意？
//
//Stanley: 听着，Art，我们都快认识一辈子了，振作点，我们要活着离开这里，否则我要亲手杀了你。
//
//Arthur: 我——我…Stan，我——
//
//Arthur: …
//
//Arthur: 我——我不知道该说什么…对不起Stan，我一时间失去了理智。
//
//Stanley: 唉，没有关系，朋友就是要互相帮助嘛，尽管你把我都整得有点不正常了。
//
//Stanley: 我很高兴你恢复了理智，即使只是一点点。
//
//Arthur: 唉，但是——
//
//Arthur: 我是真的很他妈累了。我们为什么——等——等一下…Stan！Stan！天哪我们成功了！
//
//Stanley: 不会吧，不会吧，兄弟你是不是在耍我？
//
//Arthur: Stan，我们为什么要折磨我们自己呢。你看！
//
//Stanley: 天哪，天哪，这是真的！
//
//Arthur: 是啊！能不能小心一点？我不想要走了这么远还要被杀掉。
//
//Stanley: 哈，你也一样。
//
//记录结束。
//
//社区（更新）：
//食尸鬼镇：
//城镇离门大概12公里远。整个镇子的看起来有4000平方米的面积？首先映入眼帘的是一个巨大的木质标牌，上面有着友好的问候。
//
//“欢迎来到食尸鬼镇”
//
//我们起初很谨慎，但是在进入城镇之后，我们注意到，比起僵尸或是真正的食尸鬼，这些“食尸鬼”更像是人类。他们像是亡灵，却似乎不会主动与人交流。于是我们尝试着，向他们中的一个询问我们是否能够留下来。他们显然不会说话，却会手语。Stanley的美国手语课程终于有了用处。他们告诉我们，如果我们是新来的，就应该去当地的杂货店买一个礼物篮！哇，我从来没有想到过一个叫食尸鬼镇的地方能够如此好客。即使到达这里需要穿越一眼看不到边的橙色沙漠，仍然有人到达了这里，这实在是令人惊讶。除非你是我们，不然不会进来并探索它。
//
//这家杂货店和前厅的类似，甚至还有电力供应和新鲜的产品！我们来到位于商店后方的柜台，与名叫Brenda的商店老板开始了交流。天哪，我都不知道Stanley参加的是手语课还是火影忍者俱乐部了。在挥舞了几下火影忍者的手势之后，Brenda打开了一扇门走了进去，我猜那是一个食物储藏室，然后拿着两个整齐绑好的礼物篮出来了。我警告Stan，不应立即信任这些人，直到——我去，那是巧克力蛋糕吗？
//
//所以，我们还活着，这意味着那些食物没有毒。谁知道食尸鬼会和人类吃同一种东西，而不是吃人呢？在吃得满脸蛋糕和面包卷的碎屑后，Stanley开始四处打听有没有汽车旅馆之类的地方，可以让我们休息一会。后来我们遇到一个名叫Neil的食尸鬼，我猜他是个老人，因为他挥舞着一根光滑的手杖，有着一头白发，戴着碗状的帽子，脊柱也往一侧弯了过去。他用手势和我们说，去“镇中心”找住在山上的人，那个人会给我们更多的信息。本来我们能够在老人那里得到更多信息，但是他说了一半却睡着了。Stanley表示，我们也不能在老人那里了解更多的信息了，因为他的手势实在是太粗糙和省略了，Stanley几乎没能认出来老人用手势说了些什么。但是，不听老人言，吃亏在眼前，我们决定遵照老人的指示，前往镇中心。
//
//人口：
//50+
//食尸鬼通用语言：
//- 手写
//- 英语手语
//- 呼噜声
//- 手势
//
//镇中心：
//在多名食尸鬼的指示下，我们找到了一个巨大的标志，上面用红色的大字写着
//
//“镇中心往这边走！！”
//
//有了这些信息，我们只得拖着累得半死的身体，来到了山顶的房子，虽然这里更像是个沙丘。幸运的是，有一条鹅卵石小路把我们引导到了这所房子。此时，Stanley开始感到不舒服，所以我希望这些食尸鬼有纸和笔，以及之前我们收到的食物没有毒。我的眼睛越来越痒，之前感到恶心的症状也在加重。幸好镇中心离食尸鬼镇只有十分钟的路程，我不认为Stan还能走另外的十二公里。因为此时的Stanley只能坐在门框的边上，大口地喘着粗气了，所以只能由我来做交流了。我深呼吸，按下了门铃。
//
//隐藏记录
//记录4
//记录开始。
//
//…
//
//Arthur: 你好？..
//
//???： 嗯？哦，我们客人了，Fred！
//
//Fred: 客人？可能又是Debra，因为我一直告诉她，我们不需要另一个净水器了。我不在乎那点味道的差别，它们就是没味道的！
//
//???： 嗯——
//
//Fred: 唉，Bob你要说话而不是咕哝。
//
//Bob: 啊，行吧。
//
//[可以听到轻微的沙沙声和脚步声，在猫眼上可以看到一只眼睛]
//
//Bob: 嗯？哦，嗨！Fred，他们是人类！
//
//Arthur: 哇哦，我可没预料到你会说出这样的话。
//
//Bob: 嗯？是的，考虑到其他食尸鬼都不能说话，在看到会说话的食尸鬼之后，你们肯定会感到奇怪吧。
//
//Arthur: 我想它们对我们还挺友好的。
//
//Fred: 哦，嗨，别理Bob，他只是…，呃，有些孩子气罢了，我猜。
//
//Arthur: 哈哈，我也是这么想的。
//
//Fred: 哦，这些是防毒面具吗？
//
//Bob: 哦，是的，通常情况下，你们需要氧气罐。如果没有它，在症状恶化到无法治愈之前，你们只能在这里呆上两个小时！
//
//Arthur: 我…什么？
//
//Stanley: 啊，不要大声喊，我感觉很…啊啊…
//
//Arthur: 妈的，你之前跑了两公里，你的空气过滤器肯定早就报废了。
//
//Bob: 通过鼻子呼吸，至少可以过滤掉一部分能够进入你的肺去进行破坏的铁锈。
//
//Fred: 等一下，我们不常有人类来访，但我们有氧气罐以备不时之需。我现在就去拿，让你的朋友尽量坐直一些。
//
//[Fred飞快地跑回屋里]
//
//Arthur: 谢天谢地，操。他的空气过滤器彻底坏掉了。Stanley，你要撑住啊。
//
//[Fred胳膊上扛着两瓶氧气罐，迅速跑回门廊]
//
//Fred: 我回来了，拿着，还有一个给你的朋友。
//
//Arthur: 谢天谢地，我真是太感谢你们了。
//
//Bob: 嘿，应该的，兄弟，因为你们呆在这里的时间比其他人都要长。我不知道其他人的想法，他们总是试图回去，从来就没有人在这里做过客。
//
//Arthur: 嗯，这让我对你们充满了期待。
//
//Bob: 嘿，没问题的。
//
//Arthur: 我——Fred你怎么能忍受和这个家伙住在一起的。
//
//Fred: 好吧，首先，我并不和他住在一起。其次，我们是这个镇的市长。第三，他是唯一一个不用挥手或浪费纸笔就能对话的食尸鬼。
//
//Arthur: 你们两个是市长？我能理解你是市长，但是Bob？他确实是另一个会说话的食尸鬼，但我还是无法理解。
//
//Bob: 好了，好了，别讨论我的事了，你能告诉我你为什么在这里吗？我看你是那个M.E.G.组织的人。
//
//Arthur: 好吧，如果你知道M.E.G.是什么的话，那我就长话短说了，我和Stanley要在这里记录一篇关于你们城镇的文章。
//
//Fred: 嗯，如果是这样的话，我们为什么不接手剩下的任务呢？你能打电话给你的上级，告诉他们食尸鬼镇的镇长会帮他们写这篇文章吗？
//
//**我…我不知道，兄弟…我是说我刚认识你们…我不…你知道吗，去他妈的。来，拿这个平板电脑，它是一个直接连接到M.E.G.通讯数据库的通讯设备。等你写完文章剩下的那部分时，直接把成品发给我就行。
//
//Bob: 我有一个问题。
//
//Arthur: 洗耳恭听。
//
//Bob: 它应该和普通平板电脑差不多吧？
//
//Arthur: 如果你说的是互联网视频，是的。我们发现的一个应用程序已经保存了现在所有Youtube视频，并它们会保持更新。
//
//Bob: 好！我决定了，你和你的朋友要回到房子里了，我们会帮你写这篇文章的其余部分！
//
//Stanley: 好吧…，我觉得我的状态回来了，感觉好多了，你准备好回去了吗？
//
//Arthur: 是的我们该走了，谢谢你们的帮助。
//
//Fred:嗯，如果那些氧气罐反复地泄露，那它们肯定撑不了多久，所以要时刻注意它们的状态，它们出现了问题的话，我们会给你解决的。
//
//记录结束。
//
//大气
//在Level 99，大气中含有约30%的铁锈，这对任何没有氧气罐的人来说都是极其危险的。天空和沙子中的锈迹赋予了它们标志性的外观。很多人都来到了食尸鬼镇，但没有一个人能在回程中幸存下来。希望Stanley和Arthur能成为第一批活着出来的人。
//
//食尸鬼：
//在Level 99中的食尸鬼非常被动，不会无缘无故地被激怒。和其他人类一样，他们不喜欢惹人讨厌的人或自恋的人。他们不会说话，但他们懂英语，并试图通过肢体语言、手部动作或者一些了解美国手语的食尸鬼会通过手语，来尽可能地交流。尽管食尸鬼镇的通用语言完全由咕噜声组成，因为这似乎是他们唯一能发出的声音。唯一的例外当然是Bob和我；我们似乎是唯一会说话的人。
//
//入口和出口：
//入口：
//在Level 4，有一扇离地面约30厘米的门，上面挂着一块牌子，上面用红色的大字写着，“食尸鬼镇”。
//在Level 11，有一个随机的活板门漂浮在离地面两米的地方。当你打开活板门时，一个梯子会掉下来，你可以用它爬进99层。
//
//出口：
//要退出层级，你必须从同一扇门返回，或者发现通向其他层级的另一扇门。
//在食尸鬼镇的西北方向，大约两公里处有一扇门，上面写着“游泳池”，它通向Level 7，但这不是一个可行的出口，因为当你进入时，这扇门会把你放在水下，把你变成鱼食。
//在食尸鬼镇以东五公里处还有一扇标着“游戏室！！！”的门，它通往Level 389。这扇门通往一个小型的步入式衣柜，通往389层的主体部分。


import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl99{}