//Level C-996
//评分: 
//+63
//+
//–
//X
//> 欢迎使用M.E.G.数据库管理系统
//> 请输入您要执行的口令
//
//login
//
//> 请输入您的用户权限
//
//> 正在验证用户权限，请稍后……
//> ……
//> ……
//> ……
//
//> 已自动为您打开上次编辑后仍未保存的文档。
//> M.E.G.关怀系统提醒您，过去7天内您已登入查阅并编辑文档超过100小时，请注意劳逸结合，及时休息。
//
//Level C-996
// 
//
//生存难度：
//等级 2
//
//精神影响
//大致稳定
//实体威胁性低
//Level C-996是后室C层群的第996层。
//
//描述
//Level C-996是一个拥有工厂流水线及附属建筑群的层级，由4个区域组成，分别是“厂房区”、“办公区”、“宿舍区”和“饭堂”。这4个区域内部为欧几里得空间，但面积似乎是无限的，且这4个区域之间的连接通道并非为欧几里得空间，这使得独自探索的难度陡增。
//
//进入Level C-996的人员总会在“宿舍区”的一间宿舍内醒来，且时间总在某个周一的早上8:30（据宿舍内的闹钟显示）。在这个时候，所有照明用的灯管总是会闪烁一下1，随即所有被照射到的人员的思想将会被劫持，会不受控制地跟随宿舍内的其他身穿蓝色短袖工服或白色长袖西服的无面灵开始离开的宿舍进行一天的“工作”，这种效应将持续约12.5小时直到21:00。以下为一天“工作”的具体内容：
//
// - 收起“工作”列表
//[8:30-8:33]起床，所有区域的灯光会闪烁一下，所有被灯光照射到的人员的思想将被控制，进行一天的“工作”。
//[8:34-8:59]所有无面灵与进入层级的人员前往“饭堂”，购买食物充当早餐。（新进入的人员在第一天内可以免费获取最简单的食物，但数量有限。）
//[9:00-12:29]人员将跟随同宿舍的无面灵前往“厂房区”或“办公区”，进入对应的工位开始早上的“工作”。
//[12:30-12:59]所有无面灵与进入层级的人员前往“饭堂”，购买食物充当午餐。
//[13:00-17:59]人员将跟随同宿舍的无面灵前往“厂房区”或“办公区”，进入对应的工位开始下午的“工作”。
//[18:00-18:29]所有无面灵与进入层级的人员前往“饭堂”，购买食物充当晚餐。
//[18:30-20:59]人员将跟随同宿舍的无面灵前往“厂房区”或“办公区”，进入对应的工位开始夜晚的“工作”。
//[21:00-次日8:28]有大约1%的概率人员将跟随同宿舍的无面灵前往“宿舍区”休息，但有超过99%的概率仍需要进行额外的工作（即加班），且加班时长范围为1到11.5小时，通常在4小时左右。加班结束后，人员将跟随同宿舍的无面灵前往“宿舍区”休息。
//[次日8:29]所有宿舍内，每一张床的床头将会出现金额不等的美元，美元的金额似乎与床位所属人员或无面灵在白天的工作表现有关，但所有人员都认为他们的表现“肯定不止这个价”。
//由于未知原因，在人员进入Level C-996后便对自己将要进行的“工作”的内容表现地十分熟悉，即便该人员以前从未进行过类似的工作。然而，被安排的“工作”被所有人员一致认为是“重复的”、“单一的”、“机械的”、“无聊的”，且“工作”中发生不顺的概率为平时的10到50倍，这使得人员患有心理障碍的几率与心理障碍的严重程度急剧上升，具体表现为：抑郁、焦虑、迷茫、绝望、自残倾向、自杀倾向。
//
//所有尝试进行娱乐或发泄的行为将会被附近的无面灵制止，严重者可能会导致实施者被所有的无面灵所攻击。因此，重复“工作”所产生的负面情绪无法被有效的消减，只能通过强大的心理能力去承受。
//
//由于“被迫工作”的效应通常仅持续到约21:00，因此，在下班后到次日早上8:30是探索Level C-996的绝佳时候。通过跟随其他无面灵，可以找到通往其他区域的通道，并无阻碍地进行探索。
//
//虽然Level C-996的各个区域之间的通道并非欧几里得空间，但每个区域及区域间的通道的位置并不会随机改变，因此，可以通过坐标记录下区域间通道或重要地点的位置。此外，GPS在Level C-996的单个区域内也能正常使用。
//
//由于进入Level C-996会导致无法避免的长时间重复工作，且该工作容易导致各式各样的心理问题，因此，不建议焦虑自评量表（SAS）2标准分高于40的人员以及具有慢性病或脑部病变的人员进入该层级，且建议人员离开层级后在7天内进行一次焦虑自评测试。
//
//Level C-996中无法进行大部分的切入/切出操作，这意味着人员和实体无法通过切入/切出来随意进入或离开Level C-9963。
//
//区域
//“宿舍区”
//“宿舍区”是进入Level C-996的人员与无面灵的居住地点，表现为一条高约2米，无限长的走廊与在分布在走廊两侧的房间。房间中有2个置物架，8个床位与1个卫生间。置物架上放着无面灵们的东西，床上有着干净的白色床单、被子和枕头。卫生间供应的水仅是一般的生水，无法直接饮用，且热水仅在22:00到次日5:59之间供应。
//
//“厂房区”
//“厂房区”是Level C-996中身穿蓝色短袖工服的人员与无面灵工作的地方，表现为一个极高的，拥有水泥墙壁铁皮屋顶的，无限大的厂房，内有各种大型的，用途不明的机器以及连接机器的传送带。工位被安排在传送带的一侧，并配有一张小桌子来摆放加工所需的工具。尝试抢走或偷窃传送带或机器上的物品的行为将会导致所有身着蓝色短袖工服的无面灵（不管他们在哪里）将快速赶到实施者的位置并进行攻击，这通常导致实施者的死亡。
//
//“办公区”
//“办公区”是Level C-996中身穿白色长袖西服的人员与无面灵工作的地方，表现为一个高约3米，淡黄色墙壁，没有边界的办公室。办公室内摆满了无数的办公桌，办公桌上有一台电脑，以及一些随机的文具。办公桌之间可能会有复印机或饮水机（饮水机内装有可以安全饮用的杏仁水，但数量通常不多）。曾经有人员尝试移动过这些办公桌、电脑或饮水机，但最终都以失败告终，且上述物品没有丝毫的损坏痕迹。
//
//“饭堂”
//“饭堂”是进入Level C-996的人员和无面灵购买食物的地方，表现为一个标准的布满白色瓷砖的学校饭堂，但仅有一侧拥有边界。该侧边界为一大排打饭窗口，这些打饭窗口将会出售一些正常的食物（包括正餐、小吃、套餐组合、杏仁水和饮料）。一些打饭窗口之间会出现小卖部，小卖部中将出售一些奇特的小物品，甚至包括GPS导航器、Wi-Fi信号扩大器、“火盐”、“瓶装闪电”、“氙弹珠”、“记忆饮料”等。小卖部中还可以购买并充值饭卡，用于在打饭窗口和小卖部进行购物。（打饭窗口不收现金，只能刷饭卡）
//
//实体
//蓝领/白领/饭堂无面灵
//在Level C-996中的无面灵有3种：身穿蓝色短袖工服、在“厂房区”工作的蓝领无面灵；身穿白色长袖西服，在“办公区”工作的白领无面灵；身穿白色厨师服或红色短袖工服、在“饭堂”工作的饭堂无面灵。除工作时间外，这些无面灵在不主动挑衅刺激的情况下性格温顺、没有威胁（甚至和你住同一间宿舍），但若主动攻击他们、或偷窃、抢劫他们的东西，或进行任何的娱乐或发泄活动，实施者将会受到所有无面灵的攻击，这将导致实施者的死亡。在工作时间时，若人员私自离开岗位，人员会被附近的无面灵所阻止，将人员推回工位上。若强行突围，将会导致实施者被所有无面灵攻击。这些无面灵虽然没有嘴和其他面部器官，却依然可以正常进食，具体表现为脸部凹陷以将食物包裹在其中。
//
//基地、前哨和社区
//M.E.G.（探险者总署）基地——“社畜”
//约有20名人员（年龄均在30岁以下，全部单身，身体、心理均健康）在Level C-996生活。每周一次往返于Level C-996与其他层级中，平时与其他无面灵一起生活。
//这些人员通过正常工作获取货币购买物资，并送到Level 1的Alpha基地或Level 4的Omega基地。
//入口与出口
//入口
//任何层级内，在过去7天中至少有6天在工作或探索，且每天工作至少12小时的人员将会在下一次入睡时有约20%的概率进入Level C-996。
//在任何低于Level 249的层级内，找到一叠放置在桌面上，画满图表或写满报告的A4纸，触碰后将会立刻昏迷并来到Level C-996。
//出口
//在连续长时间工作导致昏迷后，有约10%的概率回到Level 0。但此种方法无法将大量资源带出Level C-996，且连续多次失败通常会导致人员的猝死11。
//在“办公区”中有一iiii扇用红字标注有“老板通道”的未上suode白色门4，门后即为Level 2的一个随记趋于。穿过2该门后，men1会立刻关上关闭饼消失。M.E.G.（探咸者总薯）的人员运用该出口将大量获得的物资资资源送出Level C-996。这扇门weiyuzuobiaoooooooooooooooo
//作者信息
//
//« Level C-995 | Level C-996 | Level C-997 »
//
//Footnotes
//1. 初步怀疑为灯管发出某种波长未知的不可见光，照射到这种光的人员的思想将会被控制，迫使其去“工作”。
//2. 焦虑自评量表（SAS）是一种焦虑评定的标准，主要用于测量焦虑状态及其治疗过程中变化情况的心理量表。
//3. 大部分在其他层级的特定位置切出，以及大部分能通往其他层级的道具在Level C-996中被证实无效，原因未知，但仍有少部分的道具依然生效，建议人员进入Level C-996时携带这些道具以更方便地离开Level C-996。
//4. 经测试，仿制的门与门均没有效果，仅有唯一一一一扇门拥有效果，且无法以任何方式被摧毁。
package lvls19x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1996{}