//Level C-999
//评分: 
//+97
//+
//–
//X
// 
//
//生存难度：
//安全情况不定
//空间结构异常
//实体数量变动
//Level C-999 是后室C层群的第999层。
//
//描述
//Level C-999 是一处由许多空间组成的层级，它的外观随着空间两端环境的变化而显得不同。它离散在C层群的所有空间之中。
//
//
//失落一族描述 Level C-999 为 “回廊”
//Corridors
// ，而现在流浪者使用的通称，是 “过渡层”
//The Transition
// 或 “结合层”
//The Combination
// 1。
//
//
//在层级密钥的测频下，多个地点被确认属于 Level C-999 ，包括但不限于某些楼梯、房间与小径。一个这样的地点在外表上看来，可能仅仅有30平方米的面积，楼梯的平均面积更为狭窄。但事实是，它们全部属于一个层级，编号为 Level C-999 。一个这种离散的结构，称为 Level C-999 的一个 “残片”
//fragment
// 。
//
//
//残片大多出现于两个空间的错误之处，它以一种“过渡”的方式连接两个地点。当流浪者走过一段昏暗的走廊或是一个街角，踏上一级熟悉的楼梯时，可能就身处于 Level C-999 之中。而对于此，流浪者通常视而不见。2， Level C-999 的发现也迟迟推后到了2022年。但不管 Level C-999 残片怎样出现，它的残片较大概率与层级周边的光照度不一致，这是识别它的一种方法。一般来说，残片在室内出现的时候，灯光较入口昏暗。
//
//
//残片也可能连接两个不同的层级。有些残片可能不是狭小昏暗的，它们可能开阔、狭长，可能被阳光所照。一如连接着楼道与楼道的，可能仅仅是一扇简单的防火门，与它两边短短的过道；园林与海岛之相连处，可能需要的是一片迷雾的海面；而连接着城乡至海岛的，可能是一条不知几千米的河流。
//
//
//一切定位系统在 Level C-999 中都失去了效应，或是受到原层级的强烈干扰。然而，似乎可以很粗略地估计出层级的大小3：两百万平方千米。这些面积是由千万个碎片互相堆叠形成的。
//
//
//我们曾经做过将它编为房间的尝试，然而事实上，层级密钥向我们证明了它正是一个独立的层级。而且到今天，我们也没有发现哪怕一个有多种结构变化的特殊房间。
//
//下面是对于残片形式的简单举例描述。
//
//回廊、门与楼梯
//the-door.jpg
//Level C-999 的某个残片，主要是一条较长的走廊。门后有较强光亮的为Level C-67，而较暗的走廊是Level C-999的一个残片。
//
//这种样式的 Level C-999 仅出现于房室层级。4
//
//
//流浪者偶尔可以在Level C-67发现残片。在这里发现的残片，有些结构规整，仅仅是一条简单的楼道。楼道的混凝土墙面已经十分斑驳，似乎有数十年建成时间。接近地面的墙面更为脏污，被条条痕迹占满，甚至有可能发现一个或半个清晰的灰色脚印。有些走廊的地板上铺设了瓷砖。由于现在瓷砖是统一的昏黄色，并不能确定它的本色。瓷砖上有厚厚的一层积灰，似乎很难清理干净。楼道天花板上，悬吊着昏黄的荧光灯。每条走廊的两端，经常会出现一扇白色的、新漆好的铁门。铁门上镶嵌着一块红色的标牌，但上面没有可辨识的任何文字。推开铁门会导致其发出强烈的吱吱声。Level C-67固有的皮革气味，似乎在这里更为强烈。
//
//有时，残片是一条向上的楼梯。楼梯通常昏暗，与Level C-67有光照的环境并不一致，唯一的光源是一块长方形的安全出口指示牌，散发着微弱的绿光。在绿光下，可以看见楼梯似乎从建成就没有太多装饰，仅仅是在地面上铺设了与之前楼道一样的瓷砖。瓷砖上有一样的积灰，在积灰与光照的影响下，梯级的直面与平面似乎显得被生硬地割裂开了。楼梯与外部Level C-67的界限仍然是一扇白色的新漆铁门，然而似乎有些地方没有这扇铁门，仅有三小段白色的门枢残余。楼道里仍然有着皮革气味，而造成这种气味的物质在微弱的绿光下似乎特别显眼，犹如一层迷雾。
//
//
//Level C-473中， Level C-999 残片可能会表现为一条面馆走廊。走廊的装修极为简陋，地板与墙面离地约1米以下的地方，全部铺设了湿滑的花纹砖。有些形状不适配的角落，这些花纹砖就失去了原有的正方形状，边缘变得扭曲，十分怪异，这是原来的Level C-473中不会发生的。残片走廊中，瓷砖上的水一般有1cm深，极为湿滑。走廊的两边，整齐地放置了木制餐桌椅，餐桌椅的表面很粘腻，散发着某种清洁剂的气味；餐桌椅下端浸泡在水中的一段大多已经腐烂了。墙面上悬挂着老旧的拉线式电风扇，即使它不能工作，仍然传来开动的噪音。走廊中似乎也装载着苍白色的荧光灯，但灯光经常全部熄灭，或只留一两盏灯在走廊尽头忽明忽暗。Level C-999残片似乎比周围层级的温度低，空气中散发的醋味尤其明显，能够让人联想到盐酸的气味。
//
//
//Level C-999也组成了一些层级的出口与入口。
//
//
//Level C-67的入口部分：为数不多的情况下在Level C-13中会出现一个标有“消防通道”的防火门，进入后可到达Level C-67。5
//
//
//
//文中提到的“防火门”及门后的一小部分，就是Level C-999的一块残片6。这块残片构成了两个层级之间的界限。似乎经常出现在楼道的末端，大致是新上了白漆的铁门，与之前我们提到的走廊中的门相似。唯一的不同，就是这扇铁门的红色标牌写着白色的“消防通道”字样。推开这扇门需要的力度似乎需要大一点，而推开之后，经常会有一股冷气流夹杂着皮革的气味从中吹出。这扇门是单向推开的，当进入之后，可以听见背后的门先是发出吱吱声，然后重重地关上，带着气密生成时产生的轻微低音。再回头看去，铁门还在，然而却无法推开了。
//
//
//
//
//巷道、小径、河流、公路或铁路
//the-road-new.jpg
//Level C-305中的Level C-999。发现它是因为它以400米的长度连接了线性空间相隔3200米的地点。
//
//这种情况仅出现于露天层级。
//
//
//或许流浪者会在Level C-305发现一条极其寂静的层级公路，这条公路宽约20米，并完全陷入在黑暗中。道路两旁虽然每隔十二米有路灯，然而它们没有发光或发的光根本可以忽略不计。道路的两边是排列整齐的楼房，似乎是上世纪90年代的建筑风格，高约6层，但在黑暗中难以辨别清晰。有些房间亮着灯，灯似乎总是老旧的白炽灯，发出暖黄的光。一些楼房甚至会有着门面，经营的是小吃店或超市一类的店面。一些店面甚至开着灯。这些开着灯的超市或小吃店看起来正在整理物品，做着凌晨的准备工作，但似乎它们永远都在4:30的时间里准备着。从超市的窗户中投出的昏黄色光与招牌的灯光，似乎是这篇街道唯一的光源。由店面的门牌来看，它们并未曾被发现Level C-305的任何地点。天空中诡异地出现了星星，但没有观察到月亮的报告。
//
//
//当残片出现于Level C-34时，表现为一条简单的土径。有些时候，它也会表现为一条碎石路，碎石路上铺满了各种硬质的材料。土径的两旁是已开垦但荒芜的草地，植物一般能高大约2米，与层级其他地点低矮的草原式植物不似。这里的植物如芦苇、狗尾草等，皆与前厅亚热带的植被非常相似，对于层级的温带植被来说，这也许式一种反常。芦苇叶片茂密，茎秆极高，所以无法看见外面的情况。小径一般宽约50厘米，甚至有时更窄，如一条在植物海里沉下去的凹槽。有时，小径的旁边会出现一些低矮的灰砖堆或木料捆。
//
//有时，这条小径似乎会出现一些变化。最经常的变化是，两边的芦苇被高大的油菜花植株所替代，并且似乎正是它的花期。这时，流浪者会闻到一种很浓烈的油菜花气味，它似乎能够使得流浪者体感温度稍微增加，并且轻微地出现头晕。奇怪的是，油菜花没有结出任何一个荚。有时，小径底部本身会被草铺满，并开满一些蓝紫色的花朵。这些花似乎没有任何价值，也不会对流浪者产生任何影响。
//
//
//railway.jpg
//Level C-34与Level C-28之间的铁路。它穿过的是一片巨大的热带草原。
//
//一块残片连接着Level C-34与Level C-28。它表现为一条极长的铁路，铁路上运行着中国老式的绿皮火车。这列火车内，有着正常的车厢结构，座椅上覆盖着一层蓝色的布料，并且背后有可伸缩的桌板。然而，这些陈设可能相当破旧，桌板的塑料可能泛黄，桌椅也可能破损露出里面的纤维填充物，而且，无论哪里的陈设总是覆盖着一层积灰。车窗外有着一片热带草原，可以看见农田与村落，经常能够看到远处稀疏的金合欢树与山脉。有些车窗可能直接缺失了，也有些车窗似乎破损了，只留一个窗框。整列列车有着18个车厢，然而坐上列车的流浪者却极少。在行驶途中，可以听见列车引擎轰鸣与列车摇晃的声音。这趟列车行驶速度大约是每小时120公里。
//
//若流浪者从Level C-34向Level C-28出发，可以看见远处城堡状的城市慢慢近前。注意由于Level C-28层级视觉异常效应的影响，火车越向Level C-28走去，视觉就越是对比强烈、饱和清晰，如同修图软件中将饱和度与锐化渐渐拉高的图片一样。
//
//Level C-271的残片，多是一条覆雪的小巷，街道两边有着路灯，雪就在路灯的光柱中飘下来。雪已经积到20cm或更深，而地面上是一层湿滑的薄冰。道路上是一些混乱的车辙，似乎并不是由任何实体或人类造成的。这里的温度一般在-25摄氏度以下，比层级剩余的地点更冷。小巷旁边是高大的砖墙建筑物，一层的店面一般都有着落地窗，开着暖黄色的灯，但灯光晕成一片，因为玻璃窗里已结了一层水雾，或是霜花。商店内陈设大体与层级剩余地点相同。由于两边高大建筑的逼仄，这条小巷一般永久吹着冷冽的风，当风带着雪迎面吹来时，可能使流浪者因为某种特殊的条件反射而窒息一瞬间。
//
//
//
//房间
//the-room.jpg
//Level C-28中的残片，经过反滤镜处理。磨砂玻璃门通向层级中的另一个地点。
//
//
//
//Level C-28的城市，楼道内随机出现着一些昏暗的房间。这些房间装修风格不似层级的环境，光照稀少，最大的光源是顶上悬吊的1至3盏射灯。射灯的光色保持明黄，在射灯的光束下，层级内漂浮的尘埃尤其显眼。这种房间的内设一般都类似于现代化欧式装修的厨房与餐厅或是客厅。在房间的中央摆放着一套或多套桌椅，墙面上有内陷的空间用于灶具、电视或沙发。在房间的另一侧，通常是一扇磨砂玻璃门，或是一扇装载了镜子的推拉门。房间中近乎一尘不染，厨房水槽内或是干燥，或是装满了一池杏仁水。
//
//darkness.jpg
//Level C-28中的，另一种形式的残片。经过了反滤镜处理。
//
//楼道内也会出现另一种形式的房间：黑暗并且空旷。大多没有光源，建筑结构只有几条规矩的立柱。地板贴上了木纹的贴纸，延伸到房间的墙脚处。地板上洁净无尘，像是被故意清理过一样。可能会在房间的远处，发现一些彩色的纸带悬挂在明亮的灯光下，但走进却发现那是商场中悬挂的促销活动告示而已。空旷的房间内有时会放置一把椅子，有时也会放置两到三张课桌。除此之外，残片内就几乎空无一物了。在这里，能够明显听见上方排气管传来的巨大风声，也能够闻到新装潢房屋的油漆气味。
//
//
//其他未被确认的形式
//Level C-999 的形式有可能是无限的。毕竟后室C层群有很多的这样的界限，而似乎每一个界限处，都会有一片 Level C-999 去填满。
//
//我们在这里列出的仅仅是该层级结构的一角。
//
//现在我们猜想，是 Level C-999 本身，带给了层级一些非欧几里得性质，比如互相穿越的走廊、沿直线走达不到目标、返回无法到达原点等。本层级可以无限制地架在层级的空间之上并不影响层级本来固有的性质。
//
//
//同时，有一些入口、出口本身就是 Level C-999 残片，仅仅是因为过渡极为合理，才被划分为两个层级所属的。本质上来说， Level C-999 构成了层级之间的界限。
//
//
//有一个理论猜想，本来 Level C-999 的残片就一片挨着一片，形成了一个巨大的 Level C-999 层级，而这个层级到处都是切出往其他层级的出口。这能够解释为什么灯光在 Level C-999 中经常不工作，它们的布线已经被切断了。
//
//这也就是说，在流浪者每天走过的长廊的外面，可能就是另外一间阴暗的走廊，一窝笑魇的蛋在阴暗里繁殖；也可能外面就流淌着一条迷雾笼罩的海域，而长廊的墙外，可能就是雾气自然飘落凝成的片片水珠。仅仅是一墙之隔而已，由于 Level C-999 本身太过于合理，似乎没有流浪者想过那墙外面是什么。流浪者们仅仅关注着自己存在的世界，因为与前厅相近的过渡场景而感到稍稍安心；但从来没有想过，给他们这种既视感的仅仅只是这个层级的一小块残片，而残片拼合起来是一片混沌的世界。
//
//这个层级在“过渡”这方面，或多或少参考了前厅那些过渡空间的地点。墙面上的污渍与脚印，瓷砖、白墙和“安全出口”的绿光指示牌，木纹地板纸，甚至是一间现代化欧式装修的、洁净的房间。这些现象产生在过渡处，不仅丝毫不会让流浪者感到错误，还会让流浪者产生一种安心的错觉——这里太接近前厅了。后室C层群，因为其进入方式不易与特有实体危险所著称，在流浪者已经走了如此远之后，当他们面对这个过渡的地点，“似曾相识”与“既视感”就成为他们报告的关键词了。
//
//实体
//简单来说， Level C-999 的实体，就是它连接的两端层级的实体。
//
//大多实体似乎认为 Level C-999 仍然是它们的栖息地，或许是因为 Level C-999 本身善于融入周围空间中，也可能只是实体对 Level C-999 早已习以为常。
//
//所以在这里流浪者依然得担心某个阴暗的角落就藏着一些实体，或是视野外的区域正行动着某种实体。流浪者仍然被注视着，仍然被监听着。
//
//基地、前哨和社区
//有些基地、前哨和社区，无意地建筑在了 Level C-999 之上。毕竟在一栋大楼中出现的一条楼道或一间房间，看起来如此寻常，人们不会思考它是否处于同一个层级内。
//
//或许流浪者们在 Level C-999 的一个残片上放置了一些珍重的物资，但 Level C-999 不知哪天就可能消失不见。也或许 Level C-999 的某个残片就是我们一个基地的主要通道，当它消失的那天足以将基地打成两半。
//
//但也可能 Level C-999 就将长久存在于那里，不再改变。
//
//入口与出口
//入口
//在后室C层群，走进某个昏暗的长廊或楼梯。
//进入一间在楼道旁突兀出现的昏暗房间。
//走入一条似曾相识的巷道，坐上一辆前往另一层级的火车，乘上一艘前往另一层级的渡船，或只是简单迷路，并发现自己身处一条不熟悉的小径。
//推开一扇门，并意识到门后并非所处层级的简单延伸，而是与其他层级的界限。
//这些入口分散在C层群的一切层级中。流浪者一般可以遇见较多的 Level C-999 入口，然而多数情况，它还是会被视而不见。仅仅是因为，它与层级的环境过于相似了。
//
//出口
//走向长廊的尽头，或许要推开一扇虚掩的门。
//或许走向房间的前门，或许走向房间的后门。
//达到巷道、轨道或是小径的尽头，或许也可以原路返回。
//这些出口通往C层群的任何一个层级。这意味着，踏上这些出口的每一次，流浪者都可能会去往C层群中未勘探的层级深处，并独处在那些仍未知晓的空间中。也可能不会。总之，如果你想跨过那道界限——
//
//请一定要慎重。
//
//毕竟你跨出后所面对的，可能就是人类未涉足的一段艰难且无尽的路途。
//
//
//
//评分: 
//+97
//+
//–
//X
//作者信息
//Footnotes
//1. 值得一提的是，传言称C层群本身的C字，代表了"Combine between humans"，即取材于这个称谓。
//2. 于是，即使在原有确定资料的前提下
//3. 方法是，先在残片之内估计连接Level C-34到Level C-63河流的面积，然后根据大量报告，总结出残片与河流相邻的概率。这种方法误差极大。
//4. 关于房室层级的大体定义，请查找档案员工作须知：实体栖息地分类指南。
//5. Tartaros，(2022)，Level C-67于M.E.G.数据库，67：2。
//6. 或许应该说很多块残片，毕竟出口有无数个。
package lvls19x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1999{}