//本文档由M.E.G. 医学研究院制定，不得对本文档进行擅自修改。
//Level C-972 已经被封锁。本文档目前仅存储于Level C -972 内部网络，供Level C -972 居民参考。请务必准确无误地传达/执行本文档中加粗的要求。
//
//为了方便不便观看本文档的本层级居民，本文档已经转录有音频版，并可通过Level C -972的广播系统传达。
//
// 
//
//生存难度：
//等级 0
//
// 
//稳定
//████
//Level C-972 是后室C层群中的第972层。
//
//描述:
//Level C-972 是一处隧道状空间，其内部布满了大小各异的管道。但是与结构相似的Level-2不同的是，Level C-972 的隧道呈封闭的环形，其宽度相当大，以至于M.E.G.能够将其两侧分隔为多个隔间以供居住。此外，Level C-972 的管道网络相对整齐，基本由一套大型管道系统及其附属管道组成。目前在Level C-972 中未发现窗户或者其他通风口，推测本层级位于地下。
//
//自从2022.10.31 起在与Level C-972 相邻的数个层级接连发生的未知疾病爆发以来，Level C-972 已进入了与其他层级隔离的封锁状态。对于所述疾病，我们知之甚少，目前只知道此疾病对于未成年有着无法逆转的严重影响且未成年能够成为疾病的传染源，而对成年的影响较轻。目前M.E.G.已经确认Level C-972 以及相邻层级的未成年已经全部转化为传染源，因此请本层级居民们牢记，她们不再是我们的朋友。
//
//目前，本层级居住了接近100名从相邻层级撤退出来的居民，由于前述疾病的特性，这些居民全部为成年，不包括任何未成年。目前发现撤退至Level C-972 的这些居民全部已经感染了前述未知疾病，且已经或多或少地展现出了症状1。
//
//现在，Level C-972 的居民都分别居住在前述管道两侧分割出的隔间中，并且为了防止可能的交叉感染，禁止居民相互接触。为了调节隔离状态的居民的心理状态，M.E.G.在整个层级安装了广播系统并24小时不间断播放音乐。除此之外，为了治疗本层级的居民，M.E.G.每天分六次（00：00、04：00、08：00、12：00、16：00、20：00）通过管道向居民注射杏仁水和目前认为适用于前述疾病的实验性药品，并通过前述的广播系统进行通知，请居民务必准时做好准备。
//
//为了促进居民的健康，我们为每位居民分别错峰安排了自隔离间外出活动的时间，并以特殊的广播信号通过前述的广播系统进行通知。目前，M.E.G.已经确保了本层级环境中前述疾病的绝迹，可以认为本层级是完全安全的，因此请居民当轮到自己的外出活动时间时不要顾虑，离开隔离间尽情活动。
//
//但是，虽然M.E.G.已经确保了本层级的安全，目前已经接到多数报告表示在隔离间内听见从中央隧道中传来了打斗声、惨叫声等声音。目前，M.E.G.经研究认为这些声音是由于前述疾病导致的幻觉症状，因此请居民们无视这些声音。
//
//M.E.G.正在前述的相邻层级处理所述的未知疾病，并将视本层级居民的健康状况公布本层级的开放时间。在此之前，请居民们耐心等待并严格执行本文提到的命令。
//
//M.E.G.在此衷心祝愿本层级的各位居民尽快恢复健康。
//
//基地、前哨和社区：
//M.E.G. Level C-972网络中心:
//由吴仁道博士主管。
//由于防疫要求，具体位置暂不公布。
//请勿在外出活动期间试图寻找或者尝试进入本基地。谢谢配合。
//入口和出口:
//在M.E.G.宣布本层级开放之前，请勿出入本层级。
//
//
//
//
//请确认自己血液的颜色。
//
//
//作者
//« Level c-971 | Level c-972 | Level c-973 »
//
//脚注
//1. 包括器官缺失，可能的悲尸循环等。
package lvls19x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1972{}