//Level C-994
//评分: 
//+28
//+
//–
//X
// 
//
//生存难度：
//等级 5
//
// 
// 
// 
//Level C-994是后室C层群的第994层。
//
//描述
//A
//Level C-994中某条街道的图片 。
//
//Level C-994是一片非欧几里得空间，看起来像是一座巨大的小镇。层级内的时间始终保持在日落时分。因此层级内的自然光照并不充足，天空整体少云，以深蓝色为主体，夕阳周围一小片天空被日光染成黄白色。许多区域仅有一些晦暗的夕阳光勉强提供视野，而还有相当一部分区域笼罩在阴影之中。
//
//小镇的建筑同时带有现代的美式和日式建筑风格，拥有前厅中一个正常小镇所具有的如便利店，诊所等一切建筑设施，但几乎没有通电源。类似于Level 9的，可以发现层级内存在一些异常属性：
//
//可以发现部分建筑以物理上不可能的方式堆砌或重叠在一起。
//在一些特殊情况下流浪者附近的路灯可能会突然闪烁或短暂亮起，原因尚未探明。
//在设计上本应贯通的道路被一堵墙或一栋房屋奇怪地堵住。
//可能突然出现来源不明的网络信号。
//少数情况下流浪者可以观测到远处有类似汽车的东西开过去，尽管层级内未被确认有可驾驶的汽车存在。
//层级内偶尔会出现一些紫阳花，不知为何它们看起来与环境格格不入。
//
//层级内一些建筑不可进入，而另一些可以进入，内部装潢完整且干净整洁，但其亦存在以下异常属性：
//在餐桌上可能会摆放着冒着热气的饭菜。无论过多长时间它们也不会变冷或腐败。
//沙发上可能会存在一块或更多的压痕，且相对周围带有一定的温度，温度也不会随时间而降低。
//屋内盆栽等植物上始终挂着水滴，但可以确认它们不是露水。
//屋外可能会晾着一些衣物或被褥，它们处于湿润的状态，且这种状态会一直保持。
//屋内的许多电器设备保留着刚使用过的痕迹，电灯开关保持被按下，尽管没有电源。冰箱里只会出现杏仁水。
//
//层级似乎会自动维持这些异常属性，即使流浪者尝试对建筑内部进行破坏，它们也会在流浪者移开视线后出其不意地变回原本的状态。
//所有进入Level C-994的流浪者都会出现在同一个建筑内，这里外表与层级内其他普通的居民房无异，被流浪者们称作准备室，其中不存在实体且有物资补给。在准备室内的流浪者会受到一种放松的心理效应。一旦流浪者打开房门离开至室外，他们将再也无法回到准备室。
//
//在流浪者离开准备室前5分钟内，层级的非欧几里得性质将把他们与一切实体（包括其他流浪者）隔开，利用好这5分钟将非常重要，因为即使层级到目前为止看上去似乎都没有任何危害，但在这5分钟之后，流浪者将开始面对层级内的大量实体。
//
//实体
//层级内存在大量的笑魇，肢团，猎犬，窃皮者，悲尸，死亡飞蛾，幼年无面灵，已知其分布大致如下：
//
//部分窗户背后有阴影，它们是有害的陷阱，也可能会通向Level 1.5
//死亡飞蛾通常在路灯或电线杆顶端附近徘徊，伺机偷袭流浪者。
//笑魇会在没有阴影的普通窗户后出现，也有可能躲藏在某扇门后或某个柜子里等待着流浪者打开。
//猎犬们平时在小巷里游荡，在听到动静后将迅速冲出来。
//幼年无面灵，窃皮者和悲尸出现在大多数区域。
//肢团一般躲藏在室内室外的角落，通常会在厕所或垃圾箱等区域出现。
//
//层级内昏暗的环境无疑给实体们的狩猎提供了许多便利，也大大增加了流浪者存活的难度，贸然离开准备室无异于宣判流浪者自己的死刑。
//基地、前哨与社区
//攻略组
//来自M.E.G.的一支流浪者小队在层级内过着游击生活，依靠外部的人员补给和层级内部资源生存1，若流浪者遭遇了他们，他们可能会与流浪者进行很划算的交易，但遭遇的可能微乎其微。关于本层级的大多数信息均由他们提供，包括上述实体的分布也是他们在长期的游击生活中总结出来的。据说他们正在尝试建立一个固定的站点。
//
//从某一时刻（具体无从考证）开始，在准备室里唯一能被夕阳照到的桌子上被订上了一张由攻略组撰写的笔记，内容如下：
//
//隐藏
//你好！相信你对你现在身处的层级已经有一定了解了吧。我们是在这里长期居住的流浪者，这张纸条是我们让外面的人代写并放在这里的，因为你十有八九找不到我们。希望它对你有帮助。
//
//如果你要问我们为什么要待在这么危险的地方……那当然是为了你们。我们已经把层级内的属性和实体的生态详细地整理出来了，就是为了让之后来的流浪者能更方便地穿过这里，而且你看，你在这里感觉很舒适很惬意对吧？看看那夕阳，就像你小时候每天放学所见的景色一样怀念，如果一个一无所知的人进来了这里，你觉得他会发现这是个危险的层级吗？等到他发现时就晚了。为了避免这种情况出现，我们才自愿留着这里收集情报。而且对于那些为了追逐迷雾而来的人，我们正在想办法制订一条最安全的通过方式，可以让他们遭遇最少的危害。
//
//话说这是不是有点玩RPG开荒的感觉了（笑）。总之，如果你准备向迷雾进发，请确保你一定要做好万全的准备，最好多带几个人，准备好枪械和充足的弹药，近战武器也必不可少。杏仁水等吃吃喝喝的一定带够，这个房间的冰箱里也有一些，你可以带上。还有，这里的实体对紫阳花似乎有些反应，我们还在研究，但是如果你遭遇了危险这是值得一试的方法。以上，等我们完成了我们的工作后也会去找你们的，彼此都加油吧。
//
//还有不得不重复说的一件事，千万不要随便就离开准备室，千万不要！我们虽然已经发现了贴着和教程关卡同样墙纸的墙壁，但那都是没用的，一旦离开，你便没有任何退路。如果你不能保证自己拥有在实体的围攻下跋涉至少十几英里的能力，不要出去。而相对的，如果你已经准备好了，深吸一口气，然后推开那扇门出发吧！
//
//希望你能平安到达那远方。
//
//——攻略组全员
//
//在准备室通往室外的门上也被攻略组贴上了一张纸条。
//
//隐藏
//在打开门前请一定三思，门后将是一条充满危险且无法后退的道路。
//但，若你能跨越这一切，在危险后等待你的将是远方更广阔的世界。
//
//入口与出口
//入口
//在C层群大多数层级都有很小可能找到一扇带有橙黄色的半个太阳的图标的门，推开并进入门中即可到达Level C-994。
//出口
//如果流浪者还在准备室内，推开来时的门就可以回到他们进入前所在的层级。只要流浪者还在准备室内，这个出口就不会仅仅因为移开视线而消失。
//如果流浪者已离开准备室，他们将不再有退路。向着任意方向行走超过10英里，期间流浪者会与大量的实体进行战斗，最后他们会到达一条东西方向的电车铁轨上。向着夕阳那一方径直前进，将会有比之前更多的实体从铁轨两边冲出来，若流浪者存活下来并向前行进2英里后，实体数量会骤减，同时空中会开始弥漫雾气，到这里便无法再后退，一旦流浪者向反方向后退哪怕一步，无数的实体会突然出现并将流浪者拖走2。继续向前则在之后3英里内雾气会越来越浓，流浪者唯一的路标只有从此时开始生长着紫阳花的铁轨和远处逐渐模糊的夕阳，最后当雾气浓度高到使流浪者只能看见自己脚下，且紫阳花和铁轨不再延伸时，再向前走数米即可到达Level C-998。
//作者信息
//« Level C-993 | Level C-994 | Level C-995 »
//
//Footnotes
//1. 他们已经发现了一种相对靠谱的方法以让外来补给人员与他们汇合，但他们拒绝向外界透露
//2. 但失足后退似乎不会触发这一事件
package lvls19x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1994{}