//Level C-942
//Level C-942
//
//评分: 
//+24
//+
//–
//X
// 
//
//生存难度：
// 
// 
// 
//ztuOyD.jpg
//目前唯一一张已知的关于Level C-942的照片。
//
//Level C-942是后室C层群的第942层。
//
//描述
//Level C-942，又被称为“音阶”。本层的主体是一个由多类矩形方块组成的浮空楼梯，流浪者无法通过切入这些方块离开此层级，也不会与其他流浪者相遇。这些方块均以约为30°的斜度向上不断延伸，整个楼梯的长度为随机的，所以每位流浪者所遇到的楼梯长度皆为未知，有可能仅长30米，也有可能没有尽头，每段阶梯的长度也无法估量，但其都会被以宽约4米的平台所隔断。流浪者可将其作为短暂的歇足点使用。流浪者会有一定概率在其上面捡到一副3D视觉眼镜，戴上后将会极大的有利于流浪者的探索。该层级的下方是一片无边界的漆黑虚空区域，每当流浪者失足意外掉落后，都会在自己第一次来到该层级的平台上醒来，而苏醒时间则会随着流浪者掉落的次数而不断递增，由此可推断在坠落次数过多的情况下，流浪者将有可能无法醒来。一些流浪者在坠落后有可能会出现在离他坠落前最接近的歇足点处，也有可能随机出现在别的地方，或者出现在离开该层级的门前。
//
//Level C-942中不存在任何形式上的自然光源，唯一的光亮来源流浪者脚下的矩形方块及隔断它的平台。我们无法探明这些方块由何物质组成，其有着大理石的质感，却不断向外发光并发热。这些方块会在被踩下的情况写发出不同的声音，并散发出不同的光芒，这也便是该层级如此命名的原因之一，流浪者甚至可以在一定情况下以此弹奏出一小段音乐。除此之外，流浪者所有的电子设备都会在该层内受到一定的电磁干扰，利用其拍摄出的照片也会受到一部分影响。这也使得我们在初期难以收集有关该层级的信息。
//
//大部分的矩形方块都会以一种稳定的形式在空中悬浮着，但其却没有一个准确的大小，且每个方块之间的距离也会在一定情况下发生改变，这些改变均不列入方块变种中，而是将其归类于一种独特的特性。目前暂未有流浪者到达该层阶梯的真正"终点"，一些声称自己达到了真正“终点”的流浪者都被诊断出其患有严重的精神疾病。
//
//在目前每一个成功逃脱该层级的流浪者的描述中，都提到了一扇白色的门。他们均声称是通过这扇门离开的该层级，并最终来到了Level C-850或Level 91中，关于这扇门，流浪者通常将其描述为“散放着光芒的”，“令人充满希望的”以及“随机出现的”，一名流浪者称“我被困在了该层级差不多有一周的时间，在我一眨眼的功夫，那扇门就那样突兀的出现在了离我不远的一个歇足点上”。以目前对该层级的探索，该门的会出现的大致位置还是未知的，流浪者对该门的出现的条件众说纷纭，有的说其位于真正的“终点”上，而有的则认为它会在某种特定条件下出现在流浪者的眼前，这完全是看流浪者的运气是否好坏；但从目前所有说法看来，唯一可以确定的是这扇门不会出现在虚空中或台阶上。目前流浪者进入该层级并离开的最长时长为5天，但不排除还有更久的可能。
//
//令人意外的是，流浪者所有的饥饿感或疼痛感都在该层内完全消失了，或者可以说是被“剥夺”了，流浪者无法感受到除困倦与恐惧外的所有情感。但其余的情感都会在流浪者离开该层级后立刻恢复，有个别流浪者曾因此在离开该层级后患上了严重的精神疾病。
//
//组成
//该层内的矩形方块均以一种无法解释的方式浮空着，目前我们已发现多种有关这些方块的变种以及其他有可能会影响流浪者探索的物体，它们有可能对流浪者的探索有所帮助，也有可能使得流浪者万劫不复，这些变种将在下方列出。
//
//移动平台
//
//
//移动平台与其他方块在外形上无较大的差异，其有可能会随机出现在台阶的两侧，或位于台阶的排列中，对于部分跨距较大的方块，流浪者可以凭借移动平台来爬上它们，注意，个别移动方块有时会如同其他正常方块静止在半空中，流浪者需要站上去才能激活它们。移动平台在运动的过程中有可能会伴随着轻微的振动，流浪者可能会有较小的几率短暂地“切入”它们，但此举不会导致流浪者来到任何层级。值得一提的是，移动平台在踩上后不会发出任何地声音或光芒，流浪者可以以此辨别，以免错将普通平台当成移动平台。
//除此之外，移动方块仍有一名为“旋转方块”的变种，但其仅仅只是在移动的基础上会不断旋转，且极其不稳定，流浪者站上去后很可能会被其给甩飞并坠入虚空中，不建议流浪者踩在它们上面。
//
//激光
//
//
//该层级内出现的激光类型与Level 154中的较为相似，但却集合所有它们的特性，这些激光将会随机分布在台阶，平台等方块附近，流浪者触碰后会留下被灼伤过后的痕迹，尽管流浪者在该层级内失去了疼痛感，但仍会在离开该层级后受到激光带来的伤害。流浪者在触碰个别激光后有可能会被传送到最开始进入该层级的平台上，这种传送将会对流浪者带来极大的困扰。
//不仅如此，我们还发现这些激光会以一种类固体的形式突然出现在流浪者周围，并将流浪者撞落至虚空中，这种出现方式是难以预测的，并毫无任何征兆。因此请广大流浪者在探索时多加注意，以免被撞落。
//
//欺骗方块
//
//
//欺骗方块是一种外观与正常矩形方块完全相似的方块变种，它们将会随机出现在台阶的队列中，并影响流浪者对落脚点的判断，踩上后会直接导致流浪者失足掉落进虚空，除非他们能即使抓住其他的方块。唯一可分辨欺骗方块的方法是观察它们散发出的光线是否与正常的方块相比所要暗淡一些。
//传送方块
//
//
//传送方块通常会出现在歇足点上，它们通常会发出蓝色的光芒，流浪者踩上后可能会被传送到该层级内的任意位置——台阶，平台，甚至虚空中。由于该方块存在多种不稳定因素，不建议流浪者在毫无准备的情况轻易利用其进行传送。
//增益方块
//
//
//增益方块是一种特殊的方块，它们通常会以各种形式出现在流浪者的周围，虽然它们并不能作为可立足的平台，但流浪者在触碰或踩踏后均会获得不同的增益效果，其大致分为：视野扩增，跳跃提升与移速提升三种。这些效果的附着时间通常约为3分钟，并可以不断的叠加，但叠加的时间长短会取决于流浪者的运气。
//视野扩增
//流浪者在获得该效果后的视野将会被放大，其效果如同佩戴了3D视觉眼镜般，流浪者可以在此增益下看到前方的各种障碍，甚至还可以发现可离开该层级的门。
//
//跳跃提升
//流浪者在获得该效果后的跳跃能力将会得到大幅的提高，有利于流浪者跨过不同的障碍并在不同的平台之间任意穿梭，有人称其跳跃的高度最高能达到5米，落地后也不会受到任何的伤害。但当流浪者跳起后将会很难控制自己的落脚点，建议在熟练跳跃技巧后再进行大幅度的距离跨越。
//
//移速提升
//流浪者在获得该效果后的移速将会得到小部分的增长，有利于流浪者快速穿过如激光等障碍，但由于该层级可供站立的空间过小，该效果通常被认为是无用的。
//
//基地、前哨与社区
//由于该层级的特殊性，无法建立任何的基地、前哨与社区。
//
//入口与出口
//入口
//触摸Level 12中的一个矩阵方块即可来到该层级。
//在Level 142中等待游戏加载时出错，将有可能来到该层级。
//在Level C-60中游玩一款名为“Real Life Obby”的游戏即可在通关后来到该层级。
//掉入Level C-460中的虚空同样可以来到该层级。
//出口
//坠入虚空将会有极小的几率回到Level 12。
//进入一扇门，即可来到Level C-850或Level 91。
//在触碰激光后也会有极小的概率来到Level 142。
//附录
//用血与泣写下的遗书：
//今天…是我进入这个混沌之地的第三年
//
//这一切还要从那个Level 12中的矩阵方块说起
//
//是啊，悬浮的方块
//
//挺有意思的吧？
//
//殊不知，隐藏在它背后的
//
//则是那独属于我的炼狱
//
//虚空，虚空，无尽的虚空
//
//坠落，坠落，还是无尽的坠落
//
//我原本以为，我可以很快离开这个层级
//
//去迎见我的亲人，我的朋友
//
//第一天
//
//我向上不知攀爬了多少阶梯，遇到了不知多少障碍
//
//都没遇到那扇门
//
//第二个月
//
//我查阅了众多有关该层级的资料，翻遍了不止多少有关该层的论坛
//
//仍旧无果
//
//第三年
//
//就是今天
//
//我算了算，我坠落了约105次
//
//随着坠落次数的增加，我沉睡的时间也便愈来愈长
//
//我的下次苏醒将会是什么时候呢
//
//回归正题，我仍在寻找出去的办法
//
//自杀？不，我甚至连感知疼痛的机会都没有
//
//寻找那传说中的“终点”吗
//
//啼笑皆非
//
//每一次踩下的方块，每一次发出的声音
//
//都在吞噬着我
//
//这个世界难道就这么遗忘我了吗
//
//我开始懊悔触碰那个方块的行为
//
//可惜，再怎么懊悔，都是徒劳
//
//或许，在毫无饥饿感与疼痛感的处境下
//
//我可以获得永生？
//
//可笑
//
//我想念阳光
//
//我想念天空
//
//我想念所有人
//
//哈，真希望有人能看见我写的这玩意
//
//我的电子设备早就迷失在虚空中啦
//
//如果有人能够看到我这用血所书写下的痕迹
//
//那我也知足了
//
//我该放弃希望了
//
//坠入虚空，并永远沉睡过去。
//
//或许，这便是我的解脱，我的救赎吧
//
//啊，血要流光了
//
//那就写到这里吧
//
//顺带一提
//
//不要因为好奇而葬送你真正活着的机会。
//
//：）
package lvls19x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1942{}