//Level C-998
//评分: 
//+36
//+
//–
//X
// 
//
//生存难度：
//等级 {$class}
//
// 
// 
// 
//Level C-998是我的家。
//
//咱们就别拘于格式的繁文缛节了。我不可能精准直击你的内心，所以我只好直接把要说的话实实在在地传达给你咯。
//
//photo-1595231951275-23967b222566?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1yZWxhdGVkfDF8fHxlbnwwfHx8fA%3D%3D&auto=format&fit=crop&w=500&q=80
//来这边。
//
//描述：你好
//欢迎来到寒舍。字面意思的寒，哈？这儿是有点冷。把衣服裹紧点吧，别冻着了。
//
//……
//
//不用提防，我真的没有恶意。当然，我能理解你。谁会对一个充斥着混沌与不安的世界彻底放心呢——是吧？谁能担保我不会在下一秒抽出刀子或者爪牙剖开你的后背？
//
//哈哈……或许的确有人会对你这么做，但那不是我。
//
//你能走到现在，一定伤痕累累。不，我说的不是你的肉体。
//
//别急着走嘛，坐下歇会？如你所见，这里除了墙、树、草，还有这浓重到望不清前路的雾，再无其他。
//
//权当陪陪我也好。
//
//谢谢。
//
//言归正传。聊聊我自己还有这个层级吧？这大概也是你比较好奇的？
//
//“能来到这个层级，那定然是心内存有痛苦。”
//
//这是混沌初开时，就被烙印在我心底的一句呢喃。直到我看到一个又一个抵达此地的流浪者，看着他们或悲伤，或急切，或恐惧，或木然的表情，我才明白这句话的含义。可能，只有那些心怀痛苦的人类才有机会来到这里。
//
//但随着岁月不居，我又进一步的发现：这句话在扯淡。
//
//进入这里和痛不痛苦压根没有关系。因为谁不痛苦？
//
//我刚刚说，你肯定伤痕累累。我已经懒得去窥视你的内心了，因为我发现会让你们人类苦不堪言的事情来来回回就那么几件。而且直接拿你心底最大的隐痛开聊不是很不礼貌吗？
//
//你的痛苦是什么，你自己清楚。
//
//不过总结起来，我发觉造成痛苦的元凶大约可以分为三个层面：
//
//未来不可知，现在不可安，过去不可追。
//
//我不是很好奇你最近有在因为什么而感到愁苦，毕竟悲欢并不相通。但是如果你想跟我讲讲，我愿意陪你。
//
//……
//
//我不想劝你什么，但我尊重你的欲望或者说理想。人各有志，我的确无法理解你们的追名逐利、或是疯狂占有、或是为了亲人爱人友人去燃烧自己的一切。作为旁观者，我始终觉得你们的一生悲哀的像烟花。它能绚丽地绽放一瞬，然后化作死灰，消逝在虚无之中。
//
//你也一样。
//
//你从呱呱坠地，到入土为安，满打满算让你活个一百年，也不过悠悠三万六千天。纵使你身怀百般信念，取过千种荣誉，踏下万个足迹，你依旧会死。直至最后一个记得你的人也将你遗忘或者带着对你的回忆踏入坟墓，你就再也没有留下一丝一毫的痕迹。
//
//你总有一天会被世界忘掉，像冷掉的烟花那样消散，你的一生不过是在烟花绽放的瞬间出演了那一小会儿。无论你是把它演成了波澜壮阔的热血传奇，还是卑不足道的人生悲剧，它都结束了。
//
//不不，我不是在宣扬什么悲观主义，我其实只是想说明一件事。
//
//一切都会过去的。
//
//好的，坏的，都会过去。在短暂的一生中，你理所应当地该为开心的开心，为痛苦的痛苦，但它们都不过是组成你生命的一个碎片。它们都会结束的……它们谁都没有资格支配你的全部。
//
//自从你们坠入后室，你们最深层的一种痛苦似乎是回不了家？但我一直很好奇，你们真的想回家吗？
//
//就现在，想一想。真的想回家吗？
//
//我不是在质疑你和家人的关系，我是在质疑你和世界的关系。因为我从来就不相信世界上存在极乐无垢之地。它不可能在前厅，也不可能在后室。
//
//你们喧嚣你们吵闹，因为想要安宁。但安宁是留给死人的——你不是世界机器的中心，它只会沉默地运转，自然而然的用它的齿轮碾碎你的一些东西。但凡活着，就会失去，就会痛苦，就会犯下对他人也对自己的罪孽。
//
//要是你去过虚空之岛，那里的声音会很容易让你回想起来。我就免了，我和祂不一样，我不爱说那些。
//
//这是很悲哀。当你拥有思考的能力后你就已经拥有了多种悲哀，这只是其中一种。
//
//但是。
//
//也要活着，才会得到。
//
//你已经走了很远，也即将走的更远。你没有在生活的屠场里缴械投降，而是闯到了现在，站在了这里，听着我在这里的絮絮叨叨。
//
//没准你还在防备我？生怕我又是哪个欺诈大师？
//
//哈哈……我再次真诚的表示：我没有恶意。你大可以在这儿放松你的每一根神经。
//
//我为你依然没有也依然无法卸下生命给予你的重担而感到由衷的钦佩与同情。当你还在前厅，生活已然不易；如今堕入后室，它更是无时不刻地在把你往生存的泥潭里一拖再拖。
//
//但你依然站在大地之上，而非相反。
//
//我很想为你做点什么。但你看，除了这里我一无所有。我想，我终究只是一个过客，也只能做一个过客。我无法理解你的悲欢离合，但我愿意倾听。
//
//是的，一切都会过去，但此时此刻你们拥有彼此，都愿意把自己有限的时间用在分享快乐或是互舐伤口上，这就已经弥足珍贵。
//
//忘记过去的苟且吧，把目光投向遥远的彼方？你可以把这里视做一个驻留点，一条分割线，作为往昔和明天的边界。过去发生了什么都已经是过眼云烟，都已经是岁月史书上的既定事实；未来会发生什么虽然不由你完全掌握，但你甘心吗？
//
//若是实在忍的难受，可以说给我听。
//
//我不是你，我确实无法和你的悲喜相通。这是一道悲哀的门槛。
//
//但我就在这里。我愿意陪你。
//
//基地、前哨和社区
//不不不，别在这儿逗留。这里可不是你的终点。
//
//如果累了，你可以小睡一会儿。要是以后想回来看看，我也随时欢迎。
//
//入口和出口
//你要走了？
//
//朝前便是。
package lvls19x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1998{}