//Level C-969
//评分: 
//+18
//+
//–
//X
//MEG-Logo
//▲警告——M.E.G.数据库待修改的文档▲
//标签：信息重叠 错误格式 一定内容被篡改
//本条目预计于202&▓▒█ΞΔ▧αΞΩ月%╠▀š日重写
//介于切入Level C-969的流浪者大多疯掉甚至死亡，所以出于人道主义和以广大流浪者集体为核心的M.E.G.精神，数据库成员暂时将所有报告Level C-X的信息整理并归档至以下6篇子文件以供进入Level C-969不同程度的人阅读。虽然部分文件略显奇怪，但鉴于文件全部信息均来自M.E.G.派发人员在Level C-969内自主编写，请务必结合自身情况谨慎辨别。————M.E.G.数据库成员致上
//▲如果你未来到Level C-X或者处于Level C-969的楼房120楼以下区域，请阅读Level C-X递交文件 1 。
//
//▼如果你已经来到Level C-969的楼房120楼以上区域或者出现幻觉，幻视，恶心，特别是无法辨别数字的情况，请阅读名称看起来最长的文件。
//
//●如果你已经来到Level C-969而且感觉自己处于强烈的牙疼，头疼且出现自我认知模糊的情况，请阅读名称看起来最短的文件，文件中含有解决方法。
//
//◆第4篇文件为M.E.G.前任成员Hikali的日记。
//
//■第5篇文件由于意义不明且疑似被篡改，目前正在修复中。
//
//关闭
// 
//
//生存难度：
//等级 3
//
// 
// 
// 
//Level C-969是后室C群集的第969层，同时也是距离C群集理论入口最混乱的层级之一，其相差范围约为30~95个C层级，越靠近该范围的极值就越有概率来到该层，这可以解释为什么来到此层级的人要么是略有资历的流浪者，要么是资深的层级探索者。
//
//描述：
//Level C-969外形上为面积8万平方米，向上延伸未知长度的千禧年风格的小区，其状态似乎一直保持在夜晚。所有的楼房的水电设施均完整且几乎没有有失灵或故障，楼房内部的环境和物资略微异样，单元房内大多为重型电器和罐装食品，但少见日用品和家具，同时所有房间都没有门。然而Level C-969并非安全，该层级的奇怪特性和实体足以干扰绝大数流浪者的探索和精神，以下指南能够帮助流浪者了解详情和应对方式。
//
//1 Level C-969的实体并不符合一般层级的正常行动逻辑，大部分实体的出现范围总是在流浪者视觉的绝对感觉阈限外，即刚刚无法发现实体的视觉盲区，一些大体型的实体可能会越过阈限露出肢端从而引起流浪者的注意，然而该层级的楼房内总是缺少门或家具的阻挡，所以流浪者会面临面对实体毫无防备和无处躲藏的情况。
//
//2 Level C-969的实体的存在是“模糊”的，因为实体只会出现在流浪者的视觉盲区，摄像机也无法捕捉到无人范围下的实体。据推断，该层级的实体处于一种“待定状态”，在无人环境下，实体的物质状态和移动行为会被停止，就如同游戏中NPC在玩家视野之外就会被隐藏一样，当实体只有进入流浪者视野盲区时才会被“激活”开始行动并外形显现。非盲区的区域的实体将被继续隐藏。被“激活”的实体会在一段时间内重新回到“待定状态”。
//
//3 Level C-969的实体分布众多，其中有种名为“袮”的实体极为危险，它们只会出现在该层级的楼房31层向上的区域。我们对它们的认知知之甚少，它们可能是■▒▓▓▓▓▏▏▏▎▋▌▍！？□□轉畵
//
//4 Level C-969会对流浪者产生视觉和幻觉影响，有但不限于产生既视感，突发失明，视觉画面扭曲以及幻视，其影响会从90楼开始随着楼房楼层的升高而加强。
//
//4.1 Level C-969产生的幻视较特殊，流浪者会看见不存在的的人影和笑声，视野会出现五颜六色的光圈，部分层级的景色会出现不合理处，同时会逐渐失去对数字的判断能力，这是极为致命的，因为建筑150楼向上的单元房门口的数字编号代表着不同意义，1,2代表迷惑，3,4代表欺诈，5代表解脱，如果进入对应的门会有可怕的结果，这是多次试验的结果。
//
//5 水在Level C-969很重要，该层级的自来水系统虽然完善，但水的成分含有未知成分，需要煮沸才能饮用。自来水供应在建筑的任何地方都不会中断，然而该层级并没有杏仁水。如果单元房内自来水管中流出的是红色的液体，千万不要饮用，关闭水龙头并寻找此单元房的水表，摁下表盘左边第4个按钮。接下来离开该单元房。
//
//6 不建议流浪者探索楼房129层以上的区域，因为从此处向上Level C-969的物资将逐步减少，部分单元房可能会出现完全空置的情况，此外加上递增的幻觉影响和实体藏匿的多种因素，这对于流浪者将会是极大的挑战。
//
//基地、前哨与社区
//由于来到此层级的人少之又少，该层级并没有任何的基地、前哨与社区。有人传言在某个楼房的355层有着一个人类聚集地，然而这并没有记录依据。
//
//入口与出口
//入口
//见上文。
//出口
//在Level C-X的草地中徘徊，有一定概率会来到Level 9。
//在楼房中向上探索100层左右，切入地板会来到Level 11。
//在单元房内极低概率出现的床上入睡，醒来时会来到Level C-186。
//据说向楼房向上探索400层会来到Level 996或者▊▊▊▊▊▊。
//关闭
// 
//
//生存难度：
//等级 3
//
// 
// 
// 
//视虐☒域是后室C群集最可怕的层级之一，同时也是距离C群集理论入口最混乱的层级之一，其相差范围很远。
//
//描述：
//视虐☒域外形上为面积极广，向上延伸未知长度的千禧年风格的小区，其状态似乎一直保持在夜晚。所有的楼房的水电设施均完整且少有失灵或故障，楼房内部的环境和物资略微异样，单元屋内大多为重型电器和罐装食品，却少见日用品和家具。然而视虐☒域很危险，该层级的奇怪特性和实体足以干扰绝大数流浪者的探索和精神，以下指南能够帮助流浪者了解详情和应对方式。
//
//▲ 视虐☒域的实体并不符合一般层级的正常行动逻辑，大部分实体的出现范围总是在流浪者视觉的绝对感觉阈限外，即刚刚无法发现实体的视觉盲区，一些大体型的实体可能会越过阈限露出肢端从而引起流浪者的注意，然而该层级的楼房内总是缺少门或家具的阻挡，所以流浪者会面临面对实体毫无防备和无处躲藏的情况。
//
//▲ 视虐☒域的实体的存在是“模糊”的，因为实体只会出现在流浪者的视觉盲区，摄像机也无法捕捉到无人范围下的实体。据推断，该层级的实体处于一种“待定状态”，在无人环境下，实体的物质状态和移动行为会被停止，就如同游戏中NPC在玩家视野之外就会被隐藏一样，当实体只有进入流浪者视野盲区时才会被“激活”开始行动并外形显现。非盲区的区域的实体将被继续隐藏。被“激活”的实体会在一段时间内重新回到“待定状态”。
//
//▼ 视虐☒域的实体分布众多，其中有种名为“袮”的实体极为危险，它们只会出现在该层级的楼房开始流血向上的区域。我们对它们的认知知之甚少，它们可能是■▒▓▓魜嘞▏▏▎▋睛呻▍失？□□轉畵的。
//
//▼ 视虐☒域会对流浪者产生视觉和幻觉影响，有但不限于产生既视感，突发失明，视觉画面扭曲以及幻视，以及被传达错误的信息，其影响会随着楼房楼层的升高而加强。
//
//▼▲ 视虐☒域产生的幻视较特殊，流浪者会看见不存在的的人影和笑声，视野会出现五颜六色的光圈，部分层级的景色会出现不合理处，例如在楼层高处向外观察到对面楼房不存在的灯光和顶楼，这是极为致命的，因为流浪者可能会受到诱惑，从而跌出窗外，这是多次试验的结果。
//
//▲ 水在视虐☒域很重要，该层级的自来水系统虽然完善，但水的成分含有未知成分，需要煮沸才能饮用。自来水供应在建筑的任何地方都不会中断，然而该层级并没有杏仁水。如果单元房内自来水管中流出的是红色的液体，千万不要饮用，关闭水龙头并寻找此单元房的水表，摁下表盘最左端的一个按钮。接下来离开该单元房。
//
//▲ 不建议流浪者探索楼房开始下雨以上的区域，因为从此处向上视虐☒域的物资将逐步减少，部分单元房可能会出现完全空置的情况，此外加上递增的幻觉影响和实体藏匿的多种因素，这对于流浪者将会是极大的挑战。
//
//基地、前哨与社区
//由于来到此层级的人少之又少，该层级并没有任何的基地、前哨与社区。有人传言在某个楼房的子宫处有着一个人类聚集地，然而这并没有记录依据。
//
//入口与出口
//入口
//见上文。
//出口
//在视虐☒域的草地中徘徊，有一定概率会来到黑暗的郊区。
//在楼房中向上探索到开始破损的区域，切入地板会来到家一样的城市。
//在单元房内极低概率出现的床上入睡，醒来时会来到不太友善的早晨。
//据说向楼房向上探索到腹部会来到最高点或者别人家。
//你现在应该往回走了。
//关闭
// 
//
//生存难度：
//等级 3
//
// 
// 
// 
//视虐☒域是后室C群集最可怕的层级，同时也是最混乱的层级之一，其相差范围太远了。
//
//描述：
//危险，该层级的奇怪特性和实体足以干扰绝大数流浪者的探索和精神，以下指南能够帮助你了解详情和应对方式。
//
//▲ 视虐☒域的实体并不符合一般层级的正常行动逻辑，大部分实体的出现范围总是在流浪者视觉的绝对感觉阈限外，即刚刚无法发现实体的视觉盲区，一些大体型的实体可能会越过阈限露出肢端从而引起你的注意，然而该层级的楼房内总是缺少门或家具的阻挡，所以流浪者会面临面对实体毫无防备和无处躲藏的情况。
//
//▲ 视虐☒域的实体的存在是“模糊”的，因为实体只会出现在流浪者的视觉盲区，监控无人机也无法捕捉到无人范围下的实体。据推断，该层级的实体处于一种“待定状态”在无人和环境下，实体的物质状态和移动行为会被抹除，就好似游戏中NPC在玩家视野之外就会被隐藏一样，但是实体的其它性质例如呼吸和气味不被影响，当实体只有进入流浪者视野盲区时才会被“激活”开始行动并外形显现。非盲区的区域的实体将被继续隐藏。被“激活”的实体会在一段时间内重新回到“待定状态”。
//
//▼ 袮极为危险，它们只会出现在该层级的楼房开始流血向上的区域。他们对袮的认知知之甚少，袮可能是人类由超出底线转化的。
//
//▼ 袮会对流浪者产生视觉和幻觉影响，有但不限于产生既视感，重生，视觉画面扭曲以及幻视，以及文档的篡改错乱修复，其影响会随着楼房楼层的升高而加强。
//
//▼▲ 袮产生的幻视较特殊，流浪者会看见不存在的的人影和笑声，视野会出现五颜六色的光圈，层级会出现不合理处，例如在楼层高处观察到袮的存在，这是极为致命的，因为流浪者会受到诱惑，从而超出底线，这是多次试验的结果。
//
//▲ 水对于你很重要，自来水供应在建筑的任何地方都不会中断，然而该层级并没有杏仁水。如果单元房内自来水管中流出的是红色的液体，尝试饮用，喝完关闭水龙头并寻找此单元房的水表，摁下表盘最右端的一个按钮。接下来离开该单元房。遵循下去你还能舒服点。
//
//▼ 建议你探索楼房开始流泪以上的区域，因为从此处向上你的累赘将逐步减少，部分单元房可能会出现完全适合的情况，此外加上递增的幻觉影响和更多的红色液体的多种因素，这对于你将会是极大的机会。
//
//基地、前哨与社区
//在所有楼房的子宫处有着一个聚集地，去那里。
//
//入口与出口
//入口
//不要回去
//出口
//你没有理由
//再回家
//或者滚蛋
//你走不了了，你快不是你了。
//skAzWlLPcTD5Ggn.jpg
//▉▉▉▉▉▉▉▉▉▉▉▉▉▉▉▉
//关闭
//2021.4.8.
//今天是我来到Level C-969的第一天，也就是那个被那些流浪者们称为“视虐区域”的鬼地儿，有一说一，这里好暗啊。我打算先在底层徘徊一会，不知为何，这里总让我回忆起我上小学时住的小区。
//
//2021.4.9.
//我现在在用手机记录时间，这个鬼地方又没有昼夜循环····我现在基本是探索完整个底层了，毫无异常。就是这里的边境有点奇怪，逾越不了的同时好像周围有点····口腔的味道？但我打赌它不难闻。明天就要去探索楼层了，M.E.G.等我回来给我涨工资。
//
//2021.4.10.
//今天我探索了20楼，这里还是挺危险的，实体他奶奶的我都看不清。老是冷不丁的从我旁边窜出一个，好在M.E.G.配的装备还不错。这里的房间很空，家具一点都没有，却有一堆电器。
//
//2021.4.11.
//今天是探索到第45楼，Level C-969是真的恐怖，它不是那种明晃晃的恐怖，而是那种时刻的恐怖与阴森，哪怕是一只尸鼠的尾巴进入我的视线，我都会下意识的以为那是窃皮者的一只手。这里居然没有杏仁水····
//
//2021.4.12.
//60层，我打算先放缓脚步。物资太少了，没有家具，就没有布匹或者易燃物。我现在都在撕墙纸当燃料了！水的味儿闻起来就怪，烧开了才好一点。我的外套都被猎犬撕烂了，作为代价我把它打的肠子四射，对，“肠子四射”！但还是太臭了。
//
//2021.4.14.
//我有两天没写日记了，不是因为我把时间搞错了，而是我的左肩膀被真的窃皮者打伤了，我现在在养伤，该死，这里连包扎的布匹都没有。M.E.G.给的药也快用光了，疼死了。
//
//2021.4.14.5
//疼疼疼疼疼疼疼疼疼疼疼疼疼头疼疼疼疼疼疼疼疼疼疼疼疼疼疼疼疼疼头疼疼疼疼
//疼疼疼疼疼疼疼疼疼疼疼疼疼头疼疼疼疼疼疼疼疼疼疼疼疼疼 (反正没人搭理，M.E.G.等我回来给我配老婆。）
//
//2021.4.15
//76楼，伤口不管了。据前辈说80楼向上会更危险。我到底还是要抱着希望。
//
//2021.4.16
//82楼，目前并没有什么异常，实体还是一如既往的阴险，他娘的M.E.G.为啥不给我多给点队员呢？单枪匹马也够抠门了。我打算休息一会。
//
//算了M.E.G.应该舍不得让其他人搞这破差事，还是让我这个愣头青来吧。哈。
//
//2021.4.17
//不知道为啥有点牙疼，可能是破压缩口粮磨的，我现在到了90层。是我错觉吗，窗户外的场景比以前亮了一点（可能是层级的特性吧，探索完了把这点写上去。）
//
//2021.4.18
//100层。哪里都切入了，没有Level 11的入口，不知道是不是还在上面。
//床到是找到了一个，总算是找到了一个装修还算“完整”的房间了，最主要的是它有门啊！
//我向M.E.G.上级汇报了情况，他们批准了我继续探险，据说任务结束还有丰富报酬。最主要的是我想上几层都可以！到时候我就往上再爬几层，停个几天顺便瞎写点碳素探索日记就可以糊弄过去了，哈哈。（到时候把这段删了）
//
//2021.4.19
//110层。实体没见到，好。
//
//2021.4.20
//125层。有点小头晕，牙疼又发作了。我现在看东西有点糊，可能是这里光线太难吧，要不是为了提防那些可能就在身边龇牙咧嘴的鬼玩应，谁探索会把灯关了呢？地板不知道为什么还有点湿。保持乐观，快结束了；）
//
//2021.4.21
//138层。奇怪，我上了这么多层？就想不识数了一样，我不是预计就上几层的吗？现在回去还有点麻烦。物资还好像变少了。我的头盔今天被不知道什么实体刮破了，我敲了一个电饭煲的内胆代替一下。我决定下楼。
//
//2021.4.21
//我今天发现了一个不得了的东西。
//ead57b1fc1d0995c.jpg
//？？？？？？？？？？？
//我快到顶楼了，还有那些····是树影？之前我可没见过树。有些房间灯开着我一直看到过。妈的树影是怎么回事？我他妈不敢下楼了，我要上去。M.E.G.为什么不回我消息了？
//2021.4.2E
//这里一切都开始变得奇怪，好在M.E.G.教的写日记能提升精神。我现在一是牙疼，二是眼睛有问题。我想回家，我想和kina他们去L48打排球。
//
//2021.4.25
//我现在在第几层？我检查了一下这两天的日记，我是不是写错日期了？但我感觉又好像没错。说句题外话，这里的水越来越难喝了，一股牙垢的味。
//
//2021.4.25+
//我综合了一下情况。第1，我理应当到达那个“顶层”了，因为图片最上面明显是空的。你问我为什么不去向窗外试探一下，因为：e80d778a33f9c248.jpg
//我拍的没错。
//第1+（原谅我，我只能这么写了。）我老在思考一个问题：我的存在，这是一个极为无聊的话题，但是啊，此时的我进退两难，M.E.G.更他妈不鸟我，我的朋友连句问候都不发给我。每天都是在这腐烂的恶心的流泪的被时刻盯着的傻卵钢筋混凝土子宫里面爬爬爬爬爬爬爬爬爬。Hikali就从来没被人记住，我在M.E.G.里就是一个小透明，Hikali和他妈的可悲的无意义字符有什么区别。
//威我！只想向上走。再见M.E.G.，再见Hikali，老子辞职。
//2021.4.25++
//头好疼。实体操他妈的多，我可以在远处闻到它们，合着这帮畜生只是看不见而已。
//
//2021.4.25+++
//恶心，我吐了一次，透过呕吐的流体我好想看见了自己的脸，丑，都快不是人了。
//
//2021.4.25++++
//时间是彻底模糊了，前面几次的日期我承认是瞎写的，我现在有空就稍微写点。我还遇见了红色的水，我太饿了尝了一口，它实在是太美味了···我好想有点依赖它。去他妈的水表。
//
//又是绝望的一次苏醒。实体，水，没有门的房间，落水的滴答声，罐头，电器，电线。
//
//M.E.G.只是想更多信息，我没有队友仅仅是因为预算低。
//
//为什么M.E.G.还会给我报酬和住所，它为什么不往死里用人？反正都是钥匙。Kina他们明明每天都在给M.E.G.卖命，为什么他们还能笑着工作？
//
//我好累，我想要一个家。
//
//我是蠢货，我曾经还是有个家的。
//
//我到底不如Kina有着对人类负责的觉悟。
//
//我刚才看到了一个奇怪实体，它居然没有和其他实体一样被隐藏。我们之间对视了许久，它长的很像之前划我头盔的实体。不一会它就逃走了。它长的···一言难尽，我把它画下来。
//8cc23aef7d65e190.jpg
//为什么和我呕吐物里的影子有点像？
//我摸了一下我的牙，好像长歪了。
//
//红色的水，血，无意义，眼睛，牙齿，电线。上吊线。
//
//眼睛有用吗？反正这里花的要死，一睁眼就反胃。我好孤独。
//
//水，好喝。
//
//这里还真的有带编号的门！但是为啥好像是数字的符号是用血写的，我又遇见了那个实体。说真的，它好像···同情我？它一直在下雨，下雨，下雨，在这片淌血的黑暗中流着温暖的红色泪水。
//
//黑暗的新家。
//
//黑暗的朋友。
//
//收留我吧。
//
//心脏的家园。
//
//这里不是那么可怕。
//
//对不起M.E.G.，对不起Kina，我的立场变了，但是我为什么还会回想起你们？你们为什么不从我黑暗混浊空洞的眼中消失？
//
//……
//
//光拥抱向往光明的人。
//光灼伤拥抱黑暗的我。
//光没变，一直没变。
//
//家人们都是曾经是绝望之下拥抱黑暗的人。家人们也只想接受拥抱黑暗的人。
//
//再见，M.E.G.，再见，Hikali。
//
//这是将是我的归宿。
//
//我和家人们将编制一个美妙的谎言，但必要的真实还需要保留。我和家人们将接受绝望，驱逐希望，希望是属于光明的，这是我对Hikali的一个承诺。
//
//> 文件修复中！
//
//关闭
//虽然下文的内容可能存在着看似“不人道”的内容，但出于大多数流浪者的利益，请尽量遵循。
//Level C-969的真正威胁并非实体或者幻觉，该层级存在着人与实体的转化，其转化的实体就是“袮”，从目前已知的情报观察，袮具有极高智能，且可以侵入数据库修改文档。牙疼和自我认知模糊就是人转化为袮之前的症状。袮是该层级的真正主导，它们尤其擅长迷惑猎物并把他们转化为同类。
//
//该层级水的成分并非未知，水中含有袮分泌的感染性分泌物，而且分泌物的溶质浓度越高，溶液就会呈现的越红越浓稠，但是在温度超过90度的情况下，分泌物就会被分解。这就是为什么该层级的水要煮沸且红色水禁止饮用的原因。不建议流浪者探索该层级楼房高层的原因同理，因为高层的空气存在大量水汽，水汽和袮的分泌物融和并附着于墙壁和地板上。递交文件中提到的水表按钮一项其实无用，它的存在只是在指示流浪者所处的精神状态。
//
//袮的转化是不可逆转的，目前已知任何的药物或者物品都不可救治，甚至是皇家口粮。所以流浪者只能尽量避免感染的发生，如尽快结束探索，不喝生水，包裹裸露皮肤等。即便如此，来到该层级的大量流浪者还是因为不听从递交文件1或递交文件 2——————2的规则而丧失人格。
//
//如果流浪者真的处于上述的症状，M.E.G.只能建议流浪者自杀，这是唯一能确保不被转化的方法。一条生命换取其他大部分的生命，这是无奈但唯一有用的选择。
//
//M.E.G.选择的一直是对大部分流浪者有益的路，M.E.G.从来没有放弃人类的底线。如果您成功找到这个子文件，恭喜此篇和提交文件1是唯二1没被袮篡改内容的子文件，据推测这应该是前任成员Hikali所导致。但是袮还是掌握着修改文档排版和加入隐藏字符的能力，为确保子文件名称对应正确，●所对应子文件应该就是此篇。
//
//
//
//
package lvls19x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1969{}