//Level C-990
//评分: 
//+20
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//Level C-990是后室C层群的第990层。由一名无名流浪者于2021年9月9日发现。
//
//描述
//photo-1568641459566-dade898a25ac?ixlib=rb-1.2.1&dl=orkhan-farmanli-NdJmkwRyC7M-unsplash.jpg&q=80&fmt=jpg&crop=entropy&cs=tinysrgb
//Level C-990内的车站。
//
//Level C-990从整体上表现为一间坐落在山间的小型车站，该层级虽内虽拥有着正常的日夜循环，但其天气常处处于多云状态，并时常伴随着小雨。流浪者不会在此层内遇见其他流浪者。车站内的设施仅有一顶破损的遮阳棚，两张长凳和一台只销售杏仁水与罐装龙肉的售货机。除此之外站台内并无其他的设施，流浪者可以在长凳或售货机下找到一些破损的纸币或铜币，可以此去购买售货机内的商品。商品会不断刷新，频率大约为每1小时刷新一次。
//
//车站周围被繁密的森林所包裹着，即使流浪者通过无人机也无法完全观察该层级的整体地貌，除此之外，无人机将会在飞至100米搞空时突然失去信号并直接坠落，具体原因未知。如果流浪者想要深入森林，将会被站长所阻止，M.E.G.曾收到有流浪者于树林内目击到了悲尸，死亡飞蛾，钝人，肢团等实体出没的报告，这些实体不会主动靠近车站方圆100米内的范围，当有流浪者遭遇到了实体的袭击时，站长将会立即现身并保护流浪者离开。这些实体不会主动攻击站长，并表现出了畏怕心理。它们会在流浪者回到车站后离开，并消失于森林中。
//
//乘坐经过该车站的列车是离开此层级唯一的方法，这些列车的类型通常为蒸汽火车，其车身布满锈迹，驶过车站时会发出刺耳的金属摩擦声，并会在到达站台后长鸣30秒。此时流浪者可以选择搭上列车，这些列车通常会将流浪者送往Level C-275，Level C-476，Level C-498等层级。列车停留的时间大约为3分钟。且每趟列车来临的时间是不固定的，最短仅为3分钟，最长为3个月。值得一提的是，该层级内偶尔会驶入多种样貌不一的列车，搭乘它们将会被送至不同层级。
//
//除此之外，猎犬被流浪者多次目击于站台上，它们通常会在夜间出现，这些猎犬受Level 11效应影响，且外貌更接近于前厅内的正常犬类，品种为中华田园犬。流浪者可以选择投喂它们罐装龙肉等食物，在投喂过后这些猎犬将会短暂陪伴流浪者半个小时。在这期间流浪者可以选择与它们玩耍。时间到后这些猎犬将会远离流浪者，并向森林中远去。此时它们不会再对流浪者的行为做出任何反应。并不会再在此层级内出现。
//
//站长
//站长是本层内的特殊实体，其是一名中国籍老年男性，“和蔼”是他给流浪者留下的初步印象。他身穿墨绿色制服，满头白发。年龄大致为80岁。身前经常别着几枚徽章。并在胸前挂着一块破旧的怀表，怀表的表盘早已破裂。
//
//大多数时间下他会在铁路周围进行日常巡逻检查，这时他不会与流浪者进行任何的互动与交谈，在巡逻过后，其会进入休息时间。此时流浪者可以选择与站长进行攀谈，除此之外，他也会在流浪者误入森林或有做出跳下铁轨的举动时出现，并对流浪者进行劝说与说教。
//
//从极少次的流浪者与“站长”的交流中，可以得知他早在40年前就在此担任站长，且精通英语，俄语，越南语三种语言，并受过中等教育，在年轻时经历过多次战役。除此之外流浪者无法从他口中获取跟多关于他的信息。交谈之后，站长将会返回他的站务室或继续开始巡逻。
//
//基地、前哨与社区
//车站管理委员会
//成员均为无面灵，大约有3人，身穿墨绿色制服。
//具体地点未知。
//偶尔会向流浪者提供帮助，但不会与流浪者进行任何的交谈。
//入口与出口
//入口
//目前已知进入方法的为在Level C-289中找到一条小路，沿着其走过去即可到来该层级。
//出口
//乘坐一辆残破的列车会将你带往Level C-275，Level C-476，Level C-498等。
//乘坐一辆车身涂着“欢迎来到健康之城”的列车即可来到Level C-117。
//乘坐一辆全黑的列车将会把流浪者带往Level C-850，Level C-392。
//附录
//采访编号：0990
//采访者 ：无名志愿者
//被采访者： 站长
//
//志愿者：这位老先生，请问我可以采访您吗？
//
//站长低头看了看他的怀表。
//
//站长：看来巡逻时间已经过了啊……那可以，你可以问我一些问题。
//
//志愿者： 嗯嗯，那么我的采访就该开始了，请问您是这里的站长吗？
//
//站长：我该怎么回答你……从一定意义上来说我是这里的站长……时间过得真快啊……我已经在这里工作了差不多30，40年了。
//
//志愿者：那我可以问一些关于车站的问题嘛？
//
//站长：让我思考一下……
//
//站长沉默了许久……
//
//站长：我该从何说起……你想听听关于这个车站的故事吗？
//
//志愿者： 这会是我的荣幸。
//
//站长再次抬头，似乎在思索着什么。
//
//站长：好……那就从最开始说起，这个站台最早建于1940年，由于这里较为偏僻，周围全是茂密的树林，就在当时被用作于军队的粮食运输，并发生了许多场战役，大多都是敌人前来抢夺我们的粮食，他们虽然装备精良，但我们人多啊！把他们打了个落花流水！之后这里也发生了许多的阻击战，还曾多次被敌人占领，但我们在最后还是把这里给夺回来了！虽然有些简陋，但渐渐地这里便成为了军事运输要地，到那时我才被奉命前来管理这里。
//
//站长：后来，战事逐渐结束，这里也恢复了平静，成为了多个村庄的交通枢纽。我告诉你！那时这里可热闹了啦，站台上挤满了人，甚至还有鸡鸭猪羊等家畜，原本车站是禁止动物入内的，但毕竟村民都要去城市里贸易的嘛，规矩是死的人是活的，我就破例允许他们牵牛羊进来，虽然臭气冲天，但我还是尽力去打扫那些家畜排泄物，可幸苦啦，不过，为人民服务嘛！
//
//站长大笑了起来。
//
//站长：随着时代的发展，年轻人都去大城市里面工作打拼了，这里渐渐的就很少人来了，车站就逐渐冷清了下来。偶尔会有些人想要到这里轻生，我每次都尽力去把他们一个个的救回来，我也不责怪他们。每个人都很不容易，我能做的就是挽救他们的生命，并激励他们继续向前。对了，经常有些人为了找刺激去森林里面探险，那多危险啊，我们这生态坏境是很好的，说不定会有什么野生动物，大熊啊野猪啥的，到时候人受伤了就不好了，所以我就会叫他们不要进去里面玩，挺危险的！
//
//站长胸前的怀表发出了机械卡顿声。
//
//站长：啊，看来休息时间结束了啊，那么今天的采访就到此为止了吧，今天回忆了不少往事，哈哈，很久没有这么开心过了。
//
//采访结束
//
//
//
//
//采访编号：0990.1
//采访者 ：无名志愿者
//被采访者： 站长
//
//
//站长正坐在长凳上休息，旁边的开水壶还冒着热气。
//
//站长：啊，你又来了啊，正好我在休息，你想问些什么？
//
//志愿者：我可以问一些关于您的身世的问题吗。
//
//站长顿了一下，又沉思了起来。
//
//站长：当然没问题，只不过我年纪大啦，很多事都记不清了……没事！我想到什么就说什么！
//
//站长：那就从我的军队生涯开始说起吧！
//
//站长：我自幼就是一个孤儿，从小吃百家饭长大的，我大概是在13岁的时候参军入伍的，那时的我还只是一个小“娃娃兵”，连枪都扛不起，顶多帮其他人打打水，抗抗物资罢了，有时我们也会去做一些侦察任务，有一次我还发现了敌人在进行秘密运输，我当即就汇报给了队长，那对于我来说就是一项壮举啊！我得到了表彰，别提那时我有多高兴了。我特别好学，经常向那些比我大的同志们学习知识，我差不多什么都学，战术啊，招式啊。我特别的努力，进步的也很快。
//
//站长： 后来我到了18岁这样，那时国家局势特别的紧张，由于我的出色表现，我被招进了大部队里面，去和日寇们做抗争，我多次立下赫赫战功，我们的国家也在最终取得了伟大的胜利。
//
//站长停了下来，似乎在思索着什么。
//
//站长：可惜的是，我们有许多的同志都在抗战中牺牲了，他们许多都默默无闻，一生都没有留下自己的名字。以自己的身躯，为祖国搭建了桥梁，却倒在了战场上。他们很多都是16，17岁这样，要是他们能活到现在，也是儿孙满堂，安享晚年的年纪啊！
//
//说到这里，站长的眼角泛起了一丝泪花。
//
//站长：我后来还打过美国佬，和苏联人对过话……可惜的是，我已经忘却了太多了……
//
//站长胸前的怀表再次发出了机械卡顿声。
//
//站长：嗯……我又要开始我的日常巡逻了，哪天再继续聊吧！
//
//采访结束
//
//
//
//
//采访编号：0990.2
//采访者 ：无名志愿者
//被采访者： 站长
//
//站长正在打理售货机。
//
//站长：你又来了啊。
//
//志愿者： 请问我还能询问关于您的问题吗？
//
//站长：可以，这次，应该谈谈我的爱情了吧……
//
//站长：让我思考一下……
//
//站长沉默了许久……
//
//站长：想当初，我17岁时，医疗队里来了一个新的的小姑娘，大概也就16岁左右，她和我一样，也从小就是一个孤儿。她长什么样来着的……啊，我想起来了，两根粗粗的麻花辫，小小的嘴巴，精致的脸蛋，即使在尘土之下也显得素净。她常常在队里帮忙干农活，还要求自己做和男战友们一样的工作，她的热情就像七月的朝阳，永远不灭。渐渐地，我喜欢上了这个姑娘，她活泼的模样深深地烙印在了我的脑海中。
//
//站长： 然后…….我与她有什么交集来着的……
//
//站长抬头，思考了起来。
//
//站长：嗯…..想起来了。我当年经常去找她聊天，即使在这军队中是不被允许的。所以我只能在深夜悄悄地去找她。我们经常在草地上躺着，仰望着深邃的星空，谈谈生活中的不顺，聊聊生活中的趣事，就算现在想起来也是多么多么的美好。
//
//站长：再后来，战事吃紧，我和她都被调到了前线，但却被分配到了不同的师团。在离别前，我与她约定，在战争结束后，一定要在车站相见，并保佑彼此平安无事。而那个车站，就是这里啦！
//
//站长的声音突然变得迟钝起来，看起来正在努力思索着什么。
//
//站长：我不清楚，她是否在那场战争存活了下来，可能早已与我阴阳两隔了吧。可直到如今，我仍然记得我与她的约定，
//
//站长胸前的怀表发出了再次机械卡顿声。
//
//站长：……这次，我就再聊久点吧……
//
//站长：在战争结束后，我原本可以选择过高官富裕的生活，但我却选择向上级申请留在这个车站。
//
//站长：我已经在这个岗位上兢兢业业工作了40几年了。或许，我早已忘却了我来到这里的初衷，也忘记了停留在这的目的。有可能是对乡亲的热爱，有可能是为了坚守自己的岗位，也有可能是想与那个人相见。
//
//站长：无论如何，我还会继续选择在此继续停留。即使我忘记了许多，即使我终将死去，但我还会凭借我骨子里的那股劲，留在这世间。
//
//站长的怀表再次响了起来，但不同于前几次，这次的响铃清脆无比，似乎充满了新的活力。
//
//站长：老骥伏枥，志在千里！哈哈，应该是这么形容的吧！年轻人，今天就聊到这里吧，我该回去休息了，而且，你的车也到了哦。
//
//志愿者的身后驶来了一辆列车，其看起来崭新无比，一改往常腐朽之态，并发出了洪亮的长鸣声。
//
//站长：我们有缘再会吧！
//
//站长走远，此时他的背影在落日下散发着无限的光芒。
//
//采访结束
//
package lvls19x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1990{}