//Level C-997
//
//
//生存难度：
//
//等级 4E-环境危害
//
//不安全、不稳定
//实体绝迹
//极端气候
//raindrops-3216609_960_720.jpg
//Level C-997的倾盆大雨。
//
//Level C-997是后室C层群的第997层。
//
//描述
//你的视线一片模糊。脚下的绿色在你踩踏时发出些许植物摩擦的声音，但呼啸的狂风遮蔽了你的耳朵。
//
//关于Level C-997的环境，我们知之甚少。由于该层级客观存在的环境危害，目前该层级已被勘探完毕的区域仅占预计层级总面积的25%，我们由这些已勘探区域的特征推测出Level C-997的大致环境为一座巨大的绿化公园，其内部除一些未知品种的树木和草坪以外似乎不存在任何实体。
//
//豆大的雨点如同机枪集火一般疯狂地打在你的脸上，在你脸上划开一道道水组成的伤痕。很快，这些伤痕覆盖了你的全身，狂风在此时显得尤为致命。
//
//Level C-997内部存在永不停歇的极端降雨（降水量约500mm/24小时）和风暴（风速约37m/s），会在顷刻间令没有做好准备就暴露于露天环境下的流浪者全身湿透。尽管这些雨水在成分上接近纯净水且不会直接危害流浪者，但该层级的低温和狂风使得被打湿的流浪者极易染上诸如发烧的各类疾病，间接导致其失去行动能力或死亡。
//
//你艰难地从已经开始滴水的背包中抽出雨伞，但在打开的一瞬间，它就离你远去。你仅能独自砥砺前行，在这片永无止息的暴雨中孤身前行。
//
//雨伞在此无法发挥作用，在雨伞打开时暴风会立刻令其脱离流浪者掌控甚至连带流浪者一起吹飞并造成损伤，因此，建议在探索时携带雨披等不易受到暴风影响的避雨装备。因为上述因素，Level C-997存在积水，但积水的平均高度一直保持在30mm，目前尚不知为何积水量不会继续上涨。
//
//作为暴雨那同由水组成的朋党，水雾恶意地蒙上了你的眼睛与口鼻。漫无目标的前行令人绝望，但这份绝望远不及你感到的呼吸困难来的致命。
//
//Level C-997中同样存在浓厚的水雾1，使流浪者的能见度进一步降低到只能看清4米以内的事物。长时间在该层级的水雾中呼吸会逐渐感到窒息，但不会危急流浪者性命。流浪者形容在水雾中长时间呼吸的感觉“像是在水中呼吸一样难受”。
//
//恍惚间，你看到了一栋屋子。你的本能驱使着你往那里赶，但在这串联起来的地狱中积累起来的血训强迫你转了过去，继续走着，向你的终点走着。
//
//在Level C-997中发现了屈指可数的人造建筑，这些建筑的外观由蓝色预制板或钢筋混凝土建造，这些建筑物的高度一般不高于4米，面积在70平方米左右。同一建筑物所带有的窗户不超过两扇，但所有窗户都由木板封死了。名为窗户的实体并不会附在这些窗户上。建筑物的内部环境及进入其中会导致什么后果都是未知的，因为目前没有流浪者提交关于建筑物内部的报告。
//
//窒息感逼迫你大口呼吸起来。雨点冲入你的口中，但你并没有感觉到习惯了的那种甜味。这种没有味道的味道，似乎在哪见过。
//
//然而，你的意识，已经模糊到没法在乎这些了。
//
//在极度危险的同时，该层级的淡水资源也是全后室绝无仅有的。该层级的雨水收集后即刻可以饮用而无需过滤和消毒。
//
//你本能地期望有人来救你。
//
//但是谁也没有来。
//
//不知为何，后室地铁似乎无法进入该层级。尝试由后室地铁进入该层级时后室地铁不会做任何反应，直到流浪者更改目的地至其他层级。与之对应的，后室地铁也从来没有来到过Level C-997。
//
//基地、前哨站与社区
//你想起了你在Level 48认识的朋友们……这里会不会也有人呢？你不知道……
//
//该层级尚没有任何已知的基地、前哨站与社区。
//
//入口与出口
//入口
//你想不起来你是怎么来到这里的……
//
//在Level 48………………
//
//出口
//不如说……你已经感觉不到，也想不到什么了……
//
//
//
//
//
//
//
//
//你的意识如同那破伞一样……抛下了你……
//
//
//
//
//
//
//离你远去………
//
//
//
//
//
//
//
//
//
//
//消逝在……风雨中………
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//……你仿佛看到了什么。
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//你看到了那片熟悉的海岸。
//你看到了那轮宜人的太阳。
//
//你看到了那些熟悉的人们。
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//你走了过去。
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//在露天环境中长时间行走后，流浪者面前会浮现Level 48的景象，此时向前走数步即可进入Level 48。
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//你透过泪光看着赤红而温暖的晨曦，阳光抚平了暴风骤雨所刻下的创伤。
//sunset-1755732_960_720.jpg
//雨过天晴。
//评分: +61+–X
//
//纵是那狂岚暴雨……
//Footnotes
//1. 对这种雾状物体的取样分析表明，H2O（水）占其中的92%以上，因此称之为水雾。
package lvls19x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1997{}