//Level C-514
//评分: 
//+24
//+
//–
//X
// 
//
//生存难度：
//
//等级 1
//
//安全
//不稳定
//少量实体
//Level C-514是后室C层群的第514层。
//
//描述
//Level C-514表现为以一座相对高度约700米左右的山丘为中心向四周延伸的大片低矮建筑群。虽说它看起来无限延伸，但当流浪者不断朝山丘的反方向前行达到一定距离（约为数千米）后，无论他们再怎么行进，山丘和他们的距离也不会再拉长，到这里通常就被认为是层级的边界。层级内不存在昼夜更替，大部分区域始终保持着雨天，雨的大小与这一位置离中央山丘的距离相关，越靠近山丘则雨越小。从远处可以看到仅有山丘所处位置的天空未被乌云覆盖，且有阳光照下。即使是在层级的边缘处，雨也不会太大，但即便如此，伞或雨衣等道具仍然是必要的，因为层级内的气温仅维持在15℃左右，淋雨可能会导致流浪者着凉患病。但许多流浪者仍钟意于丢下雨具在雨中漫步。
//
//Level C-514的空间性质类似于Level C-7，建筑群带有部分中国南方农村的特点，其具体布局则因人而异。层级内的窗户通常是无害的，但包括窗户在内任何建筑无法被以任何形式破坏。层级内出现的所有文字，上面的文字在不仔细观察时会被辨认为中文，但如果仔细看的话会发现上面的文字无法辨认。流浪者在探索中偶尔会在不远处的角落，如巷口，窗户后等地方看到疑似笑魇的存在，但当流浪者走近后会发现那里空无一物。
//
//在流浪者的描述中，部分区域在视觉上会让他们产生朦胧的怀旧感，就好像他们自己曾来过这里一样。进一步地，流浪者还会产生同样朦胧的空落感。
//
//隐藏
//看到那段巷子的拐角处时，我突然感觉这里很怀念，令人安心。就像是我儿时曾和谁在这里玩耍，创造了很多回忆，但现在只剩我一个人默默地看着物是人非的冷清的故地的感觉。
//
//我曾经来过这里吗？曾经和谁在这里有过什么回忆吗？
//
//明明这是不可能的事，但是为什么呢，感觉有些寂寞。
//
//
//这些心理效应本身是无害的，但流浪者受其影响做出的行为可能并不安全。
//层级内存在少量的无面灵。他们只会自顾自地做自己的事，不会对流浪者的任何行为做出反馈。但流浪者会对他们有强烈的类似家人的亲切感，若流浪者有对已逝亲人的悲伤回忆，他们甚至有可能遭遇和他们已逝亲人外形相同的无面灵，被无视这件事通常会深重地打击到流浪者。如果流浪者想尝试与无面灵交流，剧烈的疼痛会席卷他们的大脑并阻止他们开口说话，直到流浪者放弃为止。
//
//隐藏
//看到了本不应出现在这里的景象，我不禁揉了揉眼睛。
//
//坐在树下的那个无面灵，她长得好像……不，即使没有脸我依然认得出来……但是为什么，为什么我的妹妹会出现在这里……
//
//她坐在长椅上摇晃着双腿，就像从前我陪她度过的那些雨天一样，她用小小的手心捧着淅淅沥沥的雨水。手上的伞因惊愕而脱落，雨水混着泪水湿润了我的眼睛。
//
//现在走过去恐怕只会遭遇危险。
//
//即使残余的理性这么提醒着我，我仍然像是不受控制一般地向前，向着她的方向走去。我只想再一次好好地看看她。
//
//但是她并没有任何反应，就好像我这个人不存在一样。无论是轻拍她的肩膀，还是伸出手在她面前摇晃，她只是自顾自地坐在那里。不死心的我尝试呼唤她的名字。
//
//「——」
//
//话未出口，突然袭来的剧烈头痛就使我被迫跪倒在地，我勉强动了动嘴巴，惊恐地发现自己已经痛到发不出声音了。我抬起头看着她，她从长椅上跳下来，走向雨中。
//
//我拼命伸出手，同时努力尝试喊出她的名字。但越努力，疼痛似乎就越强烈，在几乎失去意识的那一瞬间，她那张天真的笑脸又一次浮现在我的脑海中。
//
//我感到了足以击垮精神的无力感，就像她离开我的那一天一样。当我再站起来时，四周早已空无一人。
//
//Z
//雨停后的Level C-514的照片
//
//流浪者一旦进入Level C-514，便会感觉到一种心理暗示。这会暗示流浪者让他们向着中间的山丘走。尽管这种暗示轻微到可被忽略，但因本层级的安全出口就在中央的山丘，还是建议流浪者跟从暗示。当流浪者到达山脚下时，也意味着他们到达了层级内唯一没有被乌云遮盖的区域，温暖的阳光将照在流浪者身上，而流浪者的情感会转变为积极的释然感。此时全层级的雨都会停止，并且其他区域也可能部分放晴。之后层级内无法再找到任何实体。
//
//隐藏
//放晴了啊……
//
//我将手伸向天空，看着光线透过我的指缝照下来。
//
//我该走了。
//
//基地、前哨与社区
//在Level C-514建立基地到目前为止被证明是不可能的。进入层级内的流浪者彼此并不处于同一空间。
//
//入口与出口
//入口
//在Level C-991向上仰望天空超过五分钟，流浪者会发现自己已身处Level C-514
//在Level C-7撑起一把黑色的伞会使流浪者出现在Level C-514
//出口
//攀登山丘可能到达Level 797。若流浪者感受到自己已饥饿疲劳，则还有很小可能到达Level C-799
//在前文所述心理效应影响下的流浪者如果进入建筑物内有可能通过窗户或床切出至Level 200
package lvls15x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1514{}