//
//建立帐号 或 登入
//The Backrooms吧
//Backrooms Fandom Wiki
//The Backrooms中文wiki官方哔哩哔哩公众号
//Discord
//主页
//
//中文沙盒站
//
//图书馆
//
//层级
//|
//实体
//|
//物品
//|
//团体
//
//故事
//|
//相关人士
//|
//现象
//|
//设定
//
//搞笑文章
//|
//国际翻译中心
//
//原创图书馆
//
//原创层级
//|
//原创实体
//
//原创物品
//|
//原创故事
//
//原创团体
//|
//原创相关人士
//
//原创设定
//|
//原创搞笑文章
//
//原创艺术作品
//|
//原创现象
//
//网站
//
//最近创建的页面
//
//最近的更新
//|
//最近的编辑
//
//随机层级
//|
//随机原创层级
//
//随机实体
//|
//随机原创实体
//
//旧页面中心
//
//本月最高评分页面
//
//历史最高评分页面
//
//最低评分的页面
//
//社群
//
//讨论区
//
//翻译预定
//|
//最近的帖子
//
//作者页
//|
//中文网站作者页
//
//加入网站
//
//管理专用
//
//后台管理
//
//职员站点
//
//所有页面
//
//会员一览
//
//侧栏
//|
//顶栏
//|
//主题版式
//
//
//
//　
//
//Level C-505
//评分: 
//+14
//+
//–
//X
// 
//
//生存难度：
//等级 5e - 环境
//
//不安全
//稳定
//无有害实体
//Level C-505是后室C层群的第505层，拥有一定量资源但存在致命危险。
//
//描述
//Level C-505主体为一巨大水域，水温常年保持在80-90℃，这导致了本层级的平均气温极高（40-50℃），同时空气中水汽含量也极高，沸腾的水体与大量水雾大大增加了该层级的探索难度，因此该层级是否存在边界至今未知。没有妥善防护的流浪者很可能会死于严重中暑的并发症或肺积水。
//
//层级内的水体上有时会出现一些来源不明的大型有机物团块，平均大小为10m3左右，外观上类似巨大的乳白色肉块且可以食用1。有识血肉常依托其在层级内移动，流浪者也可以将它作为口粮。
//
//流浪者来到该层级时会出现在直立于水中的骨质物上（以下称为“大骨”），它们遍布于该层级且高度不一。目前已知最高的“大骨”（高约137米）已被有识血肉占据，它们在试图将其用于其产品制造。
//
//有时，该层级的水会突然沸腾，导致水突然溅起形成水柱，这种水柱的平均高度在40-50米且平均温度均超过100℃。此时位于高度低于50米的“大骨”的流浪者相当危险，建议立即撤离。
//
//由于高温，本层级中的水可以在冷却后直接饮用，但是其中有一定量的氯化钠、谷氨酸钠（味精主要成分）等杂质，长期饮用可能会导致脱水。
//
//Level C-505的平均水深为8米，对于其底部的勘察表明其同样由大量未知生物骨骼组成，有识血肉正在对其进行打捞工作并调查其DNA。由于其底部资源贫瘠，故强烈不建议流浪者冒着被烫伤的风险下水。
//
//实体
//有识血肉通过生化改造以及特制耐高温岩包粉肠在本层级建立了数个小型巢穴，并积极开发该层级的骨质资源，流浪者也可以寻求其援助。
//
//值得一提的是，虫群曾经尝试在本层级建立基地，但最终因为高温以及后室厨师联盟的干涉导致失败。2
//
//基地、前哨与社区
//后室厨师联盟"鲜汤俱乐部"
//该组织在C层群建立的俱乐部之一。
//长期在此驻扎并研究优质创意菜品。
//乐于向流浪者分享烹饪技巧。
//躯
//最早来到该层级的组织之一。
//多居住于有识血肉巢穴中。
//帮助有识血肉开采资源。
//后室旅游集团
//该组织为了将该层级作为旅游景点而设的基地。
//共有20余名成员，均为实体。
//由于其成员损失过大，现已废弃。
//入口与出口
//入口
//在Level C-273中将水或杏仁水加热至40℃以上并饮用会来到该层级。
//在Level C-317中购买一个任意规格的铁锅或不锈钢锅并切入。
//在Level C-355发现并触碰温度高于80℃的瀑布内的液体。
//出口
//向水中丢入披萨可以来到Level C-260,或Level C-245。
//有识血肉开辟了通向Level C-309的通道，可以在征得对方同意的情况下进入。
//在该层级的水中加入蔗糖粉末并在冷却后饮用可能会来到蔗糖秘境。
//作者信息
//Footnotes
//1. 品尝过的流浪者均表示，其口感类似鲜嫩的前厅猪肉
//2. 由于这些虫子们带来了恶心的苔藓，严重污染了肉质与汤质，我们必须予以驱逐
//—— "鲜汤俱乐部"事后发表的声明
package lvls15x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1505{}