//Level C-509
//评分: 
//+11
//+
//–
//X
// 
//
//生存难度：
//等级 2
//
//安全
//稳定
//中量实体
//Level C-509是后室C层群的第509层。
//
//描述
//Level C-509是一片海洋，一艘游轮漂浮在海上。该层级有白昼黑夜之分。Level C-509并没有任何光源，但亮度仍然与前厅无异。
//
//cruise-ship-788369_1280.jpg
//摄于该层级的海上，拍摄者未知。
//
//游轮
//游轮位于Level C-509海的中央。初步推测，游轮长约540米，宽约68米，吃水线以上高约66米，排水量可达到27万吨。游轮上聚集着中量无面灵，与平常不同的是，出现在该层级的无面灵表现得极为友好。游轮大部分房间内拥有稳定的Wi-Fi来源且储有相当的糖果，杏仁水以及其他食物。游轮似乎一直向南移动。
//
//ship-593947_1280.jpg
//甲板风光。
//
//海
//海是Level C-509的主体部分。当流浪者跳入海中时，会立即向下沉。海水可饮用，但饮用后身体会出现痉挛。有报告称海里会出现歌鲸，这一说法尚未得到证实。海上偶尔也会出现船民。
//
//昼夜
//Level C-509的昼夜交替极为异常。一轮昼夜约为小8时，其中白昼占3-5小时，而该层级的昼夜交替则是在一瞬间完成。
//
//Level C-509白昼的平均气温在25~27摄氏度，这是此层级最宜居的温度。此时，游轮上会陆续出现中量无面灵，而游轮房间的门锁也将会在这时打开。
//
//夜临之时，Level C-509将会处于一个寒冷的状态，这时的气温仅有-2摄氏度。大量窃皮者，笑魇，猎犬以及迷彩爬行者将会出现在游轮甲板上，它们嘶吼着冲向一切目所能及的流浪者，且比平常更具攻击性，如果不幸被抓住，流浪者会体验到最痛苦的死法。唯一的庇护所便是游轮内的房间。由于未知原因，实体不会攻击处于房间内的流浪者，但房间的门锁将会在黑夜全部关闭。当日出之时，实体会自行消失。
//
//当Level C-509处于黑夜时，任何进入该层级的方法都将失效。但该层级将变得极不稳定，任何速度过快的移动都将导致切出Level C-509。
//
//由于该层级的昼夜交替是在一瞬间完成，因此常有流浪者因来不及进入房间而死于实体堆。但该层级在昼夜交替前8分钟内气温会出现明显改变，流浪者可根据气温变化来判断何时昼夜交替，何时进入房间。
//
//“无面舞会”
//在Level C-509中，每隔5轮昼夜1将会在下一次黑夜时发生“无面舞会”。
//
//当Level C-509处于“无面舞会”状态时，游轮上会出现大量身着各式礼服的无面灵。其他实体在这时段则不会出现。舞会时Level C-509的气温将会与白昼时无异，游轮的甲板上也会出现巨量补给。“无面舞会”将在白昼到来之时结束。
//
//当“无面舞会”发生时，流浪者会听到一种超出人类认知的音乐，这种现象会使流浪者受到一定程度的精神污染，饮用杏仁水可缓解精神污染。但也有流浪者因这种现象而陷入第二阶段的悲剧的报告。
//
//“风暴”
//Level C-509在白昼时有可能会发生“风暴”。
//
//sea-4000264_1280.jpg
//风暴来临前。
//
//当“风暴”发生时，Level C-509的气温将骤降至-13摄氏度左右。海面将会产生巨大波浪，初步推测波浪高度在10至50米。海面会受到一股怪异引力的拉扯，这时跳入海面的流浪者将会被立即撕碎。但游轮本体似乎不受“风暴”的破坏。
//
//游轮在“风暴”中会大量生成无面灵，且无面灵将变得极具攻击性。但游轮内房间的门依然保持开启状态，流浪者可以躲入房间内——无论如何位于该层级的实体都不会攻击房间内的流浪者。
//
//“风暴”发生前的10分钟内游轮的所有房间都会出现大量补给且房间内温度将提升至33摄氏度。游轮在“风暴”发生前5分钟会响起警报，这时天空则会飘满乌云。
//
//“风暴”会持续3个小时，当“风暴”发生时永远为白昼，“风暴”结束后会在极短时间内进入黑夜。
//
//基地、前哨与社区
//“船员”
//一个由4人组成的社区。
//乐意帮助每一位流浪者。
//很少与流浪者交易。
//自称是游轮的船长及船员。
//M.E.G.前哨
//拥有2名常驻人员。
//为帮助流浪者前往Level 11而建立。
//会为流浪者提供一些物资以及保暖用品。
//入口和出口
//入口
//在Level 7向任意方向游去都有可能切入Level C-509。
//在Level C-51的海中窒息有可能会在Level C-509的游轮上醒来，但我们不建议这么做。
//出口
//进入游轮中门上写着“city”字样的房间可以来到Level 11。
//在黑夜时跳入海里可以来到Level C-10。
//在游轮的房间内部进入睡眠可能会来到Level 130。
//在“无面舞会”期间进入游轮内任意一扇门都有可能来到Level C-207。
//进入一个没有门的房间会来到Level 7.2的巨轮泰坦尼克号内部。
//作者
//« Level C-508 | Level C-509 | Level C-510 »
//
//Footnotes
//1. 以该层级的昼夜循环为标准。
package lvls15x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1509{}