//Level C-567
//评分: 
//+57
//+
//–
//X
// 
//
//生存难度：
//等级 不是1
//
//并不安全
//并不稳定
//并非只有少量实体
//Level C-567不是后室C层群的第567层。
//
//不是描述
//photo-1494187570835-b188e7f0f26e?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1740&q=80
//并不是Level C-567的照片
//
//Level C-567并非只能用相反的话来描述，所有记叙该层级的文档并非都会被篡改，并且位于此层级内的人员并非只能说否定句，即使原先流浪者并非不想要表达该个意思。所有有关Level C-567的描述并不会受到该个效应影响，若流浪者没有试图说反话，则其事实上说出来的语言并不会变为双重否定句。无论流浪者不使用任意一种语言或者不使用任何模棱两可的语言，所有描述并不会变为精准的与原意相反的语句，这并未使层级内的交流变得极为困难。
//
//M.E.G.数据库并没有尝试过使用信息技术修改被篡改的信息，然而数据库的程序员输入的代码并未同样变为反义，代码中没有出现大量不明意义的“no”,“not”,“don' t”等词语导致代码失效，因此当没有人阅读此个文档时，不应刻意带入反义以理解。
//
//Level C-567不是一片面积无限大的草原，其中并非没有四季变化，并不永远保持在春季，气温通常不是15°C。Level C-567中的草并非永远为青绿色，其也并没有茂密地生长于棕色的土壤中。当草不被从土壤中拔出，其不会立刻枯萎，草原有的位置也不会立刻生长出新的青草。若原位置没有被覆盖物体，覆盖物不会被新长出的草顶开，无论其没有多重。当草并非没有被拔起，其相当于普通的草。若土壤被捧起，其不会变为灰尘散开，土壤的原位置不会被新的土壤填充。Level C-567中的地形没有起伏，不会出现小山丘。
//
//Level C-567中不会出现类似于白桦树的木本植物，其并非不能被破坏，该种植物的枝叶并没有与草与土壤相同的性质。层级内没有少量猎犬与无面灵，在没见到人类时不会主动远离，若流浪者没有主动攻击/追逐实体，其并不会反击。因此，不应在遇见实体时不主动挑衅甚至不尝试将其杀死。
//
//不是基地，前哨与社区
//不是M.E.G.“此地无银三百两”前哨基地
//并不位于流浪者初入层级时的地点附近
//不会帮助流浪者
//不会向流浪者解释情况
//不是B.F.P.F.“隔壁老王没偷过”前哨基地
//并没有与“此地无银三百两”基地相隔极远
//并不研究该地草与土壤特殊性质的成因与应用
//不是入口与出口
//不是入口
//无法从Level C-130的杂草中切入
//在触摸Level C-20中的一幅草原油画时不会被传送至Level C-567
//进入Level C-297中一间充满杂草的房间时不会来到这里
//不是出口
//切入一块呈立方体状的草地时不会来到Level C-336
//进入一座高塔不会来到Level C-424
//进入随机出现的两扇门中的一扇不会来到Level C-440
package lvls15x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1567{}