//Level C-511
//评分: 
//+14
//+
//–
//X
// 
//
//生存难度：
//等级 宜居诱饵
//
//宜居环境
//无敌对实体
//触发式致命精神危害vWTIw4MNuOgsFCL.jpg
//摄于该层级公路，拍摄者推测已死亡。
//
//Level C-511是后室C层群的第511层。
//
//描述
//Level C-511是一片被前厅中国常见的水泥乡村公路分割的土地，层级内部似乎永远处于秋季下午，但无法观测到太阳。这条公路将层级分割为两个部分，一侧是种植有多种前厅旱作农作物、正处于收获期或接近收获期的田野，另一侧是广阔的草原和流过草原的河流。田野和草原通过已干涸的沟渠相通，沟渠上方是各种材质的小拱桥，连接着各段乡村公路。尚未发现公路的尽头，该层级可能在公路方向上无限延伸。
//
//尽管Level C-511的环境适宜流浪者长期生存乃至建立可持续的聚居地，但由于以下异常效应，很少有流浪者能够不在初次进入时死亡。正如这张被上传至数据库的照片所示，进入Level C-511的流浪者总是会到达照片中的地点，站在乡村公路上；此时，道路的尽头会出现照片中的小镇。看到远方城镇的流浪者会感受到“从内心深处喷涌而出的怀念和安心”，并被它吸引——根据对所有进入过该层级的流浪者的背景调查，和前厅联系越紧密、越着迷于回到前厅的流浪者，受到来自小镇的吸引越强。其中，无论他们的实际文化背景和生活经历如何，有过长期前厅生活经历的流浪者都会在第一时间把远方的城镇当成自己的故乡。注视它的时间越长，和前厅有过的联系越深，来自城镇的精神影响就越强。当这种精神影响强到一定程度时，受影响的流浪者会不由自主地迈步向前走去，试图到达那个小镇。
//
//从公路以外看，正在“前进”的流浪者此时在公路上原地踏步而不自知，直到死于饥渴或劳累。尽管小镇的影响仅持续很短的一段时间，但开始“前进”的流浪者无法停下，哪怕打断自己的腿也会被层级内部的力量强迫“迈步”，这会引发强烈的痛苦和恐惧。有人声称自己看到死去流浪者的尸体在公路上原地“前进”，暂无影像资料佐证。同时，无论前人在公路上留下多少痕迹，都会在下一个人进入Level C-511时从其眼中消失，但很多时候仍可闻到腐烂气味。目前，所有极度渴望回到前厅的流浪者在进入该层级并看到城镇后无一幸免。对于他们来说，这是一条永远走不到尽头的回家路——尽管那些人只是被困在Level C-511中，在这条有着故乡幻象的断头路上走向自己的死亡。值得注意的是，在该层级公路以外区域无法观测到这座城镇，原因不明。因此，Level C-511被文档的撰写者标记为宜居诱饵，即在一定条件下宜居但存在致命因素的层级。
//
//由于尚未确认准确的入口，对Level C-511的勘探受人手和设备条件限制，当前该层级的准确面积仍未知。层级内部散落着大量的活动板房，内部可能有农具、家具、少许陈旧的电器或干燥的粮食，但不会在被取走后刷新。所有活动板房内部均有良好的水电供应和稳定的Wi-Fi信号，这些Wi-Fi信号源在板房外无法连接。
//
//本层级不存在任何敌对实体，河中的鱼、其他水生生物以及草原上的植物和真菌均为前厅物种，均无毒且可食用。Level C-511内唯一一种实体是生活在草原上的无足鸟，它们在铁皮房中筑巢，但从未试图跨越公路。该层级存在另一种无害的异常效应：被收割过农作物的土地会自行长出品种完全相同的农作物，但这些植物不会遵守通常的生长规律，而是每半个月“刷新”成它们应有的生长进度，直至完全成熟。
//
//基地、前哨与社区
//除下述的团结村外，尚未寻找到更多流浪者社区。关于在Level C-511建立前哨的提案已提交。
//
//团结村
//幸存者在公路附近的田野侧自发形成的小型社区，围绕一座活动板房建设自己的房屋，以收割田野中的农作物为生。根据对这些人的背景调查和采访，团结村的流浪者大多出生在后室，少数来自前厅的流浪者则是在幼年时误入了后室，且几乎没有对前厅的记忆。他们试图提醒过进入者不要抬头看远方的城镇，但所有尝试均以失败告终。
//
//入口与出口
//入口
//进入Level C-511的方式仍不明确。通过对层级内部幸存者的采访以及已确认死于本层级人员的背景调查，所有人都是在怀念并渴望回到前厅时，或对自己久居的安全层级厌倦后进入了Level C-511。幸存者的进入方式包括切入水泥路面和打开汽车的门时昏迷。
//出口
//尝试蹲在田野里观察农作物的刷新过程会在刷新前一刻入睡，并在Level C-92醒来。
//不慎溺死在Level C-511的河流中，尸体会在大约三周后以难以辨认的形式出现在C层群层级的岸上；据统计，目前所有出现来自Level C-511尸体的层级均为具有开放水域的危险层级。
//目前有两个互相矛盾的传言：到达公路尽头的城镇可以回到前厅，以及在草原上生存一段时间可以回到前厅。这两个传言均无法验证。
package lvls15x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1511{}