//Level C-512
//评分: 
//+16
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//Level C-512是后室C层群的第512层，现已完全所属后室厨师联盟，会给予少部分的成员食材存储区域的出入许可，部分获得许可外来人员可以进入此层级，并在特定区域开放对外贸易。
//
//描述
//Level C-512是一片由类似冰的物质构成的大陆，但这些冰具有异常性质。Level C-512内的冰不会因时间产生任何融化，并暂无任何方法可以将其破坏，其散发的冷气存在对环境进行降温的现象，但人体不会受此影响，身体结构不会产生反应，并且只能感受到常温，但除人体外的所有物品都会受到正常的低温影响。
//
//Level C-512对物品产生的冷冻效果可以在离开此层级时迅速消失，使物品迅速解冻，但不同于正常的融化现象的是，融化过程中不会产生水，并且物品在融化后能够完全变成冷冻前的形态，无任何受寒痕迹，这也使得此层级内的环境可以对食物等需要冷冻的物品进行完美的冷藏效果。
//
//Level C-512内存在一个全为冰构造的山体，在流浪者刚刚进入此层级时，会出现在该山体前。山体高度目测约2000米，因其表面较为光滑，且没有明显的坡道，暂无方法登上山体顶部。
//
//有一条河流从山顶顶部延伸至山脚。该河流为本层级所有水源的源头，河流之中流淌的液体为碳酸与溶液。并且河水中还含有果葡糖浆、蔗糖甚至阿斯巴甜。这可能是河水的味道与高糖度的汽水极其相似的原因。此外可能由于本层级的特殊性质，在本层级内碳酸溶液呈现出高度稳定状态。
//
//支流：
//甘甜可乐池：由处于山体最顶部的支流汇集而成。池内的液体呈红褐色，味道与可乐极其近似。饮用这种液体可以带给流浪者愉悦与大量能量。
//汽水瀑布：位于山体西侧的瀑布，相较于其他支流，汽水瀑布的碳酸含量最高。口感也最为剧烈，但相对的汽水瀑布并没有甜味以外的味道。因此它成为了后室厨师联盟的碳酸水采集地。
//汤力汽水池：位于南侧山脚上的一个小型湖泊，内容物为近似于真正意义上的汤力汽水，和前厅中的汤力汽水的区别在于，池水中含有大量氰化物，目前已经被后室厨师联盟封锁。
//辣椒熔盐汽水喷泉：南部山腰处的一眼中型喷泉，其在山中时与普通汽水无异，但是在带离此位置后，它将产生极高的辣味，其温度也会如开水一样炙热，其原因未知。
//基地、前哨与社区
//后室厨师联盟 “后室冰箱” 管理部门
//约120名成员驻扎于此。
//大量食品冷冻储存于此。
//开放食品贸易。
//后室厨师联盟 “后室食堂”
//10名优秀厨师执业于此。
//对外供应各种菜品。
//有约200平方米的用餐区域。
//入口与出口
//入口
//在Level C-302深处的一个山洞内约100米处的地方切出，可以来到Level C-512，此山洞会一直出现在同一位置，其具体位置被后室厨师联盟所隐藏，暂不公开。
//出口
//从Level C-512中的山坡上滑下去，使自己最终撞击在任意物体上，可以使你来到Level C-302的居民社区，且不会受到任何伤害。
package lvls15x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1512{}