//
//建立帐号 或 登入
//The Backrooms吧
//Backrooms Fandom Wiki
//The Backrooms中文wiki官方哔哩哔哩公众号
//Discord
//主页
//
//中文沙盒站
//
//图书馆
//
//层级
//|
//实体
//|
//物品
//|
//团体
//
//故事
//|
//相关人士
//|
//现象
//|
//设定
//
//搞笑文章
//|
//国际翻译中心
//
//原创图书馆
//
//原创层级
//|
//原创实体
//
//原创物品
//|
//原创故事
//
//原创团体
//|
//原创相关人士
//
//原创设定
//|
//原创搞笑文章
//
//原创艺术作品
//|
//原创现象
//
//网站
//
//最近创建的页面
//
//最近的更新
//|
//最近的编辑
//
//随机层级
//|
//随机原创层级
//
//随机实体
//|
//随机原创实体
//
//旧页面中心
//
//本月最高评分页面
//
//历史最高评分页面
//
//最低评分的页面
//
//社群
//
//讨论区
//
//翻译预定
//|
//最近的帖子
//
//作者页
//|
//中文网站作者页
//
//加入网站
//
//管理专用
//
//后台管理
//
//职员站点
//
//所有页面
//
//会员一览
//
//侧栏
//|
//顶栏
//|
//主题版式
//
//
//
//　
//
//Level C-534
//评分: 
//+8
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
//安全？
// 
// 
//Level C-534是后室C层群的第534层。
//
//描述
//Level C-534是一个面积极大的非线性空间，类似前厅中潮湿晦暗的居民小区地下室。该层级整体上可分为楼梯间，曲廊和车库三部分。该层级暂无发现实体的记录，但Phenomenon C-16，即“如芒在背”的现象在此层级极易发生。
//
//他进来了，他是第一个涉足这里的人。
//
//
//他惊讶且困惑地看着前面黑暗的楼梯。只有这一条路可走。
//
//
//他试探地迈出了第一步，随后又是一步，戒备地顺楼梯下行着。
//
//%E6%A5%BC%E6%A2%AF%E9%97%B4.png
//楼梯间的一张照片。
//
//楼梯间
//楼梯间是一处窄小，曲折且阴暗的空间。楼梯总是通向下方的更深处。流浪者进入Level C-534后将会来到楼梯间的起点。
//
//楼梯间的墙壁包括天花板都严重受潮。墙皮经常鼓起并掉落，露出内部的水泥。有些地方甚至长出了苔藓。
//
//楼梯间的楼梯由水泥砌成且较为光滑，每级台阶的高度会有2-4cm的浮动，这会让流浪者在下楼梯时感到轻微的不舒适。在下行10-12级台阶后，楼梯间将会遇到拐角。一般经历4-6个拐角1后流浪者将会来到第二部分：曲廊，但也有极少数情况直接进入第三部分：车库。
//
//该处照明较为晦暗，但在靠近拐角的地方仍有较明亮的光照。
//
//楼梯实在是太滑了，他一直扒着栏杆才不至于摔倒。
//
//
//他不是很舒服，总感觉后面有什么在盯着他。
//
//
//他警惕的向后看去，但是没有，没有任何实体出现。在他的脑海里，这不正常。
//
//%E8%B5%B0%E9%81%93.png
//带有出口指示牌的曲廊。
//
//曲廊
//曲廊是一处整体晦暗，狭窄曲折的走廊。因其过于曲折迂回且有极多岔路和死路，从而得名曲廊。曲廊平均宽度约为1.3m2，高约为3m。或许是由于此处特殊效应的影响，曲廊与其他两部分甚至其他非线性空间层级相比更容易使人失去方向。
//
//曲廊的地面同样由水泥铺就且较为光滑。墙面受潮严重，经常会出现鼓起的墙皮和裸露的水泥墙面。曲廊的顶上不时会有荧光灯提供照明，使大部分曲廊保持微亮的状态。
//
//曲廊的墙壁下部时有发出绿色荧光的出口指示牌，但经证实这些出口指示牌并不能指向任何该层级出口。
//
//曲廊的天花板上悬着数根形状，材质，截面大小不一的管道，管道有时会传出微弱的水流声。
//
//曲廊的拐角处常会出现电闸和水阀，这些闸门控制着一定区域内的供电和供水。为了防止因供电或供水故障导致出现一些不必要的麻烦，M.E.G.不建议触碰电闸和水阀的任何一个按钮和阀门。
//
//大部分曲廊两侧间隔排列着许多铁门。大部分铁门是锁死的，而一部分铁门上有编号。如果一扇铁门上有编号且其未上锁，那么进入该铁门会带你来到编号所对应的C层群中的层级3。如果该铁门上没有编号且未上锁，那么进入该铁门会带你来到杂物间。
//
//他转过几个拐角，终于来到了一个新地方。
//
//
//尘封的记忆突然被唤醒：这里就是他家的地下室！有一瞬间他甚至觉得自己回到了前厅。
//
//
//但这里终究不是前厅。他又脊背发凉了。
//
//
//他回头望了望身后无人的楼梯间，喝了一口杏仁水，随后继续前进。
//
//%E8%BD%A6%E5%BA%931.png
//车库一角。
//
//车库
//在曲廊中找到向下倾斜的，两侧无铁门的低矮4走道，它最终通向一扇防盗门。按下附近的开关，开启并穿过防盗门即可来到车库。
//
//车库是一个环境较为开阔的空间，高约3m。车库的亮度较曲廊高很多。车库的地面同样由水泥铺成，墙壁和柱子受潮并不十分严重。车库顶部排列着许多密集的管道和线路
//
//就目前探索记录来看，车库内暂时没有发现有车辆出现在车位上，但偶尔会有车辆在车库道路上高速行驶。这些车辆不会因为任何因素停靠，它们只会在拐弯或避让其他车辆时略微减速。目前仍未知这些车辆是否有人驾驶。
//
//就像走迷宫，他在那曲折的廊道转来转去。
//
//
//他不知道走了多久，转了多少弯，最终来到了一处类似地下车库的地方。
//
//
//他又不寒而栗了。不管他喝了几口杏仁水，这种被人跟踪的感觉自他踏上这里就一直伴随着他。他似乎听见脚步声，听见几声嗤笑，也似乎感受到了那目光。
//
//
//但是什么都没有，什么实体也没有 。
//
//
//他再也忍耐不下去。他大喊一声，闪电般地转身准备和那个该死的跟踪者搏斗。但映入他眼帘的只有一辆向他飞驰而来的轿车，而且丝毫没有减速的意思。
//
//
//他在轿车撞到他之前窜到了旁边，轿车呼啸而过，只留下一阵引擎声。
//
//
//
//除上述主要结构外，Level C-534仍存在一些数量较少，规模较小但不容忽视的一些结构。下文将会叙述。
//
//
//
//杂物间
//杂物间出现在曲廊中，进入杂物间的方法是在曲廊中找到并进入一扇未被编号且未上锁的铁门。杂物间内没有任何光源，面积在15-40㎡之间。杂物间内无序地堆放着一些前厅中常见的物品5。这些物品相当一部分是损坏的。
//
//值得特别注意的是：在进入杂物间1分钟后，杂物间的铁门将会没有任何预兆地突然关闭并且在内部无法打开。届时流浪者带进去的光源将会立刻失效并受到永久损害。任何切入和切出的行为在杂物间都是无效的，被困者只有铁门在外部重新打开时才能离开。因此各位流浪者在探索杂物间时要特别注意时间。
//
//他逃离了地下车库，回到熟悉的廊道。他把自己带的整瓶杏仁水都灌到肚子里，这让他的精神状态略微好转。
//
//
//他扭过头看看铁门。铁门上没有数字而且看起来没锁。他试着拉了一下，铁门开了。里面尽是杂物。有放在桌上的，有塞在纸箱子里的，也有横七竖八散在地上的。
//
//
//他踢踢落灰的脚踏车，打开一个又一个纸箱子，拿起一本杂志又扔掉。就这样漫无目的的寻找着。
//
//
//他突然听见一声异响——铁门在徐徐关闭。他突然意识到了什么，拔腿就往门外冲。
//
//
//幸好，在门砰的一声关死之前，他就已经瘫坐在门外了。
//
//电梯间
//在曲廊和车库中均有可能找到电梯间。曲廊中的电梯间多表现为一间约20㎡的小空间，没有铁门阻挡。一般一所电梯间内只会有一部电梯。车库的电梯间则没有明显的房间结构，一般在一个小拐角处会出现一部电梯。
//
//值得注意的是：不管流浪者对电梯进行怎样的操作，乘坐电梯只能带你从一个电梯间来到另一个电梯间而非离开Level C-534到达其他层级。
//
//他再也忍受不下去那光滑的楼梯，曲折的回廊，卡丁车赛场一般的车库以及能把人关在里面的小杂物间。当然还有那恼人的脚步声，令人不寒而栗的目光和几声窃窃私语。
//
//
//他开始四处跑动，从曲廊跑到车库，从车库跑到曲廊。真实的墙壁和虚幻的人声阻挠着他。他来到电梯旁边，就像抓住了救命稻草。他知道这里一定可以带他回去。
//
//
//但是，不管他按什么按钮，最终到达的还是这个地下室。他绝望了。
//
//基地，前哨和社区
//M.E.G在车库通向Level 1的柱子旁边建立了一个小型前哨。
//
//入口与出口
//入口
//在Level 11中进入贴有明显的无法破坏的“534”标识且通往地下的楼梯间会来到Level C-534
//在其他任意开放性层级中尝试切出均有较小概率来到Level C-534
//出口
//通过该层级未被上锁的编号铁门即可来到与该编号对应的C层群中的层级。
//在车库中对着一根略发暗的柱子尝试切入会来到Level 1
//
//
//他疯狂地跑动，亡命地跑动，似乎有实体在追他，但是他身后什么都没有。
//
//
//
//虚幻和现实交织在一起，只有撞得头破血流的时候他才能分清两者的区别。
//
//
//
//他四周都是实体，都是狂笑声和脚步声，他甚至没有意识到自己来到了车库。
//
//
//
//他继续狂奔，前面又驶来一辆车，二者都没有停下。
//
//
//
//他腾空了，碰到了一根柱子。不一样的是，他只是穿过去了。
//
//
//
//他来到了Level 1
//
//
//
//2022年11月13日，在Level 1中发现一名昏迷的男性流浪者，其受到了严重的Phenomenon C-16的影响。头部有较多擦伤，腹部有严重撞伤且多处骨折。数日后因伤势过重不幸身亡。
//在他伤势较稳定，意识较清晰的时候，他向M.E.G.讲述了自己在Level C-534中的遭遇。M.E.G.在经过后续的探索核实后撰写了这篇层级文档并加入了该名流浪者的探索故事。
//
//
//作者信息
//« Level C-533 | Level C-534 | Level C-535 »
//
//Footnotes
//1. 最少记录是2个，而最多记录是13个。
//2. 但也会出现走道突然变窄的情况，此时只能容纳一人侧身通过。
//3. 比如这个铁门上有编号“011”且未上锁，那么进入该铁门将会带你来到Level C-11
//4. 高度仅为1.9m
//5. 如桌椅，书本，金属工具，儿童玩具等。
package lvls15x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1534{}