//Level C-510
//评分: 
//+25
//+
//–
//X
// 
//
//生存难度：
//等级 4
//
// 
//稳定
//实体生态%E9%85%92%E5%BA%97%E3%80%81%E6%88%BF%E9%97%B4%E3%80%81%E5%B9%95.jpg
//Level C-510内部的房间，以及附窗纤藤和床形态的家居幻兽。
//
//Level C-510是后室C层群的第510层，被巡林客组织命名为白林自然保护区。
//
//描述
//Level C-510表现为一系列未完工的现代建筑物内部，由天桥和地下通道互相连接，有正常的昼夜循环，但未观测到任何形式的天体类光源，外界仅有来历不明的光线射入室内。光谱分析表明，Level C-510中的“自然光”与荧光灯的光谱近似。该层级的昼夜循环的运作方式为“自然光”亮度改变，内部温暖潮湿，近似前厅热带雨林。该层级没有任何被长期空置的迹象，但也没有生活痕迹，大多数完整的房间表现为近日落成的建筑外观及内饰。
//
//目前，Level C-510中较低的楼层已确认为无生命的钢混结构建筑的内部。从该层级的最低层算起，向上六到八层为普通的建筑，更高楼层则是某种生态位类似前厅乔木的巨型实体内部，该实体被巡林客中的研究者命名为白木。除去每层均会出现的积水房间以及不标准的窗口外形，这种实体的内部形成的房间与正下方对应的建筑类型几乎完全相同，但所有的墙体均为纯白或银色，而不是下方普通建筑裸露混凝土墙壁的灰白色。
//
//每株白木的顶端均表现为未完工的建筑，该区域已确认为正在生长的活体组织。尽管白木内部有完善但来源未知的水电和Wi-Fi信号，但电压和插座制式可能不匹配流浪者携带的用电器，需谨慎判断。
//
//Level C-510所有的窗口都不是窗户，但这并不意味着那些窗口安全无害。在很多布局类似旅馆客房或公寓卧室的房间内，窗口看似被厚重的窗帘遮挡。实际上，这种“窗帘”是纤藤科附窗纤藤属的布质实体，附着在窗口的玻璃和窗框上生长，无法在不破坏它们时被拉开。在遭受破坏时，附窗纤藤会释放一种有强烈气味的气体，这种气味会吸引该层级中的某些实体。由于该层级中充斥着大量实体，破坏这些“窗帘”相当危险。
//
//尽管很多房间看似生活设施齐全，但Level C-510中完全不存在真正的家具。家居幻兽、柔软沙发、纺织鱼串等已知的纤维类实体在该层级中随处可见，且行为与外界有一定差异，形成了一种不同于前厅或大多数层级的，基于这些实体的生态系统。因此，该层级中固有的任何物件都应当被视为实体，并谨慎对待。
//
//目前唯一一种不属于Level C-510生态系统的纤维类实体是船民，主要由这种实体组成的巡林客组织禁止任何外来者设立永久性基地，并在该层级的出入口附近巡逻。巡林客对该层级采取了严格的分区管理措施，以在避免自身和其他势力干扰这里的独特生态系统的同时，开展一定程度的科学研究。
//
//根据层级内生态系统发展及外界干扰状况，巡林客将该层级划分为四个区域：外围区、研究区、缓冲区和核心区。其中，外围区是该层级内纤维生物生态系统未扩展到的区域，近乎空无一物，仅有少许霉菌生长，且几乎不存在实体。研究区、缓冲区和核心区则根据与出入口的距离和对应层级的居民密度判定外界干扰度，并加以划分。通常情况下，外来者的活动范围仅限外围区和研究区。
//
//Level C-510中唯一一种并非实体个体伪装的物件是灯具，但同样不应完全信任它们。大多数出现在白木中的灯具是这种实体的发光器官，它们基本无害，但无法被关闭，仅在该层级的夜晚发光。有一小部分灯具是后室机器人科技制造的小台灯及其变种，这些灯具始终保持在伪装状态，可能是因为该层级中充斥着的实体，或因目前的观测和记录行为均在船民参与或陪同下进行。除去自己或同伴携带的灯，在该层级内应远离或销毁任何能够被人为关闭的灯具，特别是需交流机密或隐私话题的情况下。
//
//旋转回廊
//Level C-510普通建筑部分的某条楼梯被一条陈旧的旋转楼梯替代。该楼梯始终存在于Level C-510，且会不断变换自己的位置。若任何有意识的存在踏上这条楼梯并不断向下，在某一时刻，它会转而向上，通往一处完全被类似附窗纤藤叶片的失活布料覆盖的回廊。目前未知楼梯和回廊是否属于该层级的一部分。
//
//掀开布料总会发现若干扇木门，无标记的木门通往Level C-510内的其他区域，有编号标记的木门则通往对应的城市或室内层级。其中，通往城市层级的门为单向出口，通往室内层级的门则仅在开门者去过对应层级时成为双向出入口，否则仍为单向出口。这种木门似乎是其他区域中出口门的精确复制品，其数量和真实位置仍未知。
//
//实体
//此处仅列出已在研究区观测到并正式命名的实体。由于目前除巡林客以外组织对Level C-510所知甚少，下表远远不够完善。
//
//生产者
//白木
//白木是一种钢骨木属的类植物实体，生长时总是倾向于模仿附近的大型人造结构，因白色的发泡混凝土外皮而得名。在本层级中，白木模仿其下方的建筑，成长为有着大量具有水电的房间的巨型未完工建筑，因此构成了本层级特有生态系统的存在基础之一。
//
//值得注意的是，Level C-510随着白木的生长而扩张，并不断地生长出可作为出入口的门。目前未知这些门的出现是白木的性质还是层级本身的性质。
//
//附窗纤藤
//附窗纤藤是纤藤科附窗纤藤属的实体的统称，因牢固地附着在窗口的玻璃和窗框上生长而得名。这种实体通常为棉、麻或合成纤维质地，在Level C-510的部分窗口上攀援生长，无法在不破坏时被拉开。在遭受破坏时，附窗纤藤会释放一种有强烈气味的气体，这种气味会吸引该层级中那些附窗纤藤为食的实体的天敌，从而保护自身。
//
//附窗纤藤只进行无性繁殖，通过钻入白木中的根系在Level C-510中蔓延，无任何有性繁殖记录。近年来的一些研究表明，附窗纤藤彻底丧失了开花能力。
//
//万色绒花
//万色绒花是地绒属实体的统称，多年生，生态位类似草本植物。其叶片类似蚕丝或动物毛发，大量聚集生长，这使该实体的集群在非繁殖期呈现类似长绒毯的外观。
//
//万色绒花的叶片是起源于该层级的纺织鱼串白林亚种的主食，前者的繁殖大多同样依赖于后者。在繁殖期，万色绒花开出类似前厅中工艺品“绒花”的鲜艳花朵，并散发出强烈的特殊气味。这种花朵会吸引上文中的亚种纺织鱼串个体，摩擦它们以让自己染上香气，从而避免自身被纸翅飞镖捕食，而万色绒花也得到了传粉。
//
//该属的熔火绒花与绒花属的其他实体的繁殖方式产生了较大差异。熔火绒花仅生长在光照最为强烈的墙壁上，每二十年左右开花一次，上端开雄花，下端开雌花，借重力传粉。在种子成熟后，积累了大量芳香油的黑色果实会自燃，引燃自身和周围的实体。火灭后，熔火绒花的耐火种子继续生长，周而复始。
//
//眩目墙衣
//眩目墙衣是附生在墙壁上，类似墙纸的实体，外表覆有一层异常光滑的聚酯膜。该实体反光强烈，图案模式复杂而密集，观测时经常造成生理不适。该实体分类上自成一属，多与熔火绒花互相争夺光照。
//
//
//消费者
//纺织鱼串
//在常见的纺织鱼串以外，这类实体于Level C-510演化出了一个亚种，被命名为白林亚种。
//
//野生的纺织鱼串白林亚种生活在万色绒花集群中，单只体长约为4～6cm，宽1～2cm，以万色绒花的叶片为食。其填充物为蚕丝纤维，带有类似万色绒花的气味，表皮与原种相近。该亚种昼出夜伏，休眠时不伪装为成串香囊，而是成群躲藏于万色绒花群体中，以躲避捕食者。
//
//家居幻兽
//由于Level C-510不存在原有的家居，家居幻兽根据白木中的房间布局和其他实体的生长情况，伪装为对应的家居。一份关于Level C-510的论文表明，家居幻兽在该层级中出现了伪装成门的行为。
//
//柔软沙发
//目前仅有三次在该层级中观测到柔软沙发的记录，表面图案均为红白相间的格子。在这三份记录中，该实体斜着堵住了走廊，考察人员不得不为此绕路而行。
//
//纸翅飞镖
//纸翅飞镖是一类杂食的小型飞行实体，由覆有聚酯膜的纸翅和角蛋白镖身构成，折叠为类似纸飞机的形态。纸翅飞镖大多结小群活动，外形多样，颜色鲜艳，成体体长在150～300mm不等。一般情况下，纸翅飞镖以万色绒花的叶片纤维、纺织鱼串和聚酯瓶虫为食，觅食时稍有惊动便成群飞起，附于墙上。由于万色绒花花朵所含的芳香物质对纸翅飞镖有毒，后者会在前者的繁殖期专门捕食聚酯瓶虫和原种纺织鱼串。
//
//纸翅飞镖有复杂的求偶行为，雄性以飞翔和鸣叫的方式吸引雌性，越华丽的飞行方式越能吸引雌性芳心。交配过后，纸翅飞镖会寻找一只椅子或一处未被遮挡的窗台，在上面集体筑巢繁衍后代。
//
//椅子
//在Level C-510中，椅子多为布质，且总是倾向于吸引大量的纸翅飞镖。由于该层级极少有流浪者进入，椅子转为和纸翅飞镖共生，吸取后者的疲劳为食。在椅子上栖息和筑巢繁殖的纸翅飞镖不仅为其提供了食物，同时也捕食聚酯瓶虫，降低了椅子被啃食的风险。
//
//分解者
//因观测手段所限，目前未确认微生物型特有分解者存在。
//
//聚酯瓶虫
//聚酯瓶虫是具有真社会性的群居小型实体，外形类似缩小版的无色PET瓶，内部填充纤维多种多样，以其他实体的尸体为食。聚酯瓶虫主要生活在光线相对微弱的区域，仅在夜晚出没。
//
//这种实体有将死去的同类丢入积水房间的习性，其尸体中的填充纤维于积水中迅速融化，瓶身则以异常速率分解，大约四周后分解完毕。
//
//其他实体
//未证实实体
//巨幔纤藤
//巨幔纤藤是纤藤科的实体，形态类似巨型布幔，材质以化纤为主，大多攀附在树木或建筑上。某些记录中提到了“窗外的布料”，由于从窗口或顶端探身会被传送到Level C-28的空中，无法确认这些布料是否为巨幔纤藤的一部分。
//
//寻友熊
//曾有数张巡林客组织成员拍摄的Level C-510照片被发布至某摄影论坛，其中出现了疑似寻友熊的毛绒玩具熊。该系列照片于不久后被发布者删除。
//
//入侵实体
//活性滤纸
//近年来，活性滤纸开始出现在Level C-510的普通建筑部分，并自下往上扩散，对白木中较低处房间的生态造成了一定破坏。巡林客组织了多次对活性滤纸的清剿，颇有成效。目前该组织正在收集杏仁水，通过在外围区设置喷淋装置的方式彻底清除入侵的活性滤纸，或至少阻止该实体侵入其他区域。
//
//吃书之书
//根据巡林客成员，实体生态学家常██的传记，在某次对外围区的探索中，一只吃书之书出现在普通建筑三楼的地面上。该实体立刻袭击了当时亲自带队的常██以夺取其持有的笔记本，并迅速被后者制服，不久后运出Level C-510以供研究。此后，巡林客考察小队配备了移动电子设备，用于及时备份记录。目前再无其他关于该实体的记录。
//
//
//资源
//巡林客组织不允许任何势力在该层级大规模收集任何形式的资源。虽说可以出于研究目的在研究区收集实体样本，但仍有一定限制，以免破坏Level C-510内的独特生态系统。
//
//基地、前哨与社区
//由于船民为保护该区域生态做出的管控行为，Level C-510内部不可能建立任何永久性基地、前哨与社区。
//
//巡林客
//这是由在该层级出入口和层级外围区及研究区巡逻的武装力量，以及研究当地实体和生态系统的常驻研究者构成的组织，几乎全部由船民组成。他们的主要任务为阻止破坏该层级生态的生产行为，以及保护和监视获准进入的科考队伍，成员数未知。
//
//巡林客隶属于被他们称为“国家林业局”的未知组织，必要时有权采取一些强制措施。与在海上见到的同种实体不同的是，巡林客执行任务时总是身穿完全覆盖身体的城市迷彩服，戴有头盔。“白林自然保护区”这个命名正是源自巡林客对该层级的称呼。
//
//入口与出口
//入口
//Level C-510的已知入口均为新旧不同的材质拼成的木门，在已知的城市层级的室内或现代建筑物内部风格的层级中均有可能出现。这些出入口是双向的，有明显的标识，且总有一支巡林客小队时刻把守。目前，进入该层级需要预先申请并获得许可，并在巡林客的陪同下进入。
//在巡林客与U.E.C.的一次大规模武装冲突后，Level C-510和Level C-72连接的门已被前者彻底摧毁，该出入口消失。暂未知是否有更多出入口被摧毁。
//
//出口
//双向出入口见上文。
//旋转回廊中通往城市层级的门为单向出口，通往室内层级的门则仅在开门者去过对应层级时成为双向出入口，否则仍为单向。
//一些从Level C-28回收的记录表明，在Level C-510从窗口或未封闭的顶层向外探身会凭空摔落在该层级，并导致当事人重伤。
package lvls15x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1510{}