//Level C-519
//评分: +18+–x
// 
//
//生存难度：
//等级 4e
//
//不安全
//不稳定
//环境危害
//2399661414213917715-2.png
//Level C-519的一张图片
//
//Level C-519是后室C层群的第519层。
//
//描述
//Level C-519是一个面积约为四百平方公里的20世纪的英国城市。该层级面积约为400平方千米，分为工业区和居住区。建筑物主要由公寓楼和平房构成，多数可以进入，但通常内部空无一物，少数房间内拥有完整内饰且具有少量物资。
//
//该层级中有河流自南向北1穿过层级中心点，但仅有一座桥梁连接两岸。河流上具有数艘已经损毁的轮船，但其发动机仍在正常运转。河流两岸建筑物的差距是巨大的，河流以西主要为低矮建筑，极少有高层建筑，且建筑物破损程度相对较高。东侧则较为繁华，高层建筑相对较多，建筑物内的物资也较为丰富。这些建筑物内较为潮湿，墙壁上常常长有霉菌。值得注意的是，所有的居民用房中均会出现一个正在燃烧的壁炉，这些壁炉的燃料均为煤炭，可以通过普通手段熄灭，但在24小时后会突然复燃，这导致这些建筑物内的空气质量远差于室外空气，因此我们不建议在这些建筑内逗留过长时间。
//
//该层级的空气始终弥漫着浓度较高的烟雾，能见度处于300米左右。空气中弥漫着硫磺刺鼻的气味，因此，我们建议流浪者在探索该层级时始终佩戴口罩或防毒面具以确保自身安全。
//
//该层级中拥有地铁和火车，流浪者可以沿火车轨道找到火车站，在东部市区内探索找到地铁站。流浪者可以通过搭乘火车以快速探索该层级。火车的铁轨上常可见满载煤炭的火车车厢，火车和地铁同样通过煤炭燃烧供能。地铁站内可以找到火盐、杏仁水等物资，同时，地铁站内可见少数温顺的无面灵。
//
//该层级的天空通常处于永昼状态，但如果试图关闭工业区的发电厂，天空会立即暗淡下来，几分钟后所有自然光源会完全消失。
//
//工业区
//工业区位于该层级的河流东侧，占地约100平方千米。该区域的建筑多为炼钢厂和发电厂，均难以进入和破坏，如果试图进入这些建筑会导致建筑出现严重的塌方。但可以短暂的探索的可以确认的是，该层级内的工厂仍在进行工作，使用煤炭作为燃料。由于该层级中的烟囱极其低矮，仅有30至45米高，导致废弃气体被排放到低空中，难以消散，使得该层级的空气奇差。
//
//工业区的边缘地带为一个巨大的矿坑，其直径达到了15千米。构成矿坑的主要物质为土壤和岩石，同时可以在矿坑内发现大量的煤矿。在矿坑中有大量无面灵，这些无面灵较为温和，通常会对矿坑内的煤矿进行挖掘，将其运输至工业区。在这些无面灵中，有少部分无面灵穿着的警服，监管着其余的无面灵。值得注意的是，进行挖矿工作无面灵均为黑色人种，这些无面灵似乎对白色人种的人类和无面灵抱有惧怕的情感，会听从穿着警服的无面灵的一切指令。因此，当有穿着警服的无面灵受到攻击时，其余无面灵会一拥而上发起反击。造成该种现象的原因未知。
//
//经过推测，该层级的电力来源完全依靠工业区的发电厂，如果该层级中的发电厂出现损毁，该层级中除房屋壁炉之外的所有自然光源均会熄灭，所有用电和供暖设备会立即停摆。该现象同样会影响流浪者带入该层级的电子设备，因此我们不建议流浪者过分靠近发电厂区域。
//
//毒雾现象
//该层级会不定期的出现浓度极高且含有可对人体造成伤害的雾气，当该情况发生时，该层级的天空会逐渐暗淡，能见度不断降低，且空气中会出现极其刺鼻的硫磺和煤烟气味。这种雾气具有刺激性，直接呼吸这种雾气会导致暂时性的胸闷气短，咳嗽，鼻腔和眼睛会受到具有辛辣感的刺激。
//
//当雾气完全成型后，烟尘浓度可达每立方米4.5毫克，二氧化硫最高浓度达到5.4%，均为正常情况下的数倍。室外有效能见度仅可达1至3米，室内能见度稍高一些，但最高不会超过20米。在室外的雾气中行动必须佩戴防毒面具，否则会患上严重的呼吸道疾病，并且由此产生的并发症远比平时严重，致人死亡的可能性大大提升。
//
//同时该层级中的河流会受到重金属污染，水的颜色会变得极其浑浊，建议流浪者不要试图饮用该状态下河流内提取出的水。
//
//我们建议流浪者在该现象发生时选取那些不带有壁炉的房屋暂时躲避，或前往地铁站的地下部分以躲避烟雾，如有条件建议立即切出该层级。
//
//该现象通常会在3至4天后完全结束，结束时通常会伴随着降温，建议流浪者做好保暖准备以防冻伤。
//
//基地、前哨与社区
//M.E.G."矿工"基地
//该基地共325人，驻扎于该层级的工业区旁的火车站。
//乐意为流浪者提供帮助。
//入口与出口
//入口
//在任意一个城市层级遭遇迷雾现象后可能来到该层级。
//找到Level 57中一幅被迷雾覆盖的城市可以来到该层级。
//进入Level C-728中未完全垮塌的厂房可以切入工业区的边缘地带。
//出口
//过分深入矿坑有可能将你带到Level C-20。
//打开该层级中的下水井盖有概率切入Level 34。
//沿着铁路行走至层级边缘会将你带到日本铁路。
package lvls15x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1519{}