//Level C-560
//评分: 
//+1
//+
//–
//X
// 
//
//生存难度：
//等级 生命流逝
//
//熵增
//融化
//逝去
//描述
//Level C-560的外观为一个长度无限、宽度无限、高度无限的木制阶梯，其余皆是纯白的虚空。流浪者切入该层级时，会来到阶梯的起点。流浪者会受到某种神秘力量的指引，开始攀爬层级中的阶梯。途中，流浪者会见到Level C-560中的实体“冰雕”，顾名思义，这些实体的外观通常为人形的冰雕，有时流浪者所见到的“冰雕”的面部特征与其的某个亲友或同事、同学相同；它们无法移动，并随着时间的的流逝而融化。同时，随着时间长度变化，流浪者的体温会逐渐降低1，身体逐渐变得如同实体“冰雕”一样，但此时其依旧能够移动。在流浪者的身体完全转化为“冰雕”后，其依旧保留一定的运动能力与完全的思考能力。但这之后，流浪者的身体也会随着时间的流逝而逐渐融化2，直至彻底地消失。这种变化是完全不可逆的。当流浪者开始随时间流逝而融化时，其本身的生命也会开始加速流逝，直至最后消失时，彻底“死亡”。该层级能够容纳多名流浪者同时存在。
//
//实体
//Level C-560中仅存在一种实体，即“冰雕”。若有其他实体意外切入该层级，它们的身体同样会转化为冰雕并逐渐融化，最后“死亡”。
//
//“冰雕”：
//该实体的外貌通常与进入该层级的流浪者的在前厅中的亲友、同事、同学等的外貌相同，但同样能够见到“随机生成”的陌生人与各种前厅的常见动物。随阶梯高度的变化，“冰雕”从外貌上所能辨别的年龄也会逐渐增大。“冰雕”无法移动，也无法被移动。它们通常单个地或者成对地3坐或站在层级内的阶梯上，并随时间流逝而融化，直至消失。据猜测，在该层级内“融化”并消失的流浪者可能会变为该实体，直至下一个与该流浪者有交集之人进入该层级内时出现。
//
//基地、前哨与社区
//由于该层级的特殊性质，无法建立任何基地、前哨与社区。
//
//入口与出口
//入口：
//
//在Level C-212找到一处结冰的水塘并切入，流浪者有25%的概率进入Level C-560。
//在Level C-515找到一尊手持异常加速的时钟的人像冰雕并尝试取下其手持的时钟，流浪者将被传送至Level C-560。
//
//出口：
//目前为止，进入过该层级的流浪者均未生还，且无任何有关该层级出口的报告。4
//
//无尽，又是这样，又是这种地方。
//
//我一眼望不着这“天梯”的头，似乎有什么东西在催促着我向前走。
//
//我真好奇前方有什么在等着我。所以……走吧？走吧。
//
//一步，两步……我默默地数着，一直数到了一百步，我听到：滴答。滴答。水滴落地，楼梯上坐着年轻的，由冰制成的母亲，“她”赤身裸体，手中似乎捧着什么东西，“她”正在渐渐地融化。
//
//我继续向前。
//
//我见到了更多的，冰制成的亲人们，“他”们堵在我身边，只留一个小小的间隙以让我通过。
//
//我侧身走过，“他”们身上融化的水浸湿了我的衣服。
//
//渐渐地，我的指尖变得透明了。还有我的发丝，我的鼻尖，它们……变成了冰。
//
//我的身边开始出现一些小孩了。透明的，精灵一样的孩子们坐在楼梯边玩耍。但“他”们的动作，像永远地被凝滞了。
//
//我急切地想离开这里。我小跑上去。
//
//我的四肢，已完全变为了冰。稀奇，我居然还能动。
//
//滴答。滴答。
//
//我的身边又出现了一群群的学生。有人结伴同行，有人孤零零地，坐在角落。我听到了震耳欲聋的寂静之声。我捂起耳朵，快速地穿行在“人”群中。走着走着，我的面前是一位亭亭玉立的少女。我渐渐地沉沦于此……沉沦于她那……空洞无神的眼里。不！我看到了她眼里的喜悦与期待，我看到了她正要跟着我一起离开这个嘈杂的世界！我明明看见了……
//
//滴答。滴答。
//
//我的整个身体变为了冰。
//
//融化的……是我。
//
//滴答。滴答。我似乎意识到了什么。
//
//正在消逝的，既是我，也是时间。
//
//不……我不要继续向前了！我绝望地大吼。
//
//那无形的力量牵引着我，我拉着那少女的手，让她与我同行。
//
//她不为所动。我被那力量拽着向前走，时不时回头望。她渐渐融化。
//
//我的脸也在融化吗？若不是，为何有一滴水，正滑过我的脸颊？
//
//我无奈地向前。
//
//这里的冰雕们，我一个也不认识，更无心顾及。我只是默默地，麻木地向前走。
//
//后来，我看到一些拎着包的人。他们没有一个坐下，只是做着向前走的姿势。“他”们的表情在融化的过程中早已模糊了。
//
//我也一样。
//
//我尝试说些什么，但我的声音也一起被剥夺了。
//
//滴答。滴答。秒针摆动，同那水滴落的声音。
//
//我的步子慢下来了，不可控地慢下来了。
//
//最后我只是路过一个个冰做的坟墓，墓碑上的字早已模糊不清。
//
//我的身体也快要融化殆尽了。
//
//在最后我所能攀上的那一级阶梯，我望着头顶纯白的虚无。
//
//这一次，再也没有那“滴答”声了。
//
//时间过得可真快。
//
//+ 作者信息
//Footnotes
//1. 但其本身感受不到体温的降低。
//2. 融化所得的液体似乎为液态的H₂O。
//3. 有但少有成群的“冰雕”。
//4. 故该层级为一死区。
package lvls15x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1560{}