//Level C-546
//评分: 
//+29
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//Level C-546是后室C层群的第546层。
//
//它被一个在前往Level C-139途中的流浪者所发现。
//
//描述：
//Level C-546的内部环境表现为一座堆满药品的仓库，占地面积约为16平方公里，仓库内部有一扇无法打开的上锁卷帘门，且无法被任意形式的物理手段破坏。
//
//其内部放置着大量的金属货架，货架上则摆放着若干数量的纸箱，纸箱内存放着各类药品。这些药品的外包装上除了药品名称和类型外并未标注其他信息。仓库内药品种类之繁多，以至于在这里能够发现大量罕见特效药，例如用来治疗脊髓性肌萎缩的诺西那生钠等。
//
//
//
//层级物品特性
//该层级内部的药物在服用过后能够使人陷入以往的回忆之中，回忆的内容主要偏向于回忆者认为的做错的事情。这种效果是随着药效流逝而消失的。这种性质对于治疗失忆患者是极其有益的。
//
//除此之外，这里的药物效果与前厅中的药物做对比，治疗效果或者药物的整体作用是翻倍的，目前不确定药物副作用是否随着治疗效果而增加。
//
//也许，每个人都会对某件事，或者某些事后悔。当你进入到那个黄色的，日光灯嗡鸣的地方时，你决定要在这个鬼地方活下去，不是吗？假如现在给你一个机会，后悔的机会，你会去选择它吗？这世上，真的有后悔药。回到那些破事发生之前的记忆，不是很好吗？
//
//关闭日志
//日志1
//……
//“我开始有点后悔了，为什么不早点来到这里。这里简直就是天堂。这里的药物除了它们正常的功效外似乎还有能够使人安定的效果，在服用了这些药品之后我感受到了一种前所未有的安全感与舒适感。我萌生了一个想法，对我在后室里东奔西跑这么多年去寻找出口的荒唐想法感到后悔。在这里建立一个永久性基地一定是个正确的选择，毕竟这是后室中为数不多的净土。”
//……
//
//关闭日志
//日志2
//……
//“我在服用这里的药物时，发现了这些药物的一个特殊性质，在服用过后能够使服用者回忆起一些往事，这种效应是随着药效而进行的。我回忆起，我在前厅时干过的蠢事，面对父母时表现出的叛逆，以及在刚出社会那时把父母给我的经济帮助拿去挥霍，我对不起他们；想起了以前的所有快乐的时光，是多么的珍贵啊……我很后悔，但是无能为力，我在梦里，不，回忆里，向我对不起的人认错，他们很宽容，可是…回不去了。也许来到这，是老天对我的报应吧。好了，作为一篇正式文档，我觉得叙事部分应该在此停止。这里的药物也许能够作为治疗失忆症患者的有效途径。”
//……
//
//
//
//基地，前哨与社区
//在该层级内部暂未建立任何基地，前哨或社区
//
//
//入口与出口
//入口：
//在任意层级饮用完一瓶在装有不明有色液体的试剂管旁的医用酒精，你会来到该层级。
//出口：
//暂未发现任何出口
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//档案已更新
//
//档案作者疑似受到精神危害影响
//导致新文档出现内容错误。
//
//关闭档案
//
//
// 
//
//生存难度：
//
//治愈
//
//精神效应
//良好回忆
//流连忘返
//Level C-546是后室C层群的第546层。
//
//它被一个在前往Level C-139途中的流浪者所发现。目前该流浪者已被证实死亡。
//
//描述：
//Level C-546的内部环境表现为一座堆满药品的仓库，占地面积约为16平方公里，仓库内部有一扇无法打开的上锁卷帘门，且无法被任意形式的物理手段破坏。
//
//其内部放置着大量的金属货架，货架上则摆放着若干数量的纸箱，纸箱内存放着各类药品，其种类之繁多，以至于在这里能够发现大量罕见特效药，例如用来治疗脊髓性肌萎缩的诺西那生钠等。这里的药品没有标注任何有关保质期的信息，但是它们并没有发生变质的情况。根据这位流浪者的自身实验得知，所有药品都能正常使用。
//
//
//层级环境以及物品特性
//环境特性：
//在该层级逗留过久会有一种想要服用药品的欲望，使用杏仁水可以轻微缓解这一症状，但无法彻底控制。具体表现为，流浪者在受到该效应影响时会不受控制地服用任意类型的口服药物或者使用任意类型的注射类药物。此效应是无法控制的，使用杏仁水也只能够轻微缓解。在服用药物过后这种欲望则会继续加深，类似于吸食毒品。如果来到这里，我只好建议你去找一下安乐死的位置了。
//
//物品特性：
//该层级内部的药物在服用过后能够使人陷入以往的回忆之中，回忆的内容主要偏向于回忆者认为的做错的事情，并且在回忆过程中向自己认为对不起的人认错。这种效果是随着药效流逝而消失的。这种性质对于治疗失忆患者是极其有益的。
//
//
//欢迎，一切因为某些原因饱受折磨的，对这些事物感到后悔的，饱受它们折磨的苦难之人……
//来这吧，来了，就不会再后悔了…
//
//
//日志3
//……
//“我感到有点孤单，因为我在这里没有找到任何的人或者实体。至于出口，那扇卷帘门边上有一串钥匙，却打不开门。我不知道我的理智还能够坚持多久。出于需要，我使用了几根镇静剂，前厅的最好的镇静剂的效果都远远不及它们，而且其他药物的效果也比前厅中的药物好得多。如果能够找到出口的话，我一定会从这里带走大量药品作为样本，这对后室的医学领域将会有极大的帮助。”
//……
//
//
//日志4
//….
//“我需要药，我需要药！我后悔了，我对它们产生了依赖，就他妈的像是吸食毒品一样！这种欲望是无法被控制的。如果在30分钟之内没有服用任何注射类或者口服类药品，将会导致休克，但是不会直接死亡。我的身体状况因为各类药品的副作用迅速恶化，药品的副作用发作概率极高。我的时日已经不多了，希望有人能够看到这篇日志，不要尝试进入这个层级，更不要尝试服用这里的任何药物，否则你会后悔的！”
//……
//
//
//
//基地，前哨与社区
//因本层级精神危害严重且无法控制，无法建立任何前哨站，基地和社区
//
//
//入口与出口
//入口：
//在任意层级饮用完一瓶在装有不明有色液体的试剂管旁的医用酒精，将会切入本层级。
//出口：
//暂未发现任何出口 离开这里你会后悔的。
package lvls15x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1546{}