//Level C-507
//评分: 
//+18
//+
//–
//X
// 
//
//生存难度：
// 
// 
// 
//Level C-507是后室C层群的第507层，因Level C-507存在强致命性危险实体且目前没有找到可靠的反制措施，已经可以将任何进入此层级的探索者归入己死亡范畴。
//
//在任何情况下从Level C-507泄漏的物质，包括但不限于探索者或是其尸体及装备，都必须高温消杀到完全损坏为止。
//
//目前对Level C-507进行探索的主要方式是依靠Level C-327的特殊效应，以Level C-327进行物资补给，M.E.G.借助此方式成功在Level C-507创建过两个前哨站1，这也是Level C-507唯一人类信息来源。
//
//Level C-507为一片巨型有机体组成的活性结构，目前根据激光测量其结构似乎并没有像大多数星球一样的曲率，而是完全平坦的大面积平原。
//
//如果以构造中心的恒星为坐标终点另一方向的结构与目前探索方向一致，那么该结构应当是一个直径2.4亿千米的巨大圆盘，考虑到激光反射的位置是圆盘结构外端高耸的类骨骼状物质而不是圆盘的绝对边缘，这一直径数据可能还会更大。
//
//目前尚不清楚该结构究竟是如何保持稳定的，推测其自身引力场已超越构造中心恒星引力场从而将恒星反向捕获，同时巨大结构在以一定速率自旋，通过离心力抵抗引力以保证自身能维持稳定结构。
//
//由于缺少针对巨大结构外侧的观测，也尚不清楚该结构的高度以及为何在如此大体积下它没有变成圆环状甚至变成黑洞，这一巨大结构的支撑材料已经超出了目前人类材料学认知的极限。
//
//大气层
//Level C-507大气和目前人类认知中的前厅较为相似，但有明显高的多的氧气和二氧化碳含量，二氧化碳的含量甚至达到10%左右远超前厅水平，大多数探索者可以在Level C-507正常呼吸但是一部分来自高原或本身肺活量较大的探索者可能会出现醉氧症状，不过考虑到大气中含有大量石绽肉花，吸入Level C-507的空气会导致探索者从肺部开始分解从而致命。
//
//但根据有识血肉巢穴的数据共享来看大气似乎呈现区域性。推测由于层级中广泛存在的巨大孔洞状建筑，当呼吸孔舒张时会有大量气体从其中排出。由于外环区域温度普遍低于内环区域，内环区域大量光合作用产生的氧气将会加热上升形成高压带并向外环区域扩散，而外环区域较冷空气则会下沉并移动向内环区域，最终形成朝向内环区域的巨大地面风，通过这种巨大的对流来保证大气中的氧气和二氧化碳的稳定含量。
//
//浅层地层
//圆盘结构外表层完全由某种外观呈现深绿色的特殊物质所包裹，似乎是巨型结构的外表皮或者说甲壳，和咖啡云卷所使用的技术相似，特殊物质的分子在微观结构上处于近似锁定的状态。
//
//这赋予此类物质惊人的韧性和修复能力，即使受到小型天体冲击造成巨大破坏也可以迅速修䃼，目前根据地质钻探取得的少量样表明该物质中的铁元素组合成类似四氧化三铁的结构，微弱的磁性似乎可以用于吸引一部分未被大气层吸收的宇宙射线。
//
//深层地层
//受限于目前的科技水平，前线基地只能对深地层进行有限的勘探，但目前钻取结果来看深层也同样是有大量有机质构成，且这些有机物中有巨量混杂的基因组和形态各异的外观，所以推测深层是大量有机体构成的工业设施。2
//
//地磁场
//以确定Level C-507的地磁场周期性变化，似乎有一个巨大且保持移动的磁力源位于该结构地面的正下方。移动的周期和横波探测仪表明的附近大型管道波动的周期相似，如果数据没有出错的话，Level C-507的磁场来源很有可能是下方巨大管道内的液体——结构的血液，也与钻探结果相符。
//
//昼夜变化
//Level C-507中心区域的星体是一颗质量较大的B型恒星，目前正在以一定速率上下摆动，光谱分析结果显示恒星周边正在散发出比预期值高得多的伽马射线波。
//
//目前学者们的研究认为修建者很有可能在圆盘周边布置过一系列伽马射线发射器用以对恒星的位置进行固定和牵引，但是由于恒星本身的光线太过强烈导致周边的伽马射线完全被遮挡只能依靠光谱分析推测，因此是否真的修建过该装置又或是仅仅因为该恒星本身有更高的伽马射线发射量目前尚不得而知。
//
//由于恒星摆动轨道固定，以地平线为基准当恒星摆动到圆盘另一面时，此面的时间便进入夜晚，目前摆动的频率是725小时每周期，一周期内每一面有13天左右的白昼以及各1天的晨昏。
//
//实体
//石绽肉花：Level C-507的大气层和地表都弥漫着大量未处于失活状态的石绽肉花，由于Level C-507的有机物部件表现出对石绽肉花的抗性，有理由怀疑这个圆盘本身是由该实体搭建起来的。
//
//在Level C-507内的石绽肉花将不再承受错误复制带来的毁灭性失活，这使得理论上它们在Level C-507可以永久存续且无止境的扩张，但是从Level C-507流出的其他石绽肉花仍然会受到限制。
//
//反制措施：这是导致一号基地覆灭的主要实体，根据=号基地从较远区域观看的影像记录来看，当一号基地开始钻探后大约2~3小时内出现，外观像是由大量细胞质组成的可变形生物。
//
//该个体直接从地面底部析出并开始对一号基地发动袭击，成功破坏一号基地的部分结构后基地迅速覆灭于跟随空气一起涌入的石绽肉花。
//
//特殊效应
//已确定探索者感受到的严重恐惧、自卑、无力感等心理反应不属于Level C-507特殊效应的一部分，Level C-507理论上不存在特殊效应。
//
//但考虑到有如此巨大的结构可能Level C-507的引力在生成方式上与已知稍有差异，导致此结构更容易形成并且更稳定。
//
//物资
//由于Level C-507危险性极高，并且几乎所有带出物品都含有石绽肉花，因此Level C-507无可利用物资。
//
//基地、前哨与社区
//M.E.G.二号研究基地
//利用大量混合金单质的餐刀锈金制造而成，出于最大限度节省材料的考虑做成棱锥状，通过Level C-508投入，由于黄金很难与其他元素发生反应，石绽肉花会将其选择性忽略。
//
//由于其中完全没有光源而满足前往Level C-327的条件，因此在Level C-327有该基地的后备基地负责对该基地所有物品进行物资交换，因此该基地本身处于完全密封状态，所有进入者必须取得从Level C-327获得的氧气罐才能正常进入。
//
//早期探测活动主要依靠声纳和无线电波扫描，在一次与有识血肉的交易后成功获得一部分灵魂物质用以制作窗子，在此基础上，基地开始展开一系列用光学望远镜进行的探测活动。
//
//有识血肉科研巢穴“披萨盒”
//有识血肉用于作为保护膜的装置是灵魂物质，在其中确定发现一只常驻的抹茶蛋糕3，这给予其与Level C-307之间的联系，保证的基础物资输入的同时也让更多个体得以进入。
//
//该科研巢的研发记录相当出色，目前可以确认有识血肉有相当数量的产品，比如咖啡云卷和绞肉泥粥的核心技术都是来自于该巢穴对Level C-507巨型结构的逆向分析4。
//
//网络情况
//尽管Level C-507有极其广泛的无线网络覆盖，但使用波段和传输信息模式与已知的任何端口不匹配，目前探索者常用的电器无法适配该无线网络。
//
//入口与出口
//入口
//朝向任何一个装有肉类的碟或盘子类型容器进行切入都能使切入者进入Level C-507。
//在蓝色通道、星空、太空类层级向任意方向远距离移动后有一定可能到达Level C-507上方，前哨站观测到以此方式坠入Level C-507的探索者截至目前共250人，没有生还者。
//尝试进入C508的通道有一定可能进入Level C-507。
//出口
//尽管Level C-507确实存在理论上的出口，但是目前根据蓝色通道和层级距离测定法可得出口距离较远，考虑分解速度和探索者身体状态不太可能到达。同时出于减少对其他层级的污染和可能性伤害的考虑不对Level C-507具体出口进行记录，任何进入Level C-507的探索者可立即使用武器对自己进行自我了断以减少痛苦。
//作者信息
//Footnotes
//1. 一号站已覆灭
//2. 但是以上钻探行为会迅速招致推测为圆盘免疫系统的特殊实体的打击，第一前哨站因此覆灭。
//3. 推测即使是层级意志也无法抵挡该层级的石绽肉花
//4. 然而比起该层级所使用的技术来说仍然差得很远
package lvls15x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1507{}