//Opus C-599
//98%2%
// 
//评分: 
//+96
//+
//–
//X
//
//
//静卧在
//
//冰冷的草丛中
//
//阳光温暖了我的身躯
//
//绽放
//
//如娇艳的花朵
//
//渴望热情的乐章
//
//洁白的瓷砖熔化
//
//流淌　流淌
//
//玷污了斑驳
//
//火红的枫叶
//
//旋转在空中
//
//燃烧　燃烧　燃烧
//
//空余灰烬
//
//落入熔岩，落入铁水
//
//化作一缕轻烟
//
//凋零
//
// 
//
//生存难度：
//
//等待分级
//
//存在性存疑
//物质性存疑
//档案待考证
//Level C-599被认为是C层群的第599层。与Level 199类似，目前尚未有确切证据证实该层级在物质层面上存在，但它真实地位于许多人的梦境与幻想之中。
//
//
//
//lavapool
//佳木。美池。芳草。
//
//描述
//“地狱的碎片落入了天堂。”
//
//Level C-599是泳池、瓷砖与花海交织而成的梦境，树丛、蓝天与白云的身影点缀了远方。唯一令人费解的是，所有泳池内的液体并非清澈见底的液态水，而是类似于灼热熔岩与熔融金属的混合物，发出橙黄色的光芒。该层级内并不存在昼夜更替，“天空”中无法看见太阳的影像。尽管如此，流浪者能够观察到从某个特定方向照射过来的全局光源，其角度和强度类似于夏日下午三点左右太阳的光芒。
//
//尽管同样被冠以“泳池房”的名号，但与人们津津乐道的Level 233与Level 370不同，除去水体，Level C-599拥有更加开阔的室内空间，并且存在视觉上的“户外空间”——蓝天，树林——虽然尚且无法证实那是否只是幻象。
//
//据到达Level C-599的流浪者称，该层级的部分区域被若隐若现的钢琴声所笼罩。根据数位流浪者的记忆，确认了演奏曲目为前厅德国作曲家路德维希·凡·贝多芬所作 《热情》
//"Appassionata"
// 奏鸣曲第三乐章1的片段。然而，目前为止并未寻找到音源所在地。
//
//Level C-599内的建筑颜色多为无瑕的白色，整个墙面是完整的一体，其材质类似于上釉的氮化铝等材料制成的新型陶瓷2，拥有极高的反照率和极低的摩擦因数。墙壁和穹顶自然地通过圆弧连接在了一起，就连破碎部分的缺口也是完美的弧线。没有玻璃的天窗与落地窗投影出户外的蓝天。墙脚部分则与草地和鲜花融为了一体，地基深入泥土之中，看不出一点破绽。泳池边缘的部分同样是用洁白的瓷砖铺就的，将池内炙热的岩浆包裹起来。不时有熔融的白色物质从瓷砖上脱离，混入熔岩之中，然而池壁永远保持着它的厚度。
//
//
//
//
//以下文字被发现于某处墙壁的瓷砖上，凭借流浪者的记忆复原：
//
//在瓷砖上发现的残片：
//
//曾几何时，熔岩浇没了我的热情。
//
//我在太平洋的一座火山岛上长大。来此度假的人们都管那里叫“天堂”，也许是习以为常，我并不觉得我的生活有多么优渥。我的家靠近一片洁白的沙滩，那是我们岛上最大的一片沙滩。我依稀记得小时候，夕阳下沙滩上与同伴们奔跑的身影。潮涨潮落，月上汐升，海浪轻抚，浮光跃金……
//
//岛上的火山是一座活火山。距离上一次喷发已经过去了近两百年，没人知晓它下次会在多久喷发。从我有记忆起，每过一段时间，它就会不耐烦地发出沉闷的声响。偶尔，它也会冒出一些烟雾。正如生活在地震带上的人们一样，我们都对于这种“不痛不痒”的现象麻木了。顺理成章地，它成为了我们生活的一部分。我们当地人把火山当作守护神，仿佛失去了它的庇护，岛屿就会沉没。我曾对此也深信不疑。
//
//后来，岛上进行了一系列改造工程。曾经平坦洁白的沙滩被改造成了大小的滨海泳池。静坐海边，尽管多了欢声笑语，我却只觉得嘈杂乱耳。曾经茂密的树林被砍伐，山坡上的花丛被毁蹋，取而代之的是一座座华美的海景房、一间间精致的庭院。我清楚这样做为我们带来了什么，但失去的东西，却无法弥补了。我渴望自然，拥抱热情。但是我周围的人却不这么想。
//
//随着年龄增长，我离开家乡，前往伯克利音乐学院3学习钢琴表演。我喜欢那里火红的枫叶，远远望去，满树都在热情地向我招手。我常常将它们拾起，夹在我的乐谱中。在空无一人的琴房里，窗外是摇曳的枫树，窗内是钢琴前的我。弹一曲《热情》，我愿奉献我所有的热情，致我热爱的事业。
//
//…………
//
//凡事都有个落幕的时刻。那是我第一次周游巡演，我特意将最后一站设在了自己的家乡——那座不起眼的太平洋小岛。衣锦还乡，本该是再幸福不过的事。不曾想，火山……在那天喷发了。彼时的场景刺进了我的记忆：天上的云彩笼上了可怖的黑色，汹涌的海水翻滚滔天，浓密的火山灰狂妄地喷向天空，炽热的熔岩摧毁了沿途的一切，贪婪的火舌吞噬了幸存的植被与房屋；海啸袭来，使原本难以愈合的创口雪上加霜。我的亲友，我的灵魂，我的热情，已经埋葬在灼热的熔岩之下了……
//
//实体
//据流浪者的记忆，尽管植物繁盛，该层级内却未发现任何实体。
//
//更新：最近，据声称前往过该层级的一名流浪者说，他在某处熔岩泳池中发现了一个游动的红色球形实体个体，暂命名为“炽丸”。据猜测可能和红色浮灵变种有关。由于仅有一起目击记录，暂且不记录在案。
//
//基地、前哨与社区
//与Level 0和Level 370等层级类似，不同流浪者无法在该层级内相遇。鉴于目前未确认该层级是否在物质层面上存在，尚且无法解释这种特殊效应是如何形成的。因此，任何建立基地与前哨站的尝试都宣告失败了。
//
//入口与出口
//入口
//除通过睡梦偶然进入外，存在一些特殊的进入方式，以下皆为流浪者口述提供的信息：
//
//从Level C-314逃离，直到海洋逐渐转变为灼热的熔岩4，在经受烧灼的巨大痛苦后，你会安然无恙地在一个熔岩泳池边的花丛中苏醒。
//跳入Level 42一个映有白色建筑和五彩花海影像的异常岩浆池会来到此层级。
//在Level 48找到一栋配有泳池的海景房，躺在泳池的温水中并入睡可进入该层级。
//迷失在Level 370中，当温水逐渐变为岩浆，光洁的地板上开始长出花草，继续深入便能到达该层级。
//触碰Level C-5的橙色有小概率通往该层级。
//出口
//对于从梦境中进入的流浪者，可通过苏醒的方式回到原层级。对于其余情况，存在一些特殊的出口，以下皆为流浪者口述提供的信息：
//
//找到一架静止的钢琴以进入Level C-125，尽管目前仅有一例实践报告。
//找到并跟随“炽丸”实体，跳入泳池中的熔岩，在经历强烈的灼烧感后，你会毫发无损地来到Level C-404。同样地，目前仅有一例这样的报告。
//迷失在泳池房中，当岩浆重新变为水体，植物愈发稀疏，便可回到Level 370。
//找到层级的“边界”，越过那里，来到Level C-600。
//
//
//
//
//
//
//
//
//
//
//
//
//附录
//长久以来，Level C-599的存在始终被许多流浪者质疑。尽管越来越多的流浪者宣称他们或通过梦境或通过穿越其他层级进入了Level C-599，但从未有任何的实物能够支持这个层级存在的证据。曾经有不少人试图将层级内的物品带出，这些尝试却以不同的方式告终了。加之流浪者对该层级的描述过于离奇与具有主观色彩，愿意相信此层级存在的流浪者便少之弥少。直到一位自称“Y”5的吟游诗人将其经历公诸于世，人们开始重新思考这个层级存在性的意义。
//
//以下是这位自称进入过该层级的流浪者“Y”的自述：
//
//吟游诗人“Y”的自述：
//
//我不过是一个莽撞的探险家，一个半吊子吟游诗人，一个不谙深道的弹唱歌手。我热爱我的事业，仅此而已。可日益恶化的渐冻症却一点点吞噬着我的热情。
//
//我在梦境中幻想自己在天堂漫无目的地游荡，然后失足落入了地狱的碎片。等我清醒过来，自己已身处缤纷的花丛之中。
//
//我起初以为那只是一场梦境。但随后我意识到那并非一梦华胥，一切都是真实可感的：翠绿的草丛，五彩的鲜花，温暖的阳光——我不知道它从何方照来，我根本看不见太阳的身影。洁白的墙壁和穹顶占据了视野，在缺口处蹦出一角蓝天，空中有丝丝缕缕白云飘过。在更远处，树影摇曳，火红的枫叶从树梢飘落……
//
//仿佛心脏中有一座小小的火山，一股直觉上的热情喷薄欲出。它驱使我穿过花丛，走到下一个房间。直到我惊奇地发现，炽热的岩浆正在洁净的泳池中翻滚，丝毫没有冷却的迹象，方开始驻足凝思。
//
//我伸出右手，摘下一朵花儿，可当她脱离茎叶的瞬间，生命的活力便黯然褪去，花瓣萎蔫下来，旋即化作了熔融的浆水，滴落、消失在土壤里——我感觉不到烫。
//
//我又走到泳池边，把左手伸入炙灼的岩浆。撕心裂肺的烧灼之痛从指尖传遍全身，仿佛熔岩在向闯入者发出强烈的抗议；但我喜欢这种感受，它唤醒了我麻木已久的神经。尽管现实中我已行将就木，在这般梦境中我却保有自由之躯。许久，我将手拿出。熔岩包裹着我的手，很快凝固在风中，然后风化作无数细小的粉末。我的左手完好如初。
//
//我以为，一切不过是大梦一场——也正如此，我才会忘却对熔岩与死亡的恐惧。正当这样想时，一阵若隐若现的钢琴声流入我的双耳。我尝试循着琴声的方向走去。
//
//在无尽的白墙、鲜花与泳池组成的迷宫里，我似乎迷失了方向。嘶嘶作响的熔岩声从左耳进入，撞上了从右耳钻进的钢琴声，在我脑中交织，仿佛融合成一个声音——“这并非梦境”。宛如每个细胞都被激发了一般，循着音乐，我沿着狭窄的池边，迈步向前——只因我不忍践踏那青绿与芬芳。我已经太久未走过路了，起初的每一步都摇摇晃晃，数次几近落入熔岩之中。忍不住驻足，我的注意得以被乐声夺去。指尖随音乐起舞；口中喃喃自语，那正是乐曲的名字—— 《热情》
//"Appassionata"
// 。
//
//
//
//教会我吉他弹唱的先生，同样是个钢琴的好手，在我落入这昏黄的地狱前便已不在人世。那时我还是个健全的少年；先生已年逾古稀，腿脚不便。每次上课之前，我总是早早地来到他的家门口，静坐等待。几年里，我听过了他指下的无数乐章，可弹奏最多的，还是这首《热情》奏鸣曲。我幻想他的双手在琴键上奔跑跳跃，仿佛两个欢快的小人儿，不必受病痛的禁锢与束缚，自由自在，尽情挥洒着热情。我曾习以为常之物，现在却求而不得了。
//
//
//
//一路向前，我逐渐找回了久违的步伐感。琴声逐渐增强；岩浆开始逐渐摆脱泳池壁的束缚，擅自地流溢而出，填满了许多坑洼，引燃了鲜花与芳草。花朵在烈火中熔化，滴落，浆液汇聚成溪流，流向岩浆池中，化作一缕轻烟，归于虚无。但与此同时，更多的鲜花争相绽放，丝毫不屈服于炽焰的威严。白色的墙壁与穹顶在坍塌、萎缩，大片的蓝天显露出来。我感受到了风的气息，夹杂着烈火的焚香、树叶的清香、花朵的芳香，充盈了每个嗅觉细胞的感受器。这是我的梦中也不曾遇见的场景。我已经忘记了自我，忘记了一切，奔走于自己的思维之中，携着那份永不熄灭的热情。
//
//我以为能够无休无止地奔跑下去，直至……我到达了花海的尽头。钢琴每一个和弦都直击我的心弦，前方是一片无垠的岩浆海洋，海水——不，熔岩——沸腾翻滚着，随着琴声的节拍律动。抬头望去，天空寥廓无边，云彩横贯天际。在靠近海面的地方，云朵和天空一同被染成了橙红色，仿佛绚烂的晚霞。灼热的海风拂面而来，花海在风中摇曳，纵使有些萎蔫，依然保持坚挺。原以为海岸上会燃起熊熊大火，可激烈的争逐到这里却只是温和的共生。熔岩拍打着岸边，溅射到绽放的花瓣上，然后轻轻滑落，滴入土壤，流回岩浆海中。
//
//极目远眺，在海与天的交接处，有一座小小的平台，一架三角钢琴优雅地坐落其上。一个模糊的人影坐在琴前，忘我地演奏着。我幻想她的双手在黑白键之间奔跑跳跃，像极了我记忆中的虚影。她的身影很瘦弱，演绎出的曲调却那般扣人心弦，时而铿锵有力，时而轻柔绵软，时而行云流水，时而颗粒分明。熔岩汇就的海浪在奔涌，翻腾，仿佛我心脏中的血液，热情不息，血流不止。我看不清她的面庞，但她想表达的一切，已悉数流露在了响彻层级的乐声里。
//
//终于，在落下最后一个重音后，一曲终了。熔岩停止了翻涌，鲜花放弃了绽放。她悄然起立，转过身去，轻灵地跃入岩浆海洋之中，化作灰烬凋零。
//
//
//
//我快步追上去，未及多想，奔向炽热的熔岩之中。火红的血泪却在我踏入的那刻干涸、凝固，化作黑色的玄武岩，永远被定格、禁锢在了原地。我踏着这坚实的凝固之海向前继续跑去，想到达那架钢琴跟前——那里或许是层级的出口。可是，我的双腿却随着熔岩一起逐渐凝固，步伐一点点地放慢下来，最终再也无法向前一步，栽倒在钢琴前。在倒地前，我艰难地回过头去，看向身后的花海，希望有朝一日，花丛会蔓延到我的脚下。但我所见到的一切却只是一派绝望的景象：花瓣萎蔫，凋零，化作黑炭，化作粉尘飘散；芳草褪色，枯死，化作熔浆，化作液滴流失。仿佛这一切只是个梦境般，我的幻想凋零，我的意识飘散，我的热情凝固——我心不甘！
//
//Lavasea
//隐约间，身下早已凝结的大地蠢蠢欲动。热能源源不断地注入我冰冷的躯体，注入我凝固的血液，注入我冻结的神经。寒冷坚硬的玄武岩开裂、崩坏，热血般奔涌的岩浆冲出地面，冲刷着我的身躯。我已然与熔岩融为一体。我体内的每一滴血液，都将化作翻滚的岩浆；我体表的每一寸肌肤，都将绽出缤纷的花卉；我心中的每一分热情，都将成为不竭的源泉……
//
//
//
//
//
//
//
//
//
//
//于是我在家中醒来。
//
//
//
//
//
//
//
//我坐在轮椅上，望向大海，夕阳洒满了海滩。水面波光粼粼，很讨人喜；虚幻缥缈，却
//如同散落的金币般，引人跃跃欲试。
//
//
//
//
//
//我从轮椅上站起，奔向大海。
//
//
//
//
//
//
//
//
//
//跌倒在海浪中，烈火灼烧般的疼痛感涌上心头。
//
//
//
//
//
//
//
//
//
//作者信息
//« Level C-598 | Level C-599 | Level C-600 »
//
//Footnotes
//1. Sonata No. 23 in F Minor, Op. 57 "Appassionata": III. Allegro, ma non troppo - Presto.
//2. 或许人们永远也不会知道它的真实成分。
//3. 位于前厅美国马萨诸塞州波士顿，世界知名音乐学院之一。
//4. 这种转变通常是违反物理规律的无缝过渡。下Level 370同。
//5. 本人不愿透露姓名，故用姓氏首字母代替。
package lvls15x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1599{}