//Level C-525
//评分: 
//+3
//+
//–
//X
// 
//
//生存难度：
//等级 2
//
// 
// 
//环境伤害
//Level C-525是后室C层群的第525层。
//
//描述
//%E5%BF%83%E4%B8%AD%E6%83%85%E7%AE%A1%E9%A3%8E%E7%90%B4.jpg%21d
//那台管风琴，会一直演奏135和弦，音管不在照片内，可以从椅子的反光看到三个光源。由M.E.G.探员Yourg拍摄。
//
//Level C-525由两个大小不定的类教堂房间组成，并带有一个侧厅，Level C-525的空间具有非欧性，前厅1联通着每一个主厅，而主厅大部分空间正常2。
//
//主厅有无数个，每个来到Level C-525的流浪者都有自己专属的主厅，走进前厅的门能到达自己的主厅，主厅总是只有一人。主厅摆放着各种流浪者在进入后室前所听过发出乐声的乐器，所有乐器均可正常演奏。
//
//Level C-525的大小由层级内的乐器件数决定，但所有流浪者的主厅都有一架管风琴，即使流浪者在进入后室前从未听到过管风琴的声音。
//
//本层会对流浪者造成持续的损伤，具体方式是流浪者听到管风琴持续演奏的1353和弦后造成精神损伤。表现为焦躁、烦闷、不安；在持续被和弦影响半个小时后，流浪者会神志不清、视觉模糊，这时应尽快离开Level C-525;在被和弦影响一个小时后流浪者会完全丧失理智并在一段时间后失去行动能力，成为“和声雕塑”，目前在管风琴的两旁有七座和声雕塑。
//因此，M.E.G.建议各位流浪者携带隔音设备或寂静汁液进入Level C-525以隔绝噪音、避免伤害。
//
//每个主厅内只有管风琴的样式与和声雕塑数目一致，其他同种乐器的外观、数量都会有所差异。而且如果流浪者在进入后室前有演奏某一乐器的经历，在该种乐器的上方大约50厘米出会有凭空出现的光照射在该乐器上，管风琴上方一定有三束光照射。
//
//- 收起
//本介绍由M.E.G.探员Yourg撰写、整理
//
//三层键盘、72个音栓，综合音色判断与德国管风琴相似。大约高14.2米、2.7米宽，有7根音管已损坏。找不到风箱，音栓正常，键盘的135键被固定无法弹起，可能因此才一直发出声响。
//管风琴最中间的音管有刻印签名Achen4，似乎原产于前厅5。尝试破坏，无果。推测管风琴无法通过简单的物理损伤破环。
//
//“和声雕塑”由流浪者转化而来，因为本层主厅的单人性质，所以对于转化过程没有记录。和声雕塑的外观与流浪者生前一样，但姿势固定为微微弯腰、双手交叉紧贴胸前、眼睛闭合、嘴中小声念《圣经》，声音无法打断。
//雕塑与管风琴一样无法通过简单的物理手段摧毁。而且因为未知原因，雕塑甚至能自主行动，平均每三天移动一米，直到移至管风琴旁。
//
//关于侧厅
//在Level C-525中摆放的一件大型乐器6后会出现一条通道通往侧厅。进入侧厅需要流浪者闭眼并心中感谢管风琴，这时阻挡流浪者的乐器会自主移开。据“圣音永恒”社区提供的数据分析，侧厅每一周开放三次，通常在星期二、星期五与星期日。7
//
//侧厅内有中量资源，主要有杏仁水、寂静汁液、忆晶等，这也是大多数流浪者来到Level C-525的主要原因。不要逗留过久，在侧厅内超过20分钟就会转化成合声雕塑并出现在管风琴旁。
//
//M.E.G.对Level C-525的性质研究与猜测
//根据Level C-525对于每个流浪者展现的物品不同且只有管风琴物理性状不变的实况，我们推测那台管风琴有对流浪者的感知能力，但它对于Level C-525的呈现内容的选择动机不明。
//我们发现了“不动地块”，不动地块位于主厅四角中任意一角。“不动地块”有边界，进入“不动地块”时就像切入这里一样凭空从边界出现。在“不动地块”内，单人性质消失且能互相交互。我们推测，主厅的一角都重叠在这个“不动地块”之上，所以流浪者能在此区域内交互。这也几乎确证了Level C-525的非欧性。
//对于侧厅的物品，我们推测性质大概与教会施舍穷人一致。管风琴可能有“唯一神”的扮演行为，动机未知。
//鉴于管风琴以及和声雕塑的一致性，我们猜测管风琴附近区域也是主厅重叠的地方。但由于未知原因，在这里流浪者无法交互。
//对于和声雕塑的研究发现，雕塑能被全体在Level C-525的流浪者看见，与管风琴一致。目前无法解释。
//基地与社区
//“圣乐永恒”社区
//由7名热心的音乐家组成，据点在“不动地块”，因此能为所有进入Level C-525的流浪者提供帮助。
//有偿提供隔音耳罩，切出前需要归还。
//提供交易，高价收购寂静汁液。
//每周对管风琴“朝圣”一次，流浪者可以加入。
//Level C-525探索记录
//- 收起
//以下记录由M.E.G.探员提供
//Yourg:好了吗，确认这是一个新的层级了吧。
//
//Mithe:是的，这是一个全新的层级。这里真是空荡荡的啊。
//
//Yourg:有扇门，先过去看看吧…一切正常，准备走入。
//
//Mithe:你！你！你消失了！（向前扑，准备抓住yourg）
//
//[两人站在正厅里，看不到对方]
//
//（对着对讲机）Yourg:通讯还能正常经行，走过同一扇门却到了不同空间吧。之后要研究这层是否拥有非欧性——天哪！（抬头看到满房间的乐器）这里…全是乐器。
//
//Mithe:尽头的管风琴似乎一直在发出声音，让我有些不安啊。
//
//Yourg:看来这里不能久待，快速调查吧。
//
//Mithe:既然我们不在一个房间，应该就有不同的东西，你那里都有什么乐器？
//
//[两人描述了乐器]
//
//Yourg:Mithe，我有些头晕，所以你那边没有骨笛是吗？
//
//Mithe:原来世上有“骨笛”这种乐器啊，从没听过。
//
//Yourg:等等，你没听过骨笛的声音，你的房间就没有骨笛…我猜，这个层级会把你听过的所有乐器放在这里，这的乐器我全都听到过。我这的钢琴和长笛上还有一束光源不明的光照射着，可能因为我曾演奏过它们。
//
//Mithe:Yourg，我觉得我的精神状态更差了，我们先撤吧。
//记录结束。
//
//- 收起
//- 收起
//以下记录由流浪者提供
//对于我如何进入侧厅的事吗？好吧，我是从Level 105来的，在礼拜堂里无面灵将我视为威胁。在被葡萄汁淹没时我切出了，就来到了这里。
//
//在进入主厅后我感谢了后室与那台管风琴带我到了一个安全的地方而不会被那些无面灵谋杀。之后一台钢琴就自己移开，露出了后面的道路，我便进去探索。之后的事你们都知道了。
//[之后将方法分享给更多流浪者，确认了方法有效，Level C-525的确比较有价值]
//记录结束。
//
//- 收起
//- 收起
//以下采访记录由M.E.G.提供
//流浪者:现在那些雕塑里有3个是我的朋友（抽泣）。
//
//人员A:对于你的遭遇我们也非常伤心，能具体说说他们变成和声雕塑的经过吗？
//
//流浪者:好吧，我们当时在侧厅，我在那呆了12分钟左右就已经头疼眼花了。我便走出了侧厅，我也劝我的同伴们赶快离开，但他们拒绝了我、继续搜集。大概5分钟，对讲机里就再没有他们的声音了，我只好自己率先切出。
//
//人员A:我们只知道管风琴的声音有负面影响，没想到影响这么大。
//
//流浪者:没错，之后几天我尝试重新切入Level C-525，回去时几座雕塑都不在原来的位置了，它们会移动！
//
//人员A:没错，在之后数天内，流浪者报上的雕塑位置都不一致。
//[流浪者之后在桌上趴着，情绪不稳定。之后的数次关于和声雕塑的记录都十分相似。]
//记录结束。
//
//- 收起
//入口与出口
//入口
//在Level C-17中如有乐器，紧贴着乐器切出即可来到Level C-525。
//在Level C-141的钢琴上弹奏一曲，再进行切出有概率来到Level C-525。
//在Level 11的教堂切出会来到Level C-525。
//在Level 105内切出有一定概率来到Level C-5258。
//出口
//只需在管风琴上按下对应的音栓就可以去到对应层级，即Level C-1~72。
//直接切出会去到Level C-141。
//试图原路返回前厅9会去到Level 11。
//作者信息
//
//« Level C-524 | Level C-525 | Level C-526 »
//
//Footnotes
//1. 只是Level C-525的前厅而已，流浪者无法通过这里回到“前厅”
//2. 相对前厅而言，即不具备非欧性，但有部分地区非欧性明显如“不动地块”、和声雕塑附近与管风琴附近
//3. 即Do\Mi\So
//4. 第一座装上管风琴的教堂名，位于德国，中译名“亚琛”
//5. 真正前厅，不是层级内的前厅
//6. 通常是钢琴、竖琴、低音提琴
//7. 也有出现在其他四天的记录，仅3例
//8. 但似乎不能加入无面灵的礼拜，我们没有获得礼拜后再进入Level C-525的记录，可能因为对别的“神”礼拜威胁了管风琴的“唯一神”地位
//9. 也只是Level C-525的前厅而已
package lvls15x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1525{}