//Level C-503
//评分: 
//+6
//+
//–
//X
// 
//
//生存难度：
// 
// 
// 
//Level C-503是后室C层群的第503层。
//
//描述
//
//0a78214cccdc5cc8.jpg
//Level C-503的一张照片
//
//Level C-503是一间仅有一百平方米的，充斥着灰烟雾的光线较暗的黑色正长方形混凝土房间,房间墙壁上有较少的裂痕，房间高约三米，沿墙边行走可寻得一可随意开关的黑色木门，房间中有多处竖立的钢筋，将房间分成大小不同的区块，但这些区块并无什么异常，灰雾中散有PM2.5，且此层空气中混有不知名酸性物质。
//
//值得注意的是此层级的时间流速与其他层级相比较快，这将造成逗留在此层的流浪者衰老的加速。
//
//因灰色烟雾的存在，此层级能见度不足4米，经M.E.G.完全勘探发现，此层级不存在任何实体，且此层级最多只能同时存在7名人类，在房间正中央处有一与房间融为一体的被黑色高密珍珠绒覆盖的高约半米的高台，台上置有一小巧黑金天平，一红水晶砝码，一装有金色墨水的墨水瓶，一支中世纪西欧贵族式的羽毛笔以及一深灰色笔记本。
//
//经M.E.G.专家分析研究，灰雾中含有不知名镇定物质，可令人镇静去躁。黑金天平会不时发出一闪而过的金色光芒，吸引流浪者接近天平。值得注意的是，当流浪者拿起笔记本并翻开到第一页，流浪者将在笔记本第一页见到一段用血红色墨水书写的英文，内容大致是“将欲望写于本上，将砝码置于天平之上，付出同等的代价，实现欲望…”据M.E.G.对高台上物品的研究，高台上黑色高密度珍珠绒不可取下，高台上的物品均不可带出此层级，若尝试将物品带出，物品将不知因何原因而回到高台上，从视觉上看，笔记本是极薄的，但不知为何原因，笔记本无法翻到尽头。
//
//经M.E.G.多次实验结论所得，若按照笔记本上的字行动，用羽毛笔沾取金色墨水将自己的欲望写于笔记本上后，将红水晶砝码放在天平之上，天平将先向砝码一侧倾斜，再逐渐回到平衡状态，写在笔记本上的欲望将会实现，但与此同时，书写欲望的人也会付出相应的代价，代价的程度，与欲望的大小成正比。如，在笔记本上写下得到一瓶杏仁水，将会以身上的某一样物资作为代价。值得注意的是，无法通过本层的特殊性质而离开后室。
//
//M.E.G.科研人员认为，似乎高台上的物品才是此层级的主体，此层级的所有效果似乎都因高台上的物品产生，而房间是为了承载这些物品而存在。
//
//以下为M.E.G.对此层的实验记录。
//
//- 点击收起记录1
//M.E.G.实验记录
//
//记录一
//
//时间:2018年7月*日
//
//实验对象:志愿流浪者
//
//记录内容:一位自称志愿的流浪者在M.E.G工作人员的监督下按照M.E.G.实验人员的要求背上装有驱笑剂的背包来到高台前，在笔记本上写下"得到一瓶杏仁水"，并将砝码放置于天平一侧，天平向砝码方向倾斜后恢复平衡状态，笔记本上的字迹渐渐消失，类似渗入笔记本1，灰雾短暂变浓后恢复正常，随即M.E.G.工作人员于房间地板上找到一瓶杏仁水，流浪者发现背包中的一瓶驱笑剂消失，流浪者与M.E.G.工作人员依次离开此层级，实验结束。
//
//总结结论:可以通过此层级付出同等代价实现想法。M.E.G.高层决定将此层级暂时设定为物资转换站，直至2019年第三次实验后取消转换站。
//
//生存难度设置为0。
//
//- 点击收起记录1
//- 点击收起记录2
//记录二
//
//时间:2018年9月*日
//
//实验对象:一位代号为"亡秋"的M.E.G.工作人员
//
//记录内容:"亡秋"在另外两名工作人员的监督下，在笔记本上写下"离开后室",并将砝码放于天平上，天平向砝码方向倾斜后归于平衡，"亡秋"并未如预期效果离开后室，但"亡秋"因未知原因倒地，由另外两名工作人员抬着离开此层级。"亡秋"身体似乎并未发生任何变化，但"亡秋"在实验后的口述中提到，当天平平衡时，他只觉得头晕与恶心，并伴随着注意力无法集中，这种状态持续到一直离开此层级，他表示不想再次体验这种感受，在之后的研究观察中发现，"亡秋"对于来到此层级产生了类似应激的反应。在实验后的层级勘测中发现，墙壁上出现了一条并不明显的丝微裂缝，笔记本颜色略微变淡，M.E.G.想通过此层级离开后室的计划并未实现，实验结束。
//
//总结结论:无法依靠此层级离开后室，且似乎妄图通过此层级离开后室会使此层的墙壁产生裂纹。
//
//- 点击收起记录2
//- 点击收起记录3
//记录三
//
//时间:2019年1月*日
//
//实验对象:一位流浪者
//
//记录内容:流浪者在M.E.G工作人员监督下，其精神崩溃，并未按照原定计划书写“得到热武器”，而写下“拥有谁都无法超越的力量”并将砝码置于天平上，天平向砝码方向倾斜，较长时间后恢复平衡状态，流浪者开始疯狂的大笑，随即其肌肉迅速膨胀，头上长出类似盘羊的犄角，体型快速变大，皮肤变成深红色，M.E.G.工作人员对其进行枪击以阻止事情向不可控发展，但枪击并未对流浪者的变化产生影响，当子弹接触流浪者，子弹被硬化的皮肤反弹，变化后的流浪者被工作人员发射的子弹激怒，将工作人员所持的枪击飞，用双手将两位M.E.G.工作人员抓住，并发出诡异的非人笑声，并死死盯着其中一位工作人员，双目缓慢流下两行暗红粘稠的血泪，当流浪者欲将M.E.G.工作人员致于死地时，流浪者突然浑身抽搐，七窍流血，暴毙身亡，在其死亡后，从尸体的口中飘出黑色烟雾并凝聚成骷髅头的形状，随后溢散在灰雾中2，实验中止。
//
//生存难度被更改为未分级。
//
//- 点击收起记录3
//
//M.E.G高层现已将实验彻底封禁
//- 愿你能听进
//“不要沉迷于自己的欲望”
//
//-M.E.G.致流浪者
//
//基地，前哨站与社区
//
//此层级暂无任何基地。
//
//入口与出口
//
//入口
//
//在Level 270的任意一个悬崖将会随机出现一扇黑色木门，推开木门并进入便可切入此层级。除此之外，流浪者将会在Level C-41的荒木林中找到一扇黑色的门，进入此门便可切入此层。
//
//出口
//
//从木门走出，即可切入Level C-304，愿你走出欲望，流浪者。
//
//+ 作者信息
//Footnotes
//1. 经M.E.G.工作人员实验后的检查，笔记本的颜色略微变深，且墙壁上一处裂纹消失
//2. 流浪者尸体已被M.E.G.回收
package lvls15x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1503{}