//Level C-501
//评分: 
//+12
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//lakes1
//湖泊上笼罩着浓雾。
//
//Level C-501是后室C层群的第501层。
//
//描述
//Level C-501是一处较为封闭的天然洼地，大部分面积是一片平静的湖泊。这里一直笼罩在浓雾下，不会有昼夜变化和天气变化。没有任何可见的生物和实体，在湖泊中心有一幢位于湖心岛屿上的两层房屋，但似乎因为久置不用而陈旧倒塌。虽然整个层级空间较大，但实际上可探索区域因浓雾限制而无法前往，且绝大多数区域均无任何有意义的地标。
//
//确信存在至少一条入湖河流不断向湖泊带来大量的泥沙和沉积物，但实际找到水源的尝试都会被浓雾阻碍。目前湖泊北面随着沉寂逐渐淤浅，连接至东北方向形成一片沼泽；尽管没有可见的太阳和任何明确的光源，但整个湖岸都较为湿热沉闷，且湖盆开始逐渐被沉积物覆盖，导致整个湖泊正在不断的变浅和收缩。曾有一条从岸边通往湖心岛的小径，但随着水位上升而被淹没在水底，岸边停靠着两艘木舟，也已长满苔藓和藤蔓。
//
//在这一层级内会听到听到一段低分贝且使人烦躁的噪音，类似于耳鸣和异物阻塞耳道的情况，这股声音仅在靠近湖泊的地方才有所缓解，且会随着逐渐深入湖泊而逐渐消失。一部分流浪者确信，这声音可能与他们此刻心中的郁闷和纠结情绪有关。
//
//几乎所有流浪者来到这一层级后都声称他们曾来过这片湖泊，但和之前记忆中的模样并不相同，不同处大部分指笼罩着整片湖泊的浓雾，这时常使他们觉得这片浓雾也同时笼罩着他们的内心；也有一小部分流浪者指出，由于不断从外界向这片湖输送大量的泥沙形成沉积且没有其它分流和出口下切，导致这片湖正在以一种几乎无法察觉的速度逐渐消失。
//
//在湖心岛房屋旁有一个被虫蛀严重的大型树洞，腐烂在其内部形成了一个较大的空间，一些流浪者会专程到达这一层级向树洞宣泄情绪和分享真心话，这在一定程度上缓解了流浪者的负面情绪。对着树洞大声说出一些事情时，相关的信息会在树洞内生成刻痕和书信，但多数字迹均被水渍晕染而无法辨识，其中部分可辨识的部分内容如下：
//
//片段1
//我突然想起来很久以前那件事，我已经忘了来龙去脉，但我还是记忆犹新。我不知道为什么我要去做那个举动。我知道我让别人难堪了，我知道我这么做对我对他都没有好处，我知道我其实并不占理，但我还是做了。
//
//我很后悔。
//
//片段2
//我不明白。
//
//为什么他要突然离开我？为什么他不遵守诺言？为什么他要让我这么难过，让我无法忘记他？为什么他不在我身边？为什么他不在我流泪的时候抱抱我？为什么他要丢下我一个人？为什么他要眼睁睁看着我这么难受？为什么？为什么？为什么？为什么？为什么？为什么？
//
//…
//
//为什么他就这么死了。
//
//片段3
//好累。
//
//…对不起。
//
//片段4
//我知道我还要没有完成的事情要做，还有没见到的人要见，还有太多的地方没有去过。但我好想永远凝滞在这一刻，我可以不用顾忌队伍生存实体层级所有的一切，就这样安安静静的坐在湖边，吹着微风，看着湖面的涟漪，浓雾不断带来水汽，土腥味笼罩着我，我只是这样静静的待着，偶尔躺下来看看云。
//
//可生活还得继续。
//
//片段5
//我小时候有一个要好的朋友，有一天我们在一起捉迷藏，他躲我捉。
//
//我到现在都没有捉到他。
//
//片段6
//有时候不知道为什么，突然心里就会感觉到难受。
//
//这个难受不是因为我做过些什么，不是因为我遭遇了某些事情，也不是因为某个人。天边突然飘来了一片乌云，细雨淅淅沥沥，湖泊上又起了浓雾。这是一种没有缘由的难过，我也不指代该怎么描述。我感觉眼前熟悉的事物开始变得陌生，感觉和记忆里的场景有所偏差，这里所有的一切都在改变，除了我。
//
//我不知为何突然来到这片湖泊，但我看到不断涌入不属于他的泥沙在这里沉积，水位逐渐降低使得自己向别人暴露得更多，沼泽不断侵蚀着湖盆，而湖水也不断地流走——湖泊正在不断消亡。我很难过，但我不能表现出来，因为这是我的事，不应影响了别人。湖水也不会向别人述说自己的消失。
//
//我能感受到湖也在为自己伤心着。
//
//
//
//流浪者对于树洞说完话后心中默念：“让我忘了这一切吧”，之后流浪者会被送离这一层级，多数情况是回到进入这一层级前的位置，少数情况下流浪者会被送往Level 0，且该流浪者会在之后的一段时间内暂时忘记此前对着树洞说过的内容及其相关记忆，但总会在某个时间段突然回忆起所有事情，且总是在不久后再次被送往这一层级。
//身处这一层级的流浪者有时候会突然感觉到伤心，其原因大多是突然想起来此前干过的某件尴尬或遗憾的经历，这些遭遇相关的记忆会开始在脑内不断的反复出现，导致流浪者总是陷入一种持续性的自责和无奈当中，以至于难以在此长久逗留。也有一小部分流浪者会无缘无故的伤心起来，并没有一个明确的迁怒对象和过往记忆，并迫使他们开始做出各种异常举动，例如：大喊大叫、用手大力地拍打自己、持续反复地使劲敲击某个地方、猛地甩头、双手握拳咬紧牙关、默默流泪或对着湖面倒影自言自语……这些情况总是没有征兆突然发生的，也可能是因为这一部分流浪者已经无法回忆起那个令他伤心的事情，只有情绪仍然影响着他。
//
//基地、前哨与社区
//曾有流浪者在此尝试建立社区，但均由于各种私人原因而被迫中止。
//
//入口与出口
//入口
//因过往的某事伤心到无法自已；
//躲在一个密闭空间内独自流泪；
//抗精神疾病药物摄入过量而出现一系列症状；
//尝试自我了断；
//在Level 0对着墙上一副深蓝色画幅默念：“我心里的一块伤心地”；
//因以上情况导致昏迷后，均会发现在醒来时到达这一层级。
//
//出口
//选择暂时遗忘并回到来时的位置或邻近层级，忘掉这一切，或-
//….与自己和解。
package lvls15x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1501{}