//Level C-550
//评分: 
//+28
//+
//–
//X
// 
//
//生存难度：
//等级 变化
//
//特定时期安全
//不稳定
//未知实体
//Level C-550是后室C层群的第550层。它整体上看是一个贴近广袤海域的小型港口。
//
//描述
//jifenggang1
//Level C-550 清晨时的一张照片，由灯塔的驻留人员拍摄。
//
//Level C-550由占地面积约165平方公里的港口及无法观测到边界的广阔海域组成。该层级的气候与前厅中的热带季风气候极其相似，经常遭到热带气旋的侵袭。相比于前厅中易遭受台风侵害的沿海城市，Level C-550遭受台风侵袭的频率与烈度要明显更高，并且台风持续的时间正在逐渐延长，这使得Level C-550已经越来越不适合居住，即使是进行短时间的资源开采也较为危险。根据不同时间段的气候特点，可分为温和季，雨季，台风季，浓雾季，寒冬季1，该层级仅在温和季能较为安全的进行资源开采、探索海域等工作。
//
//在该区域的水域中，有着极其丰富的物产，包括诸多前厅中存在的常见海洋鱼类、可燃冰、以及埋藏在海底的金属矿脉等。相当多的流浪者会在温和季来到该层级进行资源的收集工作，并在天气变得恶劣之前离开。在M.E.G.发现该层级之前，便有数量众多的流浪者在此定居，近海的诸多建筑物便是由这些流浪者所建造2。但在该层级的气候变得恶劣之后，大多数流浪者选择离开Level C-550，目前仅有一个小型的原住民组织长时间驻留于此。
//
//迄今为止，在该层级未发现任何实体，仅有少数留存于该地区的航行日志提到过在海域的偏远地带有一座小岛，在小岛上船员们目击到了一个被钉在十字架上的不明实体3。
//
//_
//+ 展开航行日志一- 隐藏
//07/07/1982
//今天我们朝向上次发现的岛屿航行，那里有着丰富的热带水果，但是我们已经很累了。
//
//离雨季只有不足两周了，我们能安全回去么？
//
//总之，大家都很疲劳，我们已经在海里不眠不休捕鱼一个月了，捕到近海下网都捞不上来鱼了。
//
//为何船长如此贪婪？还要跑到这里来采水果，敢情他只要坐在椅子上发号施令，可不知道顶着大太阳干活的我们的感受呀。
//
//_
//+ 展开航行日志二- 隐藏
//09/09/1982
//航行很顺利，我们比预期要早到达这个小岛，这让大家都稍稍安心了。
//
//我们预计明天登岛采集水果，希望一切顺利。
//
//大家只想着赶紧干完活拿了钱赶紧回去。上一批船到达这个岛是两个月前，不得不说这个地方真是神奇，各种食物好像取之不尽一样，仅仅两个个月就能长出这么多新鲜的水果。
//
//我还记得我小时候这里人还不是很多，港口那边也只停着几艘本地居民的小船。现在在这里的人越来越多，大家都来争先打捞水产，甚至还计划派人潜水下去找寻那些矿石。
//
//这里比以前热闹许多了，但是生活却比以前累了，不知道这是好事是坏事。换做以前只是打打鱼虽然能养活自己，但是可是住不起坚固的砖瓦房，现在这些外面的人过来带来了很多材料，不得不说，虽然累了点，但是生活确实好了很多。
//
//_
//+ 展开航行日志三- 隐藏
//10/09/1982
//我们的计划泡汤了，这里所有的果树全部枯萎了，不敢想象我们一个月前还在这里摘过水果！
//
//大家都人心惶惶，有一些迷信的船员说这是凶兆，请求船长赶紧回去。
//
//船长却说明天要去岛的另一侧看看有没有水果，他简直是疯了！我和几个船员计划着如果事情不妙，就一起搭之前放在岛上的小船回去，这个地方不对劲，我的直觉告诉我不能在这里久留。
//
//_
//+ 展开航行日志四- 隐藏
//13/09/1982
//大部分的文本被完全涂黑，仅在日志的末尾有一句话。
//
//我们做了错误的决定。
//
//_
//+ 展开航行日志五- 隐藏
//27/09/1982
//船长他做了错误的决定，因此他被那个东西留下了。
//
//我不知道我们能不能逃过一劫，但我知道只要那个东西还在这个层级，这个地方就完蛋了。
//
//和我一起的同伴跟我说，一定是船长的贪婪引发了神罚，我不知道有没有什么神罚，或许他说的对，但为什么只惩罚了船长一个人？
//
//_
//+ 展开航行日志六- 隐藏
//sishen
//画作下方用歪歪扭扭的文字写下了该画作的名称。
//福音
//气候变化
//温和季
//- 收起生存难度信息
// 
//
//生存难度：
// 
// 
// 
//wenheji
//温和季时Level C-550港口的照片，由来此旅行的的流浪者拍摄。
//
//温和季是Level C-550中气候最适宜生存及探索的季节。在温和季，Level C-550的天气会保持晴朗，海面的风力等级小于一级4，气温稳定在25至35度之间，湿度一般不超过80%。在该季节流浪者可以较为安全的进行探索、资源收集工作，海洋中丰富的物产可以确保流浪者在该层级定居时的资源需求。根据该层级灯塔中遗留的资料，曾经有非常多的流浪者在Level C-550中定居，他们在温和季进行捕猎，利用获取的资源度过其他不适合外出或危险的季节。
//
//从1983年开始，温和季的持续时间在逐渐下降，这种现象的原因目前仍不明确。根据统计，温和季在1983年前的平均时间为140天，而现在已经不足90天。温和季持续时间的下降导致了台风季时间的延长和寒冬季的出现，这两种季节都不适宜流浪者的生存及探索，因此在该层级定居的流浪者相比于1983年前已经大幅减少。M.E.G.正试图探究该层级气候变化的原因，但由于缺乏专业化的设备且该层级可供探索的时间减少，该项研究的进展仍然十分缓慢。
//
//雨季
//- 收起生存难度信息
// 
//
//生存难度：
//等级 2
//
//不安全
//稳定
//实体绝迹jifenggang2
//Level C-550进入雨季时的照片，拍摄人员未知。
//
//雨季是Level C-550中温和季与台风季的过渡季节。该季节会维持一至两个月，Level C-550中会保持5毫米至25毫米左右的降雨量5，温度维持在28-32摄氏度，层级内的湿度会提升至85%以上。
//
//在雨季时，Level C-550中的海面风力等级会逐渐上升，根据海面风力等级可大致判断台风季到来的时间。一般而言，在雨季开始时Level C-550中海面的风力等级维持在二级到三级之间，并且在两至三周内逐渐攀升到十级至十一级风，之后便在该风力等级下维持数天后进入台风季。在风力等级攀升的阶段，也偶遇雷暴、雷阵雨天气，同时风力等级的攀升也是非线性的，在以往的记录中有三次风力等级在一天内由四级风升到十一级风的记录6。
//
//雨季时大部分流浪者会开始选择离开Level C-550或开始对于自己的居所进行加固，也有一些流浪者选择仍在近海处收集资源。但近几年的报告指出雨季的持续时间越来越短，风力等级攀升的速度越来越快，因此M.E.G.已将该季节的生存难度提升为2，并且劝导久居于此地的流浪者们在该季节尽量不要出海。
//
//台风季
//- 收起生存难度信息
// 
//
//生存难度：
//等级 5e - 环境危害
//
//不安全
//不稳定
//飓风危害taifengji
//台风季时Level C-550海面的照片，由留守该层级的人员拍摄。
//
//Level C-550的雨季结束后便会进入台风季。台风季和雨季的典型区别便是海面的风力等级到达十二级7，海面上有时可观测到巨型的水龙卷，同时，在该季节的24小时降雨量会达到250毫米以上8，雷暴与雷阵雨的天气也经常出现。台风季时Level C-550的气温会降至25-28摄氏度，空气中的湿度也会到达峰值。
//
//通常在雨季到来的初期，当地的居民与留守于此M.E.G.人员会将港口封闭并要求所有的船只尽快入港避险，随后会逐步将Level C-550中的公共设施关闭，并将室外的可活动设施搬运至室内保管。在完成了上述措施后，M.E.G.和本地相对富裕的居民会提供一些生活必需品进行交易，这是进入台风季前最后一次获取生活必需品的机会。
//
//jijiebianhua
//台风季与温和季的持续天数变化情况。
//
//在进入台风季后，外出探索的行为是极其危险的，当海面的气旋到达港口及周遭地区时，在外探索的流浪者很可能会被卷入气旋之中。目前仍未有流浪者在该季节下外出仍能安全返回的记录，因此M.E.G.在台风季到来之前便会发出警告，并且要求临时来到此层级的流浪者离开。
//
//台风季的持续时间自1983年以来便不断增加，并且伴随着温和季时间的减少，这也造成了该层级宜居程度的下降。M.E.G.仍在探寻造成该现象的原因，不过由于设备和气象学研究人员的缺乏，对于该现象的研究进展进度十分缓慢。
//
//当海面的风力等级开始下降，台风季便进入了尾声，整个过程大约持续三到五天。当海面的风力等级降至零级，海面上可观测到雾后，Level C-550便进入浓雾季。
//
//浓雾季
//- 收起生存难度信息
// 
//
//生存难度：
// 
// 
// 
//frost
//浓雾季开始时雾气从海岸开始扩散的景象。
//
//浓雾季是在台风季后出现的持续时间较短的一个季节。该季节的典型特征为在海平面出现浓雾，并逐渐向港口与陆地扩散。该季节一般持续两到三周，并且在季中时室外的可见度到达最低值9。浓雾季时Level C-550的温度进一步降低，维持在15-20度的水平，少数年份温度会降至10-15度；空气中的湿度维持在75%-85%。部分研究人员认为浓雾季的出现是台风季积蓄的雨水蒸发导致的，这可以解释该季节出现的温度降低、浓雾经久不散的现象，但该假说仍需进一步的验证。
//
//该季节中的Level C-550会出现诸多无法理解的现象，其中最为典型的现象为在室内窥见浓雾中有着诸多数据库中未记录的实体在港口与街道上行走，但流浪者只要来到室外环境却又无法看到这些实体。同时，在该季节探索Level C-550的流浪者至今仍未有成功返回的报告，他们目前的状态被认定为失踪，据少数报告称，有时在该层级驻守的人员会在镜子、窗户以及水面的倒影中看到这些流浪者的身影，但这些报告均难以被证实。
//
//有报告指出，该层级的原住民似乎保有了关于浓雾季的一些知识，这些知识或以传说、歌谣的方式在原住民中代代相传。不过由于该层级原住民拒绝透露更多的信息，M.E.G.无法获得更进一步的情报。但在2006年后，部分原住民在经过寒冬季后更依赖与外来人员进行冬季物资的交易，其中部分较为开放的原住民透露了一些关于浓雾季的信息，但大部分信息均为一些宗教相关的片段，似乎为当地本土宗教经文的一些片段10。
//
//- 收起
//monster
//一位M.E.G.探员在浓雾季拍摄到的窗户外的不明实体的照片。
//寒冬季
//- 收起生存难度信息
// 
//
//生存难度：
//等级 5e - 环境危害
//
//不安全
//不稳定
//低温危害winter
//寒冬季时Level C-550海面的照片，一艘渔船因为未及时回港被冻结在了海面之中。
//
//寒冬季首次出现于2006年的浓雾季之后，并在其后的每一年份出现，成为Level C-550中必然经过的一个季节。该季节的特征是相比于其他季节显著的低温，最低温度可达到-25度，在该温度下整个海面将全部结冰，无法进行航行。该季节的持续时间不等，自2006年的记录以来，最短的持续时间仅有一周，而在2021年却持续了两个月。
//
//由于在该层级的居住者大多未考虑保暖措施，因此在首次遭受寒冬季时给当地的居民以及多个流浪者组织造成了沉重的打击，有非常多的居民因为居住地较为偏远而被冻死在家中，部分留守灯塔的人员也因此丧生。
//
//目前该季节的出现原因仍然不明，但M.E.G.正在积极的帮助本地的居民及流浪者改建其房屋以应对寒冬季，包括挖掘可储藏大量物资的地窖、安装取暖用的火炉、提供厚被褥和冬衣等。
//
//在寒冬季结束后，温度将逐渐回升，Level C-550将重新回到温和季并进入新一轮的季节循环。
//
//基地、前哨与社区
//M.E.G.“远洋舰队”团队
//由约86人的团队组成，一方面在此层级进行港口、灯塔的维护工作，维持层级内的秩序；另一方面也在搜集该层级的资源。他们在港口的中心建立了一个大型的基地，在此囤积物资并进行气象学的研究。该基地对流浪者开放，在极端气候的季节也允许流浪者在此住宿。
//季风港原住民
//由约130名左右的原住民组成的团体，在经过首次寒冬季后他们将住所统一迁到了北部港口，贴近M.E.G.的基地。他们大多依靠捕鱼和种植热带水果为生，乐于与来到此层级的流浪者进行交易。但他们不欢迎流浪者来到他们的定居点，同时他们也派人驻守在他们原先的定居点。M.E.G.怀疑这些原住民隐瞒了一些关于该层级的信息，但考虑到这些原住民在帮助M.E.G.进行层级维护与改造，目前M.E.G.仍与原住民保持合作关系。
//入口与出口
//入口
//在Level 7中找到一个小型的漩涡，随着水流进入漩涡的深处可来到此层级。
//在Level 420的冰湖中前进足够远可来到处于寒冬季的该层级。
//从Level C-10的一条看不到尽头支流中可来到该层级。
//从Level C-549中找到一个灯塔模型，凝视该模型会让你在该层级的某一个灯塔醒来。
//出口
//在东部港口可找到一条废弃的公路，沿着该公路可将你带到Level C-289。
//在最北部灯塔的地下室进行切出会来到Level C-600。
//在温和季的海域寻找到一个轮船的残骸，进入其中你将来到Level 17。
//在西部港口的废墟中找到一个地窖，进入其中将来到Level C-551。
//作者信息
//« Level C-549 | Level C-550 | Level C-551 »
//
//Footnotes
//1. 该季节在1983年后出现，其出现的原因不明，从该层级遗留的气象学记录可知，该季节的出现与台风季的延长是同时开始的现象。
//2. 目前大多数建筑物因为台风侵袭已经无法居住。
//3. 由于该层级的气候逐渐恶化，目前已无法安全的探索的海域，也无法证实该日志的真实性。
//4. 即海面的风速小于3节。
//5. 此处为24小时降雨量，表明雨季中的Level C-550维持在小雨至中雨的天气情况。
//6. 分别是1983年，1994年，2021年。
//7. 目前仍未测得台风季时海面风速的峰值。
//8. 表明达到特大暴雨的天气情况。
//9. 可见度最低时不足5米。
//10. 大部分原住民提到这样的一段话：“神隐是意志的薄暮，开启真知之眼，可瞥见代行者的真容。”。
package lvls15x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1550{}