//Level C-508
//评分: 
//+19
//+
//–
//X
// 
//
//生存难度：
// 
// 
// 
//Level C-508是后室C层群的第508层。
//
//警告：该数据经过严重篡改导至内容里已不可信。任何进入此数据库的人须立即退出，严禁以任何形式查阅、传播、分享此数据库内容或是告知其他人此数据库的存在，违反者会根据情节轻重受到监禁、流放乃至当场处决的惩罚。
//“别听M.E.G.这帮混蛋扯淡，群袭已删除数据库中记录代码并且让槛存溢出，你们现在不会有人记下你的浏览记录，只要不在论坛上发表被相关字检索到都是安全的，好好看看这群家伙的所作所为！”
//
//描述：
//当前对Level C-508所知甚少：目前推测Level C-508危险性极高，因为成功进入者均未能传递任何信息且没有任何人返回。鉴于这一情况不建议任何人探索Level C-508，M.E.G.已经在Level C-508主要入口设立了监视岗哨对未经授权尝试进入的流浪者进行劝阻。
//
//“他们撒谎！这才是没有修改过的原文！
//Level C-508是由大量重复实验设施组成的大型建筑物集体。其中部分实验设施虽然对比前厅略显老旧，并且由于错误的生成方式而产生重叠或是损坏，但仍然有相当数量的实验设施可以正常运转，目前M.E.G.已成功修复其中一部分实验设施并投入使用，这些实验设施的能量供应来源不明，实验数据却完善且良好。”
//
//实体：
//Level C-508尚未记录到任何已知实体。
//“编，接着编，整层都是他们创造的扭曲怪物，生物实验室试图把各种尸体嫁接甚至用活人身体移植实体器官。其所作所为远比有识血肉激进的多，毫不夸张的说整个研究基地就是一片地狱，除了专门用来研究的少数几个地区外其他地方随意丢弃着改造后的结果，无论是死是活……”
//
//基地，前哨和社区：
//Level C-508尚未记录到任何前哨站。
//“这帮混蛋建立过数个装备齐全的研究站，但可别指望着那是寻求救护的地方！只要没有通过验证，等待你的只有充足的子弹——甚至不会把你丢在外面等死，因为这样有可能让你活下来。”
//
//入口和出口：
//入口
//目前发现到达Level C-508途径是穿过一种在周围墙体上已经长出类似血肉藤蔓的特殊门，发现的几个主要入口主要分布于Level C-408、Level C-309、Level C-273、Level C-307等地。
//“说一半真话，忘记说的另外一半是这些入口旁边都有全副武装的守卫暗哨并且会无条件射杀任何没有做出某种认证措施的人，但是认证措施究竟是什么到现在也没找出来。”
//
//出口
//未知。
//
//- 别忘记自己立下的誓言
//
//这是Level C-508的层级内网，既然你能看到这些玩意儿就说明你已经进来了。先说说怎么过来的，我们再虑对你的称呼究竟是兄弟还是冤种。
//
//如果你真是看到上面的东西还想作死试一试武装守卫的狙击，那你就是个作死的冤种。如果你只是什么都不知道就切进来那你就是个冤种。对于你们两种人，我建议是立刻往后退，从哪儿来的回哪儿去，别想着卡墙或者贴那个小贴纸除非你想变成自助餐。顺便一提出去以后你们最好闭嘴，虽然上面的内容90%以上是假的但是关于网络封锁那一段是真的，我们希望拯救更多的人，如果有人活着反而会让其他人被影响危险……那个人还是死比较好。
//
//而如果你是另一种，突然被上级选中，调任到这个所谓的实验室看守计划，那么欢迎你，兄弟，先放下那愤愤不平的心吧，实验室根本不存在，这才是关于这一层的真正信息。
//
// 
//
//生存难度：
//等级 5
//
// 
//扩散性敌对实体
//恶劣环境
//Level C-508是后室C层群的第508层。
//
//Level C-508目前探索区域为巨量有机物组成的大型空腔。推测这属于某种巨型生物器官，但相比起普通生物其布局上更近似工业区域布局整片区域的氧气吸收功能明显受到特化。
//
//通过标准入口进入Level C-508的探索者会出现在空腔区域，这也目前唯一探索成功的区域。除此之外周边区域包括上方大型管道及周围持续搏动的的类管道状结构。
//
//尽管结构外观较为柔软且确实是由有机材质构成，其韧性却极其惊人。大部分火药武器甚至低功率的爆破武器都很难破坏效果，且一旦进行针对墙壁的破坏尝试周围会迅速产生大量敌对实体造成严重后果。
//
//该区域环境以小时为单位变化：温度将从25度左右在四小时内逐渐升高到35度左右，同时该过程中Level C-508氧气含量会显著降低，通常在最后一个小时时已经变得无法支撑人类保持清醒轻意识，此时必须立刻戴上呼吸面罩，如果处于睡眠状态则必须睡前佩戴呼吸面罩。
//
//“我知道这体验会很糟糕，但是克服一下，慢慢的会习惯的。”
//
//4小时后Level C-508会出现明显的空气流动并且空腔区域空间显著收缩，区域内空气会被巨大的负压排出，此时的探索者必须固定住自己否则有极大概率被从上方排气孔中卷出。由于排气孔长度已经超过换气周期内人类的运动极限，对于此区域的探索没有成功而被卷出者会迅速失去全部消息，推测已牺牲。
//
//实体
//Level C-508存在巨量强攻击性实体，通常表现为一种从墙壁上渗透出的半凝胶状生物。这类生物有出色的行动能力且任何人体组织与其的直接接触都会导致蛋白质分子链快速被折解失活。其具体构造尚不明确，但推测这是构成层级的活体生物的免疫机制。
//
//此外观测到一系列特殊生物会从上方通风管道中进入，最常见的是一种小型蠕虫状生物，其反应能力和运动能力极其惊人，解剖发现其中神经系统由透明纤维和感光细胞组成，推测这些生物用光来传递神经信号。
//
//这些生物的数量随着人类到来而不断增加且越发高频率的在层级内巡逻，若发现不属于Level C-508的物质就包裹并将其分解吸收。其移速在10km/h左右并有极强的追踪能力，在追逐敌人时会释放某种信号呼唤其他实体协同作战，受到呼唤后更多实体从周围的建筑中渗透出。
//
//如果被追踪者的逃跑能力较强则极有可能变成一场漫长且规模极大的追逐，这场追逐会持续到对方彻底遮蔽自己的行踪或是被击杀——已确认这些实体可以跨层级进行追击。尽管尚不确定是如何做到，但其确实可以从流浪者的切出痕迹中切出并到达同一地点，通常来说这会导致大量危险实体出现在原本应该安全的层级并造成巨大灾祸，同时这些实体也可以正常出入层级入口前往其他层级展开猎食和破坏。
//
//值得一提的是，观测到少数有识血肉的肢体残渣和尸体从通气管内坠落，但对方拒绝对此事做出任何解释。
//
//基地、前哨与社区
//M.E.G.第一防御协议基地“灼祭烈火”
//这是Level C-508唯一一处固定基地，与M.E.G.位于Level 11的大型基地“无名者之耀”联通，从中获得兵员补给和物资补给，该基地持续发出高频率声光信号以吸引周围实体并使用武器对其进行杀伤，减少其进入其他层级的可能性，幸存者可以朝向该基地移动以尝试获救。
//
//“欢迎来到这个一点都不温暖的家，新人必看传单在这边，写遗书的纸和笔放在抽屉里。”
//
//网络情况
//Level C-508网络极差，大部分区域的网速仅有1mb/min，且任何从Level C-508向外发送的信息都会被技术手段屏蔽或是从数据库中删除。
//
//入口与出口
//入口
//目前发现到达Level C-508途径是穿过一种在周围墙体上已经长出类似血肉藤蔓的特殊门，发现的几个主要入口主要分布于Level C-408、Level C-309、Level C-273、Level C-307等地。
//
//以上入口已经被M.E.G.严格封锁，只有Level C-508内驻守者小队长外出选取合适的层级内人员补充，被选中人立下誓言后方可与小队长一同进入Level C-508。
//
//出口
//上述入口同样是稳定出口，但是所有出口均已被封锁，除通过小队长身份验证外其他任何方式外出者均会遭到攻击。
//“没办法，如果没有做出身份验证，我们已经不能确定走出来的那个究竟是什么了”
//
//现在明白了？这地方是非常容易进却危险的死地，如果没有警告恐怕会有一推探索者慌不择路跑进这里然后死的很难看。
//
//但问题在于，之前的多次层级出入统计中表明越是警告文件中直白写明实体或是自然危害的层级，越有可能会让一群作死的家伙进去试胆子——尤其是在“速切玩家”组织成立之后，这帮作死的小鬼总觉得跑到个危险层拍两张照是很牛逼的吹嘘资本。
//
//一般层级他们作死我们也只能尽量救一下劝一下，但这里不同。那些玩意有本能的追踪性，即使不打扰恐怕也会很快增长到溢出其他层的程度，更别提在流浪者选择逃走时很有可能导致大批实体追逐直至离开Level C-508，这对其他安全层级的人民将造成巨大伤害——不可否认的，安全层级的基地戒备程度明显低于危险层。
//
//所以必须更改策略：最近出现认为我们是邪恶组织的论断并总会有不少人相信这个观点，这显然是个可以利用的办法：蠢货不怕实体，但每个人都害怕被喂上两颗花生米。如果直接警告这里有携带武器的守卫，他们多半会预料到我们不敢开枪——通常来说也确实不会开枪。
//
//但只要给他们提前植入一个M.E.G.是大反派的观念，他们就会自动脑䃼其他细节然后自己吓自己，最后让自己离这个鬼地方远远的，找个和平安稳的层级好好过日子。
//对，上面那些玩意儿通通是编的。真正机密的文档全都写在纸上放在专门的档案库或是断网电脑存放。这种又重要又不该有几个人看到的东西干嘛要脑子抽筋一样一股脑丢在网上—— 你觉得数据库的安保措施很完备吗？
//
//但总有人认为自己是天选之子，以为自己真能看到那些高级文档，然后捕风捉影的编造阴谋论断——因为他们无法理解任何崇高，认为其他人与自己一样卑劣，认为只有自私自利才是生存的真谛……虽然这纯属放屁，但是如果如此说能拯救生命的话让我们背负骂名也是值得的。这片危机四伏的土地不需要道貌岸然却会带着大家一起送死的蠢货，人类需要让每个人都能活下来的守护者，即使可能并不高尚。
//这便是为什么誓言和普通军团的誓言有所差而异——他们所付出的是生命，而我们则将付出一切，生前的生命、安葬的权利乃至死后的名誉。我们会死的默默无闻，到死也背负着人体实验基地的冷血看守者这样的骂名，可能永远也不会有人为我们洗白。
//
//但这片土地记得我们，每个人的付出绝不是毫无意义。我们将为了人类奋斗至死，这是我们的誓言！
//
//我们在此庄严宣誓，将付出自己的一切守卫后室的人类，守护人类的文明。
//严守秘密，绝不泄露，英勇战斗，绝不退缩，直面险境，永不脱逃。
//自今日始，死亦不止！
package lvls15x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1508{}