//Level C-521
//评分: 
//+7
//+
//–
//X
//❗️警告❗️
//由于Level C-521特殊的自然环境以及高危险性。M.E.G.已封锁Level C-521的稳定入口以及相关文件。您需要输入凭证方可访问本层级。注意：任何未经允许而擅自闯入本层或查看相关文件的行为一经发现，将进行严厉处置。
//
//凭证通过
// 
//
//生存难度：
//隐秘的档案
//机密属性
//受保护的环境
//Level C-521是后室C层群中的第521层。
//
//描述
//19-D2-C343-ABE6-40-EF-BBFD-DC5-CA632-F92-D.jpg
//一张Level C-521的图片。
//
//Level C-521主要由一片面积未知的温带草原构成。草原永不下雨，昼夜更替为24小时一次，处于日出或黄昏的时间占比更多。值得注意的是，该层级长满了红色的罂粟。这些罂粟植株极其茂盛，生长速度极快，一般仅需7天便能经历一次生长周期，而当一株罂粟被以任何形式破坏时，在没有人注意或观察的情况下在40分钟内便能重新长出。在部分自然条件优越的地区，罂粟甚至能长到1.5～3.1米之高，形成了特有的罂粟林。另有研究发现，罂粟会主动排斥任何外来植物，并夺取其养分使其枯萎而死。而且该层的罂粟有着极强的适应能力，因此，想要改变该层的生态环境是不可能的，更应该注意的是要防止它扩散至其它层级。
//
//此外，Level C-521的罂粟有着极其特殊的性质。相比于普通的罂粟，它的气味更加浓郁，毒性和成瘾性也大大增强。整株植物都含有成分不明的剧毒，汁液可以引发皮肤溃烂，吃下它果实的人会有强烈的灼烧感，并因此死亡。它还能大范围的散播具有毒性的花粉，流浪者在吸入花粉4小时后便可出现幻觉、精神亢奋等症状，并对该种气味上瘾。6小时后出现嗜睡、呆滞等现象。当吸入时间超过9小时，流浪者将陷入长久的昏睡，即便已经离开该层，这种昏睡现象也不会消失，目前还没有任何方法能够唤醒昏睡的流浪者。因此，进入该层级时必须佩戴防毒面具来进行探索，但该层不会刷新任何物品，也没有稳定的WIFI信号。
//
//紫色风暴
//29-B58093-9-F6-B-4-EF6-BBFF-2-E6464-D327-DB.jpg
//“紫色风暴”期间的天空
//
//每隔四个月，本层会出现一次异常的环境改变。当夜晚的天空逐渐变紫，周围有狂风呼啸时，预示紫色风暴即将到来。留在本层的流浪者应尽快离开本层，如果无法离开，强烈建议在洞穴等无阳光直射的地方进行躲避。太阳升起后，温度急剧上升，有记载的最高温达到52.8℃。届时整个层级将充斥着紫色的光线，根据观查这种光线能使罂粟疯狂生长，并释放出一种能使人中毒的花粉颗粒。另外，这种紫光还会影响人的心智和情绪，让人感到极度的悲伤和抑郁状况。如果出现以上状况，请饮用大量的杏仁水来缓解。紫色风暴持续时间在2～7天之间不等，在此期间的太阳不会落下。如果天空逐渐重归蓝色，则表示一切即将恢复正常。
//
//附录1
//由于本层具有特殊性，曾招来了许多组织的争夺，并经常爆发小规模冲突。直到2022年初。一场“罂粟战争”的到来，结束了这种争夺的局面。
//
//事件：罂粟战争
//时间：2022.01.05～2022.01.07
//交战双方：
//“阿芙蓉集团”和 M.E.G.白牡丹基地
//目的：
//争夺Level C-521的稳定入口
//2022/01/06日，罂粟战争正式打响。“阿芙蓉集团”率先对M.E.G.发起了进攻，随后M.E.G.予以反击。战争从六日凌晨打到了八日下午。最终，“阿芙蓉集团”被彻底击溃。M.E.G.取得了胜利。
//
//本次冲突共有288人参与进来，包括M.E.G.武装人员156人，阿芙蓉集团全部132人。
//
//战损报告：
//
//M.E.G.：共计74人受伤，24人死亡。其余人员状况良好。
//阿芙蓉：共计34人受伤，82人死亡，其余人员投降。
//结果：
//
//M.E.G.夺得了入口，并在入口周围建立了严密的保护措施。而阿芙蓉前哨剩余少部分人也加入到了M.E.G.的阵营中。
//附录2
//一段采访记录
//日期：2022/3/06
//时间：13:10
//
//采访者：科格黎（M.E.G.采访员）
//
//被采访者：瑞诺（原阿芙蓉前哨医药研究人员，在开发药物方面造诣颇深。现已加入到M.E.G.）
//
//<采访开始>
//
//[瑞诺平复了一下情绪]
//
//瑞诺：好吧，你们有什么要问的尽管说吧。
//
//科格黎：谢谢你的配合。请问你是如何加入到阿芙蓉前哨（以下简称阿芙蓉）的？
//
//瑞诺：我是自愿加入的。
//
//科格黎：你为何要加入这样一个臭名昭著的组织呢？
//
//[瑞诺深深地叹了一口气]
//
//瑞诺：其实最开始的阿芙蓉并不邪恶……这其中的故事有些长，你要听吗？
//
//科格黎：愿闻其详。
//
//瑞诺：最初的阿芙蓉，是一个致力于改善生态环境和保护流浪者的组织。2017年，我加入到了这个组织中。那时的领导人还是杨领航，他很有远见、胆识过人。在他的带领下大家也其乐融融、各司其职。在这其中，我负责开发药物——一种专门用来克服Level C-521层级内特殊影响的药物。那时的我们是真心真意的想要为改善后室做些什么，除了一个名叫林潘途的人之外，而事情也全坏在这个人身上。
//
//科格黎：这么说，后来所发生坏事都是他干的？
//
//瑞诺：没错。林潘途原本只是我们组织里一个名不经传的探员，他很擅长利用花言巧语欺骗别人。此外，林潘途还有一个非常令人厌恶的习惯，就是吸毒。他总是借考察研究之名，或是通过偷偷摸摸的手段进入Level C-521大量采集罂粟。然后制成毒品或售卖或自己用。关键是林潘途把这事隐藏的很好，直到他当成为领导人我们才知道这事。（停顿）时间来到了2020年，阿芙蓉从我加入时的60多人扩充到了300多人。此时我的药物研发距离成功也仅差一步。可就在我们的组织蒸蒸日上之时，领导人杨领航却突然因不明原因一卧不起，没几天就逝世了。想都不用想，这一定是林潘途干的！
//
//[瑞诺握紧了拳头，紧接着说道]
//
//杨领航的葬礼刚举行完不久后，我们正在举行新一任领导人的选举大会。当时除了林潘途，包括守卫在内的所有人都到齐了。谁都没有在意林潘途，认为他只是太过悲伤，不想来了。因为他在葬礼上哭得那叫一个撕心裂肺，甚至差点晕过去。但转折也出现在这里。大会开到一半时，林潘途突然冲进了会议室，身后带着一群全副武装的人向我们扫射。我们当时很多人来不及反应就倒在了血泊中，枪声和惨叫连成一片。我当时由于离得远，然后又恰好被拥挤的人群推倒才侥幸逃过一劫。枪声大概持续了一分钟才停下，当我再次站起来时，会议室已然成了人间炼狱。到处都是血迹和尸体。而我和剩余的三十几位幸存者则被那位魔鬼绑了起来，我至今……都忘不掉他那狰狞的嘴脸和恶心的笑容。他完全就是个魔鬼！（说到这里，瑞诺突然激动了起来）林潘途从一开始就骗了我们所有人！说他是畜牲都算轻的！是他害死了杨领航！是他毁掉了阿芙蓉！是他……害死了我们三百多兄弟！他简直……
//
//[瑞诺再也无法控制自己的情绪，对着桌子狠狠地锤了几拳。]
//
//科格黎：世上怎会有如此混账的人？究竟是什么让它能干出这种事情？
//
//瑞诺：你还不明白吗……促使他成为魔鬼的东西就是毒品！那些全副武装的人就是他找来的同伙！他们掌控了阿芙蓉后，开始毫无节制的向外输送毒品，而我和其他剩下的成员则被关到了一个没有信号的小房子里，每天都要帮那群畜生们采摘罂粟，除此之外还受尽折磨。为此我们又有十几人被活活累死……
//
//[瑞诺沉默了很长一段时间，然后开口了]
//
//瑞诺：最后到了2022年初，我们才被你们拯救出来。说实话，真的很谢谢你们……
//
//科格黎：这是我们该做的，瑞诺先生。如果你以后有什么需要，尽管开口，我们一定尽力帮你。
//
//瑞诺：真的吗？那请问……我能否拥有一间实验室呢？我要完成我尚未研制成功的药物。
//
//<采访结束>
//
//附录3
//米囊蓉片
//M.E.G.医药研究人员瑞诺在经历数次失败后，成功制得了米囊蓉片。根据测试，该药物具有重大价值。
//
//9-E35-B3-D8-DD8-C-436-D-A7-D0-DA1-F02-E25-A68.jpg
//最初生产出来的米囊蓉片。
//
//性质及用途
//米囊蓉片是外观为橘红色，大小不规则的颗粒状药物，具有一种甘苦的气味。米囊蓉片的熔点在70度左右，且易溶于任何液体。
//
//经过测试，米囊蓉片可以治疗很多常规疾病，包括但不限于感冒、头疼、失眠、疲劳、部分心理创伤。将它与杏仁水以1:1的比例混合，所制成的溶液还可以治疗皮外伤、溃烂，甚至能够直接治愈陷入第二阶段的悲尸。此外，米囊蓉片还可以补充维生素B、维生素C。但需要注意的是，不应一次性服用过多的米囊蓉片，因为米囊蓉片含有轻微的毒性，过量容易导致嗜睡。
//
//获取方式
//目前仅能通过与M.E.G.交易获得米囊蓉片。
//
//基地，前哨和社区
//M.E.G.“藏红花”基地
//尽管本层的自然环境极其恶劣，但M.E.G.还是克服了困难，在一处山洞组建了一个拥有34人的基地。他们在本层采集和研究这些罂粟，还设立了足够多的引路牌来帮助无意来到本层的流浪者找到出口。
//
//阿芙蓉前哨（已摧毁）
//阿芙蓉前哨是在本层第一个建立的组织，尽管建立时间已无法确定。曾有167人在此长久驻扎。据其剩余的成员所说 ，最初建立该前哨时曾损失了不少人，靠着定时从别的层级运输生存用品生活。
//
//此前哨曾大量利用本层的罂粟制成毒品，并将其以高价售卖给各层的流浪者。此举遭到了各大组织的一致不满，并要求其立刻销毁所有的毒品。但前者并没有听进去，反而变本加厉。最终在各大组织的联合下被彻底摧毁。
//
//入口和出口
//入口：
//Level C-8内有一颗长满鲜艳红花的树木，触摸它会进入Level C-521
//在任意层级中发生意外的死亡事件会有较小的概率被传送至Level C-521
//出口：
//本层有较小的概率会生成一片粉色的罂粟，进入其中会来到 Level C-288
//当流浪者怀有极强的求生欲时，尝试在地面切出可来到Level 10
//钻进某些洞穴会来到Level 8
package lvls15x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1521{}