//Level C-570
//评分: 
//+17
//+
//–
//X
//M.E.G.记录中心
//2022.7.6 此篇文档已不再适用并归档，请查看新文档。
// 
//
//生存难度：
//等级 4e - 环境危害
//
//不安全
//极度不稳定
//非实体危害
//Level C-570是后室C层群的第570层。
//
//描述
//xQK4cYXjNMzsq8i.jpg
//Level C-570的“场景2”中正在倒数的显示屏。
//
//Level C-570为多个无直接联系但具有相同效应及特征的“场景”总称。于2021年12月28日首次发现。截止目前已确定5个“场景”的存在，更多“场景”的探索及研究正在有序进行。同一时间只能有一名流浪者位于此层级。
//
//流浪者进入Level C-570时，无论“场景”如何，必将位于一辆以70km/h速度行驶1的越野吉普车2的副驾驶位上。离开座位的行为将使流浪者进入Level 69。主驾驶与后排座位上未观测到任何实体，吉普车自行驾驶的行为原因未知。擅自掌握行驶权的行为是失败的，车内拥有正常的Wi-Fi信号。Level C-570层级内已证实不存在任何已知实体。
//
//进入Level C-570时，除通过Level 11的旅行社进入必将到达“场景1”，流浪者到达的“场景”是随机的。层级内“场景”随时间将不定期转变为另一“场景”，转变过程通常为一瞬间。在不离开Level C-570的前提下，“场景”的改变快慢与流浪者对目前“场景”感到烦躁的程度呈正比。且变换顺序只会从编号较小“场景”转变至编号较大“场景”3。位于“场景5”的流浪者不会经历“场景”的改变，暂定义其为“终点场景”。
//
//“比例缩小”
//是否受“比例缩小”效应影响是判断某区域为Level C-570的某一“场景”的决定性因素。
//流浪者在Level C-570中将失去眼睛变焦的能力，晶状体焦距进入层级约5秒后定格，之后通常伴有间断性强烈的眼部酸痛与头晕感。流浪者在层级滞留约15分钟后，症状有所缓解，与此同时车载音响将会自动播放一段留言，目前据流浪者报告的留言如下:
//
//“嘿！快点把相机打开，帮我选个角度。”
//
//“别睡了，赶紧起来工作，拿好了别给我摔了！”
//
//“有点飞蚊症很正常，没什么。”
//
//“你平常把墨镜带着不就没问题了！？反正就是个体力活。”
//
//
//留言结束后，音响内将会循环播报4s至10s内任一时长的倒计时（因“场景”而异）。此时流浪者的视野将被限制为一矩形，方法未知。倒计时结束伴有“咔嚓”拍照声，流浪者眼部受到来自如闪光灯的光源的巨大冲击。此时流浪者视野内对焦的事物将由“近大远小”的关系逐渐缩小。例如远处的一棵被对焦的树在视野内与流浪者面前自己未对焦的手指同长，则倒计时结束后该树将缩小为手指般长。故距流浪者视野内越远的景物扭曲将越严重。闭眼，遮挡车窗，后天失明被证明是无效的，其会根据流浪者瞳孔位置确认视野，忽视吉普车本身在对外部景观造成破坏。流浪者将在效应过程中产生极大的痛苦感与干眼症并发。目前M.E.G.总部未获得有先天失明的流浪者进入Level C-570的报告。吉普车与流浪者自身携带物品并不受到比例缩小效应的影响。但即使如此，由于道路仍受其影响，吉普车将有极大概率失控并在“场景”中横冲直撞，造成对流浪者的二次伤害。故强烈不建议流浪者在Level C-570中停留超过15分钟。
//“场景”概况
//场景1
//p8bIO5Ra6jsEAPn.jpg
//“场景1”中一处较干净的草地。
//
//Level C-570内“场景1”表现为一条无限延伸的双车道，道路左侧为一片沿双车道延伸的草地，远处为与道路平行的树林及丘陵。草地上散布大量已废弃的拍摄婚照的服装与道具。由于层级特性，无法直接接触物体，据流浪者目测报告如下表，物品损坏原因未知。道路右侧为一片未知海域，液体未知，不存在潮汐现象。海面同样漂浮少部分损坏的服装道具。海域与道路直接相邻，如同过渡的沙滩区域被生硬切去一般。道路起草地与海域的分界作用。
//
//“场景1”始终保持在正午时分，流浪者在“场景1”中除眼部外身体感到充足的活力，此处“比例缩小”效应为10秒一循环。“场景1”也是流浪者离开Level C-570的最佳地点。
//
//当流浪者使用拍摄设备拍摄关于“场景1”的影像时，所得照片将会出现严重的失真与色彩差异且不可修复。原因未知。少数情况将与拍摄景观完全不同，替代的则是“比例缩小”效应后呈现的破碎“场景1”景象，照片整体严重偏红并极其模糊。
//
//场景2
//Level C-570内“场景2”表现为一石制环形广场，直径估算约150米。流浪者在“场景2”中将会感到极大的困意与疲倦感。广场外区域未知。广场中心矗立一立柱，顶部在东南西北四方各装有一面数字显示屏，显示相同持续倒计时。吉普车以立柱为圆心作圆周运动。
//
//“场景2”始终保持午夜时分，车灯保持关闭，故显示屏与流浪者携带的手电为仅有的光源。显示屏先已流浪者进入起进行5分钟倒数，随后“场景2”将播放震耳欲聋的闹铃声，闹铃通常与流浪者在前厅中的闹铃一致。如果流浪者未曾设置过闹钟，则铃声为苹果手机默认的“雷达声”闹铃。目前关闭铃声的方法未知。此处“比例缩小”效应为4秒一循环。15分钟后，当“比例缩小”效应发生时，广场将逐步碎裂，裂缝处射出大量白光，“场景2”将变得极其明亮，铃声将逐步减弱，与此同时更多生活白噪音，如风扇声、流水声、翻书声、 做饭声、蝉鸣声将充斥“场景2”。吉普车由于失控，极易冲出广场，流浪者将会昏迷，情况未知，推测已经死亡。由于“场景2”对耳膜不可逆的伤害以及“比例缩小”效应发生带来的极大危险性，建议流浪者进人“场景2”时尽早切出。
//
//当流浪者使用拍摄设备拍摄关于“场景2”的影像时，所得照片将会呈现黑白状态且不可修复，原因未知。
//
//场景3
//Level C-570内“场景3”表现为一座老旧但仍能使用的加油站，占地约1300平米，内置6个加油桩，东西两侧与一双车道连接。
//
//吉普车于双车道上自行行驶并进入加油点加油，期间有流浪者报告称听到开关车门声，暂未证实，加油完毕后吉普车自行驶出加油站。“场景3”中行驶耗油量是其余“场景”数倍，且流浪者会产生极强的对油余量清零的恐惧感，油量即将见底时加油站将再次出现，至此循环往复。
//“场景3”保持在傍晚17:00时分，流浪者在“场景3”中将会产生较强的无聊与厌烦感，使得“场景3”在很快时间内就会进行转换。双车道外区域大致为平坦水泥地面，由于层级无法变焦特性，未获得流浪者对道外区域更详细报告。
//
//当流浪者使用拍摄设备拍摄关于“场景3”的影像时不会出现任何异常。
//
//此处“比例缩小”效应为8秒一循环。当“比例缩小”效应发生时，由于水泥地面面积未知，即使效应发生导致缩小对其也无较大影响。当加油站与双车道缩小后，离开道路的吉普车将以任意方向沿直线行驶，因耗油极快，数分钟后将会停止。此时流浪者只能选择切入Level 69或等待“场景”自行改变。
//
//场景4
//Level C-570内“场景4”表现为一标准400米运动田径场，四周以铁丝网环绕，正常生锈，铁丝网外部为完全空置的高层公寓，农村平房及种植未知农作物的农田组成的混合建筑群结构。铁丝网近公寓一侧有一未上锁铁网门连通外部。场地中央足球场草坪两端球门被拆除，草皮有轻微损坏，场地一侧沙坑内充满杂草。跑道出现掉色与裂缝，1号跑道磨损最为严重，6号跑道磨损最轻，依次递减。场地四角各有一白光照明灯。
//
//“场景4”时间保持在晚20:00不变。吉普车在2号跑道绕圈以8km/h速度缓慢行驶。流浪者在“场景4”中将感到极度闷热并大量出汗，即使外部平均气温维持在27°C。不同于其余“场景”，据一流浪者报告称“场景4”在吉普车行驶8圈后“场景4”将自行改变。但由于行驶8圈花费时间远超出“比例缩小”效应开始时间，故不建议流浪者进行尝试。
//
//“场景4”中“比例缩小”效应为6秒一循环。当流浪者使用拍摄设备拍摄关于“场景4”的影像时，所得照片亮度将大幅降低，原因未知。
//
//场景5
//Level C-570内“场景5”表现为一处一望无垠且杂草丛生的花田。目前已发现与前厅中高度相似的花卉品种如下:波斯菊，百日草，硫华菊，孔雀草，万寿菊，翠菊，满天星，千日红，鸡冠花，飞燕草，醉蝶花，美女樱，勿忘我，紫罗兰，麦秆菊，大滨菊，虞美人，三色堇等。花田上未观测到任何木本植物。“场景5”除花田外在某一处有一高约2.5m，顶部喷上红漆的腐朽木杆立标，由于其标志性暂时定为“场景5”的中心。花卉排列方式以中心为界，南北分为两部分，北侧花卉呈乱序排列，同种花卉成团聚集，杂草繁多；南侧花卉呈整齐排列，不同花卉呈直线状或环状分布，杂草稀少。花田南北两侧均出现人为踩踏形成的小径，小径之间以大型的光秃空地连接，整体为点线网状，形成原因未知。
//
//“场景5”内始终保持下午14:00时分，吉普车将在花田内的一条较宽的径上行驶。此处“比例缩小”效应为7秒一循环。流浪者在“场景5”内除眼部无其他不适感，当流浪者使用拍摄设备拍摄关于“场景5”的影像时，所得照片锐度和噪点消除度将极大提升，反之对比度将降至极低，使得照片呈现“伪油画”风格，原因未知。
//
//由于“场景5”作为“终点场景”，不会进行任何“场景改变”。故此时离开Level C-570的已知稳定方式仅有离开座位进入Level 69，尝试对抗“比例缩小”效应是不值得的，故建议流浪者进入“场景5”后勿长时间停留，做好准备后尽快切入Level 69。
//
//- 收起表格
//物品	状态	位置
//大量散落的白色西服及婚纱	严重破损	路旁
//皮鞋	破损	西服旁
//白色与粉色旗帜	破碎	树上及树下
//气球	部分破碎	旗帜上
//桌椅	较完好	倾倒在地上
//背景板	严重破损	路旁，极少处在路中央
//相机	完全损坏	散落一地
//写有“新婚快乐”的卡通标牌	沾满污秽	树下
//各式假花	完好	散落一地
//一架白色大提琴	严重破损	路旁
//基地、前哨与社区
//由于层级特性，不存在任何已知基地、前哨与社区。
//
//入口与出口
//入口
//在Level 11的任意旅行社内订购“摄影旅行”旅游服务将被传递至Level C-570的“场景1”。
//在以下层级内切出或找到一台破碎的相机有概率来到这里。
//- 收起列表
//（由于层级过多，作简略处理）
//Level : 0，8，9，10，20，25，35，43，44，48，50，59，60，143。
//Level C- : 10，12，13，16， 18，19，23，25，26，32，36， 38，40，57， 92， 114，117，167，256，259，473。
//因Level C-570原因未知的数量庞多的入口数量，建议流浪者在以上层级探索时多加小心，误入Level C-570后尽快切出。若发现更多入口，请及时上报给M.E.G.总部。
//
//出口
//尝试离开副驾驶位将使流浪者进入Level 69
//更多出口正在有序探索中。
//
//
//
//
//
//
//
//- 收起
//M.E.G.公告
//寻人启事
//姓名: 邱浩
//性别，身高，体重，肤色: 男；178cm；66.3kg；黄种人
//年龄: 26岁
//前厅中职业: 职业摄影师
//失踪时间及地点: 2021.12.28；Level 8
//患病: 高度近视，患有较严重干眼症及颈椎病，因常年情绪劳动导致持续性精神疲劳。
//后室内职业: 负责Level 11，Level 48等宜居或流浪者聚集层级内摄影记录服务与帮助，修复档案内损坏的影像资料。
//特征: 在Level C-346执行任务后返回Level 11途中意外切入Level 8。失踪时上身着淡蓝色衬衫与白色防风衣外套，下身着卡其长裤，身背背包，内有摄影工具与照片素材，身前挂一相机。
//
//如何任何关于上述失踪者的报道，请及时向M.E.G.总部报告。
//
//- 收起
//（Level 8内两名流浪者的语音对话）
//
//人声A:我们就不能换条路线回Level 11吗？
//
//人声B:我本来也没准备从Level 8走啊！哪知道怎么突然进来了，这鬼地方活命要紧！我去！
//
//（持续数分钟的实体嚎叫声与战斗声）
//
//人声A:妈的这么多。
//
//人声B:赶紧跑，他们又过来了，别磨蹭！靠！（跌倒声）
//
//人声A:起来！！大爷的谁这么缺德给这丢本书啊
//
//人声B:（爬起）它们过来了，真是的*！
//
//人声A:电视啊妈的那有台电视！快冲！
//
//齐声:啊啊啊啊啊啊啊啊啊***（切入声）
//
//(长时间沉默)
//
//人声B: …………这是哪。
//
//人声A:我查一下……是Level 104。等级2，能休息一下了。
//
//人声B:你还拿着刚刚那本倒霉书呐！
//
//人声A:万一有用呢，（翻书声），好像是本日记，署名是……“丘告”？
//
//人声B:留着吧，回去了给别人看看认领一下。
//
//附件:
//收起
//2020.6.5 我根本没有写日记的习惯。
//
//2020.6.6 好吧，M.E.G.的人推荐我还是写一点日记随身带着好，说是万一不幸挂了可以留存档案吧啦啦的，那就勉为其难写一些好了。我在后室已经待了一个月了，现在常居Level 11，该见识的也都见识了，不至于大惊小怪。至少这里没有恐怖的疫情，让我工作约同歇业。M.E.G.的人说给我整点任务有事干，感谢我的高度眼镜一镜难求，我猜他们不准备把我弄进探险小队。
//更烂了，他们让我干回老本行，明摆着让我眼睛挑战吉尼斯近视记录啊。
//
//2020.6.10 今天第一回执行任务，给一个同层级女生拍城市写真，。我不理解为什么在后室这鬼地方还有人要拍照，这是什么5A沉浸式风景区吗，竟然还有人有心思搞这个。
//
//2020.6.18 在街上散步，一只手手贱摸着门面房的墙一直走，碰到了个海报到了个没来过的鬼地方，我没那本事报告新层级或者查文档，还好能原路返回，不关我事。整天拍拍照，在街上看那些无面灵们，无聊了去Level 10遛一圈，提前步入养老生活，惬意。
//
//2020.7.5 我错了。
//他们说要我去其他层级帮助流浪者拍摄更多层级影像，顺带还去帮别人拍拍照。我就请你们帮我安排个住处在给我点口粮我用这么拼命吗。要不把我放探险小队里这样我还死得高尚点。
//
//2020.7.14 至少他们让我从还算安全的层级开始。今日完成:Level C-12，Level 20的影像。（我要抓紧享受好日子。）
//
//2020.7.16 我大概没时间享受了。今日完成:Level C-23，Level C-92（我喜欢它的名字），Level C-117（宜居，但我为了找面包进入层级花了半个小时，庆幸它后来把我送到Level 60了。）
//
//2020.7.31 休息！但是极不愉快…遛弯时碰见了一老奶奶说自己发现了新层级，要我给她证明给她拍照。一看，啧，Level C-256，理疗店入口大牌杵在那儿是真没用啊。哎，阿姨年纪一把大了，来后室够不幸了，还这么激动，Level 11过完晚年不好吗…除非她喜欢去按摩，有空我也去。现在也没翻到什么养老院的好地方，是我没找到文档还是就没有。
//
//2020.8.5 今日完成:'Level C-259（化学无聊，吸了点氦气咯咯笑别的啥没干），Level 11（自拍），Level C-39…骗你的那地方都探完了，假装多点业绩。
//
//2020.8.31 我有点不安。其实只是因为拍摄层级逐渐危险了，我在Level C-114待的时间快赶上我散步的时间了，没时间。以下哪一层级今日完成？A:Level C-13 B:Level C-26 C:Level C-16，Level C-38，Level C-40（不恐高，但还是吓人）。
//
//2020.9.12 艹你的我他妈… ，我不应该好奇Level C-11的文档的淦！好了这下我再也进不去了，损失了大好前途，恭喜恭喜啊哈哈！！我太好奇啦啊哈哈哈！
//
//2020.9.21 为什么Level 10连个小土坡都没有。我现在除了跟麦芽镇的大哥们吹牛，在Level 10也没事干了，难不成欣赏湖边霉景？
//
//2020.10.3 大前日完成:Level 43，Level 59。大前日第一次进入等级5，在Level C-114躺了4天，差点一只腿就没了，我谢谢你M.E.G.,你指望在这些要命的地方找到超级杏仁水吗？
//
//2020.10.7 后室里怎么这么多傻逼啊。有个二百五订单要我去Level C-43给他拍人像照片，这些浪费时间的"打趣"信息你他妈以为很好玩是吧！我天天拼死拼活让你们活久点你们就喜欢干这种事？白眼狼，王八蛋。
//
//2020.10.23 今日目标: Level 72，Level 91.
//今日完成: Level 11。
//
//2020.11.2 我脑子要爆炸了，你们就不能上传好文档格式，还要我一个个帮你们调，拍的照片跟抽象画似的你还不如不放，对你对我都好。还有那些自己去了哪都记不得的是什么玩意，传上来一堆说Level C-101的一看全是Level 120的真是脑子瓦特了。
//
//2020.11.17 我要试试能不能请个假让我去Level 48休息一个星期。
//
//2020.11.18 他们允许我去了————2天，总之是大量人手不够的套话.
//
//2020.11.20 烦死了妈的。我是来休假的不是免费流动摄影服务，我的善心是你们这些天天住在极乐世界的东西能肆意挥霍的吗，要我拍这个拍那个，我拍你大爷。有没有那种宜居又人不多进入又简单的层级让我老死的好了。
//查了一下，上次那个老太太去的Level C-256最好。我不想浪费杏仁水，去他的吧。
//
//2020.12.4 今日完成:Level C-10，Level 25，Level C-39 没意思。不玩这些了。
//
//2020.12.16 都来后室了脾气还这么大，今天有个人说我拍的照片丑的要死，要退款，我辛苦跑一趟过来你就这样？呵呵。
//过会去枢纽跟他好好碰一碰，真当我吃素的。
//
//2020.12.17 我赢了，我都没跟他斗，我没去！！那小子肯定搁枢纽整天呆着LOL。
//
//2020.12.28 今日完成: Level11。M.E.G.只让我拍摄记录那我随便选一个没问题吧。
//
//2021.2.7 看来他们没有偷翻我的日记，我还以为我故意不写一个月他们会找我麻烦呢。今月完成:Level C-36,Level C-57,Level 44,别的记不得了，都上交上去了我也没备份。
//
//2021.2.15 Level 9。差点死。
//
//2021.2.19 现在他们给我的层级拍摄已经基本是生存难度3和以上的了。 提心吊胆的过日子，现在看到给我的消息就恨不得砸掉手机。
//
//2021.2.24 我去我成功了。我刚刚竟然一字不差的把Level C-114的文档背下来了我去我去我去。要是有不明白的尽管找我，我现在连1楼到10楼每一层放的绿植数量和位置都记得清清楚楚。回头客谁比得过我。
//
//2021.3.6 今天回Level 11时不知道怎么突然进了Level 8，我去他的要不是有人帮我掩护还有我跑得快我肯定得死那里妈的。
//
//2021.3.7 刚刚我问了昨天帮我离开Level 8的那群人，他们说因为掩护我有个士兵被挤到一扇木门里去了，现在困在Level 203出不来。
//妈的妈的妈的我是不是间接害死了个人*
//
//(中间一页似乎被撕掉了)
//
//2021.3.20: 今日完成:Level 11。
//
//2021.4.1: 为什么别人都可以英勇就义发表新层级报告成为个大人物，我就天天拍照p图蜷缩在Level 11跟个永远无名的渣滓似的。
//
//妈的我门都要被你们敲坏了能不能安静点！我不拍照嘞谢谢您嘞。
//
//我就罢工2天这是死了多少人每个小时都来烦我。
//
//2021.4.4: 我要申请辞职。
//
//麦芽镇的大哥说辞职的话，他们会收回我Level 11的房子，他们给我的补给物资，以及撤销我的所有特定层级进入权限。
//
//我不敢。
//
//啊哈！今日目标：Level 790，Level C-43，Level C-115。
//
//我的任务记录下来也没啥用，毕竟也不会激励我自己“啊！我竟然干了这么多事！”。那我还是记录Level 11的快乐日常吧。
//
//2021.4.20 今日遇到5只狗狗，3对无面灵情侣，4个无面灵一家三口，12个单身无面灵，8男4女，4个无面灵老人，大大提升我的社交能力。
//
//2021.4.30 今日遇到3只狗狗，2对无面灵情侣，6对无面灵一家三口，6个单身无面灵，全男，5个无面灵老人，4个人类。
//
//2021.5.1 2狗5情4家5单2男3女4老6人。
//
//2021.5.5 无聊至极。
//
//2021.5.7 前厅不比这差，至少我不用天天担心会不会死掉。
//
//2021.5.8 做噩梦，前厅的梦。
//
//早上摸黑起床，洗漱完再上床眯一会，总是压着线到工作室，早饭蹭同事的包子钱还没还。8点多开车去拍摄，因为失眠导致同事担心疲劳驾驶常常被换到副驾驶上。早上的单通常是婚照，不乏有带着乌泱泱的亲属来观摩的。到那个已经被拍烂的沙滩边，颜色又鲜艳又丑，跟油漆桶胡乱泼上去的似的。每拍一次就丢点东西，今天丢支架明天丢外套。带着口罩说防疫实际上只是没心思赔笑。整完了恋爱的浪漫就把它丢弃，盒饭拣着肥肉和饭吃。下午再赶去远的要命的郊区拍自然写真的订单。在车上祈祷不要下雨否则又白跑一趟。带着防晒帽长护袖顶着死人的太阳整唯美风情，结果就是拍摄的田现在东一个洞西一个坑，顾客就挑着洞往上站，拍出来的照片除了人啥都没变。拍完了原路返回，忘加油了就只能在最近的一家又贵又老的私营加油站加油，又期盼这家垃圾倒闭，又怕没油了真困死在郊外，天天这么矛盾的过日子。剩下零散的小单子和照片修图消磨了空隙的时间，家离市区远得很，接近午夜才能到家。睡的又浅床板又硬结果失眠不断，傻逼铃声天天吵的要死，睡不着就干脆早起去蹭同事包子了。除了放假日大半天躺在家里，晚上去家旁边一个有年头的大操场跑步，说的好听，其实就是竞走，敷衍几圈就闷回家躺着了去，有时客户又来指三道四，臭骂几句又盯着电脑死皮赖脸的工作了。
//日复一日年复一年，朝着没有终点的世界一路奔跑。除了眼睛被整的快烂了之外也没什么能铭记代表几年的日常了，失明指日可待（但大概不会）。热爱都是累赘，同情都是麻烦。 （蓝色字体内容字迹明显变淡，只能勉强辨认，原因未知）
//
//2021.5.13 靠北我前两天这么抑郁的吗我都写了些啥啊hhh。我竟然这么多的字一个“我”也没写也太牛了。今日完成:Level C-473。
//
//2021.5.16 今日无事。
//
//2021.5.24 今日有事。我的确疏忽了，M.E.G.确实有人在偷翻我的日记，监听我的生活，不得不说反侦察意识很强，在我不写日记的那一个月还确实没有来。如果M.E.G.的人看到这里，请不要逼问我是怎么发现的，这对你我都没有好处与价值。但我确实愿意知道你们做此决意的动机。此后我将携身随带这本日记，为了防止不必要的争端，将掺杂大量无关后室的文字，望知。
//
//2021.5.25 既然官腔的话说完了，我臭骂一句没问题吧！ 有问题。
//
//2021.6.4 去看了一下眼睛，果然没有好转，没有办法。
//
//2021.6.8 继续写前厅的烂事，想到什么写什么，让他们无聊死。
//那个拍婚照的场地本来就是特别长的海滨草地，和同事出门取景发现的。整体上没啥特别的风景，除了夕阳的时候有点意境，和那条开辟的公路盖住了沙滩绝大部分，再加上预览图拍得好，经常那些喜欢公路旅行或者是自然风景的人来这，不少都是新婚夫妇。地盘大，风景不缺，所以繁多的拍摄道具，贵的就留着，其他的就丢在那，一天收一点。那里一天到晚还算凉爽，如果这里从来没被用于拍照，又或是我不用大早就奔来拍太阳，我宁愿多呆一会。 （同上）
//
//2021.6.10 好像我的前厅生活过的不比这好，至少陈述起来很无聊。…………所以，我要是为了防止M.E.G.偷看我要写这些吗。
//
//2021.6.14 今日完成: 又失眠了，啧。这个闹铃弄得我精神疲劳头昏脑裂，我要换一个。
//那个鬼加油站的位置选的及其刁钻:在回城区的必经之路上，附近方圆数里其他的加油站还没到的就没油了，每次忘记出门加油都要被它狠狠宰一把。站老板也是神出鬼没，自带便利店内不见人影，一想拿点东西就冒出头来。 （同上） …………我好像真不知道前厅还能写啥了。
//
//2021.6.18 今日无事
//
//2021.6.19 今日无事
//
//2021.6.23 不能颓废，好歹我高中作文还拿过三等奖。
//下午常去的花田是老板的一个大学同学爸爸家的田，名义上是借用，实际上已经归给工作室了。花种的很多，作为商业用田，为了好看，把田一分为二，一半用来种花，一半用来摄影。不过客户又不管这些，他们自己觉得好看就行。东一脚西一步，田里全是大大小小的坑洼，后面来的人只顾从众，坑就越变越大了。冬天来的时候就只是拍雪景的，不过还不如去拍婚照的地方，毕竟这里远多了。 （同上）
//
//2021.7.1 我放弃了，如果只写前厅的事这日记就不用写了，写了总的有人看吧。今日完成: Level 35,Level 50, Level 143。
//
//2021.7.4 我碰到上次在Level 8帮我的那群士兵了。显然他们不对上次的事情有过度伤心，毕竟Level 8这样的事还是太多了。
//
//2021.7.8 最近Level 11的人们在游行，盛大精彩的超级游行。
//我没有参与，因为我此时才留意到列表里的Level C-490。所有人都疯了，他们不希望Level 11一日也会像那样完蛋。街上各种牛鬼蛇神也出来了，一堆算命的占卜的说Level 11大灾将至的全出来了。
//要是我早点搬去Level C-490就好了，那地方比这里快活多了，只要那个小行星不来的话。不过往好处想，这些完美的层级不就是拿来被摧毁的吗？
//？
//原来咒Level 11大灾将至的是我自己啊。
//
//2021.7.11 C-490的文档还是更新了。一路走好，来世再见。
//
//2021.7.13 他们吵的更凶了，很显然这群刁民对M.E.G.干的事愤怒至极，又开始扬言推翻他们了。虽然他们很傻，但是光听他们骂骂咧咧还是很有意思的。
//我才不加入，除非不再受M.E.G.对我居所和物资的束缚。
//
//2021.7.20 吵了两个星期了，这些人是真不累。他们现在见M.E.G.的人就开骂开追，甚至包括我。那我只能再写写前厅的事了。
//
//家在城区和郊外的边界上，附近都没有几户人，楼旁有个操场，晚上灯一直不关，周围一圈社区的人都挤到这里锻炼，上空都是小孩的飞镖，各种激光。大爷大妈组团竞走，放着各种恼人的电音歌曲嘿哈嘿哈的，真不知道提音响的大爷耳朵是不是聋的。所以晚上不拉窗帘不关窗根本睡不着，有时下去小跑几圈以自我欺骗今天很自律，然后再在床上刷2个小时手机就睡觉。 （同上）
//
//让我说好的写不出来啥，一开始抱怨就天花乱坠，我可太现实了。
//
//2021.7.23 今日观察:游行者游荡共计十五条街，统共两百多号人，惹恼无面灵不知道多少只，M.E.G.派的士兵忘记数了，其乐融融，稳中向好。
//
//2021.7.26 他们好像消停点了。不过看样这场抗争还没有结束。
//
//2021.7.29 我找Level C-114的“医生”们开了点安眠药，希望有用。
//
//2021.8.3 效果还行。看来除了实体危害之外，前厅过的跟后室还差不多，至少我在这很快就能去Level 10，放到前厅还要开不知道多久的车。
//
//2021.8.10 今天遇到了个十几岁的女生，很显然因为来到这鬼地方现在正哭天喊地。我还没想到我刚进来时有这么凄惨万分。反正来到这就是接受自己的过程。今日完成:不告诉你M.E.G.，反正你们又不是不能自己查。
//
//2021.8.15 好想捂着被子躺一天怎么办，前厅中这也不会让我切出啊，我连睡大觉的资格都没有了。做错一步事都得遭受未知的痛苦，啧。别人是传奇故事，我至少要来个传奇事故是吧。
//
//无聊。
//我的眼睛的问题很大程度不是摄影，而是后期导致的。遇到那些烦人的客户从猪八戒修到白骨精的也不在少数，就这样还要“自然美感”，何如？……干眼症，如果你听过的话，我的晶状体已经烂到极致了，整日眼皮都是耷拉的，就没有“凌晨风味”吗？在近视眼镜没压瘪我的鼻梁前还是要工作的。眼里尝尝感觉有异物，几秒钟就疼一次，好的时候就歇习一会，不好的时候泪腺都要被抽干了。总之我的眼睛还顽强的坚持着属实是个奇迹。 （同上）
//
//2021.8.24 我的杏仁水喝光了。
//
//2021.8.27 在前厅长大被接受了一次平凡，在后室我又接受了一次平庸，再来个什么别的房之类了再让我接受一次好喽。今日完成:Level 11。
//
//2021.9.4 麦芽镇的大哥还是决定搬走，说不想让自己家变成切尔诺贝利…要是人全走了湖怕不是也难找了。
//
//2021.9.10 教师节快乐！敬Level 0一杯！是您带我来到了这座奇异的世界，你是我们的老师，我们的神，我耿耿于怀的心根子。干杯！
//
//2021.9.16 不要刚洗完头就出门散步，不然会有一堆蜜蜂跟着你走。
//…那不会是个新实体吧。
//
//2021.9.17 我怎么不是能做到玩世不恭的人，这样过的逍遥自在多好。今日完成Level C-67 ，Level 4，我以流浪者名义拿一打杏仁水和两杯幸运豆奶没问题吧。
//
//2021.9.23 我梦到我驾驶着我的吉普车在前苏联的大街上是什么鬼。
//
//2021.10.1 国庆快乐！但是在Level 11没人会欢庆国庆…。
//
//2021.10.5 似乎M.E.G.的人不再翻我日记了，是没有价值还是怕了呵呵。今日完成：Level C-20（有光就比Level 8安全多了），Level 10（附近真没有好的散心点了）。
//
//2021.10.15 那群不死心的刁民竟然时隔三个月又开始骚动了。拜托陨石要来早来了轮得到你说三道四吗。
//
//2021.10.31 阿斯顿法国红酒快乐
//我的手机默认竟然不一样。今日完成Level C-26。
//
//2021.11.3 这本日记还有4页纸就写完了，来个小小的总结！等我有了新欢就不要你了。
//从开始写这本日记以来，我成功从一个平庸的苟活流浪者变成了一个平庸的边拍照边苟活的流浪者，我一个奠基石作用的无名小卒的存在感大概只在Level 11的人口普查中有所体现。可我都到了后室又定是不平庸的，就像爱丽丝发现仙境一般，但没有主角光环，只是死的很快的龙套一个。既然这辈子出不去了，我也没法改变我的生活，那就先随遇而安着，但最后一定要死的潇洒点，不能窝窝囊囊的就终止了。
//
//1.我究竟是平凡的还是不平凡的？
//2.我为什么没有回到前厅的强烈欲望？
//3.我是不是来到了这里也是只蝼蚁无差？
//4.我在这里追求前途有意义吗？
//
//这些问题估计只能有明年这个时候才能回答了好吧我想明白第二个了，假如我一辈子也没进入后室，那前厅就是我永生于此还没有出口的后室某一层。但我都进来了，那前厅跟Level 48之类的比肯定烂多了，难怪我必定选Level 48。
//
//2021.11.13 我深陷虚无主义的泥潭了救命。
//
//2021.11.15 来后室的唯一目的就是生存。如果我是只猫我的本能会促使我在这里尽可能活下去。但我可是个傻逼人类，我一刻不思考这些无解的没用哲学问题就不能生存，然后死掉。我的答案又不能给我两瓶杏仁水那我要这思考有何用。我们的祖先为什么要进化我的智障智商啊。
//
//好吧，我的祖先确实做到了让我天天思考这个无解的哲学问题。
//
//2021.11.23 还剩3页。我是怎么做到活得不如狗但自嘲出一部单口喜剧的。
//
//啊，哲学问题。
//
//2021.11.26 今日完成 Level C-18，Level C-13。
//
//2021.12.1 M.E.G.的人默认我没看过Level C-11的文档，让我去录像。我同意了
//
//我什么时候开始不会拒绝人了？
//
//2021.12.8 还剩2页。今日完成 Level C-25 Level C-167。附录: 我在Level C-114公告栏上发现的纸条上写着-Can you help me open this can，sir？-Open this cancer？How？
//
//好吧是我编的，那的无面灵哪有这种幽默感。
//
//2021.12.13 今天的Level 10为什么这么鲜艳。我眼睛坏了？
//
//2021.12.20 还剩1页。时隔一年大半，我竟然重新见到了Level 0，要我老命了。
//
//2021.12.25 圣诞节快乐，不过Level 11竟然没人开派对，明明这么多老外就是都没心思了。今日完成:Level C-19，Level C-32（我知道它不允许拍照所以作为业绩水分没问题吧）。
//
//2021.12.26 最后一条！写完这本日记你就寿终正寝了！
//我有写日记的习惯。
//
//2021.12.27 不是我还继续用，只是我还没找到好的本子。我不得不说，我连续两天梦到同一家双层超市。可前一天梦到超市开张了，后一天就听到老板娘哭诉超市倒闭了，这是为什么。（勉强的写在日记封底内侧）
//
//日记结束
//
//作者信息
//« Level C-569 | Level C-570 | Level C-571 »
//
//脚注
//1. “场景4”除外
//2. 为“牧马人”车型
//3. 如“场景2”可转变至“场景3，4，5”，而“场景4”只有可能转变至“场景5”
//
//
//Level C-570
//
//
//2022.3.12 Level C-570内探索记录
//总部：Level 20找到相机了吗？
//
//探索者：我疑似发现一个，应该是入口。
//
//总部：好的，检查你携带的物品，把眼睛调整到舒适状态，进入后立刻调整，及时汇报你所在的“场景”，我会给你分配对应的任务。
//
//探索者：好的，我准备切入。
//
//（切入声）
//
//总部：你还好吗？
//
//探索者：唔…我不能对焦了，这里是……一个加油站，是“场景3”吧。
//
//总部：好的。现在你尝试观察“场景3”外部空地的状况。
//
//探索者：我在看…外面似乎什么都没有，就是空荡的水泥地，这里只有道路和那个加油站。
//
//总部：你能观察到太阳吗？
//
//探索者：不大行，我的对焦看不清，但的确远处有一个发光的位置……我的眼睛好痛。
//
//总部：感觉如何？
//
//探索者：我的眼睛很干……其他没有……等等，我才进来几秒为什么油量三分之一都没了？为什么？！这不现实。我的杏仁水呢…在这。
//
//总部：不要担心，这是正常现象。你能看到那座加油站吗？
//
//探索者：可以。那个又老又破的加油站就突兀的矗在那里，连前面的引导牌都没有。这吉普车正在朝它开去。
//
//总部：根据目前的情况，你仔细观察加油站的便利店内有没有什么异常。
//
//探索者：好像是关着门的…准确说半掩着门，里面有一点黄光，我好像看到了货架，不过没有什么商品。别的我的眼睛对焦不上，没法看到更里面。我的眼睛真的在刺痛，它在止不住的流泪，我能不能现在就离开？我现在必须闭眼才能好受点了。
//
//总部：再坚持一会。我们有了足够的信息就会立刻允许你离开的，请拜托忍住。吉普车正在加油吗？
//
//探索者：它停在加油桩旁边了，不过加油桩似乎一点没动，可是油表在转，这究竟是怎么加的油？
//
//总部：你有听到人声或者脚步声吗？
//
//探索者：没有，只有我喝杏仁水的声音。现在我能走了吗，这边真的很无聊。
//
//总部：多观察周围的事物，我们不希望你切入其他“场景”，再走一个循环就可以了。
//
//探索者：行吧，我希望我的眼睛不会有永久性创伤。
//
//（持久的吉普车行驶的声音）
//
//总部：有新发现吗？
//
//探索者：没有。我说了这里只有道路和该死的加油站，别的都没有。除了这些别无他物，我是不是可以…等一下。
//
//总部：什么？
//
//探索者：我好像…可以变焦了，但我的眼睛还是好痛。…………我可以自由变焦了！怎么回事！这不可能！
//
//总部：你进入时间远远不到“比例缩小”效应开始，更不可能能变焦了，你确定？
//
//探索者：我敢保证，我的眼睛的痛感正在消失，它在恢复正常。我的视野也没有变成矩形，我肯定克服了这里的影响！我现在好的很。不过这个“场景3”根本还是那样，没有什么新东西。
//
//总部：你能再确认一遍便利店的情况吗？
//
//探索者：行吧。吉普车又要进加油……加油站为什么歪了？
//
//总部：加油站歪了？
//
//探索者：屋顶斜过来了…不对，整个加油站歪七扭八的跟被轰炸过似的，吉普车还在驶进去！
//
//总部：你确定出现问题了？
//
//（无人应答）
//
//总部：能听到吗？你还好吗！听到请回复！
//
//探索者：我去你的怎么断联了！这条道路在断裂，跟那个“场景2”崩溃的鬼样大差不差！整个Level都在重塑！！所有东西都坠落了！！这TM比那个效应还恐怖！！这车子在乱飞啊啊--—（断音）
//
//总部：喂！能听到吗！回答！！回答！！
//
//（长久的寂静）
//
//总部：回答！如果你能听见回答！离开那里！（重连音效）
//
//（持久而剧烈的咳嗽和喘气声）
//
//总部：你能听见吗！！
//
//探索者：我……（咳嗽），我在主驾驶上…，外面一片黑…是不是……
//
//总部：你应该到Level 69了。赶紧恢复状态，不要懈怠！往前开车，我会帮助你！
//
//探索者：…我把它…调成直线行驶了……（喘气），我还好，可是刚刚…
//
//总部：看来又是一个崩溃的层级，为什么…现在我们要封锁进入Level C-570的一切入口，暂时要想办法限制那些入口层级的流浪者了。
//
//探索者：唔……天…你确定？…刚刚世界跟发疯了一样，整个地方都塌掉变黑了…还有一股浓烈的消毒水味……
//
//总部：消毒水？这是什么意思……算了，现在只能这样了，我就知道那个写日记的没安好心。等你回来再谈。
//
//探索者：那个日…
//
//总部：你先开你的车吧，不要在这里功亏一篑，我会提醒你的。
//
//（记录结束）
//
//
//
//2022.3.15临时更改(已归档):
//收起
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//Level C-570是后室C层群的第570层。
//
//描述
//46b5bc35239b6bfa.jpeg
//Level C-570中的药店。
//
//Level C-570为多个无任何明显联系但进入方式相同的“场景”总称。于2022年3月12日在一次探索“前Level C-570”1时意外发现截止目前已确定2个“场景”的存在，更多“场景”的探索及研究正在有序进行。同一时间只能有一名流浪者位于此层级。
//
//Level C-570由“场景1:药店”与“场景2:阶梯教室”两部分组成。流浪者进入Level C-570时将随机位于两种“场景”其一。目前所得入口报告仅有在Level 0内找到一支断裂且漏墨的圆珠笔将来到Level C-570。对于两种“场景”以及更多未知“场景”的探索正在有序进行。
//
//“场景1”与“场景2”似乎是可以相互转换的。转换的概率随流浪者在一个“场景”中停留时间的增加而增加。转换过程是一瞬间且不可预测的，任何尝试在转换过程中切出Level C-570的尝试是极困难且无意义的。
//
//“场景1:药店”
//“场景1”表现为一直线方向，无限延伸的街道，其时间一直保持在夜晚23:00附近。两侧门面房均呈现同一家药店的形态。药店保持关闭状态，店外有一十字型绿色荧光标牌，大门前积灰严重，反之药店内部呈现整洁状态。任何试图破坏药店及连接墙壁的尝试都宣告失败。从外部观察，药店内与前厅中药店布置基本相同。由于“场景”内光线较暗，无法确认货柜上的药品种类。
//
//流浪者位于“场景1”内将感到极大的急躁与懊悔，且这种感觉在流浪者离开Level C-570后直至入眠都将持续。截止目前曾有一位流浪者报告称目击到窗户的身影，有待证实。由于“场景”较暗难以分辨其与正常窗户区别，建议流浪者尽量避免接触窗户结构。
//
//
//“场景2:阶梯教室”
//“场景2”表现为一与前厅内大学里高度相似的两百平米标准阶梯教室，共12排座位，每4排间隔一走廊。前3排座位均被拉开，且桌面出现较重磨损及划痕。后3排座位桌面，座椅均呈现不同程度的污垢，异味，以及脚印与未知的食物残渣。中间6排座位则较为整洁，但抽屉内仍有少许遗留纸张与脏物。教室前端为一1400*700*900大小的木制讲台，一块可移动白板及附着墙面的可移动上下双层黑板。
//
//流浪者位于“场景2”内将感到一定程度的慌张，且这种感觉随流浪者在“场景2”内停留时间变久而逐步消退。目前无流浪者在“场景2”目击到实体的报告。更多有关“场景2”的探索正在有序进行。
//
//基地、前哨与社区
//在“场景2”的讲台上存放少量由流浪者自发留下的杏仁水，幸运豆奶等物资。
//
//入口与出口
//入口
//如上文，在Level 0内找到一支断裂且漏墨的圆珠笔将来到Level C-570。
//更多入口正在探索中
//出口
//在“场景1”中尝试对药店大门切出将来到Level C-114的大厅内。
//在“场景2”的黑板上涂写将有概率进入Level 52或Level 117。
//
//
//
//
//
//Level C-570最终定稿：
// 
//
//生存难度：
//未知安全等级
//不稳定
//未知实体数量
//Level C-570是后室C层群的第570层。
//
//描述
//Level C-570为一无固定形态，受外界因素影响极大的高危不稳定层级。任何进入Level C-570的出入口均被封锁。对于Level C-570的探索价值性处于争论状态。不建议任何流浪者，组织团体等试图进入Level C-570内部。由于Level C-570的极度不稳定且随机性极高，暂时不对其进行分级。
//
//基地、前哨与社区
//不存在任何基地、前哨与社区。
//
//入口与出口
//入口
//无法&禁止进入
//出口
//完全未知
//-
//-
//-
//-
//-
//
//- 欢迎，管理员。
//如果你看到了这里，请忘掉等待分级和之前的一切报告吧。Level C-570对我们意义重大，这是我们自主掌握层级，对后室进行对抗的一丝希望。我们不希望它被滥用，善意的谎言是必须的。虽然是那个普通的社畜意外发现了Level C-570，但他的发现却不是普通存在的。
//“为什么别人都可以英勇就义发表新层级报告成为个大人物，我就天天拍照p图蜷缩在Level 11跟个永远无名的渣滓似的。”过去是无法被推翻了，但至少我们可以推翻这句话了。
//-M.E.G.总督 留
//
//采访记录2022.3.18
//（Level 1的基地内）
//
//采访者：所以，据你所述，你有关于Level C-570的一些信息？
//
//A(化名) ：是的，我看了你们最近更新的报告。
//
//采访者：那么是什么方面的？
//
//A：…层级本身。我直说了吧，我认为是我的一个认识的人变成了Level C-570，像Level 53一样。
//
//采访者：你为何如此笃定？
//
//A：大概就一周前我在这里(Level 1)认识了一个刚进后室的男生，看起来像一个初中生，因为他的裤子显然是条校裤。我猜当时他才从Level 0 过来不久。
//
//采访者：他有什么不同之处吗？
//
//A：没有。不过他刚来显得很狼狈，草草地在一个墙角瑟瑟发抖，我是在一次搜物资的时候找到他的。男生对面的墙角莫名其妙挂着一个信箱，就是那种老旧小区放牛奶和报纸的塑料信箱。我不知道那是不是他的，或者他有没有动过？我本来想带他回基地的，可是他极度抗拒，估计以为我是个实体…最后我朝他丢了瓶杏仁水就离开了。
//
//采访者：那他怎么可能与Level C-570有任何关联？
//
//A：…第二天我再出去时，我似乎又遛回了昨天那个男生在的地方，那里多了两瓶空的杏仁水，男生似乎不见了。地上掉了一张蓝色的便签，可能是他的衣服口袋里的，也可能是其他人的，总之就是这张。
//
//1.千万千万记得去药店买布洛芬和藿香正气！！！！！你天天晚上打游戏，药店都关门了！
//2.明天数学老师的年级公开课！记得把圆规和三角尺带上，借同桌的尺子听课老师会看见的！
//
//（字迹极淡，极难辨认。）
//
//采访者：所以你怀疑这个男孩因为便签变成了Level C-570的一部分？
//
//A：我不确定…但是这个便签一开始不是这样的…
//
//采访者：你做了什么？
//
//A：那个便签原来的墨没这么淡…我说了那个墙角多出来的信箱。我好奇的往里面看但是什么也没有。于是我就尝试把便签丢进去，因为我以为那是男生自己留的或者是好心人帮他安的什么。
//
//采访者：便签怎么了？
//
//A：便签投入信箱后，整个信箱开始向内缩，像一个萎靡的猪笼草正在抢食一般。我不知道怎么回事，就往里瞄，但是看不见那张便签。大概过了好几分钟，信箱突然恢复原样，便签又被吐出来了，但是字迹模糊的不成样，就是现在这样。那个信箱在吐出便签后就消失了，墙上一点固定的痕迹都没有，仿佛他不存在一般。
//
//采访者：你是什么时候投入便签的？
//
//A：我记不清了…大概是3月12号上午？
//
//采访者：你为什么现在再来报告这件事情？
//
//A：我…我不知道，我只是觉得你们的新文档和那条便签很相似…
//
//采访者：你知道信箱后来去哪了吗？
//
//A：没有头绪。是不是因为我……
//
//采访者：我大致明白了，谢谢你的配合。录音我们会暂时保存。相信这对我们关于Level C-570的研究有重要作用。
//
//（录音结束）
//
// 
//
//生存难度：
//
//等级 编辑
//
//未编辑文档
//无固定状态
//人为变化
//Level C-570是后室C层群的第570层。
//
//描述
//022f1ecd46b6c872.jpeg
//与Level C-570内邮箱高度相似的普通邮箱样本之一。
//
//Level C-570由层级本身与一在其余任意层级随机出现的“信箱”两部分组成，于2021.12.28因流浪者邱浩而意外发现。Level C-570作为编辑层级，代表其层级内容是可以人为控制的，尽管限制因素与成本代价十分之大。层级本身无固定形态，对于其原始状态暂时未知，暂推测为虚空，任何尝试回溯，探索其原始状态的行动均宣告是失败且无意义的。层级内部状态完全取决于其余层级的流浪者向Level C-570的“信箱”投入的纸质材料，无论投入者是否自愿投入。
//
//“信箱”
//“信箱”有且只有一个，是Level C-570已知唯一确定的结构，但“信箱”会不定期在已发现的各层级内转移位置，流浪者向“信箱”投入纸质材料，后其也会转移位置。推测其最初出现于Level 8的一处石缝内。由于“信箱”踪迹难觅，且目前报告数量较少，暂未发现“信箱”的转移规律。
//
//“信箱”表现与前厅中正常信箱，邮箱，收件箱完全一致，在少数情况下“信箱”底部有数字“570”的白色喷漆，鉴于其难以于正常邮箱分辨，不建议任何流浪者往未知邮箱内投入任何纸质材料。
//
//投入纸质材料后，“信箱”将扩大自身以确保完全容纳下纸质材料，随后“信箱”将以违背常理的巨大幅度向其内部猛烈收缩，保持此状态持续数分钟，期间可能伴随着剧烈的颤抖。纸质材料上内容越多，持续时间越久。向“信箱”内投入打印材料，无文字物品等均不会被“信箱”接收并即刻吐出。
//
//目前为止所有发现的“信箱”记录及投入实验如下：
//“信箱”位置	投入内容	“信箱”行为
//Level 8 一处缝隙（推测）	邱浩的日记	层级内部转换-“摄影旅行”
//Level 1 一面墙上	某学生的便签	层级内部转换-“药店-教室”
//Level C-486 电梯内	一瓶杏仁水	即刻吐出
//Level C-317 海面上，未显示标价	Level 1 的文档	即刻吐出，层级不变
//Level 11一处公园大门	邱浩的日记，改变变淡字迹的人称（改为第一人称）	即刻吐出，层级不变
//Level 0	由志愿者根据前厅经历撰写的日记	向内收缩，剧烈抖动，顿时志愿者一蹶不振，昏迷不起，经抢救仍存活，日记许久后吐出，层级不变。
//在流浪者投入可行的内容物后，经过“信箱”的持续吸收后，除去被“信箱”选中作为Level C-570的内容的描述文字字迹将大幅变淡变模糊，其余内容物及剩余文字将原封不动被“信箱”吐出。此时，Level C-570内部将完全进行重置，任何抵抗重置进度的尝试均为徒劳，且Level C-570的前一状态将永远不再出现，类似当前编辑文档未保存状态，此时试图通过改变原纸质材料的人称，写作风格，描述角度等都将无效。
//
//由于“信箱”的出现极为稀少，截止2022.7.3日只有上述6次发现被记载。故对Level C-570的内容编辑规律的探寻正艰难进行中。不过，即使对于Level C-570的记载少之又少，M.E.G.总部研究员仍拟定一份《Level C-570 编辑使用说明》如下，包含大部分对Level C-570层级被人为编辑的自我默认规律中已知确定与高度可能的命题，望仔细阅读。
//
//M.E.G.总督
//《Level C-570 编辑使用说明（拟定）》
//严禁外传！
//
//0.定义：将流浪者对“信箱”投入的内容物定义为剧本，“信箱”持续内吸过程定义为浏览审查。蓝色字迹为普遍猜测，请自行斟酌。
//一.投入须知
//1.投入内容必须为纸质材料，其上投入内容必须为人类手写，否则剧本不生效并退回，“信箱”消失。
//
//2. 满足条件的剧本在其作者未死亡时不起效，不改变Level C-570本身，投入者越濒临死亡，剧本被真正实行的进度越大，即浏览审查的进度越趋近完成。故投入者投入剧本的几种方式：在非C层群时向“信箱”内投入自写的剧本后自刎（不建议）；意外死亡，剧本被他人投入“信箱”或运气极佳，自行滑落掉入“信箱”（概率极低，处邱浩的日记阴差阳错成功外）。
//
//3.当新剧本生效后，层级原状态将被抹除，替换为新剧本内容。
//
//4.对已经成功在层级内部显现的剧本，任何重投，细节上修改后重投都不被“信箱”接受，即剧本与其创造的层级状态均为一次性。新剧本出现后，旧剧本创造的层级状态将永远无法复原。
//
//5. 任何过度完美或过度糟糕的剧本不会被“信箱”接纳，故尝试借此建立类现实世界的天堂或极度恶劣的不毛之地都是不可能的，然而层级的危险程度仍取决于剧本本身（下文详细介绍）
//
//二：层级信息及参数设置
//1.投入的剧本生效后，当“信箱”完成了浏览审查过程后，层级将根据剧本相对应更改形态，尽管各个层级状态差异甚大，其中仍有一定普遍规律，列举如下。
//
//2.1描述：层级内有且只能存在一人。Level C-570似乎更倾向于选择剧本中有关前厅的内容为层级基础。但在素材过少时会随机挑选跟后室或对抽象事物（如梦，意识等）有关描述作为层级补充。
//
//2.2：Level C-570无论剧本如何，都必将为多个无直接联系但在入口，状态，等具有相同元素的“场景”总称。意味着Level C-570永远无单一形态，其至少为两个“场景”的统称。如邱浩的日记“摄影旅行”中产生的5个“场景”。并且“场景”之间必将进行互相转换，分为循环转换（“场景”之间均能转换）或单向转换（即在未离开层级前一个“场景”只能经历一次）。两种转换方式关于剧本语言描述的性质有关。如“摄影旅行”中邱浩描述为连贯性流水式，则其5个“场景”为单向转换。
//
//2.3 Level C-570存在以剧本进行自我添加的能力，不过自行添加的内容在各方面仍受剧本限制。剧本中无效文字越多，层级自我添加内容的可能越大，如“摄影旅行”内的“场景2”极有可能为层级根据邱浩对梦的问题进行的自我添加。
//
//2.4 Level C-570的生存难度与剧本有少量关系，剧本对事件的叙述口吻越差，层级危险性就越高。但由于后期“药店-阶梯教室”状态危险程度似乎不与其剧本完全相符。故有待证实，在此建议流浪者对于任何材料的书写中口气尽量温和，以避免不慎改变Level C-570的危险性。
//
//2.5 Level C-570无论剧本如何，必定为多个无直接联系，但在入口，性质，状态某方面上高度相似的“场景”总称。场景之间的分割可能由剧本的分段组成。“场景”作为Level C-570的组成部分，在未知剧本生效后，“场景”之间的相似处成为唯一能判断其归属Level C-570而非独立层级。故因此不建议任何其余组织或流浪者自行投入剧本。
//
//2.6 尝试投入已经存在的层级的描述被证明是无效的，这代表试图复制一个已知层级是不可能的。鉴于综上Level C-570中对于剧本的重重规定，以及“信箱”极难寻觅到，故对Level C-570的实验很有可能将以年为周期，经过多次测试，以确保更多未知信息被发现，与层级内相对的稳定。由此，绝不允许任何其他组织，团体打搅对于Level C-570的实验。
//
//2.7 部分人员认为层级的编辑次数是有限的，但其对次数耗尽后Level C-570的状态无任何答案。
//
//2.8 完全未知到实体是否因剧本的不同而变多变少。目前M.E.G.总部仍在努力尝试第七次层级实验。
//
//三：基地，前哨与社区。
//1. 由于层级本身未知性高，时常变化，且同一时刻只能有一人存在，故建立基地，前哨或社区的可能完全为零。
//
//2. 截至此说明撰写时刻，在“场景2：阶梯教室”的讲台上仍有少许由流浪者与探员自行摆放的物资。后续层级变化，将再进行报告。
//
//四：入口与出口
//1. Level C-570的入口只会在剧本的作者曾经到达过并在剧本中提及的层级出现，某些时候则只需满足前者条件。入口形式似乎为剧本作者在前厅中的职业代表的工作物品。
//
//2.由于Level C-570因剧本作者不同而入口数量也不同，故应定期检查层级入口及内部状态，对于新报告的文档，请先确实不为该层级的新发现“场景”
//
//3. Level C-570的出口目前是唯一未找到普遍规律的信息。大致认为层级出口为与当前层级状态某些元素相似的层级。其余未知
//
//五：其他及补充
//1. 邱浩的日记中层级选择的片段未使用确切的人称来描写内容。导致流浪者进入层级时以“旁观者”视角出现。表现为坐在副驾驶位，无法离开座位等。反之的，在“药店-教室”状态内，剧本作者使用第一人称，故流浪者进入层级以“当事者”视角出现。
//
//2.流浪者及内部人员在层级探索时见到疑似Level C-570“信箱”时，请及时上报。
//
//3. 志愿填报：在此招募Level C-570内剧本志愿作者。要求如下：
//1.涉足层级数量少，建议控制在Level 0至Level 8之内。
//2.有奉献精神，愿意舍己为人。
//3.能结合前厅内经历撰写文字内容。
//4.志愿奖金，权限等面谈。
//如有愿意人员，请上报M.E.G.总部或在此文档讨论区表明意愿留言。
//
//基地、前哨与社区
//上文提及
//
//入口与出口
//上文提及
//
//
//
//
//
//（两名管理员的对话）
//
//M:你说这个什么Level C-570究竟有什么用啊。唯一有用的就是能编辑，结果“信箱”难找的要命，还要死个人，写完也不知道能不能用，状态还不能保存。要是某些别有用心的人发现了这层级不得直接完蛋。
//
//T:要我说这玩意的开发价值还不如Level C-152，就是个没法用的累赘，还要担心给别的家伙掌握了。
//
//M:确实。
//
//T:你就没想过拿这个层级做点什么吗？
//
//M:你是什么意思？
//
//T:反正总部也不知道“信箱”在哪，对于我们来说这个层级等于免费开放啊。
//
//M:你要去填那个离谱的志愿填报？那东西要人命还奖金面谈，真是笑死人不偿命。烫手山芋自己都捂不住了。
//
//T:反正报这个的无非就是那些想死但又非想做点什么贡献能自我感动的人。这些人哪个不是跑了千百个层级的。只要“信箱”找不到，实验进行不了，这山芋迟早得炸，到时候等着好戏看了。
//
//M:你要掩藏“信箱”？
//
//T:…不是…将计就计。我们想办法让上头的把这个工作给我们，如果有傻子自行上门那我们能拿个功勋。没有的话去Level 11找不知情的志愿者就是，在那喊邱浩的大名自然有人会来。
//
//M:何如？
//
//T:自从他们知道邱浩的事情后个个觉得感同身受，什么共情愧疚的都出来了，还要搞游行，真是胡闹。打感情牌谁不会哦。
//
//M:你确定这可以…再说你现在搞这个层级也没啥意义啊。
//
//T:这个层就是个大型编辑器，只要有人想他就会出现，至少我认为。
//
//M:“信箱”不这么想。
//
//T :那叫“周游列国”，从各个地方收集剧本的措施罢了。依我看，它肯定有规律的，毕竟这层级自己都能创造东西，它还能不知道哪个其他层级收到的剧本最多？
//
//M:Level C-570又不是个实体…再说了你这要等到猴年马月。
//
//T:你很快就会知道了。
//
//对管理员M与T的监听中截取的可疑片段。目前两人均已被停职并接受调查。据管理员T所述，自己并非意图抢夺Level C-570使用。张贴此录音以警醒各位管理员及以上权限人员清醒，认真对待总部指令，对于具有重要意义的层级注意言行。
//
//
//
//
//
//
//
//作者信息
//« Level C-569 | Level C-570 | Level C-571 »
//
//脚注
//1. 目前所有进入前Level C-570的入口均无效
package lvls15x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1570{}