//Level C-529
//评分: 
//+20
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
//安全
//稳定
//无实体威胁
//Level C-529是后室C层群的第529层。
//
//描述
//传回总部的4份报告显示，Level C-529具有某种奇特的性质，使得探索者极其难以切入该层级，切入后的所有探索者也永远不会相遇，并在1-3天内随机切出至一个安全的层级（通常是Level 11或Level 48）。
//
//该层级还存在一种特性，此特性会使进入该层级的探索者不由自主感觉熟悉而安全。不过，该层级至少目前没有发现任何威胁。在切出该层级时，探索者常伴随有对各种回忆的定向缺失，包括但不限于层级内城市的店名和路名，小木屋内书本的名字，曾经喜欢的乐队、歌曲名称，亲人的姓名，甚至自己的姓名等。
//
//目前已记录在档的4份报告显示，该层级应至少拥有四个区域：城市，沙滩，小木屋及[数据删除]，但它们的时间都停留在夏末，且存在友善实体“居民”。下面是每个区域的具体描述和4份原始报告的副本。
//
//城市
//该层级的城市部分是一片建筑风格略显老旧的小城。小城主体建筑是三到五层的小型居民楼，一层通常是商铺，二到五层为住户。楼房大多墙体已经开裂，甚至生满苔藓或遍布锈迹，显出少有人打理的模样。城中分布有大量“居民”，但这些“居民”一般都是被动的，偶尔会主动与流浪者打招呼。
//
//城中只有一条东西向的主干公路和若干小巷，大多数小巷是可以通向居民楼内部的。楼内住户是上锁的，开锁的唯一方式是找到与住户对应的“居民”并向其提出请求，对方一般会欣然接受。房间内部一般只有沙发、床、台式电视、收音机等老式家具，且多半已老旧不堪，不过本层的各种房间包括商铺内都可以找到杏仁水等必要物资。
//
//该区域似乎存在循环，即如果流浪者在道路上向一个方向行走超过十英里，他们总会回到一开始的起点，且一切景观都不会发生变化。该区域的具体大小也因此特性目前难以知晓。
//
//沙滩
//该层级的沙滩部分是一片白沙滩，其大小目前未知，但已确定的是流浪者无法走向内陆，亦无法走向大海深处。所有类似的行为最终都会导致其被传送到沙滩中央。沙滩部分的海浪遵从一般潮汐规则，存在交替的涨潮和落潮。沙滩上会存在各种颜色的贝壳，甚至可以捡到装有空信件的漂流瓶。
//
//从入口处沿沙滩向东行走约二十英里，可以看到几座茅草房，这也是本部分目前已知发现“居民”实体的唯一区域。“居民”通常会热情地招呼你用餐和住宿，食品通常为各类海鲜制品，味道和口感据流浪者评价极佳。
//
//如城市部分一样，沙滩部分也存在循环，即从茅草房开始，如果朝一个方向行走超过五英里，就会重新被传送回茅草房附近。
//
//小木屋
//该层级的小木屋部分是一座占地面积约800平方米的小庭院，主体建筑是一幢小木屋，另外还有一片小池塘，一个与木屋同样材质的仓库和一片小花园，花园内种植有各种未知花草。屋内各种家具齐全，目前已知包括台式电视，收音机，书架，壁橱，壁炉，两张木床，老人椅等。
//
//居住在此的唯一“居民”被描述为一位年事已高的老奶奶。她似乎不像其他“居民”一样有语言能力，但对待流浪者的态度依然友善。另外，据悉此部分存在许多好吃的甜饼，且每天都会刷新。
//
//小木屋区域的面积是有限的，在小木屋外围是无尽的松树林，其具体大小无法测量，但已知其似乎可以使流浪者产生边界感，即他们通常会将松树林当作此区域的边界而不会试图进入松树林。
//
//[已删除]
//该层级的[已删除]区域是一处泗週壹媥嘁黒
//
//（已修正）该层级不存在[已删除]区域。
//- 收起
//报告001（于2015年9月22日入档）
//大概是14日清晨吧——抱歉，我还好，只是想到那几天的事情，我的大脑现在还会隐隐作痛——我在Level 48的海滩上散步，就像我以往每个星期天会做的那样。周末总是让人愉快的，正当我这样想着的时候，一股沉重的睡意袭击了我——
//
//没错，它是像一种生物，一种实体一般钻进了我的身体。我能感觉到他，但是我无法挣脱他，就像是我的思想将我的身体塞入我的回忆一般，霎时间我的脑中如灌铅一般沉重。我慢慢倒地，闭上了眼睛。
//
//再次醒来的时候，我的眼前不是沙滩和椰子树了。我正躺在一条红色石砖铺成的路的中央。四周是低矮的建筑，似乎是居民楼，不过六层，看起来有些老旧，墙体刷了淡黄色的油漆，墙面上爬满了空调外机和电线、水管一类的东西，有些低矮阴暗的地方甚至长满了苔藓，部分墙皮也已经开裂。不过，那股沉重的睡意已不复存在，我的大脑开始运转——意识到我切出了。
//
//ab495214eb8ab75a.jpg
//报告001中所拍摄的Level C-529城市的一隅。
//
//我爬起身，试探性地开始探索这个地方。
//
//我走进其中一座居民楼，一股霉菌和杂物的混合气味扑面而来。讲真，不是很好闻，但我似乎很喜欢。楼里是石头砌成的螺旋楼梯，有些窄，每层两间房间，一直延伸到顶楼。房间的门基本都用厚重的锁锁着，有些还上着门栓。赤手空拳打开他们似乎是不可能的，我于是走下楼去。
//
//沿着最宽的一条巷子走，便到了这片居民楼的外面——这是一条双向的公路，据这里的路标所说，是东西向。虽说是公路，但感觉年久失修，路面上有急刹车留下的痕迹，还有不少不平的洼坑——老实说，我觉得这里的装修不怎么样。
//
//这是一条平直的公路。我试图走到它的尽头，或者找到一条新的公路，但似乎是不可能的。因为每一处都是尽头——我永远会回到这条巷子与公路的交叉口。是的，我走了至少几公里，那处岔路口至少在我的眼里浮现了二十多次。
//
//新的风景倒是有——这条公路两边栽着高大的行道树，也许是法桐吧，不过看上去没什么人打理的样子，因为它们的枝杈都交叉在了一起，仿佛在互相拥抱。然后是路边的各种饭店，商店，或是理发店等，整齐地排列着，挂着各种五颜六色的招牌。不得不说，我觉得他们的名字念起来朗朗上口，就像是我经常去一样——唔……不过我不记得它们的名字了。什么？别开玩笑。我真的忘记了，相不相信是你们的事。不过没走多远，我看到了一些令我不安的身影：有些像是无面灵的家伙在街上零零散散地分布着。他们身着短衣短裤，在街上零散地对话或游荡。
//
//我保持着安全距离，向他们一点点靠近——我终于看见了其中一个的脸，而他也看见了我。那是一张仿佛被铅笔草草涂过的脸庞，本应是五官的位置被一些黑线层层覆盖着，让人无法辨认出那是人类，还是无面灵，甚至是其他什么可怖的东西。这下它们都过来了。它们的声音也是模糊而低沉的，可我却能听得懂。它们好像在说：
//
//欢迎回家，孩子。
//
//现在想来很奇怪，当时我并不觉得害怕。就像母亲呼唤儿子，故乡呼唤游子一般，那声音让我无比亲切。我用英语尝试问他们问题，他们似乎也能听的懂——我提出向他们交换杏仁水等物资，他们似乎很热情地便去商店里给我捧了一大箱出来。他们又开始说话了：
//
//孩子，请自便。
//
//他们没有向我要任何东西。渐渐地，在我同他们交谈的过程中，越来越多的这些实体向我聚拢过来，我却并无一丝恐惧。他们亲切地称我为孩子，给我一些小孩的玩具，甚至是用一些哄小孩的笑话来逗我，我总是捧腹大笑。白天，我们玩过家家，我们捉迷藏；晚上，我们躺在凉席上，数天上的星星，找哪里是北极星。
//
//没错，后面还有两天。每天都是这样。很幼稚，但很快乐。从未有过的极乐。
//
//第三天，等我再次从睡梦中醒来时，我躺在Level 11的一条无人的马路中央。醒来后，我打了个寒战，因为这里的温度比那里低上不少，仅此而已。
//
//是的，我再想不起来关于那个层级的事情了。哪怕一点。
//
//哦。还有，我想那是夏天，是夏末。
//
//报告002（于2017年3月11日入档）
//那天的事情？那可真是见鬼。朋友，你知道十年前路边那种盗版的小人书吗？五毛钱一本的那种。实不相瞒，我的记忆现在跟它很类似。故事明明真实发生过了——我甚至根本不想忘记，可是它总还是会有缺印还有少印的部分，加上厚重的油墨味。真是难堪的回忆啊。
//
//不过你给我一支烟如何？我会尽力向你回忆的。
//
//谢了。
//
//切出到那个神秘的层级——现在说来是Level C-129——大概2天左右，我的思维已开始扭曲变形。我受够了这种单调的风雪。尽管它的寒冷并不能穿透我厚重的防寒服，但它确确实实冻住了我的心——枯树组成的森林丝毫没有停止蔓延的迹象，它们依旧颤抖着，哂笑着，发出令人厌烦的噪音。我有些绝望，担心自己是否能活着离开这里。或者说——回到温暖的怀抱。我从来没有像此刻一般向往温暖。
//
//忽然，我望见了一束光。
//
//那是……火光？我以为我出现幻视了，可我的眼睛几次三番告诉我不是的。无论我眨几次眼，它巍然不动。我驾驶着双腿艰难向亮光处爬行。逐渐映入眼帘的是一幢小木屋。一幢超自然的小别墅——它与周围的暴风雪显得格格不入。它四周的树木是青翠的，它院子里的小池塘甚至没有上冻。里面没有暴风雪，还长有各种花草，天空是碧蓝的，阳光明澈地洒进来——那一刻我不敢相信我的眼睛。我用尽全身的力气爬了进去，四周的风雪瞬时止息，温暖包裹着我。我感到我的四肢，我的脸，我的大脑在慢慢解冻。那一刻，我在复活！
//
//我可以跑！我可以跳！我可以高歌！我可以欢笑！
//这里不是那个鬼地方了！我逃出来了！
//哦，可以的话，请再给我一支烟。也请我冷静一下。谢谢。
//
//终于，我意识到是否应该去小屋里看看。我环顾了一下，它的主体占地大概五六百平方公尺，正门大开，后门则上着锁。我便从正门试探着进去。“叮铃铃”——是自动门铃的声音。但是似乎里面并没有人——也没有实体在。穿过弄堂，是一方比较宽敞的客厅，有五六个人可以坐在一起的沙发和桌子，还有一台老式的台式电视机，但是似乎没有通电。在房间的一角是壁炉，不过没有点燃——这样的天气大概也没有必要点燃壁炉吧。其他角落里摆了壁橱和书架。书架里塞了五颜六色的书，大概有一些像《悲惨世界》的名著，不过也有一些很奇怪名字的书——或者说绘本？我忘记了。抱歉。这就是我所说我记忆中缺印的部分。不过我记得桌子上摆放着手工烤甜饼，看的出制作者的手艺十分精湛。这时我才突然饿了起来，我毫无顾忌地拿起一个啃了一口——很香，麦芽的味道在口中绽放，就像奔跑在金秋的原野上一般，令人怀念。
//
//cae3146a1e833190.jpg
//报告002中所拍摄的一副Level C-529中小木屋的远景。
//
//我吃掉一个，然后是第二个，第三个……它们真的很好吃，我也真的饿极了。
//
//孩子，好吃吗？
//
//好吃——正当我准备这样回答的时候，我猛然一惊，回头望去，那是一位和蔼的老妇人。我记不清她具体的长相了，她也许是有一张圆脸，有好看的天蓝色瞳孔，还有如雪般洁白的头发——不过你们要写进档案是吧？那我还是不提供这些不清的记忆了吧。不过我记得她脸上真的有很多皱纹，多到令我不忍心去猜想其中的沧桑——但她总是笑着，皱纹便顺着微笑舒展开，那是一种天然的美。她应该用“实体”来形容吗？抱歉，她也许是的，不过我一点不害怕她，我试着与她交谈，可她除了上面的那句话，再也没有说过一个字，她总是笑着，不管我说什么都笑着——当然，我没有说什么不堪的话——有时甚至会拿她那粗糙的手轻轻抚摸我的脸庞——很温暖。真的很温暖。如果说从那样的鬼地方逃脱到这片绿洲是解脱，那么她的抚摸仿佛是升华，我的心温暖地在我的胸腔里跳动起来，共鸣起来。
//
//再尝试和她说话也是徒劳的，明白这一点的我便探索了整个屋子，也拍下了几张照片，嗯，他们都在这，也许能帮上你们的忙。我真想一辈子留在那里，尽管那里只有我和她，只有几百平米的小院和一望无际的森林。但那里似乎就是我的家。我爱住在那里。
//
//aa4546d49c5c1c28.jpg
//Level C-529中小木屋的一个房间——也是该流浪者居住的房间。
//
//我看过那里的书，我闻过她养的花，我听过她坐在老人椅上发出的吱呀响声，我触摸过每一处橡木制成的墙壁和地板——
//
//然后我全部忘记了。我忘记了她的脸，那些花的芬芳，那些书的文字……夏末的记忆，一去不返。我醒来便在这里——Level 48。最后，感谢您能听完我的故事，不介意的话，能再给我一支烟吗？
//
//谢谢。真的很感谢。因为不知为何，我的泪水刚刚差点就涌了出来。1
//
//报告003（于2018年11月16日入档）
//抱歉。由于时间太短，我没来得及拍照。我想我还是尽我所能口头叙述一下吧。
//
//那天天色很暖。我正行走在Level 48的一处沙滩上，准备去和当地的居民交换些物资——忽然我开始头痛，如同大脑被撕裂一般的疼痛。我似乎听见脑海中有个女性的声音在呼唤我，眼前的环境随之开始天旋地转，我只能闭上眼睛——大概过了十秒，或许十五秒，我睁开双眼。眼前仍然是沙滩，但我感觉出这不是Level 48。肉眼可见地——这里的沙子更白，也更柔软。
//
//我试着伸手去捧起一把。洁白的沙子慢慢从我手的缝隙中留出，给我一种从未有过的欢愉和轻松之感。——我想着留下一些沙子的，因为我真的很喜欢它们。可是随着我后来切出回到这里，它们不见了。啊，不过这是后话了。
//
//海岸线绵延大概有几十英里，那洁白的沙滩我望不到头。海面上是碧绿的浪潮，不时有海鸥飞过。我想那时大概是落潮，海水退下去很远，露出一些被打湿的棕色的黏黏的沙子和裸露在沙滩上的贝壳。我还看见了许多红色的贝壳，它们真的很迷人。我想我喜欢这个层级。我沿着海岸线从清晨走到傍晚——因为我能看见太阳从东边一路跑到西边，最后把天边染红——我找到了几幢茅草搭建的民居，门口站着一些身着沙滩裤，甚至赤裸上身的人——嗯，大概是人？不过他们的脸庞是模糊的，像是用水彩匆匆涂上的一般。我并不害怕，他们也很热情地过来，他们拥抱我，甚至用他们那没有轮廓的脸庞亲吻我。他们还说：
//
//苏珊，亲爱的，是时候吃晚饭了。
//
//桌子就摆在沙滩上，晚饭很丰盛。没错，我想我平生还是第一次吃的那样满足——有酱烤的鱼，红烧的螃蟹，以及用一种特制的酱料配上有我手那么大的海螺。海洋的味道真的令我流连忘返。吃完这顿晚饭，我们还聊了很多天来着。他们很健谈。从喜欢的乐队到沙滩的风景，他们无所不聊。只是我想我没听说过什么橘子苏打乐队2，亦或说，谁是苏珊？
//
//不过，等我在沙滩上睡下之后，我便又回到了那片熟悉的沙滩。我拿来交换的物资还在我脚边，海风的味道也不如那般清新了。一切都结束了，仿佛就在一瞬间。美丽而永恒。
//
//等等，你说我叫苏珊？哦不，不可能。不过，我的名字是什么来着？
//
//报告004（于202X年X月X4日入档）
//警告！此文档已被删除或修正。
//如有疑问，请求助本层级管理员。
//
//
//基地、前哨与社区
//由于本层级的不稳定性，目前已知的任何人员都无法在本层停留超过3天，因此本层没有也无法建立任何基地或前哨站。
//实体
//“居民”
//“居民”是目前只发现于Level C-529的一种特殊实体，他们身高在1.5-1.8米不等，具有人类外形，人类着装和人类行为，只是大部分“居民”的面部特征模糊而无法辨认，这也是区分“居民”和流浪者的主要方式。“居民”具有语言能力，但不同于人类的语言，他们利用直接与对话者进行内心交流的方式进行沟通。但其仍然可以发出一些模糊而难以辨别声音，这种声音的具体用途目前未知。
//
//“居民”对待流浪者的态度通常是友善甚至积极的，他们有时会主动亲近流浪者，甚至提供杏仁水等物资，如果流浪者向他们提出请求，他们也总是乐于接受的——只要不是太过分。
//
//入口与出口
//入口
//由于本层的特殊性质，下面只提供一些已确定的被动入口。主动切入该层级的方法尚未查明。
//
//在Level 48的海滩上，被不明睡意袭击，醒来后会切入到该层级的城市或沙滩区域。
//在2018年3之前，在Level C-129的木屋内渴望回到温暖的地方，有几率会切出到此层级的小木屋区域。
//在Level C-7试图[已删除]，会被传送到该层级的[已删除]区域。
//出口
//在这里待上一段时间，便有几率被随机传送至任意一个被认为安全的层级，且通常是Level 48或Level 11。尚未发现主动离开此层级的方法。
//您好，Dr.S，请输入您的管理员秘钥以查看该层级的保护文档。
//已确认。再次警告：如果您非该秘钥的指定使用者本人，请不要查看下面的文档并立刻关闭该页面。
//- 记住那些美好的时光吧。在夏日未尽之前。
//报告004（于2020年2月14日入档 2020年2月18日修正并保护）
//-记录开始。
//总部：529号，听得到吗？你还好吗？为什么要试图@……&*￥？
//
//529号：笨蛋……怎么可能好啊……明明已经在这种鬼地方，连@……&*￥都做不到……
//
//总部：你能听到吗？你的信号在明显@……&*￥！听到请回复！
//
//529号：他们在吵些什么？可恶……这里又是哪里……这该死的切出……
//
//少女的声音：那个……先生，您能听得到吗？
//
//529号：……谁？
//
//（四周的环境无比黑暗，我伸手不见五指，我本来还以为切出到了Level 6。可事实证明并不是。因为仿佛是从我的思想深处，有声音在呼唤我——那是甜蜜而温和的声音，却夹杂着难以名状的悲哀——这是Level 6不会有的。它仿佛塞壬的歌声，一点点将我拉过去。我或许姑且称那个声音为塞壬吧。）
//“塞壬”：对不起，但你真的能听见我吗？
//
//529号：傻瓜，听不见你我怎么能回应你啊。
//
//“塞壬”：抱歉，因为以前没人……听到过我。难道……我惹你生气了……吗？
//
//（她的声音中夹杂着哭腔，我不知道是不是我气头上的那几句恶语的作用。但事后我想，我的确是个粗鲁的人。她不是塞壬，她从来没有让我失智，她甚至不是实体，我却说了些什么！）
//“塞壬”：对了，你是想知道这里是哪里是吧？这里是Level C-529，至少你们那里是那么叫它的吧？可是对我来说，这就是我的家。仅此而已。
//
//529号：你的家？你住在楼层里？
//
//（我有些恐慌。一些可怕的记忆在我脑中一闪而过。我条件反射一般去拿别在腰间的手枪。）
//“塞壬”：不要！很疼的……吧？
//
//529号：对不起，如果遇到生命危险，我只能这样做……为什么说会很疼？
//
//“塞壬”：他们……他们告诉我了。
//
//529号：……谁？
//
//“塞壬”：像你一样的人。也穿着这样笨重的防护服，拿着那种有长有短的棍子……是叫枪吧？我和他们做交易。我用……
//
//529号：你到底是什么人？？？
//
//（显然，作为一个后室探索者，我并不够格。我真的已经恐慌到了极点，不安的感觉如藤蔓一样从脚踝爬上我的脖颈，然后死死缠住我。）
//“塞壬”：对不起！我忘记……忘记自我介绍了……叫我丽萨吧。你的名字是？……啊……
//
//529号：怎么了？
//
//丽萨：对不起。我明明知道你的名字的。529号先生，对吧？不过是很奇怪的名字啊。
//
//529号：你怎么会知……
//
//丽萨：真是的，你妈妈没教过你要好好听别人说完话吗？我刚刚想说，我跟你们做交易对吧？是这样的：我给你们看你们最想看的东西——夏日的回忆——他们当然是最美好的了，起码对丽萨来说是这样。然后你们就可以给我寿命……不过居然要知道你们想看的东西，肯定要先知道你们的所有想法，也就包括你们的记忆……
//
//529号：我们所想要的……换取……寿命……寿命？？？
//
//丽萨：是的，但是529号先生，我很抱歉我没法给你看你想要的东西……并且或许那根本不是你想要的东西。没有人想死。我知道的。包括我也一样，所以才必须一直这样做着交易。也许还要做十年，二十年，甚至一百年……即使每次都很痛苦，每次都很不舍……
//
//529号：等下，你说的寿命交易具体是怎么回事？我们怎么给你……啊……
//
//（我的头突然开始剧烈地胀痛。仿佛万千思绪和回忆要脱离我的大脑喷涌而出。我猛地捂住头想蹲下来——如果这里有空间存在的话。）
//丽萨：啊……抱歉！真的很抱歉！虽然我已经做过几笔交易了，但果然对流程还是不熟练，尤其是对您这种特殊顾客……对不起。我究竟看到了什么……
//
//丽萨：……对不起，对不起。真的很抱歉我看到了那样糟糕的东西。可丽萨不明白。十年前的灾难，为什么要一直放在夏日里最珍贵的位置呢？丽萨也不会窃取那样的记忆，那样只会让你痛苦，也让我更痛苦。丽萨也是。在丽萨还很小的时候，家里发生了巨大的灾难，丽萨从此再也没有见过爸爸妈妈，甚至邻居的爷爷奶奶，甚至公园里一起玩的猫咪。然后我就到这里住了下来……
//
//丽萨：%#&^&叔叔告诉我在这里，想要活下来，就只能在这里，靠收集他人的幸福回忆化为自己的寿命，不然便会死去。丽萨不想死。爸爸妈妈那天最后告诉我了——丽萨听见了，他们让丽萨好好活下去。但丽萨也不想伤害别人。所以……我想起用这种交易的方式，哪怕给他们记忆消失之前最后的一点欢乐……所以……我真的很抱歉。对不起爸爸妈妈，对不起那些叔叔阿姨们……也对不起你……
//
//（十年前的灾难……那些仿佛马上就要喷薄而出的思绪仿佛突然又收束在一起。我想起来了。十年前的那个夏末，我还身处前厅，远离这片毫无章法的混沌世界之时，一场地震突然袭击了我的家乡，我失去了母亲，后来被继母和父亲残忍地扔到了孤儿院。）
//（我无法忘记那一天，从那天开始，我便开始抑郁，甚至想要自杀了。毕竟活着——甚至还是在这种时刻都要为性命而担忧的地方活着——又有什么意义呢？直到上一秒，我还坚定地这样认为。但现在——我想发出声音回应她，呼唤她，可剧烈的疼痛感依然像麻醉了我的神经一般，令我连一个完整的呻吟都无法发出）
//丽萨：真的很抱歉，529号先生，我想我会尽快送你出去的。不过丽萨很感谢你，因为你让丽萨知道了——当丽萨认为自己已经很悲惨、很需要幸福的时候，会有人比丽萨更需要它们。所以丽萨决定了，有两件事想拜托你，可以吗？
//
//（她的声音逐渐开始哽咽，我却无能为力。）
//丽萨：第一件：出去以后……请好好活下去。并告诉他们吧……告诉他们这里的一切。不要让他们再来了，让他们珍惜好自己的幸福吧……丽萨不想再用这种方式……让任何人失去幸福了。况且，如果你们不再来，丽萨也就不会死，也不会存在了……或许这样也就是永生了，不也很好吗？第二件：虽然丽萨这样决定了，但是请……记住丽萨。记住这里……曾有过的每个夏日吧——你会看到的，他们多么美好，多么璀璨，可现在……
//
//（四周的空间突然开始崩塌——尽管还是一片黑暗，但我可以清楚地感觉到，那个声音正在逐渐消逝，逐渐缥缈不清，思维也开始回归我的大脑，随之而来的是无数个欢乐的夏日——但这些记忆似乎是有生命的，我感受到他们不属于我，却拼命想融入我，他们在我的颅腔中炽热地跳动……我开始大喊丽萨的名字，我求她留下，我绞尽脑汁回想自己的幸福，想与她进行交易，哪怕献出自己的生命……可这一切都无济于事。空间开始旋转，我知道自己又要切出了。）
//丽萨：是时候再见了，529号先生。现在，这里的夏天要结束了啊。
//
//（我惊醒。我发现我躺在Level 48的一处沙滩上。海风拂面，夕阳斜照，她给我的那些夏日回忆，此刻依然历历在目。）
//总部：529号？谢天谢地，现在信号终于好些了。过去的几分钟你到底发生了什么？现在请让我重申，自杀这种行为是违反组织规定的，不但会对自己的个人利益造成无法挽回的损伤，更是……
//
//529号：去他妈的%&&#￥#
//
//-记录结束。4
//
//
//是的，这里只是你的夏末。
//这里的一切都只是你记忆的碎片。它们从未消失，只是在你自己的最深处，在她的守望中，默默地等着你。
//
//选择把他们遗忘的，只是你心中的阴霾。
//
//你也许不记得儿时的天真了？她记得。
//你也许不记得曾经欢乐的沙滩旅行了？她记得。
//你也许不记得在小木屋中默默等待你归来的奶奶了？她记得。
//你也许不记得自己曾想抛弃一切回忆以死来结束自己看似不完美的一生？她记得。但她不会让你这么做。
//
//你的生命，你的回忆，永远是你最宝贵的财富。
//哪怕你身无分文
//哪怕你陷入绝望的深渊
//你也可以轻轻叩响记忆的门，拿出回忆的珍藏
//
//你永远是世界上最幸福的人，而且你的幸福绝无仅有
//——这是她教给我的。
//
//丽萨是个好孩子，也请正在读这篇文章的你，在你记忆的宝库中记住她，也记住她对你的爱。
//哪怕我们素未谋面。
//哪怕我们再也不会重逢。
//哪怕这个夏日又要迎来终末。
//
//但是
//我的朋友啊
//下一个夏日
//
//总会来的
//作者信息
//« Level C-528 | Level C-529 | Level C-530 »
//
//Footnotes
//1. M.E.G.总部曾对该流浪者的档案进行了调查，得知其祖母于2015年8月于前厅离世，死因是突发心梗。离世前一天晚上，她曾在等待该流浪者回家看望她——而该流浪者由于工作原因并未能见上她最后一面。
//2. 包括许多证人在内的多重可靠证据显示，该流浪者，或者叫苏珊曾经很欣赏该乐队的歌曲。
//3. 由于Level C-129的特殊性质，该层级目前已变得温馨而宜居，故该入口通常被认为只在此时间节点之前有效。
//4. 在递交这份报告以后，M.E.G.总部未曾再见过529号，也不曾再收到其发来的信息。此后，亦无更多切入Level C-529的报告。
package lvls15x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1529{}