//Level C-540
//评分: 
//+23
//+
//–
//X
// 
//
//生存难度：
//等级 E - 变化
//
//安全性变化
//稳定性波动
//非实体危害
//Level C-540是后室C层群的第540层。
//
//描述
//Screenshot_20221114_140410_com.huawei.photos.jpg
//一个位于Level 11的Level C-540的微缩模型。
//
//Level C-540的外观类似于一个大型的钟表表面，其半径约为10千米。表盘，即层级的地面为瓷制，但其未知地无法被破坏，也没有任何一处污渍，即使出现后天性的污渍，也会产生类似于Level 5的效应，这同样适用于尸体或其他掉落在表盘上的无生命的杂物。若将耳朵贴近层级的地面，能够听到齿轮的转动声，和嘀嗒声。仔细观察可以发现地面拥有菱形的纹理。层级地面的边缘，即钟表的边框为金制，经初步检测后被判断为纯度极高的黄金，但其同样无法被破坏。
//
//Level C-540的环境像是处于高空中。在通常情况下为白天，但无法看见太阳，四周拥有未知来源的稳定光源。站在钟表的边缘向下观察，可以目测到其整体厚度约为30米，同时可以看见类似于Level 198的云层。
//
//和普通钟表一样，层级的钟表具有时针，分针，秒针三个指针。时针长约5千米，距地面约1.4米；分针长约9千米，距地面约1.2米；秒针长约8千米，距地面约1米。指针为铁制，且异常的薄，厚度仅有5厘米左右，但仍然无法被破坏。这些指针通常严格按照前厅的北京时间标准运行，可被用于确认时间。但受此层级的特殊性质影响有时会发生变化。本层级的时钟数字不同于正常时钟，拥有13个数字，其多出来的那个数字是0。数字0位于12与1间，但这13个数字之间的距离依然是均匀的。
//
//流浪者刚进入该层级时可能位于表盘上的任意地方，但至少会距离边缘三公里 。
//
//塔楼
//在层级内钟表的中心，有一栋高约四十米的圆柱形塔楼。外表由混凝土制成，被漆成黑色。从外部观察可以看到塔顶有一座时钟和类似探照灯的设备。塔顶时钟上显示的时间并不正常，本层级最初发现时它显示为5:24，而到现在，它的时间已缓慢变为7:43。
//
//塔楼内部空间比外部看起来更大，具有多层的结构，在第一层是一间拥有类似于储物室的布局的空旷房间，其中堆着一些木箱，里面可能装着生活资源。有基地被建立在此处。
//
//在第二层是一座图书室。其中的书本按照纸张和装订来看几乎都与前厅的20世纪初的工艺无异。一些书本用英语和法语撰写，极少数为古汉语，但大多数书本使用的是一种未知的文字。所有书本上记载的东西都并不被我们所理解，但在经过分析后可以推断这些书大多为工程技术性的书本，也有记载着近似于魔法的奇特书本。据报告，书本有时候会因为未知原因被移动，或是某一页出现之前没有的笔迹和批注，原因未知。
//
//塔楼第二层往上，以及第一层往下的地下室均无法进入。但是通往它们的门却似乎经常被打开，尽管没有人确实观察到，但是通过在门缝里夹上自动铅笔笔芯等方式可以间接确认。这些无法进入的地方被猜测控制着整个层级的运行。
//
//实体
//在Level C-540被确认的实体仅有尸鼠，且数量极少，它们盘居于中心点，行为亦已与家鼠无异。
//
//时切现象
//在正常情况下，本层级几乎不会出现任何危险，躲避指针也很简单。但当本层级的月份处于质数时，名为时切的特殊现象将会发生。每次时切现象发生后，塔楼顶部的时钟的数字会增大一些，逐渐趋于12点整。
//
//阶段一
//在到达质数月份的第一天中午12:00开始，天空会渐渐地变为全黑，同时之前的未知光源将会趋于消失，直到流浪者的视野只能勉强看见自己脚下。这一阶段的转变大约为3分钟，同时将会保持5分钟左右无事发生。但是和Level 9一样，人造光源仍然是有效的，建议流浪者提前备好此类物品。
//
//在此阶段，即使环境温度经测量并未变化，流浪者仍会出现一种浑身不适的发冷感觉，以及出现轻微的发热，通常在37.8℃~38.4℃之间。这被认为是一种因生命体征的轻微减弱而造成的免疫系统应激反应，被称作时蚀症状。
//
//阶段二
//在阶段一持续5分钟后，阶段二将会开始。此时表针的旋转速度将缓慢提升至原本速度的10倍，表针提上速度所需的转变时间至少需要1分钟。在转变过程中其周围会同时开始出现一层浅蓝色的光圈，类似于激光。对其进行检测将异常困难因此目前无法做到，但可以知道的是即使只是被它蹭到都会造成不可逆的伤害。此时本层级将会变得十分危险1，建议呆在基地内，或者快速离开本层级。
//
//此阶段的指针上的光圈会给流浪者一种毛骨悚然的恐惧感，被其造成不致命伤害的流浪者的时蚀症状会加剧，其伤口周围一圈的组织会变为浅蓝色，在3~5天后蓝色部分会转变为碳酸盐并从身体上剥落，伤口处无法通过任何方式治疗或修复。
//
//阶段三
//阶段二的持续时间不定，最多持续一个月，可以确认的是直到当前质数月结束，或是层级内已有的活物尽数因指针伤害而死亡，又或者他们全部进入塔楼内部后，阶段二将可能会过渡至阶段三。
//
//此时如同时间倒流一般，层级的环境将会在5分钟内回到原本的正常状态。同时没有被指针切割到的流浪者将会恢复正常状态。时钟将继续按照标准的北京时间运行。
//
//在此之后若时间仍处在当前质数月内，则本月仍有可能再次发生时切现象。
//
//基地、前哨与社区
//M.E.G.基地「时钟守护者」
//基地位于Level C-540钟表的中心的塔楼中。
//拥有稳定的物资补给。
//会接受流浪者的借住，且会为流浪者提供帮助。
//常住人口10人。
//塔楼外层的黑色油漆被他们涂上，因塔楼不具备自动清洁属性。
//- 隐藏
//有两位成员在塔楼内探索时因未知原因消失。在其生前与基地其他人的通话中提到了他们进入了塔楼的第三层，但这无法被证明。其他人最后只在第二层通往第三层的楼梯上发现了两堆碳酸盐。这两名成员被认为已经死亡。
//
//入口和出口
//入口
//在大多数有建筑存在的层级切入一个类似于Level C-540时钟的微缩版。这些时钟模型对流浪者存在一种吸引力，原因未知。
//出口
//切入钟表上的数字可以到达对应层级，每一个数字都被以其对应层级中的标志性建材所构成。
//- 隐藏
//数字0的样子是潮湿的黄色地毯，切入可到达Level 0。
//数字1的样子是混凝土地面，切入可到达Level 1。
//数字2的样子是管道扭曲成的，切入可到达Level 2。
//数字3的样子是镶入地面的红砖，切入可到达Level 3。
//数字4的样子是类似于办公室的白色瓷砖地面，切入可到达Level 4。
//数字5的样子是整洁的红地毯，切入可到达Level 5。
//数字6的样子是黑漆漆的空洞，切入可到达Level 6。
//数字7的样子是一片深不见底的水，潜入可到达Level 7的海洋海面区域。
//数字8的样子是不规则的岩石地面，切入可到达Level 8。
//数字9的样子是有积水的沥青质的马路地面，切入可到达Level 9。
//数字10的样子是犁过的农田，切入可到达Level 10。
//数字11的样子是干燥的沥青质的马路地面2，切入可到达Level 11。
//数字12的样子是一片空白3，切入可到达Level 12。
//若从时钟边缘跳下去，流浪者会经历坠落并自然过渡到Level 198或者进入虚空。
//作者信息
//« Level C-539 | Level C-540 | Level C-541 »
//
//Footnotes
//1. 主要来源于此时6秒转1圈的秒针
//2. 注意不要跟数字9搞混
//3. 类似于虚空
package lvls15x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1540{}