//Level C-574
//评分: 
//+25
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
//安全
//稳定
//极少量实体
//Level C-574是后室C层群的第574层，最早发现于2022年3月5日。
//
//levelpornstation1
//一张本层级的照片。
//
//描述
//Level C-574是一座占地约500平方米的阅览室，其外观接近于前厅县域中学配备的图书室。
//
//Level C-574共包含2个区域:书架区和阅读区。书架区由若干高约2米的书架组成，这些书架质感类似于ABS工程塑料，边角处均进行了钝化处理。每个书架都摆满了随机排列的书籍。阅读区由若干排列整齐的桌椅组成，其中桌子材质与书架类似，但颜色为暖黄色，且桌面具有磨砂质感；椅子为无靠背的木椅。本层级整体呈现出一种安静、祥和的氛围，似乎与前厅中的阅览室别无二致。
//
//书架上的书籍种类繁多，流浪者可以自由取出书籍阅读，也可以将书籍带离本层级。如果这么做，当流浪者离开本层级约2小时后，原位置会以未知方式随机出现一本新的书籍。
//
//本层级中的书籍以教辅类书籍、经典文学名著、科普杂志为主，但也包含部分网络小说。有报告称部分书籍的内容与前厅中的同名书籍存在些许不同，但未经证实。M.E.G.暂时认为此类报告仅是曼德拉效应的影响。
//
//本层级存在一项特殊机制:每当有流浪者在阅读区读书45分钟，流浪者附近就会随机出现（或消失）一些补给箱，一般包括罐装龙肉、好梦罐和少许其他物资。
//
//M.E.G.新津基地于本层级举办的“获取知识、启智增慧、培养道德”读书交流活动已自2022年10月20日起临时中止，恢复时间另行通知。M.E.G.提醒各位流浪者，本层级虽为安全区域，但请注意劳逸结合，避免因长时间静坐或用眼过度损害身体健康。本层级内部不存在厕所、休息室等设施，如感到疲惫、困倦或存在其他需求时应主动离开此地，以免在未做好充分准备时误切入其他层级。
//
//阅读区偶尔会出现一些难以辨认且意义不明的涂鸦。这些涂鸦一般是流浪者或某些实体留下的。M.E.G.建议流浪者不要在本层级涂鸦或以其他方式破坏本层级的环境，也不要轻信任何涂鸦内容。
//
//仅出于研究目的，M.E.G.记录了部分观测到的涂鸦，列示如下:
//
//为什么这本《哈利.波特与死亡圣器》的结局是哈利与乌姆里奇在一起了啊？？？
//
//世界第一大河是密西西比河来着吗？
//
//求购Object 1“兔子血”和Object C-1“山羊肉”。我是大象，你是鲍鱼。
//
//それは Level C - 43に戻る時間です。
//
//After all this, we have decided to part ways with you. Fuck, Fuck, yet Fucker……
//
//实体
//本层偶尔会出现少量无面灵，但这些无面灵仅会在阅读区阅读或前往书架区拿取新的书籍，较少与流浪者互动。
//
//某些情况下，例如当流浪者在阅读区大声喧哗或者故意破坏阅读区桌椅时，无面灵会对流浪者进行非致命攻击，直至将流浪者驱逐出阅读区。
//
//无面灵会定期清理本层级的涂鸦和其他污物、修复被破坏的设备设施，直至本层级恢复最初的状态。
//
//基地、前哨与社区
//M.E.G.小队
//M.E.G.每隔数日会派遣约20名劳务派遣人员在阅读区边缘驻扎，每次会在本层级逗留约1.5个小时。M.E.G.小队不会进入阅读区，但流浪者可以用从本层级取得的好梦罐向小队换取杏仁水或其他物资。小队不接受任何内容的书籍。
//
//救助管理站（？）
//由5名成员组成。这些人员声称自己是M.E.G.派驻机构且能够提供真伪难辨的身份证明材料。该组织声称拥有专业的精神治疗设备，如果流浪者认为自己需要救助，如存在精神涣散、潜意识失控、短期记忆紊乱或缺失等情况，可以向其求助。
//
//M.E.G.强调，本单位与自称“救助管理站”的组织没有任何关联，请不要轻信上述组织及其成员，也不要接受其提供的任何帮助。
//
//网络小说爱好者
//人员不定。该团体热衷于在书架中寻找网络小说并通过书友会等形式相互交流剧情。自2022年10月起，该团体书友会的主要话题由“域限空间”改为“模因污染”。
//
//入口与出口
//入口
//从Level C-47任意走廊内切出有概率来到本层级。
//进入Level C-270并于三天内离开，有概率在切出时进入本层级。
//在Level C-386穿墙切出有概率来到本层级。
//在Level 11开启任意一扇门有概率来到本层级。
//其他入口有待补充。
//出口
//在书架区切出可来到Level 11。
//在阅读区排泄有小概率切出至Level C-57，但切出失败会被实体持续殴打直至污物清理干净。（应信息提供者要求，不披露此条发现过程中的具体情况）
//被逼着吃掉自己的排泄物会切出至Level C-44。（与上一条由同一名信息提供者提供）
//其他出口有待补充。
//- 错误，授权认证机制失效
//M.E.G.新津基地资源管理局管理委员会办公室关于救助管理站精神治疗仪采购项目的批复
//
//探津审批字〔2022〕127号
//
//
//救助管理站:
//你单位报来的《关于拨付救助管理站精神治疗仪项目的请示》收悉。根据有关专家对该项目的审查意见及班子会决议，现批复如下:
//
//你单位报送的项目不具备现实紧迫性。目前，尚无证据证明Level C-574“缓慢篡改阅读者记忆”这一特性具备危害性。实证研究结论表明，阅读该层级书籍造成的负面影响会在12小时内自行消除，“搭建心智锚点”的有关构想是不必要的。因此，驳回你单位关于拨付救助管理站精神治疗仪项目的请示。
//
//M.E.G.新津基地资源管理局管理委员会办公室
//
//2022年3月15日
//
//- 错误，授权认证机制失效
//M.E.G.新津基地资源管理局关于胡凯同志免职的通知
//
//各分哨站、资源采集组、应急管理中心、救助管理站:
//
//胡凯同志在担任救助管理站站长期间，Level C-574发生恶性事件，且胡凯同志对事件处理不当，造成严重的负面舆情。鉴于胡凯同志任职期间不尽责，经研究决定，免去:
//
//胡 凯 救助管理站站长职务。
//
//M.E.G.新津基地资源管理局
//
//2022年10月8日
//
//- 错误，授权认证机制失效
//M.E.G.新津基地资源管理局关于落实安全生产工作的通知
//
//探津资字〔2022〕332号
//
//各分哨站、资源采集组、应急管理中心、救助管理站:
//
//根据局长办公会精神，现将有关工作提示如下:
//
//一、各资源采集组要高度重视，在单位内部要尽快召开专题会议进行决策部署，严格按照《资源采集暂行条例》规定的内容、传递方式和实现要求，落实安全生产责任，确保每名采集员每15天内最多前往Level C-574一次，且停留时间不得超过1.5个小时。
//
//二、好梦罐是领导干部的重要政治待遇，保证特殊时期好梦罐产量是本局重要的政治任务。为保证产能，各资源采集组应提高政治站位，创新工作方式，通过公开交易等无需接触书籍的方式获取好梦罐。各资源采集组可通过开展“全民阅读”宣传等方式进一步提高群众参与相关工作的积极性，确保本层级好梦罐获取量不低于去年同期水平。
//
//三、应急管理中心继续做好网络舆情监控和特殊时期敏感群体维稳工作。
//
//M.E.G.新津基地资源管理局
//
//2022年10月9日
//
//- 欢迎您，流浪者
//M.E.G.新津基地辟谣声明
//
//近日，部分流浪者在公共网络中传播“Level C-574存在精神性传染源”的不实传言。
//
//经调查，该层级确实存在一种特殊的精神影响。当流浪者注意到该层级中书籍的部分内容与前厅同名书籍不同时，会产生轻微的记忆紊乱现象，此时流浪者对某件事情的认知会被篡改。但是，这一情况的影响是轻微的，且会在离开该层级或远离传染源12小时后逐渐消退。网传“流浪者会将记忆紊乱效应传染给2米内的任何人或其他实体”不属实。
//
//本单位信息发布均由M.E.G.“头条”团队负责，凡由其他来源以本单位名义发布的信息均属谣言，请各位流浪者注意厘清事实，以官方发布信息为准。
//
//不要轻信谣言，不要传播谣言。
//
//M.E.G.“头条”团队
//
//2022年10月20日
//
//- 错误，授权认证机制失效
//M.E.G.新津基地资源管理局班子会会议纪要（2022年11月15日）
//
//参会人员:全体班子成员
//
//会议主题:关于解决遗留问题的二次会议
//
//会议地点：新津基地Wictimi大楼二号会议室
//
//谭固安（局长）:由于Level C-574的问题较为严重，为满足我局工作需要，必须商讨进一步的解决方案。首先请应急管理中心武莉主任汇报一下情况。
//
//武莉（应急中心）:目前，我们紧急暂停了非应急管理中心人员对数据库的编辑权限，因此这件事情还没有进一步发酵。但是，M.E.G.的异常行动依然引起了一些人的注意。为此，我们在层级页面上保留了一点怪谈元素和屎尿屁烂梗，这样的话群众的精力就会被牵扯到无关的方向，以便我们在不引起进一步负面舆情的情况下尽快解决遗留问题。
//
//谭固安（局长）:你这应对的什么玩意？什么屎尿屁烂梗？你最好抽时间去Alpha基地做一下心智检测，下午先把出差审批单交上来。Eric，现在联系到原救助管理站的人了吗？
//
//Eric.Farter（资源一队）:只联系到一部分。一些原救助管理站成员切出到C-57或C-44后，随着记忆逐步恢复，已自行归队。他们中的绝大多数人都对再次前往该层级产生了抵触情绪。一些精神仍受到影响的原救助站成员仍在想办法滞留在该层级，方法和手段不明，但越来越多滞留失败的成员在Level C-44被发现。我们还没有联系到胡凯——似乎在他的认知里我们是不可信的，会主动避免和我们接触。他仍在以自己的方式对流浪者施以“救助”，“受助者”均在Level C-44被发现，且普遍存在营养不良、食物中毒等症状。
//
//谭固安（局长）:好了，不要跑题。齐队，我们的资源采集进度怎么样了？
//
//齐垓（资源二队）:我们目前完成了年初数量指标的约75%，进度滞后的主要原因是Level C-574的杏仁水需求量持续下滑。我们正准备购置一批蓝砂，这种网红食品应该有助于调动流浪者们的交易积极性。
//
//谭固安（局长）:散会后你也去做一下心智检测。费队，你暂时接替齐队的工作，继续做好本期采集工作。
//
//费邬（资源三队）:收到。局长，由于舆情发酵，现在现在愿意前往那个层级的队员不多，我申请聘用一些派对客——
//
//谭固安（局长）:你现在就去做心智检测，立刻。我们洛山基地自成立以来还没这么——你们是我见过的最差的一批B.N.T.G.干事！我希望你们反思一下自己的注意力为什么这么涣散，暂时散会，开会时间另行通知，届时务必提出解决方案！
//
//- 欢迎您，流浪者
//M.E.G.C层群分署
//公告
//
//受限于突发情况，level C-574暂时不对外开放，M.E.G.新津基地、Alpha基地暂停对外业务。请曾造访上述地点及Level C-44、Level C-57的流浪者主动报备行程并前往位于Level C-43的Beta基地接受心智检测和隔离观察。我们为给您带来的不便深感抱歉。
//
//M.E.G.C层群分署
//
//2022年11月20日
package lvls15x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1574{}