//Level C-513
//评分: 
//+23
//+
//–
//X
//M.E.G.Omega基地的通告
//
//您目前所查看的文档为过时版本，请注意甄别信息真伪，点此查看最新版本
//
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//Level C-513是后室C层群的第513层。
//
//photo-1451187863213-d1bcbaae3fa3?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8M3x8c3BhY2UlMjBzdGF0aW9ufGVufDB8fDB8fA%3D%3D&auto=format&fit=crop&w=1100&q=80
//Level C-513中的一个舱室
//
//描述
//Level C-513是一个巨大且绵延不绝的空间站。此层级由一系列载人飞船、居住舱、试验舱等组成，大小从5立方米至30立方米不等。绝大多数舱室存在适合人类生存的空气、气压1、温湿度2。
//
//Level C-513的舱壁3主要由仪器设备组成。操作面板及计算机系统类似前厅国际空间站所使用设备，操作系统语言支持英语和俄语。部分舱室拥有舷窗。
//
//Level C-513的已探明区域已达8267个舱室（约16万立方米），仍无法得知其具体大小。目前为止，所有通过非切出手段离开此层级的尝试均以失败告终，且对此层级的探索表明通向外界的舱门不存在。因此可以推测Level C-513是一个全封闭的非欧几里德空间。通过舱室的舷窗向外看均能看到外界而非空间站的其它部分，尽管可能另一个舱室距离舷窗只有几米的距离。
//
//Level C-513的资源储量丰富，在不同区域可获得不同种类的物资，下面列出部分物资：
//
//居住舱：杏仁水、幸运豆奶、糖果、罐装龙肉、压缩食品、纯净水，在少数舱室可获得皇家口粮。
//医疗舱：常规中型急救包、掌上急救包、常规药物、记忆汁。
//试验舱：常规研究仪器、反欧几里得装置。
//Level C-513的每个舱室均有较强的Wi-Fi信号，但在经过两舱室间的连接区域时会短暂断线。除此之外，无线电波在穿过连接区域时会受到干扰，其程度与跨舱室传输的距离成正相关，这使得无线电通信几乎不可能。已证实声波与可见光的传播不受影响。
//
//实体
//Level C-513内仅有极少量实体，主要为悲尸与脸球。由于此层级的零重力环境，悲尸的力量优势无法有效发挥，但仍需小心飞溅的棕色污泥。
//
//基地，前哨与社区
//探险者总署 - “Ζεύς”基地
//由先遣队伍“Falcon”小队建立的基地，目前作为“Falcon”小队与“Typhoon”小队探索此层级的前线指挥部。
//常驻人数133人。
//考虑到长期处于零重力环境可能造成的健康问题，“Ζεύς”基地每6个月会进行一次换班。
//不结盟贸易团体 - “观测站”货运中心
//B.N.T.G.的一处重要货运基地，借助此层级的零重力环境进行货物运输。
//初步估计常驻人数在70人左右。
//开放贸易，由于物资在此层级很常见，因此价格多为平价。
//“补给区”
//由部分流浪者建立的贸易社区。
//出售一些特殊产品（如太空服、枪械、弹药等），但价格通常很贵。尚不清楚这些流浪者是如何获得相关特殊产品的。
//据称他们存有大量的皇家口粮。
//入口和出口
//入口
//从Level 283堡垒顶端向下切出会到达Level C-513的随机舱室内。
//使用层级密钥进入Level C-28的一扇圆形舱门中，随后会到达“Ζεύς”基地。
//更多入口尚待探查。
//出口
//以大于8.3m/s的速度4撞向任何一面舱壁/舱门可以切出至Level C-28的圆形舱门外。
//触摸一根裸露的生锈管道会被传送至Level 3中。
//将一块皇家口粮按在一面舷窗上，然后来参加我们的派对吧=）
//更多出口尚待探查。
//停止存取信息
//终端 #001
// 
// 
//------
//欢迎，探险者
//------
//
//
// 
// 
//通知
//Level C-513内发现出舱舱口，为避免发生意外事故，保障“Ζεύς”基地人员安全，目前基地人员已全部撤出。
//目前仅有“Falcon”小队、“Typhoon”小队及“眼镜王蛇”小队被批准调查及探索Level C-513，其余人员不得再次切入Level C-513中。
//如您非以上小队成员且正在Level C-513内，请立即离开此层级，M.E.G.已在Level C-28中安排人员接应。
//
// 
//
//附录：采访记录C-513-01
//受访者：F-Cap（“Falcon”小队队长）
//
//采访者：Phillips William（Gamma基地特工）
//
//前言：本次采访进行于事件发生后不久，F-Cap通过Level C-513中生锈管道切出至Level 3，随后被Gamma基地特工发现并送至Gamma基地。
//
//<记录开始>
//
//Philips William：您好，███（F-Cap真实姓名）先生，现在我能问您几个问题吗？
//
//F-Cap：可以，问吧。
//
//Philips William：Level C-513里面发生什么了？
//
//F-Cap：（深呼吸）呃……我们发现了出舱的途径。先从任务开始说吧，之前基地派遣我们小队出去寻找资源。本来这是个挺轻松的任务，所以我们也没带重装备。
//
//[停顿]
//
//F-Cap：我们在路上碰上了一个闭锁的舱门，3号上去开门了。
//
//[停顿]
//
//F-Cap：然后就出事了，这舱门外面就是太空！还是朝外开的！3号一开锁那门就被掀开了！他直接就飞出去了！我下意识抓住了个什么东西，结果我就切出到这地方了。
//
//Philips William：你看清楚舱外的情况了吗？
//
//F-Cap：舱内起雾了，我没看见。
//
//Philips William：那之后你的队员怎么样了？
//
//F-Cap：（叹气）一号当时候在基地里，没跟我来，四号切出到Level C-28了，估计二号三号都牺牲了。
//
//Philips William：很抱歉听到这样的事，节哀顺变，先生。
//
//F-Cap：谢谢。
//
//<记录结束>
//
//结语：目前Level C-513内初次发现了通过非切出手段离开空间站内部的方法。由于“Falcon”小队遭受重创，正在计划组建新队伍对Level C-513进行进一步探索。
//
//您正在查看过时版本，点此查看最新版本
//
//作者信息
//脚注
//1. 101kPa，一个大气压
//2. 温度25℃，约298K，湿度40%左右
//3. 由于此层级处于完全失重状态，因此“天花板”“地板”和“墙面”的概念统一为“舱壁”
//4. 已被证明为从此层级切出的最小速度
package lvls15x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1513{}