//Level C-502
//评分: 
//+6
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//Level C-502是后室C层群的第502层。
//
//描述
//XrURqALseKfugmC.jpg
//Level C-502内部照片。
//
//Level C-502为一所公寓的内部空间，由卧室、客厅、厨房、卫生间以及阳台组成。室内面积约为60m2，Level C-502内有常见家具及简单装潢，包括但不限于：蓝色沙发，四把木质椅子，木质桌子，略微发黄的白炽灯，木框蒙尘油画，墙壁白色，部分区域有直径约为2cm，由未知原因产生的黄色斑点，地板为木质拼接地板，部分地板有轻微突起。客厅东北角有一扇白色的门，疑可进入其它层级，目前尚未找到打开方法。客厅、卧室、阳台有窗户，已知的各种方式都无法将其打开，Level C-502内有昼夜交替，怀疑公寓外存在外部空间，白天时会从窗户照进白色弱光，光线强度低，夜晚则无光，窗户是否为光源仍需考察。Level C-502内WIFI信号强，温度保持在26-30摄氏度。
//
//流浪者进入Level C-502后会产生对Level C-502环境较强烈的喜爱感和放松感，减轻紧张和压力的感觉，流浪者会喜欢在Level C-502内游荡，从而产生更强的舒适感。
//
//实体
//奶奶
//Level C-502内生活着年龄约为85岁，身高约为1.5米的人形实体，实体佩戴黑色细方框眼镜，穿黑白条纹上衣及黑色长裤，流浪者称其为“奶奶”，进入Level C-502后，奶奶会热情迎接流浪者并有几率送给其一瓶杏仁水，随后进入厨房准备饭菜。菜品样式与前厅中中餐相似，但食材不可辨认，吃下奶奶做的菜无危险异常现象。流浪者在吃完奶奶做的菜后会产生较强睡意。奶奶满足于观看流浪者的进食行为并经常主动与流浪者发起对话。
//
//　　　　　　　　　　　　　　　　　与奶奶的交谈记录节选　　　　　　　　　　　　　　　　　
//1
//
//时间	刚进入Level C-502　　　　　　　　　　　　　　　　　　　　　　　　　
//地点	客厅　　　　　　　　　　　　　　　　　　　　　　　　　
//奶奶：你终于来了！赶紧进来吧，等你好久了！
//
//特工1811进入Level C-502
//
//奶奶：你先坐，我得去看着锅。
//
//特工1811：嗯。
//
//一段时间后，奶奶从厨房走出来，坐到椅子上
//
//奶奶：你挺长时间没来的了，最近怎么样？生活还顺利吗？
//
//特工1811：还可以吧，至少可以说没有烦心事。
//
//奶奶：那就好，你要是想来我这随时都可以来，待多长时间都行。
//
//奶奶露出略带自豪的表情。
//
//特工1811：谢谢您的好意，不过我可能腾不出时间
//
//奶奶：来我这不用安排时间，想来就来，我随时欢迎！
//
//
//2
//
//时间	饭后10分钟　　　　　　　　　　　　　　　　　　　　　　　　　
//地点	客厅　　　　　　　　　　　　　　　　　　　　　　　　　
//奶奶：午饭味道怎么样？是不是咸了？
//
//特工1811：味道正合适，我敢说这是今年我吃的最好的一顿！
//
//奶奶：你觉得好吃就好。
//
//奶奶笑了起来
//
//奶奶：刚吃完饭要不要去躺会？
//
//特工1811：我也确实有点困了。
//
//特工1811走进卧室，躺上床，奶奶在床头坐下
//
//奶奶：其实啊，这屋子里老是只有我一个人也挺无聊的，你来了还能跟我说说话。
//
//特工1811：您有子女吗？
//
//奶奶没有说话，低下了头
//
//奶奶：这屋睡觉挺舒服的，你就睡着，也不用担心什么时候起，吃晚饭的时候我叫你。
//
//奶奶又微笑起来
//
//
//特殊物品
//Level C-502内的某处会随机出现一本黑色皮质封面的笔记本（皮革所属生物未知），扉页写有“日记”二字，应为奶奶的日记。当流浪者翻开并阅读日记时，流浪者会逐渐失去意识，缓慢倒在地上，身体逐渐消失（表现为身体变得透明），约8-14小时后，流浪者会出现在卧室的床上，表现出睡眠状态，一段时间后苏醒。据阅读日记者报告，消失的这段时间中他们被“传送”至数个地点，应为日记中所记场景，这些地点均无昼夜交替且内无实体，无异常现象。进入日记后流浪者身体形态不变，但只能以类似幽灵形态行动，不可与物体交互，只能以观察者的身份在日记中游荡且不可与物体产生物理接触，故日记中地点的温度，湿度等不可被流浪者感知，但可以用仪器测量。随身物品会一同进入日记并变成幽灵形态，可正常使用。
//
//日记中的世界
//
//3xPbWZDw9SNUqHs.jpg
//
//“睡醒了？该吃饭了。”
//
//基地、前哨与社区
//无已知基地、前哨与社区
//入口与出口
//入口
//进入Level C-447中随机出现的楼梯间，找到并打开一扇白色的门可进入Level C-502。
//尚未发现其他入口
//出口
//夜晚在Level C-502内卧室的床上睡觉后有几率在Level C-426中醒来。
//尚未发现其他出口
package lvls15x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1502{}