//Level C-524
//评分: +29+–X
//
//
//
//≡
//
// 
//
//生存难度：
//等级 5e - 环境
//
//高危异常环境
//稳定且致命
//无敌对实体
//Level C-524是后室C层群的第524层。
//
//描述
//Level C-524，被船民称为落舟湾，外观为一片漂浮着白色“冰块”的海洋，“气温”保持在-30℃左右。目前，全部影像资料和间接证据均无法证明本层级内存在昼夜交替现象，推测该层级内终为白昼，或有类似加长的极昼极夜的现象。层级内自然光照来源暂未知，但该层级中的室外照片和录像显现出近似单一运动天体的光照效果。E.P.B.已从某些渠道确认，该层级会导致已知的全部电子设备无法使用或损坏，无线电讯号也不能正常传播。
//
//异常的是，该层级海平面以上不存在任何游离气体，也未观测到水冰存在。Level C-524内部充满了被水溶性染料染成深蓝色的海水和某种不溶于水的无毒液体，这种液体的颜色使层级内部的景物如同蒙上了一层浅蓝滤镜。常温下氧气在该未知成分液体中溶解度较高，以至可供人体呼吸。但是，该液体在冰点以下与生物粘膜接触时，会以异常速率吸收热量。由于层级的低温环境，在此地接触和呼吸该液体会迅速导致严重的冻伤，甚至死亡。从层级内部采集的“冰块”成分与空气相近，仅缺少水分，在0℃时迅速升华。前厅中空气并不会在该温度下凝固或凝华，从其他层级带入的空气同样无凝华现象，仍为气态。目前未知“冰块”形成的原因，且未发现该混合物的任何其他异常性质。
//
//根据层级内设施投入使用的时间判断，船民早在数百年前便发现了Level C-524，并建立了资料库#000000。资料库#000000位于一处“冰块”组成的“冰川”中，由互相连接的洞穴改建而来，利用此地异常环境长期保存资料。该基地正上方有若干破碎的、来自前厅近现代甚至未来的船只残骸，且偶尔有船只切入此处“冰川”正上方，下落并深嵌入“冰川”中，这正是Level C-524“落舟湾”别称的来源。
//
//由于该层级的致命环境危害，Level C-524的存在长期未得到任何人类组织的直接证实。本层级近日由E.P.B.证实为独立层级，因为异常环境和缺乏补给，各大组织难以测绘并探明层级面积。船民声称他们在数百年前就完成了对该层级的勘探，并无任何本文档未记录的异常之处或特殊地点。限于他们的测量手段和技术水平，详细数据有待验证。鉴于本层级的环境，暂时认为船民不需要呼吸，能在Level C-524的异常寒冷环境中维持正常生命活动。E.P.B.方面正在与船民交涉，尝试获取其他实体或前厅生物在本层级内受影响的更多第一手资料，暂未知其他组织是否私下进行大规模试验。
//
//基地、前哨与社区
//资料库#000000
//船民最早的资料库，目前有数千个个体负责维护和更新此地存储的纸质记录，并定期派回收队从船只残骸中回收资料。由于离船民其他居民点过远，附近环境过度单调，偶尔从上方传来的巨大震动和缺乏各种娱乐设施1，资料库#000000曾多次被船民评为“工作环境最差的十大资料库”之一。
//
//入口与出口
//入口
//船民制作的船期表显示，Level 48中的海洋和欧文森之海均通向Level C-524。前往或路过该层级的班轮拒载人类和大多数实体，除非对方做过适应性改造或有合适的装备。
//考虑到船只和集装箱表面的不明油状物，从Level C-271出发的部分船民货运班轮可能经过了Level C-524。由于该种实体完全自用的货船班次未加入公开船期表，无法确认此入口是否为真。
//前厅的船只有概率直接切入Level C-524中资料库#000000所在冰川正上方的未知液体中。
//出口
//前往Level C-524的班轮回程时，首站抵达地均为欧文森之海。可能存在更多尚未发现的出口。
//附录
//+附录一：关于落舟湾偷渡者事件的声明，由中枢港海运管理局发布
//+附录二：事故现场录像带的部分影像内容
//作者信息
//Footnotes
//1. 大多因Level C-524内环境而无法安装。
//2. 即中枢港海运管理局，船民在中枢港设立的半官方海运管理机构。
//3. 人在极度寒冷的环境里，被冻死之前控制血管收缩的肌肉将会出现疲劳，导致血管重新扩张，使体内温暖的血液迅速留到皮肤周围的血管，因此人会感到很热。这样，即将被冻死的人就可能会主动脱掉自己的衣服。
//4. 船民是一种相当缺乏表情变化的实体，改变自身固有表情时需调整面部全部布料的状态。
package lvls15x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1524{}