//
//建立帐号 或 登入
//The Backrooms吧
//Backrooms Fandom Wiki
//The Backrooms中文wiki官方哔哩哔哩公众号
//Discord
//主页
//
//中文沙盒站
//
//图书馆
//
//层级
//|
//实体
//|
//物品
//|
//团体
//
//故事
//|
//相关人士
//|
//现象
//|
//设定
//
//搞笑文章
//|
//国际翻译中心
//
//原创图书馆
//
//原创层级
//|
//原创实体
//
//原创物品
//|
//原创故事
//
//原创团体
//|
//原创相关人士
//
//原创设定
//|
//原创搞笑文章
//
//原创艺术作品
//|
//原创现象
//
//网站
//
//最近创建的页面
//
//最近的更新
//|
//最近的编辑
//
//随机层级
//|
//随机原创层级
//
//随机实体
//|
//随机原创实体
//
//旧页面中心
//
//本月最高评分页面
//
//历史最高评分页面
//
//最低评分的页面
//
//社群
//
//讨论区
//
//翻译预定
//|
//最近的帖子
//
//作者页
//|
//中文网站作者页
//
//加入网站
//
//管理专用
//
//后台管理
//
//职员站点
//
//所有页面
//
//会员一览
//
//侧栏
//|
//顶栏
//|
//主题版式
//
//
//
//　
//
//Level C-555
//
//评分: 
//+21
//+
//–
//X
// 
//
//生存难度：
//等级 4
//
//不安全
//不稳定
//实体侵占
//Level C-555是后室C层群第555层。
//
//E77CDEC7B51CE661CBA9E065CAB9B1F0.jpg
//Level C-555的外观。
//
//描述
//Level C-555看起来是一座正在进行维修的监狱。监狱异常得没有围墙，而是四周由茂密的松树林围绕。这片树林类似于Level 0的非线性空间，流浪者很可能在探索足够深入时返回原点。
//
//该监狱前有一条宽约3米的小路。小路两旁亦长满了茂密的松树，而且不包含任何照明设施。这条路似乎往两端无限延伸，且越是远离监狱，路就会变得越不稳定。甚至有可能在某些位置出现断裂或侧翻。目前尚未发现这条路的尽头。
//
//Level C-555的时间被锁定在19:30。天空似乎一直都是昏暗的，且无任何可观测天体。
//
//监狱是该层级的主体。它由操场1、监狱区及食堂三部分构成。各部分之间均由室内连廊相连接。
//
//操场
//操场是一块一般大的开放空间，由监狱区围绕。其被人造塑料草皮所覆盖，似乎已有一段时间无人打理，因此较为陈旧。同时，其上摆放有长条钢筋堆、木板等建筑材料，似乎是为了扩建或维修监狱区所置。
//
//操场是该层级相对安全的地区。该地区实体数量较少，且不存在任何对流浪者的不良影响。
//
//该地区有时会出现建材被拖动、摆放的声音，还有流浪者称他曾在操场上听到有人类活动的脚步声，不过声音来源未知，推测为此层级造成的幻觉。
//
//监狱区与连廊
//r.jpg
//一间监狱
//
//q.jpg
//一条典型的连廊
//
//监狱区是监狱的主体。该区域由几乎无数间房间构成。
//
//监狱区为非欧几里得空间，这导致人们无法知晓其房间的数量与空间关系。房间多为2-6间为一组，其面积最大可达20平方米，最小的有5-6平方米。每间房间固定会有一张床铺、一个储物柜以及一台洗漱池。
//
//有些监狱的牢房门会随机上锁或解锁，因此将有可能将流浪者困在牢房中。被困于牢房内是十分危险的状况，有些门的开关周期可以长达一周。会牢门开关前会发出嘎吱嘎吱的金属声。如果你在牢房内听到这种声音，务必以最快速度离开该牢房。
//
//洗漱池放出的水似乎有种发霉地毯的气味。其成分与Level 0地毯中的水分十分相似，无法安全饮用。
//
//储物柜里有时会出现少量物资，如杏仁水、糖果等，有时也会出现一些杂物，如梳子、牙刷、假发等。流浪者可在此获得补给。
//
//监狱区可由操场进入，但此行为似乎是单向的，流浪者无法以原路返回至操场。
//
//室内连廊是连接各个监狱组的通道。值得注意的是，它们的连接是随机且不稳定的，且有时会连接至操场或食堂。它们的长度从10米至数百米不等。连廊中会有昏暗的灯光，其能源供应似乎不是很稳定，经常发生闪烁甚至停电。
//
//该区域实体数量中等。有记录的实体包括笑魇、窃皮者、猎犬等，且多在连廊出现。
//
//连廊有时会包含有向上或向下的楼梯，似乎连接着监狱中的不同楼层。此楼梯大多数情况下会呈现出一种扭曲的状态，严重情况下会发生上下颠倒或回到出发点等情况。
//
//食堂
//食堂是Level C-555中资源最丰富的地区，但此处实体众多。值得注意的是，通过标记法，该层级似乎仅存在两间食堂。不过因空间混乱，其位置无法被确定。
//
//食堂占地约200平方米，有4个出入口，分别与4条连廊相连。
//
//虽然食堂实体数量多，但大部分实体均专注于桌上的食物，并不会对流浪者产生敌意，除非被刻意激怒。
//
//在此同样会发生异常现象。其座位可能会被未知力量拖动，桌上的食物也会随机性地消耗掉。该现象通常伴随着随机出现的话语声，但其内容无法听清。
//
//实体
//灵魂（暂定名称）
//有大量目击证明，Level C-555存在一种特殊的实体。目前暂时用“灵魂”来称呼。
//
//灵魂一般无法直接感知，但在少数情况下，灵魂可由肉眼直接观测。在超高速粒子成像机中可以捕捉到较清晰的黑色成像，通常显现为不规则状，但在少数的报告中仍然观测到具有稳定的类人型状态。极在此状态，灵魂的四肢健全，面部呈隆起状，却不具备任何面部器官。
//
//初步估计，该实体遍布此层级各地，但其数量较少且会无端地消失或出现。经各种实验研究提出其可能生活在此层级高维空间处的假设。灵魂似乎无法影响到现实世界，甚至在多数情况下不会向现实世界作出任何举动甚至发出信息。
//
//各种对灵魂的目击报告都指出，灵魂的行为与监狱中的囚犯高度相似。下面为部分目击报告。
//
//流浪者吉姆：一只灵魂从监狱区走向食堂。
//流浪者柯伯尔：一只灵魂走向操场后开始跑步。
//流浪者马特克：一只灵魂躺在牢房床上。
//对灵魂的研究还将继续。若各位流浪者持有关于灵魂的报告，请向M.E.G.档案部报告。
//
//基地、前哨和社区
//本层级无已知基地、前哨或社区。
//
//入口和出口：
//入口：
//在Level 0昏倒时会有可能传送至Level C-555的一间监狱内牢房的床上，醒来时会有极强的压抑感或浑身冒冷汗，描述者称有死过一回的感觉。
//在Level 3中进入一个被铁栅栏包围的房间有很大概率切入Level C-555的一间牢房中，值得注意的是，这样的切入方法传送至的牢房铁门外会有锁，至于有没有上锁要全凭流浪者的运气。
//进入Level 35内的一辆漆黑的押送车会有短暂失明现象，耳边将响起位置无法确定的警车鸣笛声，恢复时将会传送至Level C-555的监狱入口处。
//在傍晚进入Level 11的一座监狱型建筑物，流浪者将不知不觉的进入Level C-555的监狱内。
//在傍晚进入Level C-332路旁的一间带有血痕的破旧的小房子里，待出来时，将会发现来到了Level C-555的操场上。
//现阶段，进入Level C-555的方法广泛但多为小概率事件，更多入口待探查中。
//出口：
//据几位流浪者的报告，饮用牢房内洗漱池的水有可能传送至Level 0或Level 34（他们被传送至一间上锁的牢房内，因极度脱水冒险饮用洗漱池中的水，其中两位因切出后肠胃未知细菌感染且就医不及时而死亡，因此不建议尝试）。
//朝着远离监狱的任意方向快速前行，直至看不见监狱为止，此时将有概率出现空间扭曲且模糊，待稳定时，你将处于Level C-261
//当流浪者在任意监狱的床上回想起自己的生卒荣往，并在一小时内入睡时，会有概率在Level C-439的床上醒来。
//更多出口待探查中。
//EagleSD.png
//附录：最新发现
//
//最近陆续有流浪者目击，Level C-555可能存在另一镜像层级。
//
//请点击此处查看
//脚注
//1. 按照前厅对于监狱的一般说法为放风场。
//
//Level C-555-B
//
//评分: 
//+21
//+
//–
//X
// 
//
//生存难度：
//安全性未知
//稳定性未知
//实体侵占
//Level C-555-B暂定为Level C-555的镜像层级。
//
//描述
//Level C-555-B外观上与Level C-555一致。由于其进出方式十分困难，目前对Level C-555的了解十分有限。
//
//有人提议将Level C-555-B列为子层级，然而层级密钥测定结果显示其与Level C-555为同一层级。蓝色通道的观测证实了这一点。在蓝色通道内观察，Level C-555-B与Level C-555相互重合且互相干扰，这种现象从未于其它层级中发现。M.E.G.推测，Level C-555很可能具有与Level C-1类似的叠层级结构，但其二者间却可相互影响，与Level C-1叠层级间相互孤立的状况有所不同。目前暂且以“镜像层级”称呼这种关系。
//
//该层级由一位M.E.G.探员盖伯于2022年4月10日发现。该探员于同年5月17日逃离Level C-555-B。随后，陆续有进入Level C-555-B的报告。通过有限的报告与合理推断，可以得出一下结论。
//
//区域
//本层级分为3个区域，操场，监狱区及食堂。
//
//本层级建筑与Level C-555外观一致。不同的是，Level C-555-B较Level C-555更为稳定，基本不存在非线性空间，且暂时无异常现象发生的记录。
//
//操场上堆满了木板和钢筋等建筑材料，看起来监狱似乎正在扩建。
//
//监狱区由数群房间组成，每群房间包含2到6间牢房。牢房内部布局与Level C-555一致。
//
//连廊连接着各个监狱组的房间群。与Level C-555不同的是，它们的连接稳定且不会改变。一些连廊包含楼梯，连接着监狱的上下层。
//
//食堂布局与Level C-555一致，且资源充裕。
//
//实体
//Level C-555-B最大的不同在于其特殊的实体。该层级实体类别与Level C-555完全不同。现可将已观察到的实体分为两大类。
//
//管理人员
//管理人员为身穿制服的无面灵，管理着整座监狱的运行。不同的管理人员穿着有不同的制服。
//
//蓝色衬衫：狱卒，负责管理罪犯的行动规范。狱卒有时会守在牢房门口，有时则会与罪犯一同行走。它们不会理睬流浪者，除非被干扰工作。
//棕色衬衫：建筑工。建筑工负责修建监狱，常于正在装修的牢房与堆积建材的操场出现。它们不会对流浪者产生任何反应。即使被干扰，也会尝试绕开流浪者。
//白大褂：厨师，仅在食堂出现，为罪犯供应食物。流浪者可与此交流，并使用杏仁水等物资换取食物。
//黄色衬衫：高层管理。高层管理为高级的管理人员，负责管理狱卒等人。激怒甚至靠近一位高层管理是不明智的，因为其通常与数位狱卒同行，且似乎较普通狱卒更易被激怒。
//罪犯
//罪犯为该层级分布最广泛的实体。它们拥有与人类一致的身理结构。值得注意的是，每一位罪犯似乎都对应着曾经来过Level C-555的流浪者。它们与对应的流浪者拥有一致的长相、性格等，甚至可能拥有其记忆。
//
//它们在一般情况下不会理会流浪者，若流浪者故意干扰它们活动，狱卒便会将其赶走。若流浪者再次返回，狱卒会对其发动攻击。
//
//罪犯们的住所位于监狱区。特定的时候会随队伍一起行进，通常为20人一队，并由3名狱卒看守。它们在特定时段会于操场上放风、于食堂内用餐。
//
//目前唯一与罪犯交流的记录由盖伯录制。
//
//隐藏记录
//2022年5月8日，于操场。我正在观察罪犯的活动。这时，一位罪犯朝我走来并表示愿意与我交流。
//开始录音
//盖伯：你能看见我？
//
//罪犯：你好，流浪者。我们其实早就注意到你了。只是碍于狱卒的管理罢了。
//
//盖伯：能谈一谈你是怎么到这里的吗？
//
//罪犯：2021年2月7日，我从Level 3切出后，就来到这里了。
//
//盖伯：那么，你的伙伴呢？
//
//罪犯：他们也是从各处切出至Level C-555后就来到这了。该死的M.E.G.居然写假档案骗我们！他们可没提Level C-555是一座无法切出的监狱！
//
//盖伯：可是，Level C-555从未有如此大量的失踪报告啊。你叫什么？
//
//罪犯：柯伯尔。
//
//盖伯：柯伯尔？你是那个发现过灵魂实体的人？
//
//柯伯尔：什么？灵魂实体是什么？
//
//盖伯：（终端被拿出的声音）你看。
//
//（片刻的沉默）
//
//柯伯尔：可是，我从未到过档案中的Level C-555啊。
//
//盖伯：这也是我正在疑惑的。Level C-555一定具有某种特殊性质，可以让一个人分裂成两个。我这几天在这里也遇到了一些熟悉的面孔。他们全都是我的朋友，而且都曾经成功逃出过Level C-555。
//
//柯伯尔：什……
//
//（集合哨声响起）
//
//柯伯尔：我必须走了。
//
//（急促的脚步声）
//
//录音结束
//特殊性质
//注：由于档案较少，目前仍无法确定其具体性质。下面仅为推断。若有流浪者发现新的证据，欢迎报告给M.E.G.档案部进行补充。
//
//Level C-555-B为Level C-555的镜像层级，这表明二者之间有着紧密联系。
//
//于Level C-555-B之中发生的事件可能会以某种方式投影至Level C-555，如建材拖动、牢房门开合及各种未知来源的声音等等。而神秘的灵魂实体，很可能就是Level C-555-B中的实体的投影。
//
//镜像层级间的链接十分不稳定且几乎无法预测。正因为如此，于Level C-555中的异常现象一般不会持续太长时间，且有时会变得模糊不清（比如灵魂实体的模糊球形状态）。
//
//验证通过。
//由种种对罪犯的报告可知，该实体必然与切入过Level C-555的流浪者有关。
//
//有一种推论称，流浪者切入Level C-555后，其会以未知方式于Level C-555-B中被复制。该复制品会被当成罪犯在监狱中关押。这些罪犯拥有意识和前者的记忆，且会认为自己是因为切入Level C-555而入狱。
//
//关于罪犯的推论还有很多。为了不引起不必要的恐慌或误解，该推论目前尚未公开。
//
//e.jpg
//进入Level C-555-B的入口，由于镜像连接的不稳定性而极度扭曲。
//
//基地、前哨和社区
//本层级无已知基地、前哨或社区。
//
//入口和出口
//入口
//走入Level C-555中一条极为扭曲的楼梯会将你带到这里。
//出口
//已验证管理员身份，隐藏内容解锁。
//盖伯逃出后，描述了他是如何逃出的。
//
//我到达了一间看似普通的牢房，牢房中站着一位罪犯。当我看清后，我惊讶地发现：那位罪犯就是我！但我还没来得及彻底搞清楚状况时，我突然失去了意识而晕倒了。等我醒来时，我已经回到了Level C-555。
//
//不止盖伯，许多到过Level C-555-B的流浪者同样描述了类似的情况：他们在晕倒切出前，都遇见了“另一个自己”。
//
//一切似乎都指向了那条推论。但愿它不是真的。
package lvls15x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1555{}