//Level C-571
//评分: 
//+2
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
//安全
//稳定
//实体绝迹
//Level C-571是后室C层群的第571层
//
//描述
//Level-C-571是一片始终处于繁星点缀的夜空下的漂浮群岛，各群岛之间由漂浮且环绕着群岛的碎石与尘埃构成桥梁。由夜空折射出的紫色光芒为本层级的主要光源。
//
//star_sky_tree_night_silhouette-3355.jpg!d
//星河流转，千篇长诗
//
//本层级的大气与前厅中的大气构成相似，但失去了对光的吸收能力，这使得无论在什么时候，本层级的夜空都保持清晰可见。
//本层级也没有任何天然热源，这使得各浮岛上的温度较低，但由于本层级的特殊性质，温度始终保持在一个温度界限以内。
//Level C-571主要由三个主要的浮岛群构成，目前无法通过任何手段离开这些浮岛群前往本层的其他区域。
//
//以下为已收录群岛/浮岛的资料
//东南向浮岛群
//目前已收录在案的已有14个浮岛
//
//东南向浮岛群，是Level C-571中最为潮湿，也是唯一一处会产生降水的浮岛群。
//
//raindrops_glass_background_water_rain_wet-718081.jpg!d
//雨中的群岛
//
//该浮岛群上存在着大量的水洼与溪流，这使得此处成为本层级的主要饮水来源。本浮岛群上的溪流最终将流入虚空，关于为何水流源源不断，推测是水流在流入虚空后会重新变成降水。
//在本浮岛群的某些岛屿上存在这一种向上的浮力，会导致流浪者进入”漂浮“的状态。所幸的是，由于本浮岛群富有水源，具有向上浮力的岛屿能够通过半空中悬浮的水滴而轻易辨别出来。
//而在本浮岛群上也生长着一种本层级特有的植物。
//
//“回音花”
//“回音花”，表现为一种大型的蓝色开花植物。其在幽暗的环境下会微微的发出青色荧光。
//其主要生长在本浮岛群的潮湿地带，在降水时能够进行快速的生长。“回音花”会记录周围的声音并在遭受刺激时将当时周围的声音重现出来。但值得一提的是，“回音花”保存声音的时间是不定1的。你也可以通过给“回音花”移动位置以重新记录声音。
//
//西南向浮岛群
//目前已收录在案的有11个浮岛
//
//西南向浮岛群，是本层级最小的浮岛群，也是最利于观察“外岛”的浮岛群。
//西南向浮岛群由大量的裸露岩石与各色水晶构成，浮岛周围往往环绕着大量尘埃与雾气，即便如此，由于西南向浮岛群处于距离“外岛”最近的位置2，虽然观察职能受到限制，但它依然是观察外岛的最优选择。
//在本浮岛群上可能会存在一些特殊的岛屿，这些岛屿可能会处于真空状态，或是处于重力反转的状态下。由于本浮岛群缺乏参照物，建议流浪者最好在探索本浮岛群前携带一些投掷物以测试将要抵达的下一个浮岛是否为陷阱。
//
//正北向浮岛群
//目前已收录在案的有18个浮岛
//
//mountain_lake_night_star_starry_sky-107136.jpg!d
//岛屿之上，繁星之下
//
//
//正北向浮岛群是本层级最大的浮岛群，也是本层级的居民聚集地和无特殊性质岛屿的浮岛群。
//正北向浮岛群被一种紫色的草本植物覆盖，在正北向浮岛群上具有大量的森林与湖泊，以及一座积雪的山峰。
//本浮岛群几乎占据了本层级陆地面积的65%，且已被完全宜居化，在本浮岛群上可以看到通往其他浮岛群的木制桥梁3。
//本浮岛群具有大量居民，其居住在本浮岛群的中心位置
//
//“星町镇”
//由本层级的居民自行建立的城镇，由大量的石质建筑物构成。其作为本层级最大的聚居地，其具有大量基础设施与交易设施。
//就算身处在这后室之中，他们也从未放弃生活的希望。
//
//外岛
//目前已收录在案的有1个条目
//
//- 繁星
//外岛，指Level C-571中所有已收录在案的浮岛之外的可观测岛屿。介于尘埃与其他物质的影响，所谓“外岛”的真实性依然有待考证
//目前，大部分关于“外岛”的报道都来自于西南向浮岛群。
//
//关于“外岛”
//sky_stars_constellations_astronomy_galaxy_dark_night_starry-712481.jpg!d
//繁星点点
//
//
//“外岛”是目前本层级目前唯一未被报道的区域，关于“外岛”的信息我们所知甚少。在目前，几乎所有的报告都来自西南向浮岛群。
//本层级的居民也从未抵达过外岛，但值得一提的是，“外岛”形态多变，目前已收录以下报告：
//一片破碎的大陆
//大量漂浮群岛
//由碎石和小型浮岛组成的群体
//
//曾经有流浪者试图通过飞行器抵达“外岛”，但最终由于其燃料不足而失败4
//基地、前哨与社区
//M.E.G“窥探者”基地
//位于西南向浮岛群
//主要任务为观测外岛
//开放交易
//“繁星之民”
//正北方向浮岛群的居民们
//友善并欢迎流浪者定居
//开放交易
//入口与出口
//入口
//在任意层级漫游时，看见一片青紫色而发光的覆雪地面并从中切出，你将会在本层级的随机一处岛屿上醒来。
//出口
//在本层级的草地中打滚超过15分钟或从草地中切出会使你来到Level C-365
//跳下虚空会使你抵达Level C-799
//致我们那条破碎的星河
//« Level C-570 | Level C-571 | Level C-572 »
//
//Footnotes
//1. 目前最早的回音花保存了七年前的一段谈话。
//2. 由本层级的居民目测。
//3. 也是本层级的仅有的人造桥梁 。
//4. 但这也带来了勘探外岛的希望。
package lvls15x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1571{}