//Level C-516
//评分: 
//+33
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//444616d642332e6f3fa05d69c08eaf2cb5c4139f
//Level C-516的一张图片
//
//Level C-516是后室C层群的第516层。
//
//描述
//Level C-516是一个占地约为三百平方公里的现代城市。该层级内存在有大量的同一风格的建筑物，主要为六层居民楼和高层写字楼构成，在部分建筑物中间会十分突兀的出现与周围环境格格不入的中小型矿坑，矿坑内含有大量的铁矿和铜矿，少量的金矿和博罗利亚虹石矿，目前该层级中最大的两座矿坑已经被M.E.G.和帕拉斯研究所占据，但由于该层级中具有的特殊效应，始终未能进行大规模开采。
//
//Level C-516的时间稳定于10：00，气温稳定于22℃左右。虽然该层级的天空与前厅中夏季早晨十点的亮度大致相同，但未发现任何类似于太阳的光源存在。Wi-Fi覆盖了整个层级，但信号强度波动较大。
//
//该层级中大部分的建筑物是可以进入的，房间内的内饰基本相同，有来源未知但可供使用的直流电，但会经常出现停电现象。在部分房间的书房内找到了一些可供阅读的书籍，多为娱乐报刊或漫画书，但绝大部分书籍内容为乱码。
//
//该层级中的树木并非传统意义上的树木，流浪者在地面上的任何角度上观测到的树木样貌均是相同的，我们通过在空中观测发现该层级中的树木并无实体，而仅仅是一个厚度极小的虚影。
//
//停滞效应
//在该层级中的流浪者偶尔会遇到停滞效应的影响，受到停滞影响的流浪者通常处于行走或奔跑的状态，其本人会观测到周围的一切事物停止任何形式的运动，且颜色均变为高饱和度，给人强烈的失真感，少部分情况下流浪者周围的物体全部变为彩色像素块构成的图案。
//
//在停滞效应发生时，流浪者无法离开效应开始时的地点，目前所记录到试图离开原地的行为均告失败，无论是行走，跑步亦或是于地上爬行，于与周围物体的相对距离都不会有任何改变，这一现象被经历过的流浪者描述为"地面在向后移动"。停滞效应的持续时间通常为15s-30s，当该效应结束后，流浪者会突然出现出现于数米乃至数十米之外的位置。经过观测，流浪者出现的位置和距离取决于其在停滞效应中移动的方向和距离。但如果流浪者在该效应结束时有身体部位位于其它物体1或人体内部时，流浪者的这部分身体组织会凭空消失，这并不会导致流浪者体表出现创伤，与消失的身体部位连接的部分不会出现任何创口，如同先天性缺陷的人一样。尽管这一现象不会导致流浪者因缺血或感染一类的原因死亡，但如果关键性器官缺失，流浪者依旧会死亡。
//
//因此，我们建议流浪者在受到停滞效应影响后不要随意走动，以免受到伤害，同时也不要去影响那些看上去受到停滞效应影响的流浪者。
//
//回溯效应
//回溯效应是相对较为罕见的一种效应，且尚未在人类身上发现。当回溯效应发生时，一个物体会突然回到几秒前的位置和状态，这种效应大部分发生于电子设备上，以下是该效应的的部分报告:
//
//个人信息终端发生回溯导致报告未能保存成功。发生次数:154
//食用后的食物突然出现于体外。发生次数:5
//矿车内的矿石回到挖掘前的位置。发生次数:6
//排泄物回到体内。发生次数:1
//回溯效应不会发生在与人体体表直接发生接触2的物体上，且如果该物体前五秒所在位置上覆盖了其它物体或人类，回溯效应不会发生在该物体上。
//
//真的建议你们在保存的时候用手捂住你们的电子设备，我不希望再听到有人因为这种效应导致报告交不上，这个月已经有三个人用了这个理由了！
//—一位愤怒的帕拉斯研究员对他的助理们说的话
//
//失像效应
//当一个物体发生失像效应后，该物体会每隔3.6秒消失一次，消失时长为0.3秒，这种效应通常会持续一分钟至两分钟，和回溯效应相同，这种效应也不会发生在与人和人体体表直接发生接触的物体上，但如果有人或物体在其消失期间移动到了该物体原来所存在的位置时，该物体会随机移动到以其本身为半径25米以内不与其它物体重叠的任何位置上。
//
//我求求你们下次好好找找，我真的没有偷你们的矿石。
//——一位M.E.G.的外勤人员
//
//受到以上效应的流浪者均出现了血压升高，心律不齐，暴躁等状况，在该层级探索时，请务必携带降压药以免出现高血压，降压药可前往一号矿坑处的医疗补给站购买。
//
//- 保存失败
//什么玩意，我按保存了啊
//
//- 保存失败
//这，这不对吧
//
//- 保存失败
//我去
//
//- 保存失败
//我他妈的不存了，什么垃圾层级
//
//- 收起
//[记录开始]
//
//凯文:真他妈的…这到底是什么鬼地方，我包里的水瓶呢…跟有小偷一样，包里东西少好几个了…
//
//伊文:得了，这个新层级的探索任务还是你接的…操，这个视频你没关？
//
//凯文:我应该关了啊，刚才录完报告…你小子怎么了？
//
//(镜头被凯文接过，伊文站在原地一动不动)
//
//凯文:…你别搞我…这不好玩
//
//（伊文突然从镜头中消失了）
//
//凯文:我操！你他妈人呢！
//
//(镜头外传来了惨叫声)
//
//凯文:伊文你等着我！
//
//伊文:啊啊啊啊啊！
//
//伊文:我的脚趾头不见了！
//
//凯文:刚才发生啥了，我看你突然就没了…
//
//伊文:我也不知道，我就看着你突然不动了，想拉着你跑，但是我一步也跑不动，就像跑步机一样，然后眼前一花，就到了这里，脚趾头还没了！
//
//凯文：真他妈的…你不疼吗？
//
//伊文：…好像不疼？
//
//凯文：那你他妈叫唤什么！
//
//[记录结束]
//
//基地、前哨与社区
//M.E.G."矿工"基地
//该基地共325人
//开采该层级二号矿坑的矿石
//对流浪者友好且乐意提供帮助
//帕拉斯研究所"LC-5-16"基地
//该基地共三百人左右
//开采该基地一号矿坑中的矿石
//对流浪者友善且提供医疗服务
//入口与出口
//入口
//在Level 11中找到一栋外表由像素图块组成的房子后可以进入该层级。
//在Level C-515的第二区域中停留超过二小时后切入那些看上去较为破损的门有概率切入该层级。
//在Level C-28中找到一座信号基站有概率切入该层级。
//在Level C-‽中找到一扇颜色鲜艳且由像素图块构成的门可以进入该层级。
//出口
//进入任何一座矿坑都有可能将你带到Level C-20
//打开该层级中的下水井盖有概率切入Level 34
//按标志行走15公里可以进入Level 11，这期间周围的建筑会逐渐变为Level 11的样式
//作者信息
//« Level C-515 | Level C-516 | Level C-517 »
//
//Footnotes
//1. 不包含液体
//2. 不包括体内
package lvls15x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1516{}