//此刻，你的脚下有一张请柬，邀你去参加一场宴会。
//黑色卡片上并无文字，但六月六日六时，你准确地出现在了约会地点。
//与其说出现，不如说被拉入，你意识到你已不在你曾经居住的层级了。
//你出现在一间千米见方的宴会厅中。
//宽阔的黑曜石桌面占据大厅中央，整齐的高背椅有序排列。
//与你一同出现的，还有数百茫然无措的人们，你意识到他们的出现原因与你不尽相同。
//人们吵嚷着，混乱着。
//一个声音结束了这一切。
//“莫要惊慌，请各位有序入座。宴会，即将开始。”
//
// 
// 
//
// 
//
//生存难度：
//等级 恶食地狱
//
//进食
//进食
//进食
//描述
//空间形态
//目前没有人类能够活着出入此地，故而所有记录均为简介记录或证据推论，所有记录均在“据调查”前提之下。
//恶食地狱已探明部分主要表现为一座中古风格巨型宴会厅。其内部已知部分空间巨大，整个空间呈正六面体分布，约有三十千米见方1，因为体量而拥有其内部气候，气温常年保持在17℃至20℃之间，且浓雾弥漫。每个人类进入其中时，其视角下宴会厅的装饰风格均不同，基本表现为进入者所处文明环境特定年代的对应建筑风格，且会随人类认知的变化而改变。
//
//%E6%81%B6%E9%A3%9F1
//恶食地狱中黑曜石桌面基座一角
//
//
// 
//收起
//经典的欧式会议大厅。四壁有壁画，内容类似圣经创世纪，但其上的神明与传统意义上的耶和华完全不同，青面獠牙，黑色皮肤之上满身红色纹路。地板铺有巨大的红色纹路土耳其地毯，(因其体量并未知晓纹路式样)。四壁都有壁炉，但并未点火(其后于开宴时点燃)。黑曜石桌面上摆放置着镶嵌红色类珐琅质的银质烛台。其上蜡烛未点燃(其后于开宴时点燃)。
//巨大的罗马式样议事厅。苏美尔文明特有的装饰风格使得墙面显得陈旧而有序。墙上镶嵌着石砖浮雕，内容大致为天神安创世，但其形象与一般考证完全不同，较众神更加阴森可怖。墙上火把状雕刻未点火(其后于开宴时点燃)。地下铺有巨量暗金色石砖，未能识别出其构成成分。黑曜石桌面上放置着镶金象牙酒杯，经考证其中液体为高浓度悲伤之水。
//体量较大的古中国式厅堂建筑。其顶为藻井，绘有盘古开天彩绘，但其上盘古影响崩坏严重，据传其身体某些部分类似四兽中的饕餮。厅堂由八柱支撑，八柱下放有火坛，并未点火(其后于开宴时点燃)。八柱每根直径为10米左右。柱上盘绕混沌、穷奇、梼杌、饕餮之像。黑曜石桌面上放置着金质箸梜。
//收起
//
// 
//恶食
//恶食地狱会对人类聚居的随机层级内生物间隔一年投放“请柬”23，拾起“请柬”者将于本年六月六日六时准时统一切入恶食地狱4。已证实“请柬”发放受害者最多有666人。5
//恶食地狱内的陈设主要为巨大的黑曜石桌面与高背宴会椅。在人类切入层级30分钟后，空间内会传来声音，提醒人类入座。未在声音停止后30分钟内入座的人类将被处理6。落座后，桌面会出现各类餐盘，内盛“食物”。
//“食物”表现为各类已知或未知的人体危害性食品，包括但不限于：
//
//愤怒胡椒
//龙坠草
//郁海花
//高浓度悲伤之水
//五仁月饼
//同时，恶食地狱会在过去的一小时内将人类进行转化7，人体会基于一种未知的效应产生强烈的“快感”，进而生成一种无法遏制的进食欲望，然而，根据推测，这种转化同时恶劣地异化了人体的常规生理结构，根据自动摄像装置的记录观测，人体的表皮与肌肉更加容易遭遇脱落、撕扯等恶劣状态，根据口中的唾沫色泽可以揣测发生了一定器官损伤的现象，同时，流浪者的反应也趋近歇斯底里，不复常态，在这一系列的折磨中恶食地狱会开始疑似分泌某种黏液消化这些流浪者，其中罕有能够保持清醒的意志见证自己被吞噬的过程的个体，普通自动摄像装置在这一过程中也会损坏，故而关于此层级的消化过程没有可信记录。消化完成后，不可消化部分便会被投送回原层级8。
// 
//
//消化
//%E6%81%B6%E9%A3%9F2
//消化进程即将开始，血肉涌入
//
//
//消化进程开始后，空间内部会同时不间断产生血肉集合体“血玫瑰”。据已有记录，“血玫瑰”外形形似玫瑰花，但实际由肌肉组织与血管构成。其产生速度极快，可以在13分钟内充满整个空间。“血玫瑰”个体可以使同类或任何接触到的生物同化，在5分钟后，部分“血玫瑰”会同化成统一实体，被命名为“玫瑰体”。此实体可使人类等生物产生幻觉，借此引诱人类并吞噬被引诱者。在“玫瑰体”生成后，空间中的浓雾将作为幻觉的载体与放大装置。
//“血玫瑰”个体不具有智能，但据悉“玫瑰体”有着堪比人类甚至高于人类的智能水准，且精通引诱人类的方法。故而被吞噬前，受害者总是以满足且快乐的方式面对死亡。
//%E8%A1%80%E7%8E%AB%E7%91%B0%E4%B8%AA%E4%BD%93
//血玫瑰个体(还原图)
//
//
// 
//探索记录
//无人生还，收起
//记录一
//引子
//今天是她离我而去的第400天。
//我记得她的名字。
//Sharow
//我不知道她来自何方，但她将我从死亡中拯救，
//又独自离开。
//是爱人吗？不是。这份感情超越了爱。
//我曾许下誓言，将她铭记。
//如今我食言了，我不想只是将她铭记。
//于是我捡起了脚下的黑色卡片，上面有若有若无的，她的气味。
//
//记录
//阿尔伯特先生，可以听到我的声音吗？
//可以。
//现在是六月六日五时59分，请您做好切入准备，带好诺贴、物资与摄像机，祝您生还。
//很烂的祝福，好的。
//(阿尔伯特消失在视野中)
//我进来了，视讯正常吗？可以听到我的声音吗？
//(花屏、干扰纹)
//阿尔伯特先生，视讯受到干扰，但音频正常，开始探索。
//我不聋，收到。
//很久之前还只有一个人以这样尊重的态度与我说话。
//这看起来是座大厅，但内部弥漫着浓雾，且大到一眼望不到头。我现在在向大厅中心走，不知道会遇到什么，完毕。
//我走到中心了，这里有片巨大的黑曜石质感的平台，好像是桌面，还有许多中世纪款式的椅子，不知道有什么用，完毕。
//阿尔伯特先生，请继续探索，完毕。
//(突然出现，低沉)“莫要惊慌，请各位有序入座。宴会，即将开始。”
//阿尔伯特先生，请汇报声音来源，完毕。
//不知道，但好像…是从上面传来的，完毕。
//请按声音的指示行事，完毕。
//唉……
//(阿尔伯特落座)
//
//(视讯恢复)
//已经过了三十分钟了，空间内一点变化都没有，完毕。
//请耐心等待，完毕。
//(突然，桌面上的空间扭曲，许多杯盘碗盏凭空出现，内盛许多对人类极具危险的物品)
//唔…啊啊…好饿…感觉它们好好吃……
//阿尔伯特先生，清醒一下，你不想吃它们，吃了你会死的！
//阿尔伯特先生！
//啊…我刚刚这是怎么了…头好晕…我可以休息一下吗？
//可以，但是千万不要碰桌面上的东西。
//收到。
//(五分钟过去了，桌面基座下，红色的浪潮不断上涌。舔舐着它们盘子里的食物)
//阿尔伯特先生，清醒一下，你现在正面临着危险，完毕
//这时候不要给我打这种官腔。
//(阿尔伯特爬到了桌面上)
//呼…看来一时半会还走不了…不过这红色海洋还真是壮观呢。
//(阿尔伯特回头准备寻找出口，但转瞬间，他的身体僵住了)
//Sharow…是…你吗？
//阿尔伯特先生，你现在看到的是幻觉，视讯里根本没有人类。
//不要走了，好吗？留下来…
//我需要你…
//听说你在这里，我来找你了。
//我们一起活下去，一定可以挺过去的。
//无论这里还会禁锢我们多久
//(模糊的女声)“过来，来我身边。”
//阿尔伯特先生，不要去！这是幻觉，你会死的！
//不，我绝不会离开。我这一生的意义，我来此的目的就站在我面前。我不会退后，即便这是幻觉也坚决不会。
//阿尔伯特先生！阿……
//(杂音)
//音频中断，视讯定格在一幅画面：
//
//%E7%8E%AB%E7%91%B0%E4%BD%93%28%E6%97%A0%E7%B2%BE%E7%A5%9E%E5%BD%B1%E5%93%8D%E7%89%88%29
//玫瑰体(无精神影响版)
//无人生还，收起
//无人生还，收起
//记录二
//引子
//命运拉扯着我们前进
//时间放松命运的绳索
//来自深渊的阴暗污染情感
//人类终归失去纯真与现实
//强加身上的绳索紧缚心灵
//并无意识的梦呓诉说感情
//时间万物俱是堕落
//并无一物可脱轮回
//
//记录
//恶食 戒之在馐-饥饿罚之
//你永远别想从我们身上吃掉哪怕一根毫毛。
//20XX年六月六日 联合斩首行动（Baal-Zebul）
//Sharow永远整装待发，正如她第一次踏足未知。
//“请各位检查装备，如有阙漏请立即更换装配，剩余时间：10分钟。”
//Sharow想到了什么似的，回头望向窗外空间的边界。
//“剩余时间：九分钟。”
//Sharow想起了一个人，她或许应该回去和他好好道个别。
//“剩余时间：八分钟。”
//Sharow在掌心写下他的名字——阿尔伯特-普伦内斯,她并不与他熟识。
//“剩余时间：七分钟。”
//Sharow想起了那个夏天，她的豆蔻年华。衰小孩们的胆子大得很，能力也奇葩，好似生神偷走了他们的胆怯。M.E.G.的终端前，顿河的静流旁，鲜花的海洋上，少年探索者留下了他们生机四溢的单薄身影。
//“剩余时间：六分钟。”
//Sharow记得他的手，白皙而湿热，修长的手指蛇一般缠绕着她的手腕，她并不想挣脱。这双手的主人面带酡红色的笑容，从容不迫地牵起她穿过花海，离开那朵危险的白玫瑰。眺望着下方满地玫瑰，这双手似乎在兴奋地颤抖，面沉似水掩盖不了年轻的冲动与兴奋。
//“剩余时间：五分钟。”
//Sharow在16岁做了一个苍白泛红的梦。梦中少女与少年于天堂之下9，白玫瑰的银色长发前缔结了契约，他们早已心有所属，时世大潮卷不动坚韧的绳索。
//“剩余时间：四分钟。”
//Sharow的梦境于18岁碎裂，事故比明天早来了一个小时。时间拉起命运的绞索，年少的得意被泪水湮没。他回来了，失去了近乎一切，记忆里没有她。
//“剩余时间：三分钟。”
//Sharow无时无刻不在想他的面容，她沉迷于回忆的绯红。“Sharow？抬头——”是他的声音，抬头不见人影。她醒来，于低温的准备室中无依无靠地蜷缩。
//“剩余时间：两分钟。”
//Sharow拾起那个黑色的小球，那是她的骨灰盒，但里面没有她的位置。“特种材料，即使炼钢炉也不能使它软化，抗腐蚀能力更是一流。它拍下的画面会实时传回这里，如果出事我们会留下你的遗言。
//“剩余时间：一分钟。”
//Sharow脑海放空，一些话却挥之不去“世界上有些故事你看过就不想再看一遍，因为没有解。有些故事仿佛注定，不是因为偶然也不是因为错过，而是一个解不开的结。如果它恰好是场悲剧，那么它的悲伤在故事开始时已经注定。”
//“切入开始，祝各位武运昌隆，成功生还。”
//纯白塔夫绸落地，上面是盛放的白玫瑰与少女梦中的一切。
//
//Sharow睁开眼睛，开始了探索。这次探索有十多名专员，探索进度很快。手中的测距仪红光乍现，将数据写入Sharow的终端再传出这个空间。“约三十千米，xy轴都接近这个数值……”温婉的女声仿佛为这陌生的巨大空间增添了暖色。
//（一小时后）
//“它们终于漫上来了……那东西也在，是否开火？”
//“自由开火，不考虑后果找到它的核心。”
//霓虹发射器不断闪亮，联合斩首的精英们不分组织地互相信任，互相支援。
//“停止开火，剩下的组织由人工剥去。”
//年轻的精英们无畏地跳向那可怖的血肉，将其不断剥开，他们自己也同时殒命其中。
//Sharow终于见到了空间的主人，或者说——主人的心脏。
//
//%E6%81%B6%E9%A3%9F%E4%B9%8B%E5%BF%83
//恶食之心
//
//她凝视着它，它凝视着她。她举刀没入晶莹剔透的心脏，血肉将她拥入怀中。
//生命最后一刻，Sharow看到了白玫瑰。它颀长的身影在Sharow面前闪动。白玫瑰背后，阿尔伯特缓步踱出，仍是那个翩翩少年，只属于她的梦中人。
//Sharow在那一刻觉得，她是整个世界最快乐的人。
//
//无人生还，收起
//
// 
//基地、前哨与社区
//恶食地狱内不可能存在任何基地、前哨与社区。
//
//入口与出口
//入口
//拾起恶食地狱投放的请柬，将在本年六月六日六时准时切入恶食地狱。
//尝试通过口腔摄入巨量愤怒胡椒再进行诺克立普贴切入实验，有概率到达恶食地狱。
//出口
//不可能生还，消化完成后，不可消化部分便会被投送回原层级。
//
//作者信息
//Footnotes
//1. 数据为切入者使用激光测距仪测量，在投入自动机械后进行了精度更新。
//2. 并未观测到任何实体收到“请柬”
//3. 表现为黑色正四边形类铜版纸物，未在样本中检测到文字存在，但所有对象一致声称其名称为“请柬”
//4. 未能通过诺克立普贴等手段救出任何已切入者。
//5. M.E.G.目前已开展“请柬”封锁与回收工作。
//6. 成为“食物”。获得新生
//7. 此过程不可逆。
//8. M.E.G.目前已开展部分遗体回收及数据采集工作。
//9. 地狱之中。
package lvls15x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1559{}