//Level C-518
//评分: 
//+6
//+
//–
//X
// 
//
//生存难度：
//等级 2
//
// 
// 
// 
//bf93f810b4514c93aeb02fd1195156d70fcd64fa
//Level C-518的一条走廊
//
//Level C-518是后室C层群的第518层。
//
//描述
//Level c-518在物理外观上表现为一个剧院，由多条走廊和数目庞大的房间组成，走廊墙壁由被粉刷成米白色，推测由水泥构成，地板为白色的瓷砖。走廊两侧可见许多镶嵌于墙壁上的小型门，从外观和重量来看，可能是金属制成，但由于外部涂有蓝色喷漆，因此无法确定其具体成分。
//这些门通常上锁，但钥匙可在距离最近的道具间内找到1。门中可以找到小瓶的寂静汁液和隔音物品。房间分布于走廊两侧，已被确定房间多数无法打开，但少数房间为化妆间，道具间或洗手间，其中可能会拥有少量补给。
//
//该层级中拥有相当数量的具有“11效应” 的无面灵，这些无面灵通常会使用清洁工具清洁该层级走廊的地面或无目的的游荡。在该层级中发现的实体有窃皮者、猎犬，有流浪者称他在房间中看到了一个笑魇，但目前尚未证实。
//
//以下是能够在该层级中找到的主要房间:
//
//接待大厅
//接待大厅拥有着大约500㎡的面积，Wi-Fi信号良好，且配备有供电良好的电源。该房间内拥有时间准确的钟表，可用于确定时间。
//
//休息区具有多张座椅，聚集了大量无面灵，包括幼年无面灵和老年无面灵，但幼年无面灵在老年或者成年无面灵身旁时会试图对流浪者做出打招呼的动作并表现的彬彬有礼，并不会表现出对流浪者的攻击性。位于自动售货机中拥有大量可食用食物，但似乎已损坏，通过用力拍打售货机的方式可以让它掉出来一些食物，但食物的种类是随机的。
//
//售票大厅拥有多条通向其他走廊的通道，这些门出现的时间和地点均为随机。
//
//音乐厅
//音乐厅位于售票大厅的一扇红色双开门后，其外观表现为一间剧院中演出所用的大厅，拥有多排座椅和一个舞台。
//
//音乐厅门前有一份告示，内容为:
//
//禁止观众携带食物或水杯进入音乐厅。
//禁止于演出开始前5分钟至演出结束期间内进出音乐厅。
//禁止携带录像录音设备进入音乐厅，音乐厅内禁止拍摄。
//根据数名违反上述内容的流浪者报告称，他们在试图进入音乐厅时触摸到门把手的一瞬间有一种"极大的恐惧感''，仿佛前方拥有"十分恐怖的事物''，但在后期询问时，几名流浪者并不能解释出感受到恐惧的原因，并对进一步的探究原因表现出了抗拒。目前这种现象的来源是未知的。
//
//演出事件
//在演出事件被触发后，所有在场的流浪者会凭空收到一张红色的演出门票，门票上标注了演出时间、地点和座位号。由于门票是突然出现的而且可能会出现在流浪者的背包或衣兜中，建议流浪者仔细检查自己携带的物品中有没有红色门票，再决定是否进入音乐厅，任何试图丢弃门票的尝试均告失败，无论流浪者是将其撕碎，置于视线外或是赠予其他人，身上会重新凭空出现一张新的门票。当持有门票者进入音乐厅后，会陷入一种神志不清的沉醉状态，并会寻找自己的座位坐下。不携带门票者在演出事件发生后进入音乐厅会在演出开始后切出到随机房间中。
//
//所有持有红色门票的流浪者在离开音乐厅后，出现了轻微的思维混乱和不由自主的喃喃自语等现象，且均声称他们"被音乐治愈了''，出现该种情况的原因目前未知。值得注意的是，如果流浪者在进入音乐厅前的确患有精神疾病的话，该名流浪者的疾病会得到完全的治愈，同时，在进入音乐厅前使用隔音设备和寂静汁液可以减轻负面影响。
//
//由于无法将录音设备带入音乐厅，且所有于演出事件结束后离开音乐厅的流浪者均无法想起音乐厅内部发生的具体事件，故无法得知该事件的更多具体细节。
//
//基地、前哨与社区
//M.E.G.前哨站“乐师”
//共有36人常驻。
//对流浪者友好且乐意提供帮助。
//驻扎在售票大厅外的一条固定走廊中。
//入口与出口
//入口
//使用Level C-525中除管风琴 外的任意乐器连续演奏三次相同的大小七和弦可以来到该层级。
//切入Level 57中一幅描绘乐团的画作有概率来到该层级。
//出口
//切入该层级中的唯一一个钟表会将你带入Level C-515
//切入墙壁上一张格格不入的描绘嘉年华的海报会带你去到Level 283
//曾有一名流浪者在连续饮用19瓶自动售货机中的杏仁水后切入了Level C-19的湖泊中，但我们并不建议这样做。
//作者信息
//« Level C-517 | Level C-518 | Level C-519 »
//
//Footnotes
//1. 通常来说一把锁会有多把钥匙
package lvls15x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1518{}