//Level C-520
//
//
//评分: 
//+44
//+
//–
//X
// 
//
//生存难度：
//
//等级 变化
//
//安全性随地段变化
//可利用
//人类实体高度混居
//Level C-520是后室C层群的第520层。
//
//描述：
//Level C-520本体分为三种场景，分别为外围荒村、楼阁建筑群、中心宫阙。三者并不是以传统的分布思路呈环形中心嵌套，而是随机分布。不同的部分之间存在着一种光学视障，使流浪者无法在一个部分内观察到其他部分的情况。曾有流浪者试图通过同时站在两个部分的边界处观察另一部分的情况，但该流浪者最终因越过视障而切入虚空，生死未卜。
//
//虽然三类场景间彼此存在着极度混乱的视障间隙，我们仍想办法取得了本层级的精确地图1。经分析我们得知这三类场景分布极其散乱无序，但流浪者处在任一场景时不可能会观察到场景分布的不连续性。当流浪者想在不同场景中通行时，其可以通过一系列特殊方式进行相应的切入操作。而视障区域并不是完全无法辨别的，每个视障区域的标线处都会存在一条流淌着天然水的石质水渠。水渠会无视场景的情况任意出现，甚至连存在坑洞及雕像处都会直接有水渠穿过。水渠和障碍物交错处会发生形态错乱，不建议直接打取水渠中的天然水。
//
//总体上Level C-520的安全性会随其场景的变化而变化，而场景的不同地点在不同时间和不同行为发生的情况下其稳定性和安全性也会发生变化。具体信息如下所示：
//
//外围荒村：
//收起信息栏
// 
//
//生存难度：
//
//等级 3E-环境
//
//少量实体游荡
//不稳定
//敌意环境因素
//向来歌舞处，忽复成荒村。
//
//
//——秦观《游仙二首·服形百神朝》
//
//stone.jfif
//切入此层后流浪者第一个见到的地方
//
//主要地点：
//壹——石屋：
//石屋内的主要结构为卧房、厨房、客厅、出口
//
//在大多数情况下切入此层级的流浪者都会出现在石屋之前，石屋外观为一栋在中国古时西南方常见的石质民居建筑，不同之处时屋内进深无法测量，远大于其外表所示容量。内部不存在光源，但允许流浪者使用自己携带的光源。在石屋内存在着极少量笑魇和死亡飞蛾，且仅会在石屋内的厨房出现。由于石屋内存在着进入其他场景的唯一入口，建议准备切入此层级的流浪者携带可靠光源和自卫武器，并远离厨房处，仅在客厅、卧房内补充物资。
//
//客厅内有着少量可用资源，包括但不限于杏仁水、袋装密封火盐、长明灯，充分利用这些物资能帮助流浪者安全度过在石屋内探索的前期过程。
//
//卧房永远不会在入口处出现，而是在进入过至少一个客厅后才能被发现。卧房内基本上不会出现实用性物资，而是普通的草席、几案、毛笔等中国古代卧房的常见摆设。在几案及草席后有着方形洞口，洞口处覆有草帘，靠近洞口可以看见浅绿色微光，感受到微风吹拂。洞口后经调查为窗户的变种，这种窗户不会主动引诱流浪者，而是自发地询问一些和中国唐代诗词内涵有关的问题，流浪者可以安全地选择拒绝回答。如流浪者选择回答，那么回答正确时，窗户会弹出一个未经烤制的带字竹简。竹简内容各不相同，但大体范围限制在唐代新古文运动鼎盛时期的篇幅内。当流浪者持有该竹简时，阅读完竹简古文后其会指示流浪者出口的方位，一旦流浪者抵达出口，竹简自身会快速腐坏化尘；回答错误，窗户会马上尝试吞噬流浪者。我们仅建议流浪者在持有火盐或长明灯的情况下选择回答窗户的问题2，一旦窗户表现出敌意，立刻使用火盐进行攻击，直至不再有风感。
//
//苔痕上阶绿，草色入帘青。
//
//
//——刘禹锡《陋室铭》
//
//一个石屋中的出口可能有很多，但其外观无一例外地是一个由苔痕遍布的石块构成的潮湿狭窄廊道，宽约6尺，无论离出口尽头多远都可以看见廊道另一端发出的朱红色微光。找到出口的方法有两种：一是如上所述回答窗户的问题，得到方位竹筒；二是在石屋内行走满4里，你最后会看到红色微光，那便是出口所在。
//
//一旦流浪者选择进入出口，那么流浪者走至其尽头时会不可逆性地切入下一场景——楼阁建筑群。
//
//贰——野生荷池
//野生荷池是该场景中危险系数最高的区域，同时其也在该场景中占地最广。当流浪者初次切入此层级时，正对石屋转头即可从远处看见一望无际的野生荷池。野生荷池内实体绝迹，但表现出了较大的环境危害性。绕过石屋前的草地，在河岸处的草丛旁会出现一艘轻型木制渔船，没有顶篷。经取样观察可知荷池内的水样均为一种带有真正荷花清香的特殊腰果水，这些腰果水的效果与一般腰果水无异，如确有必要进入野生荷池，那么切勿离开渔船，否则你必然会丧命于腰果水之中。此外能构成环境危害的还有一种类似于沉香的淡紫色香气，这种香气会使流浪者陷入昏睡从而让渔船失衡，自身掉入池中。荷花池内布满了密密麻麻的“荷花”种群，经检测“荷花”含有高度毒性矿物，因此极度不建议触碰此处的“荷花”，荷花的主要构成物质在各部分分别为：荷叶——孔雀石，茎秆——绿柱石，外侧荷花花瓣——粉色钙钛矿石，内侧荷花花瓣——朱砂，黄色莲蓬——愚人金。虽然“荷花”的毒性极高，但其中包含较多宝贵的易获取矿物资源，在防护条件良好的情况下我们会定期派遣小队在此开采“荷花”。除荷花及香气外的环境威胁包括但不限于：间歇性腰果水降雨和偶发的轻微横风。建议使用塑料布等物品在穿行荷池时搭建临时顶篷以躲避降雨。
//
//燎沈香，消溽暑。鸟雀呼晴，侵晓窥檐语。叶上初阳干宿雨，水面清圆，一一风荷举。
//故乡遥，何日去？家住吴门，久作长安旅。五月渔郎相忆否？小楫轻舟，梦入芙蓉浦。
//
//
//——周邦彦《苏幕遮》
//
//叁——茅屋荒村
//如流浪者成功使用木制渔船穿过了野生荷池，一条土路会出现于岸边的牛蒡丛后，土路两侧偶尔可以发现固定的中国古代高底灯座，这些灯座实质上就是固定的长明灯，一直跟随这条土路前进你会来到一个拥有8~15间茅屋的荒废村落。除茅屋外村落内亦含有畜栏、菜地、井、简易市集等基础设施。
//
//茅屋荒村内存在着区域独有的天气现象，天空长期呈雨前的灰黑色，但从未有过降雨报告，每隔37s可以规律性地听见雷声。
//
//茅屋主要有两种：一种是有顶茅屋，有顶茅屋内光线较为昏暗，其中可能潜伏着悲尸和死亡飞蛾，确保进入前你已携带了一盏长明灯。有顶茅屋内环境大体干燥，空间宽敞，允许自然光源照射。整体布局为一体式，门口旁有柴灶，柴灶上架有一口可正常使用的铁锅，手持长明灯可以自发将其点燃作照明或烹饪用。房间另一端是小型火炕，火炕膛内未填充干柴。流浪者一般能在火炕上发现杏仁水和罐装龙肉等口粮补给，但数量不多；另一种是无顶茅屋，无顶茅屋并不是完全没有茅草制顶，而是具有较大缺口。而对比有顶茅屋可以发现无顶茅屋内没有火炕，只有床台。床台必定会出现在屋顶漏洞之下。无顶茅屋整体寒冷潮湿，在夜间可以听到孩童的哭闹声，这个哭闹声在离开茅屋后即消失，尚不明其声源。屋内除高度压缩的破旧棉被外没有发现其他物资。虽然实体绝迹，但在物资充足情况下不建议在无顶茅屋内休整。
//
//生活设施中唯一值得注意的一点是村落中心的井，我们目前无法用包括声呐在内的所有方法测得井深。井内的所含水分皆为杏仁水，杏仁水的水平长期维持在距井口20(±5）cm处，推测有丰沛的地下杏仁水水源对其进行不间断补充。这些井的存在极有可能也证明了为何层级内会存在天然水资源，不过我们目前尚缺乏目击杏仁水和腰果水进行剧烈反应的目击报告和音频记录。
//
//茅屋荒村内不存在通向其他场景的出口。
//
//布衾多年冷似铁，娇儿恶卧踏里裂。
//
//
//——杜甫《茅屋为秋风所破歌》
//
//楼阁建筑群
//收起信息栏
// 
//
//生存难度：
//
//等级 宜居
//
//安全且稳定
//友好社区
//资源丰度高
//盘盘焉，囷囷焉，蜂房水涡，矗不知其几千万落。
//
//
//——杜牧《阿房宫赋》
//
//楼阁建筑群在目前所掌握的地图上绝大多数都是正方形的，且建筑严格按照其中轴线对称分布，而唯一的可能的例外则是地图一角处的个例，总体上呈梯形，由于该个例可能有部分处在勘探区域外，我们尚不能正式将其列为例外。楼阁建筑群内所含的基本地点为城墙、揽星楼、园林区，这些基本地点将在一下部分进行介绍。
//
//楼阁建筑群是整个层级内容纳人口最多的场景，其中也存在着大量友善实体，这些实体也同样会被视障边界限制，但能通过特殊手段监视层级内大多数区域。我们所掌握的信息大多数来自于这些友好实体。换言之，该类实体无法勘探的区域我们目前也无能力对其展开勘探行动。
//
//由于该场景极其诱人的宜居性质和丰富的武器、矿产及生活资源，各个组织在此均设有基地。层级内驻扎的各组织达成了协定，进行分区驻扎并按已知地块划定了缓冲区，尽全力避免冲突爆发。值得注意的是，想要在此建设基地必须经过实体社区的同意，任何行未经许可建立大型基地之举者都将成为众矢之的。目前仅有2个大型基地被允许在此场景内建立，而与之相反，实体社区极度欢迎单个流浪者或小型团体入住揽星楼。
//
//主要地点：
//壹——揽星楼
//photo-1532400723696-b52bce9f1ca0?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MjMzfHxjaGluZXNlJTIwdG93ZXJ8ZW58MHx8MHx8&auto=format&fit=crop&w=500&q=60
//揽星楼底层周边景观。
//
//揽星楼的外观为中国宋元时期的大型居住用楼层，楼层内各个角落都分布有无法拆卸的长明灯；不过楼层内部的布局极大程度上与其现实原型相悖。揽星楼的个体外观除层数外无较大差别，层数必定为阳数的阳数倍数，总之全为奇数层建筑。揽星楼现被公认为楼阁建筑群内的专用聚居区，住户既有实体，亦有人类，拥有各种必要的生活设施和对应功能。这些功能随楼层数的变化亦会发生改变，详情请见下文归纳：
//
//铜鉴层：
//明星荧荧，开妆镜也。
//
//铜鉴层以1，10，19……层的顺序逐个出现。铜鉴层内拥有许多擦拭得透亮的铜镜，这些铜镜在白天时全部面向层中心的玉石制承重柱，并且无论有何种亮度的光源靠近都无法使它们反射出亮光。在黄昏时刻这些铜镜开始缓慢转向外侧，并以未知原因对外放出亮光，从远处观察其亮度与一般的星光相近，闪耀而不刺眼。铜鉴层内圈存在着可自由移动的屏风，这些屏风一般被用于临时构建更衣室或仅仅用来围住所堆放的杂物。在地面的铜鉴层都是四周密封的，人员出入较多。
//
//濯洗层：
//绿云扰扰，梳晓鬟也；渭流涨腻，弃脂水也。
//
//濯洗层以2，11，20……层的顺序逐个出现。濯洗层外圈呈伪密封模式，使用竹帘遮盖内部景观，围绕螺旋阶梯处的内圈空间较为狭小，在平台处面前即为一扇扇带纸质窗户的红木木门，木门内即为照应层名的濯洗室，濯洗室里有一个较大的木制浴桶，旁边的木箱内放置了大量花瓣，花瓣会在濯洗室无人后的约5小时内完成补充。这些花瓣大概是作泡澡用，不过目前我们已展开行动回收行动，从无人居住的揽星楼内收集花瓣并用于提炼相关产品。
//
//栖形层：
//烟斜雾横，焚椒兰也。
//
//栖形层以3，12，21……层的顺序逐个出现。栖形层外圈为装有滑槽的纸质木框落地窗，同时在外圈亦存在按八卦形状分布的八个铜质香炉。香炉会不间断地向外排放轻质烟气，这些烟气的直径极小，粘着力弱，不会对人的呼吸系统造成实质性危害。目前已被辨认出的香炉内香料有：沉香、杜衡 、月麟香、甘松、 苏合 、安息、郁金、捺多、和罗、丁香等名贵香料，但所有尝试打开香炉并提取香料的尝试均告失败。无论以何种方式打开炉膛里面都无法发现香料。
//
//栖形层内各个子房间用樟木门相分割，每个子房间内都包含一套中国宋元时期常见的卧具和坐具，但不存在书房用品。目前有人类及实体居住的揽星楼的栖形层都被广泛当作卧室使用。
//
//机巧层：
//高低冥迷，不知西东。
//
//机巧层以4，13，22……层的顺序逐个出现。据推测为揽星楼内自设的安保单元，使用技术疑似中国古时的机关术，且具备驱动供能能力，能量来源未知。
//
//若你以非住户身份或未经本楼住户同意进入揽星楼内，机巧层将会立刻投入使用，发出类似于鹧鸪叫声的警报声。机巧层兼具驱动与防御功能，如果你成功破坏了所有机巧层，那么上述楼层的异常性质都会消失；防御功能则体现为三个阶段：阶段一即会让非法闯入者在铜鉴层内迷失方向；阶段二时机巧层则会发出只能被闯入者听见的令人不安的噪声，这些噪声包括但不限于：超过70分贝的古战车行进声、喊杀声、马蹄声；阶段三时机巧层开启主动防御，从机巧层内释放木制工蜂对闯入者进行攻击，这些木刺没有毒性，但工蜂的密集攻击可以对闯入者进行有效驱赶。当有木制工蜂损失时工蜂会在坠地瞬间发出爆鸣声，震慑闯入者。
//
//珍馐层：
//奈何取之尽锱铢，用之如泥沙？
//
//珍馐层以5，14，23……层的顺序逐个出现。现被住户当作用餐地点，珍馐层内出现的菜肴以5天为日期每日轮换，且在各住户用餐完毕，完全无人的一段时间后会重新出现新的菜肴。与此同时，上次用餐未食用完的菜肴也会被替换。一天内菜肴最多能被替换5顿。
//
//珍馐层内出现的菜肴及轮替顺序如下表格所示：
//
//日期	菜肴一	菜肴二	菜肴三	菜肴四	菜肴五	菜肴六	菜肴七
//一	醒酒鲭	单笼金乳酥	巨胜奴	葱醋鸡	五生盘	汤浴绣丸	天花
//二	曼陀样夹饼	贵妃红	汉宫棋	水晶龙凤糕	仙人脔	吴兴连带	八仙盘
//三	婆罗门轻高面	生进二十四气馄饨	见风消	白龙	乳酿鱼	遍地锦装鳖	素蒸音声部
//四	剔缕鸡	飞孪脍	剪云斫鱼羹	永加王烙羊	虞公断醒	成美公藏	含春侯新治月华饭
//五	萝菔面	酥酪蝉	蒸鲥鱼	青虾卷	五香糕	百鸟朝凤	樱桃肉
//该楼层的菜肴亦具有异常性质，依据肉眼观察并回溯计算后发现一份菜肴的量可以供应一个成年人约4顿晚餐的饱腹感，但在食用至菜肴的量约1/8时菜肴会自动消失，直到下餐才会再次出现。经饱腹感测试目前单顿的菜肴似乎仅能满足一个节食期间女性的晚餐需求。因此在部分住户之间可能会出现营养不良的情况，针对此问题我们会专门派遣配送小队搜集空置珍馐层内的菜肴并及时送达有需求者处。
//
//勾连层：
//廊腰缦回，檐牙高啄；各抱地势，钩心斗角。
//
//勾连层以6，15，24……层的顺序逐层出现。作为除了地面铜鉴层外唯一一种能与其他揽星楼连接的楼层，勾连层在揽星楼间的交流和物资转运中发挥着至关重要的作用。勾连层外即为一条悬空的带顶木制廊道，廊道内设有小型茶桌和虎凳，但没有出现对应茶具。任何尝试破坏廊道以断绝楼层间联系的防御性行为都失败了，廊道本身无法被任何手段切断。
//
//廊道内唯一的异常性质是无法通过其本体观察外部空间情况，外部景观在任意时段都会被栖形层香炉发出的密集烟雾所遮盖，这些烟雾是无法驱散的，但曾有流浪者报道在雨天时可以通过烟幕观察到彩虹，这一说法因人而异。
//
//丝竹层：
//朝歌夜弦，为秦宫人。
//
//丝竹层以7，16，26……层的顺序逐层出现。丝竹层内分布着大量在中国宋元时期前出现的小型乐器，这些乐器皆可正常演奏。而丝竹层本身并没有明显的实用生活功能，但被普遍认为具有娱乐功能。
//
//丝竹层唯一的异常性质在于层中的乐器在层级内每日8~10时，14~16时，20~22时都会在无人触碰时自发进行演奏，演奏的曲目包括但不限于：《清商》、《清徵》、《清角》、《黍离》、《式微》、《霓裳羽衣曲》、《玉树后庭花》。这些乐曲被聆听者形容为“非常的悦耳，非常的动听，似有师旷操琴，马融奏笛，李凭拨弄箜篌”，总之这些乐曲具有无法抵抗的吸引力，一旦聆听者聆听这些乐曲超过五分钟那么在接下来的演奏时段内都无法离开丝竹层。丝竹层的特殊性质可能会耽误紧急情况下的逃生行动，因此我们强烈建议住户们快速通过丝竹层，不做非必要的停留。
//
//金藏层：
//鼎铛玉石，金块珠砾，弃掷逦迤，秦人视之，亦不甚惜。
//
//金藏层以8，17，26……层的顺序逐层出现。金藏层目前仍被视为揽星楼内最无用的楼层：尽管其中会出现各种名贵的珠宝及黄金、白银饰品，但这些物品实际上都是虚影，没有真正的形体，目前其唯一的潜在作用是可以在其中堆放一些其他物品，以这些虚影作为掩蔽。
//
//独夫之心，日益骄固。戍卒叫，函谷举，楚人一炬，可怜焦土！
//
//识慧层：
//后人哀之而不鉴之，亦使后人而复哀后人也。
//
//识慧层以9，18，27……层的顺序逐层出现。识慧层是为九层循环的最终层，识慧层的实用价值较低，但具有极高的人文学术价值，原因就在于此楼层内皆会出现在前厅内中国先秦时代传说中存在但已失传的所有书籍，更令人惊喜的是一些从未被史料记载的各类书简也一并会出现在此楼层中。有趣的地方在于楼层内即使没有长明灯，识慧层自身也会以未知方式发出无法触碰的疑似火光的光亮，在每夜子时纸质窗面上有时会出现血迹和土渍，请各位住户不要惊慌，这些现象不会产生实质性危害。
//
//及至秦之季世，焚诗书，坑术士，六艺从此缺焉。
//
//
//——司马迁《史记·卷壹贰壹·儒林列传》
//
//贰——园林区
//帘外雨潺潺， 春意阑珊。 罗衾不耐五更寒。 梦里不知身是客， 一晌贪欢。 独自莫凭栏， 无限江山， 别时容易见时难。 流水落花春去也， 天上人间。
//
//
//——李煜《浪淘沙令·帘外雨潺潺》
//
//园林区是层级内友好实体最喜爱的游荡地点，园林区内存在茶桌，木亭，戏台等多种娱乐场所。在大型园林中还能找到茶楼，舞榭，酒馆等室内娱乐地点，这些场所有时还会被用作贸易洽谈的常用场所。层级内的友善实体极度乐意组织并参加发生于上述地点的各项娱乐活动，其痴迷程度可称“忘我”，友善实体陶醉于娱乐活动的期间其不会理会各种突发状况。在冲突发生时，我们强烈建议流浪者切勿干扰友善实体并迅速撤离事发地点，进入揽星楼底层躲避，或寻求城墙上M.E.G.武装人员的帮助。
//
//除上述人文景观外，园林区内也存在着大量观赏性植物，这些植物的体积无不超过前厅内原植物的平均大小35 %。在这些观赏植物中我们发现了福橘、观赏葡萄北冰红、观赏樱桃。由于上述性质的存在，这些观赏水果的果实大小也得到了极大增幅，食用价值大大增加。当揽星楼内搜集的盈余菜肴不足时，M.E.G.也会尝试收集这些观赏水果作为补充。
//
//叁——城墙
//鸦飞深在禁城墙，多绕重楼复殿傍。
//
//
//——王涯《宫词三十首》
//
//城墙是楼阁建筑群这一场景内最有战略意义的部分。由城墙的外观可大致辨认出其年代约在明清之间。
//
//城墙亦为不同势力的重要分界线，以女墙分界基点，各组织经协商划分好了自己的势力范围，目前约有7个欢迎流浪者自由进出的安全区域，其余区域允许流浪者进入，但不准流浪者触碰其中的任何物品。
//
//城墙之上会定期出现或补充各式中国古典冷兵器和火器，目前收集到的火器内装填的火药有三类：黑火药、火棉、火盐。其中性能最佳者为火棉，而爆炸性火器内填装的炸药则有芒硝、未知成分的土制炸药和紫砂。请注意：我们允许流浪者在通过验证并登记后取用普通火器作防身用，但任何窃取装填紫砂火器的行为我们将严惩不贷，紫砂始终是极度危险的禁用品。M.E.G.会与友善实体密切合作，确保不会有人因此遭受不幸。
//
//存在的实体：
//无面灵：此处的无面灵皆身着中国古式服装，这些服装所对应的性别、社会地位和职能不尽相同，这一特征可以通过其交流方式及日常举止显示出来，并已得到验证。
//诗魂：诗魂是一种无害且无形体的高智能人形个体，尽管它们外貌皆呈肉眼可见的诗人装扮。诗魂会在层级内夜间出现，有时它们会主动找上流浪者友好地询问流浪者对其诗作的看法，当流浪者对其诗作表示由衷赞赏之情（若是违心评论则是无效的）时其会赠与流浪者各种各样的普通茶点作为小礼物；当流浪者不认可其水平时诗魂会立刻寻找周围的水池并奔向水池内，据推测是郁郁寡欢而导致的自我了断的冲动。流浪者不必也无法阻拦诗魂的此种冲动，不过曾有流浪者报道其再次见到了一个曾“自我了断”的诗魂个体。
//金鳞军：金鳞军是负责镇守城墙，守卫楼阁建筑群内整体乃至内外安全的一种人形实体，具有森严的等级制度，按其等级和巡逻区域分为：
//中军：最高等级，有权力使用火器及爆炸性火器，负责守卫城墙内围至建筑群的空旷地带。
//上军：第二等，有权利使用火器，负责守卫楼阁建筑群内各通衢巷道的治安秩序。
//下军：第三等，只允许使用冷兵器，负责揽星楼楼下及园林区的日常巡逻工作。
//独有物品：
//三眼铳
//gun.jfif
//三眼铳局部图像。
//
//三眼铳是城墙上最常见的杀伤性火器，也是层级内使用得最为广泛的自卫型火器，三眼铳内可以装填黑火药和火盐，如装入火棉则会发生炸膛。三眼铳的异常之处在于只要未触及枪机处，枪口可以任意截短并不会影响其弹道及射程，因此各类人群都可按需对其进行改造，以让三眼铳适应不同的作战场景。
//
//目前层级内的三眼铳数量已接近饱和，我们已和金鳞军、B.N.T.G.合作，将过剩的三眼铳及各类火药安全转运出本层级并对外分发或售卖，物尽其用。
//
//虎蹲炮
//虎蹲炮是一种能发射小号炮弹的单兵使用的42毫米口径铜质火炮，后膛击发。其使用的标准弹药会以4~9的数量随机出现在虎蹲炮旁。虎蹲炮的击发药为火盐和火棉，而不使用黑火药，从而极大增加了虎蹲炮的射程和精度。
//
//上述的标准弹药分为三类：其一为破敌球弹，铅质，重达80斤；其二为水银弹，这种标准弹药里装填了大量水银，在炮弹破裂时高温会使水银快速蒸发并从裂缝中以高压气体的形式喷出造成中毒伤害，为保证其杀伤效果，炮弹不采用含硫火药；其三为祝融弹，这种弹药外表涂抹有羊油，在距离不是过远的情况下羊油内层包裹的剩余火棉压缩层会散开并造成二次爆燃，近距离内摧毁敌对目标。
//
//虎蹲炮的另一个伴生物品是一些铅质的空心弹壳，这些弹壳的数量远多于标准弹药，可以通过向这些弹壳内填充其他物品来取得其他的效果，目前已制造或缴获的定制弹药有：灌装杏仁水的实体杀伤弹、灌装腰果水的人员阻滞弹、填充火油的仿制祝融弹、装填寂静汁液的镇暴弹、注入亚格莱素稀释液的剧毒炸弹等等。
//
//蒺藜火球
//蒺藜火球相较于上述物品具有更为恐怖的破坏力，因此目前层级内除金鳞军外没有任何组织有公认的可使用蒺藜火球的能力。换言之，蒺藜火球是一种极为有效的威慑手段。每个势力或团体都可能持有蒺藜火球，一旦某个组织率先发难，那么其必成为众矢之的被各方势力的蒺藜火球围攻，这种围攻造成的结果往往是灾难性的。因此我们不允许任何流浪者持有蒺藜火球。
//
//蒺藜火球内部装填了大量紫砂、铁珠和陶片，可以造成极广范围的破片杀伤。同理，可以用给弹壳加入弹药的类似方式对蒺藜火球的性能进行强化，甚至可以放入其他较为惰性的炸药制成集束炸弹。目前各方势力已经协调达成一致不在本层级内使用蒺藜火球，而是通过联合监督的出口各自运出收集到的蒺藜火球。
//
//破风朱雀
//破风朱雀使用了与机巧层木制工蜂一样的木制机关术。给破风朱雀上紧定向发条，点燃其尾部的引火装置即可使其升空进行直线空中巡逻或空袭。
//
//破风朱雀的异常之处在于其令人惊异的极其轻质的木材，经测定该木材的莫氏硬度3为5.4，密度却相对碳纤维较低，尚无法解释何种轻质木材可达到如此优秀的性能。根据标准弹药重量4，破风朱雀可携带约2.25个标准弹药。破风朱雀的最长巡航里程（含返程，在满能源情况下）为640米，其背脊处有滑槽，用于注入能源5，而其腹部即为机动系统。不推荐直接拆开腹部研究机动系统，因为已有因拆开破风朱雀腹部被其自毁装置炸伤的案例报告。所有使用X光片对其内部结构的探查尝试也均告失败。
//
//目前已被开发的破风朱雀的使用方式包括但不限于：
//
//携带延时摄影设备进行勘探侦察。
//携带火盐进行定向焚烧。
//携带标准弹药进行空中威慑。
//携带树种花种等在楼阁建筑群外的场景进行播种。
//
//朱砂烟盏
//朱砂烟盏并不是一种真正的香炉，但具有香炉状的欺骗性外表，实际上香炉内含有一个隔层，内部分布着朱砂和一种未知的高还原性物质6。在烟盏落地后烟盏内部会发生剧烈反应使烟盏爆裂并释放出大量橙色烟雾遮挡视线，这些烟雾内还含有浓度极高的汞蒸气，在保证自身安全或紧急逃生的情况下可以使用朱砂烟盏替代烟雾弹。
//
//目前的朱砂烟盏是可拆解的，从其中提取的硫和汞直接在本场景内被加工，用于园林区内的花草及水果产区的杀虫工作。根据场景内无面灵的说法，朱砂烟盏的正确使用方式似乎是在节日内令破风朱雀搭载朱砂烟盏在空中飞行，其后方会出现耀眼多彩的火光和漂亮的尾迹，十分切合节日的欢乐气氛。
//
//中心宫阙：
//收起信息栏
// 
//
//生存难度：
//
//等级 运变
//
//不安全且不稳定
//未知实体数量
//文件被篡改
//鸟下绿芜秦苑夕，蝉鸣黄叶汉宫秋。
//
//
//——许浑《 咸阳城东楼 》
//
//中心宫阙是所有场景中最难以进入的，目前我们所有关于中心宫阙的信息都是使用无人机或破风朱雀侦察得来。想要进入中心宫阙，唯一的办法就是在月夜时分，对一个诗魂的诗作提出负面评价，并迫使其自我了断，在其投池之时，你应手持一份来自识慧层的书简在其跃入池中的15s内一并跃入池中，你会直接切入中心宫阙。
//
//目前我们严禁任何人以旧文档提到的方式进入中心宫阙，上述方法难以成功，即使成功进入——汝亦当为吾刀下鱼肉。
//
//看来我得对你们这些子孙说点你们能听懂的话？
//
//鉴于人员损失过多，目前所有组织内即各项组织间联合探索行动均被叫停，在新的侦察方式被发明前我们会与金鳞军下军合作昼夜不息地把守水池，并严厉监视诗魂周边环境，以防流浪者误入中心宫阙。
//
//你们并不傻么，反应挺快。我并不想介绍一下自己，我可不那么习惯称“朕”“寡人”“孤”这种皇帝爱自己说的词汇。我的御林军是我亲自挑选的精英中的精英，你们任何想从地上溜进来的把戏都是无效的，他们可以在眨眼间把你们弄个粉碎。至于空中的那些过时的笨鸟和拙劣的黑色机械，只要不干扰到我，我尚可对他们网开一面。
//
//你们永远不会想到我是以何种方式在篡改这些方志，我只在必要的部分下手，至于其他地点的其他风物我倒是很感兴趣。我已经经历过一次亡国之痛了，不过，好在，我以███████████████的方式成功再建了一个世外桃源。
//
//我是这个新朝的中心，因此我划定了那些天堑来阻隔所有贪婪、野蛮之人。至于那些苦吟诗人，我特地想了个保密的方法放他们进来。至于为何我不封闭这些出口，那则是因为我不愿因少数失足者的冒犯来使我已臻完美的花园改观。那些误入者么，请你们放心，他们只是永远住在这了。还有你们一直在探查的那块“邪田7”，其实它就是因为和我的宫阙挨得太近了，我才不得不遮掉一块。现在这个新朝已不再是我一己私欲，递三世直至万世而为君的统治存续，而是众生休息的世外桃源。一旦有苍生胆敢发难，我必从天引兵击之！
//
//M.E.G.已放弃对中心宫阙的访问和求索。
//
//基地，前哨和社区：
//由于层级前两部分的较适宜生存的属性，该层级内存在各类大小不等的团体，目前仅列出部分值得注意的组织建立的基地，前哨和社区。
//
//M.E.G.“前朝遗歌”大型基地
//包含城墙巡逻者在内目前在势力范围内常驻约5000人。
//友好，开放贸易。
//致力于收集生活物资并送给有需求者，同时与其他组织合作向层级外转运危险爆炸品。
//暂无层级内敌对势力。
//M.E.G.“苏幕游人”荒村前哨
//负责收集野生荷池内的各类矿物资源。
//友善，开放贸易，会主动引导初入层级的流浪者进入楼阁建筑群。
//在茅屋荒村内建立了安全稳定的前哨站，用于持续大批量供应杏仁水。
//U.E.C.“鹰击”补给中心
//U.E.C.为数不多的公开基地之一。
//尚未发现其进行非人道行径的线索，已和M.E.G.达成协议，愿在此层级内保持友好关系。
//开放贸易，可能对流浪者划定禁区。
//主要用于为层级外游击队员输送给养。
//帕拉斯研究所PLS-SO-520科研前哨
//驻扎有武装人员。
//地处现有地图边界。
//从事对层级特性、科技及上述机关术的科研活动。
//友好，但不允许流浪者滞留。
//B.C.A.“玉盘”烹饪俱乐部
//实体与人类共同建立。
//友好，开放贸易。
//致力于通过研究珍馐层内的菜肴开发新菜品。
//“速切玩家”报名点及休息处：
//设立于某个楼阁密集区的园林区内，报名点设立在戏台上。
//资源充裕，有能力大量供应参赛资源。
//不建议流浪者与其接触并参赛。
//有识血肉“天际流明”改造巢穴
//遵从“伟大母亲”的意志在此设立巢穴。
//目前正积极寻求改造野生荷池内极端恶劣环境的方法。
//友好。
//B.F.P.F.“520号建材库”
//中立，尝试从空置揽星楼内获取材料。
//同U.E.C.一样，其与M.E.G.在层级内保持不冲突的状态。
//对流浪者友好，开放贸易。
//入口和出口：
//部分入口：
//在任意一个能见到非红色月亮的层级内完整喝下一瓶未开封杏仁水，并使身体完全没入水体可切入此层级。
//将任意一本唐代诗集放入炉灶内焚烧，并饮用混有其灰烬的杏仁水。
//在Level C-435内的一间起居室中找到一本元朝前的中国诗集，以上半身先行切入这本诗集。
//在Level C-274内站在冻海的冰面上，击碎一定厚度的冰面埋入至少约79克火盐，冰面会以未知原因被穿透从而使你切入此层级。
//部分出口：
//在外围荒村的石屋内找到一面由紫色沙石构成的墙，切入这面墙以抵达Level 628。
//在外围荒村的茅屋荒村的无顶茅屋内可以遇见一张望乡台的宣传单，将宣传单揉碎并食用后入睡即可抵达望乡台。
//极少数情况下诗魂会与你进行辩诗，若你赢得辨诗，你会马上晕厥并切入Level C-241。
//这么着急离开吗？但是，若我告诉你这里还有后门呢？
//
//« Level C-519 | Level C-520 | Level C-521 »
//
//脚注
//1. 获取记录详见下文。
//2. 因为诗词含义本身说法不一，我们无法确定答案标准。
//3. F．莫斯以十种矿物的划痕硬度作为标准，定出十个硬度等级，称为莫氏硬度，最硬者为金刚石。
//4. 1个标准弹药重40千克。
//5. 一般为火油。
//6. 据测定其还原电位的标准电极电势达到了惊人的-4.26V。
//7. 据《九章算术》，直角梯形称“邪田”。
package lvls15x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1520{}