//Level C-517
//评分: 
//+20
//+
//–
//X
// 
//
//生存难度：
//安全
//积极精神影响
//无有害实体
//Level C-517是后室C层群的第517层，外观一个悬浮于高空的玻璃平台，层级中央有一座巴洛克式建筑。
//
//描述
//构成Level C-517的主体结构的玻璃展现出了超乎寻常的硬度，经观测后确认具有自动清洁的特性，因此玻璃时刻都能保持透明。该层级的玻璃无法用任何方式破坏。该层级的玻璃下方为大量的云状物质，且远远超出了该层级的边界，由于该层级中的玻璃无法破坏，故无法得知云海内部的具体特性。
//
//该层级中的时间流速及昼夜更替与前厅中夏季保持高度一致，温度恒定于25℃，进入该层级中的任何计时设备都会与该层级时间保持统一。当清晨5：30时，天空逐渐亮起，但该层级中并无传统意义上的太阳，光线仅是亮度增加，并未有位置上的变化。当时间为8：30时，之前的光线会完全消失，于距离该层级可抵达位置较远的云状物质中会升起一轮"月亮"，同时，该层级中的天空中会出现相比前厅中更加明亮的"星星"。
//
//该层级的玻璃平台上有小部分玻璃为浅紫色或深蓝色。当流浪者位于这些玻璃方块上方时会听见来源不明的乐声，其中浅紫色玻璃为轻音乐，且多为流浪者曾经听过的。深蓝色玻璃为交响乐，多为巴洛克风格的大调曲式。当流浪者听到任意一种音乐后，都会感到无比的宁静，专注力会大幅度的提升。同时，患有精神疾病的流浪者听过该层级中的音乐后，症状出现了不同程度的减轻。
//
//该层级每间隔一段时间会出现"流星雨"，通常会在夜间发生，持续1-2个小时观测到流星雨的流浪者会感受到心灵上的慰藉，同时会思念家乡，亲人。观测过流星雨的流浪者会感到"释怀"的情绪，通常这会让流浪者放下之前的仇恨，同时也会放弃主动伤害其他流浪者的想法。值得注意的是，如果患有精神疾病的流浪者在观测流星雨的同时站在彩色玻璃上，这名流浪者的精神疾病会被完全的治愈，目前造成这种现象的原因未知。
//
//该层级正中央的建筑是可以进入的，建筑外观呈现为西方中世纪时期的装修风格。从外部观测此建筑占地仅有1250平方米左右，但内部的似乎为另一个空间，面积达到了18350平方米1左右，同时，该建筑内部的面积会随着流浪者进入的数量增加或减少。
//
//大厅
//流浪者进入建筑内部后通常会切入进该建筑的大厅部分，大厅内部包含一个吧台，一个休息处和多扇通往其它区域的门。吧台前有一名可以交流的无面灵，该实体会通过在纸上写字来回答流浪者的问题。大厅内的门可以通向餐区，剧院和住宿区。
//
//餐区
//餐区的外观类似于中世纪的宴会厅，但其面积要大得多，在房间正中间有一张贯穿整个餐区的长条形桌子，桌面上放有餐具，每天的7:00,12:00,6:00时，通往餐区的门才可以成功进入，同时桌子上会出现数目庞大的食物。经观测，餐区内的食物数量和房间面积取决于下一次餐区开放前层级内的人数。餐区结束开放的时间为开放后一个小时，如果流浪者在结束时仍未离开该区域的话，流浪者会直接被传送到建筑外的随机一个彩色玻璃块上。
//
//住宿区
//该区域的结构类似于酒店，已经在此居住过的流浪者进入住宿区时会直接切入其所住房间的楼层，首次进入则是随机切入。每个房间均为单人间，其中生活设施较为齐全，同时每个房间内均有一个书柜，书籍多为娱乐报刊或童话绘本。
//
//住宿区与剧院连通，在每日7:00-7:30之间可以切入流浪者所在楼层尽头的红色双开门进入剧院，每日7:30时会有无面灵于剧院台上演出，演出时长通常为一小时或1.5个小时，这种音乐与踩踏彩色玻璃时听到的音乐相同，均具有缓解精神压力的功效。
//
//在该层级中有时可以看到较为温顺的无面灵，前厅信使在该层级中出现的次数明显要高于其它层级。在建筑物大厅区域内的休息区经常可以看到一名女性人性实体，该实体外观大约相当于14岁的人类女孩，身着黑色礼服长裙。通常该实体会坐在休息区中阅读童话书，不会理会任何试图与其交流的举动，偶尔会前往休息区中的钢琴旁弹奏一些较为简单的乐曲。目前主动试图与该实体交流的一切尝试均告失败，但该实体偶尔会选择与流浪者主动交谈，以下为一次与该实体的交流报告
//
//收起报告
//[音频开始]
//
//记录员A：呃，咳咳，嗯，呃，你好，小姑…（记录员B推了A一下）呃，美丽的小姐，请问我该如何称呼您？
//
//[没有回应]
//
//记录员A：呃，我想…
//
//镜：你可以叫我镜，我是这里的主人。
//
//记录员A：镜小姐，你是指，这个层级是你的？
//
//镜：（对着记录员B）大哥哥，你要死了。
//
//记录员B：你说什么？
//
//(镜走到书架前，取下一本书)
//
//镜：拿好哦，这是《绿野仙踪》，随身带着最好。
//
//记录员B：呃，谢谢…?
//
//[音频结束]
//之后镜未对其他问题作出回应，记录员B在两个星期后一次与U.E.C.的交火中被子弹击中，但子弹打在了胸前的《绿野仙踪》上，使他免于死亡。
//
//基地、前哨与社区
//由于过多组织已于该层级中建立了基地，仅列举其中少数
//
//M.E.G."童话镇"基地
//该基地共有628人常驻
//正在建立更大的流浪者保护据点
//帕拉斯研究所“LC-5-17”基地
//该基地约有三百人常驻
//研究音乐治疗心理疾病的方式
//可能与“镜”有合作关系
//入口与出口
//入口
//在Level 11中找到一栋外表由镜子组成的房子后可以进入该层级。
//在Level C-516中找到童话书可以切入该层级。
//在Level 18中可以找到通往该层级的门。
//出口
//找到那些无实际内容但是具有编号的书籍可以到达相应的层级，但是未发现过生存难度3以上层级对应的书籍。
//作者信息
//« Level C-516 | Level C-517 | Level C-518 »
//
//脚注
//1. 该建筑内每个区域似乎都位于单独的空间，此为各个区域面积的总和
package lvls15x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1517{}