//Level C-500
//评分: 
//+24
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//Level C-500是后室C层群的第500层。
//
//描述：
//ZQKQMt.jpg
//Level C-500的主体环境（凌晨）
//
//Level C-500是一片无边际的居住区。楼房由混凝土、螺纹钢与砖石等砌筑而成，风格均呈现为白漆外墙的多层住宅样式。楼房通常会占据所处区域约70%的占地面积，成井字排列并不断重复直至远方。不同楼房的老化程度不一，以区域渐变的方式呈现。但由于渐变幅度并不明显，这使得流浪者往往很难立刻察觉。
//目前，流浪者遇到绝大部分的楼房并无老化迹象；小部分其电线和水管会出现老化现象，楼房内部也将弥漫有不同程度的陈旧、腐朽气味；极少数楼房则展现为严重老化，甚至垮塌为废墟的状况。有复数报告称，少数废墟下正在一砖一瓦地“生长”出新的楼房。按目前的“生长”速度估算，其完成所有“生长”进程预计将耗时30年以上。
//
//楼房之间铺设了草皮绿化带与沥青混凝土铺面道路。绿化带常年自发湿润且从未见其枯萎，当流浪者靠近时会感到其四周空气异常潮湿，踩在上面会有浓烈的绿叶挥发物味道散出1。道路整体呈网状结构随楼房延伸至整片层级，其两侧的红色塑料材质中国结路灯会在夜晚PM5:30时亮起，并于PM10:00时熄灭。
//偶尔楼房间的空地会出现若干无法启动且不显活性的车兽（疑似）。因其从未表现出活性状态，以至于“其是否真为车兽”一事M.E.G. 部门内部至今未能得出一致结论。
//
//楼房内走廊高约2.5米，地面铺米色方形瓷砖，墙角下深色踢脚线，两侧为亮白漆墙面，一侧排列有白色塑钢横拉方窗，另一侧为若干褐色防盗门。居住区的楼房是可居住的。当流浪者在门前产生想要入住的想法时，铜制钥匙便会坠落2在其口袋中或附近。
//入住房间后，当流浪者路过其他房门时则会受到“此处有人居住”的心理暗示。由于这是一种作用于人类底层认知的暗示影响，流浪者很难立刻发现，但其可通过推理与思考被察觉。被影响者会更倾向于相信此处是有人居住的，或同学或同事，在日常中经常见面且彼此熟识。当被要求讲述关于对方的相关内容时，其通常被描述为“虽然都很面熟，但却又格外的陌生”。但事实上那里根本就没有人，谁也不在那里。
//
//ZQgPqg.jpg
//渐变中的四角标记。
//
//层级中多数房间内配有收音机与电脑。方形金属老式收音机由1号电池供电，可接收纯音乐电台及播报前厅全球性事件的新闻。电脑则多为白色款老式台式机，其性能远超其外观型号，甚至与一些前厅新款家用机相当。一款名为《穿越后室》的Rougelike单机冒险游戏被预装在台式机上面。有传言称其中内容对后室中现实事件具有预见性，但因其所谓的“对应”多为过度解读而被判定为阴谋论。
//房间内大多配备齐全，但大多数物品都于四角处被做了标记。标记相溶于载体表面，当物品位于四角标记内时其颜色为亮黄色，而物品被拿走时其将渐变为深蓝。若凌晨零点时选定住所内仍有标记为深蓝，则可能会影响流浪者次日物资的获取3。
//
//层级中存在与前厅相似的昼夜更替及季节变化，拥有较为稳定的电力供应及信号良好的Wi-Fi，以及能定期获取特定数量4物资的方式。但遗憾的是，由于层级具备的特殊性质，绝大部分区域并不适合设立据点。
//切入Level C-500的人都会被 独自 分配于一片居住区中，因层级空间过于广阔，单纯的穿越层级与其他流浪者相遇的概率无限趋近于零。经验证，任何复数流浪者于居住区会合的计划均以失败告终。
//
//
//每日倚靠遥远的国家大事、游戏与短视频来刻意消磨 “无事” 的时光，渐渐习惯一人的生活，静态的独处。直至遇到一个契机、或永远如此下去，沉溺于麻木的生活中，慢慢侵泡、腐烂。
//
//
//关于物资：
//ZQgZw9.jpg
//青绿色铁皮柜。
//
//物资会在Level C-500无边际的空间中随机散布，其中杏仁水与罐装龙肉居多。它们通常不会被四角标记，但与Level 1中不同的是，层级中的物资并不会随机出现（或消失）。其被收集后区域内便不会再出现新的物资，除非新的楼房开始“生长”。少量物资会随建筑进度逐渐出现，直到达到一个未知的数目后停止，目前物资出现的原理未知。
//除了搜刮外，每隔一定楼房间隔便可找到小块空地，此处摆放着若干“铁皮柜”。其为青绿色铁质薄板组装而成，内部有塑料管道与地下相连，其正面右侧有方形玻璃按钮，需每天早晚各按一次5才能使其持续二十四小时的正常运转。当流浪者于AM8：00至PM5：30的时间段内保持清醒时，最近的“铁皮柜”便会于次日凌晨在柜内产出少量物资。据研究推测，其原理是从层级各处收集物资，并通过管道运送至柜内的。
//物资主要以食物和饮用水为主，医疗或其他品类的资源则严重缺失。其可提供流浪者一天的消耗外还会有约1/4天份量的剩余，但若未能在时间段内保持清醒或住所内四角标记于凌晨时仍为深蓝，则次日柜内产出的物资会相应减少直至消失。
//柜门上时常会出现复杂度低、繁琐且无趣的谜题6。解开谜题的次日柜子内物资的摆放会变得更加规整，否则其布置会凌乱异常。
//有时“铁皮柜”内会额外多出一些电子产品等远高于每日产出物资价值的物品，其可被拿取并正常使用，但这会导致之后相应天数的物资缺失。据报告称，少数区域每隔半年会有疑似无面灵的飘忽的人影于凌晨三五成群来窃走物资，并会导致持续三天的物资缺失。
//
//以及，切勿将自己关进柜中并关上门，切记。
//
//
//
//有传闻称，层级能感受到人们内心的呐喊与挣扎，它们能听见，它们是活的。
//
//
//层级Level C-500的空间貌似会受到特定认知的影响。当层级中的流浪者对居住区中的生活方式感到厌倦，向往新的生活并决定为此做出改变时，穿越层级会更容易切出或到达Level C-500的特殊区域——“村落”。
//
//村落：
//ZpjEP0.jpg
//“村落”
//
//“村落”是层级Level C-500中的一片特殊区域。该区域内无四角标记及层级心理暗示影响，且具备与层级各地间点 对多点连接的特性。当流浪者产生“对新生活充满向往”或“决心做出改变”等认知时，其四周的反欧几里得空间指数将产生波动，此时空间将发生坍缩，流浪者穿越层级时将更有可能到达“村落”。该变化多展现为仪器探测结论中，由于空间过于广阔，流浪者通常不会对此有所察觉。该效应与流浪者的认知系数正相关，且这种空间促进的变化一般为单向，很难逆向追溯。正因如此，若流浪者在穿越途中折返，回到其原出发地的可能性微乎其微。
//
//该区域内方形结构事物大幅减少,楼房多为前厅村庄常见的二层住宅，风格与样式多种多样。每栋建筑正门前均配有围墙小院及田地。该区域少部分为水泥铺路、大部分为石路及土路，老旧的电线供应此处的电力，毫无路灯的街道到了夜晚可视范围极低，这使得M.E.G.不得不在夜间安置照明系统以达到照明效果。当有流浪者夜晚穿过门前的小院时，偶尔会有类似“狗吠”或“婴儿啼哭”的幻听声音于脑内产生，这均属正常现象。
//该区域土地因其土质肥沃且地下管道稀少，从而得以能够种植多种农作物。秋葵与丝瓜是这里最常见的作物，成片的小麦与玉米每年也都有相当可观的收成。“村落”中心偏右有一处大型池塘，一条石桥道路从池塘上方盘过，一朵红漆木亭屹立在池塘中央。到季时泛绿的池水中荷叶上方会开满荷花，经验证其中的作物可以食用，但池水不可直饮。
//
//“村落”资源获取机制与其它区域相同，且该区域内已知共有五个区域有铁皮柜资源点。一处区域已在2021年⑨号事件中被摧毁，目前两处区域由M.E.G.管辖，一处由后室家居生产厂管辖，一处由不结盟贸易集团管辖。
//
//基地，前哨和社区
//M.E.G.(探险者总署) Square基地：
//这里是被作为居住用地、仓库及稳定资源来源的一处大型基地。
//向层级中M.E.G.各前哨输送必要的资源与人力帮助。
//为各大友好团体与个人提供临时居所。
//该基地开放对外交易。
//每日巡逻，与B.F.P.F.一同负责“村落”内的秩序与安保。
//B.F.P.F. (后室家居生产厂) 方正资源采集站/方正庇护所：
//该采集站为后室家具生产厂众多站点中较大的一个，采集资源运输至层级中各哨所。
//一个稳定的庇护所，向友好阵营提供帮助和临时住所。
//开放对外贸易及人道医疗救助。
//每日巡逻，与M.E.G.一同负责“村落”区域内的秩序与安保。
//B.N.T.G. (不结盟贸易集团) C-500号资源提取站：
//该站点为B.N.T.G.在C层群中较大的一处聚集地，同时也作为储存仓库及分配所使用。
//开放对外贸易且免收65%手续费。
//以“合理”的价格提供基础设施完整的临时住所，当其他团体临时住所爆满时。
//提供订单，雇佣兵及刺客服务。
//为B.F.P.F.及M.E.G.巡逻人员提供必要的武器及设备协助。
//入口和出口
//入口
//在楼房林立的层级中穿越时切出可能来到该层级。
//在Level C-1中切出时，可能来到该层级。
//处于新工作的适应期7内时切出，时可能来到该层级。
//出口
//当流浪者渴望向往新的生活并决定为此做出改变时，穿越层级则可能切出至邻近层级。
//相应场景中切出，可能会到达与之场景相关的层级：如村庄，居民区，废墟或池塘。
//全收集通关《穿越后室》有可能切出至游戏中的某个层级，并在一定时间后会以梦醒的形式回到该层级的电脑前。
//作者信息
//« Level C-499 |Level C-500 | Level C-501 »
//
//Footnotes
//1. 俗称割草味道，通常由受损叶片释放。
//2. 有重物落袋的触感
//3. 详情见下文。
//4. 详情见下文
//5. 以日落为界
//6. 如将百余个相同形状/边数的图形分类，或将百余个不同规格/颜色的数字按相同规格求和并重新排列成表等
//7. 一般为半年至一年
package lvls15x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1500{}