//Level C-598
//评分: 
//+28
//+
//–
//X
//等级5
//
//
//安全性：不安全
//
//
//环境：环境天然陷阱
//
//
//实体数量：少
//
//
//
//tsdm_0010_fo.png
// 
//tn.png
// 
//tsdm_0000_td.png
//
//
//Level C-598是后室C层群的第598层。是由玻璃构成的大规模脆弱类地洞结构。
//
//Crystal%20Cave.jpeg
//一张摄于Level C-598内已探勘区域的照片，该区域的玻璃拥有大量白色杂质,尽管整个层级内拥有许多更美的区域，但危险度更高。
//
//描述
//Level C-598是由一片宽度和深度都完全无法测量的玻璃，所构成的高复杂环境。该层级内大多数的玻璃主要成分与常见的玻璃成分相同，但这不代表该层级如同玻璃般通透清澈。各种不同成分的玻璃在这个层级内彼此交织，造成了光线的频繁折射，进入此处的流浪者们也无法依靠视觉来获得下一步玻璃的厚度来判断是否安全。
//
//此外该层级内没有一个明确的昼夜变化，该层级的光源方位不稳定，经常会出现瞬时大幅度位移的情况。不断变化的光源位置与亮度，总是妨碍流浪者们，并摧残其视觉。而让流浪者们掉入深渊，或是踩破玻璃，坠落后被玻璃地刺刺穿，或无补给而死。
//
//而空气中的二氧化硅粉尘，则是不断的伤害着流浪者的呼吸系统，没有做好防护装备的流浪者们，在离开该层级后，其呼吸系统往往已经吸入了足以造成粉尘病的粉尘量。
//
//大多数时候微光向导，总一直在该层级内频繁出现。但这个层级的特有实体：光灵，这种与微光向导相似的实体，总是在欺瞒着在遥远地区的流浪者接近，导致他们落入更糟的境地。光灵有着类似于微光向导的外观，但这不代表它们会跟微光向导一样，会指引流浪者脱离危险，以及引导通往其他层的道路。它们只会在流浪者接近后，突然爆发出巨大的闪光，让流浪者的双眼失明。
//
//而使节与其仆从，它们也频繁的在该层活动，仆从的身体特性导致他们不会受到粉尘，甚至环境中混乱的环境光影响。许多流浪者在进入此层级后，下次被目击时往往已经成为了仆从。而M.E.G.与B.F.P.F.曾经尝试在此层级部署大量的流浪者信标，但由于使节跟仆从的破坏而失败。
//
//而该层级另有一个特殊点：远高于其他层级的层级密钥生成量。这导致在C层群中，该层级的层级密钥是C层群层级定位系统的重要一环。
//
//要脱离该层级也并不是十分困难，这该层级中寻找并非玻璃的自然生成物。例如：水体，切入其中会到达Level C-19的镜泊。更多出入口详见出口与入口。
//
//基地、前哨与社区
//使节与仆从群
//它们盘踞在通往Level 11.3的某个出入口附近。
//会抓捕流浪者让他们成为仆从的一员。
//数量不明。
//入口与出口
//入口
//藉由Level C-19的镜泊进入此层级。
//藉由Level 11.3内类似玻璃金字塔之建筑进入此层级。1
//藉由镜屋的某个镜子进入此层级。
//在Level C-63的废弃海盗船内切入此层级。
//更多入口尚待探索
//出口
//藉由层级内的水体，进入Level C-19的镜泊
//藉由层级内闪烁着红光的建筑到达Level 11.3
//藉由层级内生成的镜子进入镜屋、Level C-78。
//藉由层级内的废弃海盗船可以进入Level C-63。
//更多出口尚待探索
//欢迎来到M.E.O.D.档案库
//我们欢迎更多流浪者提交更多该层级的出入口
//
//smolmeod.png
//M.E.O.D.
//作为人们的代表
//作者信息
//« Level C-597 | Level C-598 | Level C-599 »
//
//脚注
//1. 注：这是由代号为"徐霞客游记"的失落的大厅协会的成员提供，他提供了大量关于各个层级的正确数据(包括，不限于：资源、出入口、出没实体。)，因此M.E.O.D.将这个出入口加上
package lvls15x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1598{}