//Level C-504
//评分: 
//+14
//+
//–
//X
// 
//
//生存难度：
//等级 变化
//
//变化的安全性
//稳定
//变化的环境
//Level C-504是后室C层群的第504层。由于其内部有大量的金属矿藏，所以该层级是后室C层群较为重要的工业基地。
//
//描述
//%E6%88%88%E5%A3%81
//Level C-504的戈壁照片
//
//Level C-504由无垠的戈壁与工矿区组成。戈壁中分布着该层级特有的铁砂山，戈壁含有大量的金属矿藏，以及一条时令河。工矿区由大量的重工业工厂及居民区与矿厂组成。工矿区边缘矿厂会延伸出一些走廊，以便去戈壁区开采矿藏。由于该层级不同季节下的不同气候，分为以下三段季节描述
//
//灼热季
//- 收起生存难度
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//灼热季为该层级的三月至六月，Level C-504在灼热季中气温会非常炎热，在该季节Level C-504将会持续无风状态，既整个季节仅会生成零级风1。湿度极低，该层级没有任何野生植物与动物，极度缺水。
//
//实体仅会在这一时期出现，出现的实体只有窃皮者，他们会伪装成工矿区的工人，识别它们的最好方法就是询问他们的编号。
//
//戈壁区
//戈壁地区在灼热季时期非常炎热，戈壁的气温在白昼中为29℃~51℃，夜晚时为21℃~34℃。该时间段中铁砂山的状况较为稳定，可供流浪者开采。戈壁地区的资源在该时期将会被大量开采，包括金属与非金属矿产。时令河已知河道长约4000㎞以上，暂时未知水源，时令河在这一时期是完全干枯的，河床底下有大量的珍贵非金属矿藏可供开采。
//
//%E7%9F%BF%E5%9C%BA%E6%9C%BA%E5%99%A8
//工矿区的矿机
//
//工矿区
//工矿地区的气温较戈壁要低，白昼气温为25℃~49℃之间，夜晚气温为10℃~28℃。在该季节会有大量的从其他层级赶来的流浪者进行采矿作业。该区域是Level C-504唯一存在社区与永久基地的地区，均为流动人口。该区域存在WI-FI，强度从2到4不等。该区域在本季会生产大量的金属制品与工业原料，是后室C层群较为重要的重工业生产基地。
//
//阴暗季
//- 收起生存难度
// 
//
//生存难度：
//等级 3
//
// 
//稳定
//环境危害
//阴暗季为该层级的七月至十月。Level C-504在该时期天空亮度将会大幅度降低，同时温度也会降低。该时期Level C-504将会有1级至8级的风出现。湿度相对灼热季提升，达到了45%。
//戈壁区
//戈壁地区在阴暗季时期温度较低，戈壁的气温在白昼中为3℃~20℃，夜晚时为-9℃~12℃。在这一时期，铁砂山上的铁砂有可能会被该地区的风力大于7的风吹动，形成小范围的砂尘暴，砂尘暴的威力极大，若观测到该区域7级以上的风出现，请立刻躲入附近的矿洞中，并且紧闭大门。在这一时期，矿厂将停止对戈壁地区的资源开采。时令河在该时期处于满水状态，河水为杏仁水与乙醇以20比3混合形成。河水不能直接饮用，其内部含有大量的金属微粒，过滤后一般作为酒精饮料出售。
//
//工矿区
//%E9%98%B4%E6%9A%97%E5%AD%A3%E5%B7%A5%E7%9F%BF%E5%8C%BA
//阴暗季的工矿区
//
//这一时期戈壁与工矿区的气温一致。在该季节工厂将会加速进行赶工，并且要在九月底前将全部员工与设备移出该层级。矿厂将会关闭所有延伸出的走廊，并且停止对戈壁的采矿，以免发生人员伤亡。工矿区的大部分社区基地将在十月关闭，社区内部的居民将按工作重要性依次撤离。M.E.G.前哨内的成员为最后离开这里的小队，小队在离开前要检查并带走该层级中剩余的流浪者，离开时间为10月18日。
//
//雪花季
//- 收起生存难度
// 
//
//生存难度：
// 
// 
//严重的环境危害
//雪花季持续时间为该层级的十一月至次年二月。Level C-504在该时期将会有巨大的砂尘暴袭击整个层级。
//该时期资料缺乏，仅有的资料为2020年11月一位M.E.G.探员在消失前留下的最后一份报告，如下
//
//- 收起
//时间：2020年10月17日
//天气：持续的阴暗
//现象记录：风力等级4-5级，整个工矿区与可观测到的戈壁都没发生砂尘暴。
//备注：执行任务的第一天
//任务：调查该层级的异常砂尘暴现象。
//
//时间：2020年11月4日
//天气：黑暗
//现象记录：风力等级6-7级，戈壁的砂尘暴发生次数更加频繁，但均为小型砂尘暴
//备注：附近的一处炼铁厂遭到砂尘暴袭击，工厂大部分地区遭到严重的破坏。时令河开始干枯。
//
//时间：2020年11月11日
//天气：极度的黑暗
//现象记录：风力等级8-10级，发生了中型的砂尘暴袭击事件。
//备注：我可能回不去了 砂尘暴袭击了大部分的工矿区，造成整个区域的严重破坏。先后有八家工厂，四十二栋居民楼遭到了砂尘暴袭击，均损毁严重。时令河完全干枯并充满生锈的铁砂。
//
//%E7%A0%82%E5%B0%98%E6%9A%B4
//M.E.G.探员最后拍摄的砂尘暴
//
//时间：2020年11月20日
//天气：极度的黑暗
//现象记录：风力测量仪被摧毁，风力等级估计为13至14级。一股巨大的砂尘暴从工矿区最西面向东推进，砂尘暴几乎笼罩了整个西面
//备注：任务完成，这可能是我最后一次的记录了，当你们发现这个记录的时候，就是沙尘暴结束的时候。帮忙把这份报告旁的日记交给——
//
//该份报告到这里截止
//
//该份报告发现于M.E.G.前哨地下室的嵌入式保险柜内，至于该探员遗体至今仍未能找到…
//
//- 收起
//
//雪花季似乎是该层级进行自我修复的特殊时期，现象表现为在之前两个季节被开采或破坏过的矿物将会被修复，但是修复后矿物种类随机。被砂尘暴摧毁的建筑会在巨大砂尘暴停下时，以未知的方式恢复原样2，但散落在地上的铁砂并不会消失。
//雪花季还会在该层级的戈壁地区生成一定数量的铁砂山。为了该层级环境平衡，M.E.G.将会炸毁新增的铁砂山。
//
//特殊地貌与现象
//特殊地貌-铁砂山
//%E9%93%81%E7%A0%82%E5%B1%B1
//Level C-502的铁砂山
//
//铁砂山通常高200m-1000m，长宽度通常为150m-450m。铁砂山通常零散分布于戈壁，有流浪者报告称在工矿区以西620公里处，有着大面积的的铁砂山群，该报告现无法证实。山体分为内外两部分，外层由细碎的铁砂组成，内部为铁矿石组成。当山体表面的铁砂被开采或被风吹走，铁砂山将会以超自然方式自行生产铁砂，并且不会消耗内部铁矿石质量。已知唯一可以摧毁铁砂山的方法为：将它的内层炸毁或凿毁3。
//
//铁砂山表面的铁砂被证明为含铁量大于98%的优质的磁铁矿，但是其硬度远远高于普通磁铁矿，摩斯硬度达到8.6。内部的铁矿石经检验为普通的赤铁矿，但该种赤铁矿的硬度也极大，摩斯硬度达到了9.2。不过，两种铁矿物除硬度高于一般的铁矿，其他各项指标正常的均相同。
//
//特殊现象-砂尘暴
//砂尘暴指Level C-504中强大且持续的风力导致铁砂山上的铁砂松动并加入风中，从而形成的风暴。由于铁砂山独特的性质，砂尘暴持续的时间取决于它的风力大小，风力小于12级的吸取一定量铁砂之后将会停下。风力大于12级将会大量吸取铁砂，并且持续很久。根据探员留下来的报告，最大的砂尘暴风力等级为16级，将会持续四个月，直到暴风再无法带动如此多的铁砂为止。
//
//砂尘暴的威力主要在于风暴中的铁砂，由于其极高的硬度，袭击建筑时犹如子弹般归来，将以极快的速度摧毁风暴范围内的建筑。根据探员的记录，一栋由钢筋混凝土构建的三层楼房，在三分钟之内被中型砂尘暴完全摧毁。并且砂尘暴由于该层级的特性，已知砂尘暴停下唯一的方法为自身累积的铁砂过多，暴风无法承载为止4。根据猜想，大型砂尘暴停下来时应会生成新的铁砂山。
//
//变种-锈砂尘暴
//锈砂尘暴为阴暗季的沙尘暴特殊变种，该种砂尘暴是由于时令河内部河水的氧化作用形成。
//形成条件：砂尘暴在河边形成将河水与铁砂一起吸入，在砂尘暴旋转的过程中，内部的铁砂将会迅速被氧化，并且会分化成更小的氧化铁粉，形成锈砂尘暴。该种砂尘暴对于人的伤害极大，被袭击的人容易造成破伤风，并且由于河水内含有乙醇，受害者的疼痛将加剧，但也提供一定的消毒作用。
//
//基地、前哨与社区
//金属冶炼社区
//居民均为该地区金属冶炼厂职工
//灼热季约有5000人居住，阴暗季约有2800人居住
//拥有基础社会设施
//加入社区需成为金属冶炼厂职工
//采矿业社区
//居民均为该地区采矿矿工
//灼热季约有4300人居住，阴暗季约有270人居住
//拥有基础社会设施
//加入社区需成为采矿矿工
//B.N.T.G“有色金属”基地
//开放贸易，一般只出售与该层级有关的物品
//常住人员约有40人
//是该层级最大的出口贸易基地
//接受高额订单
//金属中转站位于该基地内
//M.E.G.“矿物研究中心”基地
//基地用于研究该层级地理及矿物性质
//常驻研究人员为38人
//出售一些稀有的地质产品
//在整个层级之中拥有多个临时基地
//B.F.P.F“百货超市”基地
//开放贸易，出售从其他层级购进的日常用品与食物
//超市员工约60人
//该层级最主要的生活用品采购基地
//M.E.G.铁砂前哨站
//友好且开放贸易，乐于帮助误入该层级的流浪者离开
//约有20人常驻
//提供该层级的砂尘暴预警与天气预报
//在十月中旬会检查并带走所有位于本层级的流浪者
//入口与出口
//入口
//在Level C-20进入洞壁上布满铁矿的洞穴，向铁矿最多的地方进行切入，大概率到达Level C-504
//在Level C-28向东南方向前进100公里到达名为金属中转站的大型厂房中，进入即可到达Level C-5045
//在Level-11进入一家废弃的钢铁厂，有小概率到达Level C-504
//在Level C-216有极小的概率找到一个铁矿采集处，进入即可到达Level C-504
//出口
//在戈壁中因为中暑而昏迷，若在两小时内无人救助，将会到达Level C-64
//进入名为金属中转站的大型厂房中，即可到达Level C-28
//在戈壁中有小概率出现覆盖着焦油的风蚀蘑菇，向内切入大概率到达Level C-283
//作者信息
//« Level C-503 | Level C-504 | Level C-505 »
//
//Footnotes
//1. 风速每小时小于一公里的风称为零级风
//2. 仅限于建筑物本身以及镶入墙内的设施，不包括内部的家具与机器
//3. 仅限于雪花季新生成的铁砂山，新生成的铁砂山内层硬度仅有5.5，硬度随时间增加而增加。
//4. 目前没有发现任何可以阻挡砂尘暴的人造建筑
//5. 在雪花季将会封锁该出入口
package lvls15x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1504{}