//Level 240
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//7528408214_9555491ff7_b.jpg
//树林，从湖中的角度拍摄。
//
//Level 240是后室的第241层。
//
//描述
//Level 240，也称洛特卡湖，是一片被迷雾树林围绕的湖泊。该层级并没有明确的界限，越是深入森林，雾气就会变得越重。在湖泊的中央，存在着一个小巧的、略高于水面的石台。石台上雕刻着不同的符号，据推测应都表示“孩子”或“夜晚”。湖泊下有着许多睡莲，距离湖面仅有一英尺（约30cm）。湖底是粘土和沙砾的混合物，访客有时可以在其上看到稀有的玻璃蛙。
//
//在某些区域，湖的深度会大到不可见的地步，但是据推测湖底的材质应与其他部分相同。而在湖底之下，则栖息着Entity 114，或用它对自己的称呼，洛特卡。Entity 114似乎对整个层级都拥有着掌控权，可以随意创造食物、树木、并重塑整片土地的形状。同时，Entity 114也使得Level 240内有了抗衰老效果，据信为除树林深处那个巨大的污水坑以外Entity 114的另一创举。因此，大部分人相信是Entity 114创造了Level 240，或者，它至少参与了这一过程。
//
//479866252_9feeff13c0_b.jpg
//树林内的一张照片，拍摄了一棵高约45英尺的树。
//
//基地、前哨和社区
//洛特卡的子孙们
//他们是一群生活在Level 240内的孩子。他们在湖泊周围建造了树屋，并将Entity 114视为亲近的同伴。除去他们的“组织名”以外，这些孩子和Entity 114没有任何联系，无论是从血缘上还是从精神上。
//他们的“首领”是卡米拉·诺斯克特，一位来自英格兰的家庭女教师，1797年掉入后室，传言是第一位进入Level 240的人。她负责教授所有其他的孩子，并且是整个Level 240内第二年长的人，17岁，已经是能够进入者的上限了。年龄最大的人是一个名叫伊利亚·“酒桶”·米勒的男孩，同样是17岁，但是比诺斯克特年长数月。他和他的弟弟艾利·“小桶”·米勒都是2023年进入的，负责为诺斯克特打下手。
//2.jpg
//一幅由M.E.G.专员提交的图画，他8岁时曾在Level 240暂住过一段时间。
//
//入口与出口
//入口
//Level 240可通过一扇绘有儿童画的白色大门进入。一旦有超过18岁的人触碰到门，门把手就会自动消失。这样的门可在大部分存在墙壁的层级内找到，但是根据报告，在性质上偏向“孩子”的层级或地区，入口出现的几率会更大，例如Level 33内的一家玩具店。同样地，在Level 52、Level 117与Level 283都可以找到大量这样的白色大门。
//
//出口
//孩子可以自由地出入Level 240，只要找到门就行。想要离开，他们只需要告诉Entity 114，后者将会为他们创造一扇离开的门。这扇门将通往这名孩子进来时的层级。
package lvls2x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl240{}