//Level 254
// 
//
//生存难度：
//等级 Rho
//
//不安全
//不稳定
//心智危害
//Level 254是后室的第255层。到目前为止，关于该层级的信息只有一个来源（详见M.E.G.采访记录7359）；这就造成了该层级的信息很有可能是不完整的，真实性也有待进一步的证实。
//
//描述：
//Level 254是一片空旷的，纯蓝色的空间。在这个层级里，没有任何的建筑，也没有任何的地理特征，更没有任何的实体。Level 254会对进入它的人产生心理上的影响，使得人们无论如何都想要呆在这个层级里，即使离开这里，这个想法也不会消散。除了一个事例（详见M.E.G.采访记录7359）之外，没有人在进入Level 254之后能够离开。因此不建议对Level 254进行探索。
//
//基地、前哨和社区：
//冥想圈
//冥想圈是一个被层级影响心智的流浪者所组成的组织，他们从始至终都只会坐在Level 254的地上。由于层级的特性，所有流浪者在进入这里之后都会加入这个组织。
//
//入口与出口：
//入口
//切入到Level -1的墙里就能到达Level 254。
//
//出口
//切出Level 254的地面就能把你带到Level 11。
//
//补充文件：
//M.E.G.采访记录7350
//采访者： Solomon Myers
//被采访者： Elise Beck （身份未确认）
//前言： 在Beta基地附近，有一个身份未知的人切出了一堵墙。在被拘留时，她声称自己叫Elise Beck，是M.E.G.追踪探测小队“Elise”的队长。“Elise”小队的最后一次记录是在2年之前。
//
//<采访开始>
//
//采访者： 请在记录中说一遍你的姓名。
//
//Beck： 我已经告诉过你了。拜托，我非常需要回去。
//
//采访者： 为了记录，请再说一遍。
//
//Beck： Elise，Elise Beck。Elise小队的队长。属于追踪探测小队。我现在可以走了吗？
//
//采访者： 回答了我们的问题之后，我们就会放了你。
//
//Beck： 好吧。
//
//采访者： 你说你“需要回去”。你到底要去哪里？
//
//Beck： 蓝色虚空。它是在我们在切出-1时找到的。
//
//采访者： 蓝色虚空到底是什么？
//
//Beck： 在没有亲眼看见之前你是不会明白的。那是你从未见过的最美丽的蓝色。一切都是这种颜色。它是如此的宁静，我在那里可以无比地放松。
//
//采访者： Elise小队的其他成员在哪里？
//
//Beck： 他们也在那里。沐浴在荣耀之中。当然了，我现在因为切出了地面而结束了。我猜，上帝以一种神秘的方式运作，但只要你能够让我回去——
//
//采访者： 下一个问题。你为什么要回到你所说的“蓝色的虚空”？
//
//Beck： 我已经告诉过你了，你没去过你就不会理解。那是一个极度和平的地方。那里没有任何烦恼。外面的世界并不重要。在那里一切都是蓝色的。
//
//采访者： 你有看到过其他的M.E.G成员吗？“Tung”小队在几个月前在-1失踪了。
//
//Beck： 几个月前？那他们估计已经死了。当你除了自带的干粮以外什么都没得吃没得喝的时候，每个人最终都会屈服。但这是值得的——以生命交换这些经历是值得的。当你死去的时候，你将会成为虚空的一部分。
//
//<采访结束>
package lvls2x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl254{}