//Level 202
// 
//
//生存难度：
//等级 3
//
// 
//严重环境危害
//少量敌对实体medium.jpg
//该层级的一条走廊，可以看到墙上的字迹。
//
//描述
//Level 202，或称粉笔长廊，内部是一堵堵黑板形成的墙壁，墙壁构成了一座可能无限大的迷宫。其主要结构为走廊，约3米宽（合约10英尺），无大型房间存在。该层级整体被浓雾笼罩，能见度仅有约10至15米（合约30至50英尺）。空气中的粉笔灰可能会造成窒息，因此建议携带口罩。站在该层级中仰头看时，只能看到墙壁延伸并消失在黑暗中。未知层级上方是天花板还是天空，至今还未找到墙壁的尽头。
//
//Level 202的地面被白色粉笔的细灰所覆盖，粉笔灰底部材质未知。层级中，大部分区域的粉笔灰都被夯实，可支撑流浪者在其上行走；但有部分区域的粉笔灰极为细小松散，进入这些区域会立即陷入其中。如若不慎陷入松散的粉笔灰中，很容易最终因为窒息而死亡，因为周围总是缺少可供人攀附的物件。至今，未在该层级发现任何流浪者或实体的尸体。因此，建议流浪者时刻注意前方的灰尘是否可供行走，最好配备一支手杖或类似物品。
//
//黑板组成的墙壁上偶尔能发现古怪的文字或记号，其来源不详，且一般不认为是由被拆散的流浪者们（该层级的这一特性会在下文说明）书写。一般认为，书写者是潜伏在该层级雾中的人形生物（详见下文实体一项），但是这一设想未能被有效证实。也有可能这些文字和记号本身就是层级的一部分。
//
//隐藏
//在远处
//让我带路吧
//跟上我
//就在那里
//和我一起找它吧
//它不路上[原文如此]
//跟上
//去看
//各式各样的箭头。
//此外，与Level 0的特性相似的是，流浪者在该层级似乎无法与其它人类相遇。未知这一现象的原因是流浪者被送到了距彼此极远的地方，还是每个流浪者都会进入一个该层级的“副本”。即便流浪者们尝试集体进入该层级，也还是会在进入时立即同彼此分开。这一特性会使进入其中的流浪者长时间孤身一人，很容易引起孤立、分离的感受，对本就处在危险环境中的流浪者造成精神伤害。请牢记，只要找到出口，就能和其他人相见。
//
//实体
//有流浪者曾记录该层级存在干瘪而模糊的人形实体，但并无接近或与之互动的记录，实体相关信息也较少。因此，没有记录显示该层实体对流浪者进行了任何形式的攻击。这些实体似乎只会在远处观察流浪者，试图靠近的流浪者则称这些实体总是会转过拐角并消失。
//
//基地、前哨和社区
//由于流浪者们总是会被拆散，因此几乎无法在该层级建立基地、前哨和社区。除了这个原因，该层级潜在的危险和走廊狭小的空间也导致建立这些设施毫无意义。
//
//日志
//下文是该层级中原本被粉笔灰淹埋的一份日志。该日志引起了对该层级分离效应的讨论。其似乎属于Sky Rhodes，且根据日志内容，此人可能已经不幸遇难。
//
//关闭日志
//我以前还没写过日志，因为我一直没发现什么新东西。不过我现在好像进入了一个新层级，大概很适合记录一下吧。
//
//我不太确定我是怎么来到这里的了。当时我从Level 11走到了一个像是超大号学校的层级里。我在一个黑乎乎的教室里休息，就看到外面走廊里有张发光的脸——它是叫笑魇吗？我吓了一跳，退到了墙跟前，只听“砰”一声，我就跌进了这里。
//
//好了，这个层级……这里的墙很高，很黑，地板上全是厚实的白灰，空气里的雾也很浓。走路扬起来的灰搞得人不好呼吸。我走了一小会儿，周围的环境也不见有变化。
//
//我又走了一会儿，没发现什么有意思的东西。周围一直没什么变化。
//
//希望附近有出口。
//
//我现在已经待了好半天了——少说几个小时吧——刚刚看到远处有个奇怪的身影。看起来有点像人，但是它的身体像是干枯了，要崩裂开一样。它静静站了一会儿，我都要以为它是在看我了，结果它慢慢走进旁边一个拐角了。
//
//我看到那个实体之后已经过了两、三个小时了。我决定朝它大致走去的那个方向前进。刚刚，我看到墙上写了句话，“就在那里”。我不理解这是什么意思——这个地方深处还有什么吗？那个人影是谁，这是它写的吗？这个地方搞得人越来越困惑，不知道有没有答案……
//
//我在这里待了好久啊——至少几天吧，迷宫还是没到尽头。补给品真的很少，我的感知有点……变来变去。要是有人看见了我写的东西，千万别相信墙上的话。每次我跟着这些字的指示走，总会走到一个地上的灰特别疏松的地方，上面根本不能落脚。之前有次我的腿陷进去了，我赶紧跳了出来，之后走路都很小心。
//
//后室里有件很折磨人的事，很少有人提，那就是无聊。这里真的很空，没东西可以缓解压抑，一点儿有意思的事都没有。真不懂其他人是怎么应付这种——我都不知道是什么，我在这里写我的情绪也只会放大它，不过至少写写东西也好过什么都不做。真是要疯了。
//
//有人吗？我这么久都没见过一个活人了。好想找人说说话啊，好想有人救我出去啊。太孤单了、太渺小了、太无助了。送我出去吧。
//
//已经过了一两周了。我的物资都用光了。我已经三次差点掉进灰里了——我的腿上全是粉笔灰一样的东西。别到这里来。
//
//送我出去。送我出去。送我出去。
//
//太不对劲了。那些人影一直看我，一直不肯走开，我烦死它们了。这些墙好挤，好高。灰尘好可怕，一直被我吸进肺里呛我。地面这么不稳，我要自暴自弃陷进去了。都要消失了，都要崩解了，我也是。
//
//我在这里多久了？不重要了。我腿上的皮肤正在崩解。最后一切都会崩解吧。我出不去了。这又有什么呢？我已经不知道现在是怎么回事了。感觉有些不对劲，不过我还是得继续。我被困住了，好孤单好寂寞，这里真是个地狱。我真的迷失了。
//
//入口与出口
//入口
//一般来说，在其它带有黑板的层级（如Level 117和Level 321）中向着黑板切出，会导致从Level 202的墙壁中掉出。有趣的是，能作为该层级入口的黑板上常有被擦去一部分的文字和图画。虽然这一条件似乎不是必需的，但传闻从这种黑板进入的成功率更高。
//
//出口
//在极少的情况下，你会在墙壁上找到木框，它们几乎都被粉笔灰覆盖着。通过木框所围出的黑板切出，会使你随机出现在另一个有黑板的层级中。然而，由于木框上总覆盖着粉笔灰，进行切出会很危险。
//
//在该层级中，离开是首要任务。切记携带小型铲子等物品来帮助你挖掘寻找出口。使用木桩、绳索等物品保护自己在不慎陷入粉笔灰时不被掩埋。时刻注意周边是否有木框。
//
package lvls2x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl202{}