//Level 222
// 
//
//生存难度：
//等级 整体
//
//重要文档
//多重现实
//被记录在案的内容14820740243_1a8d761463_b.jpg
//欢迎！
//
//Level 222 是后室的第223个层级。该层级曾是一个画廊，现在被改造成了一个博物馆或图书馆。我是这个展馆的策展人与管理者。
//
//描述：
//想知道我是谁吗？我的名字是Leo Castellos。你可以去读关于我的文档，我将它编撰成了我的自传。不管怎样，这里是我的家与博物馆。我将这里改造成了我居住以及分享所有关于实体的知识与标本的地方。
//
//这个博物馆有三层，每一层都有一个中心区与四个相邻区域构成一个“X”形。一层用来展览我收集的所有标本以及关于实体的信息。二层用来存储我在这个现实学到的所有知识的档案。三层作为我居住的地方是关闭的。如前文所述，这里曾经是个美术馆，但我将这里清理干净并进行了这些改造。如果您仍然有兴趣欣赏画作，我将这些画作都收藏起来了。
//
//800px-Vertebrate_specimen_displays_at_UPLB_MNH.jpg
//一个展示柜。
//
//我有一个办公室，但老实说，那地方可乱透了。如果您在层级里找不到我，我大概就在这里。如果我在休息会在门外挂一个牌子。也许我该早一些提到这一点，但如果您想找我，请随时过来。您知道，这个展厅并不是为我一个人创造的。我只要求您不要在这里偷东西以及进入禁区。
//
//您可以找到大多数实体的信息。我将基本上有关于所有实体的信息存储在信息中尐……还是中心？这玩意怎么拼写？反正不管哪种方式，您都可以随意阅览我写下的关于实体的信息。如果您有什么新发现，请务必带给我，我很期待看到它们！
//
//4350629792_8b6d06a9f7_b.jpg
//我试图整理所有内容。
//
//我经常尝试获得实体的标本，但我不会因此杀死它们。如果我没有此实体的标本，原因通常是它仅存一个，我无法找到或者过于危险。我会尝试制作复制品，尽管我并不会雕刻。我也确实有它们的照片。
//
//我一直尽自己的最大努力来组织所有东西，但对几个世纪前的内容进行分类确实非常困难。如果不使用非正式短语会很难表现出幽默感，这篇文档的第一句话便是如此。如果您有什么疑惑，欢迎您来询问我。
//
//基地、前哨和社区：
//这里只有我。我有时会召开失落一族的会议，因为我是他们的一员。如果您可以，请来拜访我的时候带上些烤饼，尤其是樱桃蜂蜜味的。请记住我对狗过敏，所以请不要将它们带进来。
//
//我并不希望有其他人定居在这里，所以不要提出要求。清理整个层级让我十分痛苦而我也不想再做第二次。
//
//入口与出口
//入口：
//在Level 46，Level 11，Level 158，以及 Level 201找到并手持任何与美术馆有关的小册子即刻来到这里。您可以在其他层级找到这种小册子，但它们似乎只在以上层级中起作用。在Level 190找到并进入一扇写有“科学馆 202仓库”的门也可来到这里。
//
//出口：
//走进标有“EXIT”的门可以带您来到Level 198. 我并不建议您使用此出口，除非您想体验跳伞运动。通过自动门入口离开将带您到Level 302。
package lvls2x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl222{}