//Level 205
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//Level-205.jpg
//从Level 11观察到的Level 205。
//
//Level 205是后室的第206层，于████年██月██日被一群逃亡中的杰瑞的信众（F.O.J）发现。
//
//描述
//Level 205是一块面积约100平方公里的平原，看起来没有任何特殊之处。其边界为10米高的铁丝网围墙，翻过围墙即可抵达Level 10与Level 11。
//
//Level 205通常很少有实体出现（除了双尾狐）。然而，有部分实体可能会试图从Level 10与Level 11的铁丝网翻过来。
//
//Level 205内存在超过30件1950年之前留下的石化物品。下为Level 205中的部分物品。
//
//值得注意的被发现物品
//物体205-2：鹿头骨
//威胁等级：珀
//物体205-2是一个尺寸异常巨大的麋鹿头骨，其鹿角长26厘米。其风化程度可从多处看出：久经日晒的痕迹、严重褪色的表面、一只鹿角和部分下颚骨的缺失。这只鹿头骨应具有相当的灵智，因为它会对发现自己的人展露出敌意。在这只鹿头骨被最初发现时，它扑向了发现者，用自己的牙齿咬住了发现者的腿，像捕兽夹一样夹在其身上。
//
//物体205-7：（大约是）棘龙
//威胁等级：绿
//物体205-7是一具存活的石化棘龙骨骸，高约7米，长约13米。物体205-7有自主运动的能力（例如：其最快可以以52千米/小时的速度奔跑）。物体205-7性情温顺，只有在被激怒时才会表现出攻击性。物体205-7完全可以自行生存，而无需营养补给、搬运或是休息。
//
//物体205-13：战争化石
//威胁等级：黑
//物体205-13包括15辆石化的坦克，坠毁的飞机以及其内20世纪30年代风格的机器设备。物体205-13具有相当的智能，可以注意到它们周边的动静，智商（IQ）约为83。物体205-13之间会互相攻击，毁坏对方的机械架构，有时还会攻击人类、环境或是后室内的实体。
//
//物体205-13需要被收容在Level 205以内，以最小化它们对其他层级的破坏。如果物体205-13中的任何一个破坏了收容措施，那么在其开始对Level 10、Level 11及其他层级进行破坏之前就应当提前将之摧毁。
//
//物体205-24：模仿骨架
//威胁等级：绿
//物体205-24是一副具有灵智的人类骨架，其可以模仿任何生物的骨架结构。物体205-24高约243厘米，重约40千克。物体205-24可以依靠自己的意愿拆卸其所有的骨架，包括肋骨、头骨与脊柱。物体205-24与物体205-7类似，不需要营养补给或是休息。
//
//物体205-24对于Level 205内长久居住的事物通常表现地十分被动。对于那些初来到Level 205七日之内的访客，物体205-24同样表现温顺，但会在被激怒时发起攻击。
//
//其余物体尚未发现，或未被记录
//发现
//在20██年，6名F.O.J违反了他们实行的政策，并被从Level 2内的信众前哨站中流放。在经过10天四处兜转、试图寻找居所而未果的日子之后，他们最终来到了Level 11。其中的两名成员对Level 11边界上的铁丝网感到好奇，因此翻越进入了Level 205。
//
//基地、前哨与社区
//迄今为止，Level 205内尚没有任何的基地、前哨站或社区存在，仅居住着6名被流放的F.O.J前成员。B.N.T.G.中存在是否应在Level 205中开设前哨站的争论。
//
//入口和出口：
//入口
//Level 8
//从Level 8的天花板中切出（约三千分之一的概率）。
//Level 11、Level 10
//翻越铁丝网。
//Level 80
//离开高速路并走出50千米。
//出口
//Level 11、Level 10
//翻越铁丝网。
//一个派对=)
//将一个化石皮纳塔1摔碎。
//Footnotes
//1. 译注：一种节日玩具，用布或纸扎成盒子后用彩带装饰，参与者蒙上眼后将其击碎，通常会掉出糖果等物品。很多人认为该习俗起源于中国，由马可波罗传入欧洲，而西班牙在征服墨西哥后又保留了该习俗。时至今日，皮纳塔游戏已经成为了墨西哥的传统之一。
package lvls2x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl205{}