//Level 256
//欢迎，志愿者
//探险者总署移动终端 AE4
//找到 4 份与 ID isle4 相匹配的文件。是否查看？
//
//>Y_
//
//加载中…….
//
// 关闭文件
// 
//
//生存难度：
// 
// 
// 
//demo1.jpg
//DSC00913.JPG
//
//Level n 是后室的第 (n+1) 层级，其 [等我搞清楚发生什么之后我再来填这个部分]
//
//描述
//可恶，里面也太暗了，好像是某种科技演示中心？没有别的人在，我还没有找到出口。
//
//我感觉我之前已经到过这了。
//
//基地、前哨和社区
//基地 1
//细节符号1 1
//细节符号 2
//之后再填——不确定是否存在这种东西
//
//入口与出口
//入口
//我穿墙的时候就到了这里，所以我这么猜的切出 Level 4 就可以进入 Level n。这里没有其他人，还有入口没？
//
//出口
//一个都还没找到，继续找。
//
// 关闭文件
// 
//
//生存难度：
// 
// 
// 
//demo2.jpg
//Level 256 内的一个屏幕
//
//Level 256 是后室的第 257 个层级，表现为一个废弃的科技演示与展览中心。
//
//描述
//Level 256 完全处于室内；存在窗户，但是外部没有特征且黑暗。它表现出一贯的现代内部设计，其常见的设施是霓虹灯和艺术性固件。所有的门都是锁住的，我尝试把一堵墙踢倒，但是后面还有墙 .如果我不应该这样做的话,就忘掉这档事吧。
//
//Level 256 的房间里安装了各类终端，全部表现为知名游戏系列的品牌。显示的内容与其外观完全不相符，到目前为止记录到的程序有：
//
//微弱的静噪，这是最常见的显示内容；
//一份观看者的录像，以多种方式失真，包括颜色反转，红外线及有色轮廓。
//早期 3D 演示的低分辨率录像
//简单的交互式游戏，这些游戏一般模仿流行媒体，实际上乏味或反复，通常没有结局靠我的老天爷，那玩意儿把我吓坏了
//极响的失真电子音，伴随着屏幕空白黑屏。这里太暗了，就像外面一样
//基地、前哨和社区
//无。
//
//没有一个人在这，没有人回应。
//
//这些设备还在上传的吗？
//
//入口与出口
//入口
//切出 Level 4 即可进入 Level 256。我只是运气不好而已吗？
//
//出口
//肯定有出口之类的东西
//
//关闭文件
// 
//
//生存难度：
//等级 5
//
// 
// 
// 
//demo3.jpg
//太暗了
//
//Level 256 是后室的第 257 个层级，表现为一个废弃的科技演示与展览中心
//
//描述
//我给了这一层 5 级这样它就能升到数据库高一些的地方。如果有任何人能看到这些东西被上传上来，请跟我说话 我h要分类
//
//不，我必须冷静，这是一个安全的地方，我有水和食物，我很安全。这里一个人也没有，什么东西也没有，除了他娘的那些终端。它们自己启动了但是我看不到有任何东西在动，这里没有东西在动，没有什么东西移动过但是屏幕杀千刀地就
//
//抱歉把数据库搞得乱七八糟，我只是不知道还能做些什么。
//
//这里真的太他妈暗了，一切都太安静了，我呼吸的时候空气都不动一下。四处都有很大的窗户，每次我向外看去我他妈都有种无助的迷失感，我甚至都不知道是不是晚上，钟表没有响，然后我把视线从它们上移开 上面的时间就彻底变了 它们现在都显示 00:00 没有，它恢复正常了 。我连觉都没法睡，因为
//
//我不知道，可能只是我的原因
//
//天空他娘的把我吓坏了，我搞不清楚，太暗了，我不知道怎么描述这个东西它太暗了，这就好像是在盯着某些东西的 咽喉 脑袋 眼睛 ？？？？我不懂，感觉很沉重，就好像它在看着我，让我窒息。
//
//我
//
//我希望我不要疯了，拜托，如果你看到这份文件，删了然后给我发个消息咋样的我不管你快做就是
//
// 关闭文件
//demo4.png
//DSC00916.JPG
//
// 
// 
// 
//这不是天空
//
//由于意外的原因上传终止。再试一次吗？ [Y/N]
//
//>Y_
//
//错误：验证失败。用户 isle4 不存在
//
//作者
//译者
//« Level 255 | Level 256 | Level 257 »
//
//Footnotes
//1. 译注：原文为"Bullet"，根据语境选择了另一个意思，详见柯林斯词典释义
package lvls2x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl256{}