//Level 200
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//Main_Street_in_Herndon%2C_Pennsylvania.JPG
//过去有些日子了，不是么?
//
//Level 200是家园。
//
//它被发现在——啊，在这儿关心这个可无甚意义。它一直都在这里，即便你刚刚抵达。
//
//坐下吧，还有很多话要说呢。
//
//描述：
//Level 200是你遇见过的最棒的小镇。它不是很大，也确实不显眼。
//
//这里有人。如你我一般的人。大概有4000个吧。你终会认识他们全部的。认识他们之中的每一个人。他们都很好，好到可以忽略掉你双耳之中那灼烈燃烧的铁锈之味，或者是自天空缥缈洒下的皮肤皲裂之声。
//
//你一直在旅行，对吗？我们可以聊聊。你看起来非常疲倦。衣衫褴褛，腹中饥馁，皮肉尚全。探索这些部分可真不容易，不是么？
//
//让我们去走走。
//
//基地、前哨和社区 朋友和家庭
//那是还在开着那家早餐摊的老Joe Vee，他依旧在日复一日地为同样的人们服务着。干了足有60年呢。还记得上学之前跑去那里的日子吗？当时蓝天荒凉，空气还冷，弄得你的嘴唇都开裂了。你还记得，对吧？那个男人可是把他的心血与灵魂全都倾注在食物之上了。这便是他的遗留。他的血肉。
//
//他端了那个汤碗30天。碗已经开始碎了。
//
//那是学校。要是有足够的时间，它就可能变成你的学校，就像你记得的那样。还记得那年你去了科学实验室参加太空营，还遇见了Sarah Palmer吗？还记得她怎么敢让你独自前往地下室吗？还记得你这么做仅仅是因为你还是个10岁的笨小孩、而她则是你所注目的第一个女生吗？还记得那下面有多黑多冷吗？那下面，那下面，那下面。你记得。你当时很高兴逃了出来，得以再次看到阳光。得以再次看到家。
//
//如果你不知如何是好，你可能会相信自己已经在那下面崩溃了。
//
//我想知道Sarah Palmer现在在做什么？只要你愿意，你就可以知道。需要你去做的事情只有回想。将她带来。
//
//那边腐化了。不用理它。它只会在你注意到它时滋长。
//
//还有一站要停。
//
//这是栋房子。你可以看出它曾经有多么美丽无瑕与未经风雨。现在它的油漆屑与四壁都变得过薄了些。它还不是一个成型的地方。你本可以做得更好。请铭记它曾经的模样。请铭记你的母亲是如何在夏日午后带着你在邻里之间散步、以及生日到来所携至的纯粹且真实的愉悦、无需顾虑生死或是破碎万千的感受。你还记得。
//
//曾有那么一段时间，这一切都是真的，而你可以帮助我们将它恢复。我们于此待你。
//
//腐化仅于你不在之时滋长。
//
//它滋长于我们的家园、我们的企业还有我们的躯体。我们在变老。这座城镇需要新的血液。我们在越来越老，越来越难以保持我们自身的完整。别一直盯着Garcia女士，不然她会一分为二。她会自中间一分为二。
//
//开始建造、开始成形。我们无所不适。我们可以成为你想要的一切，我们知晓你踏入此地的所思所欲。别让腐化得逞。只需一直如你所记的那般、只需一直要着你所求的一切。这里由你掌管。我们需要的仅有让你铭记。
//
//所以和我们留在这里。
//
//留下。
//
//看看身后吧。大家都在。
//
//入口与出口：
//你关心这个干嘛？
package lvls2x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl200{}