//Level 291
// 
//
//生存难度：
//等级 2
//
// 
// 
//无已知实体cargoship.jpg
//通过无人机拍摄的货船的一张照片。
//
//Level 291 是后室的第292层。
//
//描述：
//Level 291 表现为一在群山包围的湖中行驶的大型货船。从无人机拍摄的照片来看，船上装有约100只集装箱。然而，对该货船的探索记录表明该货船长度无限，无法从船一端到达另一端。对爬到集装箱群顶部的尝试均以失败告终，爬上集装箱顶时，流浪者将会回到集装箱底端其开始攀爬的地方。
//
//Level 291 的大多数区域不存在实体。但这并不意味着层级内不存在危险。若流浪者在层级内停留一个小时，就算无法看见海域，其仍会出现晕船的症状，例如恶心，呕吐，头痛，发烧。此症状出现的原因不明，但大多数情况下这些症状都可以使用药物以缓解。由于该层级的外观特征，将导致这种症状的疾病称为“晕船”。
//
//集装箱：
//层级内大多数集装箱为灰色。目前不存在任何流浪者发现未被上锁的灰色集装箱的记录，所以尚不清楚灰色集装箱内是否装有物资。但流浪者从层级起点穿行足够远将有机会看见三种不同颜色的集装箱，颜色分别为红，蓝，绿。这些有特殊颜色的集装箱大部分是上锁的，但仍有机会找到未被上锁的集装箱，发现一些物资。 下文将细致描述这些集装箱的特征以及其包含的物资。
//
//红色集装箱
//蓝色集装箱
//绿色集装箱
//红色集装箱是三种有色集装箱中最常见的。大部分红色集装箱内无任何物资，但有极少概率可以找到几粒火盐。
//
//蓝色集装箱相对红色集装箱较为少见，但仍然能经常遇见。蓝色集装箱内装满了杏仁水。奇怪的是，打开集装箱后装于其中的杏仁水会保持在原处而非流出集装箱。杏仁水体内部有时能发现一些金属瓶。
//目前，绿色集装箱是流浪者遇见最少的有色集装箱。但大部分绿色集装箱内都类似于当代的海运集装箱住宅——家具齐全，有椅子、沙发、照明，甚至有电力以及用于煮饭的燃气。报告表明进入这些集装箱似乎能缓解“晕船”症状，这种特性仍待研究。绿色集装箱最不同寻常的特点是其箱壁上的一扇窗。无论集装箱的真实位置在何处，从窗内看向外面总能看见大海。流浪者无法爬出窗外，尝试爬出会回到集装箱内部，但流浪者可以将物体扔出窗外。
//补充信息：
//在连接此层级内的Wi-Fi后网页也无法加载，取而代之的是一段在全白页面上的文字：“放下电子设备，安安心心赏景。"
//
//Log(s):
//下文为一名为 Adrian Fukushima 的男孩的探索记录。 Adrian自愿为 M.E.G. 做一些探索工作以换取物资。在进入此层级后， Adrian 使用手机开始录音。
//
//在记录开始之前，请注意本层级大多数信息均为该探索记录送到 M.E.G. 之后写成。阅读探索记录时请时刻记住。
//
//记录开始
//
//Adrian：额……我就从另一个游船层级那里切入了房顶就到这了。我能看见的只有……集装箱。我觉得这好像是船的甲板。
//
//[可以听到海浪拍打和海鸟鸣叫的声音，这证实了 Adrian 的看法。]
//
//Adrian：听着声音……确实是！那个 M.E.G. 的老哥说就让我随便走走然后拿紧球棒来抵御跳脸。我准备到处看看。
//
//[Adrian 停止了录音以给手机留出内存。注意到下面几段录音占内存巨大，我们推测这段录音大概发生在他第一份录音一个小时后。]
//
//Adrian：我感觉，这里他吗除了集装箱啥都没有。淦，我有点讨厌这个地方。我头已经开始痛了。
//
//[Adrian 再一次停止了录音。下一段录音记录于十分钟后。]
//
//Adrian：我之前好像没说过这事，我看到的所有集装箱除了这个以外都是灰的，这是个红的。但这个集装箱上有个挂锁，我又没带啥能开这个的东西。我他吗运气简直太差了。
//
//[录音再一次停止，与下一次的视频间隔五小时。视频中 Adrian 有些病恹恹的。他的声音也变得虚弱。]
//
//Adrian：我感觉……特别不好。感觉像……我他吗在这船上待得越久，我就越感觉自己要死了。我想回家……我想睡觉。我讨厌这个地方。我要尽快找个出口逃离这个鬼地方。
//
//[Adrian 看见不远处有什么东西，脸上闪过一丝疑惑。]
//
//Adrian：这些家伙他-他吗是什么东西？
//
//[Adrian 将帽子半盖在嘴巴上以让自己的声音传的更远，向不远处他看见的那些人打招呼，随后突然骂了一句脏话，起身跑了起来，慌忙之中误触关掉了录音。不幸的是，这便是我们最后一次听到他的声音。我们忠诚希望他用某种法子避免了那不好的遭遇。随着我们对 Adrian 情况了解的深入，我们会更新这份记录。]
//
//基地，前哨和社区：
//船夫：
//此层级内无已知基地或前哨，但有报告称层级内有五名穿着亮黄色斗篷的人在层级内游荡，装备有金属矛（材料可能此层级内的集装箱）。有一报告称五人中有一人带着枪，但尚未被证实。报告称这五人具有极大敌意，遇到流浪者便会发起攻击。不建议与此团体交涉，并推荐不惜一切代价绕开他们。这一团体的特点是每个人手上的金属矛的颜色不同，并且仅有团体队长的矛为绿色。推测矛的颜色反应出该团体内人员的层次分化。
//入口与出口：
//入口：
//切入 Level 17 的天花板会来到 Level 291 。
//在 Level 11 的街上有几率发现一集装箱。进入集装箱便会来到 Level 291 。
//出口：
//在层级地板上可以找到一些舱门。进入这些舱门即可来到 Level 17 。
//尝试切入无法打开的集装箱可以传送至 Level 37 。
//在层级内停留时间足够长会有几率遇到贴有五彩纸屑的集装箱。切入这个集装箱，你就能来到 一个派对啦！ =).
package lvls2x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl291{}