//Level 201
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//Level 201是后室的第202层，它似乎由一个巨大的沙漠组成，其一条边界外是大片的海洋，另一边则是一座灯火阑珊的城市。
//
//描述
//该层级的主要区域是一个由黄色沙粒和紫色沙粒组成的大沙漠，面积大约为10,000,000平方公里，大约是美国表面积的3倍，整体温度在15ºC到20ºC之间。沙漠最热处的边界外是一片海洋，而在其最冷处的一侧有一个荒芜但充满活力的城市，沙漠的其余部分完全被高大的山脉包围。温度分布恒定的原因可能与太阳在这一层的位置有关。本层级的太阳呈橙色和粉色。它在天空中的明显尺寸是我们太阳1的6倍。它也是由支离破碎的直线和水平线组成的，完全在空中停留不动，当从海岸线观察太阳时，其总是处在海平面之上。天空中有一个大的、白色的线格，延伸到整个层级，其颜色从太阳附近的亮橙色发展到城市上空的深紫色。
//
//本层级的另一个特点是在整个Level 201中播放的“背景音乐”。这种音乐的来源目前完全未知，其类型也很难界定，因为每个流浪者在该层级中所听到的音乐似乎都不一样，即使他们同时处于该层级的同意地点。有一点是一致的，那就是大多数流浪者都声称发现这种音乐听起来“熟悉且有怀旧感”，并通常将其比作“休息室和电梯音乐、流畅的爵士乐和R&B2的混合体”，但“速度放慢了，而且三种音乐重合在一起”。
//
//由于指南针在本层级完全不起作用，从本层级任何一点观察到的太阳的位置将被用作参考点以确定临时的方向，以便更容易确定本层级其他区域的位置。
//
//冷漠
//冷漠是Level 201最大的区域之一，也是连接该层级的所有其他区域的中心。这个区域散布着各种废墟和寺庙，还有许多漂浮的几何形状3。在这个地区也经常能看到静电幽灵，不过由于沙漠的大小，遇到这些实体的情况并不常见。
//
//上述的废墟由半埋在底下的希腊-罗马神庙、柱子、墙壁和地基组成，这些残骸完全由光滑的紫色大理石制成，并装饰有各种雕像、壁画和半身像，让人想起古代文明。许多寺庙的柱子周围还有漂浮的霓虹灯环，主院里还有放在地上的老式台式电脑终端。 这些终端通常是激活着的，而且由于该地区的WiFi相对较强，任何流浪者都可以使用它们，尽管其中一些终端缺乏键盘，而且这些终端没有一个与任何型号的电脑鼠标兼容。这些终端还使用过时的拨号调制解调器系统4，因此访问互联网需要一些时间。
//
//沙漠的植物种类繁多，许多非沙漠生物群落的盆栽植物遍布整个地区，但其中棕榈树是个例外，因为它们仅扎根于散布在该地区的小型绿洲附近。这种水与位于网络海洋的水具有相同的属性，所有绿洲都位于海平面以下，所以人们认为上述水来自网络海洋。
//
//沙漠的东部和西部边缘完全被高大的山脉包围。这些山脉由贫瘠的岩石构成，完全没有生命存在。许多人试图爬上这些山，看看它们的另一面是什么，但都没有成功。
//
//日落海岸
//这个海岸位于冷漠的北部，靠近网络海洋，太阳总是在这里落下5，而该区域也因此得名“日落海岸”。这个地区有许多棕榈树沿着海岸线排列，它是整个层级表面上最温暖的地区。这里的沙子比沙漠的其他地方要软得多，海浪的强度和高度总是很低。在这里也可以看到一些静电幽灵，它们大多数都在盯着太阳，而有些则只是躺在海岸的沙滩上。
//
//海洋和绿洲中的水都不能喝，不是因为它有毒，而是因为它几乎完全是无形的，也不可能用任何种类的容器来装。尽管如此，它在被触摸时仍然感觉湿润，就像普通的水一样。由于它的无形性，不仅不可能在海中游泳，而且还可能在水下呼吸。
//
//网络海洋 & 数字海沟
//网络海洋是对在其北部环绕冷漠的整个水体的称呼，之所以这样命名是因为它的“矢量”6外观，由像网一样排列的线条组成，与本层级的天空不一样。这片海几乎没有振荡活动，它的颜色是深蓝色的，但有时会淡化成柔和的紫色，不过目前还没有发现这种现象的周期性规律。由于本关水的特性，可以步行进入大海，探索其深处。
//
//虽然静电幽灵在这里相当罕见，但取而代之的是在整个海域很常见的二进制鱼群。这些实体看起来像是是长达20厘米的骷髅鱼，类似于海鱼科中的鱼类，不过要小得多。它们的全身完全由一串串的二进制数字组成，周围有灰色的光环。大部分二进制鱼是无害的，但当它们处于饥饿状态时会攻击周围的任何其他生物。由于海洋缺乏其他生命形式，它们的食物只包括海草和极少数的流浪者。任何被二进制鱼咬过的东西都会开始非物质化7，变成一串串的二进制代码，然后被鱼群吃掉。
//
//网络海洋的深度为500米，“数字海沟”正位于此地。与网络海洋的阳光区相比，这些海沟要暗得多，而且充满了漂浮的计算机窗口，这些外观令人想起前厅互联网时代早期的窗口描绘了许多后室的层级。然而，有些窗口包含的信息现在已经过时，甚至是不准确的，所以这些窗口不应该被认为是关于后室的完全可靠的信息来源。
//
//每个窗口都包含一个超链接，触摸这些超链接通常会将流浪者传送到该窗口的相应层级，但有些超链接也可能是过时的或完全损坏的。根据在该层级中发现的报告，这些链接会将流浪者引至所谓的“虚空”。关于这个地方的情报稀少，人们只知道它是一个广阔的白茫茫的虚空，唯一的声音是微弱的低吟，一遍又一遍重复着“404”这样的数字串。由于只有很少一部分超链接已被证实是安全或危险的，因此强烈不建议使用其他超链接。
//
//点此关闭
//安全超链接
//Level 1
//Level 3
//Level 4
//Level 5
//Level 7
//Level 25
//Level 31
//Level 87
//损坏超链接
//Level 0
//Level 2
//Level 6
//Level 8
//Level 17
//Level 58
//霓虹城
//霓虹城是本层级最冷的地区，因为其处在本层级的南部地区，也就是离本层级的太阳最远的地方。它由如摩天大楼、酒店和购物中心一类的许多建筑组成。这个城市的每一栋建筑都没有被任何实体或各种现象所维护，但它们却没有任何被遗弃、侵蚀或被任何事物接触过的迹象。虽然城中总是夜晚时分，但由于大量的灯光和霓虹灯覆盖在建筑物上，它仍然非常有活力。在天空中可以看到许多明亮的星星。城中许多霓虹灯招牌对应的是前厅的著名品牌，尽管其中大多数是日文品牌。这个地区有时候会下雨，但总是没有气象迹象表明它会何时到来。截至目前已获得的报告中，这些雨一次最多持续的时间不超过15分钟。
//
//街道和道路有一个功能性的红绿灯系统，调节所谓的“交通灯”8，红色的汽车灯流在道路上高速行驶，只在红色交通灯下停止。被这些车辆撞倒是致命的，所以建议你留在充斥着大量静电幽灵的街道上。
//
//城中的购物中心缀有各种霓虹灯，并有一些从沙漠中的寺庙借来的设计特点，如柱子周围的霓虹灯环。每个购物中心至少有两层，地板通常由方形大理石砖制成，屋顶则由玻璃板制成。虽然几乎所有的商店和餐馆都是关闭且不可进入的，但街机厅在通常情况下是开放的，购物中心中的一些小吃店也是如此9。在这些街机厅里，大多数机器都是正常的，所有的街机和弹球机都处于“免费游玩”模式，这意味着它们不需要任何形式的货币来玩。有些机器确实会奖励流浪者代币，这些代币只能用来购买饮料和零食，这些饮料和零食可以在散布于购物中心大楼的许多自动售货机上安全食用10。这些街机厅中还有一些球形坑洞，跳进它们非常安全=)。应不惜一切代价远离。在这些街机厅乃至整个Level 201中尚没有关于派对客的目击报告。
//
//与商场相比，酒店的风格更类似于沙漠中的寺庙，然而它们也有室内游泳池，设计仍然非常简单，只包含大厅和走廊周围的一些盆栽棕榈树，一些自动售货机，甚至还有一些礼品店，里面陈列着各种物品，通常是T恤衫、帽子和拖鞋，不过有些也有小灯和圣甲虫。由于没有人看管这些商店，所以这些物品可以自由取用。酒店具有一些危险性，因为有些窗户实际上可能是名为“窗户”的实体，因此建议小心翼翼地穿越酒店的窗户走廊。
//
//许多建筑物，包括商场和酒店，都有电视机，它们通常是关闭的，但可以很容易地打开。打开一台电视机后，电视机屏幕会显现出另一个层级的图像，但画面因静电而显得非常失真。几乎每个频道都会显示不同的层级，尽管每个频道所展示的层级画面在Level 201的所有电视机中并不一致，有些频道甚至会显示无信号报错画面。切入这些电视总是会进入它们当前显示的层级，尽管切入一个没有信号的频道会进入“虚空”。即使如此，这仍然是离开Level 201的最安全方式。
//
//现象
//VHS11特效
//每当人们用相机记录Level 201，无论记录形式是是视频还是照片，在大多数情况下记录下的视频/图像总是会出现一种像是由静电导致的突变效果，以及描述图像/视频录制时间和日期的文字和数字和相机可执行的功能，如 “暂停”、“倒带”或“播放”，像是在模仿老旧的录制模拟媒体。由于这个原因，这种效果被称为“VHS特效”。
//
//这种效果也可能以另一种形式发生。值得注意的是，在这种形式下，故障效果大部分被缓解，模拟没你功能、日期和时间被LED数字般的数字所取代，展示了媒体的记录日期。虽然许多流浪者的描述在某种程度上略有不同，但他们都不知道为什么会发生这种情况，而且这种效果通常让他们想起家人自制的视频。然而，某些流浪者，以及许多其他有智慧的实体，不会目睹这种效果，而是按照正常情况下的样子观看图像/视频。这暗示了一种可能性，即VHS特效只发生在那些通过照片或视频记录了他们童年时刻的人身上。
//
//调离和静电幽灵
//之前没有提到的关于“背景音乐”的一个特性是，如果一个人停下来持续聆听它，佢12会开始感到极度的放松和平静。然而，强烈不推荐在这种状态下停留太久，因为这可能会导致听众被迫“调离”眼前的存在。“调离”是对这种现象的称呼，当一个流浪者开始“调离”时，他们的身体将被越来越多的静电效应13所覆盖，随着时间的推移，他们将越来越少地受到外界刺激的影响，无论是物理的、视觉的、听觉的，亦或是是其他的。
//
//如果处于这种状态的流浪者没有从中脱身，他们的身体对其他生物来说将变得无形，永久地成为一个静电幽灵。因此，我们强烈建议流浪者以组队形式通过这一层级，并始终保持警惕和完全集中。拥有一个外部噪音源，如闹钟，似乎是一个相对稳定的方法，以避免调离效应。每一个静电幽灵，不管是什么物种，似乎都是完全无害和无敌意的，并且从不对任何其他实体的存在作出反应，也不试图与他们互动。然而，也有过静电幽灵之间互动的例子。到目前为止，这些互动似乎只包括摇头和挥手，类似于简短的问候。
//
//前哨站14
//M.E.G.泽塔研究组基地（已遗弃）
//在沙漠中的一个寺庙附近，有一个废弃的基地，该基地曾经属于一个M.E.G.研究组。
//据报道，该团队至少由25名确认的成员组成，但这些成员都已离开队伍。
//本层级中所有实体和区域的名称都是由他们提供的。他们还制作了一份清单，列出了数字海沟的所有窗口中已确认的有效的和破损的超链接。
//虽然大多数成员的命运仍然未知，但一些抢救出来的报告和记录显示，至少有6名成员成为通往 虚空的途径的受害者，2名成员为二进制鱼群所害，3名成员则因“调离”遇难。
//基地中留下了很多物资，供任何有需要的流浪者到达这里时领取。物资中包含杏仁水和火盐，甚至还有层级秘钥。
//入口与出口
//入口
//进入这一关的最安全和最稳定的方法是使用标有“三月+”的特殊VHS录像带。这种磁带在许多层级中都可以找到，特别是在Level 0、Level 1、Level 4和Level 11。将磁带插入连接到电视机的VHS播放器中，就会在电视机的屏幕上显示出与Level 201的某个位置相对应的图像，此时切入电视就可以达到这个层级。每次这样做，磁带就会从VHS播放器中消失。尚不知道该录像带是否会在其他地方重新出现，或者是否存在多盘磁带。据说后室电台工作室的主任拉尔夫通常可以接触到这盘磁带，或者它的一个副本，尽管现在这只是一个传言。
//
//通过Level 18也可以来到这一层级，不过这个入口只在特定条件下有效。如果一个流浪者能够见证VHS效应，那么一个老旧摄像机可能会在Level 18出现。这个摄像机的外观从来都是一致的，似乎是采取了流浪者童年时的摄像机的外观，就像这个层级的大多数东西一样15。这些摄像机中要么存储着一个视频，要么存储着一张照片，而且它们总是有关Level 201的。查看摄像机中记录的唯一视频/照片会将流浪者传送到这个层级。
//
//最后，通过Level 33也可以来到Level 201，其方法是进入一家电子设备商店，打开一台电脑，然后切入电脑。尽管有时这种方法可能会导致你进入一个负数层级。这可以在Level 33的任何状态下进行。
//
//出口
//如上文所述，离开这一层级最安全的方法是在城市中找到一台电视机，选择一个正在播放目的地层级的频道，然后切入电视机即可。触碰数字壕沟里的窗口中的超链接也是一种可靠的退出方式，但仅限于那些被证实是安全的超链接，因为使用任何未经证实的链接都被认为风险太大而不可靠的。
//
//切入一台街机会让你来到Level 25或Level 40。切入其他地方会令你来到负数层级16。若你在街机厅中发现一个球形洞口，跳进它即可和我们一同开派对！=) 不惜一切代价避开它.
//
//作者信息
//« Level 200 | Level 201 | Level 202 »
//
//Footnotes
//1. 译注：原文如此，应指前厅（地球）在天空中所看到的太阳的尺寸。
//2. 译注：R&B是Rhythm and blues（节奏布鲁斯）的简称，这个术语最早出自1940年代的Billboard杂志中。它首先由非洲裔美国人艺术家所演奏，受到了gospel、jazz、blues的影响，自上世纪40年代诞生以来一直在世界流行音乐舞台上扮演着重要角色。
//3. 译注：原文如此。
//4. 译注：调制解调器，是调制器和解调器的缩写 ，一种计算机硬件，它能把计算机的数字信号翻译成可沿普通电话线传送的模拟信号，而这些模拟信号又可被线路另一端的另一个调制解调器接收，并译成计算机可懂的语言。这一简单过程完成了两台计算机间的通信。
//5. 译注：原文如此。
//6. 译注：原文为“vector-like”。
//7. 译注：原文如此。
//8. 译注：原文为“Light Traffics”。
//9. 译注：疑似上下文矛盾，保留原文。
//10. 这些零食从饼干、薯条和三明治到汉堡和比萨饼片等皆有，而饮料罐和瓶子里则装有有各种碳酸饮料或无碳饮料。所有的包装商品都是其在前厅中同类商品的近乎完美的复制品，尽管印在上述容器上的大多数文字似乎完全是杂乱无章的，没有任何语法或行理。大多数机器里都有杏仁水。
//11. 译注：VHS为“家用录像系统（Video Home System）”的缩写，该录像系统在20世纪80年代被广泛使用，也由此成为了“怀旧”的其中一个代名词。
//12. 译注：原文为they，未指明性别，因此译文采取无性代词“佢”（qú）。
//13. 译注：原文为“static effect”。
//14. 译注：原文仅写有“Outposts（前哨站）”而非常见格式中的“Bases, Outposts and Communities（基地、前哨站与社区）”，译文保留原文。
//15. 译注：原文如此。
//16. 译注：原文如此。
package lvls2x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl201{}