//Level 211
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//cave-211.jpg
//Level 211中的钟乳石。由Juno Perez拍摄
//
//Level 211是后室的第212层。M.E.G.正在尝试绘制此层级的多洞穴系统。
//
//介绍：
//Level 211是一个位于岛屿中变化的洞穴系统。从M.E.G.志愿探险者恢复的日志目前表明，洞穴有五个不同部分的洞穴系统，当人类与洞穴进行任何形式的接触时，洞穴构造就会发生变化。
//
//为了引导那些发现自己进入Level 211的流浪者，探险者在洞穴壁上刻下了标记。
//现已证实当洞穴改变其构造时，其本身不会创造连接不同部分的新通道。通过转录从多个M.E.G.探险者恢复的勘探音频日志，可以表明洞穴内有丰富的杏仁水。
//
//M.E.G从一些未能从此层级返回的探险者报告中，获得了此层级的更多信息。
//
//关闭文件
//[从PEREZ恢复的音频日志已被转录]
//J. Perez: 现在是… 2021年4月20日22:48！呃，我现在在打开录音机，设定持续录音模式…我是北极星小队的Juno Perez。我在… Level 211内部，绘制洞穴系统，因为萤火虫小队并不认为让志愿者冒着风险勘探是个好主意。可以说，我是最后一批探索此层级的人。[笑声]
//J. Perez: 我发现了其中一个标记，巨大的X，刻在墙上。附近没有生命迹象，但我刚刚好像发现这个像… “距入口10米”，这可能是那个第二个未被完全记录的洞穴系统。不错，至少在我进入之前有些地图可以参考，不论它是否精细…
//[ 登录并上传地图 ]
//J. Perez: 萤火虫小队会在我失踪之后来找我 [笑声]，以防万一，他们是这么说的。虽然我不知道如果两个人同时进入洞穴会发生什么。要是在我进去的时候入口塌了…我会在下一次上传地图时报告。Jason，把这些日志转发给Harper，这只是…只是以防万一。
//
//关闭文件
//[从PEREZ恢复的音频日志已被转录]
//J. Perez: 现在是凌晨0点44分… 至少我认为是。手电筒在这里忽明忽暗，真奇怪，让我有些头晕目眩，但我很感谢我们小队在眼部保护方面进行的投资。我一直听到水流声，尽管目前我没有看见任何一条…也许是这个洞穴系统的另一部分？总之，曾经有探险者报告过发现水流，我猜这要么是另一个洞穴系统。
//J. Perez: 至于实体… 我还没有发现任何生命迹象，这里的气味也有点恶心… 呃，这里有很多垃圾。有撕开的袋子和破损的通讯器部件，所以至少有一些人来过的迹象，尽管没有发现M.E.G.志愿者。
//J. Perez: 我已经画出了许多死胡同，似乎洞穴越来越深，偶尔会分支… 遇到什么新情况我就会更新日志。
//[ 登录并上传地图 ]
//
//关闭文件
//[从PEREZ恢复的音频日志已被转录]
//J. Perez: 现在是凌晨3点… 事实上，我应该睡觉了，但这个洞穴太吵了。还有我越往深处走气味越难闻，而我仍然找不到这种气味的来源，像是实体、植物或尸体，什么都没有。
//J. Perez: 我能听到流水声越来越大，洞穴越来越潮湿。我没什么可为地图更新的，过去几天我没有得到真正的睡眠。
//[Perez沉默，水流声]
//J. Perez: 我不知道这是不是一种幻觉，但…有时有些东西会被水冲走。
//[再次沉默，水流声越来越大]
//J. Perez: 这个洞穴太他妈的黑了，也许我的其他感官都被吓坏了，有时我能听到另一种声音与哗哗的水流重合。洞穴稍微安静一点你就认为可以对噪声置之不理了？“哦，那只是个洞穴”，也许是对的，但洞穴什么时候安静过？
//[沉默]
//J. Perez: 我记得…我妈妈，她过去带我去圣托马斯还是圣塞瓦斯蒂安的洞穴。她告诉我，洞穴里总是充满噪音，因为洞穴是活的。老实说，当时吓了我一跳。她然后穿过这个洞穴的各个通道，标记路线，探索，使我知道了一些有趣的东西。
//[沉默]
//J. Perez: 我不得不继续前进，我感觉像是自己把自己拉入深渊，但这种恐惧感让我在过去几天保持清醒。“我需要画出这张地图，我需要探索这里，”我像蜜蜂一样找到了目标。我妈妈说洞穴的神奇之处在于，无论洞穴隧道多么狭…狭窄，生物都可以穿过。又有一条通道离我探索这块洞穴经过的第一个标记大约一英里远？好吧，那够远了，这通道太黑了，完全的漆黑。
//[脚步声]
//J. Perez: 我继续前进，我感觉洞穴墙壁慢慢开阔，让我容易通过。我被黑暗、潮湿、粗糙的空间吞没了…我就这样被投入了无垠的黑暗。
//[沉默]
//J. Perez: 我该去睡觉了。
//
//关闭文件
//[从PEREZ恢复的音频日志已被转录]
//J. Perez: 我睡不着，我尽力了，我耳内充斥着这种——水流，我真的想离开这里。
//[Juno的笑声]
//[ 登录并上传地图 ]
//J. Perez: 我将…继…
//[湍急的水流声]
//J. Perez: 这太他妈的湿了…我还剩下多少电池？啊——该死！
//[飞溅声]
//J. Perez: 天哪，我他妈的掉进河里了？怎么这么深- [喘气] 该死，该死，该死…水流很强——
//[劈啪声]
//J. Perez: 该死！该死，该死，该死-[湍急的水流声]
//[爬行的声音在洞穴里回荡。识别为疑似纸张起皱声]
//J. Perez: 该死！为什么…为什么在这里？！[巨大的飞溅声]
//[识别为爬行实体快速接近。大量飞溅声]
//J. Perez: 不，妈的！[翻滚声，接着是巨大的撞击声]
//
//关闭文件
//[从PEREZ恢复的音频日志已被转录]
//[飞溅声，然后是一声巨响。识别到喘息声]
//[遇险信号已发送到 GAMMA 基地，自动匹配小队，小队将会快速到达目标地点援救]
//J. Perez: 这里- [巨响] 这里有 肢团- 洞穴…洞穴居然通向这里。他妈的—— [大声咳嗽]
//[呼吸速度减慢]
//J. Perez: 我的手电筒坏了…真好。我只知道我在水里。我试着看看能不能弄点光。
//J. Perez: Jason，我真的希望你能收到这段录音。不然我要把M.E.G所有的技术组的人都埋到我坟墓里去。
//J. Perez: 我不会再回到水里了。在这河里游是个折磨，我都不知道这河有多深…
//J. Perez: 地图不知怎么的没事，我想我已经完成了这个洞穴系统的记录，是吧？好吧…
//[一声巨响]
//J. Perez: 好吧…让我们看看有什么在那次坠落中幸存下来的…地图、眼镜、啊！我找不到我的玻璃杯了…哦！妈的是的，照明弹还在。[叹气]
//[水流声。照明弹的声音在整个洞穴中回荡]
//J. Perez: …啊… 啊…我不能活着出去了。
//J. Perez: 10…20…我数不清这些衣服…水上到处都是衣服、成堆的衣服。啊-哈哈- “Micheal，请在出事前联系我”
//J. Perez: 到处都是坑的岩石部分越来越多。包、衣服、甚至有武器…它们都撒出来了。闪光弹不会一直亮着，我必须找到一条出路。
//
//关闭文件
//[从PEREZ恢复的音频日志已被转录]
//J. Perez: 我绕了一圈… 什么也没有… 那里是——湖水，但我想我再进去可能会淹死。[笑声]
//J. Perez: 也许是洞穴把我弄得心烦意乱，但我有时能听到脚步声。天哪，我希望那只是其他探险者，那会…很好…地图已经完成了，我希望我能成功离开，交付地图。
//[Juno的笑声]
//J. Perez: 我这样说是…多么的自信。
//J. Perez: 我必须潜入水中，是吗？妈的不…但是…我不想在这里饿死。我该怎么办？我只是…我现在需要清醒一下大脑。他们…M.E.G会找到我，我会没事的。
//[水被推开的声音]
//
//关闭文件
//[从PEREZ恢复的音频日志已被转录]
//J. Perez: 我…我正在努力节省电池… 我希望有人能找到我。我一直…一直听到这些东西在这个坑口爬行，求求有人能找到我。
//[脚步声在洞穴中回荡]
//J. Perez: 那是…等等——天哪！有一个可以爬过去的空间！我想我可以进去，但如果我设法爬过去了，我到底会到哪里？
//[水流声]
//J. Perez: 去他妈的。我还有别的选择吗？如果我等着M.E.G来找我，我会饿死、渴死，或者让肢团从我屁股后面追上来…就让我——
//[叮当声。怒气冲冲地踢了一些东西]
//J. Perez: 你会没事的。
//
//关闭文件
//[从PEREZ恢复的音频日志已被转录]
//[沉重的呼吸声]
//J. Perez: 这里…有光。就在这外面… 他妈的就在我眼前，但我走不动了。
//[沉重的呼吸声]
//J. Perez: 我很冷…这里很潮湿，我感觉我快要昏倒了。
//[呻吟声]
//J. Perez: 哈… 哇…啊！我很好——没什么1…抱歉，Jason，如果你还在听的话。
//[轻轻的流水声]
//J. Perez: 这…这是从哪里来的？
//[轻轻的流水声]
//J. Perez: 帮帮我2，Eli— Mama，我他妈看不见了。
//[轻轻的流水声]
//J. Perez: 好吧…3
//[一声叹息]
//[因为水流造成的损坏，音频的其余部分无法识别]
//
//附录-1: 2021年5月1日
//Juno Perez成功在探险任务中幸存，但他的手臂、腿和胸部严重烧伤。关于这一事件，M.E.G. 的Compass Point和Track Mappers将会讨论将来探索Level 211的任务状态。
//——Venessa Smith 队长，生命线: “Mossy Medics”
//
//附录-2: 2021年5月3日
//由于未知的人员伤亡和M.E.G.特工重伤，未来派遣探险队进入Level 211的计划已无限期暂停。因Level 211造成无法统计的过多尸体，不再值得在其内探索一些已知的资源。
//—— 监督者-A
//
//基地、前哨和社区
//由于其变化的洞穴系统，此层级没有已知的基地、前哨站或社区。
//
//入口与出口：
//入口
//通过切入Level 8内的凹坑被认为是进入Level 211最稳妥的方法。
//进入Level 75中的随机通道有可能到达Level 211。
//跌入Level 173内的水中有可能到达Level 211。
//Level 797中的有些洞穴可能会通往Level 211。
//出口
//绕行Level 211的岛屿有可能进入Level 62。
//探索洞穴系统外的森林有可能进入Level 10。
//作者信息
//Footnotes
//1. 译注：原文为Estoy bien— No es nada，西班牙语。
//2. 译注：原文为Ayúdame—，西班牙语。
//3. 译注：原文为Coño— ok，西班牙语。
package lvls2x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl211{}