//Level 260
//Level 260: 阈限极光
//生存难度: 0	安全	实体绝迹
//↓259	↑261
//« 描述 »
//level260.a
//图 1 - Level 260 与阈限极光
//
//Level 260，又名“阈限极光”（Aurora
//Liminalis），是后室中第 261 个已知存在的层
//级。Level 260 是一块被雪覆盖的冻原。它位于一片大小适中的高原，且常年处于夜晚或黄昏1的状态。据观
//测 ，Level 260 的高原缺乏山脉或峡谷等显著地貌特征——此层级的地形只存在湖泊和微幅凹陷；与通常高原地区的边缘地貌特征不同，此层级的高原边缘呈现突兀的近角度垂直。只有特定种类的植物群生长于 Level 260，其中仅有极少种类的乔木，且大部分为云杉属（Picea）——常见的例子有欧洲云杉，黑云杉以及深皮云杉2。
//
//Level 260 的气候似乎维持着一个固定的七天循环。此循环只影响周围环境的温度和天空的晴朗程度。以下表格展示了 Level 260 的天气循环。需要注意此数据收集于 2015 年 7 月 8 日至 2015 年 7 月 15 日的七天时间内。(当前最新数据可能与展示数据不符)
//
//第一天
//
//第二天
//
//第三天
//
//第四天
//
//第五天
//
//第六天
//
//第七天
//
//温度:
//1.7°C (35°F)
//
//气候:
//85% 能见度
//40% 阴天
//
//温度:
//1.9°C (35°F)
//
//气候:
//70% 能见度
//55% 阴天
//
//温度:
//1.5°C (35°F)
//
//气候:
//55% 能见度
//30% 阴天
//
//温度:
//1.2°C (34°F)
//
//气候:
//50% 能见度
//15% 阴天
//
//温度:
//1.6°C (35°F)
//
//气候:
//65% 能见度
//20% 阴天
//
//温度:
//1.4°C (35°F)
//
//气候:
//70% 能见度
//35% 阴天
//
//温度:
//1.7°C (35°F)
//
//气候:
//80% 能见度
//40% 阴天
//
//阈限极光是 Level 260 的标志性特征，也是此层级的非正式别名。阈限极光 呈现为前厅中的北极光（Aurora Borealis）更亮的版本，且由于 Level 260 缺乏星空以外的天体照明，阈限极光是 Level 260 的主要光源；也因如此，生长在 Level 260 的植物很大程度上依赖吸收阈限极光的光源来存活。除此之外，阈限极光也是此层级的主要热源。然而，其对于 Level 260 的自然环境如此重要的原因仍然未知。
//
//阈限极光似乎也可以愈合所有出现在 Level 260 的生物的损伤，使得所有居住在此层级的生物基本实现永生。据观测，在愈合损伤时，极光会先覆盖在生物表皮的伤口位置，再开始重构受伤组织的内部结构。愈合结束后，记录中的被治疗对象通常健康状态比受伤前更好。若极光认为伤势过重，它便无法愈合损伤，例如截肢或器官衰竭。然而，即便对象由病患导致的组织损伤会在几秒内恢复，由于极光不认为疾病属于损伤，它无法彻底治疗疾病。
//
//« 发现和历史 »
//level260.b
//图 2 - Level 260 的第一张照片
//
//Level 260 于 1973 年 11 月 21 日被一组流浪者首次发现，在此之前四人正在探索 Level 118。1975 年 4 月 15 日，其中两位流浪者重返 Level 260 并对其进行进一步探索；Level 260 的第一张照片因此产生。截止 1976 年，这些流浪者建立了目前 Level 260 中存在的第一个也是唯一一个社区。
//
//对于 Level 260 的详细研究直到 1999 年 1 月 20 日 M.E.G. 开展考察活动 118-03 后才开始。以下是 M.E.G. 考察活动 118-03 前后经过的日志文档。
//
//« 考察 118-03 »
//« 1999 年 1 月 20 日 »
//
//M.E.G. 专员 XV：搜索小组 118，请进入 Level 118。
//
//ST 118-02：明白，正在进入。
//
//经过 55 分钟的探索后，搜索小组 118 关闭了他们的通信接收器。当搜索小组看到“阈限极光”时，接收器被小组成员 ST 118-07 重新激活。
//
//ST 118-07：那道光是什么？
//
//M.E.G. 专员 XV：怎么了？
//
//ST 118-04：它看起来像……像北极光……
//
//M.E.G. 专员 XV：你可以把你看到的拍下来吗？
//
//ST 118-08 拍摄了三张 Level 260 的照片，其中一张出现了阈限极光。
//
//M.E.G. 专员 XV：好，现在请离开此层级。这是在 Level 118 进行的考察行动，不是什么新层级。我们待会可以再整理一下。
//
//搜索小组 118 尝试以进入的方式原路返回；然而，几秒前 Level 118 就已分裂瓦解。
//
//ST 118-04：我不觉得这办法可行。Level 118 没了。
//
//M.E.G. 专员 XV： 额，那就找个出口吧。我们会引导你们回到 Omega 基地的。
//
//搜索小组 118 在寻找出口时关闭了他们的接收器。两小时后，搜索小组 118 找到了通往 Level 135 的出口。
//
//ST 118-02：我们终于出来了。我们现在在 Level 135。
//
//M.E.G. 专员 XV： 好的，我们将派一支引导小组到那边。请在原地待命。
//
//« 文档结束 »
//
//M.E.G. 共进行了六次考察活动。目前仅有一次被记录。
//
//« 考察 260-02 »
//« 2000 年 12 月 12 日 »
//
//M.E.G. 专员 XIX：搜索小组 260，请进入 Level 260。
//
//ST 260-03：明白, 正在进入 Level 260。
//
//搜索小组 260 在 Level 260 中探索了 1 小时 32 分。当搜索小组 260 发现极光共和国时，通讯接收器被激活。
//
//ST 260-02：专员 XIX，我觉得 Level 260 有它自己的社区。
//
//M.E.G. 专员 XIX： 收到。请把备用接收器递给最近的居民。
//
//搜索小组 260 把备用接收器递给了一位极光共和国居民并进行了一段简短的采访。小组成员 ST 260-05 示意让共和国居民回答 M.E.G. 专员 XIX 所问的问题。
//
//共和国居民：喂，你好？
//
//M.E.G. 专员 XIX：好的，请问能说明一下你所属的地区吗？
//
//共和国居民：极光共和国。
//
//M.E.G. 专员 XIX：好的，请说明你何时来到这里。
//
//共和国居民：我觉得……应该在 1993 年 6 月的某天，但我可能记错了。
//
//M.E.G. 专员 XIX：好，谢谢。你是怎么来到这个层级的？
//
//共和国居民：就，我之前是在乳白天空那里，待了有两三天吧。我当时找到了一个破窗户，周围地板上有粉，然后我发现那些都是雪，所以……我拿起从别的层级带来的铲子——应该是 Level 165 吧；我不太清楚，都很久以前的事了。然后我就在窗户周围挖啊挖，接着就发现了一片没那么晃眼的地方。那是一片有极光的夜空。我过去调查，就发现了这个层级。我尝试回去乳白天空，但那些雪似乎变成了地面。我甚至还往下挖到来时的那扇窗，但都没有用。真的非常可惜，因为我把好多物资都落在那里了。当我发现这个社区时，我就随缘，住这边了。
//
//M.E.G. 专员 XIX：接下来，你是否有在这个层级中注意到任何异常性质？
//
//共和国居民：嗯……这层级能疗伤，但是好像不能治病，因为我在这住了大概 7 年，见过有人得了流感和麻疹，他们最后终身都得受病痛折磨。我们最后处死了这些人并把他们埋在了雪里以防止疾病传播。这很不幸，说真的。
//
//M.E.G. 专员 XIX：好的，应该就这么多。请把备用接收器放回去，我们继续前进。
//
//« 文档结束 »
//
//« 基地、前哨和社区 »
//« 极光共和国 »
//领导人：总理：安东尼·格雷厄姆斯（自 2015 年 12 月 4 日起）
//建国日：1976 年 12 月？日
//人口：96（永久居民）
//描述：极光共和国是位于 Level 260 中的唯一社区。1976 年 12 月，极光共和国由两位流浪者在 Level 260 最大的湖泊附近建立，此前二人已在湖泊附近生活了两年。在与总理安东尼·格雷厄姆斯会谈后得知，选择此层级作为建国地址的原因是其保密性以及阈限极光的治愈特性。
//« 入口和出口 »
//« 入口 »
//除非经过特定条件，否则大部分进入 Level 260 的行为都属于意外事件。Level 260 可以从六个不同的层级进入：Level 118，Level -5，Level 93，Level 198 或乳白天空。
//
//Level -5
//在 Level -5 时，一般只会发生在冬季时期的事件将会出现。事件发生期间，天空中将会出现阈限极光并转变成黄昏的状态，气温也会逐渐降低并在 2°C 左右徘徊。此类事件发生期间，若在户外度过了足够的时间，人将会进入 Level 260。
//Level 93 - “顶峰”
//从 Level 93 进入 Level 260 需要在天气处于第一和第二阶段期间于一棵树旁扎帐篷。一旦所有条件达成，人、帐篷和里面的物品将会被传送至 Level 260。
//Level 118 - “露营地”
//从 Level 118 的起点开始，向东北偏北方向走 60 分钟。45 分钟后，地面将出现小块积雪，同时云杉数目增加。50 分钟后，气温将在几秒内急剧下降至大约 2°C，若此时伤口暴露，人可能因急剧变化的气温而休克。55 分钟后，阈限极光变得完全可见，之前出现的实体将不会来到此区域附近。60 分钟后，人将正式进入 Level 260，此时在人的视角中 Level 118 将会分裂成碎片。
//Level 198 - “坠落”
//从 Level 198 进入 Level 260 是在 Level 198 时几乎完全随机发生的事件。若层级里除了阈限极光的出现以外大部分是黑暗的，则即将到来的进入 Level 260 的入口会非常明显。
//乳白天空
//从乳白天空进入 Level 260 需要利用一扇破窗。和它们那些完好无损的同类比，破窗并不展现相同的属性，它们周围总是有积雪而非大量光照。挖走积雪将通向 Level 260。无法以同样的方式原路返回。
//« 出口 »
//目前已知的 Level 260 的出口仅存在于 Level 198，Level 93 和 Level 135。需要注意 Level 198 和 Level 93 共享同一个出口。
//
//Level 93 & Level 198
//进入 Level 93 或 Level 198 需要从高原边缘跳下去。出口所指向的层级似乎是接近随机的。环境的气温和时间段会根据层级的基础设置来调整。需要注意，若已退出 Level 260，Level 198 将无法再次直接通向 Level 260。
//Level 135 - “斯卡兹卡”
//Level 260 可以从一片密林通向 Level 135。和 Level 118 的入口一样，通往 Level 135 的出口直到一个特定的点前都是由高原铺成的路。从人所在的原点起步行 30 分钟至一片密林区。20 分钟后，Level 260 的雪开始消失，同时树上的叶子转变成适应秋天的模样，并失去抗寒能力。25 分钟后，阈限极光从视野中消失，天空模拟成黎明状态。当 30 分钟已过后，天空已完全变成正午状态，且人将正式进入 Level 135。
//[作者信息与图片来源]
//脚注
//1. 译注：原文为“night or twilight”。
//2. 译注：原文为“dark-bark spruce”，目前并未找到正式译名。
package lvls2x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl260{}