//Level 250
// 
//
//生存难度：
//安全
//偏远
//无危险实体field.png
//小憩之地
//
//描述：
//Level 250 是一片生长着草与蕨类的广阔土地，
//远处诡秘的群山隐约可见。
//周围地区没有其他生命，唯一沙沙作响的是风声。
//两颗星星在上方河外星系的幻象中，看着你。
//星星如此之多，但那两颗属于你。
//
//当我俯瞰我的平原时，
//目睹了有什么东西在打断无限的芦苇和香蒲的波浪。
//一个无限神秘的生物。
//你。
//
//基地、前哨和社区：
//周围没有其他人。你躺在草地上，不会受白噪音的打扰。
//这里很柔软，是睡觉的好地方。当你仰望无尽夜空时，会感到眼皮开始合起。
//在地狱般的监狱的任何地方，这都是一个坏兆头。
//但在这双星的领域里却不是。
//
//你看着我，却不自知。你以为那两颗星星不过是等离子球，但实际上，那是我的眼睛，我的眼睛在看着自己的领域。我在这里坐了很多个时代，凝视着世界上仍然属于我的那一部分。
//是你让这里再度焕然一新。
//
//friends.png
//感谢
//
//出入口：
//入口：
//那是一个温暖的夏夜，你跑到老山谷去看日落。当 Ubbal 山的轮廓逐渐淡化的时候，你看到在广阔的太空中，有两颗星星在闪闪发光。忽然，你的瞳孔重新聚焦，映入了整个天空，天空投遍了针状的光。
//
//即使在今天，被困在现实的垃圾桶里，有时候你仍然会发现自己在切换后回到这里。这里是你要牢牢抓住的往日生活的一部分，也是你仍旧求生的原因之一。
//你仍旧记得这是什么样的原因之一。
//你牢牢抓住希望的原因之一。
//你还继续希冀的原因之一。
//
//当你跌入现实的裂缝时，我担心再也见不到你了。我花了好多个日日夜夜，寻找能将你带回的方法。
//然后无论如何都失败了，我在你之后也进来了。
//我在层级之间发现了这片空间，等候你的到来。我知道，你确实会在某一天找到我。然后你做到了。
//你认出你童年的天堂。
//然后你逃开了。
//
//ubbal.png
//从远处看会小一些
//
//出口：
//求求你，我一路下行只为找到你。不要那么快离我而去。
//倘若你真得走去某地的话，离开这里就和跳向双星一样简单，
//之后便会发现自己回到了以前的位置。
//不必害怕，这是你的回忆，你可以控制的。
package lvls2x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl250{}