//Level 241
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//Level%202411
//Level 241中较为明亮区域的照片。
//
//Level%202412
//Level 241中放着笼子的房间的照片。
//
//Level 241是后室的第242层。这是一个看似无穷的区域，里面有很多与狗有关的房间，特别是一个收养中心和一个流浪狗收容所。该层级似乎位于Entity 84毛发中央的口袋空间中。
//
//描述：
//Level 241由这个奇怪的层级内的两个独立区域组成，如下所述。这两个区域都与驯化后的犬科动物有直接关系，尚不清楚这是否是由于进入该层级的实体，Entity 84，所导致的。在任意的时间点，整个层级会震动，这可能与Entity 84的动作有直接关联（参见M.E.G.：Log 5423）。整个层级都充斥着狗的呼吸和皮毛的气味。由泥土组成的爪印也可以在整个层级中被随机的找到。尽管存在这些迹象，但仍无任何种类的活着的犬科动物被发现。该层级中的实体数量低于大多数层级，尽管这两个区域的实体都很少，但在流浪狗收容所中更常见些。
//
//收养中心：
//收养中心是Level 241中较大且明亮的部分。该区域为狗提供了许多不同的空着的观赏区，不过这在该层级的其他部分都找不到。该区域的一些房间中有许多窗户，窗户后是一个非常明亮的白色光源，但无论如何它们都是牢不可破的。一些房间里有前台或其他办公文具。计算机正在工作，但没有任何可用的文件。每台电脑上的壁纸都是不同狗的图片。
//
//在此区域有时可以听到狗吠声或犬吠声，尽管它们像是从远处传来的。狗毛会粘在该层级该区域的任何织物上，这包括任何经过的流浪者的衣服。人们呆在该区域可能会感到更加快乐，尽管尚不清楚这是否是该区域故意造成的影响。
//
//流浪狗收容所：
//流浪狗收容所是Level 241中一个黑暗且更具敌意的区域。每个房间的墙上都有许多空的金属笼子，排成一排。里面可能有许多东西，其中最令人心神不宁的是人类的血液。这一部分没有窗户，因此唯一的光线来自天花板上的荧光灯泡。在一些房间里，灯光会变暗，或者根本不亮，建议远离这些房间。其他物品，如真空吸尘器或不同品牌的狗粮袋子，也可以在整个层级中被找到。
//
//与收养中心更有趣的叫声不同，整个流浪狗收容所都能听到咆哮和攻击性的吠叫。这些声音比之前的犬吠声要近得多，如果它们比平时更近，建议立即离开该区域。无论何时，一股无形的力量都会攻击流浪狗收容所内的流浪者。这股力量似乎在抓和/或咬受害者，并试图将该区域内的任何群体分开。
//
//基地、前哨与社区
//该层级没有已知的社区或前哨。
//
//出入口：
//入口
//可以通过深入Entity 84的毛发进入该层级。
//
//出口
//可以通过在该层级的收养中心找到并签署一包领养文件，或从流浪狗收容所区域的金属门离开。两者都将使流浪者出现在Entity 84的附近。
//
package lvls2x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl241{}