//Level 224
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//Level 224是后室的第225层。该层级是一个空置的购物中心，据估计，该层级包含的多个楼层面积共占地100万平方英尺（约92903.04平方米）。
//
//描述：
//Level 224，又被称为 阿瓦隆
//Avelon
// 1，是一个大型购物中心，其中没有任何店面，标牌或可用电力。尽管此处缺乏人工照明，透过天窗依旧可以观测到连贯的昼夜循环。此层级资源丰富，但均受到严密看管，同时通过本层或将本层作为休息点均会是安全的。整个区域由一楼和二楼组成，其中排列着若干商店区、一个美食广场、一个中央广场、一部电梯、以及多个连接两层的楼梯间。
//
//avelon.png
//处于服务时间的主广场。
//
//虽然本层级从表面上看平淡无奇，但这里充满了栖息于此的高智能雀形目鸟类2。它们的文明和智力均与人类不相上下，同时该集群所使用的当地语言同时兼具有声语言与书面语言。能够掌握人类语言的鸟类（主要为鸦科）表现出了使用多种人类语言的能力；它们主要使用英语，其他语言则是由路过的流浪者处学得。
//
//整个建筑由鸟群维护并守卫，店面被改造成生活空间或公共区域以满足它们的需求。这些鸟公开表示会对人类处以友好态度，但它们依旧不愿意让人类停留过长时间。然而，它们非常鼓励贸易的进行，并以此维持他们的前哨。但是，如果他们的同类被外部势力攻击或杀害，他们会蜂拥而上不断攻击肇事者，直至威胁被清除。
//
//交易的首选物品为贵重的金属、宝石、镜子、适于筑巢的材料、墨水、种子、纺织品和适于制造工具的其他材料。鸟群们尤其喜爱闪亮的物体，任何种类的镜子都被认为是高价值的物品。医疗用品也会受其青睐，即便所交易物品的数量与质量并不突出。
//
//得益于鸟群的文化习惯，本层级十分干净整洁，并被它们尽最大努力保持如此。鸟群的食物通常由一个位于采光良好地段的农场生产，农作物包括浆果灌木、青草和结有可食种子的植物。商店和交易站点主要位于美食广场内，但其他销售站点依旧零星布于整个层级。
//
//此层级是一个杏仁水的绝佳获取地，但唯一的获取方式便是与鸟类进行交易。因为杏仁水的来源为食物广场上方被吊起的充气鱼，所以只有鸟类能够获取。这种鱼的异常性质为杏仁水提供了几乎无限的供应量，但它仍然拥有供应量的上限。
//
//fish.png
//一只生产杏仁水的充气鱼。
//
//鸟群自我归类为一个宗教集会，推行自己独特的宗教，并通过一个大德鲁伊主持他们自己的仪式和典礼。他们的宗教以一个实体为核心，该实体通常被称为“造物主”，有时也被称为“见证人”。大多数圣约会议都在一个神圣的地点举行，其位于层级中一个戒备森严的区域，外人可以参观，但不能参与仪式。
//
//在被称为阿瓦隆之门的圣所内，有一个类似于某种传送门的古老机械结构。该结构本身最终被认为毫无实际作用，但此处依旧被奉为圣地，同时被认为此处是本层级中消失的造物主所诞生的假想地点。尽管该区域戒备森严，外人不得进入，但我们仍通过询问轻易地取得了一些讯息。尽管有人建议，这些观点在鸟群的领域内应该得到尊重，但目前依旧没有实质性的证据来支持这些主张的有效性。
//
//与该宗教的推行密切相关地，它们于圣所中种植并培养一种异常霉菌；其均被保存于层级中一个十分黑暗的区域。它被视为鸟群除养殖食物以外的主要营养来源，并作为典型节肢动物类食物摄取的合适替代品。这种真菌会发出酸橙绿色的荧光，重要的宗教人物会把他们的羽毛披上这种彩色的霉菌以示虔诚。虽然它主要被鸟群所食用，但它依旧在鸟群的控制下尽可能少量地成为为人类提供的食物，且很难靠交易得到。
//
//存在，但仅仅作为囚禁于火中秋叶烟锁里的幽灵。
//失而未死，进而脱此境束缚。见证者至亲，察得我于吾之所能与吾之颂歌。闻得吾等未曾忘却，君之作业未曾怠废。吾等所知皆由君赐，愿吾等之爱如君所欲。万物皆在流血，无论如何，万物皆在流血。
//
//基地，前哨与社区
//阿瓦隆住民
//The Avalonians
// / 鸟群
//The Flock
// ：
//位于Level 224的主要社区。
//也被称为阿瓦隆住民（Avalonians）或简称为阿瓦族（Aves）。
//除其高智商之外，在生物学上与前厅中的鸟类完全相同。
//作为一个神权社会，他们选举出的领袖是一只名叫Loric的黑嘴喜鹊（学名Pica Hudsonia）。
//梳羽人
//The Preened
// ：
//一个由4个人组成的小组，永久居住在Level 224。
//尽其所能地试图融入鸟群和它们的社会体系。
//每个人似乎都有某种身体残疾及/或精神残疾。
//他们之间的共同点为他们均在因不善生存切入这个层级后，自愿被鸟群收留的。而他们在进入后室之后的早期便切入了Level 224。
//其中一名人类为一个名叫见证人的孩子，他是第一个被鸟群收留的人。
//对于他们的年龄并不确定，但均不超过十岁。
//他们均于肺部感染了异常霉菌，但除了轻微咳嗽似乎不会对他们造成任何其他损害。
//经进一步的询问和健康检查显示，霉菌与他们形成了共生关系。
//这个孩子是鸟群第一次开始种植并培养霉菌的源头。
//因其在孩子们身体系统中的特殊存在，见证者除水与黑暗不需要任何东西来维持自身。
//尽管由于视网膜色素变性3导致的几乎完全失明，见证者依旧可以熟练地带领他们在层级内轻松前进。
//他们对自己的生活状况很满意，任何把孩子从鸟群中带走的尝试都会以暴力告终。
//采访记录（2021/6/23）
//- 准许...
//记录开始于：18:36
//采访者：M.E.G. Theodore O'Leary特工
//被采访者：Loric Timebound，阿瓦隆的大德鲁伊
//
//Theodore：我非常感谢您能够抽出时间与我交谈。
//Loric：当然，我发现你对我们的文化很感兴趣。
//Theodore：所以，你们在这里多久了。
//Loric：时间本身就很奇怪，在这个维度更是如此，你觉得呢？我可以给你的最好的回答是很多年了，我不是我们集会的第一个大德鲁伊。
//Theodore：如果你不介意我这么问的话，你们共同信奉的是什么样的宗教？
//Loric：我们信奉创造者。见证者创造了这里，我们的家园，它创造了这个地方，而在它的神示中这里就是天堂。不是我的那个叫做见证者的孩子，是原本的见证者。当然，没有什么是完美的。当你接受它的本来面目时，它就变得完美了。我们致力于过上最好的生活，相互支持，正如见证者所希望的那样。你在我们周围看到的一切都正是它想要的。哦，还有亮闪闪的东西。
//Theodore：原来的见证者怎么了？
//Loric：它走了，留不住，它只是寻求慰藉的另一个现实中的碎片。尽管如此，我们还是被赠与了那个孩子，他们看起来很像。也就是说，从人类的角度来看，他们颜色不同、眼睛和肢体的数量也相异不一，但在脸上看到的，完全一致。他们带来了霉菌，我亲眼看到他们被抚养，被教育，被爱着。我丈夫和我收养了他们，虽然他们不会取代我的领导地位，但我也无权要求拥有一个更好的孩子。如果你在我见到他们之前问我想不想要孩子，我会吐口水的！
//Theodore：他们多大了
//Loric：嗯…我们觉得是十岁。他们自己也不知道。
//Theodore：我还想说，我们代表所有经过这里的人感谢你们的热情款待。这是一个很好的变化…对于其他层级来说。
//Loric：不客气，那些交易都很愉快。我相信你明白我们为什么不离开这个地方，不仅仅是这样做是亵渎。外面很危险，太危险了。人类非常愚蠢但是…很勇敢。幸运之神在向你的种族微笑，我只能想象你在外面看到了什么。噩梦，噩梦，噩梦。现在我有事情要做了，你保重，流浪者。
//记录结束于：19:08
//
//总结：鸟群和M.E.G.的关系大体是积极的，这种状态最好保持下去。正因如此，要求所有去访者尊重他们的意见。将被深入研究对他们层级的性质及其存在的基本原理的进一步理解，以潜在地了解一些层级可能的表现。
//
//事故报告（2020/4/11）
//时间： 16:04
//地点： Level 224
//报告开始
//
//两名M.E.G.特工和三名其他流浪者在事件发生时处于于Level 224。这五个人的描述均为一致，并详细叙述了所发生的的事件。情况一如既往，直到第四名流浪者进入层级。进入主广场后不久，流浪者开始宣扬关于杰瑞的言论。几秒钟之内，一群伯劳、椋鸟和红雀扑向受害者并开始啄抓受害者的皮肤。由于无法保护自己免受攻击，受害者的眼睛、手指、舌头、鼻子和喉咙被挖出。在他失去行动能力后，鸟群从他的身上离开并清理了自己身上的血液。 短时间后，该男子在鸟群高呼着的“异端”声中因失血过多而死亡，高呼持续了越两小时。
//
//总结：强烈建议访问Level 224的人不要提及任何关于Entity 7的事情。当被问及鸟群的暴力反应时，许多鸟都回答说他们对Entity 7怀有恶意，并表示“这是对它存在的亵渎”。
//
//发现
//阿瓦隆在一群流浪者于Entity 81中受困之后被发现。他们离开电梯并进入Level 224后便被介绍给此处的居民。在与鸟群简要说明情况后，该小组得以返回一处M.E.G.基地报告以他们的发现。
//
//入口与出口：
//入口
//可通过任意已知电梯或Entity 81的实例到达，尽管你能否到达Level 224是完全随机的。
//
//出口
//通过电梯离开将带你回到其所包含的任何一个楼层。另一个选择为前门，它会将你带出层级。流浪者会被丢到多种不同的层级，根据已知记录记载，包括但不限于Level-35、Level-155、Level-102。
//
//吾曾入境地狱，现而继出高歌。
//拥汝之瑕，识吾之异。虽生于雅堂，桃源未散香。携手共进，环羽巫团，吾等应觅之慰藉源于此，号称家园。此乃祂之赠礼，以吾等其多，我等将悟，爱与繁荣之路。
//
//作者（们）
//« Level 223 | Level 224 | Level 225 »
//
//Footnotes
//1. 口语发音与亚瑟王传说中的地点阿瓦隆（Avalon）十分相近。
//2. 也就是通常所说的“栖鸟”或“鸣禽”。
//3. 一种导致视网膜损坏的遗传疾病。
package lvls2x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl224{}