//Level 223
// 
//
//生存难度：
//等级 𝟤
//
//安全
//不稳定
//极少量实体
//slimyhand.jpeg
//凝胶立方体，构成Level 223的事物。
//
//Level 223 是后室的第224层。
//这个层级是一块悬浮在空中的凝胶大立方体。
//
//描述：
//Level 223是一个几乎完全由凝胶组成的半透明立方体。该立方体的外接圆直径为六百米，在其内部可以找到数个长方体气穴。目前看来，试图在此层级内长时间生存是不可行的。
//
//在整个层级内仅能找到少量的物品与实体。在层级内出现的实体包括肢团以及数个地栖怪——这些实体都处于某种休眠状态，只有完全脱离凝胶之后才会开始攻击。已回收的物品包括钥匙，书本（状态不佳），咖啡杯，空塑料瓶以及各种杂乱的塑料垃圾。
//
//Level 223周围的空间在外观上呈现为一处多云的天空，云层在立方体的正上方与正下方皆存在。天空并无昼夜循环，但其通过颜色的改变模拟了日出，日落以及多处蓝色和绿色的阴影。
//
//slimycube1.jpeg
//从远处拍摄Level 223所得的图像，图像因其在从关卡中切出的过程中拍摄而变得模糊。
//
//被称为“立方体凝胶”（或简称为“凝胶”）的组成Level 223的物体的成分尚不明晰。目前已知的是它并不具有营养价值，对人类的增益或者毒性。
//
//立方体凝胶是一种非牛顿流体，其粘度随着在凝胶上施加的应力而增加。任何停留在凝胶上的物体与生物都会不可避免地被凝胶淹没，但不断地迅速移动可以使得流体变稠密，从而停留在凝胶的表面上。
//
//基地，社区与前哨
//在这个层级里面沒有基地，社區或前艄。然而， thͪᵉ
//th?𝘦
//T—â€hš?舐
//Oe ie ate-esg.p
//ｰ開启文件：hartley-messaﾀｴ.mp3
//
//> 开启文件：hartley-message.mp3
//目
//
//m
//mu
//目
//
//ﾖﾜu前
//目¶????½致
//目前一致的入口与出
//舐•Ř§Ů— ñâmå•????Ř§Ů½ —
//
//i]&l d½ｮ?ss你，v..{{/,? but½?e s|t?wi? ja5?er §s ?e la$t f§ck/½ strﾋŘ
//
//aSdtIHNvcnJ5LiBpIGRpZG4ndCB3YW50IHRvI
//GxlYXZlIHlvdS4gaXQgd2FzIGhpbSBvciB5b3U
//sIHRob3VnaCwgYW5kIHlvdSBhbHJlYWR5IGt
//ub3cgd2hlcmUgbXkgbG95YWx0aWVzIGxpZS4
//
//嗨，这里是Hartley
//我似乎在输入音频文件的时候把数据弄坏了，我的错。
//我正试着修好它，等我一下。
//
//ﾑﾐre eﾙﾀ e?C lo?ei sroO tuﾏ?s
//ﾖﾜﾇﾃe没有ｳｱun//ies 蕘 Oｳ?ﾆst
//ﾑﾐ eocun?卖
//?e baﾑ?s隸
//
//层级内部没有基地，社区或前哨。
//
//入ﾕ軣e
//N入naﾉ｢
//E 入
//
//有好几种方法可以进入这里，我拉着Jasper的手臂绊入一条沟渠进入了这里
//算了。为了我们的安全我不该把这些告诉你们哈哈
//我在等着这个条目刷新
//我会一边等一边说。
//
//无论如何，我连这段文字有没有人看到都不知道。
//我们不断的获得接入的信息：遥远层级的求救，在我们本不应接收到的频率上传来的无线电信号。
//
//昨天，我听说有人死了。他们尖叫出了壹个名字：一个朋友，或是一个亲人，又或是一位爱人，然后他们便沉黙了下来，我无可为力，只能听着这些喊叫，我不知道这些人姓甚名谁，身处何处，或是什么杀死了他们，只听到了他们在死前想到的那个名字。
//在某种程度上，我与他们紧密地联系在一起。他们的最后一句话在我，一个完全的陌生人耳边响起。据我所知，我是唯一一个听到他们的声音的人。
//我尝试打开我的发报机，但我的信号离他们太远，他们无法接收，所以无人得知我正听着他们的话。
//我不想让任何人的言说不被听到，即使我对他们的处境本身无能为力。
//任何人都不该孤独地死去。
//
// 
//
//他也不能。
//
// 
//
//我很好奇在这一段时间里是不是只有我知道这事情，应该不会吧？我在这里度过的时间里，我还见到过几个其他的流浪者。
//
//我认为这个层级，无论它是由什么制成的，都有一种特殊的机制让你获取任意地方传来的信息。我在我的空余时间测试过。
//根据广播位置的距离和传输过来的数据的质量，音频的清晰度似乎上下限差异极大，能够从完全无法理解到几乎无损的程度。声音就在那里，这些人的声音就在那里，穿过鬼知道有多少千英里之外的非线性空间来到我这边。
//
//回到家之后，我应该会把这些事情叫做科学突破。但这些其实，也不能算是科学突破。科学并不总是契合这个地方的运行规律。
//
//我得到了你的信息，V。我的答案是不。
//…
//好吧，我想我把问题搞定了
//看看现在能不能成
//
//基地，社区与前哨
//层级内没有基地，社区或前哨。
//
//slimycube2.jpeg
//从远处拍摄的Level 223 的另一张照片。
//
//倒也不完全是这样。我时常看到几个人在这里进进出出。
//我的意思是，Jasper和我待在这里，有好几周了？还是几个月了？
//我应该可以对此保持讠成实吧？又寸吧？
//这有点吓人。
//无论我在这里待了多久，都没有什么真正的変吪。
//哊时候我认为我与他之间的关系发生了质変。比如他自己，比如他认出和记住了我。
//绝对是这样。
//
//有一天，他伸出了手，他用他的手触踫我的脸，看着我，真真切切地在看着我。
//我无比怀念着事物在过去的样子，而它们一去不复返。
//
//入口与出口：
//入口
//对不起，不。为了我们的安全已经编辑掉了。
//切入Level 43的任意一个水族馆，可以进入位于层级下部的气穴。闭上眼睛，潜入Level 11的喷泉里，有小几率进入此层级。爬上Level 105的任何一扇上部窗户，并把自己压入彩色玻璃也是一种可行的进入方法。
//
//出口
//一路下沉到立方体的底部会导致进入层级的流浪者被传送到一系列特定的层级。从某一特定点处离开的流浪者们有大概率被传送到同一层级。这一策略尽管是长久可用的，但也有其风险：浸没在凝胶的实体可能会进行攻击。此外，流浪者可能会因为无法闭气足够长时间而无法在窒息前穿过凝胶立方体的底部离开层级。
//
//我们可以随时离开，但在Jasper痊愈之前我不能带他走。
//我看见你了。
//哈！那就有趣了！
//这让我想起了我用发报机听到的声音
//终于，这次说话的人是我自己。
//
//我还知道你就在那里。
//
//那不是你吗？我看到你的光标悬停在页面上。
//
//如果你不介意的话，我想让你帮助我，尽你的一份微薄之力
//告诉别人我们的事情，告诉他们不要靠近他。
//感谢你的帮助 :) - Hartley
package lvls2x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl223{}