//Level 270
// 
//
//生存难度：
//等级 4
//
// 
// 
// 
//Level 270是后室的第271层。
//
//描述：
//Level 270的景观是广阔而空旷的，又长又深的河流和池塘融合在一起。这里存在的地形数量很少，只有几个悬崖和陡峭，它们相距数英里。在地平线上看到的由“星星”发出的红光由于其令人困惑的特性，给流浪者在野外导航带来了麻烦。据报道，来自恒星的红光通过创造几乎无法与现实区分开来的动态视觉错觉，在 3 维空间中扭曲了流浪者的空间感。在日落期间，所创造的红色氛围似乎更加强大和广阔，表明在那个特定的时间里太阳活动更高。
//
//Level270
//Level 270的风景
//
//在Level 270中发现的池塘和河流中含有高浓度的钾和磷等对肾脏有害的矿物质。经常饮用这种液体通常会导致血尿和几个小时后轻度至重度的肾痛，并且经常被报道会增强该层级的视觉幻觉。进一步的研究发现了一种额外的无机元素，被认为是导致这些症状的主要原因。已观察到该元素在暴露于红色环境光时会生长，而在远离阳光时会收缩。这种未命名矿物的大小被认为与这颗红色太阳的活动大致成正比。这进一步表明它们彼此之间存在着密切的相关性。然而，由于研究成员之间反复的猜想冲突和分歧，它经常被忽视。虽然这种化合物主要存在于液体区域，但任何设法进入 Level 270的流浪者都会在他们的枕叶中发现这种矿物质的痕迹。在一篇论文发表后，出于好奇心而进行的大量科学研究证明了这一点，这些研究表明这些化合物可以快速出现在生物密封的大脑中。
//
//Level 270的整体大小目前未知，但肯定是有限的。许多流浪者报告说，影响他们的重力与位置无关。1除了其自然形状外，Level 270还有一个强大的磁场。它被认为是由行星核心中的铁凝固以及行星赤道的旋转引起的旋转电流（电磁）产生的，使指南针导航更容易一些。
//
//据报道，实体会频繁出现，并且通常是在Level 270死亡的主要原因。已确定存在于Level 270的窃皮者、钝人、猎犬、肢团以及极少数情况下的死亡飞蛾。对一些人来说，这些实体经常出现在更黑暗和更潮湿的地方。由于Level 270星球的缓慢旋转，当在该层级中徘徊足够长的时间后，可能会经历夜间阶段。到了夜间，景观往往会变得非常黑暗，这些条件被认为允许新实体产生。由于Level 270的缓慢旋转，夜间估计持续 24 小时2 ，并且温度通常会下降到 -15°C (5°F)。
//
//五月事件
//2012年5月，在夜间开始出现模糊的活动后，一群探险者突然消失了。团长在同行中很有名气（根据他的记录），他的背包里总是藏着一本个人日记，在探索层级的时候，他会在里面有条不紊地列出每天发生的事情。在一次事故导致他的团队在Level 10被困数月后，他们设法通过在Level 10的障碍外游荡找到了出口，这会送他们到Level 270。由于笔迹不佳，可能是由于异常强大的幻象，第一次描述Level 270的环境无法完全理解。不过，在后面的部分中，清晰度有所提高，表明他在这场磨难中与他的团队分开了，并且在他附近找不到任何他们的踪迹。
//
//放弃搜索后，他搭起了帐篷（天黑时随身携带）。抱怨着外面传来的寒冷和独特的、重复的尖叫声，他睡着了。然而，在他估计醒来的时间里，字迹突然发生了变化，与他的条目有可疑的相似之处。除此之外，据称他还发出了许多试图逃离帐篷的企图，但没有证据。这本书随后被一个名叫斯特凡的流浪者在观察到位于溪流水道旁边的浅水区域内被遗弃的帐篷后获得。由于这些断言的大写以及其在页面后面的任意对角线图案，日记中已被识别的少数词仍然不被理解并被认为是最关键的。3
//
//深红的日落
//RedSunset
//红色的夕阳
//
//最近，有新的报道称母星变得更加活跃，在日落和日出期间的地区危险更加普遍。强烈的深红色光芒及其影响导致许多人感染了一种新发现的疾病，这种疾病是Level 270独有的，不能在Level 270之外感染。常见症状包括视力缺陷、增强的动态听觉和视觉错觉、剧烈呕吐、食欲不振，并且无法识别单词。4如果不使用杏仁水治疗，它会达到致命的状态，最终因完全失去自控力而死亡。在日落和日出期间保持遮盖很重要；建议立即避难。这种危险增加了围绕来自母星的光特性的问题数量和多样性。
//
//基地、前哨和社区
//目前在Level 270中没有理论上存在的基地、前哨或社区。
//
//入口和出口：
//入口：
//理论上，入口位于Level 10的更深处。然而，进入的记录并不一致，大多数报告声称在进入 Level 270之前看到地平线上出现红光。尽管普遍认为，只要深入到Level 10，就有证据报告进入Level 270
//
//出口：
//在Level 270发现的唯一已知出口会在很短的时间间隔内改变位置，并且据报道极难逃生。这个出口总是在河底下找到，而且非常微妙，而且与在后室中发现的其他出口不同，它是独一无二的。这些出口类似于一个由钢制成的小开口，需要流浪者在有限的时间内通过安装在结构中的计算机将简单的密码信息翻译成普通文本。成功通过，流浪者将立即被传送到终点。
//
//作者及译者信息
//« Level 269 | Level 270 | Level 271 »
//
//Footnotes
//1. 由于重力影响的平衡分布表明，相对于地球表面，距地球中心的距离是均匀的。
//2. 日/夜周期为 48 小时，或 2 个正常昼夜周期。
//3. GUR FHA VF TBVAT GB RKCYBQR
//4. 这些症状是慢性的。
package lvls2x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl270{}