//Level 290 - “多维影院”
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//multiplex.jpeg
//Level 290中发现的一个大厅。
//
//描述：
//Level 290外观似是一个无限的电影院。Level 290的不同部分拥有多种建筑风格，并专门包含了普通电影院中常见的房间和走廊。
//
//本层级的布局比普通的前厅影院要复杂得多，包括走廊突然中断，两扇紧挨着的门却通向本层级完全不同的部分。投影仪和售票处似乎总是处于工作状态，尽管实际上本层级没有任何实体来维护它们。爆米花和其他零食经常被观测到散落于地板，在观影厅里尤为频繁。无从得知这些零食究竟是来自之前的流浪者还是作为本层级的自然特征存在。
//
//电影持续在观影厅播放，对多个放映厅的检查表明它们似乎均在永不停止地连续播放。Level 290最值得注意的一点是，其内部放映的电影通常与现有的电影相似，但拥有明显的区别。
//
//基地、前哨和社区：
//层级中不存在正式的基地或前哨。然而，一个名叫格雷戈里·麦金农的流浪者将本层级作为自己的家，并将自己的大部分时间用于观看电影。他十分友善，经常帮助其他流浪者找到层级的出口。
//
//入口与出口
//入口：
//Level 68中的金属门会通向这里。
//Level 177中的标准出口有时会通向这里。
//出口：
//于本层级找到的红色的门将会通往Level 74
//当电影屏幕正在播放与Level 104相关的影剧时，穿过电影屏幕则会到达该层级。
//偶尔，本层级的放映厅中的门会通向Level 142。
//部分电影记录：
//这是一份Level 290于多个放映厅播放过的精选电影记录。其中大部分由格雷戈里·麦金农编辑。电影的扩展日志可以在此处找到。
//
//影名：沉睡（Sleep）（1964）
//
//原片概要：一部五小时的实验性电影，拍摄了由约翰·吉奥诺扮演的一个男人从不同的角度的睡眠。影片的许多部分被循环播放或多次使用。
//
//值得注意的变化：在电影的第三个小时，吉奥诺醒来，离开了镜头。在此之后，电影继续正常进行，仅继续展示一张空床。
//
//影名：M就是凶手（M）（1941）
//
//原片概要：一部黑白惊悚片，围绕试图寻找并抓获连环杀手汉斯·贝克尔特（由彼得·洛饰演）的故事展开。
//
//值得注意的变化：这部电影直到16分钟的标记之前与原片完全相同，正如原片一样，当贝克尔特用口哨吹起由爱德华·格里格所作的“在山魔王的宫殿里”。然后他便被许多骨骼生物追赶，最终被杀死。电影的其余部分均采用了与原片完全相同的镜头，除了电影中揭示汉斯·贝克尔特之死的真相的部分。该尝试最终没有成功，电影在第111分钟突然结束，寻找最终没有明确的结果。
//
//影名：大破吸血僵尸集（Blood of Dracula）（1974）
//
//原片概要：一部低成本恐怖电影，由尤杜·奇尔扮演的德古拉伯爵需要引用处女血以维持生存。由于他的祖国缺少处女，被迫搬到意大利。他搬进了迪菲奥里家族的庄园，打算引用他四个女儿的血。其中两个女儿比他们表现出来的更加淫乱，她们“被污染”的血液削弱了他的力量。德古拉最终被揭示出吸血鬼的身份，并被庄园的杂工肢解。
//
//值得注意的变化：这部电影直到德古拉来到意大利之前均与原片无二。在这个版本中，它暗示了庄园的勤杂工马里奥辞去了庄园的工作，转而离开去领导他在原片中所展现出自己渴望的马克思主义革命。正因如此，四个女儿仍是处女，而德古拉可以轻松地饮用她们的血。电影的其余部分遵循了与1931年电影《德古拉》非常相似的情节，伯爵被各种镇民追捕，以他和范海辛之间的对峙结束，导致德古拉的死亡。
//
//影名：未知
//
//原片概要：N/A
//
//值得注意的变化：这部17分钟的电影看起来像是用低质量磁带拍摄的家庭视频，以一个小孩打开圣诞礼物为主题。孩子打开第一个礼物盒，却发现里面装满了煤，于是大哭起来。电影的其余部分是父母安慰孩子。
//
//影名：好莱坞上空的飞碟（Flying Saucers Over Hollywood）（1992）
//
//原片概要：关于1957年外星人入侵题材电影《外太空计划9（Plan 9 From Outer Space）》的纪录片。它详细描述了导演埃德·伍德的生活，以及这部电影持久的文化影响。
//
//值得注意的变化：这部电影与原片有很多类似的地方，除了每个参与的人都表现得好像“外太空计划9”本身是一部关于真实外星人入侵的纪录片。这部电影深入探讨了埃德·伍德如何在捕捉镜头时避免引起电影中各种人物的注意，包括对藏身之处和简易迷彩服的详细描述。值得注意的是，瓦姆皮拉，电影演员之一，并没有参与影片中的采访，因为据说她死于1956年，并如电影中所描绘的那样短暂复活。
//
//影名： 未知1
//
//原片概要：这一集的原始剧情不得而知，但这部剧总体情节为由无面灵主演的情景喜剧，并与许多与此类节目一样充满陈词滥调。
//
//值得注意的变化：虽然这一集的所有对话据报告称都是由面带微笑的“演员”所发出的不自然的鸟鸣声，但观众报告称自己能够通过一种未知的机制本能地理解这一集的情节。
//
//这一集以其标志性的空白标题画面和主题曲开场，然后过渡到第一个场景。这一集的其余部分讲述了两个年轻的无面灵寻找一种被称为“婴儿火车”的罕见神秘生物。在一些玩笑后，他们相信自己发现了上述的婴儿火车，最后发现它只是一只邻居的猫，或是一辆普通的火车，于是他们放弃寻找，回到家里，并宣布婴儿火车只是一个传说。
//
//最后一个镜头中背景逐渐放大，一辆上面有人类婴儿脸的小火车行驶在他们的视野之外。
//
//影名： Party Rock Anthem（2011）
//
//原片概要：美国流行二人组LMFAO创作的6分钟音乐视频，展示了一个反乌托邦的未来，每个人都被他们的单曲“Party Rock Anthem”在发行后的一个月“感染”。这些人的行为就像跳舞的僵尸，每天都跟着歌曲“shuffling2”。这两个人不得不“配合”以避免人们感染他们。他们最终屈服于派对摇滚。
//
//值得注意的变化：这个版本有103分钟长，发生在LMFAO成员处于派对摇滚引起的昏迷状态中。它的主视角跟随了一个完全不同的角色，他们试图从僵尸般的派对摇滚入侵中保持安全。电影以两个主角（由约翰·马尔科维奇3和杰米·李·柯蒂斯4扮演）试图用各种简易手工武器击退一大群派对摇滚者的对峙结束。他们最终屈服于派对摇滚，电影开始播放职员表。
//
//作者
//« Level 289 | Level 290 | Level 291 »
//
//Footnotes
//1. 被认为是与Level 104有关的电视节目的一集
//2. 译注：EVERY DAY I`M SHUFFLING
//3. 译注：代表作：《贝奥武夫》、《温暖的尸体》
//4. 译注：代表作：《月光光心慌慌》
package lvls2x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl290{}