//Level 226
// 
//
//生存难度：
//等级 3
//
// 
// 
// 
//描述
//Level 226是后室的第227层。这一层似乎是一片虚空围绕着一片地板，地板上有一张中世纪风格的桌子，桌子似乎是无限长的，桌子上摆着美味的食物，排列得井井有条。
//
//Level 226是以白色虚空的形式围绕着一块质地未知的地面，因为地面上覆盖着粪便，但这种粪便除了难闻的气味外，没有任何危害，但是如果接触这些粪便后大约两个小时后可能会致命。此层级似乎是无限长的，地板上放着一张陈旧的木桌，就像一张与地版一样长的老式破旧木桌。这张桌子上摆着各种各样的食物，很像中世纪宫廷里吃的食物，装有食物的盘子不能被人移动或损坏。
//
//这一层级上的实体很少，唯一存在的实体是一个穿着与高端餐厅服务员相似的人形实体，这些实体会直接地出现在距离桌子约10米的地方，想要拿走被吃过的食物，或者将其他装有食物的盘子放在刚才被拿走盘子的位置。
//
//这些实体是完全温顺的，除非有人的行动阻碍了他们的行动，无论是试图阻止他们从餐桌拿盘子，还是通过从他们手中抢走食物。他们都会被激怒，被激怒的实体将以暴力的方式肢解攻击者，一旦实体被激怒，防止被攻击的唯一方法就是远离实体，这并不难，因为无论它们在干什么，这些实体都只会以行走的速度接近攻击者。被激怒的实体在追逐大约一英里后就会放弃追逐，然后就会恢复在被激怒之前的状态。有趣的是，如果有一大部分食物被浪费，实体就不会被激怒。
//
//这些食物被摆放在桌子的白盘子上，与桌子上肮脏的环境相比显得格格不入，桌子旁没有座位。桌子是不可毁坏的，但桌子上的污渍都会在15秒内消失。桌子上的每道菜的份量各不相同，每个盘子的大小完全相同，人类无法移动，而且不可毁坏。
//
//有一位未透露姓名的探险家所说，这些食物的外观被认为是“非常有食欲的，尽管你已经吃的很饱，但是你还是不介意吃下去”，这表明了这些食物有着巨大的诱惑力。当站在桌子旁边时，食物的香味可以被闻到，掩盖了粪便的气味，进一步增加了人们吃它的欲望。每一道菜都有能力将你带到另一个层级，或者对身体产生负面影响，这里的食物会有一种超凡脱俗的味道，这表明了这些食物并不是来自现实世界，只是看起来像是现实世界的食物。这些食物除非只吃了一部分，否则不会变质。桌子上也可能会出现一盘粪便，食用它是完全安全的，而且没有味道。
//
//基地、前哨和社区
//目前本层级没有已知的前哨站或社区。
//
//一些食物的影响
//这里的一些食物都有一系列不同的效果，一旦吃了就会立即生效。不过，不会因为只吃一道菜，就得的这菜的所有效果。有些菜的效果仍是未知的，下面是已知的效果:
//
//烤鸡肉
//切入至Level 20
//会有流感的症状
//剧烈的胃痛
//剧烈腹泻
//不同种类的牛排
//切入至Level 6
//心脏骤停
//会导致三分钟内死亡
//严重的肺部和喉咙出血，会在接下来的一小时内导致死亡
//各种意大利面
//切入至Level 60
//切入至Level 52
//土豆泥
//切入至Level 58
//重度偏头痛
//支气管炎
//失明
//未知物种的鱼
//可能会导致当场死亡
//烤面包
//切入至Level 27
//切入至Level 23
//切入至Level 41
//喷射性呕吐
//晚期心境性失眠
//火鸡腿
//视觉和听觉的丧失
//一种不知名的蔬菜
//切入至Level 10
//健忘症
//消化道破裂，导致死亡
//入口与出口
//入口
//在任何层级里，营养不良或渴望食物的时候睡着可以来到此层级。也可以通过想象自己在Level 18的一场盛宴中进入，除非你想象自己一个人吃饭，否则是不会来到此层级的。
//
//出口
//有很多方法可以离开，尽管大多数方法可能都是有问题的。尤其是冒险食用这些食物，然而，对于大多数食物来说，这不值得冒险，因为有些食物只会把你传送到危险的层级，或者会导致严重的突发疾病，所以建议只吃其中的一盘意大利面来离开这里。重新进入入口门将切入Level 998，但不建议这样做。从地面边缘上掉下来，会掉进下面的白色虚空中，可能会把你送到Level -9，这很容易做到，因为入口门就在白色虚空的边缘。在桌子底下睡着会把你送到Level 226.1。
package lvls2x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl226{}