//Level 280
//下雨了 。潮湿的地面在我脚下咯吱作响，使得那些跟着我的生物很容易知道我在哪。而同时，我不知道他们在哪，也不敢回头看 。我大概无论如何也是看不到他们的，因为这个层级实在是太黑了。也许这些生物就在我身边，已经准备好结束我这悲惨的旅程。也许我已经成功的在森林里摆脱了那似乎会永无休止的追赶我的生物。
//
//尽管这片森林很不寻常，但它仍让我想起了我的童年。我产生了一种奇怪的怀旧感，想起了我的父母曾经经常带我去森林玩，那里平静而祥和。虽然我不喜欢采摘蘑菇和浆果，但是我的父母总能用他们做出美味的食物。即使森林中下雨了，我也总是感觉很安全，因为我的父母在那里，牵着我的手，为我撑着伞。
//
//但是，我的父母不在这。我身处一片无垠的森林中，而且可能正被一大群怪物追赶着。我已经精疲力尽了。然而，在我生命中最这黑暗的时刻，我看到远处有一盏灯。这使我高兴起来。
//
//我开始仔细观察，这光线似乎来自森林中央的一个小茅屋中的一盏灯，在小屋的一侧有一扇门。我几乎没有选择，要么进入茅屋，要么面对死亡。我选择进入茅屋，然后迅速关上了身后的门。我很感谢这个茅屋，因为只过了一会儿，我就听到了门外响亮的砰砰声，好在实体未能成功破门而入。
//
//我开始审视自己所处的地方。我似乎在一个楼梯间，这个楼梯间好像通向一个巨大的、黑暗的房间。我在犹豫要不要去那，但门上的巨响足以说服我。当我沿楼梯下行时，我意识到我实际上并不在一个房间里。相反，我仿佛置身于一个充满雾气和楼梯的巨大虚空之中。我已经到达了一个新的层级。当我回头看时，我发现这一层级的入口已经消失了。
//
// 
//
//生存难度：
//等级 2
//
//坠落危险
//视力受阻
// 
//darkstairs.png
//一位艺术家复刻的Level 280
//
//Level 280 是后室的第281层. 尽管由于其独特的特性，该层级的大部分地方都是危险且不适合居住的，但该层级的底部平台被认为是安全的。一个用于研究此层级和帮助流浪者的M.E.G.前哨站就位于那里。
//
//描述:
//Level 280是一片充满浓密雾气的巨大的虚空，这使得流浪者们很难看清远处。此外，虚空中还有由未知种类的岩石制成的楼梯；虽然所述岩石的质地各不相同，但各个楼梯的形状和大小总是差不多的。它们一起组成了不同长度的较大的楼梯，并由小的平坦平台连接起来。连接到一个平台的楼梯通常不止一个，流浪者便可以选择前进的方向。
//
//异常影响
//但是，流浪者无法在整个层级自由移动。这是因为流浪者们几乎无法爬楼梯。当一个流浪者试图爬楼梯时，他们会感到极不情愿。即使流浪者能够克服这种感觉，在所有的已知案例中，就算有人能爬上几级楼梯，也会非常累。因此，不建议流浪者尝试爬楼梯，所有的已知尝试最终都被证明是徒劳的。
// 
//
//呃…看来我只有一条路能走了。当我下楼梯时，我听到了一些奇怪的声音，这声音让人想起了风。我看到在雾中深处似乎有什么东西在动。然而，我看不清那么远的地方。
//
//突然，我来到了一个小而平的平台。这里的路分为几条。我内心深处有一种想下楼、到那片黑暗和雾气中去强烈的愿望，我几乎就要这样做了，但我停了下来。我觉得下楼梯会让人感到恶心或是被背叛了，就像我已经去过那里，看到了它那儿有什么。所以，我决定上楼。我感到一种奇怪的懒惰感，一种不想攀爬的感觉，但我克服了它。
//
//向上的第一步很容易，但是我感觉很无聊、几乎毫无意义。我没理会这种感觉。然而，下一步要困难得多。就好像楼梯不让我攀爬一样。这真是奇怪，我迈出了第三步。
//
//突然, 一阵困意袭来. 我尝试保持站立, 但是我还是摔在了平台上，而且正对着那向下延伸的阶梯。或许我应该去那。 那里一定很危险, 或者只是因为攀爬对我来说太难了。当我向上爬楼梯时，我感到很恶心并且感觉自己已经没有能力继续爬了。我停了下来。
//
// 
//
//雾气
//Level 280被浓雾所笼罩。雾使光源失去了其应有的作用，并极大地降低了能见度，这使得确定自己的方位变得极其困难。不过，雾也有点用处，因为它会发出微弱的光。这使得流浪者即使在没有任何光源的情况下遇到它也可以看见它。
//
//Level 280的内部结构千变万化。然而，雾通过降低此层级的能见度掩盖了这一点。虽然流浪者附近的楼梯似乎总是静止不动，但通过看向雾气深处，有时可以看到楼梯在旋转和移动，有时似乎有实体在这些楼梯上走动。
// 
//
//不知怎的，这种感觉似曾相识，就像我被卡车撞了一样——不是身体上的，而是精神上的。我觉得我对此无能为力。站着不动似乎比走路更费力，于是，我又退了一步，我感到无能为力。我越来越深地陷入这片雾气之中，越来越深地陷入不确定之中。然而，当我抬头时，我又看到了那种不确定性。就好像我被四面八方的不确定性所包围着。
//
//我再次向下迈出了一步。我不知道为什么，但这让我感觉很糟糕。我觉得自己一文不值，根本无法战斗。也许是因为我很虚弱，也许是因为我不适合反抗。我不知道下面有什么，但我觉得它在召唤我。我跟它在后面，就像一只虫子被蜘蛛引入陷阱，一只令人讨厌的虫子
//
//放弃的感觉很好。我下了一级又一级的楼梯，突然遇到了一个平台。有好几座楼梯通向这座平台，但只有一座是向下。我像之前一样下楼，但只下了大约十步，就听到了一阵奇怪的声音，我停了下来。我向上看去，看到有什么东西在雾中移动。那个东西下了几级台阶，来到我刚站的平台上。它停了下来，我看到了它的形状。如果有的话，我会看到的。那其实只是一个黑色的轮廓。
//
// 
//
//坠落危险
//下楼梯时要小心谨慎。因为由于该楼梯没有栏杆，所以很容易掉下来。有时，掉下来的流浪者可能会安全地降落在下面的楼梯上。然而，附近的楼梯有时可能太低了，以至于掉到楼梯上可能会使流浪者受很严重的伤甚至杀死流浪者。坠落后也有可能错过所有楼梯，导致流浪者最终掉入下方可能充满雾气的无尽虚空。目前还不知道流浪者在那会发生什么，然而许多人推测他们会死于窒息，因为浓雾和高速的坠落会使呼吸变得越来越困难。
//
//实体：
//Level 280只有一种原生的实体。但是，有的时候其他层级的实体会进入Level 280。尽管如此，他们只会暂时停留，因为本层级的实体对其他层级的实体怀有敌意。
//
//本层级的原生实体称为“追逐者”。有时，当流浪者下楼梯时，可能会出现追逐者。追逐者将站在流浪者所在楼梯的顶部。如果流浪者静止不动，无论静止多久，追逐者也会静止不动。然而，如果流浪者哪怕只向下走一步，追逐者也会开始追逐他们。
//
//对付追逐者的最好方法就是逃离他们，这可以通过跑下楼梯或跳到较低的楼梯上来实现。尽管理论上认为使用特定装备防御追逐者是可能成功的，但所有已知的的尝试都被证明是徒劳的。虽然开始时逃跑似乎是不可能的，但并非如此，追逐者无法急转弯。如果流浪者能设法跑够足够长的时间，追逐者会自行坠落。
// 
//
//我盯着这个生物，想发现那怕一丁点熟悉的痕迹，但并没有。它站在我上方的楼梯上，威胁地盯着我。这轮廓毫无特点，完全是由黑暗构成的。我有一种想避开这黑影的强烈冲动。令人困惑的是，这个生物似乎被冻住了，似乎在等待什么。
//
//我厌倦了就这么站着，我想向下继续前进。然而，我向下刚迈出一步，就发生了一件事情——这个生物开始快速向我移动。我开始奔跑，反击似乎是徒劳的。
//
//一步一步地，我深入雾中。追逐已经持续了一分钟，并且没有停止的迹象。绝望中，我遇到了一个小平台。我迅速改变了前进的方向，同时转头。我看到了那追逐我的黑影无法急转弯，并被抛入浓雾中。
//
//我松了口气，我终于可以休息一下了。然而，我的腿不配合我。他们继续下着楼梯，就像他们之前已经走过的那好几分钟一样，我必须集中精力才能让他们停下来。停下来之后我才意识到我是多么的累，但站着不动时，我的精神更加疲惫。
//
//这感觉很熟悉，我不知道我要去哪。这儿到处都是雾，使我处于无尽的黑暗中。似乎只剩下一条路了。因此，我准备继续向下前进。
//
//然而，就在我就要这么做之前，我感觉身后刮起了一阵风。我抬头一看，另一个黑影站在楼梯的尽头。它看起来与之前那个略有不同，但很相似。我不想再被追逐了。然而，我似乎没有选择。
//
//我暂时无法保持镇静，因为我感到了一阵召唤。下面的虚空非常诱人，使我想下楼并消失在雾中。但是，在这个层级中还有另一阵召唤。它就像小屋上的灯，给我一种安全感。它让我想起了我的童年。下雨时，我的父母总是在那里，在雨伞下保护我的安全。
//
//另一阵召唤与来自下方召唤不同，它更微弱，当我集中注意力时，我能听的清楚些。与下面来自虚空的召唤不同，这一召唤来自上方，来自一个安全的地方。然而，有些东西阻碍了我——那个黑影。它一直一动不动，但我知道它已经准备好追我了。
//
//也许我可以尝试去追寻那阵召唤。我挣扎着成功地迈出了一步。但是，那生物仍然保持静止。我盯着那个生物，又向上迈了一步。这比之前的一步容易得多。慢慢地，我开始走了。然后，我开始跑了，但那黑影仍然一动不动。
//
//终于，我站在了黑影的正前方。那太可怕了，但不知怎么的，我的内心非常平静。但是它阻断了这条路，我恐惧的停了下来。然而我还是做到了：我推了这黑影一把，它从楼梯上跌落下去，消逝在无尽的雾与黑暗中。
//
// 
//
//基地、前哨和社区:
//咖啡馆
//在向下走足够长的时间后，楼梯开始聚集在一起，离的越来越近。最终，流浪者会到达一个面积约为半公顷的大平台，且平台下没有楼梯。虽然该平台是用石头做的，但被污垢所覆盖。尽管该层级只有无尽的黑暗，但平台上生长着青草和树木。此外，平台上的雾量也大大减少。追逐者会试图避开平台，且他们无法触碰到该平台；相反，他们会直接穿透过此平台。
//
//平台顶部有一个以咖啡馆形式设立M.E.G.前哨站。目前尚不清楚该咖啡馆是否属于此层级的一部分，也不知道它是否是由人类建造的。M.E.G.前哨站的平均人口为10人，但如果其他地方需要人手，最少仅需5人即可维持其运转。
//
//当M.E.G.首次发现该咖啡馆时，找到了几个小袋子。袋子里装的是小块碎砖块。由于人为失误，其中一个袋子里的物品被意外地丢弃在咖啡馆外的地面上。第二天，人们在该地点发现了一个不寻常的地层结构，于是M.E.G.决定每天对该地点进行监测。已根据事件编译日志。
// 
//
//隐藏日志条目
//第1天：
//该地点出现由微小的砖块组成的小茎状结构。有时，该位置似乎会出现白色的火光，但它们总是会很快的消失。
//
//第2天：
//茎状结构变大了，现在出现了更多的茎状结构，其中一些的顶部有浅孔。白色的火花似乎更常见了，而且会停留更长的时间。
//
//第3天：
//这些茎状结构在一夜之间显著变大。其中大多数的内部是中空的，且通过顶部的一个孔与外部相连。已观察到火花在该结构表面移动。在监控该地点的时候，一股烟雾从其中一个空心砖制结构中冒出。它们获得了“管道”的绰号。从现在起，这个绰号将用来指代它们。
//
//第4天：
//
//管道的数量似乎没变，然而，较小的管道已经变大，大多数管道现在的大小都差不多。烟雾似乎冒出得越来越频繁。它们的成分似乎与Level 280其他地方的雾很相似。
//
//第5天：
//又出现了几条新管道。现在烟雾不再以团状的形式出现，而是像连续的气流那样从管道中飘出。
//
//第6天：
//现在，管道越来越多了，它们释放出更多的烟雾。现在，地面上出现了一层很薄的烟雾，但火花似乎不太常见了。
//
//第7天：
//管道似乎越来越大了，它们周围高达1米的区域都充满了烟雾。今天根本看不到火花，那儿的职员形容当时的气氛令人沮丧。
//
//第8天：
//烟雾中出现了微弱的火花。除此之外，许多人还看到了同样大小的阴影。烟雾继续从管道中冒出，现在烟雾比以前冒的更高了。
//
//第9天：
//烟雾中的火光变得更亮了。大约傍晚时分，当一名职员在监视该地点时，烟雾中冒出了几道火花。它们位于由类似组成Level 280的楼梯的物质组成的微型楼梯顶部。火光继续在烟雾上方建造楼梯，之后它们意外地停了下来，消失在稀薄的空气中。
//
//第10天：
//实验结束时，人们取下了这些管道及其周围的土壤，将其放入焚烧炉中焚烧，并把剩下的残渣放入一个盒子中。观察一个月后，由于残渣无异常表现，该盒子被埋在地下，至今仍保留着。
//
// 
//
//我感到如释重负。我第一次真的相信我能做到这一点：我可以爬这些楼梯了。我不知道我会发现什么，但我充满希望。我又开始缓慢的走起来。我看到远处的楼梯在移动，但它们被雾遮住了。在楼梯上有移动的黑影。这仍让我害怕，但我还感到安全。
//
//我向上走了许多略有不同楼梯，穿过了许多平台，终于到达了一个不同的地方。我在一个大平台的边缘，许多楼梯从下面连接着它，但是，只有一个是向上延伸的。这个楼梯比我在这一层级看到的任何其他的楼梯都大。我看不到这个楼梯的尽头，它一直延伸到雾中。
//
//我别无选择，又开始爬楼梯。谢天谢地，这个楼梯并不是特别陡峭。然而，我仅仅爬了几分钟，就听到身后有风吹过。我转过身来，看到十几个黑影从雾中浮现出来，追着我。为了逃离它们，我跑了起来。然而，这些黑影的速度太快了，即使我在楼梯上飞奔，它们还是在慢慢的靠近我。突然，我感觉有什么冰冷的东西抓住了我的脚。
//
//在惊慌失措中，我试着用另一只脚继续跑，但却摔了个狗啃泥。这些黑影又抓住了我的另一只脚，开始把我往楼梯下拉。我紧紧抓住楼梯。即使我感觉到他们仍然在拉我，我还是将身体稳住了。我竭尽全力，把自己拉到了下一级楼梯上，然后又是一级。尽管有几十个黑影拉着我，但我仍然很顽强。我不顾身后的黑影，继续用手爬起楼梯来。
//
//突然，我设法摆脱了他们。我一刻也不停，立即继续奔跑。那些黑影还在追着我，不过，我知道没事。慢慢地，雾开始变得不那么浓了。一切都开始变得明亮起来。最后，我出乎意料的到了在了这个层级的表面。
//
//光射入了我的眼睛。雾已散去，可以看见那空无一物的天空。楼梯在我刚刚进入的这片雾海的上方继续延伸。我转过身去，看到那些生物正试图继续跟着我。然而，当它们从雾中出来时，阳光填满了那些黑影，它们消失在虚无之中。我终于安全了。短暂的休息后，我继续向上走。我没有看到楼梯的尽头，但我觉得我离它不远了。
//
// 
//
//入口与出口:
//入口
//Level 54 中有通往这一层级的门。
//
//此外，还可以在Level 39、Level 129或Level 563等层级中找到通往该层级的门，这些门通常附在小木屋上。
//
//出口
//在底部平台上靠近 M.E.G. 哨站的地方有一个小山洞。进入洞穴将通向Level 8。这是目前Level 280唯一已知的出口。
// 
//
//我终于到了楼梯的尽头。突然，楼梯断了，楼梯边上挂着一把伞，我就坐在伞旁边。
//
//我拿起伞
//
//空无一物天空很美。它不同于地球的天空，它的色彩要丰富得多。我敬畏地环顾四周。
//
//我感到微风拂面
//
//我看到了我脚下的大片灰雾，下方的情景一目了然：雾在风中飘动。远远地，我看到了几排工厂，灰色的雾气从其中的一些工厂中渗出，这让我怀疑这儿曾经根本没有灰雾。
//
//我站起来，撑起伞
//
//我凝视着这个世界，沉浸在我的回忆中。我记得这里的声音。就好像我曾经来过一样。
//
//汽车在上下翻腾。无奈，我拿起旁边座位上的雨伞。当汽车停止翻腾时，我被打断，于是拼命的试图打开伞保护自己。我的车撞到了墙上。雨伞刺穿了我。我对它穿过了我感到很惊讶，或者说是我直接穿过了它。我感到自己向后或是向前倒去。我于四面八方坠落，我坠入一切。
//
//突然，我看到了黄色的地板，听到了灯光微弱的嗡嗡声。
//
//我醒了，回到了现实。我向前看去。我真傻，楼梯永远不会终止，它们只会以不同方式延续。
//
//我被美丽的天空环绕。然而，当我向前看过去，想看看楼梯通向哪里时，我看到了剪影，就像那些追着我的黑影一样，但都是白色的。它们是我见过的最纯净的白色，看起来像是巨大又明亮的火花在四处飞舞。我感到快乐和一种归属感。我知道他们和我完全不同，但我们又是一样的。
//
//突然，我脚下的雾海中升起了一小团灰色的雾云。它穿过了我，让我充满了回去的冲动。但我站着没动。
//
//雾散去后，我又感受到了阳光的温暖。然而，我感到了以前一直有的一种冲动，但现在更强烈了。我的渴望越来越强烈。
//
//我试着打开我的雨伞，但失败了。我又试了一次，又失败了。在我认识到真相之前，我很困惑。我拿着的从来都不是雨伞。突然，伞的手柄消失了，伞从我手中掉了下来。它落在了楼梯的边缘并又悬挂起来，一切都像我来时一样。然后，就像我失去了对伞的把控一样，我失去了对现实的把控。我很害怕，但我知道这是我前进的唯一途径。
//
//我试着张开四肢，让自己完全沐浴在风中。我成功了。风猛烈地吹着我，将我吹离地面，将我送上天空。
package lvls2x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl280{}