//Level 299
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//Level 299 是后室的第300层。它由一条鹅卵石路组成，宽约75米（250英尺），长约1600公里（1000英里）。路两旁有43201座1样貌各不相同的钟楼。
//
//Clock%20Tower%202
//Level 299 43201座钟楼中的一座。这一座钟楼几乎是英国伦敦伊丽莎白钟楼的复制品。
//
//描述
//Level 299 又称“威斯敏斯特巷”，对其如此命名是因为其中的43201座钟楼中有43200座每隔一刻钟都会敲响“威斯敏斯特钟声”2。钟声音量或高或低，但平均每组钟声都可在约8公里（5英里）的范围内被听到。
//
//Level 299 内看不到任何天体，其中的光源仅有路灯和钟楼内外安装的照明设备。因此，该层级的大部分区域处于黑暗中，且尚未知晓这些区域的内部组成。凡试图走出鹅卵石路探索的流浪者，当其行进到一定距离以至于不再能被看清后，均会失踪。该层级中的空气可供呼吸，但能明显感受到其中有烟味，仿佛周围曾有物体被点燃或烧灼。鹅卵石路以外的地面上似乎均铺满了一种焦黑，且有轻微放射性的砂石。
//
//除一座被称作“闪电战钟楼”的建筑外，Level 299 的钟楼均可由正门进入内部。钟楼内部的设施往往符合人们的常识，比如楼梯、钟表室、基本的起居空间和储藏空间等等。钟楼中的书刊报纸以及其他文件似乎都来自一段真实的全球持续冲突史，而这场冲突似乎已经以各个参与方的严重损失而告终。
//
//行走于“威斯敏斯特巷”中，常能看到钟楼窗户中有人影向外注视。然而，至今尚未在 Level 299 中发现任何符合这些人影特征的实体。
//
//钟楼的高度各不相同，基本在90到120米间（300-400英尺）。各个钟楼间的距离则约为75米（215英尺）。该层级的钟楼都能正常而精准地运行，但每座钟楼的时间总会准确地比与其相邻的一座钟楼快（或慢）一秒钟。因此，Level 299 中的每座钟楼所表示的时间都不相同，但它们可能会与“闪电战钟楼”一致。
//
//“威斯敏斯特巷”的尽头是一座140米（415英尺）高的钟楼。其样貌破损，仿佛曾被炮弹损坏，且因此得名“闪电战钟楼”。该建筑整体呈现焦黑色，已无法计时。其外部被用红油漆涂上了“一天对两次”3的字样。每过12小时，钟楼的指针都会被拨至随机时间，造成这一现象的原因未知。所有钟楼中，只有这一座的表盘不设照明，因而其所指时间难以辨识。
//
//当某人进入的钟楼所指时间与“闪电战钟楼”一致时，他会经历名为“一天对两次”的事件。此人会被困于钟楼中13天，期间无法以任何方式离开钟楼，也无法与楼外的任何人交流。处于“一天对两次”事件中的钟楼指针会在该次事件中静止不动。事件进行时，无法从内部或外部突破钟楼。事件结束时，应立即撤离钟楼，以防该钟楼在短时间内再次发生该事件。
//
//M.E.G. 在 Level 299 中对“闪电战钟楼”设置了直播，并放出警告，让人们不要进入时间与其一致的其他钟楼。
//
//在“一天对两次”事件过程中的某刻，困于楼中的人会看到“威斯敏斯特巷”内出现一群类似幽灵的实体，它们会组织一场恐怖的游行。这一过程无法在楼外看到，也无法使用摄像设备进行记录。一般认为，事件持续的13日时长正是这支游行队伍行进过整个层级所需的时间。
//
//M.E.G. 对多次“一天对两次”事件进行了考察，认为每当该事件发生时，出现的游行队伍都是同一支。而这场游行似乎也是对某个历史事件的重现。有传闻称某些类似幽灵的实体会对钟楼内的人作出回应，但这种现象被认为只是当事人在极度恐惧下所产生的认知偏差。
//
//“威斯敏斯特巷”的起始处并非钟楼，而是一尊战争纪念碑，其上描绘了一名跪地哭泣的二战士兵，且刻有“只希望我们的时间再多些”的字样。
//
//实体
//据估计，参加该层级内游行的幽灵有数百万，据信它们均曾为某个首都城市4的居民，并在战争的最后轰炸中丧生。尽管如此，该游行的目的似乎是庆祝战争的结束。
//
//尽管这些实体不会与人类直接接触5，它们仍会对困于钟楼内的流浪者造成心理伤害，因为这些实体大都保留了死亡时的惨状。游行队伍完全经过一座钟楼需要数小时，而队伍中的“表演”往往会让人生理不适。
//
//迄今，已进行多次与钟楼内人影的沟通尝试，但无一次成功。虽然目前为止这些实体都表现出无害的特性，但仍建议流浪者们多加防范，以免任何意外发生。
//
//钟楼的上部往往盘踞着大量蝙蝠，但该层级并没有明显的食物来源。这些蝙蝠似乎可以进入该层级的黑暗区域而不受伤害，推测它们便是通过这种方式觅食。而追踪这些蝙蝠的尝试均以失败告终。
//
//有数篇未证实的报告称目击到“闪电战钟楼”内有一个类似男性人类的生物，一般称其为“指挥官”。通过外形可看出其身着党卫队军官制服，而其余外貌细节则因为黑暗而无法看清。目击者称，“指挥官”往往会出现在窗前，背手俯视他们，而且能看到其双目中发出淡淡的红光。有时，他会长时间注视流浪者；有时，他也会顾自走开。但如同该层级中的其他人影，他从未对与他交流的尝试作出回应。
//
//有关“指挥官”的很多问题还未得到解答。比如，他是否确实存在，是否是引起 Level 299 中各种现象的人，还是同他人一样的受害者等等。
//
//基地、前哨和社区
//M.E.G. 在 Level 299 设立了一所考古哨站。其主要任务是编录并研究钟楼内的物件，观察上文提到的人影，并访谈经历过“一天对两次”事件的流浪者。
//
//此外，还有一群流浪者，头戴防毒面具，身着二战时期轴心国军装，像“一天对两次”事件中的游行队一样，在“威斯敏斯特巷”中来回行进。他们似乎为“一天对两次”事件的幸存者，在之后变得对此十分痴迷。
//
//这些人有时表现得极度狂热，因此建议流浪者在该层级中尽量避开他们。考虑到过去发生的多起事件，M.E.G. 的成员禁止与之接触，也不得在任何情况下向其提供人道援助。
//
//入口与出口
//每座钟楼的底部都有活板门，其中约有200扇已被打开并证实通往其他层级。迄今，这些出入口都运作稳定。暂未发现不同钟楼内可使用出入口存在的规律。
//
//作者信息
//« Level 298 | Level 299 | Level 300 »
//
//Footnotes
//1. 对钟楼的数量估计基于以下假设：除“闪电战钟楼”外，该层级中包含的钟楼都能够各自对应到12小时时长中的每一秒。
//2. 译注：原链接是英文维基百科。另外，以防你觉得不熟悉它，这组钟声曾被改编为你可能熟知的下课铃声，你可以去搜搜看。
//3. 译注：即“right twice a day”，应该源于俗语“坏了的表一天也会走对两次”。
//4. 译注：原文为“capitol city”。
//5. 不考虑上文中暂时被否认的说法。
package lvls2x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl299{}