//Level 277
// 
//
//生存难度：
// 
// 
// 
//E0053956-6-AEF-4-DDC-970-A-A86790-BA28-C7.jpg
//在Level 277内找到的办公区域。
//
//Level 277是后室的第278层。此层级实质上是一个内置了多种类汽车生产设备的无序综合体。鉴于有意寻找的出口都会失效，目前关于本层级我们知之甚少。现在我们正在M.E.G.的Omega基地持续进行着对任何可能来自Level 277账号的监测研究1。 探索日志将会被附在文末以备后继者参考用。此层级内获取的确切目击报告及近年来的出现消失的记录可靠性存疑，其之前一直被假定是某个实体的杰作或是一种精神幻象。
//
//描述：
//Level 277是一个巨大的工业设施复合体，主要部分与汽车生产设备相似。值得注意的区域有收发室，存储室，仓储库房，车辆装配线，框架焊接线，上色设施及员工休息室，还存在着没有具体用途的其余房间。所有上述区域都相互连通且时常会在正常情况下完全无法交汇处混为一体。该建筑整体呈年久失修的遗弃状态。尽管处于上述不良状态，该设施仍维持着某种程度上的运转状态。
//
//83490807-70-AB-4-D48-8-D08-EACD3090-B445.jpg
//工业设施区域。代表着277层级。
//
//此层级极度广大，但并非无限。基于有限的记录与参考资料，可以推测出在所有已知方向都延伸了至少数百公里。目前尚不明层级内何处为非线性空间2。 目前已证实建筑外存在着大片成林的植被，目前尚无法通过任何方式获取其更多信息。此层级一个易于辨认的明显特征是其层级编号可在大多数区域内的标志牌上被看到。此外层级还可以看到一些粘稠的红色流体攀附于某些结构的表面上，目前我们仍在调查这种流体的具体性质3。
//
//已知实体：
//尽管此层级实体稀少，我们仍收到了一些目击报道：
//
//成年无面灵，他们身穿工作服并在执行着从操纵机器到干一些更低效琐碎的杂活等工作。他们身上的特征相较其余无面灵存在着较大不同，尤其是他们往往会表现出更为敏捷有目的的活动趋势，显示出其高于其他同类的智能水平。他们能在怒火中烧时表达出明确的拒绝意，据推测他们应该也能使用一些极其有限的人类肢体语言。
//灌篮崽，在无面灵身旁重复着一些枯燥机械的工作。目前无法将它们驯化。
//窃皮者，窃皮者目前仅有一次目击记录。由于该记录的可靠性存疑，需要更多来自于其他账号的记录以证实这个目击记录。（详见：LOG-277-C）。
//督察员。目前尚无法确定其是否为真实存在的实体还是仅为层级内严重认知危害产生的幻象。（详见：LOG-277-E）。
//基地，前哨和社区
//此层级内没有已知的基地，前哨和社区。
//
//入口和出口：
//入口
//Level 277的进入方式是完全随机的，且进入几率极低。理论上只要足以下条件，任意层级都有可能成为其入口：
//
//试图切入一个封闭层级或正在穿越一扇门。
//流浪者身为一个年龄在18至60岁的男性4。
//持有含GPS定位功能的电子设备，该设备可安装软件。设备本身是否能够运作与切入无关，因为层级本身有为其赋能的异常能力。
//出口
//证据表明Level 277不存在能通过常规方法切出的出口。迄今为止，仅存在两类切出方法：
//
//完成一系列“安巡捷”APP的“值班”路线要求，后跟从APP的指引即可到达出口处。 路线完成数目指标因人而异。这一出口可能将你带至你切入Level 277前的原地址。
//被“安巡捷”APP分配到一台“全新设备” 。目前还需要更多数据以了解如何获取到此种结果。该设备的出现有可能与延长一个你极不愿意继续的“班次”有关（详见：LOG-277-B）。在执行多余路线时，出口会随机出现。
//附加信息
//“安巡捷”App
//进入Level 277内的流浪者所携带的电子设备都会发生一系列的变化，其中最显而易见的变化是一个被自动安装于设备上的名为“安巡捷”的应用程序5。 该应用与安保公司用于确保其雇员能完成其巡逻任务的那些程序的功能类似6。
//
//签到签离系统则是被用于识别你是否正处于“值班”状态的工具。拒绝或未能完成巡逻工作并不会对你有即时惩罚。相对的响应则是你会通过该程序的SMS系统基于你的任务完成度收到一系列的催促语句，巡逻规章和警告（详见：LOG-277-D）。你对任务的态度越端正，相应的信息语调也变得更积极。
//
//任何安装了“安巡捷”APP的设备都无法被关闭，也无需电池或其他任何形式的能源。在离开Level 277前“安巡捷”APP是无法被卸载的。在离开此层级后它会自我删除，受影响的设备也能恢复如初。目前尚未有彻底摧毁一台设备的尝试被报告，我们极度不建议如此做，这将直接导致你无法离开此层级。
//
//日志
//- LOG-277-A: 理查德·金
//（Level 11内琥珀营前哨内储存日志的抄本）
//
//好吧，现在这里有些东西。它们能证明我已走出了所在的房间。它在我走出之前仍然维持着原状。我固然明白有时那些通往其他层级的道路会变幻无常，但这次的变换似乎不太对劲。我现在所处的地方是安全的吗？我才刚安定下来，但我还是更愿意再走一遍那个冗长琐碎的流程。在亮度更高的那一块，这台垃圾iPhone终于又能派上用场了。这也能让我看看过去的相册。里面留有我妻子的照片。总之，就让我再看上最后一眼吧。祝我好运。
//
//
//我认为我自己还是挺乐观的，手上把玩着枪支。我不认为情况会有什么变化，而且我已经坚持了一周。现在我还是没有办法能指出何为昼夜，但至少我的手机还能引导我继续执行任务……尽管我待的日子完全够数了。如果这玩意真无法运作，那么说不定这一切也不会发生。话说我为什么要一直相信这个令人生厌的APP呢？难道后室的大多数东西不都是内外性质截然不同的吗？思虑至此，我想起来这也是我第三次执行一个终点为死路的巡逻路线了。我真是烦透了。我会再试试别的方法来碰碰运气。
//
//毫无进展。无法弄清我到底是不是在原地打转。这也有点像她的行动方式，不是吗？说明白点就是那种无面灵，或者他人嘴里的那种……他们现在正在盯我的梢。我知道说他们在“盯”很蠢……但我感到自己正被审视着。出于某种无法名状的情愫，这种感觉正愈演愈烈。我该不该重新起用手机呢？
//
//口粮余量紧张。不过如果我省吃俭用的话可能还可以再撑一阵子。在饿瘪之前。若没有其他乱七八糟的东西出现的话，那么走在巡逻路径上的感觉还是挺好的。毕竟锻炼下身体有益无害，不是么？这些信息的口气也和缓了许多-至少它说我干得不错。
//
//我现在正穿行于一堆无面灵之间，我觉得其中一位似曾相识，他正操纵着一台叉车。我不是很确定它是不是也在像那台叉车一样无精打采地工作。除了这点以外，当我与他对视时，我很肯定他正向我点头。这或许只是眼睑肌的震颤或纯粹的幻觉。无视这些因素的话，这在这么一条漫长无聊的路径也未尝不是一种可乐之事。
//
//口粮储备告急，但我已习惯饿着肚子了。我现在对这些巡逻路线已经驾轻就熟了。我感到口干舌燥，但没有收获就没有回报。这便是我想回复的一句格言。我当然明白我可没有工资挣，但我的敬业精神也值得被夸赞吧。我真该把那个烦人精软件给我的激励言语全都倒出来！哈哈。
//
//今天发生了一场惨烈的事故。我看见了其中一名职员被一个箱子给压碎了。魂归西天。我真为这小子的全家感到悲哀。
//
//好的。现在啊，根据这破手机所说的，我已经被安排在了一个“全天候执勤岗位”。我可以留在这，也可以扬长而去，也就是这个软件会把我引向出口。我想说：感谢上帝，我终于可以离开了……其实我也不太确定。就让我这么说吧：如果我离开这了，那么我在其他地方又能有何作为呢？这一切都值得吗？我去，我真的能在出口外活下来吗？这里可没有任何迹象表明我离开后会切入哪里。或许正是这种未知感让我感到恐惧吧。我得三思而后行啊……
//
//我耗尽最后一份补给。这样危机感就能让我的大脑重新运转起来。我铁了心决定离开。但潜意识中有什么正给我传达着不详的预感。我前面一小时都一直目不转睛的盯着妻子的照片。但我最后想通了，还是有别的地方需要我的。
//
//说实话，我真的完全不敢相信，但我实实在在地回到了我的房间内。我一头扎进床上，精疲力竭，在清醒之后我差点化身恶狼，一人的食量顶过三人。令我震惊的是因为我已离开了整整一个月，居然没有一个人问我到底去了哪里。我的iPhone又变成了一台平常的又旧又厚的手机。这几乎让我以为这一切经历似乎从未发生。
//
//回首往事，再信手阅读我的日志，我很确信这里并没有任何让我留在那里的理由。我想也许是因为那窒人的腐臭味让我无法好好思考吧？谁会喜欢整天与一堆无面灵为伴，啥活也不干，就一直为一个不存在的公司漫无目的地奔走呢？
//
//- LOG-277-A: 理查德·金
//- LOG-277-B：未知人士
//（在Level 8内寻得的一台手机上的音频日志抄本）
//
//[02.26.2002] 好了好了，我操。哈哈哈哈。我嘛，呃-正在对这里进行探索记录，眼前所见基本上不算是一场梦，也并非我的幻觉，或者，就是那个你懂的……我想这应该不碍事。但我现在唯一能想到的事就是-[吸鼻子]-是，呃，保持自身清醒。至少得保持头脑正常。我也不知道呢。反正我已经试过呼叫别人了。
//……
//所以，我也不知道我是怎么样来这鬼地方的。我想说……我可能是从好几级台阶上掉下来摔死的，然后，就到了这鬼地方。我……我并不觉得现状有何异常。但这里可真是脏透了……也许这里通向天堂呢也未可知。天哪，我妈会怎么想？我，呃……这可真是疯了，你懂的，我之前一直都会做噩梦。我想我现在再也无法分辨梦境之虚实了，但我还-[沙沙声。]
//
//[02.26.2002] 这里-这里有些操蛋的东西。在我看见它们的第一眼我真还不如一头扎进屎里。我试着……躲起来，然后-我的手机掉出来了，我觉得我成为待宰肥羊了……我想它们暂时还没看见我。所以，我只好窝在角落里低声哭了一会儿。但是我的手机并没有关机，也没法再关上了，我猜-我猜这上面一定有什么奇怪的东西。我可从没见过，但……他说我“正在值班” 。
//……
//
//[02.27.2002] 我不知道该干啥。我总觉得我的手机会把我引向某些操蛋的食人恶魔，或者是那些不干净的东西。或许我就得这么做，然后被它生吞活剥，之后我便会照常从床上惊醒。但我想，我怎么会知道这一定是一场梦呢。我现在口干舌燥。这种感觉也太真切了吧。我找到了处水源，但里面流出的是……我才不会觉得这些屎一样的流体能被喝下去。我也不会再尝试从那里得到水源了。我现在会专注于执勤路线，然后继续试-试着找条出路。要不然就得交代在这里了，只能干哭干着急了。.
//
//[02.28.2002] 我小睡了一会。梦见我回家了。真也太他妈残酷了，不是吗？
//
//[02.28.2002] 好耶。还是我。这个鬼地方压根就没个出口……也许真没有。这里的墙上到处都是血一样的东西，你们会明白的，这些玩意可怕得不能再可怕了。我突然想起我曾听到过的一个校园怪谈。故事里的小孩，看了眼论坛， 就像那些死宅一样审视着帖子，然后他就……就会有人在旁边写这些粪作了。你会懂得……[清脆的叮当声。]
//……
//我的手机给我发通知了。全都是紧急信息。我哪里有空去想这些？去你的垃圾软件。
//
//[03.01.2002] 我有点被吓到了。我之前有提到我被吓到这茬吗？反正我现在已经有点饿的发晕了。我真希望这里能有水喝……或者有些吃的。我真希望我从没来过这啊。苍天啊。大地啊。救救我吧。上帝啊，我操你吗的！[响亮的撞击声。]
//……
//哈？这些东西可真是结实。
//
//[03.02.2002] 我的手机……说我可以走了。它现在正为我定位到一处……[自言自语]一处新的设施抑或是别的什么东西。我再也不……去想那么多了。我听从它的引导便是。求你了……求求你让我回家吧。
//
//[03.03.2002] 花了点时间，我终于到达了终点。上面写着“出口”。天哪，我发誓我这次会发自真心地去教堂好好还愿了……我，呃……先不说这有的没的，就把我……带回家就行。
//
//[03.03.2002] [血肉与骨头的碎裂声。]妈妈，我很抱歉……我回不了家了……7。
//
//- LOG-277-B：未知人士
//- LOG-277-C：柯尔特·皮金顿
//（一份由Level 230的家园酒店的员工于街道上拾取的日志抄本）8
//
//~ 妈耶，这里到底事哪儿？我正尝试着切卤血腥层级level 230! 但事我却来道了这么个乱七八糟的魂暗工厂。我得赵到些补给！！我害怕那些魂淡会揪住我的头把我弄似
//
//~ 我那在掉瑟的平板想让我走进那掉色的供门，让我作那些码的该死的工作。我相我该马上切出这个狗逼层级！！！！！
//
//~ 我逝过了，我真踏马后悔作了那个畔段
//
//~ 我看见了个污面灵就在那傻傻地把一个盒子在两个角落间班来班去，我的狗头再看他做着事时踏马的差点被甩断了，虽然我又不是那种蠢货
//
//~ 它姥姥的这些周遭的腐臭味到底是从哪里飘来的？茹果我因为碰到了那些铁锈我就会在这个踏马的血腥无比的地方得破伤风那么想必也就小命不保了把。
//
//~ 我呸，介里没吃没喝，代不下去辣
//
//~ 好的兄弟们，现在我记划跟从这个软件的指令。我宁可渴死也不愿意去荷这些比鸟还难喝的液体。
//
//~ 惊喜，大喜！只要你在这里跑腿足够长时间你就可以休息一下。我的平板将我带向了一个有着一悲水和一条糖的房间。虽然没有踏-马-的-正-餐但是总比啥都没有好。可希的是这些水并不是从有杏仁水的水龙头里出来的。
//
//~ 我真的无法明白岛航系统是怎样运作的但我总算完成了我的任务我每天还能拿到两杯水一根糖的补给。在我的观念里这完全是在侵犯人权，但聊剩余无。
//
//~ 我到了巡逻目的地，这里码的堆了一堆乱七八糟的东希，我不自到它们到底踏马是什么，但靠近点后我终于知道了它们好像是个似人。这就像是一大坨染血的皮肤，和一堆协管杂糅在一起。我不知道这些人是饿死了还是怎样，但这让我汉毛倒竖。我得快点离开踏马的这个破地方。
//
//~ 作这种事简直就事与我原先所想的一样无辽啊，巡逻这种工作似乎并不像在原先我的平板所告诉时我所想得那样糟糕。它说我可以走也可留下来，当我说行的时候它给我显示了个出口，就是那个血迹斑斑的同道，我现在就马上启身去那李。
//
//~ 克里斯撒克至少能把我丢在我-想-去-的-那-个-2-3-0啊！现在我又得再找个商店去切入那里了操！！！！！！
//
//~ 一直直行着这个指令真实踏马蠢爆了。因此我现在只想马上结束这个傻蛋毛险日记
//
//- LOG-277-C：柯尔特·皮金顿
//- LOG-277-D：班戴尔·埃斯教授
//（直接发往Omega基地的图文日志抄本，内含有关照片）
//
//pg.1
//05/28/16
//
//我很确信我已完全执行了正确的进入165的步骤。能够成为记录这种小差错的第一人不失为一种荣幸，然而我发现了当下我正遭受着两种环境因子的困扰：
//
//1) 现在是个人研究阶段，我得好好安排时间空挡，并且理清我的研究日程。
//
//2) 正因如此，我只随身携带了些笔记本和一台手提电脑来记录我的发现。我现在无法与外部网络进行连接，但我仍在通过使用写作软件来细化我的经历叙述，以此记录我周遭发生的一切（我是无神论者）。
//
//很幸运，因为自身的机警敏感我带上了些补给来让我撑过我预想的研究周期。而不幸的则是我携带的装备最多只能应付3及以下的生存难度，而生存则是我所不擅长之事。这则给一个在每周周一和周日都要查看数据库的学者带来了心神不安的感觉。
//
//好消息，我再也不用担心我的手提电脑的电量了。而另一个好消息则是这完全是由一个诡异的软件引起的！我已经运行了多次诊断程序，未发现其他软件中存在着非法信息和数据。是时候重新评估下我的判断了。（嘻嘻嘻嘻嘻嘻。）
//
//这可这是令人着迷啊。我现在居然无法摆脱这个程序。我甚至移除了我电脑的硬盘，但纯属徒劳。这个程序的UI有些瞎眼。或许它本应是适配于手机的？
//
//在Windows 7上的安巡捷的指令简明扼要。症结则在于我执行它们全凭我个人意愿。我会在这段时间内忽视它的指令，看看会发生什么。除此之外在还没确定其边界前，我并不希望在没有地图的情况下到处乱转。
//
//pg.2
//5/29/16
//
//我不得不说我被过去24小时所发生的一切给整乐了。从我所收集到的信息可以得知这是一个庞大的工业设施综合体。就像是那些生产轿车的设备。这里存在着重复出现数字277的趋势，可以作为区别一个层级的极佳标志。
//
//这真是一锅流水线要素的大杂烩，就像是某个人在回忆中漫无目的地游荡然后抛出那些要素造成的。另外我也没办法提供更为详尽的生产线信息，毕竟我不是个自动生产线的研究专家。
//
//我在安巡捷上的发现或许对于幕后之人也是种极有意思的尝试（虽然有些枯燥）。我已经从电脑上收到了数条措辞笨拙的激励讯息。这也让我更加好奇这些讯息的来源。我会试着用安巡捷的SMS发出几条询问讯息，若我收到答复我会马上更新日志。
//
//我周遭的事物连成了一片别有风味的整体。我不仅遇到了沉溺于重复劳动的无面灵，还能在近在咫尺的距离观察到它们的反应。我可得好好收集点皮肤样本！这种刮取收集皮肤样本的机会可能今生再难遇见。
//
//pg.3
//6/03/16
//
//我在这里所耗费的时间正在慢慢结果，我已经遇见了一些极具研究价值的事物。正如我在前厅的挚爱是花朵一样，这让我心旌摇曳。这里所展现的异常性质可能对我们的未来存续至关重要。虽然尚未有确定的要素，但……我会让我在世界上的（上一个）同事们发送一份样品。我在下方附上了一张照片。
//
//0-A815-B33-137-A-4-E3-D-822-C-D32-E7-EFF9-CAC.jpg
//
//让我失望的是，这些东西用一张素描也可以描绘。当我的工具真的只有铅笔时我又会遇到何种转机呢？
//pg.4
//06/06/16
//
//目前我的假设已经得到证实。这种红色粘稠流体与铁磁流体表现类似，尽管反应不是那么强烈。而且它只能被移动中的物体吸引，而非磁性物体。活塞，杠杆，机械。在此之后，它便会附着于表面上，并最终融入它们。
//
//277内工业生产设施尚能无视极度磨损和衰败的情况保持运转的现象和层级内无处不在的深红琼脂状流体（名称待定）存在着紧密联系。如果我是个投资者，那么这种琼脂就可以用来高效地维持已弃用系统的运转。试想若我们的机械能够永不停转。那么我们就能保证发电机在从不损坏的情况下一致产生电力。它们对于造福人类的价值无法估量。如果能让其单独在回路内工作的话……
//
//我得调节一下我的期望值了。这里还存在着不少能让我努力付之东流的变量。在实验室中我能将这种现象重现吗？在把它带走以后它还能保持原有性质吗？我要如何确认它能在层级外可以展现出异常性质？我会告诉你们该怎么办的：我正在收集大量此类流体并尝试找到一处出口。
//
//如果有后室诺贝尔奖的话，那么这项发现一定能让我把它捧到手。
//
//pg.5
//06/09/16
//
//在大致标注了我的路线后，我正寻思着跟从安巡捷APP的指令是否会让我陷入一个永无止境的毫无意义的巡逻循环。它不允许我走出巡逻路线外，所以我只好一路向北。
//
//事实上我的指南针上的读数和安巡捷GPS上的线性标注让我确信了自己仍在按我所想的道路前进。我应该试试在路上尝试切入其他层级。
//
//我要么是运气太差，要么是此处的切出难度更大，我无法切出这里。
//
//我看见一个岩石型灌篮崽，但更重要的是，它正在与一个无面灵协同工作！它们所要做的似乎只是傻站在流水线旁边，但我绝对从其中找到了全新发现！我摸了摸那个小小的灌篮崽的鼻子，但它也不理会我。这个层级真是充斥着千奇百怪的事情。
//
//我尽己所能带了些比常人所需的更多的杏仁水和能量棒，但即便这样也无法让你在一个口袋宇宙中感到如释重负。
//
//pg.6
//06/20/16
//
//我正在将探索日志分类整理，聊以打发无聊时光。我从不厌恶干些重复性的工作。
//
//“又是艰辛打工的一天吗？我们与你同在。”
//“如果有什么心理问题，就大胆地和你的上司说。”
//“我们知道你能行！”
//“安全。经济。可靠。安巡捷。”
//“我们的员工归属感与成就感总是让我们引以为豪。”
//“坚持不懈，滴水穿石！”
//“员工的踊跃参与是公司士气高涨的保障。”
//“上级正殷切期望你能马上踏上巡逻之路。”
//“公司上下，亲如一家！”
//“如有心中症结，请咨询我们的人事部。”
//“让我们给竞争对手点颜色瞧瞧。”
//“我已预见你冉冉升起的未来……如果你能一致陪伴安巡捷左右！”
//“空手的雇员是魔鬼所爱捉弄的对象！”
//“我们会为员工的每一餐每一点买单。世上独有。”
//“别忘了明天可是搞笑领带星期五，企业文化！”
//“你想要参与员工满意度调查吗？”
//
//
//我很恼火，我的讯息到现在还是没有得到它的回复，甚至连备忘录里的问题也还停留在请求答复的状态。无论如何，这也是完成巡逻后才会萌生的想法。
//
//pg.7
//06/28/16
//
//我忍不住想知道我是否犯下了某种错误。我周围的一些东西发生了变化，但大体上保持原状。我现在也许得选择掉头返回了，但并不是因为安巡捷每隔几日就会发生打卡点的变换。这为我指明了之前的几条巡逻路径远不如这条重要。即便如此，我也不会动摇我的猜测。
//
//有个无面灵似乎无视了我的存在向我这个方向逼近。我不能浪费时间去调查这个了。除此之外，它们经常也会表现出些自相矛盾的行为。
//
//07/06/16
//
//为了防止我因为无聊偏离最近路线，我正考虑将我不得不经过的一些场景环境进行归纳整理。最后这些记录会夹杂着那些金属的碰撞声与响亮的工作铃声…….这就是其他人在听见于一堆机械内穿行还自言自语的感受吗？
//
//07/09/16
//
//在监测我的睡眠与生命体征数日后，我怀疑我已开始理解了277内某些神秘的事物。我已检验过我的理论以确定一切要素都已考虑，但我的警惕性还是稍有欠缺。
//
//第8页内包含了两张置顶于文章内的图片。第9-14页日志则无法复原。
//
//pg.15
//08/02/16
//
//“安巡捷”上的SMS上传输来了更多我“最爱”的垃圾话。字里行间洋溢着讽刺之意。我得马上离开这片该遗忘之地了。我从未有如此之多的事要做……
//
//“谨之慎之，能毕共建安全车间之功于一役。 ”
//“近十年来世界最强安保公司，不接受反驳！”
//“安巡捷问卷星：员工满意度调查”
//“我们理解你对公司的殷切期望，但你得身先士卒啊。”
//“早睡早起，加油打工人！”
//“懈职怠工，鱿鱼炒熟。”
//“和别人串班对你来说很好玩吗？”
//“星期一，看看你，是不是胸腔充斥着满满恨意？”
//“服务，不止于安全。保全工作，保全未来，保全芳心。这便是我们安巡捷自身所做的保证。”
//“星期一员工休息室内免费供应小圆饼！”
//“无人能身兼数职，员工需各司其职。”
//“咱安巡捷公司的领导可都是用人不疑的伯乐。”
//“你的辛勤工作是公司安身立命的水源木本哦。”
//“ ”
//
//
//我现在更少收到来自这个APP的信息了。实际上最近的一条信息已经是空白一片了。我现在只能期望这意味着一切都已结束了。
//
//pg.16
//08/29/16
//
//我真是无语了。在尝试一切方法后，在跋涉千里后， 这就是我发现的那种鬼东西吗？我相信我仍停留在原层级。我认为这个综合体并非是无限延展的。或者说我已来到了所谓的无穷之穷的所在处了呢？（这并非玩笑）
//
//我不知道该做些什么了，但综合考虑所有因素，原路返回无异于自取灭亡。而且……我终于来到了露天之处。户外，我能望见群青。
//
//3-A5-A98-C6-F13-C-46-B6-93-C6-94-DE1-A3-B9-E01.jpg
//
//如果无新事物可供可记录，我想惬意地躺在草坪上小睡一会。
//- LOG-277-D：班戴尔·埃斯教授
//- LOG-277-E：M.E.G. 特工乔丹·拉扎洛斯
//（来自Omega基地无线电传译的抄本）
//
//[07-21-21 16:49:47] 乔丹： 这你吗是什么鬼啊？格林！海德克！你们现状如何？
//
//[16:49:53] 格林：一切正常。
//
//[16:49:55] 海德克：情况还好——等等，你不是在我们身后吗？
//
//[16:50:01] 乔丹：你记下来了吗？你在哪？
//
//[16:50:06] 海德克： 我们在Level 5。长官你在哪？
//
//[16:50:11] 格林： 呼叫总部——
//
//[16:50:12] 乔丹： 我天！这大块废物出了什么毛病？我不是应该在Level 5吗？
//
//[16:50:15] 格林： 总部，我们的指挥系统还能正常运作吗？
//
//[16:50:18] 总部： 一切信息清晰无损，但是特工拉扎洛斯好像听不见你们。我们正尝试解决这一问题，完毕。
//
//[16:50:24] 乔丹： 总部，能进入频道了吗？这个地方看起来像某种仓库。
//
//[16:50:30] 总部： 拉扎洛斯特工，现在你能收到吗？
//
//[16:50:36] 乔丹： 该死的，这本来应该照常运作的！更别说现在我还完全失联了……好吧，我还是准备按无线电仍能正常运作的假设继续前进。我得在日志里让他们知道我什么鸟也听不到。
//
//[16:51:00] 海德克：我没法找到他的踪迹。我们明明走的是同一扇门啊？
//
//[16:51:04] 总部另一个人能听-
//
//[16:51:06] 乔丹：到底怎么回……[沙沙声。]
//
//[16:51:10] 总部： 我们会将拉扎洛斯特工分配到另一个不同的频道，看看这能不能把事情的缘由给找出来。同时你们二位继续清查这片区域并检查你们经过的门。务必保持谨慎姿态。
//
//[16:51:20] 格林：明白。
//
//[16:51:22] 总部：如果这里没能发现可以和他会合的明确路径，你们就继续执行自己的任务。
//
//[16:51:28] 海德克：我他妈恨死这地方了。完毕。
//
//[16:51:33] 格林： 这次你又独自溜哪去了，拉扎洛斯？Lazzo?
//
//[16:54:39] 乔丹：总部，能收到吗？
//
//[16:54:43] 总部：我们能听到，音质清晰，响度足够。我们正准备离开这-
//
//[16:54:46] 乔丹：我的GPS受损了。这上面还安了个未经授权的奇怪软件。我该作何处理？
//
//[16:54:52] 总部：我们会保持该频道开放，但我们怀疑-
//
//[16:54:56] 乔丹：操他妈的。
//
//[16:54:59] 总部：你可能在离开你所处层级之前都无法听见我们的消息。
//
//[16:55:04] 乔丹： [惨笑。]
//
//[16:55:06] 总部：兵贵神速啊，士兵。
//
//[16:58:17] 乔丹： [叹气。]我太希望这些数据能被保住了，保持我的通讯顺畅也是我眼下的首要任务。新的前线队员罗经点探索队已经。我真希望来这时也有队伍陪着啊。
//
//[16:59:33]我正准备尽力检查这个程序内存在的有害信息。我会将结果向ASAP汇报的。
//
//[17:03:11]一切情况尚佳。我会继续我的巡查路线，并延长探索距离。此外，如果这个程序能向我显示层级出口的话，那么把它丢掉就是一种愚蠢之举。然后啊……我正尝试先从生产车间离开。[杂糅的咕哝声，铿锵声和叹气声。]
//
//[17:42:30]好的。多次切入可疑几何空间的尝试都失败了。目前我所找到的所有要么被焊死了，要么就是通往另一个乱成屎的工业车间。我想我目前所处的是烤漆车间。靠得太近的话就会闻到那种刺激的烤漆味。基于该区域的标志所示，我确信这里就是Level 277。反正我也准备这么命名它。
//
//[17:42:44] 总部：收到。我们马上会派出队伍来研究Level 277。我希望现在没有什么你要听到的东西。
//
//[17:42:51] 乔丹：哦，你们肯定会去看看这玩意的。一个戴着安全帽的无面灵。如果它本身长得并不恶心的话，总体上看起来还是挺可爱的。
//
//[17:43:02] 总部：我们在277内好像没有任何设施，你很幸运，也很不幸。我们将会向终端输入相关指令，并检索数据库内所有与你描述相符的东西。
//
//[18:11:38] 乔丹：以我的理解，这个程序似乎是想要我在这个工业综合体内的不同部分内值班。基本上都是巡逻任务。我觉得这挺有创意的，但我也希望这仅仅只是个巧合。
//
//[19:01:08]这个综合体的布局完全就是一团糟。我仅能看见小汽车的半成品一直被输送到向我自称的那个废弃了40多年的中心去。但真正使我震惊的则是这些无面灵的移动方式。他们中的某些个体居然比他们一般的奇葩同类更加灵活自主！[大笑。]
//
//[19:01:44]该死，我真不习惯这里的一片死寂。好久没有这种体验了。
//
//[19:32:13]我在东区探索的时间越长，我就越能注意到一种奇特的红色粘液正附着一些表面之上。看起来像血，但成分不同。我肯定是不会给它任何可乘之机让它跑到我手上和脸上的。想要研究它们还是靠研究小组吧，如果你们能把他们弄到这里。
//
//[19:34:33]这部分像个典型的-什么鬼？
//
//[19:34:39]寻获一台笔记本。配置齐全。抛开那些特异性质，它……几乎用不了。那就再仔细检查下这块吧。
//
//[19:34:55][吹声口哨。]
//
//[19:34:59]你家的小伙计可算爱上这个了。我会尽我所能拍下此层级的照片。我可不知道我的电池还能撑多久。
//
//[19:35:26] 总部：我能看见你恢复一些平台数据。现在能听见吗？
//
//[19:35:36]重复，能听见我们吗？……我们无法一直监测这个频道了，所以我们将会每隔四小时派人来检查频段状况。如果有照片被上传，我们将会在第一时间收到通知。
//
//[19:35:50] 乔丹：啊，该死。事情可算糊了。我得找个好地方来接收信号并上传数据。
//
//[19:48:23]这家伙似乎留下了些写得很详尽的笔记。我们现在太需要把那堆因这个层级的存在性而争论不休的研究员给送进来了。除非我还有些东西没报告，不然我想现在我得避免一直使用无线电了。这地方越来越让我感到不适了。
//
//[23:24:15]首趟巡逻完成。收到了来自“安巡捷”APP的庆贺消息了。
//
//[07-22-21 00:00:00] 总部：拉扎洛斯特工，你能收到吗？[进一步的通讯被截断了。]
//
//[06:32:56] 乔丹： 眼下我的补给还能让我再生存两周。我回去后真得好好感谢让我从Beta基地内多拿些补给的那个人。
//
//[15:05:27]天哪……我操……[沉重的喘气声。]
//
//[15:06:01]某些路线比先前的巡逻任务难跑多了。从现在开始我要按自己的步速前进了。
//
//[18:22:13]在廊道里见到了只灌篮崽。与艾泽先生描述的那种一点也不像。我想它似乎是被……氧化了吧。
//
//[18:22:42] 驯服之前似乎都是人类的专有词。我是真的无法想象一个无面灵竟然能驯服一只灌篮崽，但我想我在这每天都能碰到些新东西的。
//
//[07-23-21 09:17:22] 这里千篇一律的场景已经让我感到不堪其扰了。我无聊到都可以在脑中和自己打扑克，然后一边嘲笑那些一直干体力活的蠢蛋了，而我则一直在这里转圈，就是因为一个层级在叫我这么做。
//
//[09:19:46] 我试图寻找那个前人所找到的出口，但我心里则有个声音在喊我不该去那儿。我不得不跳过笔记的前几页，然后直奔主题，但我想我已经掌握了最后机会。他的笔记本到底是如何落在这的呢？
//
//[07-25-21 14:12:40] 我所负责的那条路径似乎变得更容易了。它难道真能知道我的能力上限吗？我得再次确认是否存在认知危害了。
//
//[14:16:31] 一切都弄明白了。但-哈！
//
//[14:16:33] [响亮的撞击声。]
//
//[14:16:35] 先看看你要搞的是谁吧，小兔崽子！
//
//[14:16:42] 为什么我刚刚会在对一个无面灵说话？ 总部，我请求从日志中抹去这段记录。
//
//[07-28-21 20:13:13] 我也不确定它们到底是在这个车间里做些什么了，但这里的环境绝对是要把人蒸熟的那种。温度计读数60°C。好消息是我们的特工制服可以应对这种严酷的高温。
//
//[22:31:58] 哎我操……至少这种折磨结束了。
//
//[22:32:24] [大声喘气。]
//
//[22:32:28] 啊，老天啊，我现在急需杏仁水。为什么我偏得白白走这一遭啊？
//
//[22:32:35] 哦，对了。这是巡逻路线。
//
//[22:32:40] 这真是蠢爆了。我明天早上0600必须得想办法离开这些流水线了。
//
//[07-29-21 10:03:58] 我已经按指导手册上所能说明的一切尝试切出这里了。标准墙切，角切，顶板跃切还有超限跳切无一奏效。见鬼，我他妈已经试过给把那些水暖设备给撬开了。什么也没有。我试着切入路上一切不会杀掉我的东西了。
//
//[19:12:17] 我得承认这不仅是一种烦人的浪费时间的尝试，也是一种让来自安巡捷的信息把我劝返工作的无聊把戏。
//
//[19:12:31] 处于如此境地会让你开始反思自己是不是正在为怠工行为而忏悔于心。
//
//[20:29:04] 又到了恢复听从安巡捷GPS指令的时间。我仍在试着用手切入任何可疑的物体，与此同时我不得不控制好自己的步速，我从未感觉如此精疲力竭。我的食物还算充足，但杏仁水快喝完了。
//
//[08-01-21 07:05:11] 杏仁水已近乎完全枯竭。我花了过去两天时间去确认一处可饮用水的水源。此处的管道系统几乎一点用也没用，除了那些恶心流体外它里面什么也没有。
//
//[08-02-21 22:16:58] 这就是我准备排泄人体废料的方式吗？ 说实话吧……我觉得这还挺舒服。很值得。深蹲下来，我也许会更反感些。不仅是在这里。在哪都一样。
//
//[22:17:22] 顺便说一下，请把那些内容从日志中抹除。
//
//[08-03-21 13:00:00] 什么？开玩笑吧？
//
//[13:00:09] 安巡捷说我现在可以休息了。[大笑。]
//
//[13:00:17] 好的，我得好好放松下我酸痛的膝盖了，何乐而不为呢？
//
//[13:00:48] 总部，请注意，如果我突然毫无征兆地终端了通讯那就是有人在Level 277进入了一个被成为“员工休息室”的房间内。
//
//[13:11:33] 这也太棒了，不像是真的。我眼前便是一杯我渴望已久的甘露。在还没喝它之前我身上已经出现了一个个不详的脱水征兆了。
//
//[13:35:06] 安巡捷说我的休息时间结束了，但仅仅只是个通讯线，他们又能奈我何。因为我身上的一切总算变得洁净了些。这绝对是100%纯净的蒸馏水。
//
//[13:35:18] 总部，如果我在此次报告后失去联系，请马上建立一份新的物品文档以将此类可能致人于死地的水与常规饮用水区分开来。
//
//[13:35:47] 我开始希望我能走到些比这里有趣些的地方了。
//
//[08-06-21 19:37:04] 最新的状态报告：在减少我的补给消耗后，我现在得摄入更多食物以补充额外水分。我之前摄入的其余补给并没有表现出异常性质。现在这些层级内的消耗品将会成为我摄入水分与食物的首选，但聊胜于无。
//
//[08-08-21 15:18:52] 长途跋涉的巡逻路径开始变得容易些了。看来我的状况已经恢复如初了。几乎上是完全地恢复了。
//
//[08-11-21 09:23:10] 有些无面灵开始越看越面熟了。我的意思是，并不是那种看起来像我朝思暮想的人。仅仅是那种熟悉的陌生感。这有些奇怪，要知道我在这里可没有走过两条交错的路线。但我想他们或许也有自己的行动路径吧，应该是这样吧？
//
//[08-18-21 18:41:55] 我的心中大概有了一份综合体外部的大致图景了，这确实似乎是 无尽的，说实话吧，我感觉我的道德素质确实是在下降。我不知道到底如何出去。我得冷静思考一下，而不是像个断头公鸡一样到处乱跑。
//
//[08-19-21 05:31:12] 事情开始变得不对劲了。自从我停用了安巡捷，我对自己的怀疑感越来越重了。未知感。负罪感。但在此之上……我感到我还有未尽的义务。为了继续未竟之事业。这种-这种使命感……感觉就像我身负的其他义务已无足轻重了。这怎么想也不会是一种认知危害吧。我已经把我的GPS给丢了。
//
//[08:02:37] 我还是回去把它捡起来了。我……我会再走些路线的。为我自己。为我珍重的一切。
//
//[08:39:25] 所有的东西终于又让人感到清爽干净了。
//
//[08-22-21 14:25:39] 我在走巡逻路线这一方面上已经可称专家了，反正我是这么想的。或许我是这里的最佳记录保持者。但说这些没什么意义。我现在觉得事情有些不对劲了。这些二维码的扫描结果开始变得错乱。我到底该做些什么？我还有其他选择吗？
//
//[08-23-21 03:22:03] 或许我只是有点偏执了。这里的那些该死的锈蚀，蒸汽，与敲击声正在包围我。我觉得我有义务而且我的确有义务-马上找个方法和我的团队团聚。我必须得逃出生天。我会找到出路的。
//
//[03:24:12] 我已经不知道熬了多久。我得睡上一觉。不然这可能会影响到我值班。
//
//[08:45:23] 嘿……你小子……说的就是你！嘿！口-黑！[簌簌声。]
//
//[08:45:29] 给我听着！你听不见吗！？你是不是在-
//
//[08:45:32] [静电噪声。]
//
//[08:45:33] 嗯哼？
//
//[08:45:35] [极度刺耳的哀嚎声。]
//
//[08:45:36] 上帝啊！
//
//[08:45:38] [饮水声]
//
//[08:45:38] 退后！他-妈-的，立刻马上！我-我说……你只要-
//
//[08:45:51] 他妈的怎么回事？
//
//[08-32-21 09:13:47] 这一切都乱套了。我快疯了，我居然在对……一个……一个无面灵发飙。
//
//[09:13:41] 我有幸能看见他们正在包装的那些箱子的内部存在何物。这次我确信了我确实看见过他。这感觉起来就像是……我已经和他是老相识了，我曾来过这里。一切如此自然流畅。他转过身来，我向天发誓他真的认识我。正如一位天涯若比邻的老友的所作所为一样。除此之外，一切都异常地合理。我突然跃起。死命地摇着他，想把它一把抟在地上。出于某种情愫，我觉得他能应答我，但这也只会让我徒增恐慌。
//
//[09:13:24] 他的面部开始淌泪了。大概是在嘴巴所在的那个位置。或许也就是他的眼睛的所在处。那种恶心的红色屎团开始泄露了。我退后了，举起我的手枪。而他所作的一切只是在原地嚎啕大哭。甚至没有走到我的跟前。他仅仅是……在原地恍惚不定。
//
//[09:13:11] 我没有开火。我不知道为什么。我记得以前我们还喜欢屠杀无面灵们来取乐。但这次我没能扣下扳机。
//
//[09:13:03] 为什么我会做不到呢？
//
//[08-00 00:00:00] 在那次事件后我又被上级分配了一条新路线。我忧心忡忡。如果我没法弄到水的话那我便已行将就木。
//
//[00:00:00] 我得再试试切出这鬼地方，虽然这-
//
//[00:00:00] [响亮的叮当声。]
//
//[00:00:00] 哦-呕……呃……
//
//[00:00:00] [呕吐声。]
//
//[00:00:00] 不不不不不不不不不不……不，不，不，唔啊-
//
//[00:00:00] [呕吐声。]
//
//[00:00:00] [抽泣。]
//
//[11-13 00:00:00] 我的任务还在继续吗？
//
//[00:00:00] 我刚从“安巡捷”那里收到了一条信息。
//
//[00:00:00] 上面说，“我们得好好谈谈”，由督察员发出。
//
//[00:00:00] 我已经执勤了不知道多久。天天穿梭在一大堆丑陋不堪，令人作呕的精神污染性的粪堆中。看来这里的人死的方式都不能再更糟了。我当然还记得我在Level 6像无头苍蝇一样四处乱撞的那番光景。
//
//[00:00:00] 但这和那里的所有东西都没有可比性。
//
//[00:00:00] 你们之前可曾想过如果你是只宠物狗，在家里失禁了？当……当你的主人进来了会发生什么？他一把把你揪起，然后再把你的狗脸按进那泡尿里死命摩擦时你会作何感想？
//
//[00:00:00] [喘息声。]
//
//[00:00:00] 抱歉。我在-我在哪？
//
//[00:00:00] 好吧。我现在成了小狗。或者把这种严重程度再乘上个万亿倍也不为过。
//
//[00:00:00] 我……我才不是个士兵。我到底是谁？
//
//[00:00:00] 我所知道的是-是-是那个啊。
//
//[00:00:00] 他可真是失望极了。
//
//[00:00:00] 但他没有对我发飙啊，他真的……[啜泣声。]
//
//[55-55 00:00:00] 请请请[无法辨认]请请别别别别别别别求求你。
//
//[00:00:00] 我能做得更好，我可以，我一定行，我我我可以……我珍惜这份……
//
//[00:00:00] [呕吐声。]
//
//[00-00 00:00:00] 你是无法理解我的现状的。他，他他他他正在监视着……所有人的内心的价……[无法辨认。]他如影随形，他就是你，而且[无法辨认。]你应该干得更好，因-因为我……他是不会突然跳在你面前斥责你的。他在每个人心中。他即吾辈但他永不现身。为什么？为什么为什么为什么为-什-么-为-什-么-为-什-么？
//
//[00:00:00] 哦。
//
//[00:00:00] 我得走了。
//
//[00-00 00:00:00] 总部，这里是乔丹·拉扎洛斯中尉在向你报告。寻呼信号为M450A。希望你们能听见。你们绝对不敢相信我能从这个安保公司头子身上弄来他的衣服！我把那些无面灵雇员中的一个吓了个半死！他明白了中途换个生计可不是轻易之举，虽然我很确定我也是个新手。他表示他再也不想要再经受更多灾祸了。看来现在这个工作站里出现了些政策变化。这就是人生吧。即便如此，我也得告诉你们我找到了份新工作。见鬼，我觉得在这里我的晋升机会甚至更大了！我很确定我再也不会回去了，但若可能的话我会给你们发张我的名片的。我得去上班了，所以……哒-哒！9
//
//- LOG-277-E：M.E.G. 特工乔丹·拉扎洛斯
//作者/授权信息
//« Level 276 | Level 277 | Level 278 »
//
//脚注
//1. 最初的探索行动人员于2021年7月21日被派遣至此层级。下一个派遣指令由总部于2021年10月6日发出，行动中追加了一条口头证词只有在多重验证才能生效的判据。
//2. 勘察人员与Level 277内其他人进行交谈的情况从未被记录在案。这可能是因为层级自身的空间扭曲性质或是其结构有足够能力来操纵层级出口及入口。
//3. M.E.G.已经发布了对于获取上述材料样品的高额悬赏（在非官方侧此物体亦被称为“猩红髓浆”）。
//4. 我们尚在猜想其他因素是否也在影响着切入，例如个人履历和精神状态，但这些猜想需要更为庞大的样本库来进行验证。
//5. 据猜测该程序主要是在手机和平板上被安装，但事实证明实际上它也能适配其他设备。
//6. 通常情况下，智能手机会被用于扫描二维码和近场通信码以选择巡逻顺序和路线。“安巡捷”APP则会在其为流浪者选择的路线施加更多的限制条件，即在你的巡逻路径上仅放置一个标识码，下一个标识码仅会在扫描上一个标识码后更新。巡逻的强度，距离和所耗时间因路线而异。
//7. 这些记录最终由“洞穴突袭者”前哨在2014年的6月份左右时于一台被遗弃的诺基亚3310中寻获。手机尚余三分之一的电量。
//8. 日志中的错别字被保留下来以维护其真实性。
//9. 自接收到最后信息后我们便在2021年9月30日的早上7点与他失去了联系。M.E.G.目前仍在试图解决设备同步收发信号存在的故障，并在研制可以避开异常闭路模块的通讯工具。
package lvls2x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl277{}