//Level 230
// 
//
//生存难度：
//等级 3
//
// 
// 
// 
//qQTS6lsNxEuLW7M.png
//Level 230内的码头，拍摄者未知。
//由于这一区域极端的危险性，这张照片是否真实无法确认。
//
//U2MOPrTHnY1AIky.jpg
//工作时间的交易区。
//由流浪者UnforeseenDrop拍摄。
//
//rUsyFLzIieX1gxw.jpg
//陋滩。拍摄者未知。
//
//Level 230是后室的第231层。
//
//描述
//Level 230，也通常被称为“疑云港”，是一个破旧、腐败的港口。
//
//如今，该层级已成为后室中各个团体交易的热门地点之一。这里出现的资源包括一些旧水手服、饼干、风干的肉、曲奇饼干与杏仁水，他们会出现在一些板条箱里，并不定期地得到补充。以目前探索的极限推断，该层级的面积是无限大的。流浪者在Level 230内从集聚点出发探索过的最远距离大约是100英里（约161千米）。在他们继续远离后，虽然仍能与M.E.G.保持联系，但是集聚点与他们的无线电交流却会受到严重干扰。
//
//整个Level 230都被不变的夜幕笼罩。在这里出没的实体包括笑魇、兜帽商人、搬运工、无面灵，以及较少见的死亡飞蛾。安全区是交易贵重物品的地带，这里除了极少数的兜帽商人与无面灵以外不存在其他敌对的实体。不幸的是，Level 230也因其内部的“黑市”问题而臭名昭著。众所周知，F.T.B.等可疑组织会将该层级作为运营的主要地点，违背M.E.G./B.N.T.G.制定的交易守则，在此提供某些商品与服务。
//
//区域
//码头
//该区域处于一片水域的边界，向远方无限延伸。这片水域的深度与其中的液体究竟为何都仍未知。由于组成这片水域的液体成分未知，其会一直被记录为“不可饮用”，直到有研究队能对其进行考察并验证液体的具体成分。
//
//该区域有无限多个船道整齐排列，从海岸出发，一直延伸进水域上方。船道的材质大概率是磨损的木头，但具体材料还有待分析。这些船道在绝大部分时间里都是闲置的，但偶尔也会迎来一些货运船。这些船虽然来历不明，但已知其上存在着搬运工，以及一些尚未确定的其他实体。货运船上有一些电灯柱，提供了昏暗的照明。
//
//由于有大量的实体在此出没，码头被视为禁区。M.E.G.以及其他官方团体严令禁止任何人非法进入码头。
//
//交易区
//这里是Level 230内唯一确定安全的区域，也是整个Level 230最热门的地点。M.E.G.、B.N.T.G.、F.T.B.和F.S.P.等大型组织都在此扎营，家园酒店也坐落于此，提供大量居住区域和交易场所。
//
//作为该层级人流量最大的区域，交易区的面积大约为28平方英里（约72.5平方千米）。该区域的街道宽大但是曲折，因此很容易在此迷路；不过任何一个神志清醒的流浪者都可以从友善势力那里打听到该区域的路，甚至购买到交易区的地图。
//
//作为一处商业中心，交易区在居住区内外都设立了大量的零售店和餐饮馆。这里的商店大小不一，从街边小摊到多层的大商店都有，通常都是交易者公会的成员。这些商店出售的物品包括食物、饮料等必需品，大部分都为从“零食室”（Level 6.1）中所得的，数量与质量皆有保障。在这里可以买到绝大多数饮料、各种各样的农产品和保质期较长的食品，众多的餐厅也提供了不同风格的美食。流浪者同样可以在家园酒店等设施登记入住。
//
//Level 230的交易区也以其提供的高品质探险装备著称。后室补给公司1等专卖店里出售大量专业装备，或者在潘西与艾博百货商店也可以找到一些。
//
//陋滩
//陋滩与码头接壤，由狭窄、蜿蜒的街道联通到交易区。除了B.N.T.G.的230号资源提取站坐落于此，没有其他的B.N.T.G.或M.E.G.人员在此把守。该区域不宜居住，任何试图在其中探索的流浪者都会被淹没在无穷无尽的实体之中。该区域内仅存在一次记录在案的探索，探索者最终与M.E.G.断开了联系，并从此下落不明。
//
//机构
//购物
//潘西与艾博
//潘西与艾博由托马斯·潘西与罗伯特·艾博创办，是一家在Level 230内备受好评的百货商店。我们是不结盟商贸集团（B.N.T.G.）的一员。我们位于一栋大楼的一层，出售杂货、饰品、服装、装备等商品。作为Level 230内首批优秀零售机构之一，我们是一家信誉良好的零售商，能为您满足一切交易需求，并有自由运输场（F.S.P.）背书。同时，潘西与艾博的供应商也乐于收购珠宝与其他奇物。
//
//后室补给公司
//后室补给公司对很多流浪者而言，都是一家户外用品商店。其中出售外套、绳索、罐装食品、灯具、武器、驱笑剂2等众多设备。众所周知，无论是应对恶意实体还是环境，在后室中的探索都会消耗大量流浪者的装备。在Level 230中的交易区中重新补充库存，开启下一程深入后室的冒险。
//现已加盟F.T.B.。
//
//餐饮
//托尼的每日精品
//托尼的餐馆就在Level 230，那是一个有趣（或者是古怪）的地方。那里每天供应带有异域特色（当然了，仍然是本地风味）的不同料理，这主要取决于当天有哪些食材可用。与在前厅中的餐馆不同，那儿使用的肉类不局限于牲畜的肉；事实上，它们绝大多数都是某些实体的肉。在任何一个夜晚，你都可能在那儿品尝到窃皮者的肋排或是油炸死亡飞蛾（通常都是无毒的雄性）。笑魇炖肉在托尼的餐馆附近大有名气，但一旦问起它们是否真的是用笑魇做的，往往都会引起激烈的争论。
//
//飞行死蛾酒吧
//欢迎，旅行者。这里是飞行死蛾酒吧，我们听说你在后室中四处探索一整天之后饿坏了。如果你想找几个志同道合的朋友喝一杯，那你就来对地方了。你应该感到感到幸运，至少我们的店里没有寄生虫了——只有几只死亡飞蛾！哈哈，放轻松，这只是个玩笑。应该是吧。
//
//守望者之灯
//守望者之灯是一所位于交易区边缘的小酒馆。这里的常客主要是精疲力竭的下班M.E.G.特工与附近B.N.T.G.资源提取站里的工人们。虽然这它并没有什么独特的产品，但却为疲惫的工人们提供了热腾腾的食物、可口的饮品与温暖的壁炉。
//
//基地，前哨和社区:
//交易者公会
//这一由B.N.T.G.设立的前哨站会为附近地区的流浪者提供食物。常驻人员大约40人。
//
//后室自由贸易联盟（F.T.B.）
//这个松散的可疑组织由一群肆无忌惮的商人成立，其主要运作基地位于Level 230。他们没有可信的身份证明。流浪者应警惕那些冒充其成员的兜帽商人。F.T.B.具体的商户数量尚不清楚。
//
//M.E.G.Delta基地
//在M.E.G.入驻之前，Level 230因充满了敌对实体而臭名昭著，并被公认为不宜居住的层级。任何一个误入该层级的流浪者都会祈祷能找到尽快离开的办法。
//
//然而，随着M.E.G.的到来，常驻约100人的Delta基地拔地而起。M.E.G.在保卫基地周边地区的同时修复了附近老旧的基础设施，并肃清了这一区域的实体。
//
//B.N.T.G.与F.T.B.等团体在那之后接连而至，开启了交易的热潮。一个名为自由运输场（F.S.P.）的社团也在这里兴起，最终形成了如今的交易区。
//
//自由运输场（F.S.P.）
//这个集聚点介于交易区与码头之间，是B.N.T.G.与F.T.B.的商人们所居住的区域。有趣的是，F.S.P.没有自己的巡逻队伍，完全依赖M.E.G.的保护免受实体侵扰。这里的居民主要居住在街道两侧的膝板房里，常驻人口大约有400人。
//
//家园酒店
//这个团体在交易区经营着一家小旅社，为该区域的流浪者提供住宿服务。他们原本的酒店位于Level 5，而他们的第二家酒店则在Level 11。
//
//B.N.T.G.230号资源提取站
//这一由B.N.T.G.建设，并已在此开采了许多资源的基地位于高度危险的陋滩，不得不需要他们使用武力保证一条从交易区通向该基地的走道。该基地开采到的资源主要包括从地下萃取的杏仁水、从房屋上拆卸下来的建筑材料，以及从鹅卵石中提取到的石膏。该基地内有20名常驻的安保人员与50名工人。
//
//入口与出口
//入口
//在Level 6.1内按下一台自动售货机的退币按钮已被证实能切入Level 230。
//许多楼层里都存在标有“打烊”字样的商店，进入后通常会来到Level 230。
//出口
//穿过一扇写有“咸味Sal的洞穴探险”的门会将你切入Level 8。
//穿过一扇写有“生锈Rick的房间改造”的门会将你切入Level 90。
//作者
//« Level 229 | Level 230 | Level 231 »
//
//Footnotes
//1. 译注：原文此处为“Backrooms Trading Co.”，即后室贸易公司，疑似笔误。
//2. 译注：原文为“Smiler Juice”，不是任何主站已有的物品。结合上下文来看此处应为驱笑剂，疑似笔误。
package lvls2x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl230{}