//Level 283
// 
//
//生存难度：
//等级 3
//
// 
// 
// 
//Level 283是一座巨大且结构复杂的迷宫乐园，于2016年12月14日被B.N.T.G.发现。B.N.T.G.的商队“万亩黄金”在穿越Level 10时接触到了一块陌生的方形蓝色小麦地，这也被证实为M.E.G.与B.N.T.G.所知的第一条通往Level 283的入口。
//
//l7Ve9suaKWETUkh.png
//由B.N.T.G.的“白堡”进入管道的入口之一。
//
//描述：
//Level 283的巨大结构由大量不同种类的室内游乐场结合而成。Level 283中有幽闭的小型螺旋管道、铺有橡胶垫的金属网格平台所组成的迷宫、向上延伸整整50英尺（约15.24米）高的巨大堡垒，以及深度难以测量、看似没有尽头的海洋球池。在Level 283中找到的主要资源为休息区内的食物与饮料。
//
//很多实体，例如猎犬、笑魇、窃皮者、悲尸、肢团以及幼年或成年的无面灵都在Level 283内出没。值得注意的是，无面灵在本层级中的表现相当异常。幼年无面灵仅会在没有成年无面灵看管的情况下表现出自身的凶残与恶意，否则他们将一改常态，试图对流浪者彬彬有礼。成年无面灵通常会坐在Level 283中用餐的桌椅旁，也就是休息区；然而，也有少数成年无面灵被流浪者在迷宫与堡垒中发现。当一个幼年无面灵被流浪者或者某个实体从物理层面上袭击时，其周围一定范围内的成年无面灵将会立刻保护那个幼年无面灵，并对袭击者展现出强烈的仇视。
//
//Level 283中也存在着一种仅出现在此层级的实体，即狂欢小丑们。正如其名，这些实体穿着小丑的衣装，并表现出极度夸张的举止。证据表明不同的狂欢小丑在身体和心理上都具有不同的特点，因此对狂欢小丑进行更细致的分类是有必要的。
//
//管道
//Level 283内存在着大量的管道，它们通常有着圆形的入口，流浪者可以选择爬行进入。管道的入口通常可以在堡垒与休息区找到。管道的直径从3英尺（约91.4厘米）到5英尺（约152.4厘米）不等，并且经常会出现交汇的十字路口或是引导流浪者垂直移动的攀爬段落。管道内的窗口皆模糊不清，并且散发微光，是管道内的自然光源。有传闻说Level 283内有窗户出没，但迄今为止还未被证实。管道的尽头是螺旋状的管道滑梯，通往休息区、迷宫和海洋球池。虽然Level 283内仅存在少量实体，但介于管道内狭小的空间，一旦在这里遭遇攻击将很难逃脱。笑魇是Level 283的管道区内最常见的实体，这里漫长而缺乏足够照明的管道对他们有着莫大的吸引力。
//
//auKUd9E7H6Ovgho.png
//从“白堡”前往Epsilon基地途中的迷宫走廊。
//
//海洋球池
//看起来无限延伸的海洋球池里有着几乎无数的海洋球。Level 283的这一区域被一层雾气笼罩，使得进入海洋球池的流浪者难以看到50英尺（约15.2米）以外的景象。从理论上来说，流浪者可以依靠其他层级内得到的特殊装备穿越这一区域，然而这些海洋球却会表现出流沙一般的性质：越在其中活动，也就陷得越深。曾经有一名流浪者深入海洋球池到了一个程度，导致他难以承受头顶海洋球的重量，从而不可避免地向下坠落，不知所踪。肢团是在Level 283这一区域内有活动记录的唯一实体，建议谨慎对待。海洋球池的出口至今仍是未知的，但是我们建议任何一位到达其入口的流浪者原路返回：只要足够用力，就可以从管道出口处的螺旋滑梯攀爬回管道内。
//
//休息区
//无论是成年无面灵所提供的适当保护还是其内出现的足量资源，都说明了休息区是Level 283中最友好的区域。长凳与用餐桌椅在休息区随处可见，每一张上面都摆放着一摞汉堡，且汉堡的包装袋上标注了汉堡的类型。在一些桌子中心的餐盘上摆放着成堆的炸薯条，其中还有一部分撒有融化的奶酪与培根碎屑。休息区内还有会喷出饮料的喷泉，通常与塑料杯、塑料泡沫碗一同出现。如果把视线从汉堡和炸薯条处移开，再看回来时它们就会被补齐。成年无面灵会坐在一些长凳和餐椅上。休息区的入口和出口联通着管道、迷宫与堡垒。
//
//休息区里有一个特殊的休息室，通往整个后室里最棒的派对喔！=）
//
//B.N.T.G.的283号资源提取站“白堡”就建立在众多休息区之一，并被成年无面灵与武装警卫把守。其主要任务为将大量汉堡与炸薯条运往其他的B.N.T.G.基地、营地，以及范围内的同盟势力。该提取站的范围延伸进入了迷宫，并在那里建立了生活区域。
//
//迷宫
//迷宫是由铁丝网栅栏搭建的、覆盖着橡胶垫的错综走廊，其边缘被用彩色的泡沫橡胶包裹。在迷宫内，流浪者可以找到大量的儿童游乐设施，例如跷跷板、秋千、旋转木马、跳房子板1、小滑梯、猴架2与秋千组3。迷宫内的部分墙壁由坚硬的塑料制成，以一种奇怪滑稽风格被装饰，还带有比例失调的门窗。不过正如在管道一节内讨论过的，Level 283内并未有窗户被发现过。狂欢小丑们在迷宫里出现的概率最大，其身边还常会有幼年无面灵围观。从管道中滑下可以直接抵达迷宫，或者从休息室中通过一扇奇形怪状、五颜六色的门也可以。通向堡垒的城门可以在迷宫中被找到。而在迷宫的某些地方，走廊会戛然而止，展露出无穷无尽的彩色塑料球，即海洋球池。
//
//有人曾在迷宫内目睹过一个瓷制的小丑玩偶，其嘴角会流出嘶嘶作响的紫色液体，闻起来就如同一桶被装在彩色塑料容器里的葡萄味苏打水。此液体已被记录为一类危险物质，具有极强的酸性。
//
//B.N.T.G.的283号资源提取站“白堡”将其生活区域设立在了一个迷宫之内。
//
//Level 283中存在一个特殊的迷宫，被那些没有敌意、且热衷于唱歌的狂欢小丑称为“广场”，是后室中所有狂欢小丑的栖息地。M.E.G.干员们尚未发现“广场”的真正所在，狂欢小丑们也拒绝向其提供相关信息，只是声称他们自己正是在“广场”出生并长大。
//
//堡垒
//堡垒是一些巨大的建筑，能够达到50英尺（约15.24米）的高度。堡垒由许多风格滑稽的彩色房间堆叠而成，每个房间内部都有一盏古怪的七彩灯泡提供照明。堡垒的出入口都是巨大的城门，宽20英尺（约6.1米）、高10英尺（约3米），可以通过堡垒内部的红色塑料按钮操控，进行下落或升起。部分堡垒的城门是从里面关上的，无法进入。堡垒的出入口连接着Level 283内的其他区域，如海洋球池、休息区、迷宫或是管道。通过管道的出口滑梯滑入似乎是进入被关闭的堡垒的唯一方式。
//
//M.E.G.的Epsilon基地位于堡垒内，能够向流浪者提供庇护，并供应食物与杏仁水。该基地内存在一条可靠的出口，通向Level 0。
//
//基地、前哨和社区
//M.E.G. （探险者总署）Epsilon基地：
//驻守着约200名探险者。
//位于通向Level 0的出口之一附近。
//友好。
//开放贸易。
//位于堡垒内。
//有武装力量。
//与“白堡”间有稳定的通道（通过3天穿过迷宫）。
//B.N.T.G. 283号资源提取站（“白堡”）：
//100名常住人口。
//与Epsilon基地间有稳定的通道（通过3天穿过迷宫）。
//有武装力量。
//友好。
//开放贸易。
//位于休息区内。
//狂欢小丑的“广场”：
//基本上充满敌意，详见狂欢小丑。
//入口和出口：
//入口
//在Level 2找到一扇外表被滑稽地涂成五颜六色的未上锁的门，打开它并来到Level 283的迷宫之中。
//一座运动场内的管道可以把你从Level 9送入Level 283的管道中。通常这样的管道必须是有着白色的发光内窗的。
//Level 10内偶尔会出现一个蓝色的小麦堆，一个小丑稻草人正好在这个堆的中间；采摘其中一条小麦将被传送到Level 283。
//在Level 22中进入一辆破旧的、五颜六色且没有后座的小轿车可以直接切入Level 283的休息区。这一途径很不常见，你需要一点运气来找到这辆小轿车。如果你更幸运一点，还可以参加一场附近的派对！=）
//出口
//在休息区里有一条直通派对的出口！那是一个有一组对开门的休息室，上面用大号彩色粗体写着：FUN！= )在这里你不仅可以大吃特吃汉堡和炸薯条，我们还准备了蛋糕和曲奇饼干！快来加入我们吧！
//
//在堡垒内找到一面散发霉味儿、未作装饰的木门，切入Level 0。
//在休息区内找到一副描绘忧虑小丑的画作，尝试移动它会将你送入Level 57。
//在管道中爬行，直到管道内的地形变成锯齿状岩石洞穴，就抵达了Level 8。
//掉入海洋球池后，有很小概率从Level 4的天花板中掉出。
//在休息区的地板直接切出，到达Level 1。
//作者
//« Level 282 | Level 283 | Level 284 »
//
//Footnotes
//1. 一种绘有跳房子格子的游戏板。
//2. 一种在美国用于供儿童攀爬游戏的铁制攀架。
//3. 一种由多个秋千组成的娱乐设施，通常还伴有小滑梯和木屋。
package lvls2x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl283{}