//Level 266
// 
//
//生存难度：
//等级 3E - 环境
//
//不安全
//不稳定
//非实体危害
//BRONCHI.png
//Level 266树林的照片。
//
//描述：
//Level 266由一大簇硕大无比的浮空树根构成， 而这些树根都是由相当小的灰色树干上延伸而来。 层级中央的森林与前厅的针叶林类似；然而这里的森林早已片叶不存，甚至掉落了部分树枝，而其中又有一些树枝在异常的高度上被切下。在林地外围层级表面的斜坡则随离层级中心的距离增加而发生高度的陡降，直到这些树根在90°垂直方向上生长。而此后树根则似乎一直沿此方向无限生长。
//
//层级内永久性地笼罩着一层浓雾。由于层级内湿度极高，温度恒常维持在36°C，在此的流浪者极易感到疲倦乏力。鉴于此性质的存在，我们建议流浪者携带足量杏仁水以保持意识清醒。
//
//该层级桥接着Level 166与Level 11，作为一个Level 69的替代者与耗时更少的中转路径在流浪者中颇受欢迎。在过去，许多流浪者试图在树上张网以从此层级内的浓雾获取水资源。但这种获取水的方式在许久以前便遭弃用，而这些废弃的网仍可以被用作偏离安全区过远之人的显眼路标。
//
//盘遒树根：
//此层级内的树根拥有与后室任何其他地方都无法找到的超自然特性。除了与主干相比异常的大之外，它们还能在外力施压下缓慢地变换其形状。当变形过程对其来说是无害的时，它们便可以张开一个直径5米的大洞，成为了此层级内的主要威胁。透过这些大洞可以窥视到此层级地下的样貌：大片的树根在昼夜不息地变换形状。
//
//INCLINED.png
//一张层级外围的照片。
//
//当有物体被放入洞内时，所有的树根都会快速逼近并包围此物体。在完全闭合后，由于树根所施加的巨大外力，这个物体便已羊入虎口——一去而不回了，即使它只是部分被包裹住。在短短一段时间后，树根将会无视其大小，猛然将其拽入地下。
//
//从洞口则可以观察到被拖拽的物体会随树根的变形而发生运动，这些物体包括了流浪者已扭曲难视的尸体；尽管从物理上来说是不可能的，此种特性仍给层级地面下的人是否仍然存活这一问题平添疑云。因为这种可能性的存在，还是有大量流浪者试图营救被拽入地下的同伴，然后不幸在此过程中丧生。请牢记：任何人或物品，被一旦树根的魔爪所困，便永无还日。想要救回他们无疑是危险与徒劳之举，任何情况下都不应展开救援行动。
//
//现存图像：
//在2021年4月7日，大量照片与其他杂物被发现嵌于一小块区域的树根上。它们被发现于层级外围，一个曾未被探索过的区域。经过恰当的保护后，它们现可见于以下内容中。
//
//物品1
//物品2
//LOCKET.png
//一个金质吊坠。
//
//笔记：
//当此物品被发现时，在吊坠右侧凹槽内的玻璃已经嵌入了树根之中。
//
//锈迹斑斑的剪刀。
//
//笔记：
//此物品的一只手柄上刻有“Topiaria1”字样，还带有在后室内前所未见的装饰性纹样。
//
//此物品亦被发现嵌在树根之一中。
//
//
//照片1
//照片2
//照片3
//照片4
//照片5
//照片6
//照片7
//DANNYCUTOUTBORDER.png
//
//NOBODYCUTOUTBORDER.png
//笔记：
//这些图片与众不同，是在吊坠小盒内被发现的。
//
//建议流浪者将找到的照片移交给最近的M.E.G.前哨站。
//
//来自M.E.G.的警告（2021年4月13日）
//尽管勘探救援的禁令已被三令五申，本页面仍然被人刻意用于策划勘探行动，从而在上周人员伤亡原因上有着较大占比。目前本页面已被锁定，禁止编辑，等待进一步通知下达。
//
//入口：
//在Level 166内可以找到一条被在有光源情况下会散发微光的桦树所包围的小径。沿小径行走将会因强制因素使流浪者切入地面，将其带至Level 266。
//出口：
//有时你能在Level 266内找到一部向下运行的电梯，进入此电梯会让电梯门闭合并使电梯下行。之后它会从此层级内切出，在Level 11内的某栋公寓楼内出现。
//找到一面在层级中心附近的不沽的壁镜并从此切出会将流浪者带至Level 148。
//
//
//作者，鸣谢和授权信息
//« Level 265 | Level 266 | Level 267 »
//
//Footnotes
//1. 译注：原文单词为葡萄牙语，意思同为“剪刀”。
package lvls2x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl266{}