//Level C-84
//评分: 
//+30
//+
//–
//X
//特工‘小鱼干’：报告监督者-A，‘激光笔’兵团已成功到达资源回收点-B附近。
//
//监督者 Sphynx：进入‘猫爬架’行动第二阶段，使用磨牙玩具吸引敌方注意力，保持语音通话。
//
//（远处传来一阵狗叫声与吱嘎吱嘎的响声）
//
//特工‘小鱼干’：诱饵已掷出，成功引出‘看门狗’部队，‘激光笔’兵团正使用飞盘牵制‘看门狗’，我已成功潜入资源回收点-B。
//
//监督者 Sphynx：好，现在可以在资源回收点-B四周使用领地划分器了，是时候夺回属于我们的领地了。
//
//特工‘小鱼干’：收到。等，等下！有敌人没有走！
//j3GVxSzlwKTHRCe.jpg
//监督者 Sphynx：快找个箱子躲起来！
//
//特工‘小鱼干’：好的，我现在躲在了一袋粮食的后面。
//
//（一声破裂声响起）
//
//监督者 Sphynx：那声音是你发出的吗？
//
//特工‘小鱼干’：什么？好像是从我背后传来的。
//
//（远处传来了狗的吼声与脚步声）
//
//特工‘小鱼干’：他好像发现我了，我该怎么办。
//
//（纸箱中传来了一阵更大的破裂声）
//
//特工‘小鱼干’：他向我冲过来了，我——
//
//（一阵狗叫，猫叫混杂在一起响起，一声巨大的破裂声响起）
//
//（沉默）
//
//？？？：——操！这他妈啥…猫尿？
//
//监督者 Sphynx：‘小鱼干’？是你在说话吗？
//
//（一阵脚步声逐渐远去）
//
//监督者 Sphynx：‘小鱼干’？你在吗？发生什么事了？
//
//（沉默）
//
//监督者 Sphynx：收到请回话。
//
//（沉默）
//
//监督者 Sphynx：巴斯苔特在上，你在哪？我现在赶过来。
//
// 
//
//生存难度：
//等级 0
//
// 
// 
//无有害实体CbRZoyfXqnmUGOL.png
//Level C-84的猫形实体基地。
//
//Level C-84是后室层群C的第84层。
//
//描述：
//Level C-84表现为一座宠物店的室内，该层级的大小似乎是无限的。该层级中的一些窗户无法打开，它们投影着一座停车场与城市的画面，有时可以看到一些模糊的人影在里面行走，透过这种窗户可以知道该层级的昼夜更替遵守正常规律。
//
//在Level C-84中，距离中心处越远，该层级的结构就越混乱，从距离中心处400米处开始，该层级的走廊与房间会逐渐被大小不等的密封空纸箱填满，鉴于一些纸箱中有着该层级的出入口，目前正在对这种纸箱连通层级的方式进行研究。
//
//Level C-84中生活着近百只猫形与狗形实体，它们均有着正常人类的智慧水平与寿命，并已经有了成形的社会体系。M.E.G.花了几周的时间才让它们大致了解了“人类”，“后室”等概念。
//
//该层级中的猫与狗似乎处于一种敌对关系，它们互相之间经常会发动关于争夺装有宠物零食的房间的战争。为防止动物们受到伤害，M.E.G.出于人道主义表示会在必要时刻介入这种战争。
//
//Level C-84中有着许多四处散落的毛毯，宠物粮袋，猫抓板，塑胶玩具等物品，这些物品上均印有“后室制造”字样。
//
//基地，前哨和社区
//M.E.G.（Meow Explorer Group）
//M.E.G.1指的是Level C-84中由猫组成的社区团体，有着多支猫部队用于与狗争夺地盘，基地设在该层级的中心地段。探险猫总署由三名猫监督者领导，它们分别为：
//
//Sphynx，一只公斯芬克斯无毛猫，是这个组织的创始人，代号监督者-A
//Korat，一只母科拉特猫，负责维持猫类的秩序，代号监督者-B
//Amerair，一只公美国硬毛猫，负责收集猫抓板和运输猫粮，代号监督者-C
//探险猫总署用该层级中的电脑建立了属于自己的数据库，里面的内容主要与猫玩具的型号与宠物零食的口味有关。Sphynx称因为M.E.G.“绑架了它们基地里最优秀的特工”，它们拒绝与人类沟通与分享信息，对于探险猫总署我们了解的并不多。
//
//W.E.G.（Woof Explorer Group）
//W.E.G.是Level C-84中由狗组成的社区团体，它们没有稳定基地，分布在Level C-84各处。与探险猫总署不同，该组织由一只名为Dober的雄性杜宾犬和一只名为Mast的雄性藏獒犬领导，它们乐意与人类交流。
//
//+ 查看访谈记录
//观察者
//由M.E.G.组织的流浪者组成。
//他们会负责在暗处观察该层级实体的生活并定期向M.E.G.报告。
//发现记录
//该层级于20██/██/██被一名流浪者发现，以下是该流浪者在首次向M.E.G.提供的关于该层级的信息，为保证真实性未做处理。
//
//我先说下，我在Level C-197找到了一本叫做小动物照顾手册的书，我知道我不该看那个层级的书，但是我很好奇。
//
//但是我刚打开那本书我就发现我被传送到了一个狭小的黑暗空间里，我他妈当时要吓死了，而且外面还传来了人的说话声，我是跟冬天的鲶鱼一样一点声也不敢出。
//
//过了一会好像没声了我试着摸了一下墙壁，发现墙壁好像是纸板做的，我就试着将它撕开。
//过了一会外面传来一声很响的狗叫声，我还没反应过来一只狗就冲破了纸板做的墙壁撞在了我怀里，还有一只猫跳起来把它背上一个装满尿的瓶子砸在了我的脸上，我操我当时人都傻了。
//
//然后我用兜里剩下的一瓶杏仁水洗了洗脸，收拾了下心情，接着我看了看附近发现一堆猫和狗跑过来蹲在旁边直勾勾的盯着我，一只猫还开口说了句人话，我虽然不清楚什么状况但当时我选择了直接跑，那群猫立刻追了上来，有的好像还背着激光笔想射我眼睛。
//
//我切入了一扇墙壁，然后我就离开那鬼地方到了Level C-34，我感觉背上沉沉的，回手一抓发现居然是那只往我脸上扔尿瓶的猫抓在了我的背上，我把它带过来了。
//
//r8HZAy3bYxUu5nX.jpg
//‘小鱼干’近照。
//
//一只猫形实体被这名流浪者意外带出了Level C-84，它自称‘小鱼干’，目前正居住在Level C-11的M.E.G.站点，M.E.G.曾试图将它送回Level C-84，但它表现出极大的不情愿。
//
//‘小鱼干’经常使用别人的电脑发送邮件，为了不妨碍到正常工作，M.E.G.给它单独配置了一台内置有多款抓老鼠电子游戏的电脑，但M.E.G.正在监控它使用电脑发出的邮件，以下是关于一些邮件的归档。
//
//我已经成功打入人类的内部了。
//~特工‘小鱼干’
//
//你什么时候能回来？我们最近又丢失了一个资源回收点。
//~监督者-B
//
//我还要再卧底一段时间，研究一下人类的习性和食物是很重要的。
//~特工‘小鱼干’
//
//干得好，迟早有一天，不仅是狗族，连那些人类都会被我们控制的。
//~监督者-A
//
//我现在天天使用酷刑折磨他们，我抓破了他们的沙发，还把他们的水瓶打碎了好几个。
//~特工‘小鱼干’
//
//小心一点，我听说人类喜欢吃猫肉。
//~监督者-C
//
//入口和出口
//入口
//在Level C-197罕见地找到并打开一本名为“小动物照顾手册”的书会被传送至该层级的一个纸箱内。
//在Level C-75或Level C-35中可能会发现一个模糊的动物影子，追踪它一段时间后会来到该层级。
//在Level C-196找到一个纸箱并坐进去会来到该层级的一个纸箱内。
//出口
//切入一扇有着绿色墙纸的墙壁会到达Level C-34。
//食用该层级中的宠物粮会让你到达Level C-124，该方法仅对人类有效。
//作者信息
//« Level C-83 | Level C-84 | Level C-85 »
//
//脚注
//1. 为了防止与Major Explorer Group混淆，后文使用探险猫总署指代该组织
//2. 该层级的历史绝对没有这么长，尚不清楚这种说法是怎么来的。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1084{}