//Level C-71
//评分: 
//+17
//+
//–
//X
// 
//
//生存难度：
//安全且稳定
//精神转变
//无有害实体C711.jpg
//Level C-71的野外场景。
//
//Level C-71是后室C层群的第71层。
//
//描述
//Level C-71是一处绵延数万里的多雾森林，虽然雾气常年在森林中环绕，却仍然能有正常的阳光从林间落下。目前暂不清楚为何在不允许雾气出现的条件下仍然会有雾气的产生。正午的阳光驱散了部分雾气，使得能见度达到1000米左右，然而在夜晚，雾气将会更将浓郁，森林中的能见度不足5米。本层级330天为一年，一年中没有明显的四季，而是分为雨季和旱季，雨季的气温10~22℃，旱季的气温18~35℃。
//
//目前森林发现的乔木品种
//(1)黄桷树：高大落叶乔木，叶片较大，树势强健。
//(2)水杉：落叶乔木，枝疏叶细，树干通直高大，树形壮丽。
//(3)香樟：常绿乔木，树冠近球形。树皮灰褐色，纵裂，小枝无毛。
//(4)赤松：常绿乔木，树皮桔红色，树干上部树皮红褐色；枝平展形成伞状树冠。
//
//尽管如此，流浪者仍不需担心会遇到有害的实体。根据大量观测结果和巡逻报告，无足鸟鸟群和野生狸花猫是这片森林的唯二两种实体，它们经常会在白天与夜晚相互出现。若流浪者在森林中看到了发光的眼睛，则其为狸花猫的瞳孔散出的光线。
//
//本层级为红星建筑队的主要基地，建筑队领导人李丹带领他们的队伍，在本层级修建了许多生存设施和交通道路，以保障在此层级定居或进行交易的商人能顺利的与其达成合作。同时，这里也是许多“革命家”展露自己的野心的圣地，关于后室意志的学术讨论便在此地诞生。
//
//C712.jpg
//Level C-71的一段公路。
//
//来到此地大部分人士曾经都在红星建筑队的分部生活过一段时间，在被问道为何要前往Level C-71时，他们总是容光焕发，面带笑容的声称“自己找到了一种自由的主义”、“获得了思想的解放”、“人人平等的发源之地”之类的话语，时至今日，M.E.G.仍然还未理解许多人踌躇满志的前往Level C-71的根本原因。推测可能存在某种对人无害的精神模因，导致许多学者被其所影响。
//
//由于M.E.G.与红星建筑队曾有过多次顺利合作经历，以及许多科研人员与该组织保持长期联系和友好的学术往来，目前该层级的生存难度评估为“宜居”，流浪者可以到Level C-71定居，或者是在其中M.E.G.设立的站点获得帮助。
//
//基地、前哨与社区
//红星建筑队主基地
//生活着超过20000名建筑队成员，他们建立的城镇已小有规模。进入该层级的入口有指引流浪者来到主基地城镇的指示牌，流浪者可以在进入城镇后得到生存补助和简易住房。加入城镇的拓建劳动，或是参与社区义工团，可以定期获取杏仁水等生存物资。
//M.E.G. Level C-71前哨站
//在主城镇的西南方，有35名人员常驻于此，由城镇设立的Wi-Fi与M.E.G.基地保持长期联系。M.E.G.组织成员可以前往该前哨站获取帮助，或在专人的指引下回到M.E.G.的基地。
//“进步会”学者组织
//隶属于红星建筑队的一个主要由学者组成的学术组织，会员共60人，主要探讨与红星建筑队主流思想相符的理念和建筑队的政策，以及探讨与后室有关的“哲学问题”。
//入口与出口
//入口
//从平面石阵来到本层级的公路边缘。更新于2022年6月21日
//在Level C-73内找到一本《人民智慧》的书并翻到最后一页即可到达本层级。
//在Level C-194中的生活区内找到一个住在最南边的房屋，自称来自红星建筑队的老者居住于此，他会带你来到本层级。
//在Level C-197中找到一本封面印有红宝石图案的书，拿起它超过10分钟即可到达本层级。
//在Level C-158有一位自称“智者”的由尼卡星人成员，你可以询问它来到本层级的方法，它会引导你来到本层级。
//这是I层群来到本层级最主要的方法。在Level 11内找到一个红色纪念馆，走进纪念馆里的仓库会带你直接来到本层级。
//出口
//北边的红星矿区里有一个交通枢纽，其中有通向Level C-1、Level C-8、Level C-61、Level C-67的门。
//矿洞深处的一条矿道连通Level C-20。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1071{}