//Level C-16
//评分: 
//+70
//+
//–
//X
// 
//
//生存难度：
//等级 3
//
// 
// 
// 
//Level C-16是后室层群C的第几层？（1）
//A.第12层
//B.第16层
//C.第999层
//
//Op9hsroVZviaHX4.jpg
//一张Level C-16的照片
//
//描述：（本大题共7小题）
//Level C-16由什么组成？（1）
//A.由近乎无限个常规高中教室组成
//B.由无数走廊和楼梯组成
//C.由一大片海洋组成
//
//Level C-16的异常性质是什么？（2）
//A.任何试图记录本层的文字都会变成选择题的格式
//B.在本层逗留超过一天会立即死亡
//C.本层有着大量可正常饮用的杏仁水
//
//Level C-16中常见的实体是？（2）
//A.窗户
//B.窃皮者
//C.猎犬
//
//接触Level C-16中随处可见的试卷会发生什么？（2）
//A.试卷会消失，随后接触者会晕厥并在1小时后醒来
//B.接触者会感到一阵剧痛，随后双眼会跳出眼眶
//C.接触者会进入无法移动的状态，唯有回答完试卷上的选择题方可移动
//
//试卷上的题目后面的数字代表着什么？（3）
//A.代表着此时答题者身边的实体数量
//B.代表着本题的难度与回答失败/正确的赏罚程度
//C.代表着正确回答本题后，答题者将被传送进的层级编号
//
//（多选题）答题正确可能获得什么奖励？（4）
//A.一切危险实体会在接下来一段时间内避开答题者，具体时间随问题难度增长
//B.答题者会感到精力充沛
//C.答题者会获得数量充足的皇家配给餐，具体数量随问题难度增长
//D.答题者会被传送至离当前位置最近的安全层级
//E.答题者会在一天之后被传送回前厅
//
//（多选题）答题错误可能获得什么惩罚？（4）
//A.答题者的部分部位会骨折，具体程度随问题难度增长
//B.周边的危险实体会感知到答题者的位置，具体实体数量随问题难度增长
//C.答题者会昏厥一段时间，具体时间随问题难度增长
//D.答题者全身会感到一阵疼痛，具体程度与时间随问题难度增长
//E.答题者会立即消失
//
//基地，前哨和社区（本大题共1小题）
//Level C-16有着什么社区？（1）
//A. M.E.G.的前哨站
//B.尽管本层的条件足以形成社区，但目前还没有任何社区形成
//C.一支小型流浪者团体
//
//入口和出口（本大题共2小题）
//可以通过什么方式进入Level C-16？（3）
//A.切入Level 5的一幅关于学校的画
//B.携带着纸张进入层群C中的任何一栋建筑物都可能传送至本层
//C.在Level 98中睡着，醒来后有几率被传送至本层
//
//可以通过什么方式离开Level C-16？（3）
//A.正确回答试卷上的题目有几率被传送至其它层级
//B.切入本层的黑板会被传送至Level 20
//C.进入一扇写有“教务处”字样的门会进入Level 52
//
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1016{}