//Level C-35
//评分: 
//+23
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
// 
// 
//少量实体
//Level C-35是后室C层群的第35层，如诗，如画。
//
//描述
//Level C-35是一片结构异常复杂的庞大园林群，GPS和罗盘在这里都可以正常运作。目前已被探索的区域达到了520030000km2，边界至今没有被发现。园林的营造形制与风格都近似于前厅中的同类建筑，但个别结构对空间的分隔与联通方式违反常理，似乎并非根据人类的美学与建筑学理念所建造。本层级中有休息室、餐厅、卫生间等设施，流浪者可以在合理范围内任意使用。
//
//Level C-35的天空持续呈现明亮的单调灰白色，无昼夜循环。几名流浪者曾汇报称，发现一个模糊扭曲的、疑似天体的昏黄光源出现在天上长达数秒，但该消息未被证实。本层级不会降雨，气温为15~20℃，相对湿度在60%左右，偶有微风。
//
//Level C-35中存在大量的开放水体，其形式包括池塘、湖泊、水渠、溪流等，分布在草木和建筑间；水质清洁，经检测无毒、微生物极少且无异常作用，可直饮。但由于长期饮用本层级来自开放水体的水会可能导致流浪者产生强烈的思乡之情，并变得极为多愁善感1，建议不要持续饮用这些水超过三个月。在园林中的餐厅和茶室的后厨和仓库中都可以找到瓶装的杏仁水。
//
//5850270640d67fd5.jpg
//Level C-35中的一处泉水。
//
//本层级存在许多前厅常见的观赏植物，包括但不限于：
//
//- 收起列表
//佛肚竹(Bambusa ventricosa McClure)
//梅(Paeonia suffruticosa Andr.)
//迎春花(Jasminum nudiflorum Lindl.)
//牡丹(Paeonia suffruticosa Andr.)
//沿阶草(Ophiopogon japonicus (Linn. f.) Ker-Gawl.)
//柏木(Cupressus funebris Endl.)
//黄杨(Buxus sinica (Rehd. et Wils.) Cheng)
//
//除此之外，还有一些曾在后室其他层级中发现的特有植物，以及大量前所未见的物种。它们大都是无害的，但建议不要直接用手触摸任何从未见过的植物。需要注意的是，尽管一些植物是可食用的，但故意破坏园林的行为一经该区域的“工作人员”发现便会引起后者的强烈敌意，请不要试图通过摘取、折断或拔出等方式损坏任何植物 。若需要进食，可以根据墙上的指示牌或某些房间内随机出现的地图册前往最近的餐厅，在那里你有可能会遇见其他的流浪者。
//“工作人员”是一种尚未在除Level C-35之外发现过的类人实体，数量未知。它们身穿不同颜色的制服，肌肉力量很强，体态大致与人类相同，但面部除了大量的眼睛之外没有其他可见的特征和器官。“工作人员”会徘徊在本层级中，高效地进行从灌溉草木到清扫地面落叶等一系列养护工作；每个个体拥有属于自己的工作划区，正常情况下不会离开本区域。在持续工作8个小时后，实体会穿墙进入就近的员工通道（一扇没有锁孔的黑色铁门），并于8小时后离开通道。“工作人员”对流浪者一般会选择无视，任何交流的尝试都以失败告终；但在行动被故意阻挠或发现流浪者行为恶劣时，它们会当即停止行动，用全部的眼睛盯住流浪者，这一凝视将持续三十秒2，若流浪者继续当前的行为，“工作人员”会将其撕开，而后清理周围的残骸和污物。本层级没有其他实体。
//
//进入标注有“危险”和“检修中”的区域是不明智的。一经发现，流浪者应当尽可能地远离。
//
//69c490254cec6f88.jpg
//一张 Level C-35的照片。
//
//如前所述，Level C-35中存在餐厅等完善的设施，能够满足流浪者的生理需要，且提供持续的电能和中等强度的Wi-Fi信号。这些设施中没有“工作人员”，其内部也从未发现其他实体的踪迹，但被消耗的物资总是会在所有人离开房间后立刻被补全；正常使用造成的垃圾、异味、污渍、磨损和轻微划痕等也同样会消失。物资的来源，以及究竟是谁或什么在维持这些设施的运作，至今仍是个谜。
//
//基地、前哨和社区
//M.E.G. Level C-35前哨站
//有8名成员常驻本层级。
//林中居民
//人数在210人左右，分散在园林的各处；
//以休息室为据点；
//大多对新来的流浪者无敌意，可以与他们交换物品。
//入口与出口
//入口
//在任意有城镇环境的层级的街道上找到一头青色的雌性石狮子，触摸它脚下的幼崽即可切入本层级。
//在有雾的开阔水体上划船，有时会来到本层级的“濯尘潭”3。
//随身携带500g以上的水蚀沉积岩，有概率切入本层级的假山中。
//出口
//在假山的洞穴中徘徊超过两天，有可能会进入Level 8。
//深入一片樟树林并且在落叶中被树根绊倒，流浪者将切入巨植群落。
//通过一扇上方悬挂着“身居闹市”牌匾的、有黄铜把手的深红漆木门，总是会来到Level 11的一座公园中。
//作者信息
//« Level C-34 | Level C-35 | Level C-36 »
//
//脚注
//1. 心理上的异常会在停止摄入后的三天内逐步消失，饮用杏仁水可以有效缓解症状；若持续饮用这些水超过五个月，会因为“对于无法回家感到痛苦和绝望”而陷入重度抑郁甚至自杀，没有已知的方法可以治愈。
//2. 被凝视过的幸存流浪者描述此时会有“翻涌而上的负罪感和愧疚感”
//3. Level C-35中的一座湖泊，“濯尘潭”是刻于岸上一块石碑上的篆体中文，流浪者据此命名该湖。石碑另一面有三个衣饰华美的无面人形浮雕，剩余的碑文由三种不同的未知符号组成，无法辨识。流浪者被本层级送到此处的原因不明。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1035{}