//Level C-3
//评分: 
//+40
//+
//–
//X
// 
//
//生存难度：
//整理自口述资料
//视情况安全稳定
//可能有潜在危害
//Level C-3是一个重复无限相似房间的层级，由不同过道相连。
//
//原型房间
//不同流浪者进入该层时，所进入的第一个房间即原型房间。房间的布局或有不同，但其布局通常被认为类似“客厅”，并包含以下事物：
//
//PHO_home.jpg
//客厅的天花板
//
//吊扇、时钟、凉席
//流浪者会孤身一人切入该层，其第一时间会听到刺耳和不规律的风扇转动声与时钟嘀嗒声，在模糊的视野渐渐清晰后，声音会逐渐减小和变得整齐。随后发现自身躺卧在凉席上，视野有如戴着起淡淡水雾的镜片一般较为模糊，并感到自身十分疲惫。此时应当对着在天花板旋转的吊扇快速眨眼，使之看起来像是跑马灯般的断断续续，从而看清每片扇叶而非旋转到一起。如此反复数次，便能令吊扇停止旋转，而疲惫感也减轻。
//
//电视、台几、长凳
//流浪者在起身后会看见有一台电视，上面正在放着不知是什么节目的影像。电视里通常会有一个容貌模糊、性别不明的人，拿着演讲稿在念叨着什么。内容多为古诗词，如李白的“天地者万物之逆旅，光阴者百代之过客”，偶尔有一些前厅的新闻。
//
//电视机前方是一个台几，被疑似钴玻璃的深蓝色半透明物体覆盖，其下压着一些纸条。每张纸条上都在开头处，画有一个较大的简笔图形，图形大多为一个轮子、一条螺旋线、几条波浪线等。在图形下面的则是一些文字，据流浪者回忆称“这些文字字迹不清无法辨认，也无法通过移除覆盖物的方式取出纸条以仔细观察”。
//
//台几旁是一条木制长凳，长凳由数根或是完整或是断裂的圆木棍串连成凳面。面上铺着一层布垫，一端有个类似枕头的缝制布偶。
//
//其他
//除以上事物外，偶尔还会出现冰箱和缝纫机。冰箱通常除了还未排出的水，以及一些剩饭菜之外，就没有其他东西了。而缝纫机则散放着几件衣服，这些衣服对于流浪者来说，都过于小了。由于缺乏丝线，无法使用缝纫机。房间的北面是一面墙，上面通常会有一幅地图，或者一个贴着塑胶花纹、有几条不成字的划痕的镜子。
//
//过道
//房间除了北面固定是墙外，其他三面墙各有一处与外面相联的通口，分别为窗户、通向走廊或楼梯的门。任何带出房间内的物品，都会立即被一团与墙缝相连的黑色的丝线所缠绕，无法将其扯断。
//
//窗台
//窗户为由几块不完整的毛玻璃和铁杆分割组成的平开窗，窗旁还有防盗竖栏。从玻璃缺口向外看，可见远方有条从一侧通向另一侧的铁轨。铁轨上偶尔还有生锈的绿皮火车缓慢经过。当火车经过时，会震断生锈的栏杆。此时流浪者可选择将其取走并推开窗户跳向外面，在经历一阵坠落感后就到了“室外”。此时流浪者会发现，自己已经踏在铁轨走向上，而原先的窗户则悬挂在身后铁轨的远处。
//
//室外的景象由天气决定。当天气晴朗时，会有各个品种的花草生长在铁轨旁；当阴雨时，那些花草将会随着雨水的冲洗而溶烂；当昏暗时，所有的一切宛如勾勒在纸上的线条轮廓那样，只剩下明显的分界线。而铁轨似乎架设在一条垄梁上，垄梁两侧都是一片巨大的水域。水域不可接触，特别是在阴雨时避免踩到水域漫上来而形成的水洼。其水面倒映出的都不是当时流浪者的面容。
//
//走出“室外”的流浪者当沿着铁轨一直奔跑，追上前方缓慢行驶的火车，并往火车后方的黑色区域跳。等跳入后，做出一个拉门的动作，即可进入仿本房间。
//
//走廊
//打开门后便进入一条狭长且黑暗的走廊。走廊一侧墙壁的顶部，有一排类似墙体镂花的通风口，仅有的光线从此进入并平排照明对侧走廊的墙壁。这些光线多为不同颜色的人造光，人造光入射角度偶尔能改变从而扫到另一侧墙的更下方，照射到画在壁上的涂鸦，涂鸦多为笑脸。
//
//将耳朵贴在通风口一侧的墙上，会听到各种交通工具运转、小孩奔跑的呼唤、施工工地的作业声，等等；耳朵贴在另一侧墙上，则会听到嘈杂的谈论声、玻璃碰撞声、煤气炉呼呼声，似乎是在开聚会；而在走廊里，只有自己的脚步声回荡着。
//
//一直走下去，直到一侧墙壁的通风口停止延续。此时，穿过通风口的光线以扭曲的角度，远远地斜射到流浪者正前方，并在黑暗中鎏出一个长方形的边框。此时流浪者应站在长方形的面前，用手指敲击几下，过一会，便能进入仿本房间。
//
//楼梯
//打开另一扇门后，则进入一条无限延长的陡峭楼梯。不知何处的微弱光源，从楼梯中间的空处贯照楼梯，如同丁达尔效应一般，产生烟雾状的光柱。而流浪者无论是上还是下楼梯，总会在某一个转角发现自己不知何时走了相反的路。
//
//楼梯旁侧不规则地洒落着一些物品，如破旧的鞋子、断裂的扫把、发霉的毛巾等。而在楼梯转角处，则堆放着砖石、罐子、箱子等事物，通常除了再一个箱子外，没有东西在这些容器里面。楼梯转角杂物之上，则是一个水泥镂花窗，但被一堵墙挡住。
//
//楼梯有时会随着“室外”出现阴雨天气而产生反常的积水，亦即每级台阶表面都会产生反重力水洼。此时楼梯会有几条水柱沿着楼梯的背面的中间，快速往下流动，但就颜色来说似乎不完全是水。而楼梯的光源也会被时而闪过的雷电所替换。
//
//一直走楼梯，直到拐角平台的窗户后面不再是一堵墙。此时的窗户的水泥，可以直接用手轻易地搓碎为粉末，但要小心受伤。穿过窗户便能进入仿本房间。
//
//仿本房间
//仿本房间是原型房间的不完美复制，流浪者都会在进入时同样卧在一张凉席上，但在其他方面上会存在不同的差异。
//
//其一是，随着进入仿本房间的数量增多，下一个仿本房间中，就会有更多几率出现各种原本不应放置于客厅的如三轮车之类的物品，以及流浪者在后室中所见闻过的“后室物品”。其中，“后室物品”会替换掉房间内的日常物品的位置，但并不会有异常性质。若房间内有剪刀或其他钝器的话，对着“后室物品”用力击穿后，便发现这些物品，是由外层硬壳及其包裹的碎棉、破布组成的。
//
//其二是，经不同过道所进入的仿本房间，通常会有各自明显的特征。或者说，室内结构与布局有不同的特定主题，分别是：
//
//载具式
//经窗户过道可进此。该类房间特征是，房间会变得狭长，并与各种交通工具内的特征相混杂，例如室内物品都被重复地紧凑地摆放在两边，并生成一些并排的座椅，只在中间留下一条路；电视内容则变成安全须知，以及各种广告。而时钟却嵌在座椅上，时针与分针的轴上带着一根发条。同时空气变得混浊，并随着复数个吊扇的转动而伴有轻微的摇晃。
//
//流浪者在该类房间会出现不同程度的晕动症和疲惫与饥渴感，如需走出去则必须在房间里找到利器，割断被许多条安全带所交错拦封的通口。
//
//大堂式
//经走廊过道可进此。该房间为一圆形的约100平方米的空阔场所，原先的家具分散其间，并相互分隔较远。房间约有30多米高，其顶部中心处悬挂着一个约占四分之一天花板的吊扇，吊扇的中心处延伸出多条电线，吊挂着一台播放肥皂剧的大电视。
//
//三个通口处各自变成一块LED屏，屏幕上滚动着各种名字，包括各类组织的名字和实体的编号。当滚动到流浪者自己的姓名时，屏幕会显示出一扇门，在屏幕变得闪烁花乱之前，流浪者便可以推开屏幕，否则得等到屏幕恢复并重新滚到自己的名字才能出去。
//
//无常式
//经楼梯过道可进此。该类房间的结构基本没有什么差异，除了房间内的物品的新旧程度有所改变外。通常进入该类房间，房间物品会随着进入次数的变多，先是会变新或者变成其他相似的新物品（如旧家具变成新家具）变多，然后逐渐变破旧和变少，以及一些无异常的结构的变化。有时地面上会散落一些无法识别面容的塑胶照片，有时摆放着一些塑料玩具，有时长凳的垫子上会出现一大块长条的恶臭污渍。
//
//在进入多次后，该类房间的布局会被固定。此时夕阳会从锈蚀和破碎的玻璃窗外照射进来，并照在席子中间的一个布包上，那是凳子垫子所包裹的开裂的布偶枕头。一条绳索垂挂在吊扇下，折断的长凳一侧丢弃着一些药盒，电视机虽然没有画面，但音箱里还是传出了微弱的电磁噪声。
//
//各个通口都挂满蜘蛛网和积累着厚重的灰尘，将其打开便能出去。
//
//实体
//在各个仿本房间中，有时会出现几个无面灵或悲尸。它们大小不一，空着手做出似乎拿着什么东西的手势，用听不懂的咕哝声说话，聚在一起不知道在干什么。此时不应与其接触，或者在其谈话打断它们，免得遭遇其攻击和咆哮。当遭受攻击时不能还手，否则会遭受更严重的攻击，除非感觉到它们打算弄出致命伤。
//
//出入口
//入口
//尚不明确，不过似乎切入该层的人，多数会抱有想回到前厅的信念，但并不坚定和具体。
//
//出口
//当至少每个类型的房间都走过10次，并对行走在这些这些房间中的动作和对房间本身产生倦怠之情后，则会来到一间大部分日常物品被“后室物品”替换的房间。其中北面墙壁上的镜子没有对房间的倒影，只有流浪者的身影，其余则是一片空白。
//
//镜子会有微弱的精神暗示，吸引流浪者靠近。当流浪者选择靠近镜子而非远离时，则会下意识地将头抵在镜面上，并随着精神暗示的引导回想自己在后室中的生活。当流浪者回想了很长一段时间时，会发现墙壁有所不稳。此时一用力，就能将镜子墙推倒到后方。
//
//镜子墙被推倒后，伴随着玻璃破碎声，整个房间的其余墙壁都立即消失不见，仅剩下一片潮湿的黑暗。此时唯一的光源便是碎在黑暗之中的镜子碎片。捡起碎片后，可以看到碎片之中映着某个层级的景象。此时，流浪者应当对着镜像中的路，倒退着走动。若是不避开镜像中所指示的障碍物，甚至直接穿行的话，会令镜像变红，越是偏移红色越是深，直至一片猩红看不清任何东西。
//
//在顺着镜像里所折射出的路，在黑暗中行走了好一会后，可以在镜像中看到镜像里出现了一扇门（尽管对应的层级的相应位置并不一定有这扇门）。在调整碎片的角度，使这扇门被完整地包含在碎片镜面之中时，碎片会不再显示那个层级的景象，而是映照着流浪者，以及其身后突然出现的大门。流浪者不能在不借助碎片的情况下观察到那扇门。
//
//流浪者在手持碎片倒退行走到那扇门时，会一脚踏空，然后坠落到 Level 0 或 Level C-1 之中，切回最开始的地方。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1003{}