//Level C-54：
//长险
//七
//号公路
//等级：1E	较安全	环境危害
//↓ C-53	↑ C-55
//Level C-54是后室C层群的第54层。除同行之人外，于该层级中无法与其他流浪者相遇。
//
//描述：Level C-54由一无限长度的公路与两侧无际的荒漠草原组成，公路两侧时常会立有路牌，但路牌上的文字通常难以辨析，且不属于任何语言。该层级拥有稳定的昼夜循环系统，大多数时间保持在晴天状态，其中日光与月光呈天蓝色，而天空呈橘红色，且该层级光谱疑似与前厅较为不同，故造成此现象。同时在该层级中，若流浪者向两侧的荒漠草原深处进行探索，则会从公路另一侧返回。
//
//Photo_Road.png
//Level C-54的早期照片，拍摄于1973年，左侧路牌的文字无法辨析。
//
//在流浪者刚刚进入该层级时，其身旁便会同时产生一辆无限能源的汽车，流浪者可通过驾驶汽车来于该层级内行驶，亦或是独自在道路上行走。倘若流浪者选择徒步行走，其便会在步行约50米后回到原地。而汽车上会提供可供流浪者使用的物品，包括但不限于：杏仁水、冰镇运气款幸运豆奶、便携Wi-Fi、塞满六颗子弹且无法取出的“后室轮盘赌”、千斤顶、备胎等物品，但都无法带出该层级。
//
//同时，在Level C-54中大多数流浪者都报告称其遇到了很多低概率事件，普通的事件概率也将大幅提升，且无一例外都为负面或较恶性的事件，如：
//
//风滚草从车旁滚过时摩擦出静电，导致风滚草被点燃，然后有零星火苗从车窗落入，导致隐私部位烧伤。
//左侧两个车门全部故障，并且在车辆停下时右侧车胎爆胎，导致车辆向右倾斜，右侧车门全部被路边石柱挡住。
//在路边野营时，驾驶位的物品掉落砸到油门，而车辆还未熄火，导致被汽车撞伤。
//在野外睡眠时因炎热苏醒，并在处于中暑边缘时睡袋拉链卡住，且脚部与睡袋内部的线头勾到一起，导致无法及时离开睡袋。
//在车辆内睡眠时因寒冷苏醒，而车辆内的空调无法关闭，车辆钥匙也掉落在车辆缝隙中，导致无法及时离开车辆。
//但这些事件几乎都并未造成过重伤害，且以一些报告表明这似乎与个人运气相关。而由于该层级的环境较为优美与层级内提供的物品十分丰富，导致许多流浪者进入该层级游览。
//
//基地、前哨与社区：因其异常性质，该层级无任何基地、前哨与社区。
//
//入口与出口：在生存难度0~3的层级内注视公路，触发“异视”现象，即可来到该层级。关于出口，该层级出口极多，通常是流浪者经历一些突发事件后伴随事件离开了该层级，并且流浪者将到达的层级也十分随机。
//
//附录：录像带《后室电台工作室 “游房逛室” 第148期 未剪辑版》
//
//Tape.png
//“游房逛室” 录像带 tape1
//
//文字记录：tape1 片段13
//时间：BTC-11/15-12:48
//
//<片段开始>
//
//*镜头摇晃*
//
//Ralph：调试好了吗？
//
//Parker：别急……
//
//*模糊的画面*
//
//*镜头摩擦声*
//
//Parker：OK，完事了——呦！流浪者们，无论你现在所处何处所处何时，都请允许我向你问一句好！让我们用微笑面对每一天，然后干爆这后室！这里是Parker和他好兄弟Ralph的半月一更节目“游房逛室”第148期！
//
//*镜头倾斜*
//
//Parker：各位或许会好奇，为什么今天Ralph不在？哈！那是因为他太虚了，最近病倒在床上，喝他那连牛奶都没有的咖啡了！所以今天只好由我一个人来主持这期节目，而Ralph会在无线电后跟我互动。
//
//Ralph：你脑袋就光滑的跟个蛋一样，咱们半斤八两好不好？！
//
//Parker：去你的。回到正题，今天我们来到了Level C-54，听说许多人都来到这里度假游览，带上亲朋好友，重新回顾在前厅中那种公路旅行的感觉——虽然我没去过前厅，顺便看看自己是哪种倒霉蛋！让我们来看看我会抽到什么车呢？
//
//*Parker移动到了镜头后*
//
//Parker：操……
//
//Ralph：怎么了？抽到辆你老爹扔车库里十几年落了好几层灰的桑塔纳？
//
//Parker：不是，摄像机被吹歪了，又得重录……
//
//<片段结束>
//
//文字记录：tape1 片段47
//时间：BTC-11/15-14:14
//
//<片段开始>
//
//*黑色画面*
//
//*拧钥匙声*
//
//Ralph：听我说你别急。
//
//Parker：去你——
//
//*引擎启动声*
//
//Parker：啊，算你识相。
//
//Ralph：打上火了？
//
//Parker：打上了，但我怕又出什么幺蛾子。
//
//Ralph：没事，录就是了。
//
//Tumble.png
//*摄像机被拿起*
//
//Parker：我他妈好像没关摄像机……
//
//Ralph：管它呢，快开始录，浪费了两小时了。
//
//Parker：回去我指定要找你算账。
//
//Ralph：别废话。
//
//Parker：欢迎回来！这里是Parker，现在，让我们正式开始我们的公路之旅！
//
//*脚踩油门的特写*
//
//Parker：操！熄火了！干你妈的——
//
//<片段结束>
//
//文字记录：tape1 片段89
//时间：BTC-11/15-16:54
//
//<片段开始>
//
//Road.png
//*在公路上行驶*
//
//Parker：看看这风景，多么美丽啊，原来还有这般能让我静下心来的桃源。
//
//Ralph：你刚才的心可没这么“静”。
//
//Parker：闭嘴，虽然我刚才遇到了很多不快，但现在我原谅它了。让我们听听歌，放松一下心情吧！
//
//*车载音乐声响起*
//
//*开始播放《爱恨情仇》*
//
//Parker：我的爱是如此廉价，使得你狠心抛下~我虽曾低贱，但如今我富贵荣华，你早已高攀不起，请你忘了我吧~
//
//Ralph：啧啧，你的音乐审美真够独特的。
//
//Parker：可去你的吧，你也不见得好到哪去。
//
//*开易拉罐声*
//
//Parker：以幸运豆奶代酒，让我们致这后室！
//
//*吨吨吨*
//
//Parker：不亏是幸运豆——等下……这好像不是香蕉味的……
//
//Ralph：你到底有没有看我发你的文档！
//
//Parker：我还真没有看，等我翻一下……
//
//*磕碰声*
//
//*音乐音量升到最大*
//
//Parker：嗷！啊操，擦到音量键了！
//
//*刹车声*
//
//Parker：操你妈——
//
//<片段结束>
//
//文字记录：tape2 片段62
//时间：BTC-11/15-18:06
//
//<片段开始>
//
//Parker：不想拍了，已经拍完一卷录像带了，你看这才拍多少。
//
//Ralph：也是，休息一会吧。
//
//Parker：快日落了，要不拍拍日落？就当延时摄影搞。
//
//Ralph：好想法。
//
//Sunset.png
//*太阳落下*
//
//Parker：其实也挺美的，就是这里太让人恼火了。
//
//Ralph：你跟我说这些干什么，我又看不到。
//
//Parker：行吧，回去给你看。我先把摄像机架这里，累死我了，我先睡一会。
//
//Ralph：晚安。
//
//Parker：晚安。
//
//时间：BTC-11/15-22:02
//
//Parker：诶我操，什么声？
//
//*车外响起雷声*
//
//Parker：这里不是他妈一直都是晴天吗？嚯……风还挺大。
//
//*风声呼呼吹过*
//
//*雨滴顺着风砸到车窗*
//
//Parker：我操怎么回事，这车感觉要被掀起来了。诶——
//
//*花屏*
//
//*长时间的杂声*
//
//Fall.png
//*相机掉落*
//
//<片段结束>
//
//文字记录：tape2 片段63
//时间：BTC-11/15-22:21
//
//<片段开始>
//
//*摄像机被捡起*
//
//Faceling_Pick.png
//*镜头朝着Parker*
//
//Parker：诶我操。Ralph快醒醒，醒醒，RALPH——你——快——醒——醒！
//
//Ralph：大半夜你喊什么喊。
//
//Parker：你他妈猜猜我掉到哪里了？！Level 8！操！
//
//*摄像机摔落*
//
//<片段中断>
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1054{}