//Level C-29
//评分: 
//+34
//+
//–
//X
// 
//
//生存难度：
//等级 2
//
//不安全
//不稳定
//大量无敌意实体
//Level C-29是后室C层群的第29层。
//
//描述
//0bdc7b5785f9218e.jpeg
//Level C-29
//
//环境与实体
//Level C-29是一个面积无限且高度在6~7米间的平坦空间，表面分布有大量的人形实体以及少量的非人形实体，这些实体始终处于朝向相同的单向移动的状态。
//
//Level C-29的具体装潢因人而异，流浪者普遍报告其切入的Level C-29的地板主要由花色或白色瓷砖、灰色石砖、黄色盲人道等组成，该层级的照明主要来自天花板上的白色荧光灯。故此Level C-29被描述为“很像哪个地铁站或者地下通道”。
//
//Level C-29的人形实体团中的每个实体已确认为个体实体1，目前“行人”数量极大且不可计数。“行人”外部特征与人类极为相似2，外观年龄在25～45岁不等。可观察到的全部“行人”具有与人类相同的面部特征，但大都面无表情、眼神涣散。大部分“行人”衣着工作西装，但也存在少部分“行人”穿着其他服饰，包括但不限于蓝白相间的无标识校服、工装、警服、便服等。
//
//值得一提的是，自Level C-29被正式收录以来，极少量流浪者报告在该层级中发现身着M.E.G.工作服的“行人”出现在“人群”中。
//
//据报告，大部分“行人”在移动时使用电子产品，包括查阅手机、佩戴耳机听音乐，拨打电话等。但由于手机屏幕亮度过高而无法观测到其显示的内容。3
//
//“人群”在无意外时，以恒定的5.4km/h的速度向固定方向做匀速直线运动。“行人”以高密度站位，每个“行人”之间的空间极小。若流浪者在“人群”停下，将被后方的“行人”撞倒，若流浪者无法及时起身，将持续遭到“人群”的踩踏，直至死亡。对此，流浪者在Level C-29中意外倒地后，应及时采取有效的防护措施。待遇到较大的“行人”间的间隔时，起身再次进入“人群”。
//
//所有“行人”均无敌意，不会主动或被动攻击流浪者。若主动攻击“行人”，将引发“人群”恐慌4，并提高其移动速度，使流浪者遭遇踩踏事件的概率大大增加。任何武器对“行人”都不会造成实质伤害。“人群”会保持高速运动，直至流浪者到达终点。
//
//任何尝试与“行人”的沟通均以失败告终。
//
//Level C-29内存在少量其他已知的非人形陆生实体，包括无面灵、肢团、猎犬、窃皮者等，均不具有任何攻击性。经推断，这些实体均非该层级原生实体，具体来历不明。除外表不同外，这些实体的其他特性与行为均与“行人”相同，永远漫步于“人群”中。
//
//性质
//流浪者切入Level C-29时将处于站立状态，可自由移动空间仅有0.6～0.7m²，流浪者切入该层级后仅有3秒的反应时间。当流浪者意识到自己已进入Level C-29时，应立即开始随“人群”流动方向移动，以防遭遇踩踏事件。流浪者跟随“人群”行进完全程后即可离开该层级，即到达终点。
//
//流浪者在Level C-29中的具体需要移动的路程因人而异，如果流浪者主观认为“人群很长”或“到终点要花很久”，则其需要与“人群”保持移动的路程将大幅延长，到达终点所需时间同样会随之增长。目前与“人群”的可移动路程理论上无上限。
//
//任何尝试超越、突破、干扰、阻止“行人”的行为均被证明是无意义的。
//
//所有离开Level C-29的流浪者均报告在随“人群”移动时，会听到脚步声、无法识别的交谈声、手机彩铃声、无法识别的音乐声等，尽管经调查所有“行人”及其电子产品均未发声。
//
//空间上，进入Level C-29的流浪者均无法相遇，即使两名及以上的流浪者几乎同时切入该层级。但有流浪者报告称其可与“似乎离得很远的”声音进行简单交流，该种说法目前无法得到证实。
//
//根据报告和实验，流浪者切入Level C-29后将受以下四个阶段的精神影响5：
//
//第一阶段：30分钟时，逐渐出现厌倦感和劳累感等。
//第二阶段：3小时后，感受到无力和迷茫等负面情绪，并称“想要停下来休息”。
//第三阶段：5小时后，产生自我怀疑、自我否定、自我放弃等等类似“认为自己很失败”的想法。
//第四阶段：10小时后，出现无法识别的自言自语，数分钟后只能识别出流浪者的呼吸声和背景“人群”的脚步声及交谈声。尽管流浪者与外部的通信保持通畅，但所有报告均表示不管如何呼唤都无法再次得到流浪者的回复。值得注意的是，所有音频记录中均未出现“重物碰触地面的声音”等可推测流浪者倒地的声音，故可以排除流浪者遭遇踩踏事件的可能性。6
//及时摄入杏仁水可有效缓解上述影响，以上精神影响均会在流浪者离开该层级后消失。
//
//无论如何，我们都建议切入该层级的流浪者若无特殊情况应尽快离开该层级，不要长时间逗留。
//
//物资
//本层级Wi-Fi信号极强且稳定，流浪者可以使用任何随身携带的电子产品，但并不建议流浪者在该层级中毫无节制的使用电子产品，以免无意识地延长移动时间。
//
//Level C-29的资源分散在每个“行人”服饰的口袋或随身行李中。已知可得到的资源包括瓶装杏仁水、火盐和罐装龙肉等，甚至皇家口粮。同样存在一些前厅中的物品，包括但不限于打火机、公交卡、充电宝、眼镜盒、口香糖、香水等。所有资源以10分钟为周期刷新，存在随机变动。
//
//若流浪者企图偷窃或抢夺“行人”的物品时，将出现上文中与攻击“行人”相同的情况。但流浪者偷窃正在使用电子产品的“行人”的物品时将不会造成任何影响。7
//
//更新：据部分流浪者报告，自2020年以来，大部分“行人”佩戴了各式的口罩。
//
//基地、前哨与社区
//由于此地具有极强流动性，该层级不存在任何已知的基地、前哨和社区。
//
//入口与出口
//入口
//无城市生活经历或出生在后室的流浪者无法切入Level C-29。
//当流浪者在任意层级意识到自己现在应当步行去工作或学习时，有一定概率切入Level C-29。
//在Level C-11中进入外观类似于地铁站进站口内并停留10分钟即可切入Level C-29。
//在Level C-61里的2号交通枢纽乘地铁前往1号交通枢纽有概率在离开地铁车厢时切入Level C-29。
//进入Level C-195一处地铁换乘站，在换乘通道里可从地板切入Level C-29。
//出口
//跟随“人群”行进完全程后将随机切入Level C-18、Level C-23的办公房间或Level C-28中的地铁出站口或地下通道一侧出口。
//可以通过什么方式进入Level C-16？（2）
//A.倒立行走
//B.在任意一名身着蓝白相间的无标识校服的“行人”的书包里找到一个铅笔盒
//C.骑在“行人”脖子上
//在踩踏中坚持20分钟时将切入Level C-21。此方法极其危险，不建议尝试。
//抢夺身着警服的“行人”的配枪，会切入Level C-22。
//在“行人”随身物品中找到一瓶手部消毒液或一卷手纸时将切入Level C-32。
//阅读任意类型的纸质书籍超29分钟将切入Level C-197。
//作者信息
//« Level C-28 | Level C-29 | Level C-30 »
//
//Footnotes
//1. 下称个体实体为“行人”，人形实体团为“人群”
//2. 请注意，有别于无面灵
//3. 拍照后调暗处理也不可行
//4. 主要体现为尖叫、奔跑、大声呼喊等
//5. 以下均来自离开该层级的流浪者的自述和其携带的音频或通信记录
//6. 任何未在10小时内离开Level C-29的人员均将被判定为失踪
//7. 正在被使用电子产品无法偷窃
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1029{}