//Level C-88
//评分: 
//+29
//+
//–
//X
// 
//
//生存难度：
//等级 Endosoma
//
//不安全
//不稳定
//位于生物体内inside.png
//Level C-88风光，拍摄者不明。
//
//Level C-88是后室C层群的第88层；本层似乎位于某不明生物（订正：现已查实，应为实体██）的消化道内。
//
//描述
//Level C-88是实体██部分消化道与一系列位于其中的陆地板块的总称。该层级宽约88千米，长度未知；目前只有8829千米被探明。该层级底部被实体██所分泌的消化液所填充，此种液体成分未知，对有机物，骨骼与金属腐蚀性强烈，且拥有一种特殊性质：即浸没于该液体中的生物不会因为受到腐蚀而失去意识，死亡或感受到疼痛，即使躯体全部融化也是如此。据进入到该层级并于此液体接触的流浪者称，在被消化过程中可闻到一股“淡雅的香味”，且感受对此不一而足，但通常被描述为“愉快的”，“温暖的”，“就好像惬意的午后在家中沐浴一般”；除此之外另有在该液体附近时会受到精神影响（有“放松感”，脑中产生类似于“永远留在这里”，“成为该层级的一部分”等一系列想法，身体不由自主的试图接触该液体。）的报告，因此强烈建议避开存在此液体的区域。
//
//除此之外，在消化液中偶尔可见上负有不同的地质或人造结构的陆地板块存在，目前已发现的板块面积约在20平方米至71.66平方千米不等。板块无根基，会因消化器官的蠕动而漂移，聚合，解体甚至崩解沉没。对板块上人造结构的探索未发现有实体存在，但发现一些在其他层级中的寻常物品1随机出现在此处。目前有关于本层级内大陆板块来源的调查与研究还在进行中。
//
//基地、前哨和社区
//M.E.G.先遣队“约拿”（The Jonah）
//是一支有86名成员（曾为88名）的探索小队。
//由于本层级的陆地板块结构不稳定，因此没有固定基地。
//“全程游览者”（Full Tourist）
//一个约有6名成员的流浪者群体，目的是探索本层级长度的尽头。
//几乎全部是吞食性爱好者（vorarephile）。
//目前已失去与该组织的联系。
//入口与出口
//入口
//在浏览过某些艺术作品2后在任意层级切出有几率进入本层级。
//有传言称在Level 7被该层级的特有实体囫囵吞下将会进入本层级。3
//吞食性爱好（vorarephile）者在跨层级切出时有很大几率切入本层级。
//出口
//正在调查中
//作者信息
//« Level C-87 | Level C-88 | Level C-89 »
//
//Footnotes
//1. 如杏仁水、幸运豆奶、饮用水、电池、应急食品等
//2. 如《圣经〈约拿书〉》，《木偶奇遇记》，《克洛诺斯食子》；目前那些艺术作品与本层级的联系正在调查当中
//3. 此条存疑，M.E.G正在研究此方法是否真实以及对该传言进行溯源
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1088{}