//Level C-32
//评分: 
//+38
//+
//–
//X
// 
//
//生存难度：
//等级 2
//
//较安全
// 
//大量实体
//折叠
//目录
//描述
//构成
//雄性盥洗室
//雌性盥洗室
//中性盥洗室
//母婴室
//规则
//基地前哨与社区
//入口
//出口
//Level C-32是后室C层群的第32层。它表现为一组公共盥洗室。该层级的最显著特征在于此处的实体如同前厅的人类在公共盥洗室一般行动，因而失去攻击性，显得“温顺并且很讲规矩”1。
//
//描述
//构成
//Level C-32包括以下部分：一堵洁净的开有四个门的白墙，依次通往一间雄性盥洗室、一间雌性盥洗室、一间中性盥洗室和一间母婴室。
//
//雄性盥洗室
//雄性盥洗室通常从位于最外端的门进入。穿过一段短走廊，拐过一个直角弯，流浪者们将来到一个面积约50㎡的房间。
//
//正对面通常是一排厕所隔间，个数在5~10个之间变动，具体数量与当时盥洗室中的人类及实体数量有关。隔间内部皆设计有马桶，除去尺寸出奇大之外（桶沿直径约0.5m，出水口直径约0.2m），与前厅的马桶大致相同。
//
//隔间对侧的墙上及地面上固定有同样个数的小便池，离地高度/离墙宽度25cm~2m。房间两侧被干净的洗手台及镜面占据，配备有一台烘干机及数瓶颜色大小不同的洗手液。鉴于一些种类洗手液具有特殊的理化性质，它们有概率对人类造成不可逆转的伤害，需谨慎使用。
//
//构成所有洁具以及地板和墙砖的材料类似于白色陶瓷，被证明为坚硬且高度耐酸。
//
//雌性盥洗室
//雌性盥洗室面积和布置与雄性盥洗室大致相同，但用额外的隔间替代了小便池。
//
//此处洗手台旁添置了一些搁架，放置有洗发水，啫喱膏，疑似补妆用的各式色笔及膏状物2。其中部分物品作用如下表。
//
//物品	作用	备注
//橙色口红	使使用者2小时内通晓各国语言文字	类似于巴别香膏
//香粉，外盒上印有“蝤蛴” 字样	扑打在颈部 ，对于人类，能使颈部延长至70cm左右	这通常会造成颈椎和周围血管肌肉等大量断裂
//黑色眼线笔	使眼球增大	直至占据颅内70%空间并持续至卸妆，但不会对人体造成实质性伤害，原因未知
//眼霜	未知啊啊啊啊啊啊啊啊啊啊啊啊救啊啊啊啊啊啊啊	你好∵）
//值得一提的是，隔间内部墙壁通常固定有小盒，内装数包粘性的吸水贴片或固定有松紧带的吸水条。请勿将这些物品用于女性卫生之外的用途，否则可能导致接触它们的皮肤溃烂/物品腐蚀。
//
//中性盥洗室
//与雄性盥洗室布置完全相同，也具备少量雌性盥洗室中的日用品。
//
//大部分情况下，在这里进出的主要为缺乏性别或雌雄同体的实体。某些人类也被允许使用该盥洗室。但因为此处的规则相对严苛，除非能够确定自己拥有使用权利，否则请不要进入。
//
//母婴室
//母婴室是唯一入口有门扇的房间。由此可以间接判断其他盥洗室的位置。
//大小约25㎡，灯光相对柔和，由粉蓝条纹浴帘分成五个隔间，每个隔间内有一组高矮不等的小桌及软椅，配备自发热毛毯。
//在这里可以找到装有纸尿裤的箱子。其中一些尺寸极端大，推测对应的实体母体已经超过了房间的大小，尚不知配备这一部分物资的意义。
//除非紧急情况，不建议母亲们在婴儿身上使用这一区域内的任何物资。
//
//规则
//以下规则适用于一切人类及实体。
//
//我希望所有流浪者都能严肃对待。这里生存难度标为2是有原因的——规则有时比实体还要危险，譬如说在这里。3
//
//公共卫生
//请配合保洁员的体温测量。他们很饿。
//不允许将任何脏物有意涂抹或喷溅在墙上和物品上。执意这样做的结果是被传送入一个肮脏且危险的层级，例如Level C-32.1。
//如果进入者是人类或有着衣习惯的实体，衣着需得体。
//切入后室时间尚不满14天的使用者需佩戴口罩。
//将盥洗室中任何物品（除正在使用的吸水贴片等）带出的行为是不允许的。漫游者将在迈出门口的一瞬间消失，同时带出的物品会呈双份出现在盥洗室原位。
//
//
//事情就是这样，马主管。他人不见了，留下的相机里所有的部件都向外流乳汁。
//
//个人隐私及安全
//使用完之后，请马上离开。无理由地逗留过久将会导致人员失踪。
//不允许发生跨种的肢体冲突。这也是此层级实体倾向于避免攻击人类的原因。
//盥洗室的任何位置都不允许拍照。
//与性有关的笑话是被禁止的。在解剖盥洗室周围拾取的一只脸球尸体时，研究人员发现它的声带及上呼吸道完全被异常增生出的外生殖器塞满。
//任何走错盥洗室的行为都会导致性别的不可逆转变。
//在中性盥洗室内，任何被认定为“性别刻板”的言论都会导致发言者的[数据缺失][数据缺失]
//
//
//保洁员
//保洁员是一对亚细亚猎犬4
//保洁员负责一切体温测量以及清扫的工作。无事时，他们在盥洗室外的墙下徘徊。
//保洁员并不受以上规则约束，但除非有紧急情况，他们会自觉遵守规则。
//保洁员们对侵犯深恶痛绝。当你受到他人骚扰，可以呼喊“毛茸茸先生/女士”向它们求助。
//基地前哨与社区
//本层级不存在已知的基地，前哨与社区。
//
//入口
//承载有四个盥洗室门洞的白墙会在任意层级随机出现。进入对应的门，即进入Level C-32。
//出口
//原路返回，流浪者将回到原本的层级，同时入口将消失或变得不可进入。保洁员也将不再响应你的呼唤。
//尝试自杀，流浪者将进入Level C-320
//作者信息
//« Level C-31 | Level C-32 | Level C-33 »
//
//脚注
//1. M.E.G.（Major Explorer Group，下同）成员陈文的记录中如此提到
//2. 在M.E.G.的后续调查中得到证实。
//3. M.E.G.卫生委员会主管，马杰岩
//4. 猎犬的一个亚种，身形较小，毛发较旺盛，可以短时间直立，通常群居，具有类似于七岁儿童的智力。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1032{}