//Level C-75
//评分: 
//+30
//+
//–
//X
// 
//
//生存难度：
//等级 2
//
//安全
//稳定
//实体横行
//Level C-75是后室C层群的第75层。
//
//描述：
//Level C-75是一个东西方向长度约一公里的线性循环空间。该层级表现为一条城市内的河道，约十米宽。河道两侧各有一条宽度一米的道路；道路旁为高度半米的平台，平台向外延伸半米并充满土壤，大量植物在此生长；平台的尽头竖立着高约两米的铁丝网围栏，尝试翻越围栏时，流浪者将会感觉到一阵酥麻感并无法发力直到放弃翻越；围栏外则是一条两边种植杨树的单车车道。该层级的一天与前厅一样为24个小时，并且气温保持在15℃-20℃之间。
//
//C-75
//一名流浪者上传的Level C-75环境照片，通过雾气隐约可以看到那座桥梁
//
//进入该层级时，所处的位置永远是在河道北岸，目前从未有过流浪者提交过关于进入层级位于南岸的记录。并且南岸被流浪者报告出现大量实体，包括：笑魇、肢团、钝人、猎犬与悲尸以及河道管理员等其他大量敌意实体。
//
//层级内始终笼罩着薄雾，并且在西侧可以看到一座桥，桥上隐约可以看到有汽车与行人经过，但无论用何种办法都始终无法与那座桥梁拉近距离；栅栏外也经常会出现车辆与行人，但无论怎么与其交谈，行人们都会表现出听不见一般无视栅栏内的流浪者。栅栏外的场景似乎不是与栅栏内一样的线性循环空间并且从未出现过任何实体，目前已报告过的场景：针叶树林、一道很长的围墙、玉米农田、一个农村。种种情况表明，栅栏外似乎与前厅十分相似或者就是前厅的场景。
//
//层级内拥有Wi-Fi并且河岸道路边的平台侧面，每50米就能看到一个电源插座但只有一个插座的颜色为蓝色，流浪者们将其称之为中心。中心向任意方向走出400米左右就会看到围栏外扩并将部分杨树扩进栅栏内部，层级内的植物每经过48小时便会重新生长至之前的状态，部分植物被一些流浪者称之为“野菜”并可以食用。
//
//河道内经常会出现各种生活垃圾并且流淌的液体似乎是一种过度混浊的杏仁水。
//
//一定要煮沸之后再喝，我他妈的拉肚子了一个星期！！！
//请勿将个人经历随意写入数据库内。——M.E.G.数据库管理员
//
//但有流浪者报告称，河道并内的液体并非均匀的，因为他曾目击在“落潮”后，一只悲尸饮用了河水后变得亢奋并尝试通过跳跃越过河道，如果不是河道管理员在它处于空中时拉进水中，那么那只悲尸可能就会来到北岸。所以南岸方向流淌的液体可能是同样混浊的腰果水。但因为河道管理员的存在，非退潮期间不建议靠近河道。
//
//层级事件
//层级内每日以及每周都会发生时间节点完全相同的事件。
//
//日事件
//每日夕阳的时候，河道上将会出现一艘船驶过，当船经过的地方，五分钟内靠近河道不会出现河道管理员的侵扰。流浪者们将这个事件称之为退潮，这个时间是打捞生活垃圾与收集杏仁水最好的时机。但如果有任何人与实体在此期间尝试越过河道，依旧会被河道管理员攻击。
//周事件
//第一天栅栏外的杨树会飘落大量杨絮并持续一天。这被视为这个层级一周的开始。
//第四天层级内将开始下雨并持续一天，雨水似乎是纯净的杏仁水，这是这个层级收集杏仁水唯二的办法。
//第五天依旧会下雨一整天，但这次的雨水将会是腰果水，所以一个避雨棚在这个层级是必要的，第五天过后任何放在平台上的收集装置内的液体都不应该饮用。
//第七天层级内发生沙尘暴并持续一天，所以一个遮风板在这个层级是必要的。这被视为这个层级一周的末尾。
//附录
//“因该层级南岸出现大量敌意实体并且空间狭小，大量较为罕见的实体交互行为在此处被目击
//
//两只肢团因为过于靠近导致缠绕在了一起，最终跌入河道内。
//
//夜晚时两只运动轨迹相对的笑魇触碰时，二者同时转身并继续前进。
//
//一只钝人被两只猎犬追赶着。
//
//一只体型较小的猎犬对着一只无面灵不停嚎叫，最终被激怒的无面灵打了一拳后逃离。
//
//一个派对气球在南岸一处爆裂，随着彩带飘落一只派对客出现在那里，但马上被两只从两个方向冲过来的悲尸撕碎。
//
//实体
//河道管理员
//
//一种没有固定形态的实体，会对任何靠近河道的生物展现出敌意。目前已知的形态：
//
//鱼形态：在河道内徘徊时的状态，体态巨大。如果有任何东西坠入河内都会被其一口吞下。
//断手形态：当有实体尝试从空中越过河道时，河道内将会飞出一只足以将其握住的断手并将其拖入水中。
//船形态：每日黄昏的时候从河道上驶过，驶过的区域的五分钟内靠近河道的生物不会受到其攻击，除非尝试涉水或越过河道。
//“鱼”
//
//一种生活在河道内不会受到河道管理员攻击的实体。可以通过杏仁水与植物以及泥土混合的鱼饵钓得，目前钓鱼也是唯一已知在非退潮期间将物体置入河道而不被河道管理员攻击的事情。
//
//“鱼”的样子是一个没有包装的铁罐两侧各镶嵌了一个鱼头骨与鱼尾骨的实体，脱离河水五分钟后便会死亡。将头部尾部取下后会发现铁罐上有一个拉扣，将其打开后会发现内部是随机一种的鱼肉罐头，但目前已知出现了几种从未出现在前厅的鱼品种罐头类型。
//
//不要在别人旁边打开！！！那他妈的可能是个鲱鱼罐头！！！
//已经警告过你一次了，如果再次篡改数据将被永久性禁止修改数据的权限。——M.E.G.数据库管理员
//
//基地、前哨和社区
//M.E.G.实体观察哨站
//用于观察各种实体的习性与收留流浪者的哨站基地。常驻人员5人，最多收纳10人，拥有遮风板与避雨棚的设施应对每周事件。
//
//K的流浪所
//一个在M.E.G.发现该层级前就已经存在的一个无人据点。该据点由木头搭建，虽年久失修但功能性齐全。在里面可以找到一些在木板上用尖锐物品留下的留言，署名均为K，所以流浪者们将其称为K的流浪所。目前部分流浪者有将其翻修的计划，并扩建到可以容纳20人的水准。
//
//入口和出口
//入口
//在任意层级将杏仁水倒进一个沟渠内，向其跳跃有几率将你切入该层级。
//喝下一罐严重污染的杏仁水并因并发症而昏迷时，有几率在该层级北岸醒来。
//在Level C-1的任意叠加层发现一处嵌入地面的铁丝栅栏后，在翻越时摔倒后再次睁眼将会发现发现处于该层级。
//出口
//用尽全力忍耐无力感冲向栅栏，当撞击到栅栏时，将会到达一个随机层级。
//一口气喝下十瓶杏仁水后，将会被传送到Level C-1的任意叠加层。
//吃下一罐蓝色的鱼肉罐头后，如果觉得不够好吃将会被传送到Level C-123。
//当流浪者坠入河中并且河水没过头顶，再迅速上岸，将会到达Level C-75.1的江边。
//在退潮期间，不慎跌入河中会在Level C-75.2左侧楼梯顶端醒来。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1075{}