//Level C-14
//评分: 
//+27
//+
//–
//X
// 
//
//生存难度：
//等级 1？
//
//安全
//稳定
//实体横行待验证iav5sS7pNbAc4Ze.jpg
//向下坡方向的图片
//
//Level C-14是后室C层群的第14层。
//
//描述
//Level C-14由两部分组成：一段坡度33.2°，长约60米的“ 斜坡”及覆盖有类似前厅中灌木的“ 林地”。其内部始终处于夜晚状态，Wi-Fi信号强度随高度增加而减弱。切入时，探险者将处于斜坡中点处。
//
//该层活动范围受限：
//
//人类不能穿越顶端的横​̶͓̗̼̜́​̴̝́̊̑​̵̘̝̫̝̎​̸̳͚̝͒̀̀̑‍̷̣̗̯̖̰̒͋̌̑​̵̧̡̹̰̔̇̓͠​杆处；
//不能穿越或切​̶͓̗̼̜́​̴̝́̊̑​̵̘̝̫̝̎​̸̳͚̝͒̀̀̑‍̷̣̗̯̖̰̒͋̌̑​̵̧̡̹̰̔̇̓͠​̴̧̨̺̮̥͂出斜坡和林地间的一无形屏障；
//不能穿越底端的无形屏障；
//不能穿越地面2m以上区域。
//进入该层级时，任何物体高于2m以上处都将被截断。试图到达地面2m以上的区域被证明是不可行的。仅对生物而言，该层级内部“斜坡”处时间流逝速度为一般标准的3倍，且并未发现任何可利用资源，建议尽快切出。
//
//向下坡方向观察：
//
//观察物体及摄录像均呈模糊不清，且随高度下降逐渐加重。
//流浪者均报告称，沿此方向观察到的一切其他流浪者都呈现无面灵外观，但摄录设备观测到的客观行为等并未改变。
//处于“斜坡”底端尝试向下方观测，则会立即切入Level C-11，一座无边无际的大型建筑群。
//当多于1位流浪者处于“ 斜坡”时，“ 林地”内会显现数量较少的的实体，其外观与记忆无面灵相似，会试图诱导流浪者进入到“林地”内，但基于人类不能进入“林地”的事实，这些实体应当被视为无危险的。
//BfPl2RIwtZjSbQa.jpg
//顶端
//
//向上坡方向观察：
//
//沿此方向，以任何方式观察到的一切探险者均呈现近似于一定程度腐败的人类尸体状态，表现为肢体器官缺损，衣物破损，运动方式怪异。但经由交谈等互动可推知其实际行为等并未改变。
//当多于1位的流浪者处于“斜坡”时，“林地”内会显现数量极多1的实体，外观与暗影无面灵一致，他们会不断试图撞击“林地”与“斜坡”间的屏障，表现出极大敌意。基于实体和人类不能穿过“林地”与“斜坡”间屏障，这些实体应当被视为无危险的。
//不允许进入此区域
//
//-林地
//仍然未知如何进入该区域。
//
//人类不​̷͓̏̕​̷̧̏͌​̴͓͇̀͛​̶̓̂ͅ‍̵̝̏​̶̨̤̇​̶̳̘̍̽能进​̸̡̫̣̊͛̀̿͜​̸̗͌͌̓͒​̵̨̗̻͓̕​̴͍͑‍̶̼̲͔̦̒̔̇͝​̶̬̍͜͝​̷̡͕̅​̶͓̗̼̜́​̴̝́̊̑​̵̘̝̫̝̎​̸̳͚̝͒̀̀̑‍̷̣̗̯̖̰̒͋̌̑​̵̧̡̹̰̔̇̓͠​̴̧̨̺̮̥͂入​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕
//留​̴̫͋͝​̶̡́​̸̛̹̭​̷̬̹̟̄͆‍̷͔̫̎​̴̜͇̥̋̄​̸͍͇̣̉​̷͓̏̕​̷̧̏͌​̴͓͇̀͛​̶̓̂ͅ‍̵̝̏​̶̨̤̇​̶̳̘̍̽在那​̴̫͋͝​̶̡́​̸̛̹̭​̷̬̹̟̄͆‍̷͔̫̎​̴̜͇̥̋̄​̸͍͇̉​̷͓̏̕​̷̧̏͌​̴͓͇̀͛​里​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕
//仰视​̴̫͋͝​̶̡́​̸̛̹̭​̷̬̹̟̄͆‍̷͔̫̎​̴̜͇̥̋̄​̸͍͇̣̉​̷͓̏̕​̷̧̏͌​̴͓͇̀͛​̶̓̂ͅ‍̵̝̏​̶̨̤̇​̶̳̘̍̽你​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕的​̸̡̫̣̊͛̀̿͜​̸̗͌͌̓͒​̵̨̗̻͓̕​̴͍͑‍̶̼̲͔̦̒̔̇͝​̶̬̍͜͝​̷̡͕̅背影​̶͓̗̼̜́​̴̝́̊̑​̵̘̝̫̝̎​̸̳͚̝͒̀̀̑‍̷̣̗̯̖̰̒͋̌̑​̵̧̡̹̰̔̇̓͠​̴̧̨̺̮̥͂；
//你来​̴̫͋͝​̶̡́​̸̛̹̭​̷̬̹̟̄͆‍̷͔̫̎​̴̜͇̥̋̄​̸͍͇̣̉到​̷͓̏̕​̷̧̏͌​̴͓͇̀͛​̶̓̂ͅ‍̵̝̏​̶̨̤̇​̶̳̘̍̽这​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕里，
//轻​̴̫͋͝​̶̡́​̸̛̹̭​̷̬̹̟̄͆‍̷͔̫̎​̴̜͇̥̋̄​̸͍͇̣̉触​̷͓̏̕​̷̧̏͌​̴͓͇̀͛​̶̓̂ͅ‍̵̝̏​̶̨̤̇​̶̳̘̍̽​̵̭̥̠̩͚̃͊̚͜͝​̵͛͗͘门匙，
//回到至亲​̴̫͋͝​̶̡́​̸̛̹̭​̷̬̹̟̄͆‍̷͔̫̎​̴̜͇̥̋̄​̸͍͇̣̉怀​̷͓̏̕​̷̧̏͌​̴͓͇̀͛​̶̓̂ͅ‍̵̝̏​̶̨̤̇​̶̳̘̍̽​̶͓̗̼̜́​̴̝́̊̑​̵̘̝̫̝̎​̸̳͚̝͒̀̀̑‍̷̣̗̯̖̰̒͋̌̑​̵̧̡̹̰̔̇̓͠​̴̧̨̺̮̥͂中……
//
//图片已损毁.jpg
//黑色玻璃方块
//
//- 录音文件
//在顶端处， 一堆骸骨旁发现的自动录音设备记录的文件
//
//<记录开始>
//
//00：00：00 我早忍不下去了，我甚至想去找那些纸屑。什么乱七八糟的实体，无尽的走廊，我真的不想在这里呆下去了。我把Bill留在那里了，现在我就站在这个树林子里面，从这里还能看到他在里面乱叫着找我…可悲。谁让他要抢我的东西来着，这不怪我。嘿——
//（杂乱的脚步声和树叶摩擦音）
//
//00：01：01 已经走了很久。那些无面灵应该有几千只……幸好他们跑的并不快。但我不能确定这里是不是没有其他实体，还是继续走走吧。
//
//00：04：19 我现在又渴又饿….我觉得我要撑不下去了…我带着的那块表像疯了一样乱转，我应该已经在这里转了至少三天，什么都……
//
//00：09：22 前面的草地上有一块黑色的东西。我不确定这是什么，管他呢……都无所谓了。（有一声重物坠落音，此后均无任何声音录入）
//
//99：99：98 （很小的抽泣声）
//
//<记录结束>
//
//基地、前哨和社区
//不存在任何基地、前哨和社区。
//
//入口与出口
//入口
//在C层群中尝试在任一坡度大于等于33.2°的斜坡地形切出，即可到达该层级。
//
//出口
//通过底端切出，你将会到达Level C-11
//触碰林地内的黑色玻璃方块切入前厅 待验证
//作者信息
//« Level C-13 | Level C-14 | Level C-15 »
//
//Footnotes
//1. 据探险者估测大约数千只
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1014{}