//Level C-76
//评分: 
//+11
//+
//–
//X
// 
//
//生存难度：
// 
// 
// 
//Level C-76是后室C层群的第76层，当前未发现进入这一层级的入口。
//
//描述
//incinerator1
//火化车间，平时入殓师会在这里休息。
//
//Level C-76是一间正在腐烂且老化的殡仪馆，内部设备陈旧，墙体风化严重。它拥有较为完备的设施，诸如：灵堂、咨询室、停尸间、火化间、休息室和入殓室等，大多数房间都设有发黑泛黄的卤素灯泡，但从不开启，仅依靠室外的自然光进行照明。在每一个房间内都有正常开启的门，但极少被使用，开启时会发出”咔吱“声。冰箱和火化炉可以正常运作，墙上是模仿中国七十年代家庭中的挂件和摆设，具有较有辨识度和年代感的糨糊墙纸和旧报纸。
//
//这一层级似乎从来没有客源，也没有其它流浪者，但仍发现不少顾客在其中居住；在所有房间内均没有任何在职员工就位；这里完全与外界隔绝，时间也是停滞的。
//
//窗外是一直不变的天气，永远会有糙面云在流动翻转，一直延伸到远处的浓雾里，雾气不会散去，遮蔽住了殡仪馆建筑主体以外的地方。窗外没有任何声音，室内偶尔可以听到一种类似电视雪花屏的沙沙声，以及水龙头滴水声。
//
//记录中仅有已死的流浪者进入过这一层级，以至于几乎不存在任何关于此处的相关信息。
//
//顾客是在这一层级内发现的大部分实体，其中包括部分误入的流浪者。这些实体被发现遍布整个Level C-76，在每个房间的置物架或储藏柜上出现。每一个实体都完全不一致，这种不一致性体现在身上的衣服饰、发型、外貌、体型等，但其脸上的妆容都大同小异：白色盖住整个面庞，打着淡淡的腮红，玫红色的口红，黑色眼影以及稍长的假睫毛，脸上始终带着微笑。顾客会维持一个姿势一动不动，但有时候会感觉他们在注视着摄像头。
//
//incinerator2
//休息间，主要用于摆放顾客。
//
//入殓师是目前在这一层级发现唯一活动的实体。他总是穿着驼色有领马甲和白色衬衣，有时候会穿着黑色长款风衣。实际年龄无法确认，但目测为二十多岁的年轻人。他会这一层级的大多数房间出入，通常不经有门进行转移，总是没有预兆地出现在房间的各个没注意到的角落，总是伴随着纸张摆动声。
//
//虽然无法确认入殓师的行为模式，似乎仅仅只是在这一层级内无目的性地游荡，但仍发现其存在某些特定的行为，包括在顾客面前驻足，整理顾客的姿态以及为顾客进行“入殓”。当有一个顾客进入这一层级时，入殓师即会出现在他身边，并将其摆放在工作桌或病床上，随之开始对其进行入殓：首先入殓师会将顾客的衣物和挂饰全部去除，然后使用湿毛巾进行清洗，之后会使用干毛巾擦拭身体上的水渍，并开始使用剪刀修建体毛和皮肤褶皱。
//
//在第二天，入殓师会开始测量顾客的身体参数，之后会在休息室或咨询室内使用布料和针线缝制贴合顾客身材的服饰（多数为以粉红、粉蓝和白色为主色调的洋装），并为其戴上假发和假睫毛，眼球提前腐烂则会被替换为玻璃制义眼，面部坍塌则会使用石膏、硅胶和美国土进行填充以保证面容整洁。这一过程通常会持续3天到7天不等。
//
//在最后一天，完成服装和仪容的整理后，入殓师会开始为顾客进行化妆，随后被放置在展示柜里或置物架上进行展示，至此完成“入殓”。
//
//sewing1
//工作区域，入殓师会在此为顾客制作新衣服。
//
//在一次由探险者总署发起和组织的探索行动中，小队从Level 1的一扇不稳定铁门进入该未知层级，入口在小队全员进入后从墙上消失。
//
//之后小队通过该层级的Wi-Fi与基地进行沟通，在传回的信息中获知该层级是一个从未被记录过的地方，似乎与大多数层级的特征均不一致。在准备进一步探索进行时，小队突然遭遇了若干未知实体的袭击，并且完全失联。整个小队被标记为KIA。
//
//但在一周后，探险者总署基地接收到了一段影像记录，发送者为该小队的成员，地点不明。这段影像记录持续
//
//以下内容为对影像记录的文字转述：
//
//第一天
//画面开头经过长达4分23秒的空白内容后，切换为一个昏暗的室内场景。仅通过纸糊窗户的自然采光可以勉强看到屋内的情况——一盏发黑的卤素灯脱离灯座，仅靠裸露电线吊在天花板上。墙上有大小不一的破洞，多数可以由一个人直接通过，并使用素色帘子和报纸进行简单遮挡。周围是微启且空置的冰柜和冰箱，播报着1982年6月份某一期晚间新闻的电视机挂在墙上，摆满了书本的衣柜紧紧摆放在一起，玻璃被一层褐色物覆盖。靠近窗户一面的是一张长沙发，右侧是一张圆木桌上放有花瓶和泛黄相框；室内外的食物均呈现枯萎状。可以确认这里是位于一家殡仪馆的业务咨询室。
//
//携带摄像机的队员被放置在一张床上，然后入殓师进入了房间，并开始低着头摆弄队员肢体，也许是刚到新环境的缘故，身体还有些僵硬——他将胳膊拉扯关节脱位又接回去，期间会用丝线帮助手指和手腕使其固定姿势，以及用皮尺度量手臂和躯干，并在一旁的白纸上涂写。
//
//入殓师不断重复上述行为，并持续了26个小时。
//
//第二天
//经过一晚上的时间，入殓师终于确认好了草稿，队员的身体也放松了下来。入殓师开始将队员的衣物剪开，并用刮刀剃掉体毛，并不断揉搓和按摩关节处，主要是以及变红了的手臂。于是他先是使用白色粉底掩盖住红色斑点，并开始在整个皮肤上铺满一层白色底色，接着就开始在一旁的布料和剪刀照着此前的草稿进行剪裁和缝纫。只有当队员身上的颜色开始变深时，他才会停下手上的工作，并在褐色色块上面继续涂抹一层粉底。
//
//在当天稍晚些时候，可以看见队员皮肤底下似乎有什么东西在动。入殓师会使用一根长针挑出里面蠕动的内容物，然后用此前裁剪下来的皮肤进行钉补，然后用接近肤色的颜料在衔接处晕染，以避免接缝肉眼可见。视野里开始出现苍蝇，每次落在队员身上时都会被入殓师挥手驱赶。
//
//最终在入夜前，入殓师完成了一件粉蓝色为主调的甜美系洋装，配有更多比例的蕾丝饰边和褶皱，穿在队员身上，恰好与衣服下透着蓝绿色大理石花纹皮肤搭配在一起。在面部的孔洞边缘长出了细微的绒毛，但由于几乎无法察觉而没被重视。
//
//第三天
//入殓师开始使用红色、白色和黄色化妆品混合着盖在绿色色块上，并逐渐使那些位置变成正常的肤色，偶尔有绿色的液体从孔洞里流出来，但总会在快要淌到衣服的边缘时被入殓师用丝巾擦掉。如果有奶白色的东西从体表钻出来，也会被及时移除，并用棉花团和粘土填补空缺，然后涂上可以拟人的色彩。
//
//期间偶尔会发现布料摩擦而导致一部分皮肤被擩下来的情况，并在缺口处流出略带粘稠的褐色物质，可能与室内大部分反射面上的一致；也会有其它鼓起来的肿胀的位置，但随着皮肤的缺口而缩下去。整体上队员并没有受到严重的伤害。
//
//由于角度缘故，摄像机被入殓师的身体遮挡住，仅能确认的是队员的腹部开始隆起胀大，又逐渐瘪下去，导致表面的黄色蜡质脱落；入殓师的动作也变得更加轻柔和小心。
//
//第四天
//入殓师完成了作业，队员因被实施入殓而转变为了一个顾客实体——身穿着粉蓝色的甜美系洛丽塔，梳着金黄色的卷发，斜戴着蓝色的小型礼帽，脸上是白皙的皮肤和玫红色的妆容，在镜头前总是面带微笑的。
//
//入殓师将其带在身边，镜头跟随着其身影在这一层级内穿梭——因此得以确认了此处的大部分房间布局情况，在画面中偶尔能够发现其它已完成转变的队员和记录在案的失踪流浪者的身影——在穿过若干走廊和房间后，队员被带到一个摆满了置物柜和展示柜的房间，并将其摆放在了一个仅有一个缺位的置物架上，身旁全是顾客。
//
//截至89小时24分12秒，视频在此结束。
//
//借由以上信息，探险者总署得以了解到Level C-76的存在，这也是已知的全部信息。目前可以确认进入这一层级的流浪者仅有13个。
//
//基地、前哨与社区
//这个层级上不存在基地、前哨站或社区。
//
//入口与出口
//入口：
//濒死或遭遇致命攻击有可能进入。
//失踪或杳无音信者有可能进入。
//出口：
//无法离开。
//
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1076{}