//Level C-24
//评分: 
//+59
//+
//–
//X
//« Entity C-100 | Level C-24 | Entity C-Å »
//
//
//
//谨以此篇缅怀我罹难的挚友：纳塔尼尔·卢西亚(Nathaniel Lucia)。
//
//——E.P.B.1干员克莱芬斯·埃德蒙(Clephens Edmont)
//
//- 点击离开
// 
//
//生存难度：
//等级 黑洞
//
//不安全且不稳定
//无尽的深邃
//永恒的终末
//
//Level C-24是后室C层群的第24层。
//
//space-ge6b82de85_1920.jpg
//层级中心黑洞的影像(待考证)。
//
//描述
//那是一次常规的勘探任务，我和纳塔尼尔一同在Level 78的空间站中进行探索……我们注意到了一扇很奇怪的舷窗：向里面眺望过去，一个高速旋转着的神秘星体正散发着诡异而幽蓝的光芒。我不确定那究竟是中子星还是黑洞，甚至是类星体。我们穿过了那扇气闸，等我们回过神来，我与纳塔尼尔已经置身于一个新的层级之中了……
//
//Level C-24的主体是环绕一个巨型黑洞的宏大人造环形管状太空城结构 (就像一个很细的洋葱圈中间放了一颗硕大的巧克力豆！)(我尽可能地描述精准了) ，直径粗略估计有1000AU2。尚且无法解释是什么样的法则让它能够存在，但显然它和我们熟知的自然定律在某些方面有着显著的差异。
//
//中心黑洞的吸积盘发出的光是本层级中最主要的自然光源，呈现一种如磷火般诡异的幽蓝色。“太空城”的某些结构也会发出微弱的光芒，但是除此之外的太空中看不见任何星光。炽热的等离子体组成的吸积盘围绕着黑洞旋转，并且旋转速度随时间推移逐渐加快。
//
//也许黑洞终会将它们全部吸收。但我待不到那个时候了。
//
//“太空城”管状结构的内径约为十公里。整个结构可能被分成了若干“节段”，每一“节段”长约50公里，彼此之间由巨大的闸门连接。
//
//相对于它庞大的长度来说，这一点可以说是微乎其微；可是对于任何一个初来乍到的旅行者来说，这都是震撼心灵的体验。
//
//spacehub
//太空城废墟影像(待考证)。
//
//这里的重力系统也很奇怪——或者说那根本不是重力，因为是在太空里——在“太空城”内壁附近的物体都会受到一个垂直于内壁的力的作用，大小大约是1.5倍地球重力。而在远离内壁更靠近管中心的部分受到的力会更小直至为零。
//
//这种力的性质很类似于离心力，但是我们无法察觉到管壁的转动。
//
//管壁上坐落着一些废弃的看上去像是某种高级文明留下的遗迹的结构——事实上，整个环形结构就是一个巨大的遗迹。它们有的十分低矮，高度不足一人高；有的贯穿整个管的内部高达十公里的距离。大部分结构已经损坏，要么无法进入或用途不明晰，要么本身有着不小危险性 (譬如在有物体或实体接近时会释放出数千摄氏度的等离子体物质) 。
//
//它们似乎是完全随机排列的，至少在我和纳塔尼尔的理解范围内，我们看不出它们的规律及意义。
//
//环境
//这里的自然环境是极其严酷的：没有氧气，寒冷刺骨。一般而言，“太空城”内部温度大约为-50~-20℃。任何旅行者必须穿着宇航服等特殊装备才有可能在此层级存活。
//
//不幸中的万幸，我们当时正好穿着由我们公司制造的宇航服，这使我们没有在进入该层级时立即死去。如果你准备去一些层级探险，请不要忘记选择EPB公司的产品，它能为你保驾护航。
//
//“太空城”的管壁在某些地方会出现破裂，并且破裂的缺口会随着旅行者在该层级中停留时间的增加而增多。初步测量结果显示，缺口直接通向外部的真空环境。那里相当寒冷，温度仅有0.2K3左右。由于缺口与管壁都是难以分辨的黑色，因此请务必小心。尽管如此，当靠近缺口时，旅行者会感到温度下降，并且会受到一种神秘的吸引力将他们“拉”向缺口。如果发现这种异常，请尽早朝反方向移动。如果旅行者离缺口足够近，他们会无法摆脱巨大的吸引力而被拉入外部真空中。尚且不明这种效应是否与层级中心黑洞有关。
//
//我……不愿再提起那段悲伤的往事。纳塔尼尔在前面走得很快，我想叫住他，可是他没有听见。继续往前，周围的环境逐渐开始变得更加寒冷，我开始意识到了事情的不对，这是第一次有人到达这个层级，我们不知道会发生什么，但我还是本能地想要调头返回。可是我如何能够丢下纳塔尼尔不管呢？
//就在我再次转过身子的时候，纳塔尼尔已经不见了踪影……
//无论我如何寻找，都再也找不到他的身影了……
//不，是我害了他……是我没有尽责……
//
//泪水模糊了我的双眼，周围的景象逐渐变得黯淡，又重新明亮起来……泪已将尽，我发现自己回到了Level 78，眼前是一扇舷窗中映出Level 11街景的气闸，我便走了出去……
//
//基地、前哨与社区
//无。
//
//我已经不愿过多提起本层级了。
//
//入口与出口
//入口
//穿过Level 78中一扇从舷窗能看见散发着幽蓝光芒的神秘星体的气闸。
//我不建议你这样做。
//
//触碰Level C-5中的“蓝色”将有极小概率到达本层级。
//这无异于玩火自焚。
//
//出口
//
//
//【已编辑】
//你可以回到原来的层级；但是如果你想离开，那么必须得留下另一半。
//
//一对虚粒子对在事件视界上被创生，它们本该走向湮灭，但反虚粒子纵身跃入了黑洞，正虚粒子方才得以逃脱。
//
//
//
//【“Isulinniq”的来信】
//我亲爱的朋友，我在这里过得很好，请不要担心。
//在你离开后的三千万亿年后，这里终于变得一片冷寂了，我可以安心下来思考万物了。
//
//你随时可以过来看我，你将看到我在事件视界上永恒的身影，那是属于我的终末，也是我的永生。
//
//
//
//
//
//Footnotes
//1. Electron Positive™ Particle Technology Co.,Ltd. of Backrooms，正电子™后室粒子科技有限公司，对外宣称目的是从微观视角探寻后室的本质。同时致力于特种工业产品制造与贩卖，分子科学、原子能、量子技术研究，资源探索与层级勘探工作等。目前成员人数不明。
//2. 天文单位，1000AU约为1496亿km。
//3. 0.2K=-272.95℃，这比前厅中宇宙微波背景辐射温度(2.7K)还要寒冷。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1024{}