//evel C-91
//评分: 
//+18
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//C91-1.jpg
//Level C-91内中心区域的一张照片。
//
//Level C-91是后室C层群的第91层。
//
//描述
//Level C-91是一片具有连绵的欧式庄园风格房屋的大陆，这些房屋排布完全随机，且有时会出现两栋以上房屋“重叠”在一起的情况，这种情况会随着流浪者越往层级边缘行走而越发明显。请注意，当进入这些“重叠”的房屋时，流浪者很有可能会突然的切出本层级而到达一个未知的层级。
//
//Level C-91内永远处于一种夕阳即将落下，暴雨马上来临的景象。道路昏暗，空气潮湿是Level C-91内的常态，但进入此地的流浪者却无一例外的从未看过下雨的场景。该层级内没有昼夜循环，温度固定在14℃左右，4级左右的阵风会时不时的侵袭处于南边的平原并产生类似于陆地龙卷风的奇观。
//
//Level C-91内虽然并无Wi-Fi，但流浪者仍然可以通过调频广播收到来自M.E.G.发出的通讯。在某些房屋的地下室内，有时能找到一种蒸汽发动机，目前为止，M.E.G.在其中已经找到了2台仍然可以运行的蒸汽机，并使用它们进行简易发电。
//
//C91-2.jpg
//Level C-91内一台蒸汽机的部件。
//
//流浪者进入该层级后约4个小时后，总能看到一处与其他景观格格不入的欧式教堂，走进教堂内，会有一名全副武装的M.E.G.狂野战士军团的士兵接待流浪者进入Level C-91内的一处基地。如果流浪者拒绝跟随这名士兵，则他们会得到一张由M.E.G.组织根据在此层级的勘探情况报告撰写的一个生存手册。其中详细的记录了哪些房间会更有可能出现诸如“杏仁水”一类的基本生存物资。
//
//如果流浪者跟随士兵士兵到达了基地，则其可以在基地内找到一处被重兵看守的天使雕像，触摸雕像即可获得一种诡异的“知识”（其内容大多为不明所以的短句），但一位流浪者只有一次获得“知识”的机会。以下是对获得“知识”的流浪者的采访：
//
//[“知识”记录]
//
//燃烧生命
//下降即上升
//狼群呼唤荒野
//日落时分，心向往之
//混沌初开未果，天地融合至今
//汝曾所居世界之中心
//——这位流浪者在前厅出生
//
//天谴之人！
//——这位流浪者曾经无奈的杀死了被感染成“悲尸”的女儿
//
//所谓方舟之工匠
//——德尔塔得到的“知识”
//
//怪哉！此为洪水之女乎？
//——夜莺得到的“知识”
//
//[数据隐藏]
//——监督者-A得到的“知识”
//
//[记录结束]
//
//截至目前，M.E.G.仍在研究这类短句所指代的含义。相关人员所获得的短句仍在收集当中。
//
//基地、前哨与社区
//M.E.G. “暴风雨前”小型基地
//驻守100名左右的军人，基地中心常驻人口约为200人。
//可以与其中的商人进行交易。
//可以获得补给品。
//失落一族 “守望者”小队
//仅两人，性别未知，穿着16世纪欧洲士兵服饰，在中心区域游荡。
//可以与其交流，它们会告诉流浪者自己曾经的一些故事，以及关于这个层级的历史。
//请勿招惹它们。
//入口与出口
//入口
//进入Level C-40的烟囱壁上一个偶尔出现的石门即可到达Level C-91。
//进入Level C-126之中的第23号车厢，并翻看其中的一本外观古老的英文书，即可被传送至Level C-91。
//在Level C-20的西南面有时会出现一堵石墙，切入墙体即可来到Level C-91。
//出口
//进入一个外观颜色呈灰黑色的房屋，即可到达Level C-6。
//进入教堂内一个“镜子屋”并切入镜子中，即可到达Level C-78。
//目前仅发生一例，随着陆地龙卷风向高空飘去，穿过云层后到达Level C-122。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1091{}