//Level C-5
//评分: 
//+105
//+
//–
//X
//notepad1651073717668.jpg
//Level C-5是后室C层群的第5层。IMG_20220129_175821.jpg
//这是它最初的样貌
//
//描述：
//<文本编辑器/自动保存的文档 由一名已失踪的匿名M.E.G.成员记录>
//
//…………
//
//这是什么地方？
//
//这里是一条曲折而无尽的洁白走廊，洁白的灯光挂在触手可及的天花板上，等待着你的到来。
//为什么这里是黑白的？
//
//因为它没有色彩。
//为什么这里没有色彩？
//
//事实上，这里是彩色的，你应该意识到这一点。白光是所有色光的集合。
//这里并不是想象中的洁白。
//
//请忽略地面和墙上那些黑色的污渍，它们会变得多彩而鲜活起来。
//我为什么会到这里？
//
//它因你的到来变得丰富多彩，你的到来为它增光添彩。
//我应该离开吗？
//
//你的离开会使这里再次失去色彩，你不应该离开这里。
//似乎周围拥有了色彩。
//
//这是为了欢迎你的到来。这多亏了你的到来。
//IMG_20220202_192350.jpg
//我应该留下来吗？
//
//当然。你会变得像这里一样多姿多彩。
//色彩在蔓延……
//
//它很美妙。美妙的紫罗兰在你的脚下悄然绽放，群青浸染了天空，翠绿色点缀穿插其中，鹅黄色为这里增添了一份活力，一抹猩红映出你多彩的靓影。
//notepad1651073723351.jpg
//色彩在变得更加鲜艳……
//
//它很伟大。世间万物的色彩都由它铸造，世间万物因为它变得更加多彩。世间万物因为你的到来变得更加多彩。
//我的色彩在消退。
//
//一切都在消退，只有色彩在增长。
//我被无尽的色彩所笼罩。
//
//那里是你的温床。当你重新绽放的那一天，你会再次充满色彩。
//IMG_20220427_233533.jpg
//我会感到孤独吗？
//
//不，这里还有，他们，和你一起，你不会孤独。
//我将融入其中了……
//
//和色彩融为一体吧，这里是你永远的眷恋……
//*记录中断*
//
//实体色彩
//请放心，这里没有任何实体。
//白色
//白色是所有色彩的总和。它融合了世间的一切。
//“赤色”
//赤色是你的生命，也是它的生命。你的生命就是它的生命。
//“橙色”
//它很鲜活炽热，不是吗？仿佛岩浆般融化一切。
//“黄色”
//如日光般璀璨夺目。
//“绿色”
//如绿植般令人安心，沉浸其中吧……
//“蓝色”
//它如宇宙般深邃。不要盯着它，不要这样……
//“紫色”
//不要盯着它……
//“黑色”
//██████████████████████████████
//“X光?”
//███████████████
//“¿&*#@#@$光！！”
//██████████████████
//基地，前哨站和社区
//这里有许多色彩，欢迎你的到来……
//notepad1651073748096.jpg
//不，它失去了色彩！这里需要新的色彩！█████████
//notepad1651073752215.jpg
//notepad1651073756671.jpg
//入口和出口：
//入口
//看到Level 57画廊中墙上的那幅画有彩色色块的油画了吗？对，就是那里！就是那里！！盯住它或者穿过它，你将幸运地到达这里！！！
//出口
//为什么要考虑这个？！ 这场筵席永不散去！！！
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1005{}