//Level C-22
//评分: 
//+23
//+
//–
//X
// 
//
//生存难度：
//等级 3
//
// 
// 
// 
//eyvabpZJKOVkUgH.jpg
//Level C-22的照片。
//
//Level C-22是后室层群C的第22层。
//
//描述：
//Level C-22是一间面积在100平方米左右的珠宝店。本层有着许多摆放着珠宝工艺品的玻璃展示柜。Level C-22北面是一扇双开的玻璃大门，然而无法透过此门观察到Level C-22室外的情景，任何进入此门的尝试均以失败告终。本层有着12名人形实体，其中1名负责前台工作，另外11名则是顾客，他们的行为与正常人类相同，但没有语言能力，可无论从何角度观察，他们的眼部总被黑色的马赛克覆盖着。
//
//Level C-22一直处于一种特殊的时间循环状态下，每隔4分钟本层便会经历一次循环。
//
//循环事件：
//fR9u5bxkGEwAKZq.jpg
//“劫匪”的照片，图像未经过任何处理。
//
//没有任何外界因素的干扰时，本层会发生如下事件：
//第一分钟
//Level C-22内播放着舒缓的音乐，顾客们在店内随意走动，时而停下观看展示柜内的商品。
//
//只有这段时间内可进出Level C-22，无论从何处进入该层都会出现在该层偏僻的角落。
//
//第二分钟
//第24秒时，北面的大门被撞开1，两名持有武器，面部特征模糊的人形实体冲了进来。
//
//顾客们发出惊恐的尖叫，Level C-22内乱成一团。
//
//劫匪-1举起手枪依次瞄准着店内的顾客。
//
//顾客们颤抖着趴在了地板上，前台将双手高举过头顶。
//
//劫匪-2开始将玻璃展柜砸碎，取出其中的珠宝放入一个黑色塑料袋。
//
//第三分钟
//第18秒，第32秒时，劫匪-1分别开枪打死了两名顾客
//
//第52秒时，警笛声从远处传来，劫匪-2显然已经将Level C-22内的大部分珠宝收入了囊中。
//
//第四分钟
//两名劫匪朝着门外走去，消失在了一片漆黑里。
//
//8秒后，枪声，喊叫声，警笛声从Level C-22外传来。
//
//前台开始打电话，2名顾客从Level C-22的大门离开了，2名顾客抱着死者的遗体哭泣，5名顾客仍趴在地上。
//
//以下是对本层的实验记录：
//
//折叠M.E.G. Level C-22 记录:
//记录-1
//实验过程：在劫匪进入Level C-22后开枪杀死劫匪。
//实验结果：Level C-22内的顾客全部呆住了，随后争先恐后的向门外逃了出去，Level C-22保持无人的状态直到事件结束。
//
//记录-2
//实验过程：在劫匪进入Level C-22前杀死全部顾客，随后隐藏在角落。
//实验结果：劫匪在看到Level C-22地上的尸体后，愣了一下，立刻从大门出去了，Level C-22保持无人的状态直到事件结束。
//
//记录-3
//实验过程：砸碎其中一个展示柜，取走里面的珠宝。
//实验结果：顾客们发出惊呼，有的顾客取出手机拍照，前台立刻拨打了报警电话。劫匪进入Level C-22后并没有理会当前的混乱情况，仍然威胁众人并抢走珠宝，但在第三分钟时4名面部特征模糊的警察进入了Level C-22击毙了两名劫匪。而实验人员靠着惊人的口才撑到了事件结束。
//
//记录-4
//实验过程：救下那两名本该被击毙的顾客。
//实验结果：其中一名顾客大受感动，从口袋里掏出手枪和两名劫匪缠斗起来，另外3名顾客也加入了战斗，第四分钟时警察赶到，押走了两名劫匪，无人伤亡。
//
//记录-5
//实验过程：在Level C-22内裸奔。
//实验结果：与记录-3相同。
//附录：为什么要实验这个？这没有任何意义。
//回附录：为了实验本层的实体有没有人的情绪。
//
//基地，前哨和社区
//该层级不存在已知的基地、前哨和社区
//
//入口和出口
//入口
//在Level C-64进入一扇门缝中透着光的门。
//在Level C-16中捡拾到什么会被传送到Level C-22？（3）
//A.香蕉皮
//B.钱包
//C.字典
//出口
//在该层连续经历3次循环事件后会被传送至Level C-61。
//打碎一个装有玛瑙饰品的玻璃展柜会被传送至Level C-69。
//作者信息
//« Level C-21 | Level C-22 | Level C-23 »
//
//Footnotes
//1. 门外一片漆黑，看不到任何东西，但有时可以看到闪光灯的灯光。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1022{}