//Level C-99
//评分: 
//+115
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//Level C-99是后室C层群的第99层，于1998年被团体“夜世界”意外发现。此前，Level C-99由于未寻找到入口，被一直认为处于空置状态。
//
//br1
//摄像机所摄区域-1的星空，超高清修复
//
//描述
//Level C-99是一片虚空，其中有一块被称为“区域-1”的，占地约为一百平方米的方形陆地，因未知重力异常影响悬浮于虚空中。根据流浪者回忆，未能在视野范围内见到更多陆地。
//
//每次仅有一名流浪者可以停留在Level C-99中，且时间不得长于二十四小时。除此之外，当离开Level C-99后，流浪者们会丧失于其内的大部分记忆，只记得数个破碎的片段。摄像机等电子设备的信号受到严重干扰，所录制的画面清晰度极差，仅能当作应急参考资料使用。鉴于以上原因，以下所有关于此层级的描述，均为根据多名流浪者口述组合而成，可能存在一定程度的失真。
//
//Level C-99始终处于黑夜状态，且具备高度特异性。根据流浪者口述，每一名流浪者看到的事物都有所差别。这一区别在观测星空时表现得极为明显，几乎没有流浪者看到相同的星空。
//
//此外，绝大多数流浪者在离开本层级后，均会感到孤独、迷茫和压迫。目前暂不明确这些情感的来源。
//
//值得注意的是，M.E.G.已经确认，每名流浪者仅有一次进入本层级的机会，离开后无法返回。而由于本层级进入方式的特殊性，无法单独派遣机器人/无人机入内，对探索造成了很大困难。目前绝大多数进入Level C-99的流浪者都安全返回，且未出现较大程度的精神损伤1，判定其内不存在危险。
//
//Level C-99中不应有实体。
//
//以下为部分流浪者关于本层级内部的记忆片段，为保证真实选择直接记录其语言，未经书面化处理。
//
//星空1
//像粉色的……大棉花糖。很软，看起来很软，咬一口就能化开的样子。绝对是SBRPPP牌的，我小时候就爱吃那个，便宜好吃，我妈老爱买了，给我和弟弟一人一个。后来我老弟和我妈出车祸死了，家里就我一个人，就不买了。
//
//什么？你问有什么变化？看久了的话，星空都会转来转去吧？
//
//绘本
//我大概看到了星空吧……但是我忘记了，对不起。
//
//不过我还记得，在泥土上放着一本轻薄的小书，捡起来，是一本儿童绘本，叫《银河外的故事》。让我想想内容……唔……有个小男孩，早上起床发现自己穿越到了一颗神秘的星球，什么都有，就是没有人。他开始觉得很好玩，但是很快他就想爸爸妈妈了。
//
//虽然星球上有很漂亮的夜景，但他还是想回家。所以他就用泥巴造了一架大火箭，嗖的一下飞回地球了……诶……他回去了吗？对不起啊，我又记不清了，真抱歉，浪费了这次机会。
//
//房子1
//没错我就是跟你说房子，那儿绝对有间天杀的房子。我没抬头看那些狗屁星星，我一进去，坐草地上，腰疼腿酸。就这小地方一眼就看全了，有个小屋子在最角上搁那儿杵着。我寻思着反正时光大好，看起来那屋子最多十来平，应该也没啥机关，就进去了。再有记忆就出来了，真没劲啊。
//
//诶呦不是我跟你说嗷，那小房子看起来还是有点奇怪的，跟个土房子差不多。出来之后我左寻思右寻思想不明白这破落地方谁盖的土房子，姐妹你有头绪没？
//
//星空2
//深蓝的底板，白色的星星。
//
//嗯，我记着很清楚的是，我坐在地上，忘了是什么材质的地，反正有块地。不是那种海蓝色，我见过海。更像是来暴风雨之前，天黑下来，云翻卷着的墨蓝色，很压抑。我坐了不知道多久，感觉胸口喘不过气，然后站起来，剩下的就都忘了。
//
//具体什么感觉？你有没有过那种经历，自己一个人去汤泉，洗完澡之后在它们的按摩休息区睡觉。一觉醒来，四处都关着灯，脑子昏沉，间或还能听到一两声细微的呼噜。那种你不知道有多少人躺着，多少张空椅子，满脑子昏昏然都是大梦千秋的感觉？还有你站起身来，踉跄着脚步出门，被风一吹，整个人清醒过来。回头看汤泉店，感觉自己从没进去过的感觉？
//
//就是这样，我说完了。
//
//房子2
//阁下，那里有间土房子，尖顶的土房子。
//
//我自认记忆力比别人强得多，但没想到还是记不得很多了啊。我现在只能回忆起那间房子两面靠外，我看不见。贴近内侧的两面，一面上是圆形的窗户，另一面是歪歪扭扭的门。我打开门，低下身子进去，看见了一张小桌子和一张床。再后来的事情，连我也记不住了。
//
//梦呓
//阁下，那里有间土房子，尖顶的土房子。
//
//我自认记忆力比别人强得多，但没想到还是记不得很多了啊。我现在只能回忆起那间房子两面靠外，我看不见。贴近内侧的两面，一面上是圆形的窗户，另一面是歪歪扭扭的门。我打开门，低下身子进去，看见了一张小桌子和一张床。再后来的事情，连我也记不住了。
//
//裸体
//我的朋友，请你告诉我，为什么我一进去衣服就没了？
//
//见鬼了，我完全不记得什么星星啊，房子啊，你说的这些我全不记得。我的记忆里只有一直低着头走来走去，看着自己的充满汗毛的性感全裸体。说到汗毛，我什么时候长了那么多胸毛，真丑，一百层是不是会促进毛发生长什么的？还是瞬时的，我出来毛就没了。
//
//你问书？我好像还真的看到过本书，但我捡起来撕了，然后扔到下面去了。别问我为什么，我怎么知道我当时脑子是不是被门砸了。指不定是你们的杏仁水有毒。别的啥都不记得了，真是见鬼。
//
//星空3
//漆黑。
//
//漆黑一团。
//
//是那种死黑色，没有太阳，没有月亮，没有光。
//
//看不见一切，看不见希望，没有光。双腿沉重，举步维艰。
//
//为什么？为什么为什么为什么为什么为什么为什么为什么？
//
//超过了二十四小时，不知道，不知道任何事情。没有光。
//
//想仰望星空，却发现星星早已不是它们以前的模样。褪色了，像老照片，皱皱巴巴。
//
//站起来，走到边界，跳下去。
//
//醒了。
//
//
//基地、前哨和社区
//未知土屋
//根据部分流浪者的描述，本层级中存在一间土屋，但并不知晓更多信息。据推测，其内不会拥有补给资源，没有价值。
//
//入口与出口
//入口
//在1998年前，不存在进入Level C-99的方法。1998年后，经“夜世界”团体实验，确定进入本层级需在亲友的陪伴下，阅读十本儿童故事书，随后面对墙壁哭泣，再静候二十分钟，即可进入本层级。
//
//出口
//在区域-1内停留二十四小时以上2，随后会被自动移出本层级至Level C-98。
//
//作者信息
//« Level C-98 | Level C-99 | Level C-100 »
//
//Footnotes
//1. 仅有一人反应剧烈，神智不清。
//2. 仅有一人超过二十四小时。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1099{}