//Level C-60
//评分: 
//+8
//+
//–
//X
// 
//
//生存难度：
//等级 2
//
//不安全
//不稳定
//存在未知实体road-949832_1920.jpg
//Level C-60的小路。
//
//Level C-60是后室C层群的第60层。
//
//描述
//Level C-60是一条小路，这条路连通着两个未知的层级，因此人们习惯称呼其为“后室连通器”，这条小路的最大特点在于，它如同磁铁一般，有着明确的“异极相吸”的特点。具体的说，这条道路的尽头连通的层级一定是一个安全性相差很大的层级，比如说宜居层级到生存难度5或者更糟的层级。而两层级之间的互通会在一人进入另一出口后瞬间改变，随机到另一个安全层级和危险层级的搭配。
//
//这条小路的天空虽然有太阳，但在此层级内，一切事物似乎是蒙上了一层灰色的阴影1。虽然将存在于本层级的东西带入其他层级，能够观察到被带出的物品本身具有的颜色，但这种“上色现象”却不能在该层级内发生。换句话说，如果流浪者想在这个层级里看到本层级内的物品本来的颜色，那么带着想看到的物品离开这个层级是唯一的办法。
//
//话虽如此，M.E.G.却并不建议流浪者带走本层级的任何物品以察看它们的颜色，因为这种“上色现象”的原理时至今日仍并未被完全揭开，这种效应是否会传播给其他物体，或是影响其他层级的物品，我们不得而知。如果流浪者带走了本层级的物品，请立刻将该物品上交至M.E.G.资源部，并如实汇报相关情况。
//
//回到Level C-60本身，上述提到本层级的任何物品都丢失了其特有的颜色，但事实却告诉我们这种丢失却是可逆的，也就是说，根据科研小组的推测，可能是由于某种实体剥夺了人眼、或者是摄像机看到颜色的能力，才导致颜色的消失，而不是某种来自该层级本身的效应。
//
//以下是关于此观点的实验：
//
//实验编号	
//1	将Level C-60的植物带出该层级，并用单一颜色光照进行培育。【结果：植物死亡】
//2	在Level C-60内的阳光下放置光照分解成橙黄色液体的绿色溶液草酸铁钾，持续数小时。【结果：溶液由绿色变为橙黄色】
//综上，该层级内的原生物质有可能存在其固有的颜色性质，但其却并没有体现。
//
//pebbles-796943_1280-gray.jpg
//在Level C-60内拍摄的石头。
//
//流浪者在本层级会遇到两个桥洞以及数家紧闭的咖啡厅和茶馆，一般来说，穿过桥洞不会到达另一条街区，而是直接切入到一个新的层级。如果流浪者从一个危险的层级里切入到本层级，请尽快穿越本层级另一头的桥洞以达到安全区。如果流浪者从宜居区或生存难度0的层级进入本层级，请立即原路返回。
//
//直至目前，M.E.G.仍然没有收到有人从生存难度为2、3级的层级来到本层级的案例报告。似乎本层级只会出现在安全性处于两个极端的层级内。2
//
//任何尝试绕过桥洞，或是穿越两侧的建筑物的行为都是极其危险的，M.E.G.部门还未探明这些“不寻常”的出口是否安全，因此请流浪者严格约束自己的行为，以免造成危害。
//
//基地、前哨与社区
//由于本层级的不稳定性，在此无法建立任何基地、前哨或社区。
//入口与出口
//入口
//从宜居层、死区层来到本层级的可能性会比生存难度0、1、4、5的层级来到本层级的高出几倍。进入该层级的显著出口即是一种不明的灰色效应，这种灰色会影响目标层级内的物品，使某些物体的颜色变为黑灰色。影响范围从1米到10米不等。如果流浪者察觉到了这一变色现象，则他们会被传送至本层级。
//出口
//如果流浪者从生存难度低的层级进入，请原路返回；如果流浪者从生存难度高的层级进入，请尽快径直走向对面的出口。
//作者信息
//« Level C-59 | Level C-60 | Level C-61 »
//
//Footnotes
//1. 当然这并不包括进入本层级的流浪者及其随身携带的物品。
//2. 尤其是宜居层和死区层。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1060{}