// 
//
//生存难度：
//等级 1
//
// 
//不稳定
//未知实体数量C96.jpg
//这是天空。
//
//Level C-96是后室C层群的第96层。
//
//描述
//我的文章已经第三次被管理员删掉了……
//
//他们总是说我写的不够专业性之类的，可是我只是一个普通的流浪者，我的文章技术就摆在这里了，你们说多少遍我都只能写的这样了。
//
//我不知道这次上传以后又会过多久被删除，不过这次我按照他们上传的格式写了，应该不会再被删了吧。
//
//以及，那群无聊至极的破坏者总是想举报那些他们不喜欢看到的文章，我想加前面的掩盖应该能让大部分人看到就关了……吧？
//
//但愿如此。
//
//
// 
//
//如你所见，其实这就是一堆已经完全穿模的建筑组成的迷宫。
//
//这些建筑物内部完全是黑的，我不敢进去，我想只有M.E.G.兵团的那些人才敢，他们哪里都敢去，因为他们总有奇奇怪怪的武器和逃生装置。
//
//我就不一样了，这俩我都没有。
//
//不过，我能来到这里，总归是有点本事的，我手上还有许多紫水晶，现在剩下能用的已经不多了，应该还有个三四次的机会够我打开门找到出去的路。
//
//而不是只在这里绕圈圈。
//
//我好累，不过如果我冒险进那些建筑物当中搜刮一圈，也许能找到杏仁水之类的？如果真的没人来救我，也许我会赌上性命尝试一把。
//
//每个建筑物（或者说是一堆建筑物）之间总有那种连通的过道，要穿过那些包围形成的天井只能找那种过道，爬上房子在楼顶跳太耗费体力了，况且我身上背着这么一大堆东西，不现实。
//
//啊……现在已经是标准时间的午夜了吗？还好我在这待了几天都没看到太阳落山，鬼知道这里要是变成午夜，那些建筑物里的东西会不会跑出来祸害我。
//
//时间过得挺快的，不知道是层级里的效应还是之前爱因斯坦说的那个什么相对论，总之我得抓紧时间了，我好想我的女友安娜，她要是发现我失踪了这么久，肯定会痛不欲生吧……可怜的美人。
//
//等等，他们会不会已经在为我办葬礼了？我还没死呢！
//
//我现在不能再在这里停留太久了，虽然能有WIFI信号的地方很少（而且我每次登录的时候都会看到管理员删了我的文章），但要是遭遇了实体埋伏，也许连活命的机会都没了，更不要说什么更新文档。
//
//有缘再会。
//
//
//基地、前哨与社区
//没有，这里只有我一个人，如果M.E.G.愿意来这里建基地的话，我想应该挺适合的。
//
//毕竟白天时间那么长，M.E.G.就有理由让其他人加班了。
//
//
//入口与出口
//入口
//我才想起来要写这个。
//
//我是从Level C-996用紫水晶切入进来的，因为我实在是不想在那里工作了……啊，没想到一个星期都没工作的感觉这么爽。
//
//不知道我回去会不会被开除之类的。
//
//
//出口
//我找了很久都没找到。
//
//如果有新情况我会来更新的
// 
//
//兄弟们我找到了！
//
//不用紫水晶就能回来！不过来不及写了，我把地图画在下面，你们去这个地方就能找到出口：
//
//
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1096{}