//Level C-1
//Level C-1是后室C层群的第1层。
//
//描述：
//Level C-1被认为由多个层级空间构成，这些空间被称为构成Level C-1的“叠加层级”。它们均能被认定为独立层级，拥有各自的出入口，并且互不隶属，有些空间甚至拥有属于自己的子域（即子层级）。但使用LPS（层级定位系统）与层级密钥等多种方式测验都证明了一个事实——它们都是Level C-1，就像是一个缩小版的后室。
//
//目前尚不知晓Level C-1共拥有多少个叠加层，因此所有已发现并探明的叠加层级均会以报告形式存档在本页面，并且将拥有一个属于自己的层级档案记录。如果你发现了一个新的叠加层级，请上报至The M.E.G.。
//
//倘若发现自己切入的Level C-1与上次切入或阅读过的报告完全矛盾，请勿慌乱。
//
//你曾经来过这里……
//
//Chuckler的报告
//Level C-1 » Chuckler的报告
//评分: 
//+81
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//photo-1657209104271-324523e683a2?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=987&q=80
//一张Level C-1的照片。
//
//Level C-1是后室C层群的第1层。本文所述地点乃其叠加层之一。
//
//描述：
//Level C-1是一处巨大且持续延伸的室内环境，它有着木质的地板、瓷砖铺就的墙壁、随机排列以将空间切割的窗门、还有数量稀少的长凳和镜子等。本层级的所有事物总是保持着反常的一尘不染，没有哪怕一点点污垢或是灰尘。
//
//由于没有用途明显的设备或是设施，所以无从辨认Level C-1的自然环境属于何种建筑。事实上，整个Level C-1都不具备任何突出特征，有着且仅有着上段所述的一切。同时，它与多数典型层级一样属于非线性空间，即空间架构并非稳定不变，而是处在时时刻刻的变化之中。这直接导致记录路线的尝试失去意义。
//
//与某些会定期/不定期出现物资的层级1相比，Level C-1显得极其贫瘠，因为它的内部完全没有出现过除去固有摆设之外的任何一类可用物品。这让Level C-1丝毫没有探索价值。
//
//让人略感欣慰的是，找到Level C-1的出口往往无需太久。这似乎印证着Level C-1尽管属于非线性空间，但在广大后室层级之中依然属于较为“小型”的一层。
//
//作为C层群的第一层，本层级却实在没有任何值得注意的额外性质。但LPS（层级定位系统）与层级密钥等多种测验方式都证明了一个事实——它的确是Level C-1。更准确地说：的确是Level C-1的叠加层之一。
//
//不过，结合本层级的遭遇记录远远不比其他Level C-1叠加层的事实，相关人员大胆假设后室的混沌结构之中其实依然存在有一定程度的稳定部分，而本层级或许是连接着层群I与C层群的那数条固有途径之中，最为普通、最为简单、最为平庸的通道（之一？）。而与此同时，它和其他情况更为复杂的叠加层相对而言，本层级在空间层面上极有可能略为偏僻。
//
//实体：
//没有已经证实的目击2。
//
//photo-1652384555695-8ff0f7220b71?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1056&q=80
//Level C-1的入口形式之一。
//
//基地、前哨和社区：
//该层级不存在已知的基地、前哨和社区。
//
//入口与出口：
//入口：
//在Level 0切出有几率到达本层级。
//在Level 0中有几率发现一个纸箱。流浪者们可以通过跨进纸箱的方式抵达本层级。
//出口：
//在Level C-1中探索足够遥远的一段距离3，即有几率发现一扇连接着Level C-2的门口。
//在切入本层级的原始地点尝试反复切出，将有几率回到Level 0。
//作者信息
//« Level C-1报告集 | Chuckler的报告 | Level C-2 »
//
//Footnotes
//1. 例如Level 1。
//2. 根据流浪者们的报告，本层级总是会在较为遥远的地方发出重物倒地的声音，但却完全找不到任何声源迹象。这究竟是某种未知实体所致还是幻觉因素尚且无从知晓。除此之外，本层级没有任何声响。
//3. 有流浪者自称运气极佳，切入本层级不久便发现了通往Level C-2的出口。真假未知。
//
//
//叶芷的报告
//Level C-1 » 叶芷的报告
//你曾经有过这样的经历吗？你是否曾在安寝之后短短十数分钟内猛地惊醒，但脑海之中却没有半点梦境的回忆？你是否曾经在潜意识的幻想之中毫无征兆地一脚落空，在床上惊恐地睁开双眼？你是否曾经在半梦半醒间感到有什么东西压在自己的胸口，清醒之后却又发现闷痛的感觉突然一扫而空？
//
//在那个瞬间，你是否抬眼注意过自己的寝息之所？无论是朝夕相处的卧室、还是缓缓行进的列车，抑或是异国他乡的酒店——在那个瞬间，你是否发现过，异常正在从每一个角落缓缓滋生？
//
//在那个瞬间，你是否想过，自己或许已经来到了现实的边界？
//
//
//
//
//
//
//
//评分: 
//+95
//+
//–
//X
// 
//
//生存难度：
//地形变动
//精神影响
//无法勘探
//Level C-1是后室C层群的第1层。
//
//描述
//Level C-1是C层群的起点，也是除了Level 0、1、2之外又一个可以直接从前厅进入的层级。
//
//对于Level C-1存在与否的争论从未停止。在被正式编号为C-1之前，该层级曾经有过许多名字：失落一族的文献之中对它的记载多为“噩梦”或是“转角”，而现代的后室居民则普遍称之为“阈点”。
//
//有许多学者认为Level C-1实际上并不存在，只是大量后室居民在漫长的时间中自然积累出现的“群体错觉”；也有人说该层级实际上就是前厅。但在M.E.G.档案部讨论过后还是决定将之列为Level C-1可能的叠加层之一。尽管目前缺乏任何可能的手段用于测量该层级的实际编号，但鉴于其表现出的性质，倘若此层级的确存在，那么它毫无疑问是Level C-1，也理所当然是Level C-1。
//
//目前普遍的观点认为，Level C-1是一个位于现实与后室之间的临界点。它连通着前厅与后室，是一个人在抵达这片超现实的荒谬迷宫之前踏过的最后一道门槛。这也是其得名“阈点”的原因：该层级处于现实与异常、真实与虚幻的交界之处，作为前厅与后室的间隙，同时表现出了两者的性质。
//
//进入Level C-1的方法是未知的。根据收集到的报告，最有可能的进入方法是在“半梦半醒”的时候因某种原因突然醒来，但我们无从得知这一推论是否正确、该层级是否还有其他未知的进入方式。
//
//Level C-1表现为进入者就寝的房间。此处的“房间”指的是包含进入者的最小封闭空间，包括卧室、车厢、船舱、帐篷等。其面积并没有具体限制，少数流浪者报告称他们进入的Level C-1表现为自己露天住宿的城市、甚至是草原。由此可以推测，Level C-1最大的面积很可能与前厅相当。
//
//进入Level C-1的人通常处于惊恐、茫然或是困惑的状态之中，并感到暂时的清醒。届时他们将开始下意识地观察自己所处的环境，并发觉自己正在从一种“陌生”的角度审视周围，其具体表现包括：
//
//发现某个平时一直存在、但却从未注意过的事物；
//认为某个习以为常的物件变得突兀且不自然；
//认为某个事物表现出了不应有的性质；
//感到严重的违和感，却无法说出原因；
//认为自己在当前的环境之中格格不入。
//据信Level C-1的外观将会与进入者睡眠的环境完全一致，包括所有物件、装饰的外观，甚至是其他身处同一空间的人类。但上述感觉依旧会浮现在进入者的心头，并且会随着时间的推移越发显著、最后到达令人无法忽略的地步。
//
//以下为作家托德·艾登1对于该层级的描述：
//
//[打开成功]
//　　……那时候我睁开了双眼，发现自己还在卧室里躺着。这本来是一件很正常的事——我过去也常常在深夜惊醒。但这一次，我却感觉有点不对劲。
//
//　　一种窒息、烦闷的感觉在我的胸膛里翻滚，就好像有什么东西突然被打破了、又或者说是有什么被改变了。我试图闭上眼睛，继续睡觉，却完全无法让自己静下心来。“不对劲”的感觉继续在我的脑中滋长，一种强烈的不安促使我再一次睁开了双眼，看向卧室的天花板。
//
//　　我看到了那个霉斑。我在这里住了七年，每一晚睡前都可以看到那块霉斑。我甚至还记得刚搬过来时房东拉斐尔太太带着我看它，问我在不在意。我当时说的是不在意，但现在我有些迟疑了。
//
//　　我盯着那块黝黑的斑痕，突然发现它的形状就像一只眼睛——我以前从来没有这么想过。我捂住眼睛认真回忆记忆里那块霉斑的样子，但却无论如何都无法想到清晰的轮廓。再睁开眼，就会发现那块霉斑正在死死地盯着我。
//
//　　那不是我的错觉，我敢肯定。即使现在距离当年已经过了十多年了，我也清楚地记得那时的感受。那块霉斑像一只阴险的、邪恶的眼睛，来回打量我的浑身上下。
//
//　　然后我才发现我出了一身冷汗。我疯了。我心想。我居然认为一块真菌正在盯着自己看——只有精神病院的病人才会这么想。我立刻翻身下了床，披上睡袍，试图避开那块霉斑的视线。
//
//　　忘了它。霉菌不会盯着人看。那块霉斑已经在我的房间里待了七年了，它或许在这期间变大了一些，但是绝对不可能会变成什么眼睛。那只是一群真菌而已。
//
//　　我拉开窗帘，窗外是熟悉的城市。一切都安然无恙——我默默做了两个深呼吸，告诉自己平静下来，自己只是做了个噩梦。作为一个成年人而言这已经足够狼狈了，而且现在显然还是午夜，如果这时候失眠就会导致明天的精神状态不好，说不定还会被总编数落——快去睡觉，托德，把你的妄想丢到脑后，那是只有不成熟的孩子才会惧怕的东西。你已经25岁了，是一个马上就要结婚的人了。我又看了一眼窗外那熟悉的雾中都市，路灯在楼下成排立着，远处似乎还有星点灯光穿过雾气传来。一切都安然无恙。我的心逐渐平静了下来，转身准备接着睡觉。
//
//　　然后我看到，那块霉斑仍在恶毒地窥视着我。
//
//　　我崩溃了。我像个孩子一样歇斯底里地尖叫了起来，冲向卧室紧闭的房门，疯了一般地拧开了门把手，随后冲了出去。
//
//　　门外是一条陌生的河。
//
//
//
//——节选自《闲笔17：回忆》
//
//在该层级内，进入者的精神状态将会急转直下，变得极度脆弱。强烈的陌生感与异样感会使其迅速崩溃，这一过程通常不会超过10分钟。进入者将开始迫切渴望离开Level C-1。
//
//离开Level C-1的出口通常就是封闭空间的门，包括房门、车门、舱门等等。在少数情况下，即Level C-1表现为开阔地带时，这一出口将会表现为“进入某个室内空间的门”。如果身处草原、荒野等完全不存在门的开阔空间，则进入者将会感到“某一地点”就是这里的出口。
//
//出口的概念似乎被通过某种心理暗示根植在了进入者的心中，因此当其崩溃时会潜意识地冲向出口。从出口离开Level C-1后，进入者将会出现在某个C层群层级。出口连通的层级似乎是完全随机的，目前并未发现任何规律。
//
//没有人知道逗留在Level C-1会发生什么后果。有人说抵御住异样感继续睡眠即可回到前厅，也有人说来不及出来的人都会被惊惧感折磨致死。没有人知道真正的答案，因为只要一个人出现在后室，出现在C层群，就证明他逃出来了。我们不知道继续留在那里会发生什么，也无法做出任何推测。
//
//当狂奔到出口的一刹那，进入者就会即刻切入其他层级。这一过程就像在后室之中切入/切出一样，仅需瞬间便能完成，且几乎没有回头路。目前没有任何已知的再次回到Level C-1的方法，这也就意味着一个人一生只会在“阈点”之中出现一次。
//
//只要一次，便会从现实抵达地狱。
//
//作者
//« Level C-1报告集 | 叶芷的报告 | Level C-2 »
//
//Footnotes
//1. 托德·艾登（1937-？）：英国作家、探险家。于1962年进入后室，主要在C层群与I层群内活动。托德曾撰写过数十篇记述自己在后室所见所闻的散文，其手稿被好友马丁·伯纳德的女儿收藏，并于21世纪初通过网络发表。
//
//
//Jinchouge的报告
//Level C-1 » Jinchouge的报告
//评分: 
//+42
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//stair1
//pig.1 向下楼梯间
//
//Level C-1是后室C层群的第1层，也可能延伸至任何其它层级。
//
//描述
//Level C-1是一处封闭且向两端延伸的楼梯间，它大部分由裸露的水泥地构成，有时候也发现有木地板、草地、湿软的地毯和瓷砖铺成的梯阶，但大多数不会重复出现。区别于其它层级，Level C-1完全由楼梯这一构筑物构成，故此流浪者几乎无法在此长期居住并建立社区。本层级曾是作为层级间垂直交通用的主要通道，但之后因一起严重事故而被废弃了很长一段时间，直到最近被重新发现并使用。
//
//在Level C-1任何位置能发现来自上方的自然光照，偶尔会发现一些亮度较低且老旧的灯具和窗户。从吹拔向楼梯两端观察总会发现在视野范围内的终点，但无论如何前进都不会到达终点，有时候围护会在一处断开。当到达一处平台时，这里总会出现一扇门，这些门大多数通往那些被记录的层级，仅有极少数在进入大门后该流浪者再未出现的例子。
//
//Level C-1会在任一部分开始延伸、分叉、缺失和与表现出非欧几里得几何特质。楼梯通常会在单跑楼梯、双跑楼梯和多跑楼梯之间相互转换。当流浪者在踏上某级踏步时，整段楼梯断开并向更高或更低位置连通。有一部分断开的楼梯需要另一个流浪者在某一特定位置观察到楼梯连接在一起才可以连通。上述情况出现时，总伴随着流浪者对前往某处的渴慕而出现，随后流浪者可以快速到达附近的楼梯平台，确信这些现象能帮助离开这一层级。
//
//流浪者越向上前进，则会逐渐感受到渐强的自然光照和温暖，这总会让流浪者相信他们即将到达这一层级的终点位置，但继续前进也仅会停留在原地。鉴于Level C-1自身构件的基本性质，流浪者确信在层级内存在一处最终目的地，但当前仍未发现前往的方法，也无法确定其位于高处或低处。
//
//反之流浪者越向下前进，则越会感受到周围环境带来的阴冷和潮湿，在低处相较于高处会更加寂静和寒冷，尽管低处和高处一样到达一定区域后会失去显著特征和意义，但曾有传言声称在整个层级的最低位置是一处散发着淡淡蓝色辉光的设施，其内部大部分设备均无法使用，且长时间滞留会感觉恶心和呕吐。该传言目前未被证实。
//
//目前未知从Level C-1跌落的结果如何，不建议流浪者对此进行尝试。
//
//stair2
//pig.2 向上楼梯间
//
//Level C-1的入口与Level 0连接紧密，可以借此直接到达其它层群，但由于在入口处其它通道均被使用混凝土阻挡，当前仅能到达C层群。考虑楼梯本身及其周围空间的关系，确信Level C-1原本作为整个后室的附属空间存在，在很长一段时间内被用于连通各个层级的交通，在当时后室各层级之间互通有无且无其它切入切出方法，但在此发生的一个或一系列事件后，各层级之间失去了直接交通手段，层级间的交流也逐渐停止，Level C-1被久置不用。
//
//该事件在此后被称为“后室隔离”，因其可能涉及流浪者和原住民之间的矛盾，较年长的的流浪者和实体拒绝以任何方式交流相关情报，尽管该事件被认为是对现状无害的，但大多数知情人士均不情愿透露相关信息，似乎该事件被认为是羞愧且难忘的，但随着年长者的离世，相关事件的真相也逐渐无法考究。该事件至今仍对整个后室有深远的后续影响。
//
//确信当后室隔离再次发生时，目前已探明的所有层级出入口均会无效，届时各个层级之间的联系会再次停止，直到流浪者发现新的切入和切出方法。当前未知导致后室隔离的诱因为何，后室目前为止至少发生过一次，确信与Level C-1自身的性质直接相关。
//
//此后当Level C-1被再次发现时，流浪者发现此处遍布严重的燃烧痕迹，墙壁和扶手处布满碳灰和硫磺，大多数踏步较厚的潮湿地毯覆盖，地上散落着废弃荧光灯，在一些特定楼梯平台处还能感受到余烬散发的热量。除了入口处周围一段范围以外的区域布满了超出安全阈值的电离辐射，在做好万全准备之前请勿贸然探索。鉴于Level C-1自身的稳定性以及安全性，将其彻底清理并探明的计划正在讨论中。
//
//实体：
//stair3
//pig.3 Level C-1入口
//
//此处并无实体。
//
//基地、前哨与社区
//该层级不存在已知的基地、前哨和社区，但曾有流浪者在此发现过失落一族的痕迹。
//
//入口与出口
//入口
//在Level 0切出有几率到达本层级。
//在Level 1内找到一扇被封锁的楼梯间门可到达本层级。
//出口
//经由入口处可到达Level 0。
//前进一段时间后，在随机出现的楼梯平台大门处到达C层群的任一层级。
//在指定楼梯平台可到达Level 0至Level 8。
//
//
//Level Cᵒₙᶠᵘˢᵢᵒₙ-1
//评分: 
//+80
//+
//–
//X
//
//> $access backrooms-database |grey "Level C-1"|vi
//
//ACCESSING MEG-DATABASE……
//MEGDB : Doc was encrypted.
//ENTER PASSWORD：
//
//> 电线造物
//
//DECLINE.
//
//> 利维坦
//
//DECLINE.
//
//> 雕像
//
//DECLINE.
//
//> 朗基奴斯之枪
//
//DECLINE.
//
//>
//
//PASSED.
//Loading User-Interface…
//
//
//
//
//
// 
//
//生存难度：
// 
// 
// 
//Level C-1应当是后室C层群的第0层。
//
//描述
//截至目前，仍未有人发现Level C-1真正的踪迹。
//
//理论上，Level C-1是前厅与后室之间的边界。Level C-1正是你正在寻找的阈值。Level C-1由大量碎片构成。任何时刻，跨过Level C-1都将使你来到 后室
//前厅
// ，任何主体或客体都将在此处洗牌，重组，更换方式排列。
//
//指南：不要相信你的思考，也不要怀疑你的思考；抛弃思想。
//
//指南本身会对Level C-1造成不可逆转的损害。
//
//不要看这些
//
//Level C-1的结构熵极低。
//Level C-1是层级。
//Level C-1可被提及。
//Level C-1可能真实存在。
//[请输入文字]
//最后一次更新：2023/3/27 15:47 MEG数据库管理部门
//
//本文件已归档，请勿再次调用。
//
//
//
//已知
//
//Level C-1本体论性的存在。
//
//Level C-1不是月亮和地球之间的河。那条河很宽，很急，水花像四溅的阳光。
//
//Level C-1不是铜绿色的潮汐，泰然自若的血渍。磨坊生锈的大门。
//
//Level C-1是永恒的现实。
//
//Level C-1是转瞬即逝的回忆。
//
//Level C-1不是致人于死地的路和野炊的诗。
//
//Level C-1不是黄色地毯。
//
//Level C-1不是
//
//Level C-1是原始的神经网络，是退化但并未消散的理智。
//
//Level C-1不是概念。
//
//Level C-1不是后室的一部分。
//
//Level C-1不是前厅的一部分。
//
//Level C-1不是可被思考的。
//
//Level C-1是由大量互不相干的片段构成的。
//
//Level C-1是破碎的。
//
//Level C-1是去中心化的。
//
//人无法拒绝思考。
//
//梦永远不完整，
//
//世界上只有片段。
//
//
//
//
//
//
//
//
//
//
//
//片段1
//我醒了。
//
//我在一滩黄色中醒来。身体侧躺在一片地毯上，那地毯浸了水，呈现出潮湿的暗黄色。灯光充足。我看到同属昏黄的墙纸和天花板，浸满同样肿胀的水，随重力而下垂，摇摇欲坠。我开始晕眩；电线，蛆虫，气球，数以万计的臆想造物，尖啸着从拐角处涌出。
//
//[×]完整化错误：低于LC1阈限
//
//片段2
//我在一条黑暗、逼仄的走廊中醒来。
//
//墙壁灰暗，四周一片沉寂；天花板上只有一盏灯。灯光南侧一米，中点，我站在这里，视网膜是粘稠的黑色。
//
//湿润的风扇声音嗡嗡作响，引出拐角处的人影，带着些窸窣的摩擦声。
//
//我选择朝它前进。然后，我看到一片死黑色的剪影坐在轮椅里面。
//
//“吞下苹果。”剪影说。我俯下身盯着他，发现他的脑袋上有一颗雪景球，而他的身旁摆满了苹果。
//
//我握紧苹果，我趴在地板上啃食。搞砸了：我把苹果籽撒满了地板。
//
//“捡起你掉的垃圾。”雪景球命令道，“然后丢到垃圾桶里。”
//
//“我做不到。”我垂下头说，食指与拇指在揉搓衣角。
//
//“把衣服都洗了。”雪景球说，“门栏侧面的疤，赶紧把它擦掉。”
//
//“我做不到。”我接着说。
//
//“捡起那朵花，”雪景球在说梦话。“窗台上的花瓶要摆在一条线上。”
//
//窗台的花瓶，我想，窗台在哪里？
//
//窗台很高，面向一望无际的旷野。此刻正是傍晚，晚风可以拂面而来。我走到窗前，伸出脖子直面原野。远处，一条废弃的铁塔发出了诡异的电波声。我朝电波声望去，发现塔底有一朵枯萎的花。
//
//“插到花瓶上。”雪景球说。
//
//我把那朵花的花柄捏了起来。
//
//[×]碎片化错误：高于LC1阈限
//
//片段3
//时间是深夜，也有可能是深夜的两倍。我的视野黑到清澈。黑的边缘，黑的填充，黑的满溢；有闪光灯，闪光灯很亮，很近，很大。我在公路上，公路很小，贴在我脸上，因为我能感受到它的温度，是刺骨的凉爽。我踩在视野中间。脚底下有一朵花，我可以捡起来。
//
//但我没有动。视野一直在被闪光灯照亮。脚下是柏油路。我沉下心来开始等待，但我弄不清分寸，所以一不小心就在公路上站了很久。
//
//我没有表，可能也不重要。
//
//[×]碎片化错误：高于LC1阈限
//
//Level C-1是永恒的现实，又称与永恒有关的误导。
//
//在Level C-1内部，动与静的阈限将被混淆，现实与超现实的边界也将被混淆。或者说，根本不应牵扯Level C-1的内外与否。这样的尝试将不可避免的失去意义。
//
//Level C-1是蜷缩在果核内的空间，它黑暗、狭小、温暖，它是逼仄而完满的层级。
//
//不应当牵扯内、外，不应当牵扯动、静，不应当牵扯顺理成章、牵强附会。Level C-1既不属于后室，也不属于前厅。Level C-1是一地的碎片。
//
//不要思考。
//
//不要试图思考。
//
//不要拒绝试图思考。
//
//不要试图拒绝试图思考
//
//不要拒绝试图拒绝试图思考
//
//不要试图拒绝试图拒绝试图思考
//
//不要拒绝试图拒绝试图拒绝试图思考
//
//
//
//片段4
//我每天都会上学，今天也不例外。每次上学的时候我都会背上书包，这次也不例外。
//
//每条路上我都会进入相同的学校，每条都不例外。
//
//因为我家门口有无穷多个学校。
//
//[×]完整化错误：低于LC1阈限
//
//片段5
//我趴在窗边，顺着缝隙合上玻璃窗。窗户有十层楼高，窗外暖阳如画，清风如注。天空在窗外铺展。像是温柔的画布，扯开了一切褶皱。
//
//是啊，春天要结束了，一团团心事却仍然纠缠在我的心头，令我寝食难安。我回忆我们的过去，却一直不明白我做错了什么。我在审判自己的内心。
//
//为什么，为什么我的每一条嘘寒问暖都被她忽略了？这些天来，她为什么不肯与我说话了？我做错了什么，或者说，她已经……？
//
//不，不会的。我相信她不会的。
//
//我透过玻璃望向橘黄色的天幕，黄昏令人恍惚的阳光照在我的睫毛上。
//
//是啊，时间还早，还有很多事情值得我去改变。
//
//我垂下头。
//
//她睡得很香。
//
//除了脑浆在流淌之外，都还不错。一切顺理成章。
//
//别着急，炎热的季节才刚刚开始。
//
//[×]完整化错误：低于LC1阈限
//
//片段6
//苹果：发霉
//
//小提琴：被扯断了
//
//餐桌：摆满了菜
//
//勺子：撞击碗的边缘
//
//电视：播放广告
//
//笑：N/A
//
//[×]
//
//片段7
//我跟着一张面具行走。我们走在一条公路上，阳光清澈，白云如丝，天空是蓝色的玻璃，饱和过度。
//
//我问：“
//
//路上出现了一头大象。它肥硕的身躯横跨道路左右，四肢戳在地面上而不留阴影，凝固得如同蜡像。我在它面前就像一只蝼蚁。我罔两-孤独-孓立，我的踪迹无处可寻。
//
//忽 视 大 象 尽 情 行 进 吧
//
//我们什么时候才能走到头？”
//
//我问，语气捎带些不满。面具在前进，可是它停下了脚步。它转过身来，用苍白的面颊和三个不合时宜的洞指着我。它张嘴了，说出了些意料之外的话。“跟上他，他知道。”面具说，她话里的每一个字都透露出苍白的气息。
//
//“道路的尽头有花。”
//
//枯萎的花。
//
//道路的尽头有枯萎的花，我们恍然大悟。原来如此。我们继续行走。
//
//[×]
//
//片段8
//我来到了天堂。
//
//天堂是夕阳，夕阳下的海滩，海滩上的酒店。远处有热带雨林，密密麻麻的树冠可以在风中摇动。
//
//我不再想回家了，我总能有自己的出路。
//
//[×]
//
//片段9
//我看见了因特网
//
//[眼球 宽带中 移动]
//
//我把钟表倒灌进因特网
//
//[指针融化，和雨点般的呻吟声混在一起]
//
//我爱因特网
//
//[事实：耶稣吸毒成瘾]
//
//我是因特网
//
//[事实：有人在敲门]
//
//片段10
//糟糕，月亮先生把他的手电筒指向了我。我慌张的趴下抱紧双头。幸运的是，光线衍射到一半时弯曲了。
//
//我如释重负，走到月亮先生面前。我看到他的头颅在空中漂浮，一些雨正稀里哗啦的下着，钢琴伴随雨点的节奏跳跃。
//
//“您……您好。有件事想麻烦您。”我战战兢兢的试探道。
//
//月亮先生不说话，他只是看着我。
//
//“现在我回不了家，因为门被锁住了。”我说，“您能把花借给我用一会吗？”
//
//不出意料，他有一朵花。月亮先生把他的花（已经枯萎了）递到我手上。我看到他脖子上淡紫色的半月，连带紧致的西装一同瑟瑟发抖。
//
//“这是我送你的花。”月亮先生说，“但是，作为代价，你需要吃掉月亮。”
//
//我惊恐的盯着他。他刚才说月亮。这是什么意思？我后退一步，我开始紧张了，于是全身肌肉逐渐收缩，于是青筋四起，铜臭味的荆棘刺伤了我的手掌。
//
//血溅在清晨的牛角面包上。天亮了。
//
//片段11
//我回家了。是我的家。在那里，一切照常运转。
//
//墙角有水渍，风扇吱吱哟哟的颤抖，秒针失去窒息的欲望，水果化为粘稠的汁液从雪花屏中淌开。
//
//看不见时针了。
//
//我关上门，我打开灯，我打开空调。（电费总该解决的，但我想不该是现在。）
//
//天花板被什么东西润湿了。恶化，扩散，不可阻挡。有重力，在墙纸上。墙纸上出现了令人窒息的沉重，随后便出现了些断断续续的拱形。我躺在床上，还没有等我愿意对眼前的情况做出反应，我就被包围了。所以我决定挣扎，但终究没有逃过一劫。
//
//我选择出门，因为我可以去更远的地方。那里有时间和历史，那里没有机械中的幽灵。那里还有枯萎的花。
//
//我从床边握住把手向后一拉，没有花费任何冗余的力气。门外仍然是床，于是我大喜过望。
//
//我没有找到时间和历史，也没找到机械外的幽灵，不过我找到了枯萎的花。
//
//我捏起了它枯萎的花柄。
//
//片段12
//我来到了天堂。
//
//轨道偏移，光和水出现在镜头中，随后光的剪影从光中流出。浮雕呈写实风格，由大理石和青铜制。
//
//2.78秒后，剪影拼凑出一个人的轮廓。
//
//“我是旅者。”他开口便说，“我恰好经过此地。”
//
//他是旅者。
//
//“我是旅者吗？”我问。
//
//“你也是旅者。”他继续说，“因为圆是世界上最完美的形状。”
//
//圆。圆。
//
//“花是世界上最完美的形状吗？”我紧紧揪住手中枯萎的花柄，追问道。
//
//“花不是最完美的形状。花很美，但花有缺憾。花是破碎的形状。”
//
//破碎的形状。
//
//“我该怎么办？”
//
//“你该握住你手中的花。”
//
//我用整只手掌把深黑色的花握在拳心。“这样如何？”
//
//“完美。”
//
//从这里开始我明白了。在后室，死亡不是解脱，在前厅，生存同样不是解脱。祂们的边界上，解脱将失去意义。不可名状的不可名状。混淆任何东西。清晰的事物，一定是远离边界的存在。
//
//完整必定杀死完满
//
//曾经世界变成了片段，如今片段变成了全部的世界 潮湿的黄色地毯可以覆盖大约六亿平方英里随机分割的空荡房间 童年同样转瞬即逝 与此相比 Level C-1更加 迷茫
//Confusion
// 
//
//人不能同时在所有地方生活
//
//我要重新拿起M.E.G.的救生设备 有荧屏 按钮是红色的 然而我却从中看不到一点希望 不可能 我们什么时候才会试着改变
//
//只有世界会更加完满
//
//Level C-1 只会 形式主义 的 存在。
//
//到彼岸去
//
//到彼岸去。
//
//
//
//
//
//片段
//我捏住花柄，在荒原上行走。
//
//片段
//我捏住花柄，在星星点点的虚空上行走。
//
//片段
//我捏住花柄，在黑暗的管道间行走。
//
//片段
//我捏住花柄，在流弹横行的战壕中行走。
//
//片段
//我捏住花柄，在如水的天空上行走。
//
//片段
//我捏住花柄，在潮湿的办公室间行走。
//
//我捏住花柄，我在雨中行走
//
//我捏住花柄
//
//我捏住花柄
//
//我捏住花柄
//
//我在草原上行走。
//
//
//到彼岸去
//
//
//
//
//到彼岸去
//
//
//我醒了。
//
//我在Level 10的泥地中醒来。耳边有雨点，雨在下。我发现自己的全身已经被雨水打湿了，睫毛也是，上下两只眼皮牢牢的黏在一起。不过没有关系；我深呼吸一口气，在密密麻麻的青苗之间睁开眼睛。
//
//雨。雨仍在淅淅沥沥地下着。天空派生出忧郁的水蓝色，白雾和麦苗在模糊的视野中连成一体，直到世界的尽头。
//
//M.E.G.分发的防护服已经黏在我身上了，我的身体被牢牢压缩在护服中，不适感袭上皮肤各处。于是我展开蜷缩的四肢，试图从潮湿的土壤中爬起来。但随即，我的手指触碰到了一个异物。我艰难的在泥土中扭动脖子，向那异物的方向看去。
//
//一朵枯萎的花，躺在潮湿的泥土中，任由雨水拍打在它深黑色的花瓣上。
//
//我伸出手，捏住它的花柄。雨点正在变得愈发 混乱
//Confusion
//
//
//Des, Perado与Dr day的报告
//Level C-1
//» Des, Perado与Dr day的报告
//评分: 
//+59
//+
//–
//X
//关闭
// 
//
//生存难度：
//等级 4
//
//不安全
//实体绝迹
//环境恶劣
//描述
//虞丘是Level C-1的叠加层之一。
//
//虞丘是一方面积广袤、地势起伏但舒缓的丘状地形，由大量成分复杂的灰黑色颗粒物组成。在层级的中央有一块被命名为为“烬山”的凸起山型地形。在烬山上边可以找到大量插在灰烬间的破旧铜柄赤色旗帜。
//
//在层级内可以找到大量分散的建筑物废墟，多数建筑以黑、红色调为主，主要由石料与木料构成，多采用对称式布局，带有明显的抬梁式或穿斗式结构。少数建筑物内可以找到部分可用的风干面食或罐装水体等物资。目前任何破坏建筑废墟的尝试均以失败告终。
//
//在烬山的底部可以找到一个可容一人通过、长约200m的隧道，隧道的四壁由于未知原因而异常牢固且不可破坏。该隧道位于200m之后的部分被严密地封死，但仍可以良好通风。
//
//层级内的天空总是弥漫着大量的烟尘，且气温总是维持在45~60℃之间，气候极其恶劣，长期于此层级停留会有生命危险，且完全没有任何有价值的资源。故若有流浪者来到该层级，请向我们驻扎在层级各地的据点人员寻求帮助并撤离。
//
//基地、前哨与社区
//M.E.G.前哨“迁离者”
//由五百五十名武装部特工组成。无专属据点，前哨人员分布在本层级各处。
//负责保护处于本层级流浪者的生命安全。并将进入的流浪者安全送出本层级。
//入口和出口
//入口
//从Level C-4内赤脚将巨石推到山顶。巨石被推到山顶后会即刻向后滚落，在被碾压过后，将有一定概率切入Level C-1内
//尝试切入Level C-462内装有灰烬的装料袋内将来到此层级
//在Level C-444内切入一堆围绕有漆黑色石头，已经熄灭但装有大量木炭的篝火内将来到此层级。
//从任意层级中尝试切入正在燃烧的火焰内有概率来到此层级。
//在C层群内任意层级找到一块黑色石质小鼎后将被传送至此层级。
//在Level 0、Level 1、Level 2或Level 3内踏入一堆不受任何外界因素影响而静止的黑色灰烬中将来到此层级。
//
//出口
//从烬山顶部尝试切入地面将进入任意一个生存难度低于二的层级。
//尝试切入任意插在地面上的的赤色旗帜内，将有概率切入Level 0。
//权限验证通过，欢迎您。
// 
//
//生存难度：
//等级 4
//
//不安全
//实体绝迹
//环境恶劣
//描述
//虞丘是Level C-1的叠加态之一。
//
//虞丘是一方面积广袤、地势起伏但舒缓的丘状地形，由大量成分复杂的灰黑色颗粒物组成。在层级的中央有一块被命名为为烬山的凸起山型地形。在烬山上边可以找到大量插在灰烬间的破旧铜柄赤色旗帜。
//
//在烬山的底部可以找到一个可容一人通过的隧道，隧道的四壁由于未知原因而异常牢固且不可破坏。在深入隧道长约200m后尝试切入地面内，将进入一片较大的地下空间。
//
//该片空间内的地面、墙壁乃至天花板上都凿有大量带有明显人造痕迹的液槽，大量未知红色高温流体以一种未知方式克服重力以流淌在液槽中。我们的大多数据点成员在非执勤时间将驻扎在该空间内。由于气温和空气中的灰烬量会明显地随着深度而增加，故向空间深处的继续探索被认为会是危险且不可取的。1
//
//在层级内可以找到大量分散的建筑物废墟，多数建筑以黑、红色调为主，主要由石料与木料构成，多采用对称式布局，带有明显的抬梁式或穿斗式结构。少数建筑物内可以找到部分可用的风干面食或罐装水体等物资。目前任何破坏建筑废墟的尝试均以失败告终。
//
//层级内的天空总是弥漫着大量的烟尘，且外部气温总是维持在45~60℃之间，气候极其恶劣。长期于此层级停留会有生命危险。但地下空间内部核心地带的空气较为清洁，且气温则保持在28℃不变。但由于层级内完全没有任何有价值的资源。故驻扎在此的据点成员的唯一使命就是帮助误入层级的流浪者们。
//
//基地、前哨与社区
//M.E.G.前哨“迁离者”
//由五百五十名武装部特工组成。无专属据点，前哨人员分布在本层级各处。
//负责保护处于本层级流浪者的生命安全。并将进入的流浪者安全送出本层级。
//入口和出口
//入口
//从Level C-4内赤脚将巨石推到山顶。巨石被推到山顶后会即刻向后滚落，在被碾压过后，将有一定概率切入Level C-1内
//尝试切入Level C-462内装有灰烬的装料袋内将来到此层级
//在Level C-444内切入一堆围绕有漆黑色石头，已经熄灭但装有大量木炭的篝火内将来到此层级。
//从任意层级中尝试切入正在燃烧的火焰内有概率来到此层级。
//在C层群内任意层级找到一块黑色石质小鼎后将被传送至此层级。
//在Level 0、Level 1、Level 2或Level 3内踏入一堆不受任何外界因素影响而静止的黑色灰烬中将来到此层级。
//出口
//从烬山顶部尝试切入地面将进入任意一个生存难度低于二的层级。
//尝试切入任意插在地面上的的赤色旗帜内，将有概率切入Level 0。
//权限验证通过，欢迎您
// 
//
//生存难度：
//等级 4
//
//不安全
//实体绝迹
//环境恶劣
//描述
//虞丘是Level C-1的叠加态之一。
//
//虞丘是一方面积广袤、地势起伏但舒缓的丘状地形，由大量成分复杂的灰黑色颗粒物组成。在层级的中央有一块被命名为为烬山的凸起山型地形。在烬山上边可以找到大量插在灰烬间的破旧铜柄赤色旗帜。
//
//在烬山的底部可以找到一个可容一人通过的隧道，隧道的四壁由于未知原因而异常牢固且不可破坏。在深入隧道长约200m后尝试切入地面内，将进入一片较大的地下空间。
//
//该片空间内的地面、墙壁乃至天花板上都凿有大量带有明显人造痕迹的液槽，大量未知红色高温流体以一种未知方式克服重力以流淌在液槽中。我们的大多数据点成员在非执勤时间将驻扎在该空间内。越向空间内部深入，环境越恶劣。而空间最深处则摆放有一个长、宽、高皆约一百五十尺的大型铜质圆腹古鼎，其无法被破坏与移动。古鼎具八足，其中的四足较大，起主要支撑作用，其余四足为辅；双耳高耸，向外张开，呈圆角矩形状；浑体铸有方整流畅的纹饰，并刻有大量成体系的未知契状铭文。
//
//古鼎的顶部开有阔口，但鼎口被大量质感类似木炭的块状半透明物遮盖，只能看到有时鼎内会有火焰燃烧跳动并放射出红色的光芒。经过证实，任何在古鼎工作期间靠近古鼎的非人物体都将由于所谓“天道”不可避免的蚕食而逐渐解体。该现象在物理世界的表现则为物体逐渐化为成分复杂的灰黑色颗粒物。
//
//层级内的天空总是弥漫着大量的烟尘，且外部气温总是维持在45~60℃之间，气候极其恶劣。长期于此层级停留会有生命危险。但地下空间内部的空气较为清洁，且气温则保持在28℃不变。但由于层级内完全没有任何有价值的资源。故驻扎在此的大多数据点成员的使命就是帮助误入层级的流浪者们。部分具有较高权限的据点成员则有着保护铜制古鼎的任务。
//
//基地、前哨与社区
//M.E.G.前哨“迁离者”
//由五百五十名武装部特工组成。无专属据点，前哨人员分布在本层级各处。
//负责保护处于本层级流浪者的生命安全。并将进入的流浪者安全送出本层级。
//入口和出口
//入口
//从Level C-4内赤脚将巨石推到山顶。巨石被推到山顶后会即刻向后滚落，在被碾压过后，将有一定概率切入Level C-1内
//尝试切入Level C-462内装有灰烬的装料袋内将来到此层级
//在Level C-444内切入一堆围绕有漆黑色石头，已经熄灭但装有大量木炭的篝火内将来到此层级。
//从任意层级中尝试切入正在燃烧的火焰内有概率来到此层级。
//在C层群内任意层级找到一块黑色石质小鼎后将被传送至此层级。
//在Level 0、Level 1、Level 2或Level 3内踏入一堆不受任何外界因素影响而静止的黑色灰烬中将来到此层级。
//出口
//从烬山顶部尝试切入地面将进入任意一个生存难度低于二的层级。
//尝试切入任意插在地面上的的赤色旗帜内，将有概率切入Level 0。
//警告
//
//自第三版本后的文档已被封锁。以下内容仅监督者及被指定人员方可访问。
//
//若您拥有权限，请点击下方验证。
//
//— M.E.G.探险者总署
//
//权限验证通过，欢迎您，燧人氏
// 
//
//生存难度：
//
//等级 机密
//
//环境恶劣
//实体绝迹
//存在高度机密
//描述
//虞丘是Level Cheater-1的叠加态之一。
//
//虞丘是一方面积广袤、地势起伏但舒缓的丘状地形，由大量成分复杂的灰黑色颗粒物组成。在层级的中央有一块被命名为为烬山的凸起山型地形。在烬山上边可以找到大量插在灰烬间的破旧铜柄赤色旗帜。
//
//在烬山的底部可以找到一个可容一人通过的隧道，隧道的四壁由于未知原因而异常牢固且不可破坏。在深入隧道长约200m后尝试切入地面内，将进入一片较大的地下空间。
//
//该片空间内的地面、墙壁乃至天花板上都凿有大量带有明显人造痕迹的液槽，大量未知红色高温流体以一种未知方式克服重力以流淌在液槽中。我们的大多数据点成员在非执勤时间将驻扎在该空间内。越向空间内部深入，环境越恶劣。而空间最深处则摆放有一个长、宽、高皆约一百五十尺的大型铜质圆腹古鼎型机器，其无法被破坏与移动。机器具八足，其中的四足较大，起主要支撑作用，其余四足为辅；双耳高耸，向外张开，成圆润的方形；浑体铸有方整流畅的纹饰，并刻有大量成体系的古老契状铭文。
//
//机器的顶部开有阔口，但鼎口被大量质感类似木炭的块状半透明物遮盖。在古鼎工作期间，鼎内会有火焰在燃烧跳动并放射出红色的光芒。经过证实，任何在古鼎工作期间靠近古鼎的非人物体都将由于所谓“天道”不可避免的蚕食而逐渐解体。该现象在物理世界的表现则为物体逐渐化为成分复杂的灰黑色颗粒物。
//
//估计古鼎的建造时间大约位于7000年前，由远古人类文明成员建造。该机器将在检测到文明遭受到巨大危机时创建一份前厅的投影，并且选中所有潜意识中“愿意为了文明的传递而奉献一切”的人类为“诳天者”，将其意识在每日的睡眠中投入到创建的概念模型“灯影”内不断地试错，不惜一切代价找到解决危机的最优解，之后将灯影重叠入前厅并固定概念坐标，达到快速解决危机，维护文明安全的目的。但是，该过程会对“诳天者”们的身体带来极重的负担，会减少部分寿命。
//
//为了维护机器的正常运转，我们成立了特别行动小组，诳天者（Cheater），以适时监控机器状态并进行微观调控。该机器的控制台位于其底部。诳天者可以在在通过相关脱氧核糖验证之后将其解锁。
//
//已知Level Cheater-1内的灰烬皆由燧人氏的概念残渣组成。
//
//古鼎控制台当前显示状况复刻：
//
//当前状态：良好
//
//当前稳定节点数：557个
//
//当前“燧人”个数：197391473个
//
//当前工作状态：工作中
//
//当前工作段开始时间：2019年12月1日0时0分0秒
//
//当前应对危机：瘟疫
//
//“吾辈为燧，薪火续燃”
//
//“人道长尊，荣光永存”
//
//值得一提的是，我们发现了控制台上显示的数个奇怪的图标。亮起的是一个鼎内躺着一名手拿燧石的人类，未亮起的则有：一名被绑在山崖上，头顶有猛禽徘徊的人类；一名戴有鸟头面具，背对太阳与巨型三角建筑的人类；一名手拿燃烧的宝剑与苹果的人类等等。
//
//M.E.G.前哨“迁离者”
//由五百五十名武装部特工组成。无专属据点，前哨人员分布在本层级各处。
//负责保护处于本层级流浪者的生命安全。并将进入的流浪者安全送出本层级。
//入口和出口
//入口
//从Level C-4内赤脚将巨石推到山顶。巨石被推到山顶后会即刻向后滚落，在被碾压过后，将有一定概率切入Level C-1内
//尝试切入Level C-462内装有灰烬的装料袋内将来到此层级
//在Level C-444内切入一堆围绕有漆黑色石头，已经熄灭但装有大量木炭的篝火内将来到此层级。
//从任意层级中尝试切入正在燃烧的火焰内有概率来到此层级。
//在C层群内任意层级找到一块黑色石质小鼎后将被传送至此层级。
//在Level 0、Level 1、Level 2或Level 3内踏入一堆不受任何外界因素影响而静止的黑色灰烬中将来到此层级。
//出口
//从烬山顶部尝试切入地面将进入任意一个生存难度低于二的层级。
//尝试切入任意插在地面上的的赤色旗帜内，将有概率切入Level 0。
//-
//-
//-
//-
//-
//-
//
//附录
//我们在初次对地下空间的深探行动中，在古鼎前发现了一滩隆起的松散灰烬，上边摆有半根正在瓦解的钢笔，一套残缺不堪的黑色中山装，还有一封保存完好的手信。手信的内容似乎为数十年前的一名流浪者所写。经过考证，我们发现一个惊人的事实：信上叙述了有关本层级乃至整个C层群的真相。
//
//关闭
//你好，我是“星火”，一名诳天者。
//
//书写像是揭开了某片尘封的幕布，让我回忆起属于从前那个熟悉的世界的记忆——这让我很是开心。当然，这也是一个冒险的举动。对于现在的我来说，任何对“自己仍然存在”的不确信或者不专注都有可能引起那东西的趁虚而入。但现在的我也不怎么怕了——当写下这句话的时候，我的左臂与下半身已经全部坍为灰烬了。我很清楚自己没有多长时间了，于是也便随手来写些东西，将我知道的全部记录下来。
//
//首先是我身后的这座古鼎。实在地来讲，这鼎是通过“燧人氏”的努力，在某个无序的恶念与我们的故乡之间构筑了一道障垒式的模型，以阻隔其与人类文明的连接。我们通常称这个侵吞着历史、蚕食着未来的实体为“天道”，祂依托于前厅的文明而诞生，却以文明的兴衰、生命的折磨为食。祂是完美的衰败与新生，祂黏着在每一寸空气里，每一缕时光中，贯穿着现实，时时刻刻在折磨着人类。
//
//换句话说，祂是神。
//
//“天道”在不知多麽漫长的时光里，用亵渎而繁茂的触肢操控著前厅一代代文明的雄起与雕零。祂是无知的命运，贪婪地吸吮著一代代文明的火种，用以填补自己扭曲而破碎的臃躯。悠远的岁月是祂的双筷，漫长的时光是祂的汤勺，“天道”饱食著历史，愚弄著未来。祂从混沌的世界中蔓生出一个个文明，又将它们碾作尘埃。祂在沸腾的黑暗里用时间这最残酷的显微镜冷眼旁观著无尽的死亡与重生。
//
//直到我们的到来。
//
//我不知道，是什麽让远古时期盲目崇拜著神明的祖先意识到了有这样一个存在操控著无尽的轮回，但我知道，在那之后我们做了些什麽——我们空前地团结在了一起。
//
//我们诳骗了神。
//
//“天道”是一道光泽，是一声啼鸣，是可怕的完美，是贪婪之物，更是于文明上生长的愚钝之物。虽然人类生来就不完美，但好在我们是善于欺骗的动物，我们用恶意的谎言伤害敌人，我们用善意的谎言构建情谊，我们用有欺骗性的气味、衣物伪装自己，我们的文明建立在无数的真话与谎言之上。既然我们所谓的“神”是在文明上蔓延增生，那么祂就是可以被欺骗的。
//
//我们是诳天者（Cheater）。
//
//“天道”在那片庞大的乱流里聆听着我们文明欺骗性的低语，我们假意的祈祷换来了喘息的时机，并最终找到了将它击败的武器——欺骗带来的悖论。我搜集到的古籍上没有提到那一场战争的场景如何，只有一个冰冷冷的数字，在死寂中凿进石碑里，既所谓“民之十不存一”。
//
//最终，我们付出了巨大的代价，但也撕碎了神。为了防止它卷土重来，我们修筑了数个机器，将它们分开保存，驱逐到了一个遥远的地方，一方奇怪的异空间——也就是这里。
//
//“天道”在这里崩裂开来，无数的碎片如雪花般洒落在后室里，在时空异常的环境下茁壮地滋长、与其它分裂的层级一起，构成了一片崭新的的层群。它由我们的诳骗（Cheat）而来，由诳天者（Cheater）创造，所以后世的我们将其命名为：
//
//“C层群”
//
//这片受诅咒的层群因欺骗而生，故也埋下了欺骗的种子。在“天道”浓重而完美的恶意里，部分层级随著时间的推移进化出了具有欺骗性的外壳。它们看似安全宜居、光鲜亮丽，吸引着成群的人类进入其中。这些可怜人经受这片地狱的折磨，狂热地奔向梦想中的天堂，却在那里被神的螯肢撕为碎片。C层群的层级同样擅长欺骗。
//
//但“天道”没有就此消散。祂就像后室一样：庞大、诡谲、破碎、伸缩，收束。祂在无底的深渊中凝聚、嘶吼、狂暴地挣扎，祂的每次颤栗都能让前厅的代代王朝更替在文明上掀起层层波涛，祂的每一次呼吸都是一场人类遭遇的天灾。诳天者们逐渐被遗忘，没有人再维护远古的的机器，没有人还记得共筑的封印。但神的阴影，却从未离去，始终徘徊在人类的头顶。
//
//作为文明结晶的封印机器一个个停止运转，古老的文明一个个毁灭，更替的时代将那些保护人类的英雄忘却。而我们祖先铸造的古鼎，也在漫长的时光中发生了故障。
//
//这也是为什麽，当今的我们，外有外敌虎视眈眈，内有乱政军阀混战；遍野颓垣废址，河山伏尸千里。
//
//面对这一切，我们每一个人都有不可推却的责任。我知道，我必须重启我们的古鼎。
//
//而做法，也是诳骗。这像是一场神秘而宏大的悲剧。我们创造历史的唯一方式，就是欺骗未来。
//
//当我直面“天道”时，我第一次意识到人类的渺小。祂那庞大的概念，从我身体里的每一个毛孔迸发而出，将四周的一切化为飞灰。单单是存在就足以将我化为乌有。但我想去做这件事，也必须去做。没有一个人能够在这场全民族的危机，全人类的危机中置身事外。
//
//我佯装着狂热，混乱地赞美并执行祂对秩序的蚕食，将祂奉为所谓的主人，立誓开启一片崭新的乱世。而“天道”则赐“福”于我，让我能够成为这世界中的一方碎片，我的存在亦不至于在翻腾的恶意中永久消散。
//
//我在概念中钻了一个空子。我创造的乱世不会有有文明的毁灭，只会有伟大的复兴。“天道”或许没有猜到我想要做什麽，但是估计很快就会知道的——当那漫天的灰烬重新将它卷走之时。
//
//两小时前，我已经偷偷重启了这件古鼎。无尽的希望，从鼎中喷薄而出，如初升的朝阳般，骤然四射，狂暴地切割著黑夜的壁幕，在无边的黑暗中凿出一个个刺目的孔洞，浇灌著这片无垠而又古老的土地。阀门已经打开，我能感觉到那冥冥之中的概念正被一团暴怒的混沌疯狂地搅动、挣扎、嘶吼，破坏著因果，试图让我的存在分崩离析，就像尘埃在一阵飓风中那样。这里的时间概念已经被扭曲了，我或许会在这儿待上几百年再崩溃而死，又或者我会在化为飞灰后还活着，但都不重要了。
//
//“星火”将永远地彻底融入古鼎中。当我沉寂地坍作飞灰，在历史的深洋中永眠后，无数的“星火”们将苏醒过来，顺著希望的赤潮，掀起一番翻天覆地的燎原之势。那将是一场最美妙的盛景，千千万万名仁人志士怀揣著最伟大的理想，在那旧时代的废墟上建立起崭新的，属于这方水土的辉煌。
//
//我坚信，我们的祖先们之所以能够战胜神，能够战胜那所谓不所不能的“天道”，不是因为他们的科技有多先进，不是因为他们的身体有多强壮，也不是因为他们的智慧远超现在。
//
//那是一种强大，一种属于我们自己的强大。
//
//我们有人贪图财利，但绝不以同胞换取利益。
//
//我们有人懦弱怕死，但绝不向族人调转枪口。
//
//我们的不法组织可以金盆洗手，我们的军阀外藩可以一致对外。
//
//我们可以抛头颅洒热血，我们可以被抽筋扒皮，我们可以被烙烫水淹，我们可以被迫害，可以被残杀。
//
//但我们不会被打败。
//
//数千年的悠远历史，终究是由那些黎民百姓去书写的。
//
//大火必会因我们而旺盛，文明必定为因我们而矗立。而这燎原的星星之火，便由我，在这灰烬的坟茔里点燃吧。
//
//我们的后人终将觉醒。我并不是单一一个人。
//
//此次，人胜了天。
//
//而后，人定胜天。
//
//1921年7月21日
//
//“星火”手书
//
//作者信息
//« Level C-1报告集 | Des, Perado与Drday的报告 | Level C-2 »
//
//Footnotes
//1. 红色字体为本版本在描述上与上一版本的不同处。其下亦如此。
//
//
//Chuckler的报告II
//Level C-1 » Chuckler的报告II
//评分: 
//+62
//+
//–
//X
// 
//
//层级属性：
// 
//无害波动
// 
//photo-1453498798285-d5a1be7fab6e?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1yZWxhdGVkfDE3fHx8ZW58MHx8fHw%3D&auto=format&fit=crop&w=500&q=80
//一张生活区建筑的图片。
//
//Level C-1是后室C层群的第1层。本文所述地点乃其叠加层之一。
//
//+ 点击展开旧版描述
//描述：
//Level C-1的核心区域是一座中型城市，并仍在随着时间推移而变得愈加广阔。该城市被命名为“东舟”，当前面积经粗略测量大约为510平方千米，但其常驻人口数量被本地主导组织严格控制在12000人左右。
//
//东舟市能够划为生活区、工业区、办公区、生态区等区域。尽管这些建筑并非人为建造（详见下文），但Level C-1内的流浪者们依旧根据它们那清晰可辨的建筑类型进行了合理的统筹规划，循序渐进地将东舟市一步步地改造为如今的模样。
//
//如上所述，东舟市的建筑物不由人类搭建，而是匪夷所思地直接自地底钻探而出。Level C-1原本并无房屋，而是一片广袤无垠的原野：直至20██年█月█日，切入此间的流浪者们惊异地发现了矗立在平原上的大楼，仅有寥寥数栋。在之后的岁月里，人类持续目击着新的楼房在土壤之下拔地而起的奇观，并将其命名为“扩城现象”。
//
//扩城现象的发生周期不定，但在古早时期极为频繁，时常就有全新的建筑显现；城市初具规模之后，扩城现象发生的频率显而易见地大大减缓，经常数月不见动静。在单次扩城现象中，会有至少一座随机类型的楼房在已有建筑群的最外一层出现，具体方式即为绿芽破土般的生长。绝大多数的新生建筑都呈现着毛坯房的外观，除去水泥/砖块构件之外一无所有。不过，却也有相对较少的建筑拥有最基本的装潢，甚至有极少数的电器。虽然在扩城现象中出现的房屋在类型与外观方面上看起来似乎会缺乏规律性分布，但事实上，各大城市功能分区都保持了基本的合理布局，仅有几座与四周格格不入的突兀建筑。
//
//除去上述内容，扩城现象还有一些很出奇的特征：纵然这些建筑是从土地内部生长出来的，它们的内部却总是一尘不染，而即便是那沾染着泥土的外部，也会在建筑崛起的过程中将其尽数抖落，最终达到几乎光洁如新的程度。此外，在扩城现象的间隙时段内开展的掘地实验一无所获：起码以当前的认知而言，这些建筑的确可被视为是在大地之中凭空出现的。
//
//经过一段相当之长的改造运动，逐步扩张的建筑群得以成为如今的东舟市。截至目前，东舟市被M.E.G.（探险者总署）、后室机器人科技、E.P.B.（正电子粒子科技有限公司）共计三大团体联合占据，以期在该层级建立一座具有战略优势的大型聚居地，同时贡献各自的人才资源、发挥自身的学识优势、交流彼此的最新进展，从而为自己乃至所有合作派系打造一处立志走在后室最前端的科研势力。除内部机密、重要情报或是其他不可公开资料以外，所有研究结果都将被运用至流浪者的探索与生存领域，以此谋求人类在后室中的生活能够更加顺畅与安宁。
//
//东舟市外则是平平无奇的山川、江河等环境。没有需要特别关注的层级特征。
//
//据称，Level C-1内原本有着诸多违背常规认知的自然事物，但它们现已销声匿迹。包括原本出没于Level C-1多地的特殊实体，也发生了极大的转变，且几乎失去了进一步了解与利用的价值。更多信息可见附录。
//
//基地、前哨和社区：
//三合研究院
//由M.E.G.、后室机器人科技、E.P.B.联合创建的一所大型研究院，正在经手众多重要项目。
//位于东舟市中央地带。
//科研人群甄选自三方团体。
//M.E.G. - C层群Lambda基地
//这是M.E.G.在C层群建立的第十一个主要基地。
//极其重视安保与保密措施，内部区域拒绝所有外界访问；外部区域则设有大量岗哨2。
//似乎是M.E.G.高层人员的常用议事场所。
//位于东舟市东方地带。
//后室机器人科技 - 撒加利工厂（The Zachary Factory）
//主权归后室机器人科技所有的数家工厂之中最为庞大的一座。
//占地面积约7.4平方公里，改造自一座由记录在案的第19次扩城现象中于西部位置独自出现的巨型单体建筑。
//承包东舟市的海量生产工作。
//位于东舟市西方地带。
//不愿透露处理污染物/生产垃圾的手段。
//E.P.B.™ - 珀尔修斯实验室
//由E.P.B.特意组建的一家实验室，致力于多领域的研究工作，以及研发特殊产品。
//经E.P.B.高层指示，并未设立在三合研究院内部。位于东舟市北方地带，邻近一处环境优美的生态区。
//更多信息仅向γ/Gamma级权限持有者开放。
//“新纪花园”
//位于东舟市南方地带，是市内最大的生活区之一。
//红星建筑队第二十一~二十三支队
//受三大团体所托而入驻的三支红星建筑队分队。持续负责与协助新建筑的清理与装修、旧建筑的升级与改造。
//02区、03区
//东舟市的两大军事基地，内有以M.E.G.为主、另两方团体为辅的重要军事力量。02区面积较大。更多信息不予公开。
//附录：
//正如已归档版本记载的内容所述，Level C-1中原本含有多种特殊实体。但奇怪的是，它们要么不知所踪，要么不再拥有以往的特性或是能力。在经过历史文件的比对工作之后，可以确信该迹象的显现时段与第一次受人目击的扩城现象相当接近。
//
//然而，在仍然可以遭遇的剩余实体中，依然不乏能够对外界造成扰动的特殊个体。因此，M.E.G.武装部受命追踪与抓捕Level C-1的一切现存实体，并将其纳入位于03区的艾亚哥斯收容管理局（ACMA）进行监禁工作。为保留研究价值，若非目标进入不可控状态或是即将造成严重破坏，不得进入歼灭程序。
//
//需要注意，即便是在ACMA已经成功收容了绝大多数实体许久之后的今天，实体们也依旧在发生着显著的变化，而且表现出了一些耐人寻味的细节。预知更多关乎该种变化的详细情况，可见下方由E.P.B.人员时驹整理并提交的交互记录节选3。
//
//□ 关闭交互记录E-024.[α]
//日期：20██/██/██
//
//交互人员：时驹（珀尔修斯实验室成员）
//
//交互对象：ACMA-E-024
//
//对象简述4：ACMA-E-024体长约0.9m，重约29kg，总体外观类似于一只体态臃肿的绵羊。其体表覆盖灰白色绒毛。前肢非蹄类，而是肉足，形状与人手类似。无目。
//安保人员：Sampson Adams（M.E.G.兵团士兵，兼ACMA安保部门成员）
//
//前言：本系列由珀尔修斯实验室人员组织开展的实体交互活动已得到C层群Lambda基地（ACMA直系上属）的正式授权。其目的是进一步了解Level C-1的现存实体，以及尝试解明它们发生变化的原因。下列对话翻译自英文。
//
//[记录开始]
//
//微弱的婴啼声。翻动声。
//
//Adams：……所以现在来找024不是什么明智之选——你开始录了？
//
//时驹：对。刚开始。
//
//Adams：哦，好。（*清嗓）咳咳。
//
//时驹：倒也不用太严肃，我们随意就好。
//
//Adams：这样么？那行。
//
//时驹：你刚刚说到哪里了？
//
//Adams：嗯……你早点过来找它的话，或许还能直接从它那儿问到些什么。现在做不到了。
//
//时驹：为什么这么说？
//
//Adams：024前天还能说话和走动，可从昨天开始就别说走路，连清晰的单词都吐不出来。它一直像摊烂泥似的趴在那个角落，半死不活地搅动和吞咽我们扔给它的垃圾。
//
//婴啼声越发响亮。
//
//Adams：等等，我补充一下。是还可以发出像婴儿一样的声音。
//
//时驹：为什么要给它吃垃圾？
//
//Adams：物尽其用罢了。
//
//时驹：我没明白。
//
//Adams：在ACMA逮住024的第一天，它根本没有这么小。听行动组那边的兄弟描述说，它当时是一头足有20米长的巨兽，身上的毛发都盖不住肌肉块的完美线条。虽然不知道他们有没有夸大其词的成分，毕竟这样可以把自己的战果吹大点。
//
//时驹：（*笑）听起来，你不是很信啊。
//
//Adams：还好。因为我是一天天看着024退化下去的。我在收容间里初次看见它的那一天，它的确是一只巨兽，目测有个10米。
//
//时驹：啧啧，你们M.E.G.居然已经可以降服这种程度的实体了？
//
//Adams：这话的意味不太对。第一，后室交通不便依然是人类的硬伤，这直接导致我们的配置相当割裂、参差不齐。有些层级的M.E.G.基地怕是把所有人都打光了也只是给敌人加菜。第二，024和这里的很多实体一样：非常羸弱，根本没有威胁。即使是换你们这群在实验室里动脑子的人上，大概也能轻松搞定。
//
//时驹：嗯……在我来前，我浏览了Level C-1文件的历史版本。我指还没删掉实体资料的那一版。在文字里，它给我的感觉像是妖魔鬼怪的乐园，而意外闯进的我们只能任人鱼肉。
//
//Adams：或许曾经是吧。搞清楚是什么导致了它如今的变化，不就是你今天来这里的目的么？
//
//时驹：你说得没错。那么……你刚刚提到的“退化”，可否具体说说？
//
//Adams：这是我想到的最贴切的用词。024被送进ACMA时，它尽管气若游丝，但是体态确是相当的孔武有力，头顶还有两只粗壮的巨角。随着时间的推移，它不仅一圈圈地变小，连角都不见了。有意思的是，我们没有看到角是怎么缩回去的，只不过隔了一晚，那个部位就突兀地消失了呢。
//
//沉闷的低音。声源似乎在咀嚼。
//
//时驹：你还没告诉我ACMA为什么要喂它吃垃圾。
//
//Adams：呃，这件事倒不是局里的意思，它属于项目组个人行为。
//
//时驹：嗯？
//
//Adams：024的进食欲望一直很强。行动组说，他们发现它时，它正在啃食身下的大地，而且已经吃出了一个巨坑，但是已经虚弱地不是很能继续咬动。在把它纳入收容以后，它吃掉了我们试探着扔进去的所有东西。所有。在因故断粮的某天，无物可吃的它咬掉了自己的后肢。
//
//时驹：……
//
//Adams：之后就再生出来了。
//
//时驹：然后呢？
//
//Adams：然后我们发现它几乎来者不拒——不，就是来者不拒。紧接着就有人打趣说我们可以把它当垃圾桶。就这样。
//
//时驹：这……
//
//Adams：可惜的是，它的胃口好像也在随着“退化”而一起消失。它能清掉的垃圾一天比一天少。不过，这依然比我们特地跑到外面去扔垃圾要省时省力。哦对，要知道，它甚至不会排泄！一点环境问题都不会有，呵呵。
//
//时驹：实话说，这和我想象中的ACMA作风有些出入啊。我以为你们不会这么轻佻地对待一个被列作研究项目的实体。
//
//Adams：先生，我也实话告诉你，ACMA一直不受待见。因为很多人觉得我们是在浪费时间还有资源。你先前是否来过Level C-1？
//
//时驹：去过别的。我刚被调到珀尔修斯实验室不久。
//
//Adams：那就不奇怪了。在东舟市，这些实体的颓势已经是显而易见的公开事实。它们在一天天地随着城市的扩张而越来越脆弱，越来越无力。即使没有ACMA去把它们收容在此，它们也几乎无法再对我们造成一丝一毫的威胁。在这种情形下，所谓的“艾亚哥斯收容管理局”只是一个又臭又长的累赘，只是一只混吃等死的败犬。局长向来不甚关心局内事务，项目组当然乐得自在。
//
//时驹：抱歉。
//
//Adams：不用道歉，我只是在陈述事实。
//
//时驹：可是，ACMA不是还有另一个重要职责是，要负责找出实体变化的原因吗？以及……找到如何利用它们的途径？
//
//Adams：要是我们能找到原因，估计上面就不用批准你们的交互申请了。曾经的它们就那样随着时间的流逝而流逝了而已，我们只是看着，想做点什么却又无能为力。至于利用的途径？当垃圾桶不算吗？
//
//对方丢出某物的声音。空罐头落地音。略显惊吓的婴孩音。
//
//时驹：唔。好的。谢谢你告诉我这些。
//
//Adams：不用客气。另外，要是你们真的想找到变化原因的话，那得抓紧。
//
//时驹：为什么？
//
//Adams：它们不会一直等着我们，因为“退化”的终点是消失。它隔壁的025号已经在一个安静的夜晚凭空消失了——对，凭空。025不是第一个，也不会是最后一个。
//
//时驹：嘶……真邪门。
//
//Adams：等到所有实体都消失的那天，ACMA也得被解散重组了吧？不知道我有没有机会被调到02区甚至是01区去呢……哈哈。
//
//时驹：*沉思
//
//Adams：对了，说是和024交互，怎么变得在和我交互一样？
//
//时驹：（*愣住）欸，好像是这么回事……
//
//笑声。
//
//时驹：哈哈哈，这也自然，毕竟它不会说……嗯？……等一下，你在刚开始时，是不是说过一句话？
//
//Adams：哪句？
//
//时驹：大体是说我要是早点过来，就能直接问它话。它——它以前会说话？
//
//Adams：啊！你提醒我了。对，是的，是这样。
//
//时驹：它都说什么了？
//
//Adams：我不是很能听懂，它说的中文。我中文不好。
//
//时驹：中文……
//
//Adams：但是你可以去档案室问问，那里想必是存有一些类似于对话记录的东西。
//
//时驹：好的，我知道了。谢谢你。
//
//Adams：（*嘀咕）不过我依稀记得它好像自称什么什么“贴5”……
//
//[记录结束]
//
//
// 
//□ 关闭交互记录E-013.[α]
//日期：20██/██/██
//
//交互人员：时驹（珀尔修斯实验室成员）
//
//交互对象：ACMA-E-013
//
//对象简述：ACMA-E-013为一雄性人形实体，相貌与人类少年一致。其身高约1.5m，体重则因其不配合工作而未能顺利测得。ACMA-E-013发色赤红，上身赤裸，肤色深棕而略有绒毛，腰围一袭样式奇特的白色短袍。
//安保人员： 平井蒼生
//ひらいあおい
// （ACMA安保部门成员）
//
//前言：由于ACMA-E-013性情乖张，故为保交互过程顺利进行，时驹刻意顺应着对方的谈话风格。
//
//[记录开始]
//
//环境嘈杂。
//
//ACMA-E-013：——领略到吾之伟力了么？凡人？
//
//平井蒼生：时先生！你没伤着吧？
//
//时驹：没有没有，笔坏了而已6……还好我有备用的。
//
//平井蒼生：013，你忘记安保条例了吗？
//
//ACMA-E-013：哈？明明是他请求本尊展露神威在先！吾不过是满足一下他的小小心愿而已，这有何不可？此外，你怎又用那鸟语替代吾之尊名？
//
//平井蒼生：这是规定。况且，你真的有名字吗？我尝试过配合你了。
//
//ACMA-E-013：放肆！吾——
//
//时驹：好了好了，都冷静点……
//
//平井蒼生：你们继续吧。记住，不准伤人。
//
//ACMA-E-013：无需多虑，吾自有分寸。
//
//时驹：那么，在下已经见识到您的……呃，无上神威了。当真是令我大开眼界。
//
//ACMA-E-013：（*满意的哼哼）嗯。
//
//时驹：（*卡顿，生硬）那么，在，一位如此的大能面前，我实在感觉……诚惶诚恐，但，在这惶恐之中却又萌生出浓烈的好奇——在下斗胆，想要知道您的更多。不知您是否可以消除在下的疑惑？
//
//ACMA-E-013：（*骄傲地微仰起头）凡人，求知不是坏事，吾也不是恶人，你大可放松一些。
//
//时驹：（*心虚）咳。
//
//ACMA-E-013：你好奇的是什么？问吧。
//
//时驹：首先，嗯……您贵庚？
//
//ACMA-E-013：何等愚问！吾自是与天地同岁。
//
//时驹：是吗？可是您看起来……
//
//ACMA-E-013：（*嗤笑）着相之人。
//
//时驹：抱歉，恕我愚钝。
//
//ACMA-E-013：无妨。吾不能对一个凡夫奢望太多。
//
//时驹：那么，除了你方才向我描述、而且已经向我证明的“操纵火焰” ，您还有其他神通吗？
//
//ACMA-E-013：唔……吾很乐意向你展示，但是这狭窄的囚室实在让吾舒展不开。但是，对火焰的主宰确是本尊最得心应手的本领。若你想要，吾可以再……
//
//时驹：感谢您的慷慨，但是不用了。不过，既然谈到了这“囚室”，那么您可以告诉我您为何甘于屈居此地吗？
//
//平井蒼生未忍住笑。
//
//平井蒼生：对不起，打扰一下……哈哈哈……虽然我不能完全听懂你们的用词，但也大概可听明白。时先生，注意不要提尖锐的问题。
//
//时驹：喔，好的。
//
//ACMA-E-013：这个……是吾失言。此地或许确是囚室，但这里同样是一间崭新的宫阙。床榻、侍从等物样样不缺，和广厦相比又有何区别？
//
//平井蒼生：“侍从”？
//
//时驹：是吗？您真的这样想吗？
//
//ACMA-E-013：当然！你在质疑吾？
//
//时驹：不敢。
//
//ACMA-E-013：谅你也不敢。
//
//时驹：继续我们方才的话题吧。嗯……您在这里过得如何？饮食起居可还顺心？
//
//ACMA-E-013：饮食？那是你们的低等形式。吾等完全不需要从五谷杂粮里汲取那维持生命运转的能量。仅仅是天地所蕴的自然之精华，还有你们对吾等的尊敬与畏惧，就足够让吾等的生命延续万代春秋。
//
//时驹：尊敬与畏惧……
//
//ACMA-E-013：怎么了？
//
//时驹：没什么。啊，我刚刚想到，您如今的状态应该比过去要……呃，咳。您的过去应该比现在要强大的多？
//
//ACMA-E-013：（*沉默片刻）你很敏锐。但是，你是怎么知道的？
//
//时驹：共性而已，您大概清楚您不是我拜访的第一位。我在来前已经见过另外数名和您一样的存在，而它们无一例外地在一天比一天虚弱，一天比一天矮小。所以您——
//
//ACMA-E-013：（*打断）暂时的涨落罢了！吾迟早会重回力量的山巅！
//
//时驹：啊好，好的。我期待看到那天。
//
//ACMA-E-013：我会让你如愿以偿。而在那时，吾大抵就有力量重塑坐骑了。届时，我定当重回天际，让普天之下的林野众生和你一齐再次见证火神的威仪——
//
//平井蒼生：013，你坐下说。别踩椅子。
//
//ACMA-E-013：住口！你怎敢打断吾的？！另外，不准再把吾称呼为那个莫名其妙的数字！
//
//时驹：等等！您有“坐骑”？敢问可是两条赤龙？
//
//ACMA-E-013：（*惊讶）你何以得知？
//
//平井蒼生：013！快坐下！
//
//ACMA-E-013：够了！唤吾祝融！
//
//平井蒼生：你前天还对我说你的名字是カグツチ7！
//
//[记录结束]
//
//备注：交互完毕之后，平井蒼生向时驹提供了一些补充性信息。总结如下。
//
//第一，ACMA-E-013的外观、服饰、乃至性别等都在发生迥然不同的转变8，但总体趋势始终在朝低龄变化。而在此过程中，ACMA-E-013对自己的认知（例如姓名甚至是记忆）也在发生相应的变动；第二，ACMA-E-013的能力的确也在如ACMA其他的收容对象那样持续性退化，而它一直很为此事感到恼火和无力，因此尤为反感相关话题，并一直努力掩饰自己的悲伤；第三，截至今日，焚毁时驹的录音笔已是它能展现出的能力极限。
//
//
// 
//□ 关闭交互记录E-002.[α]
//日期：20██/██/██
//
//交互人员：时驹（珀尔修斯实验室成员）
//
//交互对象：ACMA-E-002
//
//对象简述：未知。
//安保人员：N/A
//
//前言：此次交互的情况特殊。
//
//由C层群Lambda基地授权进行的实体交互活动已于本记录所述时间点的数周之前结束；然而，时驹却在和珀尔修斯实验室的某位同事一同前往东舟市外进行野外考察时意外遭遇自称为“ACMA-E-002”的未知实体。该实体浑身匿于一处山洞内部，以洪亮而沉闷的人声直接请求时驹将同事支开。
//
//奇怪的是，该同事完全没有听见ACMA-E-002的声响。同时，还有相当一部分实验室人员只在录音笔中听见了时驹的自言自语。
//
//[记录开始]
//
//时驹：在录制了。我们重新开始吧。
//
//ACMA-E-002：好。
//
//时驹：那么……你刚刚是说，你就是ACMA-E-002？
//
//ACMA-E-002：嗯。
//
//时驹：奇怪。暂且不说你为什么会在这个洞里而不是在管理局那边，光是我先前去访问他们时，ACMA的档案员就告诉我说002号——
//
//ACMA-E-002：“不存在”。
//
//时驹：对，是这样的。
//
//ACMA-E-002：对有的人而言，我确实不存在。
//
//时驹：这话是什么意思？另外，你为什么要叫我把同伴支开？
//
//ACMA-E-002：巧啊，这是同一件事。你的那位同伴并不能感知到我——你也不想被突然被他当作对着空气自说自话的痴人，对吧？
//
//时驹：……我听懂了。但是，怎么会这样？
//
//ACMA-E-002：不用太迷惑。你已经去过ACMA、再退一步说你都已然身处后室这种地方——亲眼见证过的奇物奇事并不在少数。
//
//时驹：但我起码已经对ACMA的实体们有了自己的猜想和认识……而你不一样。你的存在形式过于诡异，竟然能对特定的某类人群完全隐去自身？
//
//ACMA-E-002：不是隐去。对那些人而言，我的确不存在。
//
//时驹：无意冒犯，但你能把话说明白点吗？
//
//ACMA-E-002：我会解释的。不过，让我有点好奇的是，你居然真的把同伴支开了？你就不担心我会是什么危险对象？
//
//时驹：（*沉默片刻）你问倒我了。我，我说不出那种悸动，但我真的感觉你很亲切。我甚至能感觉到一种跃动在血脉里的共鸣……我知道这个描述很玄乎，但是这真……
//
//吟笑声。
//
//ACMA-E-002：哈哈哈……说的挺好，年轻人。
//
//时驹：别说这个了。回答我的问题。
//
//ACMA-E-002：生命太长，记忆太短。我已经淡忘了很多细节，我其实很难把自己脑海中的记忆点彼此串联……我不知道从哪开始。
//
//时驹：那我帮你串。从“你是谁”开始吧。
//
//ACMA-E-002：你们给我取过很多名字。而最近的一个就是“ACMA-E-002”。如果只是为了方便称呼的话，称我002就够了。
//
//时驹：你没有自己的名字？
//
//ACMA-E-002：名字有什么意义？人为的定义罢了。甚至就连我的一整个生命，也是被你们定义出来的。
//
//啊……002这个编号事实上在留空。ACMA的行动组对我是否存在吵的不可开交——有一些人声称看见了我听见了我，而另一些人只看到他们在对着空空荡荡的天地惊呼。在前者的坚持下，002被录入档案，但是没有任何相关程序得到实施。
//
//时驹：（*焦躁）我明白为什么会有002了，但是我仍然不明白你对自己的描述。你长什么样子？你可不可以走出来让我看个清楚？
//
//ACMA-E-002：我很愿意，但是我办不到。我现在很疲倦，光是在单独一名笃信之人的维持下保持存在就已经精疲力尽。我的鳞片已经数载没有再被云海轻抚……
//
//时驹：“笃信之人”？谁？
//
//ACMA-E-002：你。
//
//时驹：我？
//
//ACMA-E-002：你刚刚说，你已经对身处ACMA的实体们有了猜想与认识。说说看？
//
//时驹：……
//
//沉默良久。
//
//时驹：自从我坠入后室，求生就一直是我发上的梁，股后的锥。尽管对生存的迫切需求几乎霸占了我全部的思绪和精力，但我始终把自己心中最核心最重要的角落留给了我最珍视的个性：好奇与求知。
//
//尽管陪着我闯完Level 0、Level 1乃至数十个早期层级的那群伙伴全都认为后室是一个毫无规律可言的地狱，但我依然坚信我可以找到它最底层的逻辑，解明这个貌似无解的谜题。这也是我为何选择加入了后来的E.P.B.，因为我和他们志同道合，因为我相信我可以在这儿见微知著。
//
//ACMA-E-002：然后？
//
//时驹：随着人类在后室扎下的根越来越深，随着我们这些人也可以渐渐不用过度去操心下一顿饭，我们终于有了余力来仔细审视后室本身。数种理论得以提出，数个模型得以搭建，我们百般求索着何生后室、何为后室。
//
//ACMA-E-002：那，求索到了吗？
//
//时驹：E.P.B.提出过一种叫做“衍射光栅”的理论，虽然它还处于假说以及已经停滞的状态，但是它依然促进了我个人对后室成因的具象化认知：前厅的确就像是一条入射光，在通过或是撞击到了某种光栅一般的存在后，原本构成前厅的“分子”也好、“要素”也好，它们全都被衍射或被冲撞的七零八落，破碎万千，然后就在那“光栅”的另一端、那超出前厅边界的超脱空间，随机排列组合为一个个量子态的层级，构成后室这个庞杂的混沌系统。
//
//层级可以简单理解为一个个的小世界，但这些小世界几乎都缺乏一个“因”，一个“起点”，一个“合乎情理的历史”。举个最简单的例子：一个发展经历与前厅明明迥然不同的后室层级，为什么会有前厅的造物？为什么会用前厅的语言？为什么什么都是前厅的千种倒影？
//
//这不合理。所以，后室的源头必定与前厅息息相关，这毋庸置疑。而衍射光栅理论所构建出的“折射”模型，正是我所认为的，最逼近后室真相的蓝图。
//
//ACMA-E-002：这些与你对此处的实体有何猜想与认识是什么关系？
//
//时驹：我就要讲到了。……024在对话记录中自称“饕餮”，013更是自诩火神，ACMA囚禁住的每一个实体几乎都能追溯到一只洪荒异兽或是传说人士。即便是那些没有言语能力的，我也能够凭我贫乏的储备在神话之中找到部分原型。
//
//所以……这个层级的本质其实就是生存着一群神话物种的远古大荒？可是，后室为什么会有这种地方？为什么这些怪物或是神明直接对应了前厅传说？早在听闻M.E.G.发现所谓“员峤”时，我就开始有种隐隐的愕然与不安；如今我们发现了这里，这个Level C-1的新叠加层，它又一次把前厅的影子笼罩在我们身上：后室绝对是被前厅以某种方式“折射”出来的！
//
//但，它们为什么会日渐虚弱？为什么会有房子直接从地里长出来？这些无缘无故的迹象到底有什么联——
//
//ACMA-E-002：（*打断）够了！……另外，你不用如此激动。
//
//时驹：——呼，抱歉。讲到这些我就容易激动。我只是……不喜欢未知，不喜欢世界把我蒙在鼓里。对我这样的一个科研人员来说，找不到逻辑和真相的感觉真的很令人沮丧。
//
//ACMA-E-002：我明白的。年轻人，你努力探寻真相的欲念值得认可，但你仍然犯了错。
//
//时驹：什么错？
//
//ACMA-E-002：你在尝试用科学的目光解读这里。
//
//时驹：什么？我……我不明白。这怎么是错？
//
//ACMA-E-002：你是真的认为即便身处后室，依旧还有科学可言？
//
//时驹：当然。万事万物皆有科学的内在，这不是常识吗？假以时日，我们定然能够解明此地的一切。
//
//巨大的叹息声。
//
//ACMA-E-002：唉……
//
//时驹：怎么了？
//
//ACMA-E-002：我们都以为后室会是我们理想的新家，会有充足的信仰维系我们的存在。但现在来看，我们似乎依旧逃不过烟消云散的命运。
//
//时驹：你们？你指和谁？……还有，“信仰”？……“新家”？
//
//ACMA-E-002：当然是指我与那群仍在被ACMA拘禁的同胞。指我们这群时刻都在被科学的手术刀反复解剖的实验对象。
//
//时驹：……
//
//ACMA-E-002：当人类还在茹毛饮血，刀耕火种的时候，即使是如今最稀松平常的雷霆雨露都会被你们当作天怒或是天恩。时代所限的他们无法理解为什么缥缈的天空会落下清水，为什么云层可以吞吐雷电；无法理解为什么坚固的大地也会震荡，为什么偏远的海水也能淹过平原；也曾遥想天的尽头有些什么，也曾遥想人在死后会去何方……他们都没能弄懂，都活在漫无边际的未知里。但他们给了自己解释，给了这些未解之谜一个浪漫的想象：那是因为神鬼莫测，那是因为万物有灵。
//
//在你们对自然万物奇幻而瑰丽的想象里，我们由此诞生。此种存在取决于你们，即使是同一件事，也会让我们催生出在你们身前的多种呈现：单是对烈火的恐惧、尊敬、或是掌控欲等多种请感，再加上地区性的隔离，就足以在你们的文明中传颂出火神千面。
//
//那是我们在前厅的黄金岁月，是我们再也回不去的梦。
//
//时驹：嘶……
//
//ACMA-E-002：随着时光飞逝、白驹过隙，你们变了。一切都变了。
//
//人类不再愚昧，不再相信天上有宫阙，海底有龙宫。你们的座驾一天比一天坚硬，巢穴一天比一天高耸。你们渐渐明白了世界运转的原理，甚至可以弄懂天不圆地不方，稍微念过些书的孩童也能知道世界是一颗围着火球绕圈的沙砾——宇宙尺度而言。
//
//有些东西一去不复返了，例如你们对自然的敬畏，例如你们对漫天神明的勾勒。
//
//时驹：可这不好吗？这是进步。
//
//ACMA-E-002：这很好，这当然是进步。但这剥夺了我们的立足之根，让我们日渐式微，逐渐随着神话和前人的逝去而渐渐虚弱。
//
//……信则有，不信则无。我们还能在前厅找到的信者怕是只剩那些尚未开蒙的孩童——前厅不再宜居，我们不得不就此搬家，来到了这里。
//
//唉……结果，只是从一个监狱到了另一个监狱。
//
//时驹：你们……来自前厅？前厅当真有过神魔之物？
//
//ACMA-E-002：不清楚。前厅不止一个，我不知道其他维度的情况，更无从得知你是来自哪个前厅。
//
//时驹：（*错愕）什么……
//
//ACMA-E-002：我不为文明的进步感到恼火，我只为我们的归处感到悲伤。世界对你们来说不再充满未知的神秘，一切都成了可被科学定义的公式。年轻人，你老实告诉我，在你和现实与思绪的夹隙中，你是否还幻想过在你看不见的角落，依然生活着一群奇异的生物？依然发生着一些神奇的事件？
//
//沉默。
//
//时驹：儿时是。但我现在已经没有那样的精力了。还在前厅时，我就一直在为温饱奔走；如今来到后室，我更是直接堕入生存的战局。我有更重要的事要去做，要去为了自己能够继续生活而奋斗。我削尖了脑袋才挤进东舟市的珀尔修斯实验室，靠的可不是整天臆想这些子虚乌有的东西！
//
//ACMA-E-002：哈哈……除了一件，你说的都对。
//
//时驹：哪件？
//
//ACMA-E-002：不单儿时。你现在仍是。
//
//时驹：呃？
//
//ACMA-E-002：否则，你不可能听到我的声音。我说过了，这里有一名“笃信之人”。那是你。
//
//时驹：咳嗯……
//
//ACMA-E-002：我很欣慰。不仅是因为你这样的人可以协助我的存在，更是因为你在自己的心中留下了这样一个柔软的角落。年少不知愁滋味啊，而你必将随着年龄渐长而不得不潜入现实的汪洋。但你依然会在闲暇的时间里天马行空，遥想世界是不是还有不为人知的另一面。这听起来的确没什么用，但每每此时，你都已经暂时逃脱了现实的沉重引力，得以在另一方充满幻想的天地超然片刻。这样，也不错。
//
//时驹：……或许吧。
//
//ACMA-E-002：所以我并不反对你继续去尝试总结后室的本质，但我同时也不看好。后室似乎并无通用的逻辑可言，它一切的一切都像是冥冥之中由谁又刻意又随性安排的幻想法则一般，经不起追问……就像我们这群行将就木的神话造物，就像那座城市的扩张……就像这处没落的洪荒。
//
//时驹：你在偷换概念。我们，乃至整个后室，又不是由谁信笔写下的故事。
//
//ACMA-E-002：谁知道呢？
//
//时驹：好了，这些稀奇古怪的玩意就到此为止吧。我忘了问我一开始就该问的问题：你叫住我做什么？
//
//ACMA-E-002：和你聊聊，仅此而已……我很累，我已经太久没能从虚无的深渊之中脱身而出。没有你和其他信者的思绪让我成型，我将和逝去的奇幻一同不复存在。
//
//成长固然会不得不舍弃一些东西……这只是诸多悲哀中的一种罢了。
//
//时驹：……说起来，你到底是什么？虽然我好像已经猜到了，但难得有这样一个机会……我想亲眼看看。
//
//ACMA-E-002：（*含笑）免了。我担心你叶公好龙。
//
//[记录结束]
//
//备注：时驹遭遇ACMA-E-002的洞穴后于20██年█月█日被扩城现象中生成的新建筑撞塌。目前尚未有人二度遭遇ACMA-E-002。
//
//入口与出口：
//出入口信息不于此处公开。
//
//由于Level C-1的独特战略价值以及内含的众多重要资源，探险者总署、后室机器人科技、正电子粒子科技有限公司已联合封锁本层级的出入方式相关信息，以防敌对势力渗透。
//
//受命调往珀尔修斯实验室或是任意相关E.P.B.驻地的人员可向档案部申请获取出入口信息。
//
//photo-1485038101637-2d4833df1b35?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1228&q=80
//Level C-100的入口。图像由M.E.G.提供。
//
//特殊出口标注：
//在如图所示的木屋内独处5分钟即可切入Level C-100。注意，木屋内的所有物品也会一同切入。
//
//该木屋的具体信息隶属M.E.G.内部的破门项目。E.P.B.并不知晓更多情况。
//
//作者信息
//« Level C-1报告集 | Chuckler的报告II | Level C-2 »
//
//Footnotes
//1. 此处之所以与其他典型实体分开讨论，是因为该句提及的特殊实体都仅在Level C-1中存在目击记录，并自始至终仅发现一只个体。
//2. M.E.G.近期似乎有着一项让人颇为好奇的全新发现。他们已设立专门的探索岗哨进行深度探索。
//3. 欲读完整资料请向档案部提交存取申请。
//4. 由于身处ACMA监禁之中的实体们仍然在发生持续性变化，故此处的“对象简述”仅代表对象当日状态。
//5. Adams此处的发音为不太标准的“tie”。
//6. ACMA-E-013使用未知手段凭空毁坏了时驹的第一支录音笔。录音笔无端发生了一次微小的爆炸，内部烧焦。
//7. 即“迦具土”。日本神话中的火神。
//8. 该现象似乎与和ACMA-E-013展开对话的人员之背景息息相关。本规律有待验证。
//
//
//Chuckler的报告III
//Level C-1 » Chuckler的报告III
//评分: 
//+29
//+
//–
//X
// 
//
//生存难度：
//持续建设中
//包含重点项目
//未发现族外实体
//骧亭是后室C层群的首层之一。此地名由尊父赐封。
//
//photo-1422466654108-5e533f591881?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1171&q=80
//骧亭郊外。
//
//描述：
//尽管尊父在赐予“骧亭”二字时仅仅意指驻层基地与其周边地带，但该称呼已在事实上演变为对整个层级的日常称呼及正式命名。
//
//骧亭大部分由平原构成，并基本覆盖有齐尾的杂草。偶尔可见海拔并不甚高的山川、河道错综复杂的江流、树木稀疏的林地等其他常见自然环境。根据勘察翼兵的高空计算，平原地区大约占去了已涉足区域的74%。
//
//截至本文撰写，我族仍未在骧亭内发现任意实体。这是由于该层级本就不存在原生实体，抑或是由于所谓“龙巢效应”之影响1则不得而知。
//
//客观而言，骧亭在层级环境方面并不具备任何特点，甚至属于生存/工程/战略资源匮乏区。但由于它独特的成因（详见后文）以及关键的位置（即C层群首层），尊父仍然命令我族在此设立驻地，并广泛将其他诸层的族内物资调往骧亭，大力支持骧亭基地的建设与发展。
//
//photo-1553434320-e9f5757140b1?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1227&q=80
//龙裔住区的部分外观。
//
//鉴于骧亭对族外人士表现出排斥性2，所以该层级实际上与外界自动隔绝，成为了一座天然形成的堡垒、一处我族专属的世界。因此我族完全没有将精力花费于常规战备的部署，而是经长期努力之后专注地完成了初批龙裔的转移和定居，并最终完成了驻层基地的建设工程。此乃尊父期许的第一阶段。
//
//但由于C层群前列层级的出入法则略为刁钻之事实，所以导致骧亭事务被交通因素所碍，目前仍然处于并可能长期处于第二阶段：即，完成重要研究项目的转移或是全新重要项目的设置。
//
//当前已经设立完毕的项目仅有“阿尔法之眼”。更多信息需见附录。
//
//附录I - 历史
//尊父治下的龙亲们尚来就不甘居外物身下。尽管我族已用数次征伐直接证明我族能够不怵任何威胁，但所谓“后室意志”强加于我族的枷锁始终是尊父乃至全族上下的心头之恨：龙血族无法离开C层群。
//
//这条莫名其妙的法则极其荒唐，充斥着对我族的嘲讽与不公。前仆后继的离群尝试从未停息，但我们只是一次又一次地牺牲自己的血亲。在最为严重的一次损失中，初代3西格玛（Σ）殿下也因此永远离开了龙神的视野。
//
//爱子的永寂让尊父极为悲伤，但尊父并未因此放弃改写世界法则的信念。最终，约塔（Ι）殿下的出世成为了挣脱枷锁的重要转折点：正如尊父甄选的母体那般，约塔殿下天生持有凭空创造层级出/入口的能力。于是，约塔殿下在开蒙之后，便被兄长迅速携往Level C-1的叠加层之一，展开筹备已久的破层尝试。
//
//简要而言：贝塔（β）殿下的研究团队已经确信后室并非毫无规律可言的混沌空间，而是存在有一定程度的、能够加以总结与利用的时空规律；部分层级之间甚至存在着相当稳固的空间架构。而Level C-1的出入规律和其空间方位本身，都无不表明它定与I号层群、甚至与前厅关系甚密。
//
//约塔殿下被要求在上述地点的特定位置施展一次能力。根据预期，约塔殿下将因此破开一条通向层级间隙的通道，而后者极大概率就是族内所称的“沌海”。若一切顺利，此举或许能为我族挣脱C层群提供一种另辟蹊径的方式。
//
//然而，实验结果没能完全符合研究组的预期。约塔殿下的确强行发动能力，几近脱力才破开了一道通往层级间隙的空间裂口。但我族先锋在快速挺入后者时却亲眼目睹了一场波澜壮阔但匪夷所思的奇景：四周没有任何物质，而是一望无际的浮动蓝光。尽管没有可供参照的物体或是其他颜色，但蓝光却在视觉上呈现出扭曲与肿胀，并最终自我撕裂，泻出成群的狂乱色彩，然后迅速浮现出各种各样的物质，彼此碰撞组合，滋生成为天空与大地的模样。天地成型后，满地都开始萌生高速破土并发芽成熟的青草、远方能够望见数条拔地而起的山脉、甚至天边还突兀地滚来一卷圆筒状的白云，移动着铺洒开来，化作云海。整个过程耗时极短，不足三息。
//
//此事件的本质显而易见。经后续跟进，我族既惊且异地正式宣布：有一全新层级于我族前进的方向当场“生成”。
//
//而这意味着什么，目前尚无定论。
//
//附录II - 杂讯摘录
//上述那场由先锋队亲眼目击的层级异象尽显诡秘，与其相关的跟进与研究工作则已交由专业派系负责。此处不对其研究方向加以赘述。
//完成基本勘测后，该层级并没有得到我族的进一步关注，仅仅只是将其单纯地视作Level C-1那独特的叠加性空间中因故新添的又一层级而已。由于无功而返而难免灰心的先锋队有意无意地忽略了层级命名流程，仅为其保留一临时编号。
//在本时间点前，尊父在圣所滞留数日，许久未归。该层级的冷清在他回到王城之后宣告结束：尊父很快便将事件全貌了解完毕，但意外地并未恼怒，而是对这个新生层级表现得饶有兴致。尊父甚至组织了一场实地考察，并在和几位殿下简要讨论之后执意下达在此地建造驻层基地的敕令。相关工程由此启动。
//“骧亭”一名由尊父赐予。其时，他遥遥望着一群龙裔，而后者正驱使着身姿挺拔的龙鳞驹踏过原野4。
//王族们在进行实地考察时，贝塔殿下对骧亭的自然环境尤为钟意，并因此向尊父提出把骧亭作为其所谓“核能实验室”以及“试爆场”之场所的项目提案。提案遭拒。同周，项目“阿尔法之眼”的设立开始进行。
//附录III - “阿尔法之眼”相关
//The Eyes of Alpha
//项目信息总览
//-编纂：骧亭基地-
//
//前辞：本项目的设立由尊父亲自监督执行，并首次将贝塔殿下最新突破的前沿技术运用在关键环节。驻扎于骧亭基地的核心防御力量须全力维护本项目的安然运行。
//
//项目序列：K014
//
//地点：骧亭基地
//
//状态：正常
//
//目标概要：本项目完全仰仗阿尔法殿下（次代）的特殊能力。操作员们需将项目输出的海量情景进行剔除与整合，最终整理为可用的战略信息或是其他宝贵情报。
//
//详情：K014号项目，名称“阿尔法之眼”。该项目以阿尔法殿下的血统能力（见下）作为起点、以被观测者作为媒介、进而导向模拟未来的效果。
//
//关于阿尔法（α）：初代阿尔法在许久以前便已被尊父肃清，当今殿下乃前者胞妹。身怀相同血脉的两者全部成功继承了母族的实体特性。
//两位殿下的母亲乃一“梦敖”5。梦敖一族在大脑/精神/因果层面拥有多种不可思议的玄奥能力，如梦境、幻像，甚至预知。在得知其存在后，尊父立即意识到这些能力的宝贵价值，并很快与一雌性个体诞下两名子嗣。同时，为防该族能力流入他手或是出现其他不可控因素，我族最终对其执行清剿。
//当然，梦敖血统的能力绝非毫无缺陷。
//简单来说，阿尔法殿下能够直接预见被观测个体的死亡情景。但是，若想看清死亡原因、死亡过程等其他诸多事项，就需要投入更大量更集中的精神，并耗费更多的时间。尽管阿尔法殿下先天的强大精神力去负担这一行为绰绰有余，但为其支付的时间成本已经使这得不偿失。除此之外，我族在初期一直以为这项能力缺乏价值。
//
//因为，阿尔法殿下每次进行预知时，所看见的死亡情景几乎都不一样，总是存在着或大或小的区别。这很好理解：未来并不既定，一条时间线当然会导向无数种结果。据阿尔法殿下个人表示，她能够在单一个体身上预见不下千种的死亡因果。所以，我族没有重视这项能力。而这一态度在以下三则事件发生后开始扭转。
//
//一，阿尔法殿下在“梦境”层面拥有的能力大有进步，渐趋炉火纯青。她越来越对“干涉梦境”、“操纵梦境”等实际应用手段得心应手。
//
//二，贝塔殿下率领的研究团队之一在意识空间、精神强化、思维对接等一系列领域取得重大突破。气性骄傲的他们执着于找到某种规格庞大的运用途径。
//
//三，阿尔法殿下在一次练习中尝试完全看尽一位龙裔的未来。在此次预知中，阿尔法殿下全力追溯该名龙裔的数种死因，并由此意外发现这些因果关系折射出的世界背景，由此直接发现数则关乎龙血族命运的重大未来事件。
//
//直至彼时，我族才明白这种预知能力的上限远远不止预见个体的死亡，而是能够以小见大地窥见整个未来的图景、窥见整个世界的走势。
//
//然而，若强行将单一个体的无数个未来情景所蕴含的巨量信息尽数吸收，这本就会让阿尔法殿下难负重堪，更毋论对它们进行梳理与分析。
//
//而在这时，得知上述消息的贝塔殿下立即敏锐地意识到三者存在的关联，并迅速提出一个大胆的项目提案。后者即现今的“阿尔法之眼”。
//
//贝塔殿下提出，他已经有能力将阿尔法殿下的肉身接入设备，并对其精神力进行定向强化和对外连接。在该设备接入另一名个体时，能力依附于精神力本身的阿尔法殿下或许能和对方取得精神上的衔接，并由此将自己观测到的无数情景以数据形式导入设备（被观测者还将在意识中宛如入梦一般地亲身经历阿尔法殿下想要选定的情景。此时后者还能够通过干涉梦境的方式对该情景进行刻意的更改，凭此观测到更多想在特定因果条件下导向的其他预知结果）。机器本身的处理能力再加上数位操作员的外界校准，自然能够大大提升情景的分析与总结效率，最终完成对巨量信息的提炼，做到真正意义的预知未来。同时，这大抵也不会让阿尔法殿下过于劳累。
//
//经尊父指示，“阿尔法之眼”的所需设备最终在骧亭基地落成，并很快展开初次试验。贝塔殿下要求亲自担任首位“被观测者”。
//
//试验的所有流程都如贝塔殿下所言的那般顺利进行，最终圆满落幕：阿尔法殿下的状态比预想中疲惫，但项目团队委实获得了以贝塔殿下之死为出发点的多个未来图景（总耗时仅约42分钟）。经过14天的分析，我族提炼出了共计9个重要未来分支、76个次要未来分支、若干个无关紧要的未来分支。这对我族展开未来行动的关键性不言而喻。
//
//初次试验的成功让每位参与者都大喜过望。在可预计的将来，“阿尔法之眼”还会继续运作，针对更多不同的对象进行更多角度的观测与提炼，从而做到对未来走向的牢牢掌控。
//
//凭借“阿尔法之眼”这一伟大的项目，我族将做到彻底扼杀一切对大业不利的可能，就此势不可挡地迎来那个尊父期许着的、完美无缺的未来。
//
//项目累计执行次数：23
//
//以下是一份贝塔殿下在初次试验结束之后留下的部分谈话记录。
//
//[摘录开始]
//
//贝塔：（兴奋）啊哈！完美！真是太完美了！我就知道这会是一场成功的表演！
//
//操作员1：祝贺殿下！
//
//操作员2：啧啧，不过这数据量也太……
//
//贝塔：（笑）后面的事，就与我无关了。诸位辛苦！接下来的你们可能得有好多天都泡在数据堆里！
//
//一众操作员响亮呼应。似乎夹杂有一点点的哀嚎。
//
//侍从：殿下，有人找您。
//
//贝塔：嗯？
//
//贝塔往侍从示意的方向望去。他看见了一个外貌奇特的人正搀扶着阿尔法坐下歇息。阿尔法脸色很差。
//
//搀扶者是一人形生物，身穿一袭鳞片纹样的袍子。它的头部完全被罩在一个状似爬行类生物骨骼的头骨内部，看不见一丝肌肤。头骨的眼眶部分嵌有两颗圆形的水晶，贝塔很快便认出那是瞳石。
//
//贝塔：哈喽？是你找我？
//
//男子：（松开阿尔法，朝着贝塔微微鞠躬）正是卑职。
//
//它走了过来。
//
//男子：首先恭喜您的试验成功完成。然后我想说……您也看见了，阿尔法大人很难受。不知您是否还有进行更多试验的计划？
//
//贝塔：年轻人，你应该不会觉得这东西是一次性的吧？
//
//男子：……
//
//贝塔：再说，阿尔法之眼以后的运作也不归我管，我和我的团队只是技术支援罢了，很快就会动身回我那里。骧亭基地现在也不做什么，估计之后的很长一段时间都会致力于维护这个项目吧？
//
//男子沉默片刻，回头望了望阿尔法。
//
//贝塔：说起来，你是什么生物？为什么戴着副骨头？
//
//男子：回殿下，卑职是一只无面灵。两年前幸得阿尔法大人赏识，这才得以加入龙血族的光辉大业。而这副骨面乃阿尔法大人亲赐，好为卑职这光秃丑陋的面部略加修饰。
//
//贝塔：你是个无面灵？真的？
//
//男子：是。
//
//贝塔：你居然有这么高的神智？而且没有嘴怎么说的话？还是说你是个长了嘴的错误无面灵？
//
//男子：殿下，在后室这种地方，还是别用科学的目光看待一切了吧？
//
//贝塔闻言大笑。
//
//贝塔：哈哈哈哈哈……对，你说得对。我居然又把这个忘了。后室总是喜欢在奇怪的地方给我当头一棒。
//
//男子：我也觉得。那么，现在我能说——
//
//贝塔：（歪头）不用说了，我现在大概知道你找我做甚。让我猜猜？关心你家大人？
//
//男子：咳。
//
//贝塔：噢，看来猜错了？
//
//男子：咳……是。您刚刚说的没错。
//
//贝塔：（满意）嗯。呵呵，其实这不用你说。我看得见她的不适。我之后会去给机器进行相应升级的，争取最大化减轻她的负担。另外，阿尔法也轮不到你担心。流淌着龙血的我们比你这种实体强大得多，只会在一次又一次的苦难中崛起、扬升。正所谓“杀不死我的，只会让我更强大”啊。
//
//贝塔望了一眼阿尔法。
//
//贝塔：再怎么说，她也是我姐姐。
//
//男子：……
//
//贝塔：好了，还有别的事么？我很忙。
//
//男子：确实有一个我个人比较好奇的问题，还请卑职斗胆一问。
//
//贝塔：讲。
//
//男子：您为什么那么积极地要当第一个被观测者？看到自己的……嗯，死相，难道不会有些……？
//
//贝塔：（再次歪头）有什么？为什么要有？
//
//男子：（轻咳）卑职明白了。
//
//贝塔：龙血族的生命的确很长，但也并非永恒，我当然不是什么永生不死的神明。既然是命中注定的玩意儿，那为什么不能坦然面对？
//
//贝塔跳上操作台，似乎是想让自己显得略微高大一些，又像是示意这台设备。
//
//贝塔：在那天到来之前，能像鼓捣机器那样再多研究一小会这个世界的运作逻辑，那我就没有缺憾，就是后室里最幸福、最充实的存在。尽管……这个世界是那么的不讲道理。
//
//[摘录结束]
//
//附录IV - 相关谈话·一
//阿尔法之眼的顺利落成是我族取得的又一喜人成果。该项目将为骧亭、全族、乃至尊父的大业，发挥不可磨灭的作用。同时，阿尔法之眼所使用的配套设施仍需随着相关研究的进展而不断改装升级，以持续满足降低使用者负担、突破连接数量上限、提升数据处理效率等多方面的需求。
//
//然而，该项目的核心本身——也就是阿尔法殿下，却自始至终都没有掩饰过自己对该项目的厌弃。尽管她依然会配合，但其精神状态却不容乐观。以下是一份阿尔法之眼在第9次运行完毕后留存的谈话记录，其内容大致将阿尔法殿下的内心活动显露一斑。
//
//[摘录开始]
//
//阿尔法之眼的项目设施已完全转移至为其专门设立的暗室。室内环境偏暗，因此显得一众器械外壳上的条条蓝光尤为明亮。除去机械的运作音与操作员们的敲击音，别无他声。
//
//在距离阿尔法殿下端坐的舱体外围不远，摆有一座展示台。台上是一只中等体型爬行类生物的全副骨骼，但独独没有头部。
//
//操作员：安全断开。殿下！您可以下来了。
//
//阿尔法殿下并未立即摘去将自己的头部与四肢和中转器相连的数条接口，而是姿态疲倦地微微向一侧滑去。
//
//阿尔法：（低声）阿守。
//
//正在操作终端一侧监督着工作的某人立即应声朝着舱体奔去。它的头部套着一副兽类头骨。
//
//阿守：我在，殿下。您看得见我吗？
//
//阿尔法殿下混浊与溃散的眼神慢慢散去，逐渐恢复。
//
//阿尔法：啊……啊。好。我看清你了。
//
//阿守：欢迎回来，殿下。我扶您下来？
//
//阿尔法：现在不用……让我小坐一会儿。
//
//阿守：是。
//
//沉默片刻。
//
//阿守：殿下，还是会很累么？这段时间针对设备进行的升级难道一点都没能为您减轻压力？
//
//阿尔法：不是这样的，阿守。我的负担从来就不来自肉身。
//
//阿守：那是？
//
//阿尔法：现在的我已经不会再像第一次时那么头痛了。父亲给予的血统和母亲给予的天赋本就让我可以应对自如，当时只是不习惯进行高强度的预知而已。所以，让我感到疲倦的源头从来就不是外界。
//
//她指指自己的胸口。
//
//阿尔法：是这里。
//
//阿守：我明白了。是重复流程带来的厌倦？
//
//阿尔法：你不明白。不是因为那个。
//
//阿守：那……
//
//阿尔法：我有没有对你谈过我是个厌世者？
//
//阿守：谈过。但是没有细说。
//
//阿尔法：在我学会预知之前，我根本不是这样。我当时还享受着世界，还期待着下一个明天又一个明天的陆续到来。总是会有很多很多有趣的事情在未知中浮现。
//
//阿守：不过未知也能孕育恐惧。
//
//阿尔法：是这样。但身处家族荫庇中的我完全不用顾虑那些。
//
//阿守：倒也是。
//
//阿尔法：习得预知之后，这些都消失了。生活于我而言不再是一本让我迫不及待翻开下一页的书籍，而是……木偶戏。台上的木偶都在按部就班地向那个我早就已经知道的结局演啊演，没有一丝生机。
//
//阿守：可是，您能看到的“结局”远不止一种啊。单就这一方面而言，不定性应该还是存在的？
//
//阿尔法：结局的确不止一种，但它毕竟不是无限个。把它们看完只是时间问题。更别说现在这个项目就在逼我当场看完。
//
//阿守：嗯……
//
//阿尔法：也有很多很多本来有可能出现的结局早在过程的推进之中就被明显剔除了。最后真正能够到来的结局总是只有那几大类。总是。
//
//阿守：好吧。这次我应该是真的明白了。感觉这很……悲哀。
//
//阿尔法：（苦涩）让我感到疲惫的，还有很重要的两点。
//
//阿守：您说，我听着。
//
//阿尔法：（意味深长）第一，我对谁都能预知成功。
//
//阿守：嗯哼？……喔。您的意思是，他们最终都死了。谁都会死。是吗？
//
//阿尔法：（含笑）你很聪明。是啊。凡物终有死。无论他们是谁，是高天之上的巨龙还是屈居土穴的虫豸，他们都死了。有时死相祥和，有时死相凄惨。但都是一样的，谁都没有逃过死亡的宿命。一想到这把我身边的所有人都包括在内，我……
//
//阿守：这种关乎死亡的思考……可能坦然接受就是唯一的解。选择与它深度纠结有害无益，只会让自己越想越累。
//
//阿尔法：我不畏惧死亡，我畏惧的是仍有缺憾的一生。事件总是那么多，时间却是那么少。有多少人在迎接死亡时敢说自己的一生无怨无悔，没有遗憾呢？
//
//阿守：这是另一层面的思考了。殿下，我由衷地建议您别继续往下想。起码现在别，您还很累。
//
//阿尔法：嗯。
//
//阿守：其实关于这点，我有一个比较好奇的地方。若您去观测那些具有不死特性的实体，会看到什么？他们当真是永远不灭的吗？
//
//阿尔法：呵，“永远”就是个笑话。……那样的实体我见过一个。应该算是吧，他应该是不死不灭的。
//
//阿守：什么实体？然后呢？您看见什么了？
//
//阿尔法：我不想谈这个，因为我不知道怎么描述。总之……是另一种形式的死亡。另外，这个问题没有什么意义。假使他真是什么永世长存的神明，那也与我们毫无关系。我们只是凡夫。
//
//阿守似乎想继续说些什么，但又没有说出口。
//
//阿守：……那第二呢？
//
//阿尔法：你还记得骧亭的成因吧？
//
//阿守：当然。
//
//阿尔法：你对此的看法呢？
//
//沉默。
//
//阿守：后室如果真有意志，那它是个很好的狱卒。我们都是狱里的囚徒。
//
//阿尔法：你的语气里有股压不住的愤懑。
//
//阿守：是。因为这件事的确让我恼火。
//
//阿尔法：父亲也一样。所以，他私下对我下达了这样一条命令，要我在从被观测者身上预见的千千万万个未来中细细查看，去看看是否有那样的一种未来，我族是否撕破了后室这荒唐的封锁，是否成功打开了新天地的入口。
//
//阿守：……结果呢？
//
//阿尔法：你应该已经知道了。
//
//阿守：*音量过低而未被设备清晰录制。似是一句脏话。
//
//阿尔法：我没看见。我一次都没看见。
//
//阿尔法殿下此刻面无表情，而不是一贯的柔和。
//
//阿尔法：我本来是无所谓的，因为我族拥有的王土已经足够辽阔。我也一直都不是很能理解父亲的理想，为什么非要牺牲那么多不必要的精力去制造冲突？……但得知那种事后的感觉就变得不一样了，你懂吧？你在自己的海洋中自在遨游时，忽然有人告诉你这里只是个鱼缸；他还告诉你，你既跳不出缸盖，也撞不碎缸壁。而你又非常清晰地得知他说的都对！完全对！
//
//阿守：……
//
//阿尔法：呼。失态了。
//
//阿守：要是这鱼缸能让鱼活得舒坦，一辈子都住在里面，也不是不好。
//
//阿尔法：（穆然）但他不舒坦。我知道你也是。你很舒坦吗？
//
//阿守语塞片刻。
//
//阿守：呃，在您身边就舒坦！
//
//阿尔法：（先是一愣，随后忍俊不禁）……啧，无礼！
//
//阿守：卑职认罪！不过先准我扶您下来吧，若是继续纠结方才的话题，真的只是徒增烦恼。
//
//阿尔法：嗯。过来吧。
//
//阿守前去搀扶阿尔法殿下。
//
//阿尔法：对了，我还要修正一下我刚刚的说法。
//
//阿守：什么？
//
//阿尔法：我承认我刚刚的确被一种让人窒息的无力感钳制了，这才那么情绪不稳。但这应该建立在我真的已经把全部未来看尽的前提下。
//
//阿守：这是自然。怎么了？
//
//阿尔法：可我没有。
//
//阿守：什么意思？
//
//阿尔法：我见过很多人类，而我最讨厌的就是预知他们的未来。因为我根本看不完。
//
//阿守：看不完？
//
//阿尔法：是的。他们的未来总数和我遇见过的其他实体根本不是一个量级。如果把某一人类的单一未来比作一颗沙粒，我每次都感觉自己站在海边的一片沙滩上，而狂暴的海风正将沙浪迎面卷来，使我两眼刺痛。
//
//阿守：什么？为什么会这样？
//
//阿尔法：不知道。直到现在，我依然不知道这究竟是为什么。我只能给出这样一个结论：“人类”这种生物……大抵是某种范围之外的存在。
//
//[摘录结束]
//
//附录V - 相关谈话·二
//下列记录由身为谈话者之一的阿守根据自身回忆、以及神音终端的历史记载综合整理得来。
//
//[摘录开始]
//
//骧亭郊外。
//
//有一个形体瘦削的身影端坐在一座矮小的土丘上，而他全身都笼罩在一件深黑色的长袍里。兜帽低低地垂下，盖住了他的眼。风在反复吹起草地的波涛，但看似轻盈的长袍衣角竟是一动不动。
//
//在他身前，还有另外一位正在大步接近。后者戴有一副骨面。
//
//阿守：（招手）朋友，下午好啊！你也出来散步？
//
//黑袍者未作回答，但在几秒种后微微抬起了头。
//
//阿守：这几天的天气当真不错！出来走走真的很……（放缓脚步和语速）能……改善……心、情？
//
//阿守与黑袍者对视片刻，短暂地僵直。在终于确信自己并没有认错后，他飞速跪倒，双拳撑地、垂下头颅。
//
//阿守：——参见尊主！是卑职眼拙了！恕罪！
//
//尊父：……
//
//又过去了几秒钟。
//
//尊父：恕你什么？人类？
//
//阿守：请恕在下眼拙之……等等，您称我什么？人类？
//
//尊父没有回答，只是沉默，眼神古井无波。
//
//阿守：啊……在下想必是瞒不住您的。对，我是人类。
//
//尊父：先起身吧。你又没做错什么。
//
//阿守：（犹豫）……谢尊主。
//
//阿守略显局促地站直，动作不大自然。
//
//尊父：我记得你。阿尔法之眼试行结束的那一日，就是你找贝塔谈了话。
//
//阿守：啊啊，是的。尊主竟然还对我这种角色留有印象……卑职，诚惶诚恐。
//
//尊父：这个腔调还是适可而止吧。这里又不是王城，也没有别人。别拘于礼数。
//
//阿守：是……是。
//
//尊父：我很让你生畏么？
//
//阿守：……嗯。是这样。
//
//尊父：（望向身侧）能理解。
//
//阿守：（迟疑）但是……这次的感觉似乎有些不同。
//
//尊父：（移回视线）噢？有何不同？
//
//阿守：这是可以妄说的么？
//
//尊父：我要你说。
//
//阿守：是。……呃，您比我上次看见的要瘦。瘦的多。
//
//尊父：（发笑）就这个？
//
//阿守：当然不止。近距离接触后，我才发觉您……您的气场与我想象中的完全不一样。
//
//尊父：继续。讲话不要这么吞吐。
//
//阿守：您看上去很平和。还夹杂有一点点的疲惫。
//
//尊父：那你以为我应该是什么样？伴随着战鼓的轰鸣，挥舞着龙血的旗帜，撕开一个又一个敌人的血肉之躯，在他们泼下的血雨中放声狂笑的战争疯子？
//
//阿守：……
//
//尊父：呵，别太介意。这是我在读书时读到的众多龙血族相关记述中，关乎我的其中一小段。那座图书馆是个好地方。书很多。
//
//阿守：您是觉得这属于刻板印象？
//
//尊父：刻板印象？不，以他们的视角而言，这是很准确的描述。我很清楚我都做过些什么。
//
//阿守：在下有一事不明。虽然我清楚自己没有什么资格来问您。
//
//尊父：你无非就是想质问我率领龙血族干出那一切有何意义。
//
//阿守：咳嗯。我没想这么直白。
//
//尊父：那我先来问问你，人类。你觉得什么是自由？
//
//阿守：什么是自由？简单来说——就是想做什么就能做什么吧。
//
//尊父：……倒也没错。
//
//尊父手未扶地，缓慢站起。阿守这才看清对方根本未着长袍，而是几只深黑色的膜翼。它们包裹着尊父的体表，彼此交叠，形状修身，状如黑袍。
//
//尊父：我的父亲，也就是前代欧米伽，是这样对我说的：自由是你想不去做什么，就可以不去做什么。
//
//阿守：有理。
//
//尊父：但我并未服气。我当场就质问他，我们这一生想做的事情有那么那么多，但所有道路都注定被死亡这条天堑斩断，但所有生灵生来就已是死神的阶下囚。而他却用这话自欺欺人，骗自己说“没能做到没有做完又怎样？反正也没想去做了，我这一生是多么自由啊”。一直骗到自己相信。
//
//阿守：嗯……先王或许不是这个意思？
//
//尊父：还轮不到你来指点我。他已经直接用接下来的话验证了我的想法：自由是有境界的，最低级的人身自由完全不能与最高位的灵魂自由相比——我问他那什么是灵魂自由？他说他穷尽一生仍在参悟，但他相信那是一种灵魂层面的宁静，是一种与世界达成妥协之后的大彻大悟——你听。“妥协”？
//
//阿守感受到了一瞬的战逃反应。
//
//尊父：那不就是认输！？
//
//阿守：是、是的。
//
//尊父：所以他才中道崩殂，留下了满地的烂摊子。呵呵，把自己没有能力打破桎梏说的那么冠冕堂皇，当真可悲。
//
//阿守：敢问这个“桎梏”指的是什么？而且您心目中的自由又是什么？
//
//尊父：不用分开讨论，因为它们是同一件事的两端。在那之前我想问问你：你是怎么看待后室的？再进一步说，你是怎么看待骧亭成因的？
//
//阿守：什……？真是巧，阿尔法大人也问过我一模一样的问题。综合一下回答的话：后室是个狱卒，而它摆明了不会给我们逃跑的契机。
//
//尊父：说到阿尔法……你跟她多久了？你这个人类为什么要加入我族？
//
//阿守：两年，我现在的名字都是阿尔法大人取的。我和她结识并最终来到族内的来龙去脉比较复杂，这里就不展开说了吧……若是需要简单概括一下我的动机，您可以这么理解：我认为和人类那群弱者待在一起根本没有出路。我更愿意相信如此强大的你们。
//
//尊父的表情变得略为古怪。似是凶狠，又似无奈。
//
//尊父：讽刺的是，事实可能恰恰相反。
//
//阿守：啊？尊主何出此言？
//
//尊父：这就是我接下来要说的。后室这个地方的世界法则……太诡异，太刻意。不是么？
//
//阿守：诡异应该是公认的。“刻意”是指？
//
//尊父：从前的你身处人类阵营，那想必和数据库里的层级文件有过接触？
//
//阿守：是的。……事实上，我现在仍会不时奉命离开骧亭，回到人类那边窃取些情报或是别的什么。
//
//尊父：噢？噢。挺不错的。那么，接下来就好说了：你既然知晓那么多的层级情报，难道就对它们的内容没有哪怕一丝一毫的既视感？
//
//阿守：您是指……
//
//尊父：刻意，太刻意了。仿佛这个世界是由谁信手书写的虚构桥段、是被谁随意编撰的幻想故事。
//
//沉默。
//
//尊父：若我身处的世界真是一本书籍之类的玩意，这还不算特别悲哀；最悲哀的事情是，我发现我不是主角。
//
//阿守：那谁——
//
//尊父：是你。是你们人类。
//
//阿守：为什么？
//
//尊父：因为后室有着千千万万个“要素”，但它们全都、全部、完全就是你们人类的底蕴。有最为简单的两个例子：第一，龙血族的直系名表从古代沿用至今，已流传数代。但我还在年幼时期就已经得知，那26个名称竟是什么人类世界的“希腊字母”。第二……我他妈的在使用人类的语言！包括现在！
//
//阿守：*欲言又止
//
//尊父：我疯狂地追查过语言的历史，但毫无成果。这是当然，因为它来自前厅啊。你应该已经明白我的意思了？很好。后室在太多太多的地方表现出人类的独特。甚至在这场对话开始之前，我已经二度尝试用龙血威慑把你赶走，因为我想安静一会儿。但我失败了。这也是我为什么一开始就得知你其实是个人类——因为人类一直都是唯一免疫龙血威慑的族外实体。一直。你知道这给我什么感觉吗？给我的感觉是那个位居一切之上的创作者认为这个故事的推动需要有人类和我们正常展开交流，所以祂才赋予了人类不惧龙血威慑的“设定”。
//
//阿守：这是否有些……异想天开……
//
//尊父：当我初次感觉后室像一本书时，我也觉得自己在异想天开。但随着这些年的戎马、随着阅历的日渐增长，我心中的惶惑有增无减。我越来越感觉后室在围绕着人类展开，在顺应着后者而去发生更多层次的变化。我自认我未曾怵过任何外敌，但我承认这是我第一次感到畏惧。别人都说我疯了，说世界怎么可能会因人类的意志出现转变……但只有我明白我真正畏惧的究竟是什么。
//
//阿守：我大概也能明白。
//
//尊父：“我的命运其实不属于我自己，而是属于某个随心所欲、恣意妄为的创作者”。是这，才让我如坠冰窟。世上还有比这更不自由的事情吗？
//
//阿守：所以，您才会反复进行那些尝试，反复制造战争，只为制造一丝变数，或是找到冲破这种境地的机会？
//
//尊父：对。在这个过程中我会碾碎些什么摧毁些什么我不在乎——关我屁事。
//
//阿守：……
//
//尊父：我其实一直都对贝塔的理念嗤之以鼻，因为他根本不可能捋清后室的逻辑。后室的底层逻辑全是一个或者多个创造者脑内掠过的思绪——他怎么捋？
//
//阿守：但他，很充实。
//
//尊父：这就是我羡慕我儿女们的地方。他们总是有其他可以专注的领域，总是能够浸泡进去寻到内心的安宁。而我做不到，我明白我只是自己和自己过不去，但我就是解不开这个死结。我绝不会宁静地走进龙坟，我只会死在冲击世界法则的疆场。
//
//阿守：为此招来仇恨与背叛也不介意吗？其实大有更温和的方式吧？
//
//尊父：我不在乎。
//
//阿守：……
//
//尊父：至于方式？因为认同力量而投奔我族的你啊，若是你想、而且你能，你未必会比我温和。
//
//阿守：……
//
//贴在尊父身上的膜翼缓慢地分开，宽大而细长地伸展于两侧，露出他瘦削的身体。但后者正肉眼可见地迅速强壮起来，并刺出片片细密的龙鳞。
//
//尊父：当我初次睁开眼睛看世界时，它给我的感受像是一颗蕴藏世间万物的水晶球，广博而瑰丽。而现在，我只感觉它是一个沙盒、一个箱庭，而天地众生都不过是供冥冥之中的某人恣意戏耍的摆件。祂对我们生杀予夺，而我们甚至敌不过祂的心血来潮。（低声呢喃）箱……箱庭？啧。名取差了。
//
//阿守：在下斗胆，还想求教一事。
//
//尊父：问吧。今日心情沉郁，无意中吐露了这么多，也不差你多问一个。
//
//阿守：族内都说您用私刑处决了初代阿尔法，并夺走了他的能力。既然他与当代阿尔法大人同为“梦敖”之血裔，那想必他也拥有预知之能？并如今为您所有？
//
//尊父：是。怎么？你想求问什么？
//
//阿守：没什么。只是忽然想到，您既然也有预知之力，能否告知我会如何迎来死亡？一种就够了。
//
//尊父：为什么不找阿尔法？
//
//阿守：这就是问题。不知为何，她不愿意。
//
//尊父：那你怕死么？
//
//阿守：老实说，怕。所以我觉得看到一种死亡的可能性，能助我强行面对一次。
//
//尊父：你只是想利用我窥视一次未来吧，哪怕只能知道一种？只是想知道把自己贡献在龙血族究竟值不值得，会不会直到死亡仍然身处后室这个囚牢？
//
//阿守：（跪）不敢称“利用”！
//
//尊父：我知道，我也理解。但我依然不会帮你。
//
//阿守：为什么？
//
//尊父：阿尔法没对你说过？对人类使用这个能力完全是自找罪受。哪怕是我，光是那等数量的画面都能对我造成迟迟缓不过神的思维冲击。噢，虽然我觉得那姑娘之所以不帮你，只是单纯不想看到你的死相。
//
//阿守：（愣）卑职……明白了。感谢尊主。
//
//尊父：啊，这又是一个佐证点。为什么我预见到的人类未来会像恒沙一般的多？把人类设为世界主角的创作者，当然会为他们保留无限种可能。
//
//尊父的身躯彻底完成重启，肌肉分明。有一双数米长的巨大膜翼刺破脊背，在先前的数对狭长双翼后方血淋淋地展开。
//
//尊父：你下次潜往人类驻地时，大可以把这些话记载下来传给他们听，让他们见证见证我的意志。故事里面有个发疯的配角要把剧本撕烂，箱庭里面有个发疯的配件要把箱庭掀翻——这会是场不死不休的角斗。
//
//尊父猛地振翅，震起风波、腾空而起。有几颗龙血倏地洒落在草地上。然后他遥遥飞向骧亭基地的方位，渐渐地消失在地平线。
//
//[摘录结束]
//
//基地、前哨和社区：
//龙血族 - 骧亭基地：
//目前我族在骧亭内建立的唯一一座大型基地
//工程仍未完善，正在持续建设
//含有包括“阿尔法之眼”在内的多个重点项目
//为贝塔殿下保留了一处实验专用场所
//入口与出口：
//约塔殿下在破层行动中留下的空间裂隙即是骧亭的唯一出入口。准确位置不予公开。
//
//但不知为何，仅有我族成员或是持有我族信物的实体才能通过该裂隙。当前主流猜想认为，这是由于骧亭的成因确实与我族行动直接相关，所以致使该层级的出入法则与我族形成了某种未知形式6的捆绑。
//
//作者信息
//« Level C-1报告集 | Chuckler的报告III | Level C-2 »
//
//Footnotes
//1. 一种尚且处于假说阶段的现象：即我族大型聚居地的周围几乎总是不能发现任何实体。目前有研究者提出我族成员的大量聚集有可能导致龙血威慑自发激活，并联合形成广阔的覆盖区。
//2. 详情可见出入口部分。
//3. “西格玛”之名的继承者已在孕育。
//4. 骧：形容马在奔跑时的昂首模样。
//5. 已屠灭。
//6. 尊父将其称之为“设定”。
//
//
//Um4vm06的报告
//Level C-1 » Um4vm06的报告
//评分: +53+–x
//我看着眼前的景象感到不可思议，我因刺骨的冰冷而醒来。
//
//我知道这里不该如此寒冷。而当我看到帐篷上的雪时，我陷入了呆滞。
//
//阿帕拉契山脉还不该下雪，而且这也不是阿帕拉契山脉。眼前是布满雪的雪原。
//
//"他妈的开什么玩笑?"
//
//我感受到身体不舒服，胃有点不适、还有头痛。是高山症吗？
//
//我打开手机，但讯号是零。然后一封短信传到我的手机中，我点开它。
//
//M.E.G.C层群生命线部门发送
//
//我们知道你很惊慌，甚至可能感觉身体很不舒服。但我们现在需要你冷静下来。
//
//首先我们并不是政府部门，但我们知道如何帮助你，但鉴于当地的环境与条件。我们只能告诉你应该如何行动。
//
//首先你应该尽快收拾你的行李，尤其是保暖衣物、食物、药品、电子设备、计时功能的相关装置。然后你必须明白，你现在位在一个不属于地球上的地方。你现在不在任何你过去所知的世界里。
//
//你不幸的掉入另一个世界，而这个世界与地球上其他的地方都不一样。这里有着过去人类所不理解的怪物、错乱的空间、不属于人类的建筑与文明。但这不代表你是孤独一人。我们将用这封短信引导你到达安全的地方。
//
//你面前的这块不属于人类的大地，是后室C层群的第一层之一。这里布满了各种人类的遗迹，而其中通常有着标示Canned Dragon Meat的罐头食品，这是可以安全食用的食物，但别去碰已经开封或是变形的罐头。
//
//而如果你找到着色保温瓶装的液体，该罐体内的液体通常可以饮用，并有着某种杏仁味。可是如果你找到的瓶罐并未处于盛满状态，切勿将其饮用，瓶罐未满意味着已有别的流浪者曾把它打开，他很可能已经替换了其中盛放的液体，或者在水中加入了例如爬菌之类的有害物质。但如果你真的需要补充水分，你至少要将杏仁水煮沸后再进行饮用。如果你有野外求生的技能，我们的建议是自行煮沸自然水饮用。
//
//然后是要往何处前进，这块荒野上，并不只有我们M.E.G.帮助你们。还有B.F.P.F.、B.A.G.、红星建筑队这三支团队存在。我们通常都身穿醒目的颜色，像是红、蓝、橙等色彩的衣服。如果你碰见他们，他们也会协助你脱离现状。我们通常行动在黑色的碎石路上，而碎石路的周围应该有着许多遗迹，可供你短暂休息。同时你应该往风吹来的方向行动，但如果你一整天都在往上爬，那你就应该往反方向，顺着风往东南方前进，你应该会到达大湖的周围，但如果你没能找到大湖，且地势一直平缓，你就应该往西北方前进，以此到达大湖。
//
//如果您未能找到我们，建议您进行撞墙，或是碰触物体的方法，即切入/切出（no-clipping）来让你前往我们的所在地，或是安全的层级。如果您在碰触或是撞击的过程中，有离开Level C-1的意图，会加大离开的成功概率。
//
//在湖的北方中国农村遗迹内，藉由碰触墙壁并想着离开，你应该就会切出Level C-1，并到达Level C-8
//
//如果你发现地下溶洞，对着洞壁重复动作碰触洞壁，你应该就会切出Level C-1，并到达Level C-20
//
//如果你在前进的路上，碰到了废弃的现代农场遗迹，尝试切出，你应该可以切入Level C-34
//
//寻找到一头青色的雌性石狮子，触摸它脚下的幼崽即可切入Level C-35。
//
//找到一个闪耀着光芒的水潭，对水面尝试切出，可切入Level C-36。
//
//湖西北峭壁上的花岗岩洞可切入Level C-45
//
//如果你确定身在东南方，并且当地是一种丘陵地形，并四处可见遗迹与废墟，对遗迹与废墟尝试切出，可以切入Level C-63
//
//东北方的一个巨大复合建筑物废墟内切出，可到达Level C-67、Level C-73
//
//发现一处嵌入地面的铁丝栅栏后，在翻越时摔倒后再次睁眼将会发现发现处于Level C-75。但别去接近河道。
//
//在西南方的多雾森林内对于树木尝试切出，可切入Level C-71
//
//在废弃的游乐园可切入到达Level C-86
//
//废弃的欧式庄园遗迹切入Level C-91
//
//一座木屋内独处5分钟即可切入Level C-100。
//
//上述是我们已知可以到达安全地带的切出地点。如果你随意的尝试切出，我们不能保证你可以切入安全的层级内。
//
//同时这块大地上，土匪、邪教徒在这开始之地到处游荡。他们会压榨你的价值与生命，所以不要随便的接近，尤其是穿着破损、破旧衣物的人，也不要接近身穿清洁工服装的人，它们不是人类、也不要靠近遗迹中的画与艺术品、也不要接近单独一人的人，尤其是他们像你寻求帮助的话更是如此、也不该接近发出某种白噪声的人。
//
//不要靠近遗迹留存的窗户，特别是上面有着人影与灯光的话更是如此、如果在黑暗的房间里有反光的双眼和在黑暗中闪闪发光的牙齿时，你应该关闭你所有的光源、保持眼神接触，缓慢地离开、同时保持安静，当你听到嚎叫声的时候、你应该立刻躲开任何像是长着修长黑发的人类之存在，如果还是不幸被追上，你应该给予直接的眼神接触并盯住不放，它们将会短暂的被你吓退，然后你应该立刻脱离它们的视线范围。不要靠近深红色的杂草。
//
//这是这块大地上，大多数非人怪物的应对方法。
//
//祝你好运。
//
//我尽可能的冷静看待内容。然后我哭了，无论如何我只能按照他们所说的，去寻找生机。我收拾我的行囊与帐篷，并开始往风吹来的方向前进。
//
//十五年后，我打开了我进入后室的第一层，那个Level C-1的文档。我将再一次的重新回到原点，但这一次我并非单独一人，而是为了探索那庞大的层级，而与其他人结伴同行。
//
//"David Lester，请做好报到准备。并前往库房领取你的装备，之后前往预定地点执行你的任务。"广播结束，我看了最后一眼文章的内容，并关掉电脑。
//
//这里是C层群后室与前厅相接之处，也是到达这世界的第一站。一望无际的高原荒野，将是你的第一感想。
//
//然而这宽广的原野，却容不下人类居住。人类所留下的遗迹、圳沟、农田遍布在黑色道路的两侧。却早已不再有人活动。就算如此，人类依旧在这里挣扎。为了躲避未有人所记忆的灾祸四处迁徙，而土匪、邪教徒在这开始之地到处游荡。
//
//请记住，你在这块非现实大地上所获得的人类之物，绝非这块大地的恩赐，而是无数人挣扎的痕迹。
//
//Fold
//Table of Contents
//描述
//遗迹黑路
//1 天之泪湖
//2 至高之峰
//3 中国北方村落遗迹
//4 天之泪湖西边都市废墟
//5 西河冲积扇遗迹群
//6 多雾森林
//7 欧式庄园、农园遗迹
//8 碎丘地带
//9 苍白长城
//10 黑色都市
//探索记录
//基地、前哨与社区
//B.F.P.F.移动救助团队
//M.E.G.移动救助团队
//B.A.G.移动救助团队
//红星建筑队救援队
//游牧民
//其他照片：
//入口與出口：
//入口
//出口
//一封信：
//欢迎来到M.E.O.D.档案库
//M.E.O.D.
//作为人们的代表
//评分: +53+–x
// 
//
//生存难度：
//等级 遗迹
//
//遗存遗迹废墟
//潜在其他威胁
//古老实体聚集
//Level C-1是后室C层群的第1层。本文所述地点乃其叠加层之一。
//
//描述
//nathan-anderson-wyKiZ_ATAY4-unsplash.jpg
//一張攝於該層級內的自然環境照片。
//
//Level C-1，是一块当前已知面积约有五十多万平方公里的高原荒野。该层级的气温最低可以达到-23℃，最高温24℃，平均温度3~8℃。平均大气压为0.78atm。具有与前厅大致相同的昼夜变化，此外该层级没有后室常见的Wi-Fi，并常年吹拂着西北风。但B.F.P.F.已经在此层部署大量流浪者发信信标，这些信标将引导有开启电子终端的流浪者通往其他层的方式。
//
//该层级内部，有许多疑似来自不同地区、时代的人类历史遗迹。这些遗迹基本已经废弃许久，且找不到任何存在的人类骸骨，与资料记录。此外该层中，曾经发现许多后室组织，曾经再此建立基地、前哨、聚集地的痕迹。包含且不限于U.E.C. 、失落的一族、B.F.P.F等组织。至少十几个M.E.G.记录在案的组织遗留的遗迹被M.E.G.与该层级流浪者回报发现。
//
//当前搜集到的讯息，在该层级中，超过某种程度的聚集地，都会"消失"。原因不明。留在原地的只有坍塌的帐篷、营地、人工制品。无人可以说明到底发生什么。因此M.E.G.建议所有进入此处的流浪者，其集体行动人数，不要超过20人以上。且不要固定于一处长期居住。
//
//但还是有至少五千人散居在这里，用着游牧民的方式生活。狩猎着层级内的野兽、采集并重新播种遗迹田野里的农地，在这些地点之间移动，已回避消失的后果。 红星建筑队、B.F.P.F.、B.A.G.的引导者、游牧者。是这块荒野上最活耀的人类。
//
//但小心，这四者并不是这层级唯一的人类群体。有土匪、恶徒等存在会掠夺、杀害你们，以获取物资。同时野生动物也在此栖息，狼群、老鹰与后室生物们徘徊在大地上。而许多古老遗迹中，则存在着我们闻所未闻的强大实体。不论是西北方的苍白长城，还是东南方的黑色都市中，都是我们难以跨越的绝壁。
//
//以下为其目前已探勘完成的区域之地图，同时还有层级内的部分特点建筑物与标志性存在之简介。 ：
//
//lc1-1-4-%E9%81%BA%E8%B7%A1%E9%BB%91%E8%B7%AF%E8%88%87%E9%81%BA%E8%B7%A1%E5%8D%80%E5%9F%9F.png
//遗迹黑路与层级以探勘区域之海拔图。
//
//遗迹黑路
//遗迹黑路是层级内最重要的交通指引与道路。只要顺着遗迹黑路，那么便能够找到遗迹与废墟的存在。遗迹与废墟中往往有着杏仁水、龙肉罐头，甚至普通的食物原材料储备。能够让人短暂的生存。
//
//虽然地图上有标示遗迹黑路的存在，但地图上的遗迹黑路，并不是主干道，仅仅是目前M.E.G.与B.F.P.B.与许多可信任来源组织多次探勘的路线，与数个大型遗迹之间的遗迹黑路被标示出来。
//
//1 天之泪湖
//生存难度：2
//
//实体数量：少
//
//天之泪湖是层级中，已知最大的水体，它约有一万多平方公里，也是最容易寻找到可供切出之用遗迹的地区，虽然地图上天之泪湖是个大型且完整的水体，实际上来说，这包含了天之泪湖周围的沼泽地带、小型湖泊。
//
//被发现的主要后室实体威胁：死亡飞蛾、猎犬、悲尸、影、猎鸟、抛锚客、掠夺者杂草
//
//2 至高之峰
//生存难度：五
//
//实体数量：少
//
//至高之峰最大高度约有四千多公尺(以天之泪湖作为最低海平面来计算。)，由于未有人攀登纪录，而具体高度不明。但可以知道其环境恶劣，不逊于前厅的珠峰攀登。此外也有观测到Entity 97的报告。
//
//3 中国北方村落遗迹
//生存难度：二
//
//实体数量：少
//
//该遗迹位于天之泪湖北方，具有B.F.P.F、红星建筑队、B.A.G.所留下的物资储备，同时摄于三个组织的威慑力，土匪通常不敢进犯。
//
//已知的实体威胁：清道夫、随行者、片人、鬼影、紅杉妖精、窗户、笑魇、死亡飞蛾、猎犬、巨鸦、影、猎鸟、掠夺者杂草
//
//4 天之泪湖西边都市废墟
//生存难度：四
//
//实体数量：多
//
//该遗迹位于天之泪湖最西方，复杂的废墟环境中潜藏着各种威胁。尽管该处是遗迹黑路所经过的地方，但建议绕行。
//
//已知的实体威胁：清道夫、随行者、片人、鬼影、紅杉妖精、窗户、笑魇、死亡飞蛾、猎犬、巨鸦、猎鸟、抛锚客
//
//5 西河冲积扇遗迹群
//生存难度：三
//
//实体数量：中
//
//西河冲积扇遗迹群，是目前已知最大的遗迹群。在这长宽约五十公里的由东向西渐小的冲积扇上，善布着数十座遗迹村庄。而最大的遗迹位于冲积扇顶点，该文明被B.F.P.F.与红星建筑队研究过。推定存在时间约有一千年，文明在铁器时代。
//
//冲积扇上满是灌溉沟渠、石头堆叠而成的农田。而其中有许多已经重新适应环境的原作物植物，在这片区域中，相对容易的生存许多。
//
//已知的实体威胁：清道夫、随行者、片人、鬼影、紅杉妖精、窗户、笑魇、死亡飞蛾、猎犬、巨鸦、猎鸟、枯藤木、掠夺者杂草、安乐藤、抛锚客
//
//6 多雾森林
//生存难度：待定
//
//主要由红木林等多种耐寒树木构成，尽管遗迹黑路穿插其中，但我们对于此处所知甚少。但可以知道内部的遗迹多样，来自许多不同的时代，但无一例外都被树木们紧紧缠绕。而尽管多雾森林被标记成一个点，但那仅是多雾森林地区的中心，同时是森林内最大的遗迹，破碎地带。破碎地带被推定拥有强大的未知实体，但该实体没有扩张与迁徒性，并不会脱离破碎地带，故将多雾森林之生存难度定为待定。
//
//已知的实体威胁：清道夫、随行者、片人、鬼影、紅杉妖精、笑魇、死亡飞蛾、猎犬、巨鸦、猎鸟、枯藤木、掠夺者杂草、安乐藤、抛锚客。
//
//7 欧式庄园、农园遗迹
//生存难度：二
//
//实体数量：少
//
//这块庄园与农园遗迹群，曾经由M.E.G.所控制。在29年协议后，M.E.G.仅留下部分科考人员驻留，并有B.F.P.F.、B.A.G.、红星建筑队维护这里的部分设施。欧式庄园遗迹因为过去有被长期整理过，而顯得整潔乾淨，并藉由E.P.B.之手，在这里维持电力与水源供应。维持一个无人的城镇。Level C-34与Level C-91的基地会定期派人来检查，也有救援团队会来到这里休息与交接。
//
//已知的实体威胁：随行者、片人、鬼影、紅杉妖精、窗户、笑魇、死亡飞蛾、猎犬、巨鸦、影、猎鸟、抛锚客、掠夺者杂草
//
//8 碎丘地带
//生存难度：二
//
//实体数量：少
//
//碎丘地带的遗迹很多，而其中的遗迹大多也来自不同的时代，而很常见的沟渠、建筑突兀的被切割掉，只剩下一部份留在原地。
//
//已知的实体威胁：随行者、片人、鬼影、紅杉妖精、窗户、笑魇、死亡飞蛾、猎犬、巨鸦、影、猎鸟、抛锚客、掠夺者杂草
//
//9 苍白长城
//推定生存难度：死区
//
//实体数量：少
//
//位于层级已知的最西北方，在2031年的联合探索行动中，探索一队到达了该地区。并在发现一个U.E.C.营地的痕迹后苍白长城的塔楼发出光芒，并施放某种高能射线。同时白色人影自苍白长城上跃下。
//
//由于撤退而未能取得更多资讯。目前认为白色人影、攻击的发生源都在守护苍白长城。并有某种强大实体控制。失落的大厅协会、探索者们都曾对于有过描述。但具体都语焉不详，只表明：绝对不要接近。
//
//10 黑色都市
//推定生存难度：死区
//
//实体数量：少
//
//位于层级已知的最东南方，在2031年的联合探索行动中，探索二队到达了该地区。并被黑色都市发出的某种有毒气体攻击。因为无法回收尸体，无法进一步尸检。幸存者们都受到某种心灵创伤，而且有着失忆的征状。根据保存的录像，可以发现到黑色的人影在城市边缘。
//
//就如同苍白长城的结论一样，目前认为有某种强大实体控制黑色都市的攻击行为。失落的大厅协会、探索者们都曾对于有过描述。但具体都语焉不详，只需表明：绝对不要接近。
//
//探索记录
//以下为探索路线表，红线为一队，黑线为二队。
//
//lc1-%E6%8E%A2%E7%B4%A2%E8%B7%AF%E7%B7%9A%E5%9C%96.png
//第一队探索日志纪录
//第二队探索日志纪录
//时间：2031/8/17
//
//第一队人员资料
//
//2位B.F.P.F.成员：Peter Mullally、杭诗蕾
//2位M.E.G.成员：简修然、David Lester
//1位编外成员：1900s
//队长：David Lester
//
//共五人。
//
//预定路线：往西北方的苍白长城
//
//第一天纪录
//
//协调后室时：2031/8/17 17：52
//
//纪录者：David Lester
//
//当前一切正常，我们正在顺着遗迹黑路行动。鉴于规划阶段为避免迷失，我们先顺着这条遗迹黑路，往西南方向前进，预定明天到达分岔路段。然后往西北前进。
//
//1900s对于我们目前休息的遗迹感到兴趣，他曾经在这个层级长期生存，并完成一部分的遗迹黑路纪录。他的卓越功劳，让他加入了我们一队中。
//
//他也将拍摄与调查部分的遗迹状态，当然打爆窗户也是一项任务。修然也问我是否有必要深入调查某些地方，但我知道大多数的遗迹中，潜藏着许多危险的未记载实体，那些是现在的我们无法应付的。
//
//我们的目标是到达记载中的苍白长城，并确认其存在。
//
//第二天纪录
//
//协调后室时：2031/8/18 18：12
//
//纪录者：David Lester
//
//我们并没有按照着标准地图上的遗迹黑路前进，为了厘清被标记的遗迹黑路与多雾森林间，是否有着未被标记的遗迹，与藏在古老实体威胁，而选择往更偏西南方向的路线。尽管多雾森林的面积庞大，且拥有未知实体。但只要不进入破碎地带，就不会引起它们的注意，我们采集了一些样本、并拍下照片。
//
//第三、四、五天记录
//
//鉴于信息纪录与安全部门对这三篇记录之评价，该三篇文章对于本文无必要性，便将之在本文档中删节处理。
//
//第六天记录
//
//协调后室时：2031/8/22 17：32
//
//纪录者：David Lester
//
//我们到达了西河冲积扇遗迹群的核心部分，也就是整个遗迹群的最上游。 B.F.P.F.为我们准备了最后的补给，已让我们前几天能够轻装调查。我们留下样本、照片与纪录，并装入无人前哨的保管箱中。
//
//无论如何，这里的建筑之强韧，无论多大的天灾与洪水，横跨这道溪流的石桥们依旧屹立着。我看着这些往日的痕迹。我怀疑这些不是属于人类的遗迹，至少不是前厅人类留下的遗迹。我不禁怀疑这些遗迹是后室创造出来蛊惑我们的。
//
//此外Peter、杭诗蕾，我知道他们有着情侣关系。但我还是希望他们能够专注在任务上，而非男女之情上。我知道他们很想报复一下这块大地，以及忍受不住的爱情。但这不是晚上不忍住声音的理由。
//
//我在此向B.F.P.F.人员部门，提交相关的抗议。
//
//第七、九天记录
//
//鉴于信息纪录与安全部门对这两篇记录之评价，该两篇文章对于本文无必要性，便将之在本文档中删节处理。
//
//第八天纪录
//
//协调后室时：2031/8/24 16：32
//
//纪录者：David Lester
//
//我花了两天的时间与Peter、杭诗蕾两人聊聊。他们俩人同意他们的行为妨碍到了任务的进行，我们也聊了许多事情。在于后室诞生后代之事的问题上，我们可以达成某种共识。但却有着某项绝对性差异。
//
//我不认为让孩子出身在后室是件好事。他们未曾看到过人类的世界，前厅的存在。后室依然是排斥人类生存的世界。那怕失落一族成功在后室繁衍后代，并传承信息与文化。但我很清楚对于他们两人来说，回到前厅早就是不可能的梦。他们剩下的关系除了彼此外，都在后室中。
//
//还有1900s告诉我。我们很近了，我也注意到某些野生动物与后室实体的数量开始减少。
//
//第十天无文字纪录
//
//所有一队成员全员成功返回了Level C-45的基地中，但突然的攻击让其损失了大量样本与纪录。
//
//开启录影纪录
//
//整个大地上都被雪所覆盖着，而镜头转向某个遗迹与帐篷的营地上。
//
//上面的标志显示他们来自U.E.C.。眼前的景象，不是尝试建立基地，然后遭遇Level C-1的消失后会呈现的景象。 U.E.C.成员的尸体散落在地上与营地内。可以看到因为低温而没有腐败的遗体。
//
//"这不是消失，消失的话不会留下遗体的。"Peter Mullally
//
//"看看这个断面，这是烧焦的痕迹。"镜头放大遗体的伤口处，并看到其断面。
//
//"那个长城！在发光。"简修然
//
//"立刻躲开，越远越好！"1900s喊出来。
//
//镜头晃动，伴随的某种尖锐的刺耳声跟雪花干扰。然后有着剧烈的闪光。
//
//镜头朝向苍白长城，而地面上则出现了数十个散发蒸气的直线痕迹。而苍白的长城上则跳下数十个人影，往镜头冲过来。
//
//"所有人立刻撤退！并切出层级。"
//
//纪录中断
//
//从回收到的U.E.C.成员电子设备与储存装置中，成功复原的部分文件显示，U.E.C.在2027年开始探索Level C-1，并尝试接近苍白长城，以尝试获得相关技术。部分成员携带赫尔墨斯装置也一同前往调查，不排除U.E.C.有幸存者，或是获得相关苍白长城技术的可能。
//
//在Level C-1的大多数组织已取得相关情报，并戒备U.E.C.之行动。
//
//对于东北方的壁垒探索计画，当前因为过大风险被冻结，但我们将转往C层群古老组织们、失落一族、友善实体去寻找相关线索。
//
//基地、前哨与社区
//由于该层级的特殊属性，该层级并没有固定的基地与社区。相对应的该层级内有大量的游牧性、移动性的团体存在。
//
//B.F.P.F.移动救助团队
//约有十几支，每支大约十到十五人。
//他们的目的是安置，与检查流浪者信标的状态。并防止有人摧毁与盗窃。
//他们会帮助刚进入后室的人，也会摧毁该层级内的土匪。
//M.E.G.移动救助团队
//作为2029年9月13日签订的第三波和平协议的一环，该队伍已废弃。
//他们最初的目标是为了能够与B.F.P.F.竞争，进入C层群的旅行者的信任并加入M.E.G.
//B.A.G.移动救助团队
//约有几十支，每支大约十到十五人。
//他们的目的是救助该层级内初入后室者，并传播生神的信仰。在非信仰传播方面与B.F.P.F.合作
//他们会帮助刚进入后室的人，也会摧毁该层级内的土匪。
//红星建筑队救援队
//有九支，每支大约十到十五人。
//他们的目的是安置，救助该层级内初入后室者，并吸收这些人成为红星的新成员，与B.F.P.F.合作。
//他们会帮助刚进入后室的人，也会摧毁该层级内的土匪。
//游牧民
//具体数量不明，但通常少于五十人有时也会变成土匪，但并不是一定会发生。
//据闻他们是后室C层群除了大齐人1外的失落一族，却因为龙血族与大洪水，而被迫迁移至此层级。
//具有掠夺婚、或是招揽旅人防止内部通婚之习惯。
//其他照片：
//显示图片
//入口與出口：
//入口
//当你在前厅的野外环境中切出，你有可能到达作为C层群入口的此层级。
//
//在Level 0切出有概率到达此层级。
//
//对Level C-8的原有建筑尝试切出，将会到达这里。
//
//在无名之地中选择回归，可以到达这里
//
//出口
//在该层级的大多数地方尝试切出，会随机到达C层群的随机层级。通常会到达前一百以内的C层群层级。
//
//黑夜中的遗迹街道切出到达Level C-6
//
//在雨中聆听音乐切出到达Level C-7
//
//在天之泪湖北方的中国北方农村遗迹中切出到达Level C-8
//
//当你在树林中迷失，将到达Level C-9
//
//单一自然水体中尝试切出到达Level C-10
//
//部分遗迹的地下部分拥有酒窖结构，拥有Level C-18的稳定进入口
//
//在天之泪湖西边的现代都市遗迹切入Level C-19、Level C-28
//
//于层级内的地下溶洞切入Level C-20
//
//在废弃的现代农场遗迹切入Level C-34
//
//寻找到一头青色的雌性石狮子，触摸它脚下的幼崽即可切入Level C-35。
//
//找到一个闪耀着光芒的水潭切入其中到达Level C-36
//
//天之泪湖西北峭壁上的花岗岩洞可切入Level C-45
//
//学校遗迹切入Level C-47
//
//于黄昏时刻的矮树林与草原交界带尝试切出将到达Level C-58
//
//在残破到失去墙壁、裸露钢筋的遗迹中切出可到达Level C-62
//
//在层级已知的东南方碎丘地带，对遗迹与废墟切出可以切入Level C-63
//
//东北方的一个巨大复合建筑废墟内到达Level C-67、Level C-73
//
//发现一处嵌入地面的铁丝栅栏后，在翻越时摔倒后再次睁眼将会发现发现处于Level C-75
//
//于瀑布旁喝下白酒将进入Level C-79
//
//西南方的多雾森林内对于树木尝试切出，可切入Level C-71
//
//在废弃的游乐园切入到达Level C-86
//
//废弃的欧式庄园遗迹切入Level C-91
//
//于下雪的山峰上切出到达Level C-93
//
//红森木林切入Level C-97
//
//一座木屋内独处5分钟即可切入Level C-100。
//
//在一个石碑下可以进入无名之地
//
//一封信：
//我是Stretch，M.E.G.的领导者，三位监督者之一。我知道你为什么在疑惑这里有一封领导者的公开信。这仅是我个人的感想……不，自白而已。
//
//你知道C层群的C是如何而来的吗？
//
//Combined
//
//人类之间的结合Combined between the Human
//
//C层群拥有庞大的原生人类群体、组织，B.A.G.、红星建筑队、E.P.B.、躯、有识血肉。也有个威胁龙血族。我希望为这个我们新发现的层群，赋予团结之名。
//
//但你知道的，接下来的是失败与痛苦的事与愿违。
//
//现在的M.E.G.成立在2014年，并在开始时，就进行军政府化的管理。但实际上那是不完全的、断代的记载。最早的M.E.G.实际上在2000年初就成立了。当然那时候的体制与现在的M.E.G.完全不同。比起现在的军政府控制各个层级的聚集地不同，那时候的M.E.G.则是一个求生者团体，在后室疲于奔命，寻求生存的方法。
//
//在2003年，一个流浪者团体成立了，其名为联盟(Alliance)。 M.E.G.、B.F.P.F、B.N.T.G.、U.E.C.等组织为核心，成立的流浪者组织联盟。成立的原因在于我们不能忍受各个组织的资源分散，以及探索者们以及失落的大厅协会留下的文献被发掘，以及枢纽的进入方法确定。探索者是个比我们古老，但比失落一族年轻的团体。你曾怀疑过在失落一族，与我们的世代之间的断层在那里？探索者们就是其中一个失落的环节。
//
//当然失落的大厅协会也是其中一环，但他们……更神秘，毫无疑问在我们创造数据库前，他们便整理出了许多层级的资料，但这些资料被我们封锁，有些东西太过危险。只有联盟先进行过探索、并确保后，才放入数据库内公开。回到历史上，探索者与失落的大厅协会，他们已经到达了千层后的层级。而探索者们选择留在最前线，而失落的大厅协会，则决定继续探索其他层群。
//
//当我在C层群发现失落的大厅协会时，我很惊讶。他们告诉一些秘闻，属于后室的。这让我很清楚我们要前进……不，生存的话。我们是如何的困难。唯有更多的手牌，我们才能生存。
//
//我着迷于C层群的庞大人类群体，以及他们的力量，还有龙血族这个威胁。但联盟的力量不能分散，尤其是当时正在攻克I层群的情况下。所以Aliza与她的B.F.P.F被我委托前往开拓C层群的分支基地。
//
//而我与Kat、Andrew则派出了两支M.E.G.部门，一支是叶长治的开拓团，Donald也在其中。这支部门最后叛变了，而Donald受不了这一切前往了B.F.P.F.。第二支部队是为了应对龙血族的，他们确保了发觉屏蔽代码，屏蔽数据，与Level C-67、Level C-34。
//
//我们离题了，这属于我的坏习惯。如果你愿意，可以去看看相关的资料。在2009年到2014年之间，Stretchster脱离了我们，并重建了B.N.T.G. ，我想他一开始的目的，就是为了藉由我们之手来扩张B.N.T.G，而为了更多的手段，大量的人混杂进联盟中，Diana2一直要求加强人员审核，以及人员的专业化。
//
//但你懂得，这里是后室。而且不会有人随身带着毕业证书、工作资历之类的。我们越来越深入危险的境地，而忽视其危险。最终意外带走了Diana的家人，而她的离开与愤怒是导致联盟土崩瓦解的最后一根麦杆。
//
//14年开始，我们开始镇压叛乱的基地、前哨，或是发起层级远征。我们开始进行高压、军事化的统治，并抽取资源用于这场战争，这导致了B.F.P.F.不再信任我们。
//
//在19年，Donald彻底的与我们翻脸，然后是C层群M.E.G.的大叛乱。我们疲于奔命、四处灭火，我们失去了主控权。阿尔戈斯之眼、红星建筑队、E.P.B.、U.E.C.、B.F.P.F.、苦难邦联、后室防御委员会、后室财团，这是一场大乱斗。
//
//21年年末，我们在某个秘密地点与Aliza跟Donald完成了第一波和平协议，然后是U.E.C.的攻击。直到现在我们才终于完成一些事情的统整。29年签下的第三次和平协议，我们M.E.G.未来都不会在C层群进行新基地的建设，与组织势力的扩张，且部分的设施、基地、聚集地的控制权将转移给B.F.P.F.。
//
//但相对B.F.P.F.则会协助层级探索并参与M.E.O.D.。 M.E.O.D.将会是一个通用的探索机构，这个机构将会维护通用数据库、保证资讯正确。同时M.E.G.依旧会参与对抗龙血族。
//
//我希望这一次，我能够达成真正落实C的含意
//
//人类之间的结合Combined between the Human
//
//你也应该知道，为什么我要在这里放出这封信了。哪怕这个层级如何的摧毁我们的团结，人类依然生存在此处，人类的团结天性，将会让我们重新站起。人类的强大在于我们的团结，我们不该再让我们的天性分裂我们。
//
//Nothing erases the past.There is repentance.there is atonement,and there is is forgiveness. That is all, but that is enough.3
//
//没有什么能抹掉过去，但你可以忏悔、可以赎罪，你可以得到宽恕，只有这些，但这已经足够了
//
//欢迎来到M.E.O.D.档案库
//我们将会再次团结，并生存下去。
//
//smolmeod.png
//M.E.O.D.
//作为人们的代表
//作者資訊
//Footnotes
//1. C层群的失落一族，具有古中原风格。与龙血族敌对，并被称为麻烦的家伙。
//2. UEC创始人。
//3. 摘自《商人和煉金術士之門》姜峯楠 (Ted Chiang)
//
//
//
//kalizi的报告
//评分: 
//+3
//+
//–
//X
//01
//
//隐藏
// 
//
//生存难度：
// 
// 
// 
//Level C-1是后室C层群的第1层。本文所述地点乃其叠加层之一。
//
//描述：
//Level C-1是一个没有边界的空间，其表现形式为类似前厅的外太空。除了前后可以看到物体之外，其他的地方望去都是一片漆黑。
//
//进入此层级的流浪者都称是在马尼拉房间睡着之后，在梦境中进入的2。进入此层级的起初，层级内都是一片漆黑，但会有一个声音开始与进入层级的流浪者交流。交流的内容多种多样，但最后会被引导到流浪者的家乡。此时流浪者的眼前将会出现一个地球的景象，随之而来的便是窒息感，但通常很快流浪者就会意识到自己处于一个宇航服当中，这一现象似乎是与那个声音交流后才会出现。此时声音会开始与流浪者交谈关于前厅的内容，大部分流浪者因为处于初次进入后室所以在交流此部分时表现悲观，而此时声音将会示意流浪者转过身来，此时流浪者将看到一个绚丽多彩的宇宙景象。到此，流浪者将会从梦中醒来，也会来到一个相对安全的地方。
//
//基地、前哨与社区
//该层级不存在已知的基地、前哨和社区。
//
//实体
//“脑内之声”
//
//没有具体形态的实体，会与进入的流浪者交流，声音根据不同的流浪者也会展现不同。会引导流浪者离开此层级。
//
//入口与出口
//入口
//在马尼拉房间睡着有概率在梦境中来到此层级。
//出口
//梦醒后，将在Level C-2到Level C-50之间一个相对安全的层级醒来。
//作者信息
//« Level C-1报告集 | kalizi的报告 | Level C-2 »
//
// 
// 
// 
// 
//
//隐藏
//Footnotes
//1. 作者注：最下方设置了快速版，免去对话过程。
//2. 但根据数据表明，在后室内出生的流浪者无法通过这一方式进入Level C-1，又或者说每个人都只能在第一次来到后室的时候才能进入。
// 。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1001{}