//Level C-68
//评分: 
//+6
//+
//–
//X
// 
//
//生存难度：
//等级 2
//
// 
// 
// 
//Level C-68是后室C层群的第68层。
//
//描述
//尽管Level C-68内部环境多变，但目前已知环境都与2013年后中国境内出租车内部类似。一般来说，进入此层级将被分离为独自一人并坐于后排座位，但也有进入流浪者观察到其它流浪者和坐于副驾驶位的情况。
//
//该层级在除外来因素的影响下将处于无声、无震动状态，但因车载收音机的存在，Level C-68并不容易令进入者感到有各类心理压力；车窗控制按钮失灵且各种暴力毁坏车窗方法均无效，同时车窗外大部分时间处于漆黑、不透光、未查明有实体出现状态，但内部却有未知光源令该层级较为明亮，这同样减轻了在该层级受到的由此导致的心理压力。主驾驶位上坐有一位外观为男性的无面灵，会做出驾驶汽车动作，有时也会做出调整车载收音机频率的动作，之后约5秒后将播放后室电台工作室的随机节目；除此之外不会有其他反应，杀死该实体也不会有任何反馈，因此对该实体的交互被认为是没有必要的。
//
//除上述进入时Level C-68所发生的环境变化之外，在该层级滞留约30小时后会发生另一种层级环境变化，具体情况表现为车窗外不再是黑暗，出现一些可以被粗糙分类为：“建筑 ”或“自然 ”的场景，这些场景会类似于在车外一样正常后移，但此时离开车外将会被传送回切入时的层级；而在此时切入除下述某些特别情况外也同样会被传送回切入时的层级。这些场景在出现6分钟后会类似于进入隧道的样貌令车窗外重新陷入黑暗，此时，建议饮用杏仁水控制有可能出现的典型或非典型后室心理情感障碍1，除此之外，这种情况下的Level C-68也是最为危险的状态，因为在这种状态下Level C-68车窗变得可破坏并且窗外将出现大量笑魇实体击碎车窗攻击流浪者和类似Level 69"来自上方的存在"实体将流浪者掳走至Level 692或杀死流浪者。
//
//基地、前哨和社区
//由于Level C-68的性质，目前该层级没有已知的基地或社区
//
//入口与出口
//入口
//Lkzry4.jpg
//典型分布于Level C-67的出租车模型，拍摄者为流浪者[数据丢失]
//
//对在Level 11中印有出租车标志的标志牌用手紧握10秒即可进入本层级
//紧握在Level C-67中散落的火柴盒大小出租车模型约40秒将进入本层级
//在Level 444中经历一次后变换事件，即可有极小概率找到明显为出租车的外壳部分，对其切入便可进入本层级
//你嚟过来睇下喎，喺呢度描述level-fun唔会畀派对客删改个网页。我知道我用录音写层级文档唔符合规定，我仲只系用白话。但系呢个是个重大发现，先发上去再讲啦在某种目前未知的诱因下，可以看见车窗处贴有几张和派对内容有关的图画，不要有过多的兴趣和视线接触，否则将被传送至Level fun
//出口
//持有生锈的钥匙并窗外景象为“建筑”类别时，将每分钟有38%的概率传送至Level C-67中
//当流浪者持有潮湿的花岗岩和云杉木并且窗外景象为“自然”时，进行切入会进入Level C-45中
//经过景像车窗再次陷入黑暗后，被类似Level 69"来自上方的存在"实体打破车窗并掳走时，有可能到达Level 69，该方法有可能导致你被笑魇或此实体杀死，请谨慎使用
//以及入口第二条可反向使用
//已接收
//自：M.E.G.邮政递送部门员工 
//Hao Kai
//Hao Kai
//
//主题：文档更新
//
//
//您好！
//Level C-68有重大发现，正在更新至网站之中，因此内容我们将先放置于这封邮件，供各位有需要者查看。
//Meglogo
//M.E.G. - 为了人类更好的未来
//- 已展开
//来到这里就像一场旅途，我们对旅途的突然到来感到迷茫，更不知道要去往何方……我们一层层的踏过，希望旅途终点在前方，却从未想过休养生息；也许我们该放松一下，当芒花丛出现时，暂时离开这场旅途，去到它们之中吧，它们会带你去怡人惬意的地方，让你在那留下旅途中最美好的回忆。
//
//错误 未知问题致使无法更改此附件，我们只负责收集信息并告知网站
//
//作者信息
//« Level C-67 | Level C-68 | Level C-69 »
//
//Footnotes
//1. 指由于后室各种层级内环境刺激导致流浪者怀念前厅中某些事物所引起的心理障碍及其导致的内分泌失调，特指非受层级影响类
//2. 在这种前提下离开Level 69的已知人员极少，同时他们口述差异过大，故暂定不知这种进入方式会令流浪者处于一辆汽车内或者直接出现于Level 69内
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1068{}