//Level C-30
//评分: 
//+24
//+
//–
//X
// 
//
//生存难度：
//等级 5
//
// 
// 
// 
//Level C-30是后室C层群的第30层，于1991年12月被KVZ发现。
//
//30
//一名已离开该层级的流浪者在被“屠戮众”追逐时匆忙拍下的Level C-30照片。
//
//描述
//Level C-30为一片未知面积的沙漠，沙漠中分散着无数燃烧的枯木1，除此以外未发现任何其他物品2。该层级的气候环境异常恶劣，经常出现大型沙尘暴。该层级气温极高，最高记录可达45℃。沙漠的沙层下为花岗岩石层，因此沙漠中会有花岗岩洞供流浪者暂时避险。
//
//进入该层级的流浪者会遇到一种极具攻击性的实体，这种实体又被称为“屠戮众”。“屠戮众”为一长着巨大翅膀的红色人形实体，通常群体行动，且攻击力极高。据报告，一只“屠戮众”可轻松击碎厚实的花岗岩壁。一旦吸引了大量“屠戮众”仇恨，生存几率渺茫。“屠戮众”并非一开始就被记录，而是已有多名流浪者在该层级失踪后被报告。
//
//据在该层级切出的流浪者报告，曾目睹其一名同行的流浪者在进入该层级后四十八（48）小时出现精神失常现象，并长出翅膀，皮肤变红，成为一只“屠戮众”。
//
//以下为KVZ特工伊万洛夫与一位成功离开Level C-30的流浪者（以下化名为“振”）进行的采访。
//[记录开始]
//伊万洛夫： 您好，请问这张照片是您拍摄的吗？
//振： 啊对，当时有一大群长着翅膀的东西死了命地追我，结果润的时候不小心按下快门了。
//伊万洛夫： 那些“东西”还有什么其他特征吗？
//振： 它们长得跟人似的，但是浑身都红不拉几的，而且乌泱泱一大群，我估摸着当时至少得有三百，不，五百只在追我，能逃出来真他妈是奇迹。
//伊万洛夫： 据说它们是人类变成的，请问是真的吗？
//振： 我不知道，我是自个儿进去的，遇到这一大群恐怖的家伙之后就拼命逃，结果突然就回到我之前在的层级了。
//伊万洛夫： 您有尝试反击那些“东西”吗？
//振： 有，我当时还打死一个，说来也怪，开枪打死内货之后我居然有了特异功能。
//伊万洛夫： 请问是什么特异功能？
//振： 就是能隔空取物，就像这样（手中出现伊万洛夫的KVZ特工证）
//伊万洛夫： （取回证件）大开眼界。对了，您在那个层级有发现其他实体或物品吗？
//振： 没有，只有着火的树杈子满地都是，我还怎么踩都踩不灭。
//伊万洛夫： 明白了，谢谢您的配合。
//[记录结束]
//
//基地、前哨和社区
//因该层级环境异常恶劣，没有基地、前哨和社区。
//
//入口与出口
//入口
//在Level C-199的厨房尝试切出有极大几率可来到该层级。
//在Level C-173通过一扇把手上沾着沙子的门可到达该层级。
//在Level C-10的湖里昏迷会有几率将你带入该层级。
//通过Level C-136的大厅到达。
//出口
//目前没有确切的出口，据离开该层级的流浪者报告，他们是在被“屠戮众”追逐的过程中“莫名其妙”地离开了该层级。
//已发现在该层级中的非沙地处即可切出。
//作者信息
//« Level C-29 | Level C-30 | Level C-31 »
//
//Footnotes
//1. 枯木的燃烧无法停止，即使缺少支持燃烧的必要条件，出现该现象原因未知。
//2. 但在子层级Level C-30.k中发现了Object C-30 - “蓝砂”。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1030{}