//Level C-11
//评分: 
//+81
//+
//–
//X
//Level C-11是后室C层群的第11层。
//
//这是一片无尽的纯黑空间，内部具有Wi-Fi信号，若你确认到达了本层级，请放空大脑，并迅速阅读本篇档案的上半部分。
//
//
//如果你还未到达过Level C-11，请勿观看以下内容。
//>关闭
// 
//
//生存难度：
//安全
//宜居聚居地
//无实体
//描述
//当流浪者第一次来到Level C-11时，这里会显现出一片无尽的纯黑色的空间。这种情况会一直持续下去，直到流浪者看到此篇档案。
//
//在这之后，黑色逐渐散去，流浪者会发现此处是一片金黄色的城市，这种金黄色光来源于东部刚升起的朝阳。在本层级，太阳会一直定格在夏日早上9:00左右的高度，散发出给这座城市带来恒定20℃室外温度的光芒。
//
//
//
//8f7b5be60e6ca894.jpg
//一张 Level C-11城市的照片。
//
//
//
//Level C-11是一座无边无际的大型建筑群，这些建筑都呈现出刚竣工的外观。城市中没有马路，偶尔会出现绿化地，地面由整齐且干燥的正方形大理石砖拼接而成。
//
//目前在Level C-11只发现了三种建筑。
//
//方形建筑，这是最常见的建筑，通常会成批出现，内部呈现出毛坯房的状态，虽然空无一物，但是仍然会偶尔刷新出少量物资。
//曲面建筑，这种建筑一般会单独出现，内部的装修较为完善，且许多门都没有锁，由于这种建筑内部的房间更加完整，因此较多的物资都刷新于此。
//玻璃建筑，这种建筑很少出现，且内部有更稀有的物资，比如火盐。
//
//
//3afef54ae1ffeb1a.jpg
//Level C-11城市中的一幢曲面建筑。
//
//21dd90d6efa50b78.jpg
//Level C-11城市中的一幢玻璃建筑的门口。
//
//
//
//本层级的其他物理性质与前厅相同，当流浪者来到Level C-11时，会产生到达前厅或者是Level 11的错觉。在建筑物的房间里，会刷新各种物资，包括杏仁水、幸运豆奶、火盐等特殊物品，也有纱布、衣服、麻绳等装备。这些物品被拿走后的24小时内会自动补充。
//
//虽然城市无边无际，但是M.E.G在此处设立了数个补给点，流浪者可以在补给点里领取生活物资，或者是在指引下到达总站点休整。建议流浪者加入巡逻队，参与城市里的定点巡逻，以帮助其他进入本层级的流浪者。
//
//本层级已被证实没有实体，如果你发现其他人形身影，那一定是另一位流浪者或者是M.E.G巡逻队队员，无论如何，请立即上前与他们联系。
//
//基地、前哨和社区
//M.E.G的Level C-11前哨站
//该站点由数个补给站组成，总人数大约在50到80人。本层级中建筑物的相似度极高，很容易使流浪者迷失方向，因此，创立多个补给点是必要的。
//M.E.G的Level C-11总站点
//该站点设立在一幢红色方形建筑内，里面有许多M.E.G民兵组织和巡逻队，总人数在200人左右，也有少量的科学家驻守。在建筑的中心有一扇通往随机安全层级的门。
//入口与出口
//入口
//如果流浪者此前并没有来到过Level C-11，且从任何一个后室C层群进入到另一个层级时，若流浪者身上携带有可以查询本档案的电子设备，则会有70%的可能性来到本层。
//其他入口见下半部分隐藏内容。
//出口
//在流浪者被M.E.G成员发现并带到总站附近后，其可以选择留在本层级的房间内居住，如果流浪者需要离开，站点小队会带他去总站点，打开去往另一个安全层级的门。
//
//
//如果你已经至少按照上述情况离开过一次Level C-11，请查阅以下内容，否则请勿打开下半部分。
//
//
//>关闭
// 
//
//生存难度：
//因人而异
//稳定性未知
//实体数量未知
//描述
//Level C-11的环境完全由流浪者第一次来到该层级中，对本层级的潜意识里的印象而决定的。如果初次进入的流浪者对Level C-11感到恐惧，那么大量的实体就会出现在他周围，同时环境会变得极其危险。如果流浪者感到困惑，则此处会变成毫无规律的诡异景象，使流浪者精神崩溃。
//
//根据编号为BKRC11-4～BKRC11-10的探索日志可知，如果流浪者把Level C-11幻想成等同于该档案所描述的“无尽城市”，则离开本层级的安全性和可行性都会大大提高，如果多个流浪者或是多个M.E.G成员构想的内容高度相似，那么他们将很有可能出现在同一个空间内。
//
//当流浪者成功进入了“无尽城市”的场景之中并离开本层级，之后再进入Level C-11时，无论流浪者的幻想如何，本层级的环境将不再发生变化。
//
//因此，本档案的上半部分用于指明流浪者的想象方向，并引导他们与巡逻队汇合。
//
//值得一提的是，那些第一次进入Level C-11，却没有按照本档案幻想“无尽城市”的人，虽然他们上传了由自身的经历所描述的Level C-11子层级档案，但他们都再也没能离开本层级。M.E.G已将上述失踪人员判定为“死亡”。
//
//如果你按照指示，安全地看到了这部分的文档，请勿把本档案的内容透露给任何还未到达过Level C-11，或还未离开Level C-11至少一次的人。
//
//综上所述，本档案及其子层级档案禁止在未告知流浪者的情况下，以任何形式进行展示。
//
//基地、前哨和社区
//无法确定，因人而异。
//遵循了本档案前半部分的内容，将与上文的“基地、前哨和社区”内容保持一致。
//入口与出口
//入口
//如果流浪者至少一次离开了Level C-11，则他们可以通过M.E.G设立在Level 11的第11号补给点中的门进入。也可以在后室C层群的任意层级拍摄一张带有高楼景观的照片，并在该照片上写下“Level C-11”，11分钟后，流浪者将会被传送到本层级。
//同时，上半部分所描述的入口将会失效。
//出口
//同上半部分“入口与出口”。
//
//
//关闭
//BKRC11-1~BKRC11-3
//BKRC11-4留存报告摘要
//BKRC11-5~BKRC11-10留存报告总结
//
//
//【文档已丢失】
//
//
//“我是约瑟夫上尉，我从Level C-35准备去Level 11的时候来到了这个鬼地方，这里刚开始一片漆黑。当时我十分想回到Level 11，脑子里面全部都是在Level 11执行任务的画面，就在此时，我发现身边的环境开始产生了变化，远处出现了一些城市的轮廓。
//
//长期执行任务留下的经验让我立即意识到了问题所在，于是我根据我在前厅中对我居住的小区的回忆，构建了这座安全的城市，并在我的面前“放置”了一幢红色建筑，以此作为离开这里的标志物。
//
//我将我进入Level C-11的心路历程写到了这篇档案里，并告诉大家Level C-11并没有想象中那样恐怖且不可探索，希望你能像我这样做，和我构建相同的城市，那样我们就能一起安全的待在这里，在这个处处充满危险的后室中，创造一个温暖的……‘家’。”
//
//
//该五次探索日志记录了未按照文档进行幻想而迷失在未知领域的人。
//他们证明了Level C-11的可构建性存在。
//弗雷达（男，197X年生），M.E.G前罗经点下士。进入Level C-11内14分钟整后失踪。失踪前曾经与未知实体搏斗。
//
//曼德拉（女，199X年生），M.E.G前罗经点士兵长。进入Level C-11内26分钟13秒后失踪。失踪前报告其身边有许多异常的亮光。
//
//克拉夫特（男，198X年生），M.E.G前罗经点一等兵。进入Level C-11内1小时7分钟50秒后失踪。失踪前的最后一条信息是：“告诉其他人千万不要来这里！这里到处都是老子他妈看都没看过的操蛋实体！”
//
//安德森（男，198X年生），M.E.G前罗经点一等兵。进入Level C-11内32秒后失踪。有消息称，在进入本层级前，他的精神状态不佳。
//
//韩彬（男，200X年生），M.E.G前踪迹制图者中士。进入Level C-11内约87小时后失踪。他将他画的地图上传到了M.E.G基地，但由于由他本人所说遭遇了“暴风雪”天气，因此下落不明。其传回的地图已被证实无参考价值。
//
//西格蒙德（男，197X年生），M.E.G前踪迹制图者二等兵。进入Level C-11内176天后发送了一条简短的问候，至今再未与基地联系，已将其标记为“死亡”。
//
//向这些勇于奉献的人致敬！
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1011{}