//Level C-47
//评分: 
//+15
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//KatGrN1yOCAkFge.jpg
//Level C-47内一处走廊的尽头。
//
//Level C-47是后室C层群的第47层。
//
//描述：
//Level C-47是一个由长短不一、交错复杂的走廊与走廊两侧的教室构成的封闭空间。其外观接近现代的小学/中学教室，但是每所教室的具体风格不同，其内摆放的家具与摆件也存在差异。由于其过于庞大复杂的结构，至今为止尚未有流浪者在此层级内相遇。
//
//每次切入Level C-47都会进入一间随机的教室，但存在两次进入同一教室的可能。
//
//走廊：
//此层级内的走廊数难以清点，且似乎一直在发生变化。每道走廊的两侧均存在对开的木质门，对应不同的教室。大部分走廊缺乏照明，仅有少量紧急逃生灯散发绿光。走廊天花板规律排布着灯管，但被证明是未连有电线的。
//
//在每条走廊的尽头都存在一面特殊的窗户，会投入橙黄色的模糊灯光。窗外时常有黑影浮动，疑似实体活动，但难以被证实，且被证明不会影响到走廊内部。
//
//UXlDp5WPZCwE3ah.jpg
//Level C-47被发现时拍摄的照片。
//这间教室的风格类似中国的中学或小学。
//
//教室：
//此层级内的教室虽然不同，但被假定有以下共同点：
//
//隐藏共同点
//两扇处于教室同一侧的门。
//至少一面黑板或白板，处于教室正前方。
//一张讲台，并存储着大量黑板（白板）笔、黑板（白板）擦。
//在靠近走廊的一侧有至少两扇玻璃窗，且另一侧不存在窗户。
//至少16副规格统一的学生桌椅。
//至少两盏可以正常开关的电灯，其开关位于教室的前门旁。
//接有电源。
//除此之外，教室内至少还存在一件其他装饰品，通常表现为书柜、储物柜、中型盆栽等1。
//
//在进入教室后，将观测到与在走廊内完全相反的情况：
//
//进入教室并关闭两扇门后，可以通过窗户观察到走廊内的灯管逐一点亮，最终达到与白昼无异的亮度。同时，其他教室也会随之点亮，并有模糊的黑影浮动，这些黑影与走廊尽头窗户后出现的黑影被假定为同一实体。
//
//在此状态下超过五分钟后，教室外会传来模糊的铃声2。最近的教室（通常为走廊对面的教室）会开始上课，并可以听到讲师的声音。具体的课程与讲师的嗓音似乎是随机的，但通常会以观察者可以理解的语言讲述。一节课的持续时长从40分钟到两个小时不等，在下课后15分钟内会开启下一堂课程。部分被观测到的课程内容见附录1。
//
//如果观察者在此期间打开了自己所处教室的灯，或推开了教室门，外界将即刻恢复正常，即所有灯熄灭、声音消失。
//
//基地、前哨与社区
//本层级没有已知的基地、前哨站和社区。
//
//入口与出口：
//入口
//从Level 11的书店中切出有小概率进入Level C-47。
//到达Level 52内的主办公室后，不从出口离开而是直接切出。
//Level 117内有一些标有“旧址”字样的橱柜，进入这些橱柜可以直接到达Level C-47。
//从Level C-28的书籍售卖区切出也有小概率进入Level C-47。
//从Level C-126的47号车厢切出可以稳定到达。
//出口
//从任意走廊内切出，或处在教室内、但在下课期间切出，将会随机进入Level 4、Level 11、Level 190、Level 210、Level C-126、Level C-28中的一个层级。
//部分层级被怀疑可从Level C-47中切出到达，但难以证实，如Level 494。
//如在上课期间从教室内切出，目的层级将会随课程内容改变。具体见附录2。
//附录1：部分被观测到的课程
//课程	具体内容	观测者	持续时间
//数学	乘法交换律、结合律与分配律	一名母语为英语的伐木工，文盲	40分钟
//德语	使用英语教授，推测难度在A2-B1之间	一名母语为英语的经济学家，硕士	90分钟
//古典政治经济学	自由市场经济的粗略介绍	一名母语为汉语的大学生	45分钟
//物理学	多普勒效应及其应用	一名母语为英语的接线员，高中毕业	40分钟
//生物学 神学	内容未知，被怀疑与Entity C-99有关	一名母语为法语的厨师，高中毕业3	80分钟
//附录2：切出时的课程与其对应的层级
//课程所属学科	对应层级
//工学	Level 172或Level 20
//理学	Level 117
//经济学、管理学	Level 1
//哲学、文学	Level 4
//医学	Level C-114
//军事学	Level 49
//农学	Level 10或Level C-34
//艺术学	Level 57
//教育学	无相关记录
//历史学	无相关记录
//法学	无相关记录
//作者信息
//« Level C-46 | Level C-47 | Level C-48 »
//
//Footnotes
//1. 书柜和储物柜内都空空如也。
//2. 形式不定，但通常为一分钟以内的歌曲、音乐，或电铃声。
//3. 该观测者在离开Level C-47后很快前往了Level 8，并从此失踪。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1047{}