//Level C-17
//评分: 
//+17
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
//不稳定
// 
//Level C-17是后室C层群的第17层。
//
//描述
//进入Level C-17后，流浪者将到达一个和自己在前厅的住所完全一致的建筑物内部。多数人报告称他们到达了“自己的房间”。Level C-17内的家具、电器等都能够使用且没有异常效应。Level C-17有无限的食物和水源供应。
//
//任何试图离开此建筑物的尝试都以失败告终，但流浪者可以透过建筑物的窗户、换气扇等看到外面一切如常。
//
//需要注意的是，若有多人进入Level C-17，他们将与彼此失去联系，除非他们在前厅时共享同一个住所。推测可能存在多个Level C-17层级。
//
//l4DFfV3v8HPuoN6.png
//一位流浪者拍摄的Level C-17的影像。
//
//Level C-17没有其他实体存在。
//
//Level C-17中的绝大多数物品与前厅中的物品相同，但仍有部分例外：
//
//所有淡水被替换为了杏仁水或幸运豆奶。
//桌子上可能摆放着一小瓶黑色粉末。
//若存在注射器，其中有极小的可能1装着少量浓稠液体。
//进入本层级时，处于本层级内部的所有钟表会被调整至15时2分。对本层级进行的任意记录会有不同程度的缺失。
//
//在Level C-17停留超过12小时，Level C-17将表现出以下性质：
//
//流浪者感知到恶意实体的存在，尽管Level C-17不存在除流浪者外的任何实体。
//流浪者听到远处传来的噼啪声2。
//若流浪者打开电脑，电脑将自动播放《It's Just A Burning Memory》，无论流浪者是否听过此曲。
//流浪者以任意形式收到一条信息：“昨天即将燃烧殆尽。”知晓此信息后，流浪者的精神状态将变得更不稳定。
//流浪者更倾向于回忆幼年发生的事。
//Level C-17中的药物快速增加。
//流浪者的更容易做梦。
//在本层级停留超过24小时，本层级内部将出现大火，即便在极端条件下也是如此。大火将以极快的速度蔓延，且无法扑灭。尚未发现在本层级停留超过24小时的生还者。
//
//基地、前哨和社区
//由于Level C-17的性质，无法在本层级建立基地、前哨或社区。
//
//入口与出口
//入口
//进入Level C-1的一扇浅黄色门或在任意层级焚烧一本来自前厅的书即可进入Level C-17。一个人最多可以进入本层级一次。出生在后室或在进入后室前无家可归的人无法进入本层级。传言离开Level 999后可能到达本层级，但未被证实。
//出口
//通过来时的路回去，或于进入Level C-17时身处的第一个房间切出。在本层级停留超过24小时将无法离开。切出本层级将被传送到随机层级。
//作者信息
//« Level C-16 | Level C-17 | Level C-18 »
//
//Footnotes
//1. 截至2022年2月15日，仅有2例报告。
//2. 一般认为是火焰燃烧的声音。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1017{}