//Level C-43
//评分: 
//+56
//+
//–
//X
// 
//%E5%8F%98%E5%8A%A8%E7%9A%84%E7%AD%89%E7%BA%A7.webp
//Level C-43是后室C层群的第43层，这里十分的不安全。
//
//描述：
//Level C-43是一片长满铁质葎草的草地，一直向着一个方向前进100千米会来到一片由毒果树组成的树林，继续前进会在距离出发点200千米的地方被一座垂直于天际的刀山阻止。该层级的温差异常的大致在-10℃到200℃之间。
//
//进入这个层级时，流浪者的位置永远不会是层级的中心。层级内时刻阳光黯淡，并且散发着阵阵紫色光芒。流浪者不可避免的会感受到重力会变化，这里的空间十分的不安全。天空中永远都飘着大量张着大口的云层。
//
//外围的毒果树所结的果实是不可以食用的，有很多非人在此驻扎。最外侧的垂直刀山被认为是不能轻易翻越的，并且山后也被认为是没有其他诱饵空间的。
//
//附录
//以下是知名层级探险家李老头在2020年10月9日发表在个人论坛上的一篇文章，这被认为是首篇文字记载关于Level C-43的文字记录。
//
//在大概9月20几号的时候，我正在穿越一片树林。正当我又渴又累的时候，我用我可靠的劈刀掀开树叶之后，我发觉我来到了一片草地上，我的直觉告诉我这里应该是一个新的层级，一个从来没有被记载过的层级。
//
//这个地方的温度与风很令人舒爽，我很久没有在这么令人安逸的层级待过了，这里的土壤我看了看也很适合进行农耕，这一度让我怀疑我是否是在后室之中。我在草地上躺了大概有十多分钟之后便起身向外开始探索，这里地势很平整所以走起来完全不累，但没走多远我便看到了一片树林。
//
//当我靠近后发现，这里的树上都接着硕大的果实，我准备好了杏仁水并摘下了一个熟透的果实，我一口咬下去里面竟然喷出了杏仁水！！！但果肉本身依旧香甜可口。
//
//我一边吃着果子一边继续向外走去，最后我看到了一个垂直到天际的山崖，这似乎是一个环形的山将这个层级给包围住了。我尝试使用我的登山工具但也都无事于补，这个山崖太光滑了，所以我只好原路返回，最终我来到了最开始的位置，我还能看到那个我来时的那个该死的丛林，但这个地方没有WIFI我只能到一个有网络的地方才能将我的所见所闻带给其他人。
//
//这篇文章发表后李老头便失踪了，这可能是因为他再次出发探险而进入了某些危险的层级导致的。
//
//实体
//非人
//
//他们是宣传者与奉献者。
//
//基地、前哨和社区
//M.E.G.生态观察基地
//曾经隶属于M.E.G.的非人建立的基地，用于观察层级内的生态并活下去，人员在15人左右。可为流浪者提供住处和奉献仪式。
//
//最后它们全部都奉献了。
//
//入口和出口
//入口
//知道本层级的内容并渴望进入本层级时，在通过任意出口时都有概率进入本层级进行奉献。
//出口
//怎么原路返回呢？
//翻过山去，去宣传再回来奉献。
//
//
//
//
//
//
//收起
//发件人：kkkkedc@backmail.com
//收件人：qtmd996nml@backmail.com
//主题：你看到那个Level C-43了吗？
//2021年9月15日 14:37
//话说你最近看到那个Level C-43的数据库资料了吗？
//
//看起来挺不错的一个生存点的，但我总觉得这个数据库资料写的有好多地方感觉怪怪的啊，你不是在M.E.G.上班的吗？去看一看这是怎么回事吧。
//
//发件人：qtmd996nml@backmail.com
//收件人：kkkkedc@backmail.com
//主题：Re：你看到那个Level C-43了吗？
//2021年9月15日 22:48
//大概看了看那篇数据库资料，我记得那是老张负责编辑的，他的话应该不会出这些问题的啊，不过这上面的描述八九也不离十了。
//
//怎么？你难道想换一个层级待了吗？Level 11待得不舒服了吗？
//
//发件人：kkkkedc@backmail.com
//收件人：qtmd996nml@backmail.com
//主题：就是待腻了
//2021年9月16日 10:13
//诶呀，就是待腻了而已，你懂我的我在一个地方待不住的。
//
//发件人：qtmd996nml@backmail.com
//收件人：kkkkedc@backmail.com
//主题：Re：就是待腻了
//2021年9月16日 23:26
//待腻了可还行，我最近被调到层级探险队里了，也算是不用天天盯着文字看了。
//
//不过老张的话最近不知道咋的找不到他了，我们估计就要去Level C-43了，我帮你试试水后就跟你说说这个地方怎么样吧。
//
//发件人：qtmd996nml@backmail.com
//收件人：kkkkedc@backmail.com
//主题：这里太棒了！！！
//2021年9月22日 6:39
//我跟你说Level C-43可真是太棒了！！！要不是因为这个地方太小了我都会建议把数据报告改成宜居，你一定要来看看！！！
//
//这里绿意盎然，果子香甜可口，甚至还有甘甜的溪水，这里很适合建造基地，我会告诉更多的人。
//
//收起
//2021年9月25日
//
//他到底去哪了？？？进行了一次层级探索的任务归来后没多久就找不到人了，这令我非常的不安，况且他去的地方也只是一个生存难度0的地方。
//
//我想我得找一找他有没有留下什么了。
//
//2021年9月28日
//
//我偷偷地在M.E.G.基地里把他曾经用过的笔记本电脑给拿了出来。
//
//我倒是要看看那家伙在失踪前到底还干了什么。
//
//但当我看到他的邮件记录时我发现了他的垃圾箱内留下了一篇似乎还没有写完的邮件，当我看到了内容之后我更加焦虑了。
//
//发件人：qtmd996nml@backmail.com
//收件人：请输入收件人地址
//主题： 请输入邮件主题
//2021年9月19日 14:24
//太他妈的荒唐了！！！数据库里的资料是完全错误的，这里根本不适合人类居住！！！
//
//地面上都是轻轻刮到就会受伤的藤蔓，天上根本没有阳光只有无尽的紫色。这里的温度也完全不均匀，我亲眼看到我们同行的成员突然烧成了灰烬！！！这里的重力也极不稳定，我现在必须将自己绑在树上，不然我可能随时就会因重力改变而飞上天空并落在地上摔死！！！
//
//边缘的山根本不是普通的山，而是一种挂满了尸体的刀山，但这些尸体生前为何都想爬上去呢？？？
//
//现在就只剩下我一个人了，我能够依靠的就只有这些果子了，而这些果实吃起来也犹如烂肉一般难吃。等等，这果子？？？我得宣
//
//2021年9月29日
//
//再看了那个被删除的邮件之后，我想我得去哪里一探究竟了。
//
//杏仁水什么的都准备齐全，该出发了。
//
//这本日记本是在侦破一起M.E.G.财产丢失的时候发现的，其中内容提到了有关Level C-43的内容与数据库不符的情况。随后将派遣小队去确认日记内提到的邮件所记录的内容是否属实。
//
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1043{}