//Level C-28
//评分: 
//+46
//+
//–
//X
// 
//
//生存难度：
//等级 3
//
//一般状态安全
//稳定
//间歇性实体冲击
//Level C-28是后室C层群的第28层。
//
//skyscrapers-1893201_960_720.jpg
//Level C-28的部分区域
//
//描述：
//Level C-28是一座大约50000平方公里，布局怪异的城市。
//
//Level C-28整体上呈现出一种诡谲的，令人不安的感觉，整个层级的景观在视觉中是失真的状态，高亮度，高饱和，生硬的阴影，让此层级看上去与前厅的宣传版画类似，而非现实城市。层级中有着不规则的昼夜交替，但不存在太阳月亮，Level C-28存在未知来源的天然光源。所有初入Level C-28的人员都会产生一种高度不安的恐惧，但已被证实此种感觉并非层级异常属性，流浪者的不安感会在熟悉本层级之后逐渐消退。
//
//Level C-28有着怪异的布局，并未显示与前厅建筑布局相似的特征，而是繁盛的建筑群落在某一处戛然而止，环绕城市之外的景色是一片高亮度，高饱和颜色的草地，而原本属于城市中心的建筑类型，例如摩天大楼，大型商场，却出现在城市边缘，而没有过渡的其他建筑。城市周边由黑色的铁栅栏包围，但留下一些通往城市之外的道路。
//
//Level C-28中本身不存在有害实体，唯二存在的实体是无面灵和少量猎犬，无敌意。包括幼年无面灵和最危险的粉裙无面灵最为敌意的行为也仅仅是一些捉弄流浪者的温和恶作剧。层级中的大部分房屋均可进入，除了少数偏僻处封闭的锁门，因为未曾发现钥匙，且不能被暴力破坏，无法进入。能进入的空间中，家具和设施均完好且可使用，Level C-28中有着完整的水、电、星云燃气供应，由城市中的电厂和自来水厂调度使用。杏仁水可在层级中的自动售货机，杂货店，食品市场，以及专用喷泉中取得，Wi-Fi信号强度良好且稳定，层级的居住设施中存在满足日常需求的日用品，大量住宅中有着运行良好且充足的家庭设备，Level C-28拥有完善的城市设施，存在大型商场，娱乐设施，公共厕所，杂货店，食品市场，邮政系统，诊所，医院，学校，政府区域，燃气设施，废品处理厂，武器商店，火车站，机场，包括两座中型及大型的仓库建筑，以及设施完善，技术优良，门类齐全，可制造大量不同种类生活用品、武器、工业品、化工制品、高技术成品和大型机械设备的工业区域。
//
//无面灵负责城市区域的低限度维持和清洁工作，使城市运转可维持，清洁程度良好。无面灵也会以类似家庭的单位居住在层级中的住宅区域中。普通商店及大型商场中被流浪者拿走使用消耗的物品不会自动补充，但在缺少到一定程度时，通往城市之外的道路上会有无面灵驾驶的‘厢式货车’或‘卡车’装载货物运往城市中自动补满缺少的商品。运载的货物包括食品，酒类，纸烟，清洁用品，户外用品，办公用品，电脑，厨具，家具，儿童用品，服装，电器，武器，电子产品，奢侈品，药品，书籍。以上物品的品牌有些来自于前厅已知，大部来自于未知的品牌种类。而值得注意的是仓库建筑中的补充货物略有不同，以大宗商品为主。包括银，铜，有色金属，火油，焦油，煤炭，钢铁，矿石，丙烷，甲醇，塑料，胶板，沥青，橡胶，火盐，皇家口粮，少量寂静汁液。工业区域被运输的商品大多为品种各异的原材料，以及工厂办公用品。对于这些从事运输的无面灵的来处和去向调查没有结果。
//
//暴雨状态：
//chicago-200445_960_720.jpg
//云层聚集时的Level C-28，之后会更加黑暗
//
//Level C-28大部分时间是安全，不存在有害实体的，但在不定期的情况下层级会进入暴雨。与建筑，景观，草地同样失真的云层聚集于层级上空，云层色度比任何前厅的乌云都要深重，被云层笼罩的层级的黑暗程度甚至堪比Level 6，不同之处在于Level C-28的暴雨状态不会使路灯，霓虹灯及其他人工光源失效，暴雨将持续6小时-2天不等，超乎想象数量未知来源的危险实体，包括笑魇，死亡飞蛾，肢团，猎犬，窃皮者，爆酸者，将在暴雨中出现，袭击任何尚处于建筑，车辆外的流浪者。幸运的是，由于不明原因，此层级内的危险实体无法破坏建筑，因此M.E.G.强烈建议在暴雨发生时锁闭流浪者身处建筑的任何出口。
//
//M.E.G. Level C-28死亡事件报告：
//基地、前哨与社区
//M.E.G. (又名 “探险者总署”) C层级伊塔基地：
//这是M.E.G.在层级中相对较新建造的基地
//M.E.G.占据了Level C-28中的政府区域，以及附近一座中型仓库
//管理人员，武装人员，文书人员共计300人
//定期从层级中搜集资源运往Level 11，部分开放贸易
//为所有定居在此流浪者提供保护和帮助
//组织层级中的日常活动，并组织工厂进行生产
//B.N.T.G.（后室不结盟贸易集团）
//占据Level C-28中的大型仓库，及周围两座摩天大楼作为基地
//全面开放贸易
//管理人员和员工在内大约200人
//对层级内所有团体关系良好
//天空观测者
//由8名年轻成员自发组成的团队
//以钟塔做为据点
//观测天空，暴雨即将到来时发出警报，为层级所有人员做出预警
//Level C-28的公民
//大约1万名定居在此层级的流浪者
//从Level C-28以及其他层级中搜集生活资源
//部分为M.E.G.在工厂及其他区域从事活动并领取酬劳
//入口及出口
//Level C-28中城市区域西北方向的公路，行驶1000公里可抵达Level 11
//其他方向的公路网络能够抵达Level C-34、Level C-115、Level C-214、Level C-254
//进入市政部门的下水道总站，进入Level 34。此通道可供少量人员及物资与Level 11的联通
//进入城市东部一家儿童收容所建筑正门可以抵达Level C-28.1
//层级中的火车站罕见情况下可登上Level 61，且Level C-28中发出的普通火车也可抵达Level 11的地表车站
//在层级中发出的普通火车在前往Level 11的路途中经过一个荒野小站，下车可抵达Level C-8
//其他方向的火车铁路能够连接Level C-214、Level C-254
//在城市内的河流逆流而上可以到达Level 11，顺流而下能到达Level C-34，继续顺流而下航行出海能够抵达Level C-63
//通过层级中的机场进行航空飞行可连接Level 11、Level 36、Level C-34、Level C-214
//以上出入口全部为稳定的双向通道
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1028{}