//Level C-83
//评分: 
//+14
//+
//–
//X
// 
//
//生存难度：
//等级 3
//
// 
// 
//大量实体C83.jpg
//　Level C-83的一张位于餐厅第二层内部的照片。
//
//Level C-83是后室C层群的第83层。
//
//描述：
//Level C-83被描述成一个位于海上游船内部的餐厅，外部是疑似无限延伸的冻洋，面积大约是███平方公里。如果你使用手机的GPS定位系统，它会奇怪地告诉你你位于南乔治亚岛的古利特维肯(Grytviken, 54°16′53.4″S, 36°30′28.8″W)周围的海域上，但是除了海上漂浮的冰山，附近看不到任何陆地。
//
//一般进入该层级时，所处的时间总会是下午。约两小时以后，天将慢慢变黑，而正是在这个时间段内，游船将缓慢地进水直至沉没。
//
//Level C-83主要分为两个部分：游船餐厅和冻洋。
//
//游船餐厅
//Level C-83主体结构由一艘三层的餐厅游船构成。
//
//第一层是甲板和厨房，也有少量的客座。你可以站在这里欣赏周围冻洋的海景，但是请小心被海风吹到海里去。你也可以解下一艘救生艇从这里进入冻洋。
//
//第二层为封闭空间设计，是主要的客座区。
//
//第三层设有观景台和休闲区，也有客座分布。
//
//你可以在任意一层的客座就座并点餐。按下位于桌上的点餐铃，此举动会引来一位具有11效应的无面灵“侍者“，它会递给你一份菜单。倘若不按下点餐铃，就座半分钟后也会有“侍者”主动来到你身边。
//
//游船餐厅上可供选择的菜品有：河豚刺身，发酵鲨鱼肉，鲱鱼罐头和炸鱼薯条(有50%概率“缺货”)。不要尝试选择其他的菜品，因为它们总是处于缺货状态。一旦你选择了一项缺货的菜品，该举动便会激怒“侍者”。它们会把你带到一层的甲板边上并将你推到海里去。
//
//河豚刺身会有99.3%的概率含有河豚毒素，食用它将导致你在接下来的数十分钟内痛苦地死去，除非你有“幸运豆奶”，食用后迅速饮下约5瓶任意口味的幸运豆奶即可解毒。杏仁水也可用来解毒，但是其用量将达到50瓶左右，因此不建议使用此方式。
//
//一旦你点了发酵鲨鱼肉或鲱鱼罐头，你将在嗅到臭味的2分钟内失去意识，这时饮用杏仁水可以减缓失去意识的时间。一旦食用了发酵鲨鱼肉或鲱鱼罐头，你将立即失去意识。
//
//qsrXqg.jpg
//　一张在Level C-83的黑夜即将来临时拍摄的冻洋照片。
//
//冻洋
//欢迎来到 冻洋
//“远洋餐厅”
// ！
//谁是食客谁是菜肴还说不定呢
// 
//
//一旦你进入冻洋，时间会立即切换到晚上。无数的“河豚”和“刺鲀”将蜂拥而至；凶猛的“大白鲨”和“虎鲸”将被你的气味所吸引；刺骨的寒风和海水将使你逐渐失温，变成一道美味的菜肴。
//
//即使是在游船上，这些鱼形实体也会不时跳上甲板，但威胁比在水中更小。
//
//被海风吹入海里、主动跳入海中、游船餐厅沉没(包括主动进水沉没和撞到冰山沉没)都会使你置身冻洋。倘若你划着救生艇，冻洋和里面的实体不会立即使你致命，若你足够幸运或技术足够高超，你可以划向远方的一个发光的冰山——那里可能会是这一层级的出口。
//
//冰山随机地漂浮在冻洋上。游船和救生艇一旦撞到冰山会立即快速进水并沉没。在你靠近冰山时，冰块会随机地从上面脱落，倘若被砸中，它们总是会命中你的要害部位并使你一命呜呼。因此请务必远离它们。
//
//实体
//这里偶尔会遇到一些无面灵就餐，但是他们并不会表现出敌意。
//
//班纳老板
//
//餐厅的老板是一位名为班纳的中年无面灵。他会热情地邀请你免费品尝菜品。在游船将要沉没时他会抢先坐上船上唯一的救生艇逃离。倘若你抢到了救生艇，你也可以慷慨地带着他一起逃离。他会给你指路。如果你足够幸运地摆脱了鱼群并到达他所指的目的地，你将有概率回到你来时的层级——但这样做同样会使你轻易丧命。
//
//侍者
//
//无面灵侍者穿着整洁的西装，行走在游船餐厅内，它们通常保持中立。如果你激怒了它们，它们会把你扔到海里去。
//
//河豚
//
//与现实世界通常生活在暖水海洋的河豚不同，它们可以在刺骨的冰水中游动自如。它们不会主动攻击你，但触碰它们将使你受到河豚毒素的毒害并引来它们的攻击。此时立即游开并饮用幸运豆奶可以缓解毒害。但鉴于它们分布极高的密度，在海中时建议坐上救生艇。
//
//刺鲀
//
//“刺鲀”无毒，但是它们更具攻击性，会主动对你发起攻击。它们的尖刺可以对你造成开放性伤口——流出的血液会招来大白鲨和虎鲸。而它们同样可以用尖刺扎破救生艇。
//
//大白鲨和虎鲸
//
//你的气味和血液会吸引它们。它们锋利的牙齿将把你撕成碎片。你将成为它们的美餐。
//
//这是一个统称，因为很少有人能看清它们真实的样子并活着逃出本层级。人们猜想它们可能与前厅中的大白鲨和虎鲸等大型食肉类海生生物类似。
//
//所有上述提及的鱼类实体都与前厅中同名的鱼类习性有较大差异。
//
//基地，前哨站和社区
//Level C-83没有已知的基地，前哨与社区。
//
//入口和出口：
//入口
//打破Level 420的冰湖湖面并跳进去将把你带到本层级，虽然这种做法非常困难甚至几乎不可能。
//在Level 83的潜艇中食用鲱鱼罐头或上述菜单中的任意一道菜品将把你带到本层级。
//钻进Level 55的一个储藏冻鳕鱼肉的冰柜将有几率将你带到本层级。
//跳入Level 85的海洋并游足够远的距离有机会将你带到此层级。在此过程中你会发现海洋逐渐由正常转变为冰冻状态。
//爬上Level C-197第二层中罕见的通往“第三层”的楼梯会将你带到游船餐厅的第三层。
//出口
//乘坐救生艇向远处划约100km有几率到达Level C-10。
//向水下潜一段距离可能把你带到Level 43。
//载着班纳老板划救生艇，到达他所指的目的地，你可能会回到你来时的层级。
//罕见的情况下，找到一艘浮出水面的潜艇，进入它将把你带到Level 83。
//爬上冰山会把你带到Level 420。
//在船舱上找到并通过一扇白色且挂有“食堂”字样硬质牌的门会把你带到Level C-123。
//夜晚来临时，想办法爬上天空中的月亮，这将把你带到Level 24，虽然这种做法极其困难。
//从餐厅的墙壁切出有几率来到Level C-124。(尽管同样名为“餐厅”，然而除此以外两者之间并没有任何联系。)
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1083{}