//Level C-7
//评分: 
//+51
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
//不稳定
//无交互的实体
//雨一直下。
//
//Level C-7是后室C层群的第7层。
//
//描述：
//Level C-7是一具不定变换特性的非线性空间。各变化终点缺乏显著相关性，唯一相同的要素是全时段覆盖有纯水构成的中雨。变化终点因人而异：在后室中出生或不具有前厅记忆的流浪者恒处于一片无边际的夜间草原，而具有前厅记忆的流浪者将会处在一个熟悉的室外环境，且其常曾在对应环境中目睹过雨景。环境温度、湿度等特性也会据此改变。
//
//rain-2666155_960_720.jpg
//对层级一种雨中情景的艺术描绘。
//
//我的眼睛深处，映出火团降落在红叶山上的幻影。
//
//Level C-7的另一个性质是空间中将回荡有音乐。音乐亦因人而异，不具有音乐鉴赏能力的流浪者将听见轻柔的白噪音钢琴音，而一般流浪者将听见一首发布时与雨有关的音乐作品，这些作品发布年代不会早于流浪者进入后室时。
//
//抬头仰望，只见一团团小火球以想象不到的速度从上空降落下来。
//
//以下是值得关注的音乐列表。完整列表可向M.E.G索取。
//音乐	版本	环境	人员及情况	备注
//人声歌曲《冬季到台北来看雨》	孟庭苇演唱的原版本。收录在其1992年发布的同名专辑内。	台北一较为繁华的市中心，似乎处于下午。周围有具有Level 11效应的无面灵等实体，但其不会回应人员的接触。	人员约在21世纪00年代进入后室，进入前身处南京。	人员自述其出身台北，青年时期因工作迁居南京。歌词中“别在异乡哭泣”可能暗示层级可以感知人员的记忆或经历。
//纯音乐Solid Rain Theme（推定）	同收录在2015年电影《超新约全书（Le tout nouveau testament）》原声专辑中的版本之曲谱，但可辨识出非同一版本。为钢琴和不明乐器的合奏。	人员不能断定所处城市，眼前是广阔的山谷，山谷处于夜间。	人员在电影院观看该影片后传送入后室。	人员自述“是《超新约全书》里的，不过不记得是哪一首了”[翻译自法语]并哼唱了部分，熟悉此电影的人员推定为本曲。另，推定项目确具感知人员的记忆或经历之性质。
//人声歌曲I Can't Stand the Rain	Ann Peebles版本。人员仅记得以上信息，未能考证该歌曲在前厅具体的发行年份。	洛杉矶一巷口，夜间。无实体。	人员在上世纪进入后室，具体年份不详。	人员自述其曾在对应巷口冒雨等待其前男友。人员当时正以Walkman聆听此音乐。
//人声歌曲Forever at Your Feet	Oh Susanna版本的翻唱版，未能确定女声。原专辑2001年发行。	约克郡一电话亭旁，夜间。无实体。	人员在2001年进入后室，且其声称为此专辑发布之后的几天内。	歌曲被选中可能是因为该曲歌词中有“A bow that's made from rain”。另外，按人员描述，这是第一次出现非原唱者演唱的人声歌曲；且若该版本在前厅有发布，可能会推翻先前“这些作品发布年代不会早于流浪者进入后室时”的论断。
//同时段处于Level C-7的人员将不能互相接触。此种性质与终点层级不同，两流浪者在物理意义上不可能接近，因所处空间不重叠。关于该性质的拓扑学分析尚在筹划。
//
//大概是火团在动的缘故吧，以雄峙屹立的山峰为堤岸，狭窄的天空看起来好像是一条河在流淌。
//
//流浪者在空间中聆听音乐时，时常会感到怀念和轻轻的愉悦或欣慰。推定是音乐带来的正常情感。
//
//流浪者可能在本层级死亡；但除自杀外，人员将不会结束生命，而是切入其他层级。见“入口与出口”。
//
//基地、前哨与社区
//层级的非线性特质阻止了常驻区的建立。
//
//入口与出口：
//入口：
//在任意有水或有雨层级陷入睡眠状态或昏迷状态有较高可能性将你带入本级。这已被推荐为部分非即时致死性高危含水/露天层级的切出措施。
//雨敲打在客车车窗上的声音，把我从朦胧的梦境中惊醒。
//
//在任意有音乐的位置跟唱、击掌或打节拍有一定可能性使你下次从睡梦中醒来时抵达本级。这可能暗示层级能够感知人员对音乐的鉴赏力。
//流流停停，停停流流，显得很有节奏。一滴滴水点，后面的赶超前面的，上面的低低地落到下面，画出一道道交错的线。
//
//怀疑部分在Phenomenon C-3发生时消失的流浪者和实体曾到访过这里。这些流浪者和实体后来的去向不明。
//出口：
//在音乐结束时，流浪者会切出本级并抵达一个通常低生存难度的安全层级。音乐持续时长取决于音乐本身，有个案报告播放的音乐存在前厅中不具有的加长片断。
//雨一直下。
//
//在本层级中陷入睡眠、昏迷或因失温等死亡（自杀除外）——如在衣物不足的情况下切入一个严冬的雨水情景，又同时遭遇加长的音乐片断——将会导致你醒来时切入Level 11的一个无人运营的唱片店。奇怪的是，唱片店并非本级的入口。
//笔记：页面已被标记为M.E.G重要研究项目。除拓扑学性质外，由于层级切出目标的不确定性和安全性，不排除层级能将流浪者带出后室。对1960~1970年切入后室C层群的故老流浪者的访谈中有关于此的传言。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1007{}