//我们的夏天
//评分: 
//+39
//+
//–
//X
//
//
//
//你想在这里寻找什么？
//这里很安全。
//你不会是第一个回到这里的人，
//也不会是最后一个。
//
//
//twilight
//还记得那片夕阳吗，天气很好。2007，18：32，男，26岁。
//
//气温有些热，微风穿过屋内。
//你可能慢慢忘了。
//风带着触角拂过肌肤，偶尔粗糙地划过，然后轻身远去，只余下薄纱般温存，还残留着一丝不舍。
//你又是一个人（了）？
//或许，床榻，散落的衣物，有血迹吗？
//等等，还是说？依稀记得，阳台，坠落，警报声。
//
//是因为争吵？还是让一切又都怪罪到夏天的闷热。
//手指间触及到的，究竟是发丝还是惊恐的呻吟。
//掐进肌肤，感受搏动的，搏动的，搏动的，渐渐衰弱的，脉搏？心跳？呼吸？
//不要着急，炎热的季节才刚刚开始。
//
//cup
//冷掉的茶水。2015，19：45，男，32岁。
//
//这是第几次，续上温水。
//深呼吸，
//茶水的味道变淡了。
//苦涩的杏仁？舌尖舔舐着嘴唇。
//喉头泛起锈蚀的甜蜜。
//
//再来一杯吗？
//又或者让安睡将夜晚带走，在梦中微笑。
//是谁在呢喃着呢？
//
//river
//河边的风景依然让人平静。2018，20：16，女，27岁。
//
//你呼唤我，橮蠟輶槍朒刜囀狘揣啀。
//我不喜欢那个称呼。
//河水浸湿鞋底，顺着裤脚向上，拥抱着。
//你享受那时候的欢笑吗。
//我们依然缠绵着，
//双臂环着你的脖颈，最后一个吻。
//顺着河水流浪，或是沉溺在沙石之中。
//
//我们可以在河边做爱，一如往常。
//我的双腿泡得发胀，
//你愿意拉我一把吗？
//
//trees
//我依然会在人群之中感到不安。2020，23：56，女，19岁。
//
//树叶好像在嘲笑我，抱紧我好吗？
//你在后退，
//我还记得，你在后退。
//远处的天色有什么让人不安的吗。
//还是说，是因为我？
//你讨厌我吗。
//又来了，这次是什么地方。
//
//你说过你喜欢我的手指，纤细，洁白，撩起碎发的样子很性感。
//你要拿走它吗。
//你要走吗，
//别忘了牵起我的手，它依然还是属于你的。
//
//moon
//你要到哪里去呢？00：00，只有我自己。
//
//别留下我，
//我的眼睛埋在泥土里，帮我擦干净好不好。
//这里好冷，尽管日头的吻还未消退。
//找到我，在你回忆的每一个角落。
//我不知道，我很抱歉，
//别离开我。
//如果你忘了一切，如果你什么都不知道，
//就让那个夏天的蝉鸣又一次歌唱吧。
//
//我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你我爱你
//
//你瞧，我们已经找到你了，对吗？
//
//light
//放轻松，深呼吸。现在，还剩下你。
//
//灯光很温暖，不是吗？
//去喝杯茶吧，离开座位，把颤抖的手平静下来。
//这只是一篇有些奇怪的文档而已，你在我们的档案库里很安全。
//没什么好害怕的，没有人会伤害你。
//我只是无法平息对你的渴望。
//
//
//
//
//
//夏天还有许多我们做过的事，等待着你，
//来找我们吧。
//
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1094{}