//Level C-82
//评分: 
//+73
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
//时间及空间稳定
//无实体存在及无切入/出可能
//失色环境及积极精神影响
//Level C-82是后室C层群的第82层，该层级由 一位S.C特工1 记录，尽管第一个来到该层级的另有其人。
//
//描述
//Level C-82是一片绽放着彼岸花的原野。原野上偶尔会生长着果树，树木和果实的形态繁多，但都是未知品种，果实皆无毒可口，富有营养，如果摘取果实或砍伐树木，果实与树木将在几天内快速再生。层级内视野中呈现的景象只表现出黑白灰三种颜色。层级内的彼岸花一直保持开放的状态并且生长着叶子。
//
//该层级的中心点，也就是来到该层级的流浪者的起点起东南方向约5千米处，有一座木屋与一块墓碑，墓碑上刻着“我们终将重逢”六个字。根据调查，墓碑下埋葬着木屋曾经的居住者，也就是已知最初到达该层级的流浪者。木屋内还发现一本内容被认为有实际价值的日记，相关信息在附属文件中将详细提及。
//
//来到该层级一段时间的流浪者都会受到一种精神影响，该精神影响被判定为积极的有益的。效果包括但不限于减轻流浪者的悲伤、焦虑、偏执，暴躁情绪，增加流浪者的希望感与满足感。相关调查与总结信息在附属文件中将详细提及。
//
//层级内电子设备不可用，无法进行拍摄与终端记录，因此该层级文档的初稿是由S.C特工记录在纸上并在离开该层级后上传至S.C数据库。
//
//介于该层级的环境与特性，该层级被认为是适宜居住的。
//
//下面是附属文件（第一份文件有部分修改）
//
//收起
//1976.3.23
//
//我简直无法理解我正在经历些什么，我是不是疯了？一天前，应该是正好一天前对吧？该死，在这种鬼地方我根本没法确定准确时间。 我简直
//好了好了，在这里瞎扯瞎抱怨屁用没有。总而言之就是我在回家的路上不知道怎么的就来到这里了，我简直无法相信，到现在也是！然后我又遇到一群人，他们告诉我这里叫什么“后房”？不对，是“后室”！总之不管这里他妈的叫什么，他们就是跟我说我永远被困在这里了，他妈的永远都离开不了了！他们还让我跟着他们生活，鬼才去跟着他们，我要出去！我要回家！我的妻子和即将出生的孩子还在等着我去照顾，我不能白白在这里耗费时间！
//然后那群人告诉我说如果我一定要离开就去找各种各样的门，或者去撞墙！撞墙？哈？他们根本就是骗子！撞墙？那是诚心让我去死！他们肯定不怀好意！所以我很快就离开了他们，现在只能靠我自己了。
//神啊，请保佑我安全回家吧。
//
//1976.3.25
//
//该死，我根本找不到任何可以打开的门…我只能不断向前走。这里的路根本是没有尽头的！不过幸好这里有各种箱子被丢在地上，我可以找到一些吃的还有防身的武器。另外我找到一个崭新的单肩包，我可以装一些吃的和工具，我绝对有理由相信它们会派上用场…所以这里究竟是什么鬼地方…
//我已经找不到走了多少个小时了，我真希望我能从这些箱子里找到个手表之类的工具。
//好像有新的进展了！我来到一个新的地方了！不过这里全他妈是暗黑色的，灰色的混凝土隧道，简直就是原来那个地方的翻版！而且这些隧道和之前那个地方一样根本看不到头！这里的墙壁上布满了管道和通风管道，真是碍事，好几次都差点磕到我的头！这些管道中有时还淌着一些黑色的像石油一样的东西，真他妈恶心啊。这里有一些门，不过和之前的一样大多数都锁上了，哪怕是能打开的门里面也就只有几个置物架，什么用都没有。
//我要回去！神啊我不能在耗在这里了，现在时间一定过去很久了！发发慈悲吧，让这里就是一场梦吧，快醒来吧！
//
//1976.3.26
//
//我一定是疯了！我一定是疯了！现在我已经彻底无法确定目前的情况了！今天早上我又遇到一群自称来自“生还者”的人，他们跟我说我很幸运，在这里转悠了一天居然没遇到…“实体”对对就是“实体”。他们说他们正在尝试一个离开这里的方法。我想我可能没办法独自逃出去了，只好跟着他们一起走。他们说要先回到他们的营地，然后，然后就在一个隧道拐角处，几个像长着手脚的肉球的东西从暗处张牙舞爪地飞扑出来，其中一个人被它们砸了个正着，然后我就眼睁睁的看着那几个肉球嘶吼着伸出自己的肢体将那个人肢解然后囫囵地吞进它们的嘴里。 真他妈 那叫什么？血肉横飞，血腥至极！当时我已经被吓傻了，一动不动地站在那里，这时我突然发现一个肉球朝我撞了过来，我想躲开但已经来不及了，我看到它溅满了鲜血的肢体狰狞地扭动着，我知道我完了。
//但现在我却还活着，我突然就在一个截然不同的地方醒了过来，一开始我还以为这个梦真的醒了！结果他妈的我又不知道到了哪个鬼地方，一片花野，令人崩溃的无边无际的花野，长满了…长着叶子的彼岸花？所有东西都是灰白色的，这就是天堂吗？哪有这么奇怪的天堂！
//
//1976.3.27
//
//为什么？为什么？为什么？我究竟做错了什么这几天我所经历的究竟是什么？一切都是如此莫名其妙谁他妈的能告诉我这是哪里到底发生了什么？发生了什么！
//
//
//（一处将几行文字都涂抹掉的修改痕迹，原来的内容已经无法辨析了）
//
//
//神啊，如果是因为我做错了什么事，这是您对我降下的惩罚，求求您稍稍宽限一下吧，我的妻子，还有我的没有出生的孩子，他们都需要我。请您开开眼吧，让我回去，至少让我把我的孩子抚养长大，不，不哪怕是给我个机会让我看即将来到这个世界的孩子一眼，让我跟他们道个别，求求您了，求求您了！
//（数滴眼泪残留下的痕迹）
//
//1976.3.28
//
//我简直无法相信，就在中午的时候，我刚刚摘完一棵果树的果子，就听到了一阵脚步声。我转过头，发现我的妻子背着襁褓里的孩子正站在我的身后，我不是一个文化人，我没办法用那些大作家的语言描述来描述当时的景象和我那几近欣喜若狂的情感。我数次怀疑那是不是我过度思念所产生的幻觉，可她的神态，言语，还有拥抱她时的触感，我不得不确定，那就是我的妻子，她确实是来到了这里，带着我们的孩子来到了这里，她还带我找到了一个木屋，不过我不太记得这附近有一个木屋。总而言之木屋里很干净，也足够我们住下来。
//一定是神明听到了我的忏悔…您的大慈大悲我会永远铭记在心。
//谢谢您，我现在很幸福。
//
//收起
//注意:该层级定居的流浪者数量较少而且他们不太乐于透露相关信息。经过数次调查，被认为有实际价值的语音记录仅有两份。
//
//2号流浪者调查语音记录
//6号流浪者调查语音记录
//＜记录开始＞
//
//S.C特工:可以透露一下你是如何来到这里的吗？
//
//2号流浪者:呃…我原来是随一个其他和我一样来到后室的流浪者组成的队伍一起生活的，后来在一次开辟贸易路线的探险中，队伍突然遭遇到了山体滑坡…抱歉我记不住是哪一个层级了，我只记得当时一截木头朝着我撞了过来，我躲了过去但被树枝划伤了手臂。那个伤口实在是太大了，而且我们没有有效的止血工具，我不久就因为失血过多昏死过去，最后我在这里醒来了。
//
//S.C特工:能仔细说说你当时的心理状态吗？
//
//2号流浪者:这…说实话我不想太仔细回忆那段经历，我只能说是…呃令人绝望，胳膊剧烈的疼痛几乎快要了我的命，这不夸张，还有（流浪者的语气变得颤抖）当…当时我流了一地的血，讲真的仅仅是看着我就已经…崩溃了，而且止血钳之类的工具药物都是匮乏的，我当时心里就一个声音“我必死无疑了”。
//
//S.C特工:然后你昏过去了？
//
//2号流浪者:是的，是的，很快我就昏过去了，虽然失血是一方面，但我觉得恐惧和疼痛才是让我昏过去的主要原因。
//
//S.C特工:那来到这里后你怎么处理你的伤口的？
//
//2号流浪者:我不清楚，等我醒来的时候伤口已经愈合了，仅仅是留下一道疤。（流浪者的语气恢复）这绝对是不可能的，而且我不久之后心情就变得特别好，似乎之前的一切都没有发生一样，这很奇怪，或者说“很不真实”。我绝对有理由相信是这个层级的效果。
//
//S.C特工:好的，还有什么其他要补充的吗？
//
//2号流浪者:没有了。
//
//＜记录结束＞
//
//收起
//根据层级内发现的日记与对层级定居流浪者的调查，我们基本可以确定以下两点:
//1.该层级需要流浪者在极度悲伤痛苦的状态下失去意识后进入，而且进入是有概率的。
//2.该层级存在一种精神影响，停留在该层级的流浪者的负面情绪，比如悲伤、焦虑、偏执，暴躁将会减轻，同时增加流浪者的正面情绪，比如希望感与满足感。
//
//根据目前所确定的信息，我们判定该层级是适宜居住的，该层级存在的精神影响也是积极而且有益的。但在这里再次强调，目前所确定的信息并不多而且不能保证完全真实准确，相关信息直到现在依旧有很多疑点。比如那位流浪者日记中提到的他的妻子与孩子，我们只在木屋内发现其一人的生活痕迹以及其一人的坟墓，我们到目前仍不确定他的妻子与孩子的详细信息与后续行踪。
//如果有新的进展，我们会进一步对文档进行补充修改。
//
//基地、前哨与社区
//“此为彼岸”流浪者营地
//位于该层级中心点附近
//由数位定居于此的流浪者组成，以采集层级内的树木果实为生
//团体对外中立，层级内采集到的树木果实被用于与其它流浪者及团体交换其他物品
//团体会接纳请求加入的流浪者
//团体定居于此的原因是层级内十分安全而且存在积极的精神影响
//S.C（苦难邦联）-绽放的花“灰灯”层级营地
//位于该层级中心点起西北方向约30千米处
//由数十名苦难邦联成员组成
//团体对外尽可能保持隐蔽
//该营地建立的原因是层级内十分安全而且存在积极的精神影响
//入口与出口
//入口
//根据层级内发现的记录与对定居于此的流浪者的调查，流浪者在极度悲伤痛苦的情绪下失去意识（包括入睡，昏迷，甚至是死亡）有概率进入该层级
//出口
//未知
//
//
//
//很久很久以前，无名的土地上开满了彼岸花，那花是极凄美的，花朵赤而不锐，红而不妖，绚烂宛如红宝石一般，但却无叶点缀，只是红，深到殷红。若是千万年前的秋日，迷途的旅者行止于无名的原野，一眼望去，便可以目睹漫山遍野的殷红同浸润了橙黄日光的天空交相呼应，瞧见彩云低飞，妄图扑进这旖旎的花野。
//
//至于为何现在的彼岸花花叶齐绽，为何这里的景色一片灰白，无比黯然，那就是一个极古老的故事了，古老到我们都回想不起完整的全部了。
//
//在那个连神都不多见的时代，我们便存在，我们曾长途跋涉，最终来到这片土地，寄宿在彼岸花里。一开始我们没有名字，也不知道什么是名字，我们仅仅是陪伴在一起，看那云雾奔涌，阳光过隙，那真是无比欢愉悠闲的时日。
//
//有一天一位神明漫步到这里，他惊叹这眼前的绚丽，不禁心生爱怜，祂唤来了生活在这里的我们，祂赐我们名字，花妖叫曼珠，叶精叫沙华。祂将我们的意志散布在每一朵彼岸花中，命令我们只要这片土地的任何一朵彼岸花生根发芽，我们就要轮流守护。后来，沙华成为彼岸的叶子，曼珠融入彼岸的花。无论黑夜白昼，哪怕凛冬炽夏。我们便就此分别，去守护神明所期望的永恒。
//
//不过曼珠从未想象过和沙华永远离别，而沙华也相信会与曼珠再次相遇。 我们知晓永恒本是缥缈，我们明白神明的意志终将消弭，那一日，这桎梏般的使命将破碎，思念不再是不可僭越的天堑。
//
//但时间的奔流无情且永不停息，在漫长的岁月中我们昔日共同的记忆被一点点剥离,尤其是在黄昏亦或雨日，我们会倍感孤单无助。
//
//我们试图再度建立联系，但曼珠寄给沙华的信封被风吹走，沙华拜托鸟儿给曼珠的口信被花海淹没；曼珠会坐在花朵上望着天空嘟囔沙华的的名字，沙华倚靠茎叶旁茫然四顾回想曼珠的模样。慢慢的，曼珠会怀疑沙华是否只是自己曾经孤独生活恒久而臆想的幻影，沙华也会怀疑曼珠是否只是夜里酣睡呈现且难忘的美梦。
//
//这就是永恒的代价，仅仅是为了神明的意志，毕竟这花野几乎无人所至，知晓它如此美丽的也不过是跋涉的飞禽。现在回想起，也觉得那维系永恒是些许可笑的。在那千万年的光阴里，我们看的是同一个太阳，一个是朝阳伴着葱郁的新叶，一个是夕阳映照殷赤的鲜花；我们看的是同一个月亮，一个新月同着明星共舞，一个满月明耀苍穹正中。我们存续于一个世界，却忙碌与各自的时间，我们抱着期待相守，却是太久不曾谋面。
//
//忽然间，我们的思想冒出同一个念头，既然是轮流守护，那在曼珠代替沙华的时间，我们是否能多提前一些驻足等候重逢？最后，在那百年前的秋日中，我们不约而同的相遇了。因为我们的意志早已化作彼岸花的花与叶，那一日遍地的彼岸花都花叶同放。很抱歉，我们想形容那时的情景，但当时的景色用世间一切语言的词藻修饰都是苍白无力的，尤其是在我们眼中那未目睹的奇异之景以及惊默着站立的对方。只能说是万物缄默着，时间明明上一秒还在奔腾，现在便化作坚冰，甚至可以看到它凝固时宏伟的身形。相反是这彼岸花的红色与绿色，这殷红碧绿仿佛在恍惚间将这里融化了，升腾的水汽温暖地氤氲着。
//
//但不要忘了，神明无所不知。祂挥了挥手，在虚无中豁开一个洞口，将时间的纵横看得明晰，便知晓了事情的全部。祂应该是心软了吧，神明也会有感情对吧，祂容许了我们重逢，容许这片土地的彼岸花可以不再经受花叶永别之苦。但作为违反命令的惩罚，祂剥去了这片大地上的一切缤纷。 刺眼的灰黑色从天幕坠下，大地刹那一片黯然。
//
//此后的一切便是你们所见的样子了，灰黑色的大地苍穹，还有遍野违和的长着叶子的彼岸花。阿，不要为我们悲哀失去了曾经那个美丽的世界，它已经换来了我们现在永远永远的重逢，现在再无曼珠或沙华，只有我们，我们就是曼珠沙华。
//
//
//好了，故事结束了。
//
//
//是的，我们就是故事的主人公。
//
//
//
//
//你是说那个被埋葬的旅者吗，他来到这有一段时间了，不过是不久前被我们安葬的。
//
//他的妻子？那这是我们施下的幻象，因为他对他的妻子实在是太思念了，那情感已经溢出了他的心灵充斥到空气中了…这让我们想起了曾经那段孤独的日子，所以我们决定这么做，放心吧，从那之后他满心喜悦幸福，最后含笑而终…是的，这片土地让你们感到幸福都是我们的杰作。
//
//如何离开？啊，让我们想想…还是很简单的，怀着真正的希望、喜悦、幸福，默立在花野上，说“我是如此幸福”。
//
//还是有些紧张？没事，慢慢来，想想你所经历的幸福的事情，或者仅仅只是把我们以及那个旅者的故事共情地读一遍就好了。
//
//
//作者信息
//脚注
//1. 该特工在进入该层级之前曾失去了自己的一位至亲不久
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1082{}