//Level C-89
//评分: 
//+14
//+
//–
//X
// 
//
//生存难度：
//
//等级Ψ
//
//不安全且不稳定
//精神危害
//存在未知实体
//MOSHED-20-34.jpg
//唯一一张Level C-89的照片。
//
//C89-1.png
//一张由流浪者绘制的Level C-89内部构造图。
//
//Level C-89是后室C层群的第89层。
//
//描述
//Level C-89是一处由许多破败的房间所组成的层级，每个区域分部如图所示，其中R代表房间，黑色箭头代表房间延伸的方向。每个方向延伸的房间数量均不同。这些走廊和房间内部有许多刷有白漆，但几乎都是画有各种诡异图案且成片脱落的混凝土墙壁。天花板由木制结构组成，但均已出现破洞或坍塌。许多房间内部如同被火烧焦般充满了燃尽物的粉末，也有房间出现了被水浸泡后发霉的痕迹。
//
//走廊中间堆满了各种杂物1，有时流浪者甚至会被高大的杂物挡住前进的道路。部分区域的湿度异常温热潮湿，空气闷热稀薄，不适宜流浪者久留。建议流浪者穿着特制衣物并及时补充杏仁水水分，防止在其中脱水。
//
//Level C-89天空会散发出紫红色的光，在本层级中拍下的照片会受到强烈干扰，从而出现各种不稳定失真。[更新于201■/2/28]本层级内已无法进行拍照。在本层级的光照中停留超过五分钟，会导致浑身燥热，同时出现类似于躁郁症发作的行为，患者会试图不停的避开所有紫色光线照射到的地方。若照射时间超过十分钟，则流浪者会留下永久的“恐日症”精神障碍，终身不得看见阳光。本层级内还存在某种未知实体，会在流浪者滞留大约12小时后出现，该实体呈一种不规则大小的“恐怖黑影”2，会不断的在各个走廊穿梭，且只能由特定的流浪者所看见。这种实体虽然不会为流浪者带来实质性危害，但却会让流浪者时刻处于高度戒备状态，导致流浪者精神崩溃。
//
// 
//有许多装备精良的流浪者团队坚称，在它们走到离入口处某个约500个走廊远的地方，在一个过道的尽头3出现了一片蓝色的亮光，其中的景色为严重失真的地球太空站景象，而它们坚称那里是通向前厅的出口。但不知为何，那些出口在流浪者靠近后，都会因为种种原因离奇消失。即使如此，M.E.G.仍然能源源不断的收到许多流浪者的目击报告。目前，M.E.G.已派出“踪迹制图者”分队进入进行详细调查。
// 
//
//流浪者准则
//鉴于Level C-89的精神危害性，此处将列举流浪者在本层级内的行为准则。
//一、请勿探索超过入口20个走廊远的区域，其中有极其严重的天花板坍塌漏光情况。
//二、请勿在本层级逗留超过12个小时。
//三、若流浪者出现了精神异常，请迅速服用大剂量杏仁水以保持精神稳定。
//四、请勿相信一切关于“前厅”和“地球太空”的传言。
//五、尽快找到出口，离开这里。
//
//基地、前哨与社区
//M.E.G. “紫光探险者”前哨站一号站
//由10人组成。
//在入口处约5个走廊远的位置。
//用以给予流浪者物资以及帮助流浪者离开Level C-89。
//M.E.G. “紫光探险者”前哨站二号站
//该前哨站不稳定。
//在入口处约80个走廊远的位置。
//用以接应“踪迹制图者”分队，目前情况不明。
//入口与出口
//入口
//
//在Level C-6的一个散发着霓虹灯的小巷中被光线照射后进入Level C-89。
//从Level C-70的“电子沙滩”旁的水下进入Level C-89。
//从Level C-136的大厅中进入Level C-89。
//当流浪者在Level C-166的麦田地离躺下超过十分钟后，将被传送到Level C-89。
//出口
//
//在第一前哨站的指引下走进一个发着金色光的房间内停留约1小时，流浪者将被传送至Level C-20
//上述出口有极小概率会将流浪者传送至Level 0。
//作者信息
//« Level C-88 | Level C-89 | Level C-90 »
//
//Footnotes
//1. 其中多为各种大小封闭的木箱或铁箱。
//2. 许多流浪者声称这些黑影带给了它们极其强烈却又不知来源的恐惧感。
//3. 即图片内红色箭头所指示方向。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1089{}