//Level C-36
//评分: 
//+21
//+
//–
//X
// 
//
//生存难度：
//等级 1e - 环境
//
//安全且稳定
//无有害实体
//非实体危害C361.jpg
//Level C-36小村的外景。
//
//Level C-36是后室C层群的第36层。
//
//描述
//Level C-36是一处山地，边界暂未探明。山地之间存在一些互相隔绝的小型平原，某些平原之上会出现一些几栋房屋的聚落（下称乡村），数量大约在5~10间，其造型大多为欧洲滨海小镇，年平均温度稳定在24℃。该层级的白天与夜晚时间不相同，前者为4个小时，后者则长达18个小时。
//
//每个乡村的房屋被探明其中具有一些基本的装修和家具，但并未找到任何电子设施，这可能与本层级无原生Wi-Fi有关。房屋由搭砌的砖块组成主体，外表面刷制了各种浅色的不知名油漆，阳光照射在墙壁上会产生耀眼的反光。
//
//C362.jpg
//Level C-36建筑物的一角。
//
//除了房屋，一些稀疏的乔木也会散落在地势较低的平原，上面生活着无足鸟。河里的水已被证明为一种具有强烈反射光线功能的无色液体。雪山上的白色固体即为该种液体的固态。
//
//在白天，Level C-36与寻常景观无显著差别。但在傍晚，群星会在东方迅速出现，然后遍布整个夜空，在仲夜之时，甚至会从天上如同雪花一般纷纷落下，宛如飘零的彩带。这种星辰密集的聚集在一起时，具有强烈的致幻性，任何人目视其超过30秒都会进入迷惑状态，
//
//具体情况表现为：
//
//在街道上漫无目的的抬起头游荡。
//无法听见任何声音。
//走路姿势如同醉酒者。
//虽然在白天到来后，这些症状会缓慢消失，但仍然不建议流浪者夜晚时望向天空。即使那些星辰确实很美。
//
//M.E.G.的精准救赎部门在此收集制作好梦罐的原料，收集这些逸散的星辰以便用于装在罐中，并带回基地用于与其他组织进行交易。因此，如果流浪者来到了本层级，可以向这些工作人员申请救援。
//
//C363.jpg
//Level C-36的傍晚。
//
//实体
//一位名为“星辰漫步者”的星云，只会在深夜出现。在其在湖边漫游时，会有许多星辰围绕它的身体旋转变化。它的动作轻盈柔弱，曼妙缠绵，犹如下凡的天使。当它出现时，似乎一切声音都为它而沉寂，它成为了这片世界的中心，用风流旖旎的身姿展现星辰之美。在日出前3小时，或有人走进了以它为中心的半径300米左右的区域内时，它就会在湖边消失，同时星辰也会恢复浮游的状态。因此，其真正形态无从知晓。
//
//基地、前哨与社区
//M.E.G. 精准救赎部门“ST”站点
//由大约80人组成，收集散落的星辰用于制作好梦罐，每隔30天与基地进行物资交换。
//“夜世界”夜行者分部
//仅有3人，与“夜世界”组织有关，似乎是其派出用于调查本层级的人员，他们出没的时间不定。
//入口与出口
//入口
//在Level C-69中找到一个闪耀着光芒的水潭，即可来到本层级。
//在Level C-107内的山坡上有时能看到一个发着光的门，穿过即可达到本层级。
//有时从Level 63掉落后，会来到本层级。
//出口
//在持续1个小时的正午时间内，在一片有雾的森林里行进3公里左右，即可到达Level C-71，但也有极小的概率进入深红森林。
//在夜晚，请不要在任何茂密的森林中停留，因为有很大的可能流浪者会被传送至Level 14。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1036{}