//Level C-63
//评分: 
//+13
//+
//–
//X
// 
//
//生存难度：
//等级 2
//
//存在隐患
//间隔稳定
//未知实体
//Level C-63是后室C层群的第63层。
//
//描述：
//landscape_scotland_isle_of_skye_old_man_of_storr_morning_sunrise_nature_highlands_and_islands-771557.jpg!d
//清晨时的Level C-63，最初被发现时
//
//Level C-63是一处被海洋隔绝的群岛，由面积不一的几座岛屿构成，目前已被探明的面积粗略计算为140000平方公里，有着无规律的昼夜交替，是明显的热带气候，但此处自然生长的动植物却并不完全符合热带特征。此层级地形起伏不定，是属于支离破碎的山地丘陵地形，存在淡水泉水和较多溪流。最初被流浪者发现时，Level C-63处于渺无人烟的荒芜状态，其上没有任何人类活动的痕迹，地表生长的植被大多是温带甚至寒带普遍生长的青草，灌木，零落稀疏的树木，少有热带应有的热带植物。群岛上生活的动物种类稀少，没有任何实体，仅有少数植食性动物以及寥寥几种无害昆虫。周围的海域拥有丰富的热带海生动物种群活动，时常可目击歌鲸，但不存在其他掠食性鱼类及危险海生动物。
//
//异样海潮：
//Level C-63在正常状态是安全的，但在无规律的时间间隔中可能进入异样状态。当此种事件发生时，层级内天空的颜色将变为令人高度不安的怪异蓝色，整个层级的海面上将渐渐升起一层可见度极低的雾霭，待24小时-72小时的时间内，雾霭散去之后，层级连同其上的所有生物将消失。
//
//mackerel_sky_moonlit_night_cloud_superman_night_moon_blue_night_view-1092778.jpg!d
//Level C-63异样状态开始时，海水发生变化
//
//而在层级内部人员的视野中，浓雾消失后，周边温和的海洋逐渐变为了与天空相同颜色的形态，海水不再透明，难以目测其中的活动，而且海水中漂浮着类似大量棉絮状的物质，此时海中充满了未知的高危险性生物，外形极端扭曲可怖，似乎无时无刻不在进行酷烈的生存斗争，互相吞噬。未知生物的体型种类从普通鱼类大小到数十米的大型生物都被频繁目击。此种情况下靠近海岸是极其危险的，因为海洋危险生物随时可能从水中跃出袭击过于靠近岸边的人员。且威胁性极高。海浪也会相较平常更加剧烈，随时可能危及海边的正常生物。
//
//由于目前尚未证实是此种状态下海洋本身的异常影响，还是正常的心理状态，当层级变化事件发生时，哪怕是经验最为老练的流浪者，或是大型组织经历过致命危险的探员都会不约而同的产生对海洋的彻骨恐惧。绝不愿接近，甚至是将视线触及海洋。导致目前完全无法对异样事件发生时的海洋做出更深一步了解。
//
//整个事件过程持续时间为30-55天，其后浓雾将再次升起，同样24-72小时不等的时间后，雾霭消失，事件结束，海洋重新变为正常，在层级外的人员眼中，层级重新出现。
//
//值得注意的生物：
//雕角羚羊：
//Level C-63中的野生种群，生物习性与前厅中羚羊基本相同，但是此种生物生长着与象牙质地相近的角，且会如同鹿茸般随着生长自动脱落，被人工切割下也不会对动物本身造成伤害，且双角会随时间再生。雕角羚羊有着十分强大的攀岩能力，甚至可与岩羊相比。与前厅各类羚羊相比，雕角羚羊对人类没有那么强烈的应激反应，熟悉后甚至会与人类亲近。
//
//银杏鹿：
//一种毛皮质量极高，通体银色的鹿类食草生物，同样，与前厅中的鹿群种类没有太大差别，但因为气候原因，它们习惯生活在层级中的阴冷区域。此外它们拥有价值极高的银色毛皮，甚至比前厅一些堪称‘软黄金’的高档毛皮质地更为优良，这也导致它经常受到捕猎，不过因为银杏鹿的繁殖速度较快，目前保护其种群数量的事件属低优先级。
//
//卡罗兰鱼：
//蓝白条纹相间的，30-40厘米长度的中型鱼类，经常以小群在Level C-63周边海域活动，很容易与其他鱼类一起捕获，卡罗兰鱼的肉质极其鲜美，含有多种人体必需的矿物质和维生素，且容易烹调，鱼刺极易去除，甚至无需任何调味料，简单的做法就能够非常可口，所有品尝到卡罗兰鱼的流浪者不论其口味癖好如何，都评价为‘非常美味’‘特别可口’如果其中加入一些调味品，肉质和味道将更加美味。但是在食用前必须去除所有鱼卵，卡罗兰鱼的鱼卵味道比鱼肉更加美味，但存在致幻的化学物质，被大量食用后几小时内，或在当晚的睡眠中，人员会产生严重幻觉，此种行为导致的后果通常有害，甚至可能导致死亡。
//
//其他：
//经过大型组织勘探，层级的土地非常适合进行香料等热带植物种植，很快，Level C-63成为了香料和其他热带作物的种植区域。此外针对层级中存在的特有物种，同样有经济组织和流浪者看到了其中的商业价值，加上层级属于群岛地形，数量众多的人员迁入后，建造了交通设施，岛屿之间之间以桥梁或船只交通，且能与多个大型人口聚居层级联通，更多的流浪者迁入此层级，层级本来没有Wi-Fi信号，但随着定居者数量增加，层级中不明原因出现了稳定良好的Wi-Fi信号，但范围有限，基本出现在有人长期居住的房屋内，大型人口聚居处，和人员频繁聚集的建筑物内，使本来完全荒芜的Level C-63日益繁荣。层级内的土地种植花椒、胡椒、八角茴香、肉桂、豆蔻、大料、香叶、橄榄、迷迭香等香料，以及棉花，茶叶，染料，咖啡，烟草、可可、甘蔗等作物。建立雕角羚羊和银杏鹿的饲养及狩猎场，定期收获象牙质地的羊角、肉类及高档毛皮。此外层级内存在蚕和一种无尾针的温和蜜蜂，一些组织和流浪者做了充分准备把蚕丝制为丝绸，以及出产蜂蜜。岛屿区域附近的浅海海域中贝类生物丰富，且蕴含珍珠的概率很高，被发现的珍珠品质圆润巨大，晶莹通透，属于高质量品种。同时也因拥有相对正常的海洋，所以可收获丰富的水产。层级中发现了富含的金矿、钻石矿、宝石矿和内陆盐矿，此外B.N.T.G.也建造了一座大型的海边盐场，所以层级目前能够出产食盐，黄金、钻石和宝石。更令人惊喜的发现是层级内部的山脉发现了高质量的瓷土，Level C-63生产的瓷器已经销售到后室各层级，以上的一切都让Level C-63成为了一个昂贵的层级。
//
//需要说明的是，Level C-63中的矿脉虽然含量丰富且数量众多，不过并未有组织或流浪者独占，任何流浪者均能进入矿场通过自己的工具开采贵金属和钻石。同时除饲养及狩猎场外，层级内仍有大量动物属于野生状态，所有流浪者均可自由捕捉这些动物，但此层级制定了关于狩猎的规则，规定了每次捕猎的数量和禁猎期，以避免层级动物遭到过度猎杀。由于Level C-63的富裕资源，导致层级内的商业活动异常繁荣，大量组织和流浪者个人与此层级进行商业贸易，相当数量非定居的流浪者都可能短期来到此层级，在有限的土地进行短期耕种，或是在近海从事捕捞珍珠，或是在矿场寻找黄金、钻石、宝石，以及尝试捕猎一些昂贵动物猎取毛皮或象牙质地的角，期望能够在较短的时间内收获一笔可观的财富，但由于Level C-63的性质，这些活动不会一直顺畅进行，可能面临安全威胁。
//
//关闭Level C-63危险事件整理（1）：
//2017.7.12 第一次事件
//
//此时层级勘探接近完成，已经陆续有流浪者迁入本层级，当日异样事件第一次发生，由于不知事件危险性，一些流浪者出于好奇心查看海洋异动，M.E.G.的勘探小队也在此时出海返回，靠近海岸的流浪者很快遭到危险生物及海潮袭击，因伤致死或被海浪卷走，而M.E.G.勘探小队再未返回基地。
//
//37天后，事件结束。新的流浪者和大型组织探员登上Level C-63，发现幸存的流浪者受到了饥饿侵袭，依靠岛上动物、蜂蜜及淡水维生。所有幸存人员均对海洋产生了极度恐惧，经长期心理辅导有所缓解。
//
//勘探小队及所有失踪人员被推定死亡。
//
//关闭Level C-63危险事件整理（2）：
//2018.3.2 第二次事件
//
//一名流浪者渔获了卡罗兰鱼，夜晚烹饪时发现了卡罗兰鱼肉质的鲜美，于是他次日邀请了大量好友开办派对，12名流浪者大量食用了卡罗兰鱼的鱼肉及鱼卵，几小时后所有食用者开始出现严重幻觉，一些人员走到高处坠落，另一些则导致了跳海行为，但其他人员只是漫无目的的穿行，其中一名人员在做出跳海行为之前被及时解救。
//
//待幻觉消失后，询问幸存人员，表示在幻觉中有一个极美丽的地点在呼唤他们过去，此种行为通常导致死亡。此后证实卡罗兰鱼的鱼卵内存有致幻化学物质。
//
//此次事件有3名流浪者幸存。
//
//关闭Level C-63危险事件整理（3）：
//2020.11.18 第三次事件
//
//一艘中等容量货船满载香料，咖啡，黄金，钻石等货物准备出港，但此时海岸升起薄雾，预示着异样事件即将发生，其他大型组织人员及流浪者准备上岸躲避，但这艘货船的船长不愿承担交货延期和货物可能变质、受潮的损失。不顾他人劝阻执意出海，尝试在事件发生前的短时间内到达安全区域，船只很快消失在薄雾中，很快异样事件发生。货船的目的地层级未发现货船及其船上任何人员返回。
//
//所有人员、设备、货物推定已损失。
//
//关闭Level C-63危险事件整理（4）：
//2021.5.26 第四次事件
//
//此时Level C-63的商业活动愈加繁荣，更多人员长期迁入此层级，同时更多人员在此地短期停驻从事商业贸易，当日大量如往常运输食品、生活物品、工业品、能源的商船抵达以交换奢侈品、贵金属、珠宝、香料。但在繁忙期间一队五艘武装船只编组的海盗船对港口发起了袭扰，由于未对此类事件有预案以及人员大多没有携带武器，导致了大量流浪者的死亡和被俘，港口受损，大量货物遭到抢掠。事后各组织花费了大量赎金来赎回自身成员和一些流浪者
//
//事后层级加强了港口、码头的防御设施，且大大提高了武装人员数量，并对海盗可能的藏身处进行搜索。
//
//关闭Level C-63危险事件整理（5）：
//2022.10.20 第五次事件
//
//层级内发生了严重的暴力事件，起因是钻石矿内发现了一块体积很大，价值连城的钻石原石，被发现后相当数量的流浪者都想取得此块原石，导致了谩骂、争抢、斗殴，最后发展成严重的械斗事件，由此导致的愤怒情绪传染了邻近的钻石矿坑，以及附近的黄金矿坑，众多流浪者都不明所以的卷入了械斗，用手边的所有工具攻击任何人，由于没有得到及时遏制，最终约定俗成的规则和组织制定的纪律荡然无存，导致了整个层级的暴力事件。整个晚上，许多大型组织成员及流浪者莫名其妙的遭到攻击，不少人员还在借机对平时的不满者发泄私愤，相当数量的农田被纵火焚毁，大量人员整晚都在抢劫物品，砸毁设施，攻击人员，甚至导致了整个层级的多处火灾。由于M.E.G.并未在此处设置机构，而其他大型组织又缺乏处理能力，结果导致事件一发不可收拾。最后只能由无可奈何的B.N.T.G.派出了一个整编分队的战斗步兵，直到第二天黎明才算基本平息了事件。
//
//“想不到后室里还能发生这种事，当时还以为能活着就不错了。对了，那块石头呢？”（来自一名B.N.T.G.中阶主管的附注）
//
//基地、前哨与社区
//B.N.T.G.奢侈品集散中心“东方航线”
//B.N.T.G.在C层群的主要基地之一
//管理人员、员工、武装人员超过1000人，拥有一处功能完备的建筑群落，拥有大量的防御设施，对可能的武装袭击做出严密的防范
//拥有40000平方公里土地种植香料和其他热带作物，以及层级动物饲养场，定期收获象牙质地的角、毛皮和蜂蜜
//建造加工设备，从而能够生产丝绸、瓷器、珠宝。此外，还拥有一座海边盐场
//组织中等规模的矿工队伍，长期在贵金属矿场内开采
//建造了两座大型仓库，储存食品、生活物品、清洁品、药品、杏仁水、火盐，为可能异样事件发生时，由于层级不种植粮食作物，海洋亦无法提供食物，避免整个层级的饥荒和物资短缺。当然，这些服务并非完全免费
//完全开放贸易，从层级外进口食品、杏仁水、火盐、生活物品、工业品、清洁品、药品、服装，出口香料、染料、咖啡、棉花、茶叶、烟草、可可、甘蔗等作物，以及象牙质地的角、毛皮、珍珠、水产、蜂蜜、食盐、丝绸、瓷器、黄金、钻石、宝石等奢侈品
//红星建筑队第十支队
//建造了除大型组织基地外所有设施，包括水电、燃气、道路、房屋、公共设施、港口和众多码头
//大约3000人长驻Level C-63
//为短期居住的流浪者提供住宿区域和廉价食物
//欢迎流浪者加入，并准备随时根据需要扩建设施
//淘金者公司
//一群流浪者自发成立的商业公司
//目前大约有600名成员
//拥有16000平方公里的土地，种植作物和饲养动物
//同样组织矿工开采贵金属和钻石，以及依靠自身设备生产瓷器和丝绸
//同其他层级贸易，以热带作物及奢侈品交易食品、杏仁水、火盐和工业品
//拥有贸易船队和商业航线
//后室娱乐‘原料’哨站
//据有一处面积狭小且封闭的3平方公里区域，周围建造视线遮蔽物阻挡
//大约只有20名成员
//对外声称种植愤怒胡椒和说唱烟草
//定期以船只运送货物至Level C-70
//未知的海盗湾
//出没不定的海盗武装舰队，可能劫掠来往商船
//传言拥有一座坚固的堡垒，地点未知
//人员数量不明，但据几次武装冲突估计至少存在300人以上
//定居的流浪者
//不属于任何组织的定居流浪者
//定居在Level C-63的流浪者大约4500人，此外还有数量繁多的短期居住者和小型组织
//划定自己居住的房屋和土地，从事热带作物种植，或是动物饲养、狩猎和近海捕捞，或是在矿场内单独劳动，开采贵金属、钻石和食盐
//经常搭乘其他组织的船只，亦或是稍富裕的流浪者拥有船只，与层级外进行贸易
//入口及出口
//向西北方向航行2000海里可抵达一片荒芜的河流出海口，由此逆流而上可抵达Level C-34、Level C-28、Level 11
//向西南方航行1600海里可抵达Level 230
//向正东方航行，直到景物风格逐渐变为电子化，太阳处于日落状态，海水带有蓝色荧光，即抵达Level C-70
//未经证实的流言称，如果在异样事件发生时顶住了危险生物的侵袭，航行未知的距离后，能够到达Level C-51，且不可返回
//以上除特别标注的出口外，为稳定的双向通道
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1063{}