//Level C-37
//评分: 
//+14
//+
//–
//X
// 
//
//生存难度：
//等级 5
//
//不安全
//稳定
//实体横行
//Level C-37是后室C层群的第37层，是由大量毁坏的城门与锈蚀的铜制骆驼构成的荒漠废墟。
//
//描述：
//Level C-37的时间段永远处于黄昏即将到达夜晚的时间段。空气中充斥着无法散去的暗红色的沙尘，可见度较低，是红荨麻(Entity C-46)的来源地。空气质量极低，进入请随身携带空气过滤防止吸入红荨麻分泌的烟雾以及沙尘。
//
//“灼烧般的辛辣和悲伤的苦涩回荡在我的胸腔，我仿佛能听到空气中远远传来若隐若现的牧笛声。那声音就像是有魔力一样让我不由自主的向着声音的源头走去,走向那些直直通往天空的歪斜柱子。”
//
//Level C-37的地面不均匀的混有细碎的生锈金属残骸并在损坏的城门附近呈现大量堆积。铜骆驼存在于损坏的城门附近，外观通常被严重锈蚀且大量向着空中堆叠并伴随有荆棘和红荨麻生长在其缝隙中，其中的铜骆驼都呈歪斜倒地的姿势且怪异的能维持一个平衡的状态让它们的堆叠不会倒塌。
//
//“那些斑驳的废墟如同墓碑一般歪斜着，被永远无法落下的夕阳映照着拉扯出狭长而深邃的影子，铜制的骆驼歪斜堆叠着，在荆棘中用它锈蚀的身体堆叠成手的样子挣扎着伸向天空。那些深红色的荨麻更像是凝固在其中的血液，在铜锈的缝隙中盘踞辗转，随着萧瑟的风沙颤抖不已。”
//
//Level C-37目前被发现的大部分废墟城门早已风化并有倒塌趋势，底部被荆棘以及红荨麻支撑着，除了铜骆驼还能在城门附近偶尔能发现少量的维罗尼卡婆婆蓝（Entity C-47），它们的底部通常能挖掘出对于大小的木质匣子。即使外部损坏严重也不会影响到内部的物件，里面通常会有装着少量杏仁水的皮革制水袋和坚硬的干粮，或一些严重锈蚀风化的铜镜，木梳等一些小型生活物品。
//
//“我不由得伸手去摸了摸那些如同血液般殷红的荨麻，那种感觉火辣辣的在我的指尖燃烧，就像是我小时候在田野间因为无知而接触荨麻的感觉很像，在那之后我哭着低下头，余光里全是明亮的蓝天。恍惚间能听到有什么稚嫩的声音在呼唤我，这让我想起了很久以前的玩伴，他也是这么呼唤着我去水塘附近去抓蛐蛐和泥鳅。我们总会躺在水牛的背上去看着夕阳缓缓落下”
//
//Level C-37的少部分城门并没有倒塌且附近并没有铜骆驼并在其附近生长着维罗尼卡婆婆蓝。通常这种区域空气质量已经可以呼吸并驱赶红荨麻散发出的气息，较为安全并且会有少量物资补给，但在某件事情之后不适合长久定居。
//
//“我的玩伴告诉我我们要一起去抓虫子，去抓那些在地上跑的蚂蚁。然后将它们放飞在明亮的空中，就用手上的网去抓住他们。让他们看看那美丽的蓝天，和蓝天之上的东西。那时候我们总结伴而行，一大群孩子一起去抓飞在天空和菜地间的蝴蝶，或者抓了蛐蛐后围在一起让它们打架。我轻盈的迈动着步伐往前走着，面前那只黑色的大虫子明明没有锋利的牙齿也没有，却还是冲着我龇牙咧嘴。”
//
//Level C-37在某次探索之后拥有了某种特性，在其被红荨麻蛰上并染上气球病的人会被吸引，并如同被操控般聚集起来并袭击没有感染的人，即使这并不会减轻其病况。在此期间唯一的幸存者只有其中一位前来研究红荨麻的人员。据其所说在此地感染气球病的病情加重速度会更加快速。
//
//“虽然没有抓到那只黑色的咬人虫子，捕虫网也不见了，但是我也感觉很轻松，那只抓不住的黑色虫子不动了。但是比这更重要的是，天空近在咫尺，只要我轻轻一碰就能飞起来，我会飞起来的，对吧，飞向那明媚的蓝天。我的玩伴告诉我们，天空很美，很美，有比星星还要美的烟花。那烟花并不烫手，却能在空中绽放美丽的光芒，我要去往天空，我要看到烟花了，只要我不断的上升，上升，这样我就能飞起来，穿过这片烦闷的红色沙尘，看到那温暖而美丽的夕阳。”
//
//关于某件事情
//当时我们得知有一队人在Level C-37失踪后就开始着手在其调查，但不幸的是我们到达的时候已经搜索不到幸存者的踪迹了。我们只能在荒漠和废墟之间穿行着，直到一个小时后，我们才发现有人失踪。我和威廉姆斯立刻警觉起来，但是并无所获。甚至我还因为扭伤而无法快步行动。
//
//直到我们到达那个长满维罗尼卡婆婆蓝的城门附近稍作喘息才发现远处有人影，他们不知道什么时候找了回来，但是仿佛变了一个态度一般拿着武器向着我们摇摇晃晃的冲过来。威廉姆斯把我藏在了那些蓝色的小花里，我才得以看到那时候发生的事情。我回想起来我捏到他的手腕却没有感觉到骨骼…或许他早就被那种植物感染但是还是保持着正常。**
//
//但是，我能隐隐约约看到那些人后面有什么东西，就像是融化中的胎儿一样，暗红色的液体在它的身上滴落下来，我立刻想到之前失踪的人里面似乎有孕妇…或许那种植物会让胎儿发生可怕的变化，就像是现在这样。
//
//搜集自陈梓燕的部分记录
//
//基地，前哨站与社区：
//由于此地不稳定的性质，该层级暂时没有已知的基地或社区。
//
//入口与出口：
//入口：
//手握一块生锈的金属并尝试卡出大概率会到达Level C-37
//尝试在C层级任意地方碰触锈蚀的雕像，门栏都会到达Level C-37
//天空，天空，天空，天空，天空，天空，天空
//出口：
//在没有倒塌的城门门口用手指在城门上轻轻划过就能回到原本来时的地方
//挖出八音盒残骸并转动就能到达Level C-198
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1037{}