//Level C-70
//评分: 
//+56
//+
//–
//X
//
//点击此处以登记您的访问信息
//
//
// 
// 
//
//生存难度：
//等级 0
//
//安全
//稳定
//特定群体宜居enter.jpg
//一个进入Level C-70的入口。
//
//Level C-70是后室C层群的第70层。
//
//描述
//Level C-70是一座具有合成器风格的大陆1。在这片大陆上，生活着许多有许多激光网格的多边形拼贴而成的立体实体，由于其边数过少，因此该实体的样貌无法确定。当流浪者进入本层级时，其身体也会散发出霓虹色的光线2，并成为一个移动的光源。根据长时间观察，这种光线似乎是在某种效应下，流浪者本身具有的“人体辉光”被急剧放大导致的。
//
//Level C-70内似乎无法通过太阳等天体分辨白天和夜晚，太阳总是会处于日落状态，并以一种奇异的风格停在空中。在本层级内，若地表不断移动的霓虹线网格从紫红色变为黑绿色，则说明此时进入了“夜晚”3。在夜晚，天空中的太阳发出的光线会明显变暗，天空中会不时出现一些激光流星射线束，其样式如同延时摄影下的星空。
//
//本层级不存在任何符合常规景象的自然景观，但M.E.G.仍然整理了一部分该层级的生态群系分部参考。
//
//电子沙滩，位于入口东南方向。有许多电子化的椰树和由粉色颗粒组成的沙滩，海水带有淡淡的蓝色荧光色。海水之下大约200米处有不知名的巨型光源，因此不建议流浪者下潜更深的海底。
//艺术殿堂，位于入口正北方30千米左右处。一座帕特农神庙式建筑矗立在平原，占地面积约为4000平方米，走进殿堂，其中有许多石膏雕刻人像，大部分石膏雕像的内容为古希腊著名人物的肖像。
//信息原野，位于入口西南方向。此平原之上会不时产生一些样式类似于计算机操作系统“Windows 2000”的信息窗口，其中显示出一些不明所以的乱码和各式各样的纯色色块。这些窗口并无实际体积，会在出现后1个小时内自行消失。
//日落城市，位于入口西方2千米左右。是一座由“后室娱乐”组织建立的霓虹城市。其背景为一轮黄色的太阳日落时的场景，故得此名。
//shop.jpg
//一处日落城市的商店。
//
//Level C-70是“后室娱乐”组织的基地，该基地在本层级的一处山谷中建立了一处城市，其中居住着其组织的成员和外来的流浪者。由于此组织与M.E.G.交流甚少，因此将该层级暂定为“生存难度0”。在“后室娱乐”组织当中，除了人类成员以外，还存在一些实体在其内部工作，比如无面灵、猎犬、死亡飞蛾，但其并无在其他层级时所表现出的危害性。
//
//“后室娱乐”组织的总负责人保罗-西蒙斯会为组织进行代言，并放出各类的艺术海报，以吸引更多人加入该组织。目前，该组织所展开的对外活动除了推销其产品外，并未发现更多有关的行为。M.E.G.已在严密监督该组织的任何举措，并在必要时实行军事行动。
//
//Paul%20Simmons2.jpg
//保罗-西蒙斯的海报。
//
//基地、前哨与社区
//“后室娱乐”组织总基地
//位于日落城市之中，居住了超过10000名成员，成员的行动轨迹变幻莫测。若一名流浪者拿着其宣传海报寻找他们之中的专业招募员，则该流浪者可以在进入组织之前得到一个房间和生活物资，以便在“试用期”内使流浪者定居于此。
//
//B.N.T.G.“霓虹”交易站
//位于日落城市边缘，站点大约有20人，用于与城市内的居民进行物资交易，以及作为其组织在“后室娱乐”中的“大使馆”。
//
//入口与出口
//入口
//一般来说，在各个生存难度低于2的层级内都有可能见到一个用霓虹灯写有“ENTER”的大门，进入该门即可达到本层级。
//在Level C-38内的第2层b座某个游戏厅内，存在一扇可以固定进入该层级的门。
//在Level 11内的一栋以游戏厅为主题的大型建筑内可以找到来到本层级的门。
//在Level C-48内有时会刷新来到本层级的门，穿过该门即可来到本层级，但不建议流浪者以此方法来到Level C-70。
//出口
//在日落城市内的一个标有“中转处”的地铁站乘坐地铁即可前往Level C-61。
//作者信息
//« Level C-69 | Level C-70 | Level C-71 »
//
//Footnotes
//1. 合成器风格是一种艺术派系，紫红色调下的异形车、激光网格、霓虹落日是合成器风格的典型符号特征。
//2. 颜色似乎与其本身的属性有关。
//3. 因为在该情况下，层级内的平均温度会更低。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1070{}