//Level C-20
//评分: 
//+17
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
//环境威胁
//稳定
//少量实体cave-498373__480.jpg
//在Level C-20内拍摄的图像
//
//描述
//Leve C-20是后室C层群的第20层。
//
//Level C-20的环境类似于一个一个被部分开发的巨型洞穴，外观上类似于天然溶洞和人工矿洞的混合体，但向上挖掘或攀爬无法抵达地表，可能内部为向各方向上无限延伸，构成Level C-20的物质为土壤和岩石，但岩石部分并不符合已知的任何一种前厅岩石种类。其内部重力方向仍然为向下，尽管这很难解释为什么这种洞穴结构并没有因为其过大的体积发生坍塌。
//
//Level C-20并没有大多数的已知实体活跃，但有少量的车兽存在，可能是因为这里的矿物资源对它们而言是一种食物。同时在享乐战争爆发前曾有目击报告称本地发现了少量的扫兴客个体。
//
//Level C-20的洞穴结构具有一定自我修复能力，当在其中的挖掘结束后会以肉眼可见的速度重新生成土壤和岩石，并且完全填充完毕时的洞穴结构与挖掘前有一定差异。Level C-20的岩石结构中含有大量的矿石，并且均可加以运用，可以辨认的矿物包括：
//
//金属矿物
//煤炭等矿物燃料
//琥珀1和盐矿
//短时间内过多地吸入Level C-20的因挖掘产生的粉尘会造成呼吸道炎症，重则会造成死亡。这意味着进行长期的挖掘需要佩戴防毒面具。除此之外本地也存在一些并不安全、具有危险矿藏的地区，例如具有强放射性的铀矿藏。
//
//Level C-20内并无任何Wi-Fi信号，但制作电磁波通讯装置是可行的，并且在Level C-20内的任意装置的电磁波信号穿透力均并未发现其上限。
//
//基地、前哨与社区
//后室防御委员会
//这里是后室的安那其主义者的聚集地。
//无条件接受流浪者作为成员加入。
//有成型的工业体系，并且以这些工业制品与The M.E.G.交易他们所需的杏仁水和罐装龙肉等生存资源。
//与B.N.T.G处于敌对状态
//后室财团
//一个出售被他们占据和开采的矿物资源的大型集团。
//有成型的工业体系，以及一套独立的经济和货币体系。
//无条件接受流浪者作为员工加入。
//与后室防御委员会处于敌对状态。
//入口与出口
//入口
//通过进入Level 23内的一处溶洞到达。
//出口
//通过向上攀爬找到一扇岩壁上的木门离开，将进入Level C-158
//作者信息
//« Level C-19 | Level C-20 | Level C-21 »
//
//Footnotes
//1. 内部未发现杂质
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1020{}