//Level C-13
//评分: 
//+25
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//5d44d245e406affa.jpg
//Level C-13的入口
//
//Level C-13是后室C层群的第13层，可通过调整层级密钥进入
//
//描述：
//Level C-13是一个层数不定的，由钢筋和混凝土制成的旧式居民双跑楼梯间，水泥砂浆抹面。已通过直/卷尺、墨线、铅垂和工程经纬仪等工具测量出其楼梯施工尺寸。
//
//- 收起
//梯段坡度1为45°74'。楼梯平台上部及下部过道处的净高为2.2m。梯段净高2为2.5m。梯段宽度为95cm。每段楼梯的踏步数为14级。踏步高度为16.5cm，宽度为22.5cm。中间平台长度为1.3m，宽度为1.1m。扶手高度为1050mm。栏杆垂直杆间距为107mm。
//
//-3693917f8654e582.jpg
//一张照明损坏的Level C-13楼段的照片，最初由users：bluNa78 发布在数据库C层群专题版块
//
//Level C-13的建造时间无法确定，通过保养缺失情况（漆面磨损、栏杆锈蚀、灰尘累积）判断已有极长时间无人使用。入口处有一无法移动的推拉式铁栅门。内部存在一照明系统，反常地使用了声控与按钮混用的启动机制。不同楼层的开灯方式是随机且无关联的。某些楼层的灯具会随机性地无法使用。曾经有流浪者试图为本层建立自制的，更加稳定的公共照明系统。但遗留在该层级内的外来物质会在层级内所有流浪者退出后立刻丢失。鉴于后室中人力资源极为稀缺，难以委任稳定的维护团队，这一计划被放弃。
//
//Level C-13每层的楼梯平台上都容纳了两扇民用防盗门（有时候会出现部分流浪者报告在他们的探索中发现本应是门的地方只剩下浇筑成型的混凝土平面），但不确定这些门是否通向真正的居民房。任何开锁、拆除乃至破坏门的尝试都以失败告终。这些门一般是制式统一的，但偶尔会存在细节的差异（如门铃装置、装饰物、锈痕、涂鸦、凹陷）。门周围有时可以发现鞋架和迎宾垫，一般是陈旧且积灰的，可以在迎宾垫下面发现本层级的层级密钥。在极罕见的情况下，密钥会出现在鞋架上已经破损的鞋子中的鞋垫下方。
//
//Level C-13的层数每次进入都会发生变化。登记过的层数从6到213不等。
//
//Level C-13存在窗户，正对着另一栋高度无法测量的居民楼，其自然光环境恒定维持在夜间状态。试图从窗户离开的尝试会导致流浪者立刻切出本层级，回到他们在进入Level C-13之前所处的层级。
//
//部分流浪者报告在经过部分灯具损坏而缺乏光照的Level C-13楼层时，感到一阵的心悸和恐惧感，表现为严重的畏黑情绪。有时甚至在进入有光照的楼层之后仍不能缓和这种心理不适，以至于产生强烈的、想要立刻离开本层级的冲动。存在的部分描述摘录如下：“感觉这里有东西”、“我不敢看”、“只想硬着头皮赶紧走到顶层”。但本层级内从未存在过疑似实体的目击报告。
//
//-6c9071986bc53671.jpg
//一位流浪者在Level C-13内逃跑时拍摄的相片，发布者声称有东西在追逐他，但没有其他任何关于此实体的外观、声音的文字描述和音影像文件被发布。目前该用户在数据库中已注销*。
//
//基地、前哨和社区
//由于面积、资源和照明缺乏的问题，本层级没有建立任何团体的根据地。
//
//入口与出口：
//入口
//在Level 11中的任一楼梯间，手持C层群密钥13，调节共振频率为512hz尝试切出。
//极少一部分流浪者声称他们在走上Level 0中所看到的幻觉楼梯后来到了本层级。
//每次穿过Level C-12中的门扉，都有0.008％的概率来到本层级。
//出口
//到达本层级的顶层，使用在本层级内找到的专用解锁密钥打开门，将进入Level C-14。该密钥无法带出本层级，会在层级内所有流浪者退出之后重新刷新其位于本层级内的位置。
//作者信息
//« Level C-12 | Level C-13 | Level C-14 »
//
//Footnotes
//1. 指坡度线与水平面的夹角，即楼梯梯段的倾斜角度或以夹角的正切表示踏步的高宽比，踏步高宽比能反映楼梯坡度和步距。
//2. 踏步前缘到上部结构底面之间的垂直距离。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1013{}