//Level C-86
//评分: 
//+21
//+
//–
//X
//嘿！流浪者们！
//这里是后室中最值得，也是唯一值得信任的娱乐组织——后室旅游集团！
//很多人可能要问了，我们这几周去哪里了？为何给竞争对手留出了那么多发展时间？
//关于我们的消失，你们将在这个乐园中得到答案！
//
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//WF13cg75dRJxaIp.jpg
//一张全新的乐园卡片。
//
//Level C-86是后室层群C的第86层，该层级似乎由后室旅游集团在后室装修公司的协助下建造而成。
//
//描述：
//Level C-86表现为一座漂浮在天空盒中的圆形扁平小岛，其面积大概有132平方千米，这座小岛的陆地部分被一座巨大的后室主题公园所覆盖。乐园中的员工多为穿着后室旅游集团制服并具有Level 11效应的悲尸与无面灵。
//该层级中有着许多如过山车，摩天轮之类的娱乐设施与功能性设施。而这些建筑通常都以后室中的某一层级为主题且拥有着主题层级的特殊性质，如你可以在以Level 87为主题的碰碰车设施中与未来的自己一同游玩，或是在一家以Level 40为主题的餐厅中买到一罐“Starflare上将通用酱汁”。
//
//该层级正中间的一块圆形区域为中心，目前无论用何种方式进入该层级都会先到达中心1。Level C-86中使用一种名为“乐园点数”的虚拟货币，乐园点数用于该层级中购买物品或游玩项目。你可以每天在乐园中心处领取20点乐园点数，或是通过游玩一些带有奖励机制的娱乐设施来获得它。乐园点数会被存储在一张纯黑的塑胶材质的卡片中，首次折叠卡片会在它上面烙上金色的折叠者名字，你可以通过乐园中随处可见的形似ATM机的机器来存储与取出乐园点数。
//
//特殊设施：
//怀旧旅馆
//pfxQcYm7oiV6OyB.png
//怀旧旅馆的一间客房。
//
//在Level C-86中有两家酒店，酒店是该层级中唯一可供过夜的地点，一切尝试在酒店之外过夜的流浪者都在第二天早上离奇消失了。其中一家酒店名为怀旧旅馆，位于Level C-86中心的东北方向，相比乐园中的其他建筑，它显得十分不起眼。在它的南边有着一座以Level 906为主题的过山车设施，你可以以此为地标很快地找到怀旧旅馆。它是一座通体黄色，长30米宽30米高4.5米的的长方体建筑。怀旧旅馆的门口有几名员工无面灵，向它们支付60点乐园点数后便可在此居住48小时。
//
//怀旧旅馆的内部空间比外界占地要大的多，其的内部空间目测已超过了百万平方公里。怀旧旅馆由错综复杂的走廊和随处可见的门组成2，整体内部装修风格与Level 0相似，进入一扇棕色的门会让你到达一间客房，进入白色的门会让你离开怀旧旅馆，在怀旧旅馆中有很小的机率会发现一扇黄色的门，进入它会让你到达一间充斥着毛绒玩具的黑暗房间。
//
//在怀旧旅馆的客房中拍摄的一切图像都会有一种失真感，且客房中通常有一扇看不到任何外界景色的窗户，无论何时窗户后都是一片漆黑，后室旅游集团对此的解释是“为了省电费”。客房的入口处右手边通常有一间带有淋浴间的厕所，里面有时会出现成群的尸鼠，对此最佳的解决方案是换一间客房居住。
//
//在怀旧旅馆中滞留超过24小时会令人产生一种身处于Level 0的错觉，并会有一种被监视的不安感，这种错觉可以通过呼吸外界的新鲜空气和饮用杏仁水解决。
//
//Int Main（因特曼）
//8uqF2WdY5ajQPc6.jpg
//因特曼的大堂。
//
//因特曼位于Level C-86中心的正西方向，它是一栋高耸入云的Level 5风格的建筑，这里的无面灵员工全都戴上了滑稽的毛绒头套假装Entity 18。你需要在大堂支付220点乐园点数来换取在此居住24小时的资格。因特曼总共有54层，整体可分为1楼的大堂，2~3楼的自助餐厅与赌场，53~53楼的客房，54~55楼的管理员房间和顶楼的露天游泳池。
//
//位于因特曼2楼的自助餐厅有着大量的饮食，这些饮食会在每天的饭点时段自动刷新。经鉴定，肉类食品的原材料均为罐装龙肉，尽管它们尝起来很像牛肉鱼肉等肉类。自助餐厅中最值得注意的地方是位于角落的一排饮料机，除了普通的杏仁水，幸运豆奶等饮品，还有着如下液体：
//
//Aomy Hgrve：一种橙色透明，略微粘稠的饮料，有一股花生和葡萄酒的味道。
//腰果水
//医用盐水
//维罗妮卡婆婆蓝汁：一种蓝色透明，带有薰衣草香气的饮料，喝下去会令饮用者感到平静，过度饮用会导致休克。
//龙奶：普通的牛奶。
//因特曼的3楼是一间模仿Level 5.1的赌场，一些流浪者会在这里交换乐园点数。因特曼的54楼与55楼居住着多名人形实体，它们负责管理整个Level C-86。它们禁止任何人进入它们所在的楼层，违者将会被逐出Level C-86。由于管理员不常离开因特曼，关于它们我们所知甚少。
//
//后室娱乐公厕
//你可以在Level C-86的各种位置发现以“后室娱乐”组织为主题的厕所，厕所里的便器全都被打造成了保罗·西蒙斯的大头雕塑造型。后室旅游集团声明这种设计没有针对任何人或组织，只是巧合而已。
//
//后室娱乐公厕中的一切物品都会被一种霓虹线特效覆盖着，另外，在一些厕所里你可以找到一扇散发着紫色光芒的门，进入它会让你到达Level C-70，目前Level C-86的管理员正在寻找并封禁带有这种出口的厕所。
//
//地牢
//关于这种建筑，乐园中并没有给出一个具体称呼。在乐园的一些地方有时会刷新出一扇通往地底的门，进入它会让你到达地牢。
//
//地牢通常是一条长度在100米左右的黑暗走廊，在其的左侧和右侧有着多间紧锁着的牢房（“地牢”因此而得名），每间牢房内似乎都关押着大量实体。根据牢房中发出的声音可以判断出被关押的实体有猎犬，骇笑者和肢团，后室旅游集团对地牢的解释是“在改造该层级的时候把一些危险的家伙处理了一下”。想要离开地牢只能原路返回或靠切出到达Level C-67，出于安全考虑，不建议进入地牢。
//
//基地，前哨和社区
//游客
//“游客”是对居住在Level C-86的流浪者的统称，他们大约有几千人。
//“每天在乐园内游玩项目获取乐园点数，晚上居住在怀旧旅馆，如果哪天运气好拿的点数多了就去因特曼放纵一把。”这是一名游客对自己生活的概括。
//
//入口和出口
//入口
//在Level C-23，Level C-28，Level C-61，Level C-12找到并进入一扇橙色的双开大门。
//找到并切入一副关于Level C-86的海报。
//进入Level C-31的地下室通道可能会让你到达该层级的其中一个地牢。
//出口
//在后室娱乐公厕中进入一扇散发着紫色光芒的门会让你到达Level C-70。
//在地牢中切出会到达Level C-67。
//从因特曼的顶楼跳下会让你到达Level C-77，该出口由一名在3楼输光了身家的流浪者发现。
//作者信息
//« Level C-85 | Level C-86 | Level C-87 »
//
//脚注
//1. 也有极少数的例外，如进入Level C-31的地下室通道可能会让你到达该层级的其中一个地牢。
//2. 有人在内时，房间的门是无法打开的。
//3. 为了避嫌没有4楼。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1086{}