//Level C-78
//评分: 
//+18
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//the-atacama-desert-2832866_640.jpg
//Level C-78。画面内无残影出现。
//
//Level C-78是后室C层群的第78层。
//
//描述：
//Level C-78的主体是一面外观类似于镜子的平台，其边界被一圈低矮的山丘所环绕。
//
//平台地面覆盖有一层极浅的晶体。晶体呈现出完美的反射率，非常清晰地持续倒映着Level C-78上方的璀璨星空。该层级既不存在原生实体，也不存在物品。
//
//但值得注意的是，所有人类/实体在Level C-78内的倒影都不是自己，而是其他人类/实体的模样。具体可见附录。
//
//除此之外，该层级内还会毫无规律地出现各种人类/实体的残影，并快速消失。残影与其倒影的模样同样不匹配。在特意针对Level C-78进行多次探索与“倒影观测”之后，目前确信残影的模样即为Level C-78先前的来访者们；Level C-78以“残影”这种方式，记录下了每一位来访者。
//
//附录：
//以下是记录在案的倒影节选。部分倒影来自残影。
//
//人员：文天（M.E.G.人员；男性）
//
//倒影：一个年轻女子。
//
//笔记：人员报告称，倒影中的女子是自己在坠入后室之前的情侣。
//
//人员：张清（M.E.G.人员；男性）
//
//倒影：一个陌生男子。
//
//笔记：人员拒绝回答提问。
//
//人员：[应人员要求已匿名]（M.E.G.人员；男性）
//
//倒影：三位并排站立的女子；她们的年龄看上去略有出入。
//
//笔记：无。
//
//人员：周慧（某位M.E.G.人员的女儿、年龄9岁）
//
//倒影：一个陌生的男孩。
//
//笔记：无。
//
//人员：林篁（M.E.G.人员；男性）
//
//倒影：一个半蜘蛛状人形实体；经辨认为居住在Level C-98的实体“莱特妮丝”。
//
//笔记：人员在看到倒影时先是表现出讶异，而后变得无比坦然。
//
//人员：伊妍（M.E.G.人员；女性）
//
//倒影：一个年轻男子。
//
//笔记：人员报告称自己不认识倒影中的男人，但她很喜欢这幅影像。
//
//人员：未知（残影；中老年男性）
//
//倒影：一位中年妇女；但她的身体右侧血肉模糊并极度变形，似乎曾受巨物碾压。
//
//笔记：残影在看到倒影后当即跪倒，浑身发颤。由于残影消失的往往过快，故没能看清他的表情。
//
//人员：未知（残影；女性）
//
//倒影：没有倒影。
//
//笔记：“没有倒影”的案例仅有两例。此为一例。
//
//人员：克西（M.E.G.成员；男性）
//
//倒影：M.E.G.的克莱尔博士。
//
//笔记：克莱尔拒绝前往Level C-78进行追加实验。
//
//人员：帕尔特（M.E.G.人员；雄性）
//
//倒影：M.E.G.的安瑟博士。
//
//笔记：预料之中！=]
//
//人员：未知（残影；女性）
//
//倒影：她自己。
//
//笔记：“倒影一致”的案例仅此一例。
//
//人员：未知（残影；男性）
//
//倒影：无数实体挤在一起的庞然大物；倒影超出了Level C-78的整个地面。其中勉强可辨认出螳螂、蛟龙、各种外貌迥然的人形实体等等。
//
//笔记：残影的头部有一对犄角。
//
//
//M.E.G.已经针对本体与倒影的关系提出了数种猜想，但尚需更多的案例加以佐证。
//基地、前哨和社区
//该层级不存在已知的基地、前哨和社区。
//
//入口与出口：
//入口：
//切入Level C-74的一面镜子。
//更多入口尚待探查。
//出口：
//跳到本层级的边界之外即可切出至Level C-79。
//更多出口尚待探查。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1078{}