//Level C-10
//评分: 
//+16
//+
//–
//X
// 
//
//生存难度：
//等级 4
//
// 
// 
// 
//level-c-10-1.jpg
//由未知摄影师拍摄的一张Level C-10湖底的照片.
//
//Level-c-10-2.JPG
//Level C-10里斑马鱼的一张照片.
//
//Level C-10是后室C层群的第10个层级，本层是一座无尽的淡水湖泊。
//
//描述：
//Level C-10是一座向四周无限延伸的淡水湖泊。整个湖泊的深度最深不会超过10米，而湖泊内的大多数区域的深度都在0.5-3米左右。大小形状不一的岛屿随机分布在本层的湖面上，一般互相间隔几十千米。Level C-10有着长约30个小时的昼夜循环系统，其中白天占约25个小时，而黑夜则占5个小时。Level C-10的湖泊内部长满了藻类和水生植物，这些植物大部分都是自养生物，但少部分表现出了较为危险的捕食行为1。本层级只包含三种实体：“斑马鱼”，水生“肉食藤蔓”和邻里守望。
//
//“斑马鱼”的形态和外表与正常的淡水斑马鱼并无两样，唯一能够把它们和正常斑马鱼区分开来的就是它们红色的眼睛。在夜晚，这些红眼睛会发出肉眼可见的荧光。“斑马鱼”的嘴部长有锋利的牙齿以便于让其切下、撕毁猎物的肌肉组织。在Level C-10，特别是在晚上，成群结队的“斑马鱼”会对水中的流浪者造成极大的威胁。“肉食藤蔓”则是一种巨型的肉食水生植物，它会用灵活的触手包裹住受害者，并将其慢慢推入离根茎较近的部位。被“肉食藤蔓”抓住的受害者至今仍下落不明。有传言说藤蔓会消化受害者以作为它们的养料。
//
//白天的Level C-10相对平静，但本层级在晚上会变得极度不适合生存。在白天，“斑马鱼”和“肉食藤蔓”会出处于一种温顺的状态，除非流浪者故意接近它们的领地，它们一般不会主动攻击流浪者。在白天，湖中基本见不到邻里守望的“水游者”实体。但在晚上，整个层级的水中都会充斥着密集的“水游者”，目前还不知道是何种机制让“水游者”可以在白日到来之前快速消失。“斑马鱼”和“肉食藤蔓”在晚上会表现得极具攻击性，并且会伴有强大的捕猎欲望。随着光照的减少，这两种实体会变得越来越暴躁，并会攻击任何它们能找到的生命。这种进攻性会在日出前10分钟开始减弱，并在太阳完全升起时消失。
//
//到目前为止还没有关于因饮用湖水而导致健康问题的报告，但M.E.G.仍在调查湖水对人体可能造成的长期危害。Level C-10里基本没有可用的补给，因此，任何在本层级里长期居住的尝试都几乎不可能成功。
//
//基地、前哨与社区
//因为本层的危险性，这里目前还没有任何已知的基地、哨所或者社区。
//
//入口与出口：
//目前所知的进入本层级的方法都需要水作为媒介，同样的，本层级的所有出口都会只会将你领入有水的层级。
//
//入口
//在Level 7里找到一片长满金鱼藻的地方，从那里可以切入Level C-10。
//跳入Level C-9的水潭里会有概率将你带入Level-C-10。
//在Level 60，可以通过正在运行的洗衣机卡入本层。
//出口
//在很罕见的情况下能在Level C-10的水底找到汽车残骸，进入这些汽车残骸并在里面昏迷会将你带入Level 69。进入Level 69后你会出现在一辆水泡车里。
//在Level C-10的湖里成功憋气五分钟将会把你带入Level 8的水池。
//在湖里昏迷会有几率将你带入Level C-30。本方法十分危险，因此建议不要轻易尝试。
//在Level C-10里的水底会随机出现各式各样的门，这些门会随机通向其他有水的层级，有些甚至可能是未被探索过的层级。
//在湖的水面上会看到漩涡，这些漩涡会通向Level 130。
//作者
//« Level C-9 | Level C-10 | Level C-11 »
//
//Footnotes
//1. 本层的一个实体，随后会在本文章里做进一步解释。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1010{}