//Level C-81
//评分: 
//+22
//+
//–
//X
// 
//
//生存难度：
//等级 2
//
//时空区域性周期性不稳定（时空扭曲）
//存在中量特殊实体及低切入/出可能
//无常规实体存在及低切入/出可能cp2
//Level C-81的照片
//
//Level C-81是后室C层群的第81层。
//
//描述
//Level C-81是一片中国古典水墨风的不符合常理的山峦。山峦被认为是无穷无尽的，但实际可探索区域较为有限。
//
//该层级分为两个区域。以该层级中心为原点，半径约6.5千米的近圆区域内被认为是稳定的，可以生存的，层级内流浪者与团体均定居于近圆区域内。近圆区域外的空间仍呈现出与近圆区域内相同的景象，但空间内事物表现出极其折叠，破碎，扭曲的状态。空间内事物会每隔数小时改变原有形态，近圆区域外被认为是不稳定，不可生存的。
//
//层级内生长着由黑色墨砚，彩色墨水和一种能使液体附着的未知物质组成的树木，这些树木是该层级原有事物中唯一含有除黑白以外色彩的存在。
//
//下面是根据目前所确定的信息总结的该层级须知信息，请仔细阅读。
//
//层级须知
//
//关于跳跃
//层级内流浪者与实体的跳跃能力都会被相应增强，层级内不同的区域增强的幅度也不同。
//
//该层级分为两个区域，近圆区域内与近圆区域外。
//近圆区域内流浪者与实体的跳跃能力会被增强为原来的1.6-1.9倍左右。
//近圆区域外流浪者与实体的跳跃能力会被增强为原来的13-15倍左右。
//
//介于该特性，在近圆区域内，流浪者可以在遭遇危险时通过高频率跳跃来脱离危险。（在面对敌对状态下的“仪昭”时是不适用的）
//但如果流浪者处在近圆区域外，强烈不建议流浪者尝试跳跃，否则流浪者极容易摔伤而失去行动能力，最后被近圆区域外定期的变形杀死。（贸然进入近圆区域外也是不被建议的！！）
//
//关于实体
//层级内常规实体绝迹，但存在多种特殊实体。
//介于该层级的环境特性，层级内特殊实体的特性也十分独特。
//
//层级内特殊实体无法被大多数常规武器伤害。
//层级内特殊实体无法被近圆区域外的扭曲伤害。
//
//当层级内特殊实体接触到非 墨水1 而且可溶于墨水中的液体时，实体的体型会迅速增大，但自身颜色会迅速变淡，力量速度反应等各项素质也会被削弱。
//当层级内特殊实体接触到墨水时，实体的体型会迅速增大，但自身颜色会迅速变深，力量速度反应等各项素质也会被增强。
//
//介于该特性，建议流浪者在该层级探索时随身携带杏仁水等可溶于墨水的液体，这可以在流浪者与特殊实体发生冲突时有效避免特殊实体对流浪者的伤害。同时注意如果与特殊实体发生冲突，尽量向层级内树木稀少的方向移动，避免特殊实体吸收树木上附着的墨水恢复自身。
//
//下面是附属文件
//
//附属文件-层级特殊实体记录
//附属文件-层级特殊实体研究报告
//基地、前哨与社区
//S.C（苦难邦联）-明晦科技“浊水”层级中枢
//位于该层级中心点起正北方向约600米处
//由数十名苦难邦联成员组成
//团体对外尽可能保持隐蔽
//该中枢建立的目的是储存层级内采集到的彩色墨水
//入口与出口
//入口
//尝试切入任意一幅水墨画有概率进入该层级
//无意打翻墨水而且大量墨水溅到衣服上有概率进入该层级
//出口
//在该层级的中心点切出，流浪者即可回到原来的层级
//询问特殊实体“水墨”出口，该实体将带领流浪者到达一块水墨岩石前，从水墨岩石切出，流浪者即可到达Level 1
//将墨水撒在特殊实体“有无”身上，流浪者即可到达Level C-5
//作者信息
//脚注
//1. 指层级内树木上附着的彩色墨水以及其他任意种类的墨水
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1081{}