//Level C-74
//评分: 
//+20
//+
//–
//X
// 
//
//生存难度：
// 
//空间迷离
//大量实体photo-1612517659442-dc78ed4106cb?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=687&q=80
//Level C-74。
//
//Level C-74是后室C层群的第74层。
//
//描述：
//Level C-74是一片森林。正如绝大部分的后室层级一般，Level C-74似乎不存在边界、也不具备线性空间的稳定性。任何尝试记录Level C-74路线的行为都已宣告无意义。
//
//辨认自己是否身处Level C-74非常容易：因为所有切入该层级的人类都定然会在距离自己最近的一棵大树上发现一块内容为“禁止行人通行”1的交通标志。
//
//注意，若确认自己位于Level C-74，请火速离开（离开方式详见下方“出口”一栏），因为当前没有任何人类能在Level C-74内保持联系/存活（？）逾10分钟。尽管绝大部分都是生未见人、死未见尸，但是完全没有过哪怕一次停留10分钟之后生还的案例。如上所述，当前的最长通讯保持时间仅有10分钟，滞留在该层级内超过此时限的流浪者全部下落不明。
//
//同时，Level C-74内游荡着大量的实体，包括而不限于清道夫、肢团、钝人、猎犬、骇笑者等，全部属于“危险实体”一列。然而，上述所有实体全部显得行为古怪、精神错乱，完全不遵从它们通常的行为模式，而是动作癫狂地四处徘徊、呼喊2、斗殴等。除此之外，几乎每只实体都对刚刚进入Level C-74的人类表现得极为“惊喜”与“疯狂”，不顾一切地试图靠近后者；同时，后者却不知为何地会对实体们表现出超过正常范畴的恐惧、惊怒、甚至是变态性的施虐等倾向、并往往就此做出猛烈的反攻3，直至消灭实体4。
//
//基地、前哨和社区
//该层级不存在已知的基地、前哨和社区。
//
//入口与出口：
//入口：
//所有森林型层级全都具有不慎切入Level C-74的隐患；若你在任意森林类区域内发现上文所述的交通标志，即宣判进入Level C-74。
//更多入口尚待探查。
//出口：
//找到一扇嵌入树干的木门即可回归你原本身处的层级5。
//更多出口尚待探查。
//作者信息
//« Level C-73 | Level C-74 | Level C-75 »
//
//Footnotes
//1. 指图案。结合Level C-74的实际情况，更多人员认为它的实际含义其实是“禁止人类”。
//2. 有迅速离开层级的生还人员报告称其有时类似于“哭号”。
//3. 当前假说认为这是Level C-74对人们施加的精神影响。幸运的是此属积极影响，因为它直接推动了人们对实体做出积极且有力的反杀甚至于虐杀。
//4. 奇怪的是，Level C-74内的实体全都没有它们本应具备的肉体强度和特殊能力，并似乎会持续试图用它们那不成体系的语言/怪叫与人类对话。
//5. 曾有流浪者在木门旁边发现过数具实体尸体。根据剖开其胃袋之后发现的满腹树皮，当前推测它们或是死于饥饿。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1074{}