//Level C-79
//评分: 
//+23
//+
//–
//X
//欧阳修曰：醉翁之意不在酒，在乎山水之间也。
//在这里就收起所有邪念，好好沉浸在美景与美酒中吧。
//
// 
//
//生存难度：
//等级 0
//
//安全
//稳定
//实体无危害
//Level C-79是后室C层群的第79层，该层级表现为一片山峦，并且有瀑布从山上流下
//
//2000px-Waterfall_in_Potokgraben.jpg
//未知流浪者拍摄的瀑布图片
//
//描述
//Level C-79永远处于多云的状态，气温适宜，整个层级都充满一股淡淡的酒味，越靠近瀑布酒味越浓，层级中没有任何植物，根据检测结果显示，瀑布上流下来的液体是高浓度白酒，除了口感辣之外并无其他异常，可以正常饮用，瀑布边上有三个建筑物，分别是两个凉亭，和一栋有些腐坏的木屋，两个凉亭与前厅的中式凉亭一样，每个凉亭都配有一套桌椅，桌子上也有酒壶和酒杯等用具，木屋不知什么原因无法进入，但是用耳朵贴着门能听微微到两人吟诗作对的声音，另外在该层级中的实体会因为酒瀑布所散发的酒味被熏的迷迷糊糊，即使敌对的实体也会因为醉酒而变得莫名友善，这种情况目前被称为“醉翁效应”。
//
//醉翁效应
//这是在Level C-79特有的效应，该效应只会当实体出现攻击性或者有暴躁行为时发生，当处于该层级的实体出现攻击性时，会马上变得冷静、友善，并且会昏昏沉沉如同喝醉一样，但是当实体处于中立状态时则不会受到该效应的影响，即使是派对客也无法避免“醉翁效应”。
//
//以下是关于“醉翁效应”的几个实验记录
//
//>加载完成
//实验对象为一名患有狂躁症的流浪者
//
//实验人员：（将实验对象带到层级中）先生，你现在感觉如何
//
//实验对象：我！我能有什么感觉！把我带到这是想干什么？
//
//实验人员：冷静先生，我们只是在做研究
//
//实验对象：研究？！你把我当什么了？小白鼠？说好的能带我离开这儿呢？你他妈是有什么毛病吗！？（准备挥拳打向实验人员，但是突然放下了拳头，整个人变得昏昏沉沉的站不稳）
//
//实验人员：先生，现在感觉如何？
//
//实验对象：问我？哈哈哈…我感觉好极了，我觉得…我觉得我的心情从来没有……像现在这样舒畅过。
//
//实验人员：记录完毕
//
//>加载完成
//事件记录1
//
//流浪者1：嘿，伙计，你看那儿有个派对客…它已经杵在那十几分钟了，我才发现它
//
//流浪者2：它好像不想伤害我们啊…
//
//一个派对客（朝这两个流浪者挥手）：嘿～朋友们…想来参加…派……派对吗…=）
//
//流浪者1：它没什么事吧，看起来好像喝醉了。
//
//流浪者2：谁知道呢，它又没朝我们冲来，反正别靠近就对了…
//
//>加载完成
//事件记录2
//
//流浪者1号：这都是你的馊主意，搞得我们到这个不知道是哪里的层级
//
//流浪者2号：拜托，不能全怪我啊，你也支持了啊。
//
//流浪者1号：所以你的意思是说怪我了？
//
//流浪者2号：别随便挑事好吗，我又没说。
//
//流浪者1号：草，看我今天打不打你（突然就冷静了下来）
//
//流浪者2号：罗根（流浪者1号的名字）？你没事吧？
//
//流浪者1号：（突然搭上2号的肩膀）哈哈哈…朋友我怎么…怎么可能会生你的气呢？我现在感觉太开心了！
//
//流浪者2号：别这样，你让我觉得有点恶心…
//
//实体
//Level C-79充斥着许多种类的实体但整体数量不多，如：钝人，肢团，窃皮者，派对客等，但它们都因为“醉翁效应”，导致变得对人类友善，哪怕去主动招惹他们，他们也不会做出伤害人类的事情，目前这些实体是从那些层级到来是未知的，也不知道它们是怎样到达这里的。
//
//基地，哨站和社区
//M.E.G.“醉翁亭”基地
//该基地共有25-40人，并且明令禁止使用打火机、火柴等产生明火的工具
//该基地会收集Level C-79中的酒，作为交易品，并作为补给品运送到其他基地，另外会将Level C-79的酒提纯做成酒精送去其他层级基地。
//该基地接受交易，接受的交易物主要是食物，杏仁水等，给予的交易物只有酒、纯酒精等。
//入口和出口
//入口
//在Level C-18或Level 6.1找到一瓶白酒喝一口有可能进入Level C-79。
//在Level C-12，进入一间酒水店铺，会进入Level C-79。
//出口
//在腐坏的木屋门口待上半小时会进入Level C-197
//在其中一个凉亭喝酒，直到喝醉晕过去会来到你上一个睡醒的地方
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1079{}