//我可不想瞒你什么
//这儿确实存在危险
//但它们并不致命
//再说了
//这儿无可比拟的的安定和惬意
//同样不可置否
//欢迎来到外婆的澎湖湾
//给你疲惫的后室之旅放个假吧
//
// 
//
//生存难度：
//安全且稳定
//惬意亦自得
//宽慰而释然
//Level C-72是后室C层群的第72层，由M.E.G.“故土追忆者”小队成员u/常峰于2020年10月2日首次发现并上传探索报告。
//
//描述：
//Level C-72是一片类似于封闭箱子体内的有限海滩区域，层级内不存在昼夜循环，时间被固定在正午11-12时左右。边界处均为可以轻松被穿越的特殊屏障。这些特殊屏障似乎对层级内产生了一系列极为特殊的影响，被称为“外婆效应”。
//
//屏障对该区域边界的界定与其说是物理意义上的分离，不如称之为一种精神屏蔽，即一旦穿越这些屏障，感官将悉数失灵。即便逾越屏障，也无法感知其外的一切。
//
//该层级内水汽丰富，光照条件充足，属于典型的亚热带季风气候。层级内生活着诸如毛椰子树、寄居蟹、鳕鱼、海星等常见海滨生物，它们同前厅内的并无二样。
//
//从屏障内部向外看，环境大体与内部一致，亦是海滩，但似乎是二维的，看上去就像窗帘或者老式广告上的沙滩图像，被流浪者们描述为“有一种极强烈的熟悉感和不真实感”。除非逾越其外，这些屏障并不会对人造成任何精神上或物理意义上的伤害。它们将整个层级精准得分割在多片沙滩平面图像的穹庐之下。
//
//3903547fc1c418da.jpg
//Level C-72边界区域由内而外所看到的图像，拍摄者为u/常峰。“就像炎夏烈日透彻窗帘映进卧室般清凉却又燥热般的熟悉感，不是吗？”
//
//Level C-72占地约500k㎡（东西向长50km整，南北向宽10km整），这一数据十分精准，就像被刻意划分的一样。层级内存在着一般度假海滩所拥有的一切设施，包括但不限于遮阳伞、沙滩椅、度假小屋等。这些物品似乎是随机刷新的，一旦被某一流浪者据为己有，层级内便会随机刷新一个同样的物品（由于层级空间有限，推测刷新数量存在上限）。
//
//Level C-72内似乎存在一种特殊影响，即层级会以未知方式持续为流浪者的机体提供能量，故身处其内不会感到饥饿。当然，层级内也存在大量的椰树和可食用海鱼，它们的口感和营养成分十分正常，只是食用后不会产生饱腹感，也不会为食用者提供能量，但据食用过在本层级内海钓到石斑的流浪者称，“这里的东西味道好像都很淡，但吃完它后真的让我心情很愉悦。我向你保证，它或许不那么好吃，但它绝对是这个世界上最快乐的一条石斑鱼。”
//
//不可否认的是，Level C-72内的影响并非都是积极的。据在Level C-72内生活过的绝大多数流浪者表示，初入层级时，生活十分惬意舒适，这段时期被称为“安全期”。但在层级内定居一段时间后，流浪者就会无端出现一次“除颤”现象。这一现象的出现随时随地，毫无任何预兆，经历过的流浪者形容其为“仿佛被接通在220V的交流电回路中，视觉好像突然断触，一片漆黑，全身每个部位都疼痛难耐。”这一过程可能持续五分钟至十小时不等，在除颤现象结束后，视觉立即恢复，疼痛也会在短时间内消失，肌肉痉挛现象亦会在十分钟内缓解。
//
//第一次除颤现象的出现宣告着流浪者结束了“安全期”，从此刻起，流浪者们可能会间接性出现得这一现象，同“安全期”的时长一样，两次除颤的间隔也是随机的，这一切似乎全凭运气。有人到现在仍处于“安全期”，有人进入层级第二天就经历了“过电般的体验”。
//
//值得注意的是，除颤过程并不致命，鲜有因为除颤死亡的案例（自Level C-72被发现以来，总计仅有四名流浪者死于除颤），且这一过程虽被描述为电击，但实际上并不会传向其它人，故接触一个正处于除颤阶段的流浪者是安全的。
//
//不过，有研究表明，该过程虽不致命，但似乎每经历一次除颤，层级对流浪者饱腹感的填充就会减少一部分，而饱腹感及能量只能由层级本身提供，故每经历一次除颤，流浪者的体重均会减少，减少量随除颤持续时间的增长而增加。
//
//“外婆效应”：
//由于层级本身的影响，处于Level C-72内会使流浪者机体出现一系列异常状况。同时，Level C-72本身的物质也出现了与其它层级不同的现象，它们被统称为“外婆效应”，具体如下（此外，该效应的产生尚不清楚是否与层级外围屏障有关）：
//
//1. 如上文所提，处于Level C-72内将不会有饥渴感，层级会以未知方式向流浪者机体提供能量。这一点十分重要，因为这意味着所有传统意义上的能量观点在本层级内都有可能不适用；
//2. 如上文所提，Level C-72内的流浪者将会间接性的出现“除颤”现象。“安全期”时长不定，“除颤”时长不定，两次“除颤”间的间隔未知，关于该现象的一切都是未知的；
//隐藏日志
//“这儿似乎不存在意外死亡或自然死亡的概念………
//任何尝试溺水或其他死亡方式的人都失败了
//他们每次都能被诡异的救活，除了感到痛苦外，机体毫发无损
//除了……
//我曾看到一个瘦骨嶙峋的倒霉蛋，
//在一次除颤中被活活电成灰了……..”
//
//3.1 目前为止，所有被发现仅栖息于后室内的实体（“窃皮者”、“爆酸者”“灌篮崽”……）均未出现在本层级内，人类似乎是本层级内唯一智慧体。所有试图将这些实体带入本层级的尝试都宣告失败，“山魔王仪式”在此处也不生效。
//3.2 Level C-72似乎有理解人类行为的能力。曾有两位流浪者u/张兵、u/赵强在沙滩上发生口角并大打出手，在u/张兵怒气达到顶点时突然昏厥，周围的流浪者欲对其进行心脏复苏时发现其生命体征正常，类似于原发性昏厥。约莫十分钟后，u/张兵自行苏醒，据其称，他在晕厥过程中做了一场梦，内容被描述为“好似躺在已故外婆的腿边，外婆温柔得讲着谦让的处世哲理。”，其苏醒后心情十分愉悦，除头晕以外机体毫无实质性损伤，并言“为刚刚对强哥的粗鲁行径道歉”。
//隐藏记录
//（只是俩疯子吵架罢了，有什么好看的？）
//
//[该消息记录来自u/张兵手机内的聊天软件，由其本人上传。时间为“昏厥事件”后六小时]
//
//
//赵：没事儿吧哥们，我就单纯想开个玩笑，谁知道你反应这么大。
//张：没事儿……..
//
//张：但是…你是故意激我的吧…
//
//赵：嗯？？？？
//
//张：我从来没有提过我是孤儿这件事儿，更没有说过我那该死的继父，而且我自己都不知道我还有个外婆………
//
//赵：对不起…
//
//张：我不知道你是从哪儿知道我信息的，但是已经不重要了。
//
//张：不过，你也应该确定了吧。
//
//赵：其实…对你的身世，我并不是很在乎，也没有恶意中伤的意思。
//
//张：我知道，我说的不是这个。
//
//张：是关于这个鬼地方的。
//
//张：你应该也猜到了吧………不然也不会拿我试水。
//
//[十分钟后]
//
//
//赵：对不起。
//赵：我必须承认，你说的都是对的。我也不知道怎么办才好了。自你清醒以来，我就一直无法接受这个事实，这太确定了，太突然了，太迷茫了，我现在感觉一切都是空洞的，未知的，未知到令人发指而恐惧的。
//
//赵：不好意思，哥们儿。道德角度上我真的做的不对，我心里真的过意不去…….
//
//赵：我怎么还是可以感受到我的心啊………
//
//张：没事儿，这已经不重要了。
//
//张：我也没法接受。但谁他妈让你打开了这个魔盒呢，现在咱俩都知道了。你似乎再也不需要顾忌道德角度什么的了，这辈子都不需要了，而且这他妈也不重要了吧！！！！
//
//赵：对不起……
//
//张：闭嘴吧，别再让其他人知道就行，不然鬼知道会怎么样。
//
//赵：其实……也不会怎么样吧，无非就是一场新的暴动，一场新的慌乱。然后呢？慌乱终会平息，人们只能继续在这儿待着等待一次次的宣判。意志丝毫不会消减是最他妈操蛋的，我要是能被这该死的没有尽头的痛楚玩意儿逼疯该多好，就不会再想这些破事儿了。
//
//赵：以后的每一次，每一次都将这样，就算知道了也只会是这样，什么都不会变，一点点都不会变，不管是这个鬼地方还是你和我，于大家来说都结束了，都他妈已经结束完了！！！！还他妈是得不了安宁的那种结束！！！！说，让每个人都说，都他妈去奔走相告，会发生什么？无非就是多几个抱头长叹的家伙，多几个望着海抽闷烟的家伙，除此之外都只是平添负担。没有人会因此死去，因为人人都想因此死去。
//
//赵：如果真会发生点什么的话咱俩现在也不会说这些了吧。
//
//赵：我们真渺小啊……
//
//张：那也闭嘴吧，活的糊涂一点总比抽闷烟强。
//
//张：等会儿和我去海钓吧，我想吃石斑了。
//
//[消息记录结束]
//
//
//由上可见，层级似乎会自动清除一切可能威胁到流浪者人身安全的事物和隐患，并保护层级内 流浪者始终处于相对平和心态，这一过程的具体实施将因人而异。
//鉴于这一特性，M.E.G.于2021年10月9日将本层级生存难度认定为“宜居”。
//
//4.Level C-72任意区域内，“Wi-Fi”信号均满格，但仅限于本层级内终端的信息交互，任何形式向外部（前厅、后室其它层级）的任何信息输出行为都将失败。Level C-72内所有移动终端的运营商均显示为Verizon，其授时服务和定位系统将全部失灵。
//幸运的是，经由本层级内技术人员的研发，Level C-72基地澎湖湾已于2020.10.30建立独立基站，该基站以雷达不定向搜寻的方式随机架构了周围1任何一非叠加层级的信号输出端，但由于只能架构输出端信号并且目前技术和材料仅为M.E.G.提供的信息传递保障终端，故该基站仅能单向向M.E.G.数据库输出信息。
//
//此外，由于本层级内不存在昼夜循环且任何无线电设备的授时系统都已失灵，故经当地流浪者组织商讨，拟将u/常峰进入本层级的时刻定为0时（24时）并开发了一套专属于该层级的授时系统，由Immigration Australia Timeline提供授时服务，该系统被称为“C-72时间管理大师”。处于本层级的流浪者按照该系统进行作息，以维持机体生物节律的稳定。
//
//5.Level C-72内的水体性质十分特殊，尤其是其口感和饮用体验。一位品尝过其的流浪者称“它尝上去一点都不像传统意义上的海水，完全没有那种咸腥的味道，就好像……..曾在那儿喝到的饮用水一样。”而对其化学组分的分析却表明，其内确实存在钠、镁、碘离子等海水必需元素且浓度与有记载的海水中浓度无异。这或许也解释了这里为何如此适合海洋生物的繁衍。
//由于流浪者并不能很好的品尝到其苦涩感，许多初到此地的流浪者将其误认为是其余层级内极为罕见的淡水2资源，大量饮用致脱水、肾功能衰竭的案例也屡见不鲜（虽然由于本层级影响，流浪者并不会因此死亡，但是脱水和衰竭过程的也会让人倍感痛苦，“尤其是并发的炸裂般的神经性头疼几乎掩盖了其它器官所带来的痛楚，我他妈都快感觉不到肾的存在了。”），故不建议轻易饮用，尽管它们尝上去并不那么像海水。
//
//6.尽管Level C-72内的光照条件良好，但长时间暴露在本层级内的日光下并不会造成皮肤损伤或晒伤现象。如欲长时间暴露在本层级阳光下，请务必照常做好防晒措施，以避免紫外线损伤。
//隐藏帖子
//C-72吧
//
//这鬼地方又连不到外网！干嘛还给自己搞个论坛！
//真无聊啊……三亚海景房也不过如此嘛……
//2021/11/2，19：22
//吸-72冬泳怪鸽：我进后室快一年了没下过水……铁人三项忘完了都……
//
//CF尚巾山夆（管理员）：兄你还练游泳啊，难怪体格子这么健壮。
//
//吸-72冬泳怪鸽：再别提了，来这儿破地方之前我可是那嘎达最猛的游泳健将，零下10度我敢下水冬泳。
//
//神秘用户2992JJSA：乡音无改鬓毛衰啊……
//
//吸-72冬泳怪鸽：别说冬泳怎么怎么了，这玩意儿真是最磨人的。一是可以锻炼人的身体，耐寒能力，人没有一副好体格子怎么打天下？二是可以磨练人的意志品质，就说零下十几度敢光膀子的都算人物了吧！老子今年虚岁都七十六了，不照样还是健朗健谈的，没见几个小伙子比我有精神！
//
//CF尚巾山夆（管理员）：老大哥好魄力，后生娃娃我真的是佩服。零下十几度让我脱羽绒服都是煎熬了，还冬泳呢。
//
//吸-72冬泳怪鸽：这地方舒坦是舒坦，就是太消磨人的意志了。想想也是，整日无所事事的就是浪费光阴，本来让我不得死在松花江边就已经泯了我这半条精神骨了，现在连泳都不能游了，年轻娃娃在这玩得开有事儿干，我在这呆这么久唯一提得起兴趣的事情既然已经成为期待时不时被电一下了！
//
//赴约山河123：本来来这狗日地方就是个错误，本来都是过得好好的普通的不能再普通的人，全被拢到这么个破地方就已经够难受了，还球被搞到这么个层级锁着出不去，软禁等他妈比这好！东西吃着也没味道，日子过得也没乐趣，无聊的求死都不成，别说老大哥了，我丫都快被逼疯了。
//
//CF尚巾山夆（管理员）：……
//
//2021/11/2，19：28
//吸-72冬泳怪鸽：决定了，明儿海泳！
//
//C-72吧
//
//这鬼地方又连不到外网！干嘛还给自己搞个论坛！
//真无聊啊……三亚海景房也不过如此嘛……
//2021/11/3，04：30
//吸-72冬泳怪鸽：嘿嘿嘿小伙子们！我的好水手们！太阳已经晒屁股了！跟着你们的老船长出海远征吧！！！！！！
//
//123bphp.jpg
//
//吸-72冬泳怪鸽：太阳好毒…….为什么我拍出来跟阴天一样，摄像头得擦了…….
//吸-72冬泳怪鸽：两个老哥哥都游到靠边儿了，再游游出去了………
//
//C-72吧
//
//这鬼地方又连不到外网！干嘛还给自己搞个论坛！
//真无聊啊……三亚海景房也不过如此嘛……
//2021/11/3，07：33
//神秘用户2992JJSA：我滴妈啊……叔你起得真早，都不睡觉的吗？？？？
//
//CF尚巾山夆（管理员）：还真有人捧啊…….游咋样啊老哥？有没有找回青春的感觉？@吸-72冬泳怪鸽
//
//吸-72冬泳怪鸽：美着呢，好久没体验过这种酣畅淋漓的流汗的感觉了。炎炎烈日下海泳，让我不禁想起了当年征服松花江岸的日子，那可是我逝去的青春啊…….
//
//笋羊：看老爷子游得开心我也开心。昨儿看的就心痒痒，唉——要不是前几天把防晒霜抹完了今早肯定跟着老爷子海泳去了，游完再钓俩鱼儿一烤。我可刚来这地儿，你们体验腻的海滨快乐我还连边儿都没蹭到。
//
//吸-72冬泳怪鸽：说起来……我怎么没注意…….
//
//吸-72冬泳怪鸽：在这儿地方待久了，抹防晒打伞也是习惯性动作了，今儿出浅海游了快仨小时也没见晒伤，搁别的地方肯定皮肤都给干脱皮了……..
//
//笋羊：啊？
//
//2021/11/4，07：45
//CF尚巾山夆（管理员）：嗨——这有啥！哥你别往心上去，这地方怪事儿多了也不差这一件儿。估计是呆久了皮肤习惯了吧！
//
//吸-72冬泳怪鸽：也是…….今儿玩的痛快！明儿休息一天，后天带着@笋羊再游几个钟，跟年轻小伙子比比二百米！
//
//笋羊：我早起点拉线去！老爷子不见不散！
//
//C-72吧
//
//这鬼地方又连不到外网！干嘛还给自己搞个论坛！
//真无聊啊……三亚海景房也不过如此嘛……
//2021/11/5，14:22
//CF尚巾山夆（管理员）：半中午了……今儿咋这么冷清…….都忙啥呐？
//
//2021/11/5，22:11
//CF尚巾山夆（管理员）：咋还没人…….系统出问题了吗……
//
//plAer-3：好着呢哥，你没听说吗，大伙儿今儿忙着到黄老爷子那儿报名比赛。
//
//CF尚巾山夆（管理员）：啊？没听说啊，啥比赛？黄老爷子又是谁？
//
//plAer-3：你不知道啊？就冬泳那爷，他姓黄，明儿组织了一个200米自由泳比赛，那头儿正热火朝天得忙着报名呢。小孙挑浮标去了，也不知道这层级的海滩边哪来这么多垃圾给人用…….
//
//CF尚巾山夆（管理员）：正常，这层就是海滩区域，我感觉海边有的啥东西这儿都是随机刷新一堆堆的，沙滩椅啊防晒霜啊什么的…….对了，说这个呢，平常人都蜗居在屋子里不出来，明儿一下一河滩人涌出去，遮阳伞防晒霜能够用吗？这地方可是二十四小时暴晒的。
//
//plAer-3：不知道，我今儿在屋子里窝了一天……
//
//CF尚巾山夆（管理员）：行，我先睡，明儿再说吧。赶进这地方就没人搞个啥活动，明儿我也凑热闹去。
//
//C-72吧
//
//这鬼地方又连不到外网！干嘛还给自己搞个论坛！
//真无聊啊……三亚海景房也不过如此嘛……
//2021/11/5，23:19
//笋羊：日他哥，捡一天累死老子了，好不容易挑到这么点不破不漏的。这日子过得跟乌托邦赛的，我都不知道咋评价了。
//
//126scwm.jpg
//
//笋羊：妈的，胳膊好痒，咋回事儿啊？？？？
//吸-72冬泳怪鸽：辛苦你啦小孙。胳膊是怎么茬儿啊？是不是让海水给泡的啦？？？？
//
//笋羊：没啊，我今儿都没咋下水。我沿着海岸线走的。
//
//吸-72冬泳怪鸽：不定是太阳晒得吧？这破地方太阳要多毒有多毒。
//
//笋羊：我今儿确实是没抹防晒霜……昨天不是说这地方咋晒晒不坏吗我就没抹…….不能吧，总不至于搁这儿针对我吧？？？？算了，不管了，我先休息了黄叔，再几个小时开赛了。
//
//吸-72冬泳怪鸽：能成，好梦。
//
//笋羊：好梦。
//
//C-72吧
//
//这鬼地方又连不到外网！干嘛还给自己搞个论坛！
//真无聊啊……三亚海景房也不过如此嘛……
//2021/11/6，07:49
//CF尚巾山夆（管理员）：@全体成员!!!!!!!!!!!@全体成员!!!!!!!!!!!!!@全体成员!!!!!!!!!!!!!!@全体成员!!!!!!!!!!!
//
//CF尚巾山夆（管理员）：！！！！！！！都老老实实抹防晒！！！！！！我就多睡了一会儿！！！！！！！！！！！！
//
//CF尚巾山夆（管理员）：咱是智人！咱不能信这鬼地方的特性更不能经验行事明白不！！！这大毒太阳万一再搞个晒脱皮晒伤皮肤癌的咋办！！！！！！！死是死不了但在这地方谁给你治癌症去折磨死丫的！！！！！！
//
//2021/11/6，08:12
//吸-72冬泳怪鸽：已经晚了常峰……
//
//吸-72冬泳怪鸽：小孙这怂不听话，光想着比赛了睡了不到俩钟跑海边了，相当于连着晒了快一天，晒的红的那个斑起得呀，皮脱干净了都，跟大龙虾赛的。
//
//aks75mk.jpg
//
//赴约山河123：这问题不大，长两天就好了，就是痒的没办法。
//赴约山河123：只是……之前不是都没这情况吗，咋是针对小孙了是咋？为啥我们之前啥都不抹啥都不遮晒个三四天的都不事儿啊？？？？
//
//plAer-3：我一老爷们，来这儿之前也没抹过那东西啊…….刚来那天找不着人愣是让常哥忽悠着转了一天……
//
//吸-72冬泳怪鸽：而且我前两天和老爷子们海泳那么久也没事儿啊，是小孙的问题吗……
//
//2021/11/6，08:30
//CF尚巾山夆（管理员）：不，不是，跟他没关系…….
//
//CF尚巾山夆（管理员）：伙计们…….对不住啦…….
//
//⚠️警告⚠️
//本贴吧以被管理员@CF尚巾山夆及吧务@Ἑρμῆς锁定，请勿再尝试回复
//
//基地、前哨和社区：
//尽管有流浪者报告称“无法承受不知道什么时候就要来一次的除颤带来的心理阴影。”，但鉴于本层级内所有异常现象均未表现出致命性和过分伤害性，M.E.G.目前尚未撤销对本层级“宜居”生存难度的认定。
//
//澎湖湾：
//澎湖湾为Level C-72内最早的流浪者聚落，成员数目已达约300人。由u/常峰组织建立，外观为普通沿海居民聚落，可以被描述为“海边小村”。
//
//6b8893eea781b2b7.jpg
//澎湖湾村落的图像。拍摄者未知。
//
//村内不存在阶级和特权人员，但由于人类聚落的习惯性，经众成员商讨决定，推举常峰为“名誉村长”，以表示对其发现这片乌托邦的探索精神的肯定。
//
//村内不存在组织成员架构，所有成员均为来到本层级的流浪者（值得一提的是，几乎所有本层级内的流浪者都是该村村民）。
//
//由于本层级的特殊性，农商业的存在毫无意义，故村落仅作为一个精神依托和娱乐社交场所集聚地出现。村落内娱乐设施完善，目前正在筹建独立的社交中心，许多不同行业不同爱好的志趣相投者可以在此地找到知己，以消遣在本层级内无聊的时光。
//
//村落内设有医疗机构，由执业医师团体（5人）经营。由于处于本层级内流浪者一般不会死亡且目前医药品难以获取，故医疗机构仅作为保健场所，许多在此寻求除颤缓解方法的流浪者都无功而返。
//
//村落虽作为独立政体，但不设武装力量。
//
//由于本层级内流浪者间不存在直接利益关系，故所有村民均待人友善，愿意接纳新来的流浪者并尽可能为其找到同乡组织。
//
//有许多流浪者在这里找到了毕生所爱，甚至有两对新人曾在此地喜结连理。
//
//“一群笨蛋”：
//由澎湖湾部分成员脱离而来，主要定居在距澎湖湾主体部分10千米以外的开阔海滩区域上。
//
//由张兵和赵强在昏厥事件次日离开澎湖湾基地后组织建立，后陆续有流浪者加入该组织，这些流浪者亦为因未知原因脱离澎湖湾后流浪，直至被收容至此。
//
//该组织从不主动扩增人员，对待一切的情感态势均为悲观被动的，组织成员似乎热衷于尝试遗忘过去，但这样做似乎只会让他们陷入因记忆中的某些片段带来的更深的痛苦中。
//
//此外，进入该组织的成员均在短时间内选择了皈依道教3。但确定的是，该组织并非传教组织，而更像是一个道家思想研讨小组或者道教爱好者团体。
//
//入口与出口：
//
//入口
//据已有记录称，进入本层级的方式不固定且十分特殊，均为流浪者在经历濒死体验后昏厥，并苏醒在Level C-72内的随机部分，对澎湖湾内居民的有关随机调查记录如下：
//
//隐藏记录
//u/Aaron Edith：进入了Level 35的灵车内，随即昏厥，被发现于Level C-72内的沙滩上；
//u/农康盛：在Level 68内观看电影时腿部抽筋，使其从催眠效果中脱离，并在被固定在椅子上和消化酶作用于其时保持清醒，片刻后昏迷，被发现于澎湖湾市中心的长椅上；
//u/姜烨然：躺入Level C-44内的浴缸中，随即昏厥，被发现于Level C-72内的沙滩上；
//u/Érasme：本人不愿透露，未知。
//u/“Hebe”：本人不愿透露，未知。
//u/Penelope Harrod：在Level C-996被迫连续工作三十小时后昏厥，被发现于Level C-72随机生成的木屋内；
//u/余高义：在Level 2内尝试用杏仁水驯服一只“猎犬”时被攻击，随即昏迷，Level C-72内的沙滩上；
//u/Ellis Finger：在Level 2内尝试切入墙壁时被撞晕，苏醒后自行行走至澎湖湾；
//u/李山河：在寻找Level 32的过程中迷路，未遇见骷髅女皇时便饥饿脱水至昏迷，被u/常峰发现于Level C-72内的沙滩上，并将其带回澎湖湾；
//出口
//嘿，看来得教你点东西了
//比如，其实味觉区不是在舌头上感受酸甜苦辣的？
//比如，脱水和肾衰竭本应该伴随着很多低级中枢的刺激？
//再比如，道教尤为关键的宗旨便是“顺其自然”？
//……
//……
//……
//……
//……
//……
//……
//……
//好吧，我不知道我现在所要编辑的页面还能存在多久。
//朋友，请一定记得尽你所能传播它。
//我他妈真的看不下去了。
//这和我想的完全不一样，我现在所卖的命也毫无意义。
//这太疯狂了，我受不了了，我要阻止这一切继续发展下去。
//
//我是常峰。
//我来自U.E.C.。
//
//
//
//⚠️ 安保通知⚠️
//请您即刻停止阅读
//以下内容仅对持有管理安保超控凭证的管理员开放
//继续阅读可能给您带来不必要的麻烦
//M.E.G.将动用武装力量定位和刺杀非法访问人员
//感谢您的配合
//
//
//
//
//>谢天谢地，U.E.C.的那帮惊弓之鸟看到安保凭证就不敢继续往下读了。
//2568389000382f2f.jpg
//
//
//脚注
//1. 信号搜索范围约为Level C-1至Level C-100。
//2. 即前厅日常饮用水，后室内极为罕见，仅有在某子层级内发现其的有关记录。
//3. 广义道教，即主要讲授如何诠释传统道家思想的派别。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1072{}