//Level C-59
//评分: 
//+11
//+
//–
//X
// 
//
//生存难度：
//未知
//神秘属性
//现象记录C59.jpg
//Level C-59的一张照片，拍摄者未知。
//
//Level C-59是后室C层群的第59层。
//
//描述
//Level C-59不可被以口述的方式描述，其内容很可能会根据描述的内容而做出改变1，所有试图描述这个层级的流浪者都会被传送至Level C-59。在该层级内，M.E.G.尚未找到任何出口，这就意味着，一旦进入，流浪者很有可能无法通过常规手段从Level C-59内切出。
// 
// 
//Level C-59的档案只能被存在M.E.G.数据库，不可以任何方式2进行复制和传阅，否则将发生如上述所说的恶性事件。虽然暂时仍然不清楚哪些传递方式是安全或危险的，但保险起见，M.E.G.仍然决定断绝一切可能会使流浪者无端进入Level C-59的可能。同时，M.E.G.不会救助在明知Level C-59的危险性而仍然选择冒险的流浪者。
// 
// 
//Level C-59的照片显示的是该层级的中心区域，此区域在进行了多次探索之后，被认定为不会随着描述而改变的区域，因此在该部分的流浪者相对安全。中心区域是一条狭窄的走廊，头顶有发出暗淡蓝色的灯管，走廊绵延近几千千米，似乎并没有尽头。从起始点开始，走廊旁的门出现的频率不断降低。起始点的门一般每隔3米左右出现一扇门，而距离起始点约3000米以外的区域，需要行走将近50米才会出现一扇门。所有门的材质相同、大小相同、外观也相同，但当流浪者打开门时，其所看到的场景总是不可描述的画面或场景。流浪者也许会因为门后的异常现象而当场死亡，也许会异常失踪。总之，M.E.G.警告所有流浪者切勿打开或破坏Level C-59中心区域外的任何一扇门。
// 
// 
//根据探险者传回的报告显示，中心区域的气温在3~4℃左右，但随着流浪者在层级中时间的增加，层级的温度在不断升高，探险队离开本层级时，层级的空气温度已经上升至36.2℃，且氧气稀薄，呼气愈发费力。但当探险队第二次进入Level C-59的中心区域时，其内部温度又回到原位。探险队在层级内未发现任何其他流浪者，距离第一小队进入后的间隔超过3个小时的第二分队进入Level C-59时，未发现同样处于原地的第一小队的身影，推测本层级可能处于某种多空间叠加的状态。
// 
// 
//根据指向树脂的探测，Level C-59的常规出口似乎是在中心区域的走廊尽头，但目前探险队已在其内部行进了120千米，仍未找到任何出口。建议所有探险者在误入该层级时，使用特殊手段离开3。
//
//基地、前哨与社区
//由于本层级的异常现象，在此无法建立任何基地、前哨或社区。
//入口与出口
//入口
//目前仅上述提到的方式可以进入Level C-59。
//出口
//暂未确认，在走廊的尽头可能有离开Level C-59的通道或门。
//作者信息
//« Level C-58 | Level C-59 | Level C-60 »
//
//Footnotes
//1. 除了该层级的中心区域。
//2. 如打印、录音、抄写。
//3. 参考层级Level C-82、Level C-117、Level C-196。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1059{}