//Level C-23
//评分: 
//+19
//+
//–
//X
//> 您已进入24小时大数据个人信息监控区域，请保持微笑:D
//
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//Level C-23是后室C层群的第23层。
//
//描述
//Level C-23 是由不同风格的工厂、办公区与无人商店拼接而成的规律非线性层级，占地面积未被计算，但已探索到该层级的边界。Level C-23 中的房间以密铺形式紧密连接，且由短走廊或员工门相互连接。高速Wi-Fi在Level C-23内部全面覆盖，且无论装饰风格，每个区域都会提供充满全区域的、平均照度约为350lx的日光灯照射。
//
//工厂房间通常由现代化的自动化作业流水线组成，不同房间内的流水线产出产品不尽相同，但已发现的流水线产品包括了绝大多数常见于后室的物品与食物。原材料将自作业机械中凭空生成并在机械内部中制作成需要人工作业的半成品，堆砌于需要人工分拣与处理的区域。当流浪者参与作业时，流水线将自动处理人工环节完成后的半成品并产出成品。任何半成品皆不能食用或离开该房间，且破坏机械将使房间中所有未完成的半成品消失。
//
//办公房间形似典型的中下层职员办公区，大量半隔断的格子工位挤占了该类房间的绝大多数区域。工位桌上通常摆有一台旧式计算机设备、一台黑白喷墨打印机与大量空白A4打印纸。部分工位与走廊间摆有各种观赏绿色植物与装满纯净水的饮水机。当办公房间存在流浪者时，流浪者的面部与身体数据将被采集，当流浪者表露出困倦或睡眠欲望时，办公房间将自动降低温度以试图打消流浪者的睡意。
//
//无人商店与前两者不同，具有统一的现代极简风格便利店装潢。商店中摆满了空空如也的货架，一个无人收银台与正在运作的收银机。流浪者可以在收银机的人脸识别模块中刷入自己的面部数据，此时收银台将结合上次刷脸之后流浪者在流水线中的工作时长、流浪者“提供”的隐私数据量及收集的大数据喜好，为流浪者提供“最适合此人”的物品。提供的物品通常是流浪者曾在本层级中提到的物品，如火锅、螺蛳粉、杏仁水、乃至于极为稀有的皇家口粮，但有时收银台也会提供难以名状的结果，记录在案的结果有“异装癖服装”、“新鲜的雄性犬科动物粪便”与“新鲜的人类■■器官”等。
//
//与常规的门不同，员工门是大量出现于Level C-23的大门类型，表现为一扇亮蓝色的附窗电子锁办公门。若想要通过此门，流浪者应当调动自身情绪并对该门连接的打卡器做出一个带有饱满情绪的微笑:D，若打卡器检测到该微笑情真意切，员工门才会打开。无法对空间造成影响的破坏行为将不会对员工门与门框造成任何伤害。
//
//摄像系统遍布一切可活动区域可以说是Level C-23最大的特征。不同型号、不同清晰度的摄像头密铺于天花板与墙壁的夹缝，针孔摄像头普遍存在于任何可能藏匿该设备的物品中，生物所携带的任何可联网设备将强制连接本层级Wi-Fi，并以一切该设备支持的收集方式采集生体信息并上传。任何不存在于摄像系统监视之下的生物将被强行唤醒并给予30秒的倒数计时，若倒数计时结束前生物仍未未回到摄像系统的监视中，该生物将会失去一切物品(包括随身衣物)并被传送至摄像系统仍旧完好的房间中，且此生物在Level C-23的隐私记录与现场直播将会高亮并推送至每一个连接本层级Wi-Fi的终端。此规则对于本层存在的实体同样生效。
//
//每一位进入Level C-23的流浪者将会自动接入一个带有图形前端的未知处理设备，此设备将会在流浪者的视觉中投射包含网络浏览器、推送·广告栏与直播软件的图形窗口。任何连接本层级Wi-Fi的生物都能够通过任意网络浏览器访问每一位曾存在于本层的生物留下的隐私记录，或是通过网络浏览器直播页面/直播软件观看任意仍存在于本层的生物现时的活动直播。Level C-23中偶然存在的播放设备也会随机播放活动直播，通常为被高亮生物的行动轨迹。
//
//> 生存贴士：任何进入Level C-23的流浪者应打开直播软件并收藏所有本层实体的直播间，确认其与自己的空间关系并躲避可能的危险。流浪者应每过24小时刷新一次并检查新出现的直播间，以更新所有实体的动态信息。
//> 生存贴士：任何进入Level C-23的流浪者都不应使用浏览器或直播软件监视人类，但…人非圣贤孰能无过，不是吗？
//
//当该层级的一个房间在24小时内未被生物进入，该房间将被刷新。任何通往应被刷新房间的门与员工门应被标记以防止流浪者闯入。
//
//基地、前哨与社区
//M.E.G. א基地
//截止7.3.2022，M.E.G.正尝试在Level C-23建立一个大型前进基地，但因鲜少有人适应本层级的特性而进展缓慢，且部分人员在离开本层级后仍保留有“无时无刻都有人在看着他”的谵妄状态。
//友好，愿意交易。
//有14~18名常驻人员。
//杰瑞之地
//由杰瑞的信众建立的传教前哨站。
//友好，除非有人以任何方式侮辱杰瑞。
//有24~27名常驻人员，多数赤裸上身并使用沥青在身上黏上蓝色羽毛。
//狄俄尼索斯追寻者
//天体主义者，追求公开、朴素平等与忠于欲求。
//中立，除非你是天体主义者或用酒与他们进行交换。
//有12~13名常驻人员，包括2名出生于后室的新成员。
//入口与出口
//您是否愿以隐私换取安全与便利呢？做出你的选择吧…
//-：
//如果您有幸可以选择的话:D。
//
//入口
//从Level 1切出有一定几率抵达Level C-23。
//枢纽有通向Level C-23的大门，从枢纽切出也有可能抵达Level C-23。
//从任何C层级切出将有较小几率抵达Level C-23。
//出口
//一条满是各种播放设备的长走廊将通向Level C-26。
//在投影于视线中的免责界面以意念点击【否】将离开该层级并进入Level 404。
//在任何电子介质中不间断的输入↑↑↓↓←→←→BA将进入枢纽，以此方式进入枢纽将使得离开枢纽时只会抵达后室C层群对应主群相应层数的层级，如本该抵达Level 0的大门将会抵达Level C-1层级。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1023{}