//Level C-12
//评分: 
//+29
//+
//–
//X
//简繁
//
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//C12A.jpg
//Level C-12的一处外景。
//
//本篇档案的原版由于特殊的层级特性而遭到修改，故由管理员进行重新编辑。
//
//咳咳，我们开始吧，来沃西杠一二，是后室西层群的第十二层，是不是要到描述了来着？Level C-12是后室C层群的第12层。
//
//描述：
//嗯，我是爱慕易寄罗经点小队的成员赵林，这个层级有个最恶心的特点就是会把我们说的每一句话都记录在电子档案上，所有的英文和数字都会被转换成莫名其妙的汉字，还他妈删不掉！所以我现在说什么话你们可能都能看见，那我也没办法了，你们将就着看吧。
//
//Level C-12存在一个特殊的属性，任何在本层级内可以记录的电子档案都会将撰写者的思想和其所听见的内容直接映射到文档中，且每一个非汉字都会被转化成谐音的汉字。
//
//除了这个特点以外，这个层级还会刷新一些上个世纪中国城乡结合部那样的老水泥住房，有些甚至会贴一些瓷砖，但窗户里面的房间都是空的，里面啥玩意都没有，非常的穷，连舔包的机会都不给。不过咱都习惯了，毕竟出来探索物资还要靠自己嘛。
//
//本层级的景观类似于大山深处的小镇，占地面积未知，小镇建筑有且仅有类似于上世纪中国城乡结合部混凝土住房，罕见情况下，这些建筑的表面会贴上瓷砖。根据调查，所有房屋的内部均为毛坯房样式，无物品，不建议进入探索。
//
//然后这里的风景大概就是许多那种土路翻过一座一座山，山上有很多那种很长的坡，坡上就有这些建筑，不过这些建筑一般的分布的挺稀疏的，一条土路要走一段距离才有一个，这些建筑有的时候还会有电线伸出来，然后连着许多电线杆，那些线乱的一批，而且还没有电，不过里面包裹的竟然是银丝！实在是太奢侈了！我和小队还切下好多银线装进了包里……你看到前面的建筑了吗，对，就在前面几百米……小声点！麦克，我在录层级档案呢，你的声音都被录进去了！
//
//值得一提的是，在本层级中的房屋稀松的分布在每一个山头之上，且至少与一条土路相连接，在土路旁有时会出现类似于电线杆的建筑物，上面缠绕着无电流的电线，根据探险者小队带回的样品分析，其中的电线外部为氧化的橡胶，内部则是纯度达到99%的银丝。
//
//哦哦，算了，不管他了，你们就当没听见吧。这个层级我觉得挺怀旧的，这些老房子只有我小时候在我奶奶家的一个老小区玩的时候才能遇得到，这些土路看起来像被拖拉机压过的，虽然路特别特别长，延申的没有尽头，但是几乎每一条路都有这种痕迹，而且我也没看见什么拖拉机之类的交通工具，总之就是非常奇怪。
//
//在本层级中的每一条土路，似乎都具有经过了类似于大型橡胶轮胎碾压过的痕迹，但在本层级并未发现任何交通工具，故无法知晓其产生的原因。
//
//C12B.jpg
//Level C-12的一幢房屋。
//
//嗯，这里的实体呢，我们还没有发现呢，笼统的说就是没有实体。不过只是现在没有，以后就会被发现了也说不定是吧，但是如果你想来这拆这个，嗯，什么来着？哦对，银线的话，那至少现在看来还是安全的，你就尽管来吧。
//
//本层级中暂未发现任何实体，M.E.G.已派出相关人员进入本层级采集银丝，并准备将该层级作为纯银的主要来源地。
//
//基地、前哨和社区
//我们本来是想在这申请一个基地来着，但是我觉得这个说什么话都记录下来的特性实在是让我难受了，你们想建就带人来建吧，反正我想回去。
//
//M.E.G. 精准救赎部门“AG”站点
//由24人组成的资源开采站点，主要收集电线中的银线，每个月定时将银原料运回至M.E.G.总部并获取食物供给。
//入口和出口
//入口
//入口其实是麦克发现的，只要在来沃西杠一九城市里面找到一个看起来很二十世纪八九十年代的中国三层混凝土建筑，然后在里面待着一个小时左右，就能被传送到这里了。
//
//在Level C-19内寻找一幢二十世纪八九十年代中国乡村风格的三层混凝土建筑，进入该建筑一个小时左右，将被传送至本层级。
//出口
//我们的小队是准备拍一张建筑物的照片然后写上来沃西杠一一然后穿越走的，但是有一个队员他的摄像机不小心掉到了一个池塘里，那个池塘很浅能看到底部，但那玩意就是掉下去以后消失不见了，咋找都找不到，可能是穿越了之类的吧，大家都怀疑是不是人掉进去也会穿越到其他层级，不过倒是没有人敢尝试，所以就留下了这个可能是出口的出口。
//
//拍摄一张房屋的照片，并在其中写上Level C-11，11分钟后将会被传送至Level C-11，此方法仅限按照Level C-11档案进行操作，且至少离开过一次Level C-11且的人员。
//跳入一个浅水池塘，将会把你传送至Level C-7。
//还有我也不知道为啥这篇档案一直是锁定状态还解不了锁，你们让管理员来处理吧，别问我了。本档案已进行修复。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1012{}