//Level C-90
//评分: 
//+16
//+
//–
//X
// 
//
//生存难度：
//等级 5
//
//这个层级是险峻的，似如秦岭栈道
//但又是平缓的，就像淮南平原
//万物竞发，花草盎然，但没有一丝生机。
//Level C-90是后室C层群的第90层。
//
//描述
//Level C-90是一片无边际的黑暗的广阔空间，同时也是一片狭窄的有边际的直径约1.2平方米的白色石膏制通风洞。
//
//Level C-90是由泥土填满的大地，同时也是一望无际的淡蓝天空，下着令人口干舌燥的暴雨，狂风也让树叶纹丝不动。
//
//平坦的崎岖山丘长满了高大的矮木丛，没有丝毫水分的沙漠遍是瀑布涌动，冬日的春雨让人感受到夏日的冰凉，迎来了秋高气爽的极寒冷风。
//
//苍天迎来了寒冬，万物复苏，尽是春色满园。
//
//大地刮起了风雨，可正晴朗，俱为阴云密布。
//
//火焰像冰一样冷，仿佛天上的太阳。
//
//冰山像炉一样烫，恰似北极的冻洋。
//
//这里的寂静，震耳欲聋。这里的嘈杂，令人舒畅。
//
//奔赴远方的游人，没有离开过家乡，百年来存放不动的老醋坛，周游了陆海河江。
//
//愚蠢的富豪将聪明展现的淋漓尽致，多才的学者让满船灯火尽覆入海洋。
//
//傍晚的光明十分耀眼，正午的烈阳没有一丝明亮。
//
//无人的荒野尽是闹市喧吵，繁荣的城市没有拥挤人烟，肮脏的河水特别干净，清澈的江流却很肮脏。
//
//书本非常的轻，卷帙浩繁，但又重似泰山，薄如纸扇。
//
//我现在没有杏仁水，就像我如今杏仁水满篮。
//
//挽救众人的是恶行满贯的囚犯，一心从善的苦行僧却对金库虎视眈眈。
//
//盲人把真实之物的虚假看的一清二楚，无人问津的哑巴让演讲众人围观。
//
//你有伟大的如尘般渺小，谦虚的极端自负，清廉的十分贪婪。
//
//你也有光明磊落的偷偷摸摸，陷入泥泞般的一帆风顺，平稳而又飘然。
//
//你巨大如蚂蚁，渺小似飞龙，就像远渡重洋的车马行遍了一望无际的狭窄海峡，行越山地的货船爬上了温暖的冰川。
//
//显而易见的谎言找不到，看不见的诚实却正在眼前。
//
//在这片贫瘠的土地上，富饶的土壤孕育出了繁茂的花园；
//
//可这里又是一片荒野，寸草不生，并无良田。
//
//叶子春意盎然地黄了，花草绚丽多彩地枯了。
//
//来啊，来啊，来的慢如闪电，来的终于去了。
//
//去啊，去啊，去的快似乌龟，去的终于来了。
//
//上啊，上啊，向上掉到了悬崖下的万千尺。
//
//下啊，下啊，往下登达了高原上的最高峰。
//
//废墟正满目疮痍地散发繁荣与安定的气息，木棍正空空如也地飘扬着客观存在的旌旗。
//
//他保住了命，所以他死了。
//舞台上的演奏结束了，但是音乐和歌唱还在继续。
//
//认证成功
//本文档已被专项研发而成的计算机文件保护系统屏蔽异常影响，内容完整，查阅流畅，且经检查没有明显前后矛盾的措辞。
//
// 
//
//生存难度：
//不安全
//精神影响
//随机的实体数量
//Level C-90是后室C层群的第90层。
//
//描述
//Level C-90在外观上看是一座门口有两座相对而立的门，贴有四张对联，两张横批的房屋院子，其房屋外形随时改变，处于的地点也非恒定的，根据观察，房屋在理论上可以随意安置于任意空间条件满足的区域，如Level 11。
//
//该房屋院子的出现及其外观、结构、风格都没有固定规律，但房屋内的物件的出现有一定的规律，以大体积或小体积的各类电子产品，如银幕、电视、台式电脑、笔记本电脑、手机等物件投屏显示内容，内容均为白底黑字的书法汉字，且语言风格与正常人类相似，内容体裁随机但皆为前后矛盾，两象互变的句子。
//
//levelc90a
//由Level C-90内部拍摄的景象，一次房屋变形重塑后的门。
//
//Level C-90的内部装修倾向于中式古典风格，一般体现为旧时大户人家的房屋和院子，当探索者进入Level C-90的内部，一切期间因特性产生的本层所处空间变动都会携带探索者陪同，尽管探索者都是外来的。
//
//暴露于Level C-90内部及周围五百米内的人员不会受到任何生理影响，因为目前没有已知的直接影响导致的医疗问题报告，但其语言风格、行为及情绪会受到一定的影响，包括但不限于：
//
//搜寻熟悉的话题与熟人或旁人进行争论。
//言语的前后部分之间产生相互矛盾，相互对立，且如果描述的是自我情况，其在客观现实中的自我情况便会随言语变化，例如有人说“我现在拉了，但我现在没拉。”，便会发生前半句时期灵验前半句，后半句时期灵验后半句的场面。
//当Level C-90随机刷新所处地点，其后所抵达的所处地点的人类文字均会产生前后矛盾或词不合意的改变，但词汇的变动往往是相对于受影响的文字而言的，已被观察到的影响现象包括：置于其后的否定、形容词的先后或所指对象替换、原文所述思想理念或规则的颠倒替换等。
//如果受到Level C-90所影响的人本身就有一定的暴力想法，影响的介入会使其直接升级为物理上的对抗。
//Level C-90在理论上只要是受影响人员群体内部存在任何的矛盾，在其影响下都会激化矛盾。
//
//另外，在对其本身做具体的描述抑或是资料撰写时，无论是否处于其本体500米内，都会遭遇异常的影响，即文字变为受影响后的文字。
//
//Level C-90的影响对于任何的纸质文件或是电子资料库、写有文字的地方都是有效的，因此自被发现以来，各组织及探索者都遭遇了大量的损失。
//
//Level C-90的内的实体起初被发现有骇笑者、笑魇、死亡飞蛾、悲尸等，但Level C-90在每次抵达新的层级时都会因空间接触而吸收当地的实体，在所处外部层级和地点发生变动时也会随楼体颠簸震死大部分的实体，因此Level C-90的实体数量及种类在理论上也是随机的。
//
//Level C-90的在本层中可以被找到的物件有：
//
//写有任意内容但可被理解的对子、诗歌纸件。
//门口的两对对联，两处横批。
//杏仁水。
//火盐。
//罐装龙肉。
//皇家口粮。
//各类电子产品。
//泛黄的空纸张。
//另外，在Level C-90中，摆有约20件左右的装饰品，包括种有植物（花草树等）的花盆、登有国画的画框、屏风、青铜器、陶瓷器、翡翠玉件等，这些物品的共同点是无法被倾斜和以屹立以外的方式存放，有部分物品因为此特质而无法被转移和回收。
//
//Level C-90的一个较有特点的区域是不会随房屋产生太多空间重塑的后院，后院栽有两棵枣树。
//
//由石砖砌成的矮墙上刻有“在这片贫瘠的土地上，富饶的土壤孕育出了繁茂的花园；可这里又是一片荒野，寸草不生，并无良田。”这句矛盾的话。
//
//后经M.E.G.研究，其中一株枣树所生长在的土壤肥力异常强大，富饶无比，而另一株枣树所生长在的土壤却类似黄土高原的沙土混合体，十分贫瘠，目前尚不知原因。
//
//发现
//Level C-90被发现并调查于2020年的Level C-73的安城居民区，但最早有关Level C-90的记载起源于2017年Level C-8的红星工程队，但早期的出现未引起轩然大波。
//
//2020年，本层突然出现于安城居民区的一处原无人居住的房屋，此事件导致了原房屋的消失不见，并在此后的一个星期内，本层产生的影响一度让安城产生了全体男性居民和女性居民的相互争吵和排斥。
//
//但距离Level C-90约500米外的人员对此却感到十分诧异，他们曾评价那些争吵者：
//
//“滑稽不堪，就好像脑子里除了利益博弈什么都没有，可那些我熟悉的并认为很友好的人，性格也仿佛变了。”
//
//此种影响持续了23天，安城的乱局随着Level C-90的位置变动而恢复正常，在此之后，Level 1、Level 11、Level C-8、Level 8、Level 4等层级的M.E.G.探索者总署的分部人员都一个接一个地报告有神秘房屋和影响出现，而后经过了不知多少变位，于安城对立事件3个月后再次回到了Level C-73的安城，对此组织才进行了专门的定点调查。
//
//基地、前哨与社区
//矛盾文学社
//由自称创建了后室“矛盾文学”的文艺团体配合3位武装人员组成，他们自称要利用Level C-90的特性进行文学创作，他们独特的文学创作方法和作品的形式，与联合图书馆的研究会产生了理念上的争执。
//目前共18人。
//M.E.G.代号“时空猎人”分部基地
//2021年，经安城最新研究发现，利用少量神经递质调节药物与杏仁水成分提取配置出的一种新型药物可以抵御来自Level C-90的精神影响，探索者总署就此派出携带药物的队伍驻扎于Level C-90，以利用传送特性对其他未知区域进行探索，以及在每次传送至居民区时与当地的部门对接。
//目前共12人。
//入口与出口
//入口
//在本层每次传送至新的所处层级后，自该层级进入，入口的出现也自然是随机的，传送和传送间的时间间隔往往也是随机的。
//出口
//直接自本层每次变形后所产生的大门离开。
//目前回收研究的文件档案
//由于门口的两处对联及横批无法被直接回收，代以抄录形式回收。
//
//《对联之一》
//秋山云长燕成双（上联）
//落叶风来人作对（下联）
//横批：残阳相照。
//
//《对联之二》
//枯藤树老河长流（上联）
//竹林花香仍伫立（下联）
//横批：永垂不朽
//
//此外，在本层内部发现有一处不展示的对联，似乎是合著的对子。
//
//一乡二里，共三夫子不识四书五经六义，竟敢教七八九子，十分大胆。（上）
//十室九贫，凑得八两七钱六分五毫四厘，尚且又三心两意，一等下流。（下）1
//
//另有词一首，道是：
//
//《青杏儿·风雨替花愁》2
//风雨替花愁。风雨罢，花也应休。劝君莫惜花前醉，今年花谢，明年花谢，白了人头。
//乘兴两三瓯。拣溪山好处追游。但教有酒身无事，有花也好，无花也好，选甚春秋。
//
//而在2021年，M.E.G.自某次房院变形后的西间发现了三首《采桑子》，道是：
//
//《采桑子·楚江吟》
//浪淘携尽繁沙入，江雨凄凄。漪水临堤，直挂阑前洪有期。
//飘然扬起风筝挂，杨柳依依。屈草相离，景里游人心总怡。
//《采桑子·黄河吟》
//再临萧瑟秋风故，尾续苍龙。往史重重，柳絮相飘落叶中。
//悬河几季无边赴，倘尽昌隆。烛火红红，总是零星夜傍逢。
//《采桑子·对立吟》
//房前何物窗前哮，风月连绵。伫立知焉，不覆年年更对联。
//风来帘幕门中找，花草之间。不尽争喧，又立双方与共掀。3
//
//目前对于Level C-90的探索和研究还在继续，预计未来可能会发现更多物件。
//
//认证成功
//收件箱
//时间：2021年1月3日
//
//邮箱信件：
//
//报告长官，我是柴贺，就在五个小时前，小队在Level C-90中发现了一处刻有字样的石砖，字样早已破损不清了，只隐约从右侧看出一个“恩”字。
//碳年代测量法显示其约于1950年-1955年间雕刻，如果按照在Level C-90里文字的惯例，应是自右向左阅读，即为：“恩 ? ?”，或许会是关于本层的溯源研究的新线索。
//
//基地消息：
//
//基地部收到，请在回到Level C-73后将石砖回收至安城以进一步研究。
//
//邮箱信件：
//
//石砖我们已妥善保存了，并无异常，回见。
//
//检测到网络异常，请您连接最近的后室无限局域网。
//
//404
//
//汝望渊观至久，遭报必有期。
//
//今之乐甚，唯孤独享，乃百年难遇矣。
//
//普天之下，尽有对，亦可立，惟善恶难分矣。
//
//作者信息
//« Level C-89 | Level C-90 | Level C-91 »
//
//脚注
//1. 相传，明代的官员对穿肠曾与一位书僮在堂上以对联的方式战了一场，而后吐血而亡，此对联可能就是当时与书僮共作的。
//2. 此词乃金代词人赵秉文所作，尚不知为何引用。
//3. 此三词，符合平仄和词林正韵。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1090{}