//Level C-46
//评分: 
//+17
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//Level C-46是后室C层群的第46层。属于最早一批被录入M.E.G数据库的层级，具体发现时间和第一发现者已无可考。在早期纸质版本的文件中，本层文件被使用铅笔在抬头处写有“留下来”字样。
//
//streetlight1
//Level C-46的一角。
//
//描述
//Level C-46是一段不断延伸的公路，在道路两旁偶尔能看见伫立的路灯。据流浪者们的口耳相传，Level C-46里只有浓雾天气，无论是在白天还是黑夜，总是无法看见明确的天体和指路标识。
//
//电子设备和机械结构的钟表在这里会受到严重的磁场干涉，指南针或钟表指针会无序地摆动，沙漏里的沙子会不间断地从下往上移动，除了整个天空和大气环境发生变化外，没有其他方法可以有效地辨识此刻的时间。
//
//Level C-46两侧是包围整个公路的建筑物，但目视范围内所有门窗和洞口都无法顺利进入。所有建筑都不留一丝空隙紧紧挨在一块，曾经有流浪者试图攀爬建筑，都会在快要越过屋檐时摔在地上——这些建筑的存在似乎是为了保证所有人都滞留在公路范围内。偶尔会有流浪者宣称在一些民居的窗户处感受到一股窥视感，但没有任何证据可以证明那些建筑里面居住着人或其它实体。
//
//沿着Level C-46的一端不断前进，不时会在路上发现熄火的车子。有些汽车因为抛锚而被弃置，有些是因为没油没电而弃置，有些对于车主抛弃车辆的理由则没有任何头绪——但无一例外，每一个车子都斜靠在路边，没有占据主要通路。
//
//车子驾驶座的车门敞开着，里面车钥匙还插在孔上，离合处还有熄灭的烟头和风干的酒渍。在后座或后尾箱内可以发现推断来自于同一个实体的衣物和生活用品，衣物叠放地很杂乱，食物均处于赏味期但数量较少，偶尔还可以发现可能是和家人或朋友一起拍的合照，但均有一个人的头像被划去。划痕推测是钥匙或指甲一类的尖锐物。
//
//进入这些车辆内的流浪者通常会感受到一种迫切的逃离感并寻求找到道路尽头的渴慕感。几乎所有流浪者都声称这种感觉与他们进入后室世界时抱持的心情类似，甚至更加强烈。他们会尝试驾驶其中一辆汽车，开始在Level C-46上前进。大多数流浪者行驶在Level C-46上，没有任何目的地和头绪，只想单纯地行驶下去。
//
//对于部分从集体中离开的流浪者，集体中的其他人员均表示“理解他的想法和痛苦”并为他祝福。那些流浪者会倾向于保持驾驶，直到身体承受不住或汽车无法继续前进为止。一个在Level C-46里流传甚广的传说可能说明了这种情况——他们曾因为一时的不理解和困惑而驾车离开了当时的生活，由此进入后室世界无法回到原先的生活；假如在Level C-46这条公路上不断行驶，就有可能返回前厅。但在更多时候，我们只能在路旁发现那辆驶离人群的汽车，在车上没有发现任何人。在极少数情况下，车辆会随着人一同消失。
//
//对于消失的流浪者的去向当前无法获知。有时候在其它层级生活的人声称曾在远离基地、前哨与社区的地方发现过他们的踪迹，那时候他们只是在远处望着社区，又很快转身离开；有时候有人在其它层级发现了消失的车辆停靠在公路旁边；更甚者有些人愿意相信他们已经回到了前厅……这些假设以及在此之前的假设均包含猜测因素。
//
//我们会永远留在这里。
//
//其他决定抱团前进的流浪者们通常会驾驶着房车或大型改造车一起前进，在前进路上会不断发现被遗弃的车辆，在上面几乎可以获取足够的食物和杏仁水，也有足够应付大部分情况的衣物、药物和娱乐杂志进行使用。偶尔在集体中会有因意外事故或疾病而死去的流浪者，此时大家会停下，并围聚在路灯下为逝者举行一场简单的葬礼。草草地将人用旧衣物包裹住后，所有人会继续前进。
//
//大多数流浪者声称，在停滞不前时周围会感到逐渐增强的受窥视感，即便气温和湿度仍然维持在舒适的范围内，但总会感觉到一股没由来的寒冷，任何引燃物都无法驱散这股寒冷，反倒会导致流浪者遭受烫伤；只有处于路灯的照明范围内时，这种寒冷才不会进一步对心智造成影响。
//
//驾车前进时并不会感受到这种异样。据一些在此生活多年的流浪者描述，当独自驾驶车辆在公路上不断加速时，两旁的路灯在视野里的距离会不断缩短，由一条连续的温暖的线逐渐凝聚成一个光点，这个光点会驱散寒冷，并带来无尽的温暖——这种温暖恰如以往我们生活在前厅中过着普通的生活，没有任何波澜壮阔也没有任何超自然事物袭击，一种平平淡淡常受我们忽视的，名为“家”的温暖。那光点指引了家的方向。
//
//也许我们永远也没有机会去验证它了。
//
//streetlight2
//尽头以后的道路。
//
//基地、前哨与社区
//该层级不存在已知的基地、前哨和社区。因为没有人永远会留在原地。
//
//入口与出口
//入口
//这个层级没有统一的入口。
//
//自有纪录以来，未发现从其他层级进入本层的方式，一部分流浪者相信存在从其他层级通往本层的通道，但只是仍未被发现。当前所有被发现进入本层的流浪者均系在没有目的地独自驾车时从现实世界切入，通常是因为他们意识到了某件显而易见但一直被他忽视的事情，抑或是产生了急切想要逃离当前生活的想法。
//
//在Level 1和Level 2当中流传着一种说法，那些被标记为去向不明或失踪的流浪者都是通过了一扇仅会被独居者观察到的暗门进入本层。
//
//更多入口有待发现。
//
//出口
//你为什么想要离开这里？
//
//继续沿着这条路行驶下去吧。
//
//他们并不需要你。
//
//是我又搞错了什么吗？
//
//不要多想了-
//
//你并不是不可或缺的。
//
//走吧。走吧。
//
//
//streetlight3
//就这样的默默离开吧。
//
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1046{}