//Level C-52
//评分: 
//+19
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//Level C-52是后室层群C的第52层。
//
//描述：
//Level C-52表现为一个无限大且没有重力存在的纯白空间，在空间中央悬浮着一辆灰色的奔驰S600轿车，这也是该层级中唯一能供人活动的空间。
//
//这辆车没有上锁，但它因内部电线相互切入缠杂在一起而无法发动，其车身内有着许多来源不明的灰尘，这些灰尘会在被清理后的24小时内重新出现，除此之外其未表现出任何异常性质。
//
//鉴于前厅与后室连通的可能性相关研究，在Level C-52中的汽车后座上发现的字条已被归档，具体内容可见下文。
//
//你们好，来自后室的人们。
//我们是囊囋囍壄壅壆，简称寴寷幐幑。
//在前些天，我们首次了解到“后室”并非无聊的人编出来的都市传说，而是真实存在的。
//我们制造了一台可实现小规模切入后室的机器，其原理是惀惁惂惃惄惆惈惉惊惋惌惍惎惏惐惑惒惓惔惕惖惗惘惙惚惛惜惝惞惠恶惢惣惤惥惦惧惨惩惪惫惬惮恼恽惴惵惶惸撡掸掸撧撨撩撪撬撮撯撱揿撴撵撶撷撸撹撺挞撼撽挝擀擃掳擅擆擈擉擌擎擏擐擑擓擕擖擗擘擙擛擜擝擞擟擡擢擤。
//出于某种原因我们不能也不会公开这项技术。第一个实验对象将会是槬槮槯斓斖，若你们看到了这张字条，那就说明实验已经成功了。
//我们后续会进行更多的实验，包括活体实验。
//
//该字条根据字迹可以判断是手写的，但上面的一些重要信息均被打印体的乱码覆盖，且该纸条的下半部分有非常明显的机器切割痕迹，尚不清楚这只是巧合还是后室有意为之。但自从Level C-52被发现之后，Level C-52从来没有凭空出现过除奔驰轿车之外的任何物品，故推测该组织的实验失败了。
//
//在Level C-52被发现的前几天，曾有人报告称Level C-73，Level C-111，Level C-8等多个含有人类基地的宜居层级出现了“空间上的错误”，这些错误包括但不限于天空中出现汽车的影子，建筑物突然扭曲。
//
//原因可能是该层级中的汽车是从前厅被强制插入后室的，它的出现打乱了后室的自然规律，导致后室在没有准备的情况下临时制作了一个新的层级来兼容其。被目击到的错误应是后室正在制造该层级的出入口。
//
//第一名进入该层级的流浪者称，该层级的样貌一开始与Level 0完全一致，但在她探索了一分钟左右后，她身边的墙壁逐渐隐去，露出了纯白的虚空，当她回过神来时她已经站在了Level C-52的轿车顶上。
//
//基地，前哨和社区
//该层级不存在已知的基地、前哨和社区。
//
//入口和出口
//入口
//据目前的发现来看，所有通向Level 0的入口也可能会带你来到该层级。
//也有流浪者称有很小的概率可以通过在Level 0撕开黄色墙纸进入墙后的空间到达该层级，但这一说法未经证实。
//出口
//切出会让你到达Level C-1。
//作者信息
//« Level C-51 | Level C-52 | Level C-53 »
//
//脚注
//1. 根据文档流程正确操作后的Level 11。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1052{}