//Level C-69
//评分: 
//+32
//+
//–
//X
// 
//
//生存难度：
//等级 健康危害-致突变作用
//
//染色体异常
//减数分裂紊乱
//细胞活动异常sky-level-c-69.jpg
//Level C-69的天空
//
//Level C-69是后室C层群的第69个层级。本层级是一片被色彩绚烂的星光所笼罩的灌木丛。
//
//描述：
//Level C-69是一片约有三千万平方公里大小的灌木丛，其天空呈现出五彩斑斓的类油脂纹理。进入过本层级的一部分流浪者将其称为“像泡泡水一样的质感”。而本层天空中所映射的星光则展现出了无法用语言形容的奇异光谱。本层级的异常光线会对任何包括后室实体在内的已知的碳基生物造成影响，这其中就包括身体组织病变与坏死、生物机能异常和无法预测的细胞癌变1。造成这些病变的机理目前还尚无答案，但后室自然科学研究会认为本层级的光线是病变的直接诱因，其原理可能与紫外线类似——被光线直接照射会导致DNA二聚突变的产生。目前后室自然科学研究会还在研究关于暴露于Level C-69所可能造成的心理创伤。
//
//到目前为止，后室自然科学研究会已对三名曾长时间暴露在Level C-69里的流浪者进行了身体检查，这三名流浪者的健康都无一例外受到了负面影响。这些检查报告说明Level C-69对健康造成危害的程度很可能与目标暴露在Level C-69时间长度相关联。
//
//下列文件为相应的检查报告：
//
// - 收起
//
//
//检查报告-AY54M-0
//姓名简写： AY
//性别： 男
//血型： AB
//年龄： 54
//病史： 曾接受过肾脏移植手术
//暴露时间： 约8个小时
// 
// 
// 
//暴露所造成的健康危害：
//
//肾脏组织坏死
//全身毛发脱落
//口腔粘膜脱落
//皮肤息肉明显增多
//牙龈出血
//
//
//检查报告-ZX28M-0
//姓名简写：ZX
//性别： 男
//血型： O
//年龄： 28
//病史： 无先天性疾病
//暴露时间： 约18个小时
// 
// 
// 
//暴露所造成的健康危害：
//
//永久失去生育能力
//全身毛发脱落
//胃出血
//大面积皮肤脱落
//牙齿脱落
//免疫反应基本消失
//视网膜脱离
//静脉血栓明显增多
//
//
//检查报告-YH19F-0
//姓名简写：YH
//性别： 女
//血型： 不明
//年龄： 19
//病史： 无先天性疾病
//暴露时间： 约9.5个小时
// 
// 
// 
//暴露所造成的健康危害：
//
//永久失去生育能力
//全身毛发脱落
//右腹部有肿瘤触感
//皮肤呈中度烧伤状
//牙齿明显松动
//免疫反应显著减弱
//Level C-69里受星光照射的地方都存在一种异常现象：任何使用无限通讯的设备都会遭到干扰。至目前为止，M.E.G.已经测试了包括但不限于无线电话、对讲机、寻呼机和人控无人机等多种电子设备，这些设备均无法在本层正常工作。
//
//实体：
//至目前为止，只有三种实体被发现存在于Level C-69，其分别是猎犬、死亡飞蛾和肢团。由于本层光线的作用，这些实体的身体都或多或少有一定数量的畸形和异变。存在于本层级的猎犬通常有着长短不一的四肢和缺少毛发的表皮。大多数的死亡飞蛾则被发现有畸形的翅膀，有些个体的翅膀甚至无法支持最基本的飞行。在本层级，肢团的活动可谓极其罕见，但所有被观察到的肢团都有着明显多于正常个体的肢体，且实体的皮肤表面都会有大面积的溃烂。
//
//基地、前哨与社区：
//本层级目前没有任何已知的基地、哨所或者社区的存在。M.E.G.已发布相关公告禁止流浪者随意进入本层级。
//
//入口与出口：
//离开Level C-69是一件不难做到的事情，只要在本层级仔细寻找，人们通常能在1-2个小时内找到至少一个出口。
//
//入口：
//在Level C-10的湖底找到一片五彩的水草，碰触它将会被带入Level C-69。
//在Level 69被"来自上方的存在"虏获会有很小的概率将你带入本层级。
//在Level C-25里有彩色星光照射的地方死亡。
//在Level C-99吹泡泡或使用三棱镜会将你传送至本层级。
//在Level C-68打开一扇透着彩色光线的门将会被领入Level C-69。
//出口：
//Level C-69里一扇潮湿的门将会通往Level 7。
//Level C-69里一个阴暗的洞穴会通向Level 8。
//在本层级通过一丛不会映射彩色光线的灌木可以切出到Level 39。
//在本层级入睡将会在Level C-70醒来。
//随机从Level C-69的地面切出将会进入Level 46。
//在Level C-69连续游荡3-6个小时将会逐步进入Level 23或者Level 39。
//作者
//« Level C-68 | Level C-69 | Level C-70 »
//
//脚注
//1. 详情请见“检查报告：在Level C-69里暴露超过6个小所产生的身体变化”
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1069{}