//Level C-53
//评分: 
//+47
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//photo-1489599849927-2ee91cede3ba?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1170&q=80
//Level C-53的观影区。
//
//Level C-53是后室C层群的第53层。
//
//描述：
//Level C-53是一座电影院。除了电影银幕与在黑暗环境里无限延伸的座椅之外，该层级不存在任何其他物品。值得注意的是，尽管该层级内并不存在可见光源，但流浪者无论如何在观影区内移动都会始终处于唯一一片光照区的正中央；并且“浮动”在前方黑暗之中的银幕也会自始至终与流浪者保持恒定的相对位置，大致保证着舒适的“观影距离”。
//
//已经确认每次仅能有一名流浪者停留于Level C-53，并且一名流浪者仅能进入该层级一次。当流浪者选定一张座椅坐下之后，不知来源的光照将渐渐熄灭，并有一部名为《你不在的世界》的电影开始在银幕上播放。
//
//电影内容将不可思议地会是该流浪者的自传：根据目前整合的报告而言，流浪者们在电影内目睹了包括自己的出生、成长、学习等各个时间段内的诸多事件，整部电影的“拍摄”、“剪辑”、“背景音乐”等各项工作都显得极其出色，对流浪者生平事件的选取也表现得事无巨细、详略得当。
//
//但是，电影内容会持续至这位流浪者坠入后室之后的第七天——并且“场景”依然是前厅。电影的演绎貌似有意将重点放在了后半段“‘主角’离开前厅之后的世界”这一部分。
//
//电影时长未知，因为无人留意。
//
//附录：
//当前已经针对曾进入过Level C-53的流浪者们展开访问，以更加深入地了解Level C-53对人们造成的影响。以下是部分回答的抄本。
// 
//1
//以这种方式看到自己的前半生还挺奇妙的哈哈。我就算自己去翻我的那本成长相册都回忆不出这么详尽的过去吧！虽然说我早忘记那本我丢哪儿了，好像是在我老家？
//
//我看到好几个已经连我自己都忘了的儿时画面了……更别说还有爸妈第一次教我走路，第一次带我去学校一类的画面，居然还是特写（笑）。我还看到原来我第一次自己上学时他们有在偷偷跟着我，嘿嘿。
//
//可惜后半截就看的不太舒服……我不见了之后他们发了疯似的到处找……找了不知道几家警局贴了多少寻人启事……呜他们哭的头发都白了好几根……哈哈我真想告诉他们我现在好着呜，真没事啊哈哈哈呜呜啊哈哈……
//
//2
//嗯，就那样吧。把我那傻逼兮兮的生活给仔细的回顾了一遍。有一说一音乐不错，很贴切噢。
//
//然后就……没啥了吧，其实我最开始看时还挺不爽，这东西看上去显得我一直在被偷窥似的。慢慢的看进去后……呃，不是看进去，反正免费看个电影总不亏吧？老子也不知道怎么就不知不觉看完了。
//
//不过后半段的内容应该是虚构的吧？他们居然会找我？他们会找我？还慌成那样？我、我自认都是个烂人了他们有什么必要找我？我不知道死哪里去了他们不是该欢天喜地吗？
//
//……不会的，不会的。
//
//3
//听说有好几个人看到了家人？啧，为什么我没那么好运？
//
//不瞒你说，我在来到这个鬼地方（指着地面）之前是个董事长……当然，我知道那玩意儿在这儿屁都不是。我看到的后半段是我所在的那个企业很快就找到了合适的人来顶替我，公司接着有条不紊地运作……
//
//没什么，就是突然发觉我对企业也不是那么不可或缺。有点儿难以言说的……失落吧。早知如此我还不如多陪陪我妻儿。
//
//4
//我很想给这部——呃，自传？给这部自传电影定个性：喜剧。
//
//反正我是看的笑出来了，呵呵。原来我还干过那么多为了讨好别人而在自己背后割肉的蠢事啊。我居然从角色里脱离出来了诶，看着银幕上那个傻小子为了左右逢源而搞出的那些骚操作……噗呲！
//
//我本可以把它演成一部波澜壮阔的热血大片啊。可惜，没那个机会咯。
//
//5
//我在这里是“流浪者”，在前厅时也是流浪者。
//
//它给我看了一部很无聊的流浪史。听你们说它会演到我掉进这里之后的第七天？我说呢，我人都不见了它还搁那拍，拍了足足一周的都市闲景。
//
//可能难为它了罢，我的生活确实没啥好拍的。少了我，地球照样转。
//
//6
//前半段看的我有点不好意思，毕竟有种被窥视的意味。但是以这种形式再看一回那边的光景——挺好的。那日复一日的日常现在显得是多么奢侈啊，尤其是对我们这种“囚犯”而言……
//
//另外，我很在意影片快结束时给我展示的那最后七天。人们谈论了我的失踪，但好像只是当做了茶余饭后的一点谈资。尽管不太厚道，但我还是挺希望他们能谈久点——毕竟这显得我好像有那么点，那么点……重要、地位什么的，哈哈。
//
//可惜不是啊。
//
//7
//作为一部电影，质量还不错。我不想多谈什么了。
//
//……想家。
//
//基地、前哨和社区
//该层级不存在已知的基地、前哨和社区。
//
//入口与出口：
//入口：
//进入条件未知。但目前所有的切入案例全部发生于流浪者的睡眠期间1。
//出口：
//“观影”关闭后，流浪者的睡意将陡然增长、无法抗拒；紧接着，流浪者便会在自己入睡时的地方苏醒。
//作者信息
//« Level C-52 | Level C-53 | Level C-54 »
//
//脚注
//1. 经样本抽取，当前发现的唯一共同点是：Level C-53的进入者在入眠时总是携带着对往昔的追忆。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1053{}