//Level C-33
//评分: 
//+151
//+
//–
//X
// 
//
//生存难度：
//等级 2
//
// 
// 
//极少量实体
//Level C-33是后室C层群的第33层，发现时间已不可探，其是最早一批被录入M.E.G.数据库的层级之一。
//
//sea.jpg
//在Level C-33内部拍到的照片
//
//描述
//Level C-33是一片海洋，当前尚未发现其边际。Level C-33不会进入黑夜，其天气只会出现两种情况，阴天或小雨，其中后者出现的频率要稍大于前者。该层级的整体环境通常被流浪者们描述为“压抑的”，“令人忧伤的”，“孤独的”。
//
//Level C-33的深度未知，在深度200米之上的浅海区域内，发现了大量的不同种类浅海鱼类1和植物，其构成了一完整的浅海生态系统；但目前为止所有针对深度200米以下的深海区域的探索均告失败，因此目前为止M.E.G.对于该区域没有任何了解。
//
//Level C-33的海面上时常会出现一些人类用品，诸如饮料瓶，易拉罐，渔网，塑料袋，纸盒，烟头，手机壳等；据了解，这些人类用品自有记录以来便一直存在。目前尚不清楚其来源。受困于Level C-33的流浪者通常会使用这些用品作为生存用的道具。
//
//rubbish.jpg
//在海面上漂浮的海洋垃圾
//
//目前唯一已知的进入Level C-33的方法为入梦。进入该层级的流浪者将发现自己处在一艘救生艇上，除去流浪者贴身携带的用品以外，救生艇上不会配备有任何可供使用的物资。因此，有相当一部分海上求生能力较差的流浪者将会在该层级中丧生；他们的尸体至今都未能被找到。
//
//值得注意的是，尽管已经多次记录到有数名流浪者在同一时间段内均身处Level C-33内，但是至今没有任何一名成功脱困的流浪者报告称在该层级内遇到过其他流浪者。目前对该情况的出现有两种可能的解释，但均没有理论支持其成立：
//
//Level C-33过于广阔，以至于受困其中的流浪者相遇的概率极小，几乎可以忽略不计；
//Level C-33具有极为特殊的空间结构，其下辖有数量未知的平行空间，这些平行空间的特点为内部环境完全相同，天气情况同步，但同一时间内只能容许一名流浪者进入。
//实体
//受困于Level C-33的流浪者有一定概率遭遇一人形实体，其只会在该层级处于小雨天气时出现。
//
//该实体似乎是由海水构成的，其呈现状态一般为一身高约160cm的年轻女性，立于海浪之上。据观测，在该实体出现之前，海面上的某块区域内将会自行形成大量的波浪，与此时海面上的风速无关。这些海浪高度不一，一般来说较高的海浪处于区域中心，并最终形成实体；较低的海浪处于区域周围，形成了实体所站立的平台。
//
//在实体形成之后，其会张开手臂，做出半仰头望向天空的动作，并且清唱一首或数首歌曲。尚不知其发声的机理。实体的歌声与20岁以下的年轻少女声音相似，且夹杂有海浪的声音和海鸥的鸣叫2。实体清唱的歌曲不属于已有的人类曲库中的任何一首，其使用的语言也无法被辨认，但是听到歌曲的流浪者通常将其描绘为“忧伤的”，“舒缓的”。
//
//大概是在第五次入梦结束后不久吧——毕竟在这里被困了这么长时间，我都没有啥时间概念了——就在那个时候，我刚发了一场烧，正昏昏沉沉的时候，我看到了她。
//
//就是你们说的那个，会在C33层的海洋内唱歌的少女，我第一次来这里的时候就碰到了她。就像M.E.G.所描述的那样，我面前大概两三百米的地方，海浪突然跃了起来，跟跳起了舞似的。其中最中心的海浪越跳越高，最后幻化成形，变成了她。
//
//那是一个绝美的姑娘，但不知为何整个人的神态看上去很伤心，就像失去了什么重要的东西似的。接着她就开始唱歌了，不是纯纯的清唱，有海浪和鸟鸣给她伴奏。
//
//这……我该怎么形容呢，感觉就像大自然的歌曲一样，纯真优雅，有种古典轻音乐的感觉，没有嘈杂的鼓点和乱七八糟的电音之类的东西，只有清新的鸟鸣和海浪。她唱得很舒缓，声音很甜美很细腻，有种空灵的感觉，直接把我的耳膜击穿一般，一下子就唱到了我的心里。听不懂她在唱什么，我也不懂那个语言是啥，但也不重要。我有一种感觉，就是这才是音乐本来就应该有的样子。现代的歌手根本唱不出这样的意境。意境这种东西吧，很玄乎，
//
//我来具体形容一下吧……感觉她一下子把我拉到了一个我从来没见过的平行世界，还是C33层，但是那个C33层是一个阳光明媚的浅滩，对，有晴天，从来没有在这里记录到的晴天，跟现在的死气沉沉完全不一样。那里有小鱼从海里跃起，有海鸥在天上鸣叫，海水是碧蓝色的，不是跟现在一样的灰色。人们在海滩上欢声笑语，男人们和他们的儿子打水仗，女人们和她们的女儿堆沙堡。
//
//但后来一切都变了。垃圾出现了，对，就是现在随处可见的人类废品海洋垃圾，塑料袋，渔网，易拉罐之类的。海鸥全死了，它们的胃里全是垃圾；海面从碧蓝色渐渐变成了灰色，海里的鱼也消失了大半，只剩下那些生存能力特别强的，但它们大多也不露面了，就像现在一样，要把它们打捞上来要花很大的力气；最后海平面上升，把海滩整个吞没了。晴天不见了，取而代之的是无尽的阴雨，整个C33层再也看不到任何陆地，再也没有任何生机，回不到从前了。只有画外音一直响着，就是她唱的那首歌，那首怀念回不来的从前的咏叹调。
//
//最后曲终，她朝着没有人的方向深深鞠了一躬，随后骤然崩塌。海面平息，就好像什么都没发生过一样。我狠狠掐了自己一把，这不是我的第六次入梦。一切的一切都真实的发生在我的眼前。这也许就是歌声的魔力吧，那些画面从来都没有真实的出现在我面前，但我就是看到它了，像幻灯片一样一幕幕在我眼前播放，我眼睁睁的看着一张张图下来，一切的美好全都没了，回不去了。
//
//我在想，这就是遥远的从前，C33层曾经的模样吗？还是我作为一个也喜欢玩音乐的老东西，只是共情能力太强，想太多了？我突然发现自己看不清东西了，就抹了下眼睛。
//
//我抹到了满手的眼泪。
//
//从Level C-33中生还的流浪者的语录
//
//实体的演唱时长不定，一般介于25至90分钟之间。在演唱完成后，实体的形态将自动崩塌，区域内所有出现异常状态的海浪将回归常态，返回海面，并向四周溅出大量水花。
//
//当前任何试图接近该实体或与之进行对话的尝试均告失败了。曾有遭遇实体的流浪者尝试过使用其随身携带的电子设备录下实体的歌声，但是在流浪者离开Level C-33之后，电子设备中关于歌声的片段将会彻底失真，导致歌声无法辨认。
//
//目前没有发现该实体表现出任何对人类的敌意。
//
// + 更新于2021年12月27日
//基地、前哨和社区
//该层级不存在任何基地、前哨和社区。
//
//入口与出口
//入口
//任何一名流浪者在任何其他层级都有几率在梦中进入Level C-33，自从有记录以来，流浪者在梦中进入Level C-33的概率大约为0.1%-0.5%。
//
//当前尚未找到任何进入Level C-33的快捷方式。
//
//出口
//被困于Level C-33的流浪者将会在进入该层级后的第7次入梦时自行离开该层级，并且回到通过入梦进入该层级之前所在的层级。
//
//作者信息
//« Level C-32 | Level C-33 | Level C-34 »
//
//脚注
//1. 绝大多数体长都在2米以内，为常见的可食用海洋鱼类，如黄花鱼，三文鱼，鲈鱼，鱿鱼，石斑鱼等，但偶尔也有体型较大的掠食者，如鲨鱼等。
//2. 值得注意的是，Level C-33内部不存在任何鸟类生物。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1033{}