//Level C-48
//评分: 
//+27
//+
//–
//X
// 
//
//生存难度：
//安全
//稳定
//无害实体singapore-2148190_1920.jpg
//Level C-48的复式居民楼外观。
//
//Level C-48是后室C层群的第48层。每批进入本层级的人员请勿超过四名。
//
//描述
//Level C-48是一个回字型建筑结构，由外层和里层两栋建筑组成，除该建筑以外的地方均为水泥地。本层级存在极昼极夜现象，每次持续时间约为3个月。极昼现象时，温度为20℃，极夜则达到10℃。
//
//在Level C-48的外层建筑内可以长期生活，但出于安全建议，M.E.G.希望流浪者尽量在此停留时间不超过3个月。本层级具有Wi-Fi，请每一位来到本层级的人员在该档案的附录中写下姓名、到访时间、预计离开时间和所处状态。如果您尚未进入但打算进入，请在排队名单上写下您的名字，并严格遵守先后顺序。
//
//外层建筑为复式居民楼，一共分为20层，每层配备一部电梯和数十个房间，房间内存在基本生活物资以及家具、电器。电器可以正常使用，电视会收到奇怪的信号，打开时会循环播放一段20世纪末的德语新闻。
//
//通过窗户观察，某些房间内存在一些电器已经打开的情况，请勿进入这种房间，因为其中会有一种外观类似于老人的无面灵，会在流浪者进入房间后不久将你赶出门外。如果流浪者执意进入，则该无面灵将锁住其房间的窗户和门。
//
//本层级存在异常现象，请所有进入Level C-48的流浪者注意以下规定：
//
//本层级居住人数不得超过5个人，第6个及之后进入的人员可能会在夜晚失踪。
//在本层级外层建筑当中，请勿跳出居民楼，楼下不存在“大门”供流浪者回到楼上。
//每个进入层级的流浪者都会身处1楼。请勿乘坐电梯到达5楼，如果有无面灵在和你乘坐同一趟电梯时按下了5楼的按钮，请选择最近的楼层离开电梯。
//极夜转变到极昼时，即使没有太阳，也会出现天空从地平线上逐渐变亮的现象。若某天夜里天空出现了类似于极光的景观，请立刻返回家中，并尽可能的躲避任何可能照射到屋内的光线。
//所有房间中，冰箱内的食物会在墙壁挂钟的时针从12点开始，旋转720度后自动补充。请勿在本层级从除冰箱以外的任何地方获取所谓“食物”并食用，包括无面灵可能的赠与。
//请勿连接除乱码以外，任何名称具有字母排列规律的Wi-Fi。
//离开本层级的出口是唯一的，请勿相信任何其他可能出现的带有“出口”标识的门。
//实体
//许多无面灵在此居住，但其不会对流浪者表示出敌意。大部分时间内，他们会忽略流浪者的任何行动和谈话。请勿招惹他们，否则他们会将流浪者扔出居民楼。
//
//基地、前哨与社区
//M.E.G. Level C-48留守观察站
//仅1人组成，居住在第20层南面第3个房间。定期巡查外层居民楼中人类住户的数量，并驱逐未按照约定时间离开的人员。
//
//入口与出口
//入口
//在Level C-8和Level C-10均能找到使流浪者来到此处的红色玻璃门。
//出口
//有且仅有这一个出口，穿过本层级外层建筑的第20层南面的第4个房间，到达Level C-8。
//登记区
//到达时间	姓名	离开时间	是否离开
//201█/6/11	
//安德鲁/科涅维奇
//
//201█/9/18	已离开
//201█/9/25	
//林安思、金贤月、坎雷萨克
//
//201█/12/17	已离开
//201█/1/31	
//斯克鲁弗斯基/杰斐逊
//
//201█/3/29	已离开
//201█/4/2	
//埃维齐/韩正凌
//
//201█/7/10	已离开
//201█/7/11	
//弗洛伊德/萨拉伊格姆
//
//201█/10/9	已离开
//201█/10/16	
//方正杨、特鲁威奇
//
//201█/12/24	居住中
//排队区
//代表姓名	
//1	达拉-安迪科瓦
//2	斐林克彬
//3	理察尔
// 
// 
// 
// 
//
//>档案已加载
//抱歉各位，为了这一层还能维持这样宜居的环境，我们不得不设立这么多繁琐的规定。但我们保证，这些条例都是完全为流浪者考虑的，毕竟如果他们依然还犯以前那些在这里犯的老错误，我想这里就不可能再住人了，是吧……？
//
//elevators-1598431_1920.jpg
//Level C-48的加工厂内部。
//
//Level C-48是后室C层群的第48层。每批进入本层级的人员请勿超过四名。
//
//Level C-48是一个回字型建筑结构，由外层和里层两栋建筑组成。内层建筑是一个被伪装的加工厂，居民楼内侧无任何窗户，因此该加工厂无法被居住人员发现。若要进入该加工厂，则需要乘坐电梯到达5楼，然后按照墙壁上的指示牌走出迷宫。
//
//加工厂内部有许多不知名的机器，和穿着工作服的无面灵。穿白色工作服，头戴红色施工帽的无面灵是此处的“主管”，偶尔会看见其在工厂内部走动，如果流浪者有任何关于加工厂的问题，都可以在该无面灵处获得解答。它会将回复你的问题写在纸上。
//
//以下是对这名“主管”的采访记录：
//
//记录一
//
//日期：200█/1/8
//
//笔记：[数据隐藏]中士
//
//[记录开始]
//
//
//提问：这个工厂是做什么的？为什么要藏得这么隐蔽？
//回答：生产实体。这是我们的规定。
//
//提问：你指的生产实体，指的是生产什么实体？
//
//回答：我们自己。
//
//提问：也就是说，你们是被从这里制造出来的？
//
//回答：不，我们在另一个车间，这里的实体被运往其他地方。
//
//提问：其他地方？你指的是其他层级吗？
//
//回答：按照你们的理解来说，是这样的。
//
//提问：可是你把它们运送到其他层级，它们害了许多我们的同胞。
//
//回答：我不知道你在说什么，这里的所有产品都是没有恶意的。
//
//提问：可是我们在其他地方遇到的，像你们一样的生物，确实伤害了我们。
//
//回答：我不清楚。也许它们的思维受到了影响。
//
//提问：好吧，我先问到这儿了。请你告诉我这里怎么出去。
//
//回答：从主控机器那里左转，一直走到尽头，穿过尽头的门。
//
//[记录结束]
//
//
// 
//记录二
//
//日期：200█/4/10
//
//笔记：[数据隐藏]教官
//
//[记录开始]
//
//
//提问：请问外面的房屋可以居住吗？
//回答：可以。但是有几个条件。
//
//提问：具体是什么条件？
//
//回答：别住太多。
//
//提问：太多是多少？
//
//回答：我想想……（此处该名主管停顿了约一分钟）不要超过6个，否则我们会派专人处理过多的居民。
//
//提问：除此之外，还有什么要求？
//
//回答：我们的机器每个月进行一次调试，会在天上放出强烈的光线，这种光线具有腐蚀性。
//
//提问：也就是说，我们要远离这种光线吗？
//
//回答：是的。
//
//提问：就这些了吗？
//
//回答：别去拿我们这里的住户的食品，即使它们愿意给你，这种食品对你们来说有剧毒。
//
//提问方：好。
//
//回答方：另外，别从楼上摔下去了，你会回不来的。
//
//提问方：我清楚了，非常感谢。
//
//回答方：不用谢。
//
//[记录结束]
//
//我们注意到工厂里有许多专用的Wi-Fi线路，为保证其不受影响，我们已将关于Wi-Fi的使用提醒列入流浪者需要了解的居住须知当中。为了保证流浪者不会在本层级长期滞留，我们安排了一位携带武器的人员在本层级值守，确保一切入住工作平稳进行。
//
//由于某种未知原因，本层级会不时出现通向其他层级的出口，经过大量调查和探险后，我们确定第20层南边的第4间房屋所通向的层级是固定的，因此我们将关于出口的引导内容加入行为准则，以指导流浪者安全通过本层级。
//
//入口与出口
//入口
//在Level C-8和Level C-10均能找到使流浪者来到此处的红色玻璃门。
//出口
//穿过本层级外层建筑的第20层南面的第4个房间，到达Level C-8。
//在工厂主机器的左边走廊尽头有一扇门，走入后会回到来时的层级
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1048{}