//Level C-87
//评分: 
//+32
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//Level C-87是后室C层群的第87层，也许是一个大型的综合商场。
//
//描述：
//
//Level C-87似乎是一个由人类已知所有建筑组合成而成的某种大型综合商场，但是无法明确其内部构造。
//
//由于Level C-87的特殊效应，所有试图拍摄Level C-87的行为都会被无法预制的意外打断或者拍摄出来的照片呈现无法观测的黑色，同时进入过Level C-87的流浪者在描述Level C-87时，精神上都会出现一种不可逆转的特殊遗忘状态，因此无法获得任何关于Level C-87的内部构造的有效情报。不过在流浪者们描述关于Level C-87环境的时候，总是会大量采用类似于“熟悉的”“曾经见过的”“有种小时候的感觉”等词语去描述关于Level C-87的环境，同时在现有的对Level C-87的记录来看，流浪者看到的Level C-87环境似乎都不相同。
//
//其中大部分人将Level C-87描述为：年幼时的儿童公园、和朋友去过的游乐园、曾经居住过的公寓，以前的老家，故乡的镇子。
//
//可以确定这些都是流浪者曾经所居住过并且值得怀念的地方。
//
//虽然有大量的关于Level C-87的描述，但是这样混乱的描述让人难以确定Level C-87里真实的状态，不过几乎所有的流浪者在描述中都提到了“商场”。因此M.E.G.推测Level C-87是一座有着特殊状态的大型商场，而这个结论在一位流浪者提供的“旧友”的照片中得以证实。
//
//Level C-87的状态似乎因人而异，层级的状态取决于流浪者本身。
//Level C-87似乎只能同时存在一个流浪者，目前尚未收到有流浪者相遇的报告。
//关于Level C-87的相关总结：
//
//Level C-87是一个拥有无限大空间的大型综合商场，Level C-87里有许多适用于人类使用的物资，大部分为家电和食物，食物以一种未知的方式进行补充。
//除了能够找到大量现实常见的食物以外，还有大量杏仁水以标准商品包装放置在饮用品区，同时也存在大量相同包装的淡水和蒸馏水，此外有一些特殊食品以大量堆积的形式放置于商场的任意地方，包括但不限于：
//未知成分的母乳；
//第一次吃到的零食；
//与朋友分享过的食物；
//食用后会产生怀念的三明治；
//已逝亲人曾经赠送或者制作的食物；
//以上食物拥有与“旧友”相同的性质，经由试验，食用不会对人体造成任何损害。
//
//Level C-87中拥有稳定的供水供电以及稳定的Wi-Fi连接，除此之外还拥有供人类休息的房间，据流浪者报告称房间与记忆中的卧室相同。
//Level C-87拥有一种能够影响到人类获取该层级相关信息的效应，该效应能覆盖影响精神和电子产品，使得无法通过口述和摄影传递信息，目前确定该效应对人类有效，而“旧友”的照片不受该效应的影响。
//该层级只存一个实体，M.E.G.将其命名为“旧友”。
//　
//　
//　
//
//旧友的照片.jpg
//“旧友”的照片，该照片未进行处理与出现损坏。
//
//“旧友”
//　
//　
//“旧友”是只存在于Level C-87的实体，“旧友”与Level C-87一样，所有流浪者都无法准确统一的描述它的样貌，并且流浪者们在描述关于“旧友”时，更愿意采用某个独特的名字来称呼它——某人名字或者是昵称。
//
//在流浪者的描述中，“旧友”通常被形容为非常熟悉且让人感到怀念的老朋友，但是外貌并非是流浪者已知的任何一个人，即便如此流浪者仍然会对“旧友”感到熟悉和怀念，甚至对此坚信不疑。在见到“旧友”的时候，流浪者会产生一种难以言喻的惊喜，孤独和悲伤的情绪会立刻消失得无影无踪。
//
//“旧友”与流浪者第一次接触的时候，通常都会以许久没有见到流浪者的姿态和流浪者打招呼，并且会告知流浪者熟知的事情来增强可信度。在获得流浪者的回应时，会邀请并且希望能够和流浪者一起在Level C-87中玩耍或者叙旧1。
//
//- 结束档案
//当流浪者同意“旧友”的邀请时，它会带着流浪者在层级中走动，并且深入讲述着关于流浪者过去的事情，当“旧友”开始讲述的时候，流浪者会发生某种奇特的精神变化，对此大多数流浪者声称在与“旧友”相处的时候，周围的一切变得与过去相似的场景，同时能够感觉到该场景给自己带来的安心感。M.E.G.通过调查认为这是某种精神上的治疗，而结果也是如此，大多数流浪者的精神疾病能够在“旧友”的治疗下痊愈2。
//而当流浪者拒绝“旧友”的邀请时，它则是发出奇怪的无法理解的语言跟随在流浪者身后，直到流浪者同意它的邀请为止，不过也有流浪者称在拒绝了“旧友”的邀请后，它是以某种类似于保护的状态跟随在自己身后，并且不愿离去。
//“旧友”似乎能够记住流浪者，如果流浪者答应会给它带来什么礼物的话，它会非常高兴且期待着流浪者的再次到来。
//
//当流浪者提出要离开Level C-87的时候，“旧友”会显露出不舍，并且试图挽留流浪者。此时要求与“旧友”合影，“旧友”会同意流浪者的要求。通过任意一台拍立得照相（无论其内部是否含有胶卷），都能够获得一张由数码冲印而非拍立得相片组成的照片，不过无论如何去拍摄，都只会获得只有“旧友”一个人的照片，同时“旧友”会强烈要求流浪者随身携带这张照片3。
//
//　
//经由提供的照片确认，“旧友”是一个有着人类的特征、无法辨识面部的小型实体，由于该层级的效应影响，无法进一步确定该实体的具体情况。
//　
//
//　
//
//警告
//请不要尝试以任何形式攻击甚至试图杀害“旧友”。
//这将会是非常糟糕的结果。
//如果您不希望失去一切的话。
//请停止您的暴力行为。
//
//
//
//
//
//
//离去
//关于“旧友”的死亡记录
//
//以下是M.E.G.工作人员与一位自称杀死了“旧友”的流浪者进行的谈话。
//　
//[第一次记录开始]
//工作人员：您好，根据报告，您自称是您杀死了“旧友”是吗？
//流浪者：是的，我杀死了她。
//工作人员：好的，那么您是采用什么方式杀死她的？使用了杏仁水或者其他什么方式吗？
//流浪者：用手。
//工作人员：什么？
//流浪者：我用手掐死了她，啊也许还有刀……她就那样躺在地上，然后我用刀用手把她杀死了，她没有挣扎，没有流血，也没有声音，我就一直、一直、一直——
//【流浪者出现精神恍惚】
//工作人员：呃，请您冷静一下，您的意思是说您用简单的方式就杀死了“旧友”？
//流浪者：是的。
//【流浪者情绪突然稳定，并且展现出呆滞的状态】
//工作人员：嗯好的，那么可以询问您杀死“旧友”的理由吗？
//流浪者：……理由？
//【流浪者再次出现精神恍惚】
//工作人员：是的。
//【流浪者陷入沉默，在几分钟后，表现出一种极度恐慌的表情】
//流浪者：我什么要杀了来着，我为什么要，因为、因为……我不记得了！我不记得了！我什么都不记得了！！我是谁！我为什么、为什么、为什么要这样做！
//流浪者：我不知道我不知道！！为什么我什么都不记得了？！！
//【流浪者出现记忆缺失和情绪崩溃的异常状态，并发出难以抑制的尖叫。】
//工作人员：请您冷静！现在很安全。
//【流浪者持续发出尖叫】
//[第一次记录结束]
//
//[第二次记录开始]
//【在经过数小时的心理辅导后，流浪者的状态恢复，但仍存在精神萎靡的症状。】
//工作人员：好的，您现在感觉如何？
//流浪者：我感觉好多了，很抱歉，我没办法控制自己……从那个地方出来之后我就一直记不起来很多事情，不知道为什么，我以前的记忆应该很好的才对……
//工作人员：值得注意的地方，请问您是从什么时候起有的这个状态，是在杀死“旧友”后吗？
//工作人员：以及不知道您还记得您的名字吗，根据带您来的同伴所言，您是■■■，您认识这个名字吗？
//流浪者：我不记得了是什么时候的事情了，嗯？……■■■？唉？这是我的名字？不……我没有印象。
//工作人员：……好的，那回到之前的内容，能否请您讲述一下您要杀死“旧友”的理由，不用担心，这里是M.E.G.，您会非常安全的。
//流浪者：好、好的，我尽力……我不知道我是否记得正确……我……
//【流浪者陷入某种痛苦回忆】
//流浪者：我……我似乎是…那个人，她一直都在重复着……很不喜欢的事情，她好像只能……重复那些事情，然后我就杀了她。
//工作人员：重复那些事情，您是指过去发生的事情吗？
//流浪者：也许是吧，我不确定。
//工作人员：好的，您是出于突发的情绪所以袭击了“旧友”吗？它没有对您的袭击进行反击吗？
//流浪者：也许是突然吧也许……嗯，我能记得的是她什么也没有做，什么也没有做……不……
//【流浪者发出痛苦的呻吟】
//流浪者：也许是我做错了……
//【流浪者出现啃咬手指抓挠肢体等疑似自我伤害的情况】
//工作人员：等等，请您冷静，不，没有人责怪您，这并非是您的错。
//【流浪者再次出现崩溃的状态，在经过注射镇定剂后，流浪者的状态稳定了下来】
//[第二次记录结束]
//
//[第三次记录开始]
//流浪者：抱歉，请问还有别的需要问的吗？
//【在注射镇定剂后，流浪者展现出一种奇怪的稳定状态】
//工作人员：额好的，那么接下来是关于层级的事情，在您杀掉“旧友”之后，Level C-87是否有出现变化？
//流浪者：变化……啊，灰色的……商场？
//工作人员：商场？能否提供一下具体内容？
//流浪者：一座很大的商场，看上去什么都有，但是是灰色的，静止的，就是看到的那种灰色的，什么颜色都没有。
//工作人员：从视觉上观察到的灰色吗？
//流浪者：是的。
//工作人员：嗯，那么请问您认识这座商场吗？
//流浪者：我不认识那里，我还是第一次来那么大的地方……为什么这样问……？
//【流浪者再次出现记忆障碍的状态】
//工作人员：好的，只是例行流程而已，请您不要在意。
//工作人员：感谢您的合作，这个是最后一个问题了，以当前的记录来看，想要从Level C-87离开需要与“旧友”告别，那么在您杀死“旧友”后是如何离开Level C-87的？
//流浪者：………………离开？
//【流浪者出现偏执的狐疑】
//工作人员：是的。
//流浪者：没办法离开，门也打不开，啊怎么样也没办法把她叫起来，怎么走也走不出去，走不出去啊，什么人都没有，好安静好安静，好大的商场，从来没有逛过那么大的商场，怎么样都会回到她的边上，我想离开的，但是没有办法离开，离不开啊，离不开啊。
//【流浪者出现呆滞，并且偏执的低声讲述】
//工作人员：没法离开？是因为“旧友”死亡的关系吗。
//流浪者：不知道，但是她好像真的死掉了，一切都停下来了，太安静了，我什么也听不到什么也做不了，我一直一直一直在那里。
//【流浪者持续异常状态】
//工作人员：那么您是如何离开的，根据您的说法，您应该没有办法离开才是。
//流浪者：……
//【流浪者停止说话，并且以一种不可置信的眼神看向工作人员，随后露出痛苦的表情】
//流浪者：我……我做了什么，我一定是做了什么，我……我好想，对我、我想起来了我想起来了！
//【流浪者从自己的口袋里掏出来某种碎片】
//流浪者：我把她的照片撕掉了，我生气地撕掉了，是她把我送走的，是她送我离开的！！！我想起来了，我不应该这样地做的，我不应该做的！！！
//流浪者：我不应该这样做的！！帮帮我！！！帮帮我，拜托——拜托你们，能不能把这个修好，我怎么样都做不到，我怎么样都做不到！！！为什么啊……为什么要来送走我！！！为什么！！
//【流浪者陷入无法控制的偏执和求助，并失声痛哭】
//工作人员：请冷静！我们会帮您的，请您详细说明您需要的帮助。
//流浪者：帮帮我帮帮我帮帮我……帮帮我修复这个照片。
//【流浪者的情绪开始恢复，但是仍然没有脱离悲伤的状态】
//流浪者：我……没办法修复它。
//工作人员：好的，我明白了，我们会想办法修复照片的，在此之前，请您冷静下来，耐心等待好吗。
//流浪者：我、我知道了……我会的。
//工作人员：好的，感谢您的配合
//[第三次记录结束]
//
//在合成照片碎片后，我们从照片后面发现了并非由该流浪者留下来的笔记。据推测极有可能来自实体“旧友”。
//
//你应　　经离去了　当然　成年　　分别是必　　事情　你的遗忘　很正常　所以不　　感　悔　因为你　已经做好　继续前　　来　准备
//很　歉　　能做到的　　太少了　　只能送　　你安全　　离去
//但是　　很高兴　感谢你　　记得　　
//
//永别了　　
//
//　　　　　朋友
//
//
//
//在之后的调查中，我们没有再收到过关于该流浪者再次进入Level C-87的报告。
//（特别注意：在调查期间仍有其他流浪者再次进入到Level C-87并见到旧友的情况，因此Level C-87的层级状态极有可能因流浪者的不同而改变）
//
//
//
//为此我们准备了用于Level C-87状态更改后的档案
//
//
//
//基地，前哨与社区
//
//因为该层的特殊性，无法在此建立基地，前哨与社区。
//
//入口与出口
//
//入口
//
//当流浪者处于孤独的状态时，打开并通过一扇商场的大门，有一定概率会来到Level C-87。
//在任意海洋球池中玩耍并且呼唤“旧友”的名字后睡着，从海洋池底部切入Level C-87。
//在穿过任意一扇门的时候有极小概率进入Level C-87。
//出口
//
//告知“旧友”要离去的事情，在互相道别后，进入任意一扇带有EXIT标志的门，会进入任意安全的层级。
//作者信息
//« Level C-86 | Level C-87 | Level C-88 »
//
//Footnotes
//1. 请尽可能友善且礼貌的答应“旧友”的邀请。
//2. 无法治愈的人通常都是在童年时期遭受过着严重精神创伤的流浪者，也许“旧友”需要更多时间去治愈他们。
//3. 根据流浪者的报告，该要求会在流浪者试图丢弃照片时回想起来，直到流浪者放弃丢弃才会淡化消失。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1087{}