//Level C-62
//评分: 
//+27
//+
//–
//X
// 
//
//生存难度：
//等级 2
//
// 
//精神干扰
//非实体威胁japan-725795_960_720.jpg
//Level C-62。
//
//Level C-62是后室C层群的第62层。该层级是一片破败不堪、无边无际的都市废墟。
//
//描述：
//Level C-62内矗立着数量众多的建筑，但是几乎全部破败到无法辨认出其原本用途。尽管建筑已经残毁至此，但是却不可思议地颇显“坚固”：当前已经发现早已摇摇欲坠的危楼却至今屹立不倒、以及早已遍布裂纹的玻璃却无法进一步击碎等多种反常现象。Level C-62凭借着这种毫不自然、尽显诡异的性质持续“定格”于它最初被发现时的模样。此外，该层级的天空始终被阴云所笼罩。
//
//流浪者们通常能在Level C-62的建筑里发现多种食品类物资，包括而不限于杏仁水、罐装龙肉、皇家口粮。它们一般会随机出现在损坏家具的附近，例如缺腿木桌的桌底、被挖空海绵的沙发破洞内、以及箱门掉落的冰箱里等。上述物资的数量可观，因此Level C-62本质上是一个良好的物资采集地。
//
//house-3466731_960_720.jpg
//Level C-62内的一栋大楼。
//
//但是，M.E.G.强烈建议无关人员不要进入Level C-62，并已将Level C-62的进入方式归入隐藏信息。
//
//因为，当前已经确认Level C-62拥有一种力度极深、范围极广、以及不可逆性的精神改变能力。具体而言，在Level C-62内滞留愈久，人类就愈会慢慢地暴露自己的阴暗面。无论受影响的个体原本有多么的善良与温和，都必然会逐渐滋生出自私、邪恶、黑暗的思绪与行动，最终沦为一名纯粹的恶人。
//
//该过程所需要耗费的具体转变时间未知，因为无从试验；但根据M.E.G.前线小队的数次试探性探索，现已将12小时划为安全时间。若在Level C-62内停留不超过12小时，就不会受到上述精神影响的干扰。
//
//首个发现Level C-62并就此驻扎的团队隶属M.E.G.，它的其中一名队员留下了一份日记。根据回收到的日记内容（已附于下方），当前猜测Level C-62需要大约五日的时间以彻底改变一个受影响的主体。
//
//除此之外，Level C-62中也存在有数量稀少的实体，不过种类繁多，包括笑魇、肢团、死亡飞蛾、钝人、清道夫、骇笑者等等。但是，所有实体都对人类显得尤为惧怕，而且会主动避开后者。原因不明。
//
//回收的日记：
//4月26日 星期二 天气阴
//
//嗨，日记，我的老朋友。
//
//我今天跟着部队来了Level C-62……老实说，我很不喜欢这个地方。这里除了废墟还是废墟，还有那群一如既往喜欢神出鬼没的实体。
//
//我的左手被一只骇笑者咬掉了……要不是老三扑上来拗断了它的脖子，下一个被咬掉的或许是我脑袋。放心，事后止血和消毒做的很到位，而且断的不是右手，不妨碍咱跟你聊天。:)
//
//老大他们都叫我先想办法回去，不过我拒绝了。我已经因为自己的疏忽大意不小心遭到袭击而拖累了团队脚步，怎么可以又继续因为我破坏整个团队的节奏？我会继续和这个该死的地方周旋，看看这里有没有什么可以捡回去的玩意儿。
//
//要是我有老三那么壮就好了啊。哎，也就想想了。
//
//有一说一，撇开那些挨千刀的实体不谈，这里其实勉强能住。我在角落里翻到了一张还算干净的旧床垫，第一晚就先这么凑合着睡吧。
//
//P.S：我可算改掉写日记还要打草稿的毛病了。
//
//4月27日 星期三 天气阴
//
//中午好，日记。
//
//今天我们大家都不太对劲……我现在仿佛宿醉般的头痛，一直有股挥之不去的昏厥感和焦躁感死死地箍着我的大脑。我还以为是不是因为断臂的伤口太严重了还是啥，结果一问，才发现兄弟们都是这样。
//
//邪门。直觉告诉我，就是这个层级在作妖。此地可能不宜久留。
//
//哈哈，其实仔细想想也没必要那么过度担心。更别说你只是个笔记本，就更没必要了。真要受苦的话也是我们小队去受对吧……
//
//我们今天捡到了不少杏仁水还有皇家口粮什么的东西，收获颇丰呢。
//
//4月28日 星期四 天气阴
//
//早。日记。
//
//昨天晚上那群家伙又偷偷瞪了我几眼，那个眼神活像我小时候的那家傻逼邻居还有他们家的那条蠢狗。
//
//凶狠又恶心。
//
//我就知道……我就知道！他们早就在心底嫌弃我这个拖油瓶了！老三那天出手救我也只是想显威风！
//
//呵，下一步呢？他们下一步准备做什么？现在没人有胆量敢直接撕破脸，那我倒要看看谁会先发制人！
//
//我现在就开始准备。祝我好运吧，日记。
//
//断了只手终究是有些不方便。拜你所赐，天杀的世界。
//
//4月29日 星期五 天气阴
//
//晚好，亲爱的日记。
//
//我昨天肯定是中邪了……我都写了些什么啊？我……我都瞎想了什么？
//
//……
//
//我大概是压力太大了吧，哈哈。我多休息休息，应该也就没事了。
//
//对了，奇怪的是从昨天开始，那群实体就一直在躲我们。虽然不清楚是什么情况，但是起码算件好事，还不赖。
//
//4月30日 星期六 天气阴
//
//有人死了。是队长。
//
//我不相信老三说的“意外”。结合老三以往的倾向以及队长的身份……我实在不敢相信他的说辞。
//
//我本来以为这种独木桥上挑担似的平衡起码能坚持到我们回去为止……看来我还是想的太好了，哈哈？
//
//我不能断定是谁动的手、以及为什么要动手。但我敢断言，我这个四肢不全的累赘就是下一个要被推进桥底深渊的牺牲品。
//
//我本来谋划着收敛爪牙，暂且做个敲骨吸髓的寄生虫，慢慢的等待机会。现在看来，我再不主动出手，我就活不到下一个明天了。
//
//老子不可能引颈受戮。
//
//亏我昨天还在反思，还在质疑自己：这好吗？现在看来，生存与扩张的死局迟早都会把人们心底最原初的兽性逼出来。
//
//丛林法则从来就没有消失过。要么杀，要么被杀。
//
//把人划分成善恶简直是荒唐。你说是不是？善与恶本质上都只是一种趋利避害的手段而已——只要可以笑到最后，只要可以变成最后的赢家，什么方式、什么过程，我去他妈的吧！
//
//回想起从前的“善良”，我才发觉我只是没有践踏别人的勇气与实力。呵呵。
//
//所谓正确，就是对自己的深信不疑。我绝对不会再做那个活该被枪指的“好人”。
//
//想明白之后，我忽然有种从内抒发到外的畅快，仿佛卸下了千斤的担子。我讲不出来，但似乎有种本真的、但一直被我压制的什么东西……重见天日了。
//
//我知道这描述很怪，但我真的是这种感觉：这是一种恍若初生婴儿理直气壮地索要食物般的自然。
//
//好了。今晚，我无论如何也要动手。祝我好运吧，朋友。
//
//
//后续调查没能发现该小队的去向。日记编写者以及其队友的命运依然是未知的。
//基地、前哨和社区：
//如上所述，Level C-62曾经有过一座由M.E.G.小队建立的探索前哨。但它最终却因为小队成员们人格恶化之后开始的同室操戈而就此荒废。M.E.G.由此发现端倪，并逐渐探明Level C-62的反常影响。至此，M.E.G.不得不叫停了所有在Level C-62进一步扩大基地规模的计划。
//
//入口与出口：
//入口：
//入口信息已隐藏。该层级仅限得到指令的拾荒小队进入。
//
//- 信息已展开。
//目前仅允许拾荒小队定期进入Level C-62采集资源，并须做到12小时内速去速回。
//
//Level C-62的进入方式较为特别，因为当前没有发现任何独自切入的方式。若想进入Level C-62，人数必须达到6人或以上。已知进入方式如下：
//
//脱离Level C-11文档内的引导并放空思绪，即有几率切入Level C-62。
//在Level C-71森林的雾气内四下穿行，即有几率切入Level C-62。
//远离Level C-140的人群，即有几率切入Level C-62。
//更多入口尚待探查。
//出口：
//需在尚未受到层级影响之时让众人围成一圈并低头闭眼；在这样的动作中保持沉默，便会切出至Level C-11。
//更多出口尚待探查。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1062{}