//Level C-55
//评分: 
//+18
//+
//–
//X
// 
//
//生存难度：
//等级 5
//
// 
// 
// 
//Level C-55为后室C层群的第55层，于2021年4月28日被发现。
//
//描述
//building-76937-640.jpg
//公司办理大厅唯一一张照片
//
//Level C-55的内部环境类似于办公大楼的内部，一楼外观上是某公司的办理大厅，但沿着接通大厅的走廊或楼梯向内深入可以进入公司总部。办理大厅是流浪者进入该层级的初始地点，本层的装修风格接近于二十世纪八十年代，但厅内的基础设施却可以追溯到1929年。在办理柜台附近的冰柜里可以找到大量杏仁水，在办理柜台抽屉里可以找到火盐、皇家口粮、杏仁制品等重要物资。
//
//办理大厅的危险性会随着时间逐步上升，根据现有信息可以推断出一种危险实体“同事”有时会从办理大厅的电梯出现在本层级，并直接导致滞留在该厅的流浪者死亡，因此不建议流浪者频繁前往办理大厅，如果听见办理大厅有打卡声，这意味着“同事”已经出现在该层级，最佳的应对方案是待在某一办公区里不要出声， 最好躲在桌子底下等待（不要尝试去观察“同事”的模样，“同事”对流浪者的目光极其敏感），直到办理大厅再次传来打卡声1。不必担心越来越近的脚步声，“同事”不会随意出入不属于自己的办公区，流浪者被攻击的原因可能是流浪者占据了他的办公区。
//
//走廊由大理石地板组成，每条走廊大约宽5m，各个走廊可以向一个方向延伸50m以上，有时也只有1m。公司一楼的前后门全部上锁，进入该层级的流浪者至少要在此待够24小时才能从大门离开。公司电梯正常运行，但建议流浪者走楼梯，通过电梯提前离开经常会导致流浪者失踪。该层级每次只能进去一名流浪者，且公司内部不会出现任何人。值得注意的是，楼梯的墙壁上通常涂有一些油画、水墨画以及不明所以的文字，以下是已经发现的具有特殊效应的文字:
//
//▲“不想工作”
//
//该文字出现的概率极小，用手触碰该文字将直接被传送到一个安全的层级。
//
//▲“电脑又死机了”
//
//触碰它会被传送到Level 404。
//
//▲“公司好寂静啊。”
//
//触碰它会导致“同事”在一分钟内通过电梯出现在该层级。
//
//▲“今晚来点惊喜吧 =）”
//
//触碰它会导致大量派对客通过电梯来到该层级，你不会想要参加这场派对的。 在离职前，有什么能比在公司开场跳槽派对更加刺激的呢？ =）
//
//▲“不要加班”
//
//触碰它会使老板荟枞老板办公室赱傗徕。
//
//
//本层级的公司总部可以根据危险性和特殊性划分为三个区域。
//“办公区”
//“办公区”是本层级分布面积最广的区域，同时也是相对而言最安全的区域。“办公区”表现为无数个被高大木质屏风所分割的小空间，小空间内部的办公用品十分齐全，流浪者在办公桌抽屉里可以找到少量补给。流浪者可以在办公区内随意走动，但前提是不要发出太大声音。办公桌上通常放置着1~2台电脑，流浪者不应主动打开电脑，当电脑突然自动开机的时候流浪者应迅速关闭电脑，电脑开机时过大的噪音会将“老板”引来，在本层级睡觉也会导致同样的危险结果。
//
//“公共厕所”
//该区域入口由黑黄相间的移动栅栏封锁，并且本层级所有栅栏板都写着同样的话“维修中，请勿进入。”目前M.E.G对“公共厕所”内部环境所知甚少，目前所有离开Level C-55 的流浪者皆是在“办公区”内度过24小时，不存在任何在24小时内进出“公共厕所”的记录。由于上述情况的诡异，不建议流浪者尝试进入“公共厕所”。
//
//“老板办公室”
//terror-961396-640.jpg
//某流浪者引走“老板”后拍摄的图片
//
//该区域为危险实体“老板”的居住地，不建议流浪者过于接近。“老板”会在公司出现较大噪音时从办公室走出，此时整个层级会陷入黑暗，唯一的逃脱方法是迅速冲进“老板办公室”，而这通常会导致流浪者被传送到终点。
//
//基地、前哨和社区
//该层级不存在已知的基地、前哨和社区。
//
//入口与出口
//入口
//抱有愤怒等负面情绪进入Level C-996的一扇用红字标注有“老板通道”的未上锁的白色门有9.96%的几率被传送到该层级。
//在Level C-34在路边捡起一封离职申请书会被传送到该层级。
//在Level C-995找到一张工资单会被传送到该层级。
//出口
//在公司楼梯墙壁上触碰四个字“不想工作”会被随机传送到一个安全的层级，请流浪者仔细分辨“不想工作”和“不要加班”的区别。
//进入“老板办公室”会被传送到终点。
//在该层级待满24小时后从前后门逃出会被随机传送到Level C-8、Level C-21、Level C-61、Level 48、Level C-86或Level 63，同时也有一定概率来到危险的Level C-55.1。
//脚注
//1. 办理大厅前台会有一个打卡机器，“同事”习惯于打卡后再进入公司总部，离开也是同样的道理。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1055{}