//Level C-50
//评分: 
//+11
//+
//–
//X
// 
//
//生存难度：
//未知安全等级
//部分稳定
//存在未知实体
//Level C-50是后室C层群的第50层。
//
//C50.jpg
//Level C-50，无尽黑暗。
//
//描述
//Level C-50是一片仅有一颗天空中的太阳发出的点光源，其余部分完全黑暗且虚无的层级。本层级目前还未完全探明。
//
//在Level C-50内，黑暗无穷无尽，这里的空间如同一片纯黑地狱，等待有人探索；这里的时间如同一本空白之书，等待有人书写；这里的声音如同寂静之谷，等待有人发声。光滑平整的地面上，没有一丝灰尘。黑色的天空中，太阳发出惨白色的光，死寂的照耀着地表不同模样的石制品。这是个从诞生就已经死去的世界。
//
//如果你进入了Level C-50的起点，所有指示方向的装置将会失灵，你只能通过太阳判断方位。太阳会每隔6小时进行一次持续时间6小时的升起和落下，在太阳升起的地平线方向行走10千米左右，你会在稀疏的石制品后看到一面望不到顶端的，纯黑色的墙。这堵墙的右方约2千米处有一个镶嵌在墙壁上的入口，入口旁的石制品上刻满不知名的符号。这些符号不匹配数据库内任何语言。由“艾斯利科”语写成的提示语段，其含义正在解密中。
//
//入口内是由无数个黑色的墙交叉排列组成的迷宫，这些迷宫会进行周期性的移动，但移动时不会发出任何声音。所有进入探索的小队无一例外失踪。除了…… 目前仅有一人成功走出迷宫。
//
//基地、前哨与社区
//无。该层级不会刷新物资，因此任何建立基地、前哨或社区的行为都是非必要的。
//
//入口与出口
//入口
//从后室C层群中其它任何一个完全纯黑的空间尝试切出，均有概率进入Level C-50。
//出口
//站在阳光下直视阳光。阳光并不会伤害人眼，而是使人在短暂失明后将其传送至Level C-35。
//走出里面的迷宫，到达 一个未知的层级，但这是不可能的 隐秘层级净土
//-
//不，并不是完全不可能，我很快就会告诉你们，迷宫背后到底有什么……
//只有懂得这个语言的人才能根据提示走出迷宫，而我正是其中的一员
//
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1050{}