//Level C-73
//评分: 
//+14
//+
//–
//X
// 
//
//生存难度：
//等级 2
//
//安全
//有宜居的人类社区
//中量的或随机的实体
//Level C-73是后室C层群的第73层。
//
//描述
//Level C-73是一个由混凝土构成的类似毛坯房的密闭空间，没有任何的窗户、暗道可以通向其他本层区域，且到目前大部分的区域都仍然处于无光线的状态。
//
//Level C-73可能是向四周无限延展的，目前仍尚未发现任何边界的存在。
//
//其大部分的地区由具备上述特征的走廊构成，存在分布无规律的楼梯贯通上下，且楼梯不存在回旋结构，而少数出现转弯。走廊的转弯和路口则是常见的。
//
//在走廊的左右两侧常出现一些木制门，大部分门都可通过门把手直接打开，少数门可以通过钥匙打开，每个门的背后都有仅此门可以打开的房间，基本特征不变，但房间的内部常常出现物体及实体。
//
//目前已被证实的存有体：
//
//衣物、地毯、布、沙包、岩石、尘土、植物残骸、动物残骸、工具包、救护包。
//实体则存在死亡飞蛾、窃皮者、猎犬、无面灵、笑魇等。
//也可见自动售货机、食物（含各类零食、饮料、杏仁水、压缩饼干、各类饮用水、盐、糖及糖类食品、罐装龙肉等）。
//源于树木的木板树枝等物。
//书籍（书籍的主题多变，使用的文字以英语和汉语居多，还有部分来源未知的难以破译的语言）
//各类机器和器械。
//前厅的部分生物。
//不同类型的物品和实体集中分布于各自的房间，但房间的分布没有规律。
//
//房间会以15个小时为周期刷新内容物，但可以通过人类入住、装修房间等方式消除刷新现象（原理尚且不明），有人认为其刷新内容物的规律是随机的，即理论上可以产生任意物件，该说法尚未得到证实。
//
//Level C-73的黑暗性质被评价为“与Level 6较为相似”，但不同的是，人为的照明设备可以在此正常运行，另外，Wi-Fi和电子设备均可被运进和架设。
//
//关于Level C-73的最早报告是在2002年，一支与M.E.G.交好的独立后室探索队通过在Level 11的一座地下停车场的停车位切入发现了Level C-73，但不幸的小队在打开一扇房间门后释放了约十几只猎犬，其导致的伤亡以至于仅剩1人逃脱，后向组织报告。1
//
//基地、前哨与社区
//安城（America Soup Apartment）
//在2010年后由来自其他层级的流浪者、探索者建立的聚居地，以在本层中发掘食材形成的餐饮商业著称，由美汤公寓“领袖团”创办的食堂会定期向成员开放熟食大餐，声称发展出了独立的“汤文化”。2
//美汤公寓的核心区在不断的装修改进后形成了“宿舍”、“客房”等开放向成员或旅者的住宿区。
//其常住人口约在700人左右。
//后室联合图书馆
//book-1659717_960_720.jpg
//名为“李老五”的探索者所摄的图书馆中文区的一批刚运入的书籍。
//
//公寓居民“Mr.Henry”（亨利先生）于2011年创办了“公寓书屋”，在2016年扩建为了“后室联合图书馆”（简称联合图书馆），由于在本层的房间中总能发现成批的书籍，定居者保存了大量的书足以建立一个图书馆，该图书馆目前独立于美汤公寓的管理，自行营业。
//馆藏有大约数百本前厅的工业、医学、计算机科学、农学、文学、哲学方面的书籍，另有后室系列十余卷。
//由5名工作人员常驻，其中馆长1名，管理员4名。
//“黄泉桥上遇故人，后室余难不解春。不晓春秋是何物？但愿归乡无孤魂。3”———
//————联合图书馆藏《后室诗集》
//
//探险者总署（M.E.G.）“夜莺”基地
//在2003年，M.E.G.在本层建立了代号为“夜莺”的基地，负责早期的安全区建立以及探索，美汤公寓的发展就得益于M.E.G.的武装配合及协调管理。
//现是由16人组成的安保及政务团队。
//不结盟贸易集团（B.N.T.G.）特派分站
//B.N.T.G.于2014年在本层的美汤公寓社区设立了贸易站办公室，负责其在本层的贸易事务，交易，运输中转等。
//现由6名特派常驻成员组成。
//混凝土神教
//本层原生的物体崇拜组织，在2018年的“同盟会议”后与探险者总署（M.E.G.）及美汤公寓交好，在本层设有“教堂”作为总部。
//人数为5人。
//后室装修公司（Backrooms Remodeling Co）分部工程队
//装修公司在本层设立的工程队与美汤公寓配合对中心区的环境进行了改进，“一期项目”被宣称已经完成，但在如今和以后，装修公司也将参与本层的其他地区的装修工程。
//队伍人数为15人。
//“洛比亚镇”（“Luobia”）
//在2016年执行的对本层的大探索“阿尔法行动”4中，有探索者声称在距离夜莺基地约120公里（74.5英里）有一处名为“Luobia”的聚居地，但是后来的无线电波联系和实地探索都以失败告终，仿佛凭空出现而又消失。
//人数未知
//入口与出口
//入口
//可以通过在Level 1中一头栽进水泥墙壁进入。
//在Level 11中的一个特定的地下停车场车位里掉入。
//在Level 36的一处垃圾桶下的碎裂的地砖进入。
//从Level C-8中随机从巷子中的水泥地里掉入，但概率较低。
//于Level C-20中寻找到一处狭窄的壁洞爬入。
//在Level C-19中进入一个门牌为“李家面馆“的废弃房屋。
//通过从Level C-190中的楼梯走廊找到一处泥土覆盖的洞，扒开并爬出也可进入。
//出口
//经M.E.G.的调查和研究，可以从一扇特定的用钥匙打开的门离开，为此组织制作了专门的钥匙串，并安置了门牌和标记，申请使用钥匙即可离开，后可抵达Level C-199。
//一处水泥墙上的洞可以通向Level C-20，该洞是双向的，且稳定存在的。
//在后室联合图书馆打开一本“《农家宝全书》”，并完整阅读20页可以切入Level 10。
//在联合图书馆找到一本《人民智慧》的书并翻到最后一页即可到达Level C-71。
//在安城的中央公园处找到一座写有““空思忆，柳依依，终是忆旧终还零”的石碑，从下方泥土可进入Level C-190。
//踩上一件潮湿的地毯可以掉入Level 0。
//站在客房或宿舍等住宿区的床上跳，以至床板崩塌，床垫中陷，可进入Level C-143。
//将下述的方法转换为一路向下，在距离M.E.G.夜莺基地约5700米深处找到走廊内壁的颜色及材质渐变特征，深入数十余米后进入Level C-73.2。5
//通过分布于本层的走廊找到楼梯，以走迷宫式的搜寻法寻求不断向较高区域6行进的路线，在距离M.E.G.夜莺基地约17200米高处找到走廊内壁的颜色及材质渐变特征，再登行数十余米，即可完全进入子层Level C-73.1。
//作者信息
//« Level C-72 | Level C-73 | Level C-74 »
//
//脚注
//1. 在此之后的几年里（2003-2010），M.E.G.在此的专项行动清除了部分的实体，规定对于房间的任何打开行动实施武装预备程序。
//2. 依靠无人房间随机刷新的物品自给自足，并加工生产。
//3. 此诗是一首汉语“七言绝句”，但并不符合《平水韵》和近体诗的平仄标准，这一点体现了前厅的诸多事物在后室中的匮乏。
//4. M.E.G.总部分别于2016年、2018年、2021年批准了从Level 1和Level 11抽调兵力组织对Level C-73的大探索，按照希腊字母进行编号记载，分别为alpha（α、阿尔法）、beta（β、贝塔）、gamma（γ、伽玛）。
//5. 建议先阅读Level C-73.2。
//6. 本层的建筑结构很难以分层法定义层数。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1073{}