//Level C-98
//评分: 
//+24
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//photo-1530840197133-665af68f9d71?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1174&q=80
//Level C-98的下方。
//
//Level C-98是后室C层群的第98层。
//
//描述：
//Level C-98是一处类似于深井内部的垂直空间，平均直径约4.5m。该层级的下方并非地面，而是一个与井口相似的“出口”。在Level C-98的领域内将无法使用任何飞行工具，例如无人机。所有的飞行物在该层级内都会突然完全丧失自身的驱动力。
//
//Level C-98的侧壁并不光滑，而是散布着对于攀登而言相当有利的突起结构；训练有素的人类完全可以较为轻松地向上方爬行，当前最高攀登记录为875米1。目前依然无法确认Level C-98的“上空”是否存在极限。
//
//值得注意的是，若你往上攀登，则有相当的概率会遭遇实体莱特妮丝（详见下文）。在一切顺利的情况下，你将能够与其“交易”到某种于流浪者而言极具价值的物品。2除此之外，Level C-98既缺少探索的价值也缺少活动的空间，所以不建议前往该层级。
//
//实体：
//若在Level C-98往上攀登相当一段距离，则很有可能会遇到一自称莱特妮丝的半蜘蛛状人形实体。该实体性情温和，且乐于与来访者展开“交易”。但莱特妮丝并不愿意和每个人交易、交易的内容也并不一致。在其拒绝交易时，它不会和来访者展开任何交流。
//
//若交易展开，该实体通常会在位于自身腹部背面的一扇柜门之中凭空取出交易物品；在相当罕见的情况下则会指引交易者再往上爬行一段较短的距离，此时侧壁上将必然出现一个洞口3，莱特妮丝将在洞口内部招待来者并交易。未知莱特妮丝是一种族抑或是单一个体当前基本确信莱特妮丝是居住在Level C-98的唯一实体。更多相关细节可参考下方由M.E.G.探员林篁所提交的交涉记录。
//
//spider.jpg
//林篁对莱特妮丝的艺术性描绘。
//
//在与莱特妮丝交流的过程中须保持良好友善的态度。展示出冒犯性行为会导致对方直接离开；假设对方采取攻击行为（虽然从未有过），在此种地形之中我方必将处于极大劣势。
//
//- 关闭记录
//实体交涉记录
//
//遭遇对象：Entity C-8 - “莱特妮丝”
//
//遭遇地点：Level C-98
//
//交涉人员：林篁
//
//详情：我方主动接触。莱特妮丝作为后室中少见的可交流智慧实体，我方务必争取在它身上获取更多信息与情报的机会。
//
//[记录开始]
//
//
//（林篁进入Level C-98后便开始向上攀爬。在上升了大约96m后，林篁上方出现了一盏逐渐靠近的灯光。）
//林篁：（停下）你好！莱特妮丝小姐！
//
//（灯光继续靠近，莱特妮丝的脸慢慢自黑暗中浮现。双方对望片刻。）
//
//莱特妮丝：……你好。流浪的人儿。
//
//林篁：（试探）很高兴见到你。请问，我是否可以去你那里坐坐？
//
//莱特妮丝：当然可以~随我来吧。
//
//（莱特妮丝示意林篁跟随它。继续往上约11m后，侧壁上出现了一个黑漆漆的洞口。双方爬入洞口，朝斜下方走至一处略为开阔的洞穴。洞穴内部稀稀拉拉地耷拉着几处蛛网；洞穴尽头则是一张与周遭环境颇显违和的茶桌，桌面上摆置着一盏明亮的油灯以及一套完备的茶具。二人来到茶桌前，林篁席地坐下。）
//
//莱特妮丝：（咯咯地笑）真是抱歉没给客人准备椅子，毕竟我自己用不上。
//
//林篁：不用客气，小姐。
//
//（莱特妮丝开始沏茶。尽管其肢体末端为镰状结构，各项动作却不可思议的颇为流畅与熟稔。）
//
//林篁：非常感谢您愿意招待我。不过实不相瞒，我这次前来不为交易，而是希望了解更多有关此地、以及有关您自身的事情。希望没有冒犯。
//
//莱特妮丝：嗨呀，这哪里冒犯啦？你想问什么就问吧。希望你别问那些我也不知道答案的问题就是了……我现在大致能猜出你想问我什么。
//
//林篁：例如？
//
//莱特妮丝：啊，就类似于“你到底是谁”、“这里是哪”、“这层的出入规律是什么”“这层到底有多高”、“你是怎么在体内拿出东西的”什么的吧……如果真的是这些，那我可以先明确告诉你：我回答不了。有些是我真的不知道，有些是我的小秘密。嘿。
//
//林篁：这样吗？那我大致明白了……话虽如此，我还是想了解一些具体情况，如此我才能对你以及对此地构建出一个完整的认知。
//
//莱特妮丝：好，那你问叭。喏，你的茶。
//
//（林篁品了一口茶。味道有些微妙、但是略带清香。没有品出茶种。）
//
//林篁：谢谢。那么首先，你有同类吗？
//
//莱特妮丝：怎么一开口就是人家的伤心事儿……
//
//林篁：呃，抱歉，我明白了。那下一个问题吧：根据我组织的记录，你有时会对我们展开“交易”，但不是谁都愿意交易。同时在所有完成交易的案例中，看起来都是你直接把物品给了我们；你并未取走我们的什么物件。为什么？
//
//莱特妮丝：我有取呀。
//
//林篁：你指的是？
//
//莱特妮丝：离开后室的欲望。
//
//林篁：——嗯？什么？你说什么？
//
//莱特妮丝：哈哈哈哈哈，瞧你那莫名其妙的表情，真好玩~哎呀，就是字面意思，“离开后室的欲望”。
//
//（莱特妮丝指了指自己的眼罩。）
//
//莱特妮丝：如你所见，我是个瞎子。我虽然不能看到，但是我可以“听到”。我能听到一直在你内心深处熊熊燃烧的欲望——离开这个“监狱”，离开这片充斥着混沌与无序的乱世。哎呀，上次听见如此炽烈的欲望，都记不清是多久之前了……
//
//（林篁默然。）
//
//莱特妮丝：在我身上，有一种类似于“法则”的东西。怎么说呢……算了，我直接用大白话跟你讲吧：我可以收走你们“离开后室的欲望”，然后为我所用，变成任何我想要的东西。比如这套茶具。这“法则”像是空气般弥漫在这儿，而我只需要去执行、不需要去理解。
//
//林篁 ：我，我不是很明白。收走之后呢？我们会怎样？
//
//莱特妮丝：别急嘛，等我说完。欲望这东西嘛，无穷无尽。我每次只取走那么一部分，其实本来并不会对你们造成什么影响：你们剩下的那部分往往会重新滋长，接着发芽与盛放，对我而说应该是永动机才对……咳，但是奇怪的是针对“离开后室”的欲望这一种，似乎存在一个“临界点”。
//
//林篁：临界点？
//
//莱特妮丝 ：嗯对，在它低到某个程度之后，就会突然对此彻底绝望，当场崩溃，甚至突然又哭又叫，甚至当着我的面去……哎呀，想想都吓人。总之，我这才发觉这东西似乎不能拿太多。
//
//林篁：明白了。
//
//莱特妮丝：所以我不会把谁都当做交易对象。那些人不知是因为受挫太多？还是找到了某种安逸？他们的内心听起来“有气无力”，更有甚者是一片死寂。我可不能和他们交易，他们会出事儿的。
//
//林篁 ：原来如此吗……感谢你如此照顾人类。你这样的存在不多，真的。
//
//莱特妮丝：（啜饮）那个“法则”还真是无厘头~这不纯属针对你们这些进来的人么。
//
//林篁：（呢喃）“后室意志”……
//
//莱特妮丝：什么？
//
//林篁：噢，没什么。
//
//莱特妮丝：喔。嗯——其实我觉得啊，为什么一定要离开这里呢？只要找到这里的生存规律，其实也能活的自在吧？
//
//林篁 ：这不是一回事。我一定会离开这个鬼地方。一定。
//
//莱特妮丝：之前的客人都把这里称作“监狱”，但是我想，你们原本的家园又何尝不是另一种监狱？你们被囚禁在肉体之内，被囚禁在规则之内，被囚禁在格局之内。无论你们身处何处，脚踏何地。
//
//林篁：但那便是存在与前行应有的意义。没有比人更高的山、没有比腿更长的路。即使我必将倒在半途，我也可以自豪地说我不枉此生。确实，我能理解你说的“囚禁”，但那不是监狱的铁栅栏，而是花园的木栏杆。那是我和我同胞们共同的家园，是我们本应共同造就的美丽。而这里的无序与混乱随时都可以踩死一大片梦想还有希望。所以我绝对会回到那边，绝对。
//
//莱特妮丝：（略尴尬）……啊哈哈，聊天而已，别这么严肃嘛……
//
//林篁：啊是，我可能稍稍激动了些。抱歉。
//
//莱特妮丝：没没没，说的挺不错的。你和之前那位，真的很像。
//
//林篁：哪位？
//
//莱特妮丝：好久之前咯。还记得我刚刚说了句忘了上次遇见你这种欲望如此之强的人是在什么时候吗？我说的就是那位。我敢打赌她绝对是你们当中最想回去的——想得要疯。
//
//林篁：我的同事么？
//
//莱特妮丝：不像，她都没你这身制服。什么后室啊什么层级啊全是她那回告诉我的哦，对了，我的名字都是她给我取的！好像取自什么“嘤语”，意思是“明灯”来着……
//
//林篁：“Light”？
//
//莱特妮丝：对对对，就是这个发音！不过最让我印象深刻的自然还是她告诉我的“前厅”啦，虽然还从未有人回去过……
//
//（停顿片刻。）
//
//莱特妮丝：但我还是希望她能成功。我有种莫名的感受：她若是不成功，总有一天会被自己心里的火烧死……嗯，同样，我也开始因此希望你们能成功。从那以后开始，我才开始试着甄选一些欲望强大到即便我取走一部分足以造物的量也不会跌至临界以下的人；一些做成工具回赠给他们，还剩一些做点我自己玩的玩具。哈哈。
//
//林篁：我懂了，谢谢你的配合。
//
//莱特妮丝：谢什么嘛，有人陪我玩已经是莫大的收获啦。来，喝茶。
//
//[记录结束]
//
//后记：莱特妮丝和林篁后续正常完成“交易”。林篁得到了一个白色卵状物。
//
//基地、前哨和社区
//碍于环境因素，在该层级建造基地、前哨或是社区并不现实且无必要。
//
//入口与出口：
//入口：
//在Level C-55的石壁上尝试切出将有几率使自身切入一条极为狭窄、勉强够人通行的石缝。向前挪动便可到达Level C-98的侧壁。
//在Level C-99的区域-1内停留二十四小时以上将会被移至本层级。
//更多入口尚待探查。
//出口：
//在切入Level C-98的石缝内尝试切出可以原路返回。
//侧壁上极有可能嵌有各种“出口”，包括而不限于舱门、另一条石缝、柜门、玻璃门、彩色木门等等，各种形态的出口似乎对应着各个具体的层级。具体对应情况正在交由探索队伍整理，请不要尝试贸然探索。
//直接跳入下方的“井口”，这将让你随机抵达数个Level的上空，但此举无从预判落地环境以及层级编号，所以不太鼓励此举4；较少的情况下将必然安全掉落至Level C-100的一处水域。
//更多出口尚待探查。
//作者信息
//« Level C-97 | Level C-98 | Level C-99 »
//
//Footnotes
//1. 在此高度下，该层级的上方依然是持续延伸的黑暗。
//2. 当前M.E.G.内部已共计收有13件高价值相关物品。具体信息已加密。
//3. 在以层级底部的出口作为参照物对比之后发现，该洞口每次出现的高度都不一致。
//4. 不过这种以这种方式抵达的层级必为开放性环境层级，普遍存在探索价值；如有开拓需求，也可在携带有降落伞或其他装备的情况下尝试此种方式。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1098{}