//Level C-19
//评分: 
//+10
//+
//–
//X
// 
//
//生存难度：
//等级 2
//
// 
// 
// 
//c7e7fe055a810e9f.jpg
//Level C-19的中心湖泊的影像。
//
//Level C-19是是后室层群C的第19层，于2022年1月8日被发现。
//
//描述：
//Level C-19的一个单元被认为是一座围绕一个巨大的正圆形湖泊建造的环形城市。该层级被认为是由无数个完全相同的单元堆叠形成。整个单元可以被分为湖泊和城市两部分。
//
//这一层级物资极度匮乏，除杏仁水之外几乎不产出任何资源。
//
//Level C-19没有昼夜的更替，只有5小时的黄昏和25小时的夜间的更替。这一层级气温很低，最冷时温度在-20摄氏度以下。但是这一层级中湖泊却从未出现过结冰现象，在这一层级生长的植物也未发现因寒冷而死亡的状况。
//
//湖泊
//湖泊是一个面积巨大的正圆形湖泊，占据了这一层级的绝大多数面积。湖泊周围的区域似乎被建造成为一处公园。大量的植物围绕着湖泊生长，虽然从未有人修剪过这些植物，但是这些植物的生长排列极为整齐，而且，从未观察到这些植物有生长或死亡的迹象。湖泊被认为没有底部存在，是两个单元之间的分界。
//
//湖泊的湖水完全由杏仁水组成，但是存在于这一湖泊中的杏仁水具有奇特的异常性质。即这一湖泊中的杏仁水可以饮用，但完全无法提供浮力或阻力，投入湖泊中的任何物体都会以自由落体的形式掉落到下一个单元而摔毁。不断有报告宣称目击到了人类或其他物体从天空坠落，也有流浪者宣称透过湖水看到了下一单元的景象，或者从天空中看到了上一单元的景象。但是从湖泊中取出后的杏仁水则似乎不具有以上性质。
//
//城市
//城市是Level C-19中以湖泊为中心形成的建筑群。建筑以低层楼房为主，但是也发现了少量高楼和平房以及电视塔等其它建筑。这些建筑大多完好，但是资源极度贫乏，只能偶尔发现零散存在的子弹、警棍等物资。这一层级少部分楼房存在电力供应，但电力来源至今不明。偶尔会在这一区域发现因高空坠落而摔得粉碎的人类遗骸。
//
//实体
//Level C-19中的全部实体都分布在城市部分。目前已经发现的实体包括：
//
//无面灵，一些已经处于应激状态的成年无面灵，数量较多，且可能在任何地方出现，因此必须多加小心。
//窗户，它们在城市部分一些高层楼房的窗户上或底层楼房顶楼的窗户上被发现。
//悲尸，它们主要分布在城市的下水道部分，数量最少。
//基地，前哨站和社区
//这一层级中没有已知的基地，前哨站和社区。只发现了一个已经废弃的属于蒙格斯图公司的交通站，他们可能试图大规模地从湖泊中开采杏仁水。
//
//入口和出口：
//入口
//搭乘Level 3的电梯可能会切入到Level C-19的某一栋高楼中。
//进入Level 36中一个标有“休息室”字样的房间中，停留15分钟后离开房间，你将切入到Level C-19的唯一一栋高层居民楼中。
//出口
//在该层级的下水道中停留15分钟后离开，你可能会切出到Level 4中。
//在该层级因寒冷而濒死时你可能会切出到Level C-8的农田部分中，但是这种方法成功率很低且有一定危险。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1019{}