//Level C-51
//评分: 
//+20
//+
//–
//X
// 
//
//生存难度：
//等级 4
//
// 
// 
// 
//Level C-51是后室C层群的第51层。该层级不宜长期生存，若切入此层级请尽快逃离。
//
//rich-sea
//Level C-51中“洪灾”事件将要到来时拍摄的照片。
//
//描述
//Level C-51是一片四周无限延伸的海洋，由大量海水及少量杏仁水构成，且目前尚未发现任何陆地或岛屿。当你进入此层级后，会在一片平坦的海床区域切出，该区域深度为-0.93米。该层级的海床异常崎岖，深度差异巨大，已探测到的最浅深度为-0.74米，最低深度似乎为无限深。
//
//Level C-51拥有明显的昼夜变化，但似乎不存在太阳或月亮。夜晚时天空会出现大量星宿，但其位置从未发生过改变。这些星宿也是在层级中判断方向的唯一依据。因此在白天或“洪灾”事件发生时不建议在该层级移动。
//
//Level C-51中存在大量海洋生物和海洋藻类植物，以及邻里守望、歌鲸等少量实体。这些实体分布极为不均，通常汇聚于已死亡的歌鲸尸体旁。因此在此层级中遭遇其他实体的概率是极低的，除非此处曾经历过“洪灾”事件不久。
//
//“洪灾”事件
//一种发生在Level C-51中的灾害事件，包括但不限于海啸、飓风、水龙卷等海上自然灾害。“洪灾”事件发生后该区域的海床地形将会发生巨大变化，且实体数量陡增。“洪灾”事件发生前海平面将突然下降1-2米不等，届时将会出现岛屿或陆地。
//
//这种灾害的破坏力极为巨大，能够轻易摧毁海面上的任何建筑，并且会伴随大量电磁杂波，对途径处的所有电子设备造成不同程度的损坏。尚不清楚这一灾害的发生有何规律，它似乎是完全随机发生的。
//
//“回声残骸”
//随机分布在Level C-51的一种无线电射频装置，所属人或团体未知。其中大多数已经严重损毁，无线电发射与接收功能几乎完全失效，只有信息储存模块较为完整。下为M.E.G.回收的部分“回声残骸”中所解析出的记录。
//
//隐藏
//“回声残骸” 编号-01
//[记录开始]
//
//(持续不断的白噪音和模糊的引擎声)
//
//声源：我们上来了，这已经是第8台“回声”了，希望他说的没错。但是看起来附近并没有什么异样，不是吗？
//
//(白噪音逐渐加重)
//
//声源：好像有什么声音…等等，望远镜呢？
//声源：…操，这不是什么鲸鱼，这他妈是巨浪1！下潜！所有气室…门…打……
//
//（白噪音完全将录音覆盖，记录中断）
//
//[记录结束]
//
//隐藏
//“回声残骸” 编号-04
//[记录开始]
//
//未知：天空是虚假的天空是虚假的天空是虚假的天空是虚假的天空是虚假的天空是虚假的天空是虚假的天空是虚假的天空是虚假的天空是虚假的天空是虚假的天空是虚假的天空是虚假的天空是虚假的天空是虚假的天空是虚假的天空是虚假的天空是虚假天空是虚假的天空是虚假的天空是虚假的天空是虚假的天空是虚假的天空是虚假的
//
//[记录中断]
//
//隐藏
//“回声残骸” 编号-05
//丰饶海
//
//在轻薄的天空上，
//有一片丰饶海。
//从前我随一叶小舟漂行，
//现在我已植下了种子。
//
//海面是星空的落脚点，
//它们激起的浪也不停息，
//海底残存着梦的聚落，
//浮游的尘也在此堆积。
//
//我见孤岛探出海面，
//小舟从四方汇聚而来，
//即使风浪遮天，
//即使荒芜不止海岸。
//
//用光线将孤岛连接，
//用电子在海面耕田。
//尽管涛声依旧，
//而潜水钟已在下潜。
//
//或许日夜交替，
//海洋也成为了陆地，
//但种子仍于海底深处沉睡，
//我却在海的表面呼吸。
//
//我见高楼盘结交错，
//将海面遮挡，
//我见聚光灯拉扯着星空，
//却无雨水落下。
//
//人群如海浪起伏，
//却较巨浪更为汹涌。
//寻着月光的隐晦，
//夜空上的灯塔却落上了星尘。
//
//人群拥向高处，
//浪花在岸边消散，
//他们的面具碎裂遍地，
//而浪花在海面汇集。
//
//我也随着起伏了，
//却是在背离的方向，
//我寻至云层之上的种子，
//步入海洋深处了。
//
//等待生长着的晨曦，
//将狂风阻挡，
//我便在无风时扬帆，
//向着没入海平线的金黄。
//
//我见危楼高耸，
//似乎将海面埋葬，
//金碧辉煌的大门紧闭，
//也紧闭着海底那尘的想象。
//
//而褴褛衣衫消散，
//修补了高墙，
//声浪冲破缺口，
//为群星所向。
//
//危墙下的闭塞，
//遮蔽那高升的暖阳，
//危墙上的盲区，
//隐匿着看不见的行商。
//
//天空似乎不再轻薄，
//却又以水泥加固，
//我已到了深处，但——
//天空之下仍是天空。
//
//结束了吗？
//我问着自己，
//也问着世界。
//但，无人应答。
//
//显然没有。
//声音如细沙逆流，
//又像是烈焰劈啪作响，
//又或者，我并未听见。
//
//但，星尘听到了，
//种子与梦也听到了。
//他们越过高墙回应，
//但我只能听到自己的回声。
//
//直到火光在海面燃起，
//危墙于海面溶化，
//我仍期望着。
//我仍想象着，
//
//在轻薄的天空上，
//有一片丰饶海。
//从前我随一叶小舟漂行，
//现在我已植下了种子。
//
//隐藏
//“回声残骸” 编号-08
//[记录开始]
//
//记录：这是我来到这个层级的第五天了，终于找到了一台看起来能够运行的回声了，但似乎射频装置出了些问题，但记录功能仍然完好。如果有任何人找到了这台回声，并发现了这段话，我希望你能够对我将要讲述的事做出合理的判断。
//
//就在四天前，我曾发现过一台钟形的潜水艇。它静静地漂浮在海面上，就好像是有人故意放在那里的一样。我当时并没有怀疑什么，不假思索地便进入了里面，想找点食物或是其他的补给。但在我进去的瞬间，它忽然启动了，我根本不会操纵这台机器，只能看着舷窗外的海水逐渐黯淡。它的下潜速度极快，绝对比任何人类制造出的潜水艇都要快，它的深度表最深达到了10000米,我无法想象它是如何承受住这样的重压的。
//
//但接着令我恐慌的事发生了，深度表上的深度已经到达了10000 米，但这台机器并没有丝毫要停下的迹象，我当时觉得自己快要死了，就好像是四周的海水会突然挤压过来，而我将连粉末都不剩。幸亏这-切没有发生，它只是一直下潜着，窗外的探照灯照射出的也只是一成不变的黑暗，知道黑暗中有什么东西闪动了一下。
//
//随着下潜深度的增加，这种闪动变得越来越频繁，而我也终于看清楚它们是什么了，那是一个个闪着蓝光的矩形，是平面图形而不是立方体！这些矩形相互穿插组合，构成了一片非欧几里德几何形状的色块，探照灯打在上面，像是照到了一张贴图上，反射出诡异的光影。我不知道这些东西是什么，它们似乎代表着某种可怕的真相，我不敢说出来。
//
//随后在这样违和的场景里下潜了几十秒，我看到一个色块从地板下面穿透过来，并穿过了我。而地板上没有任何痕迹，我甚至感受不到这个色块的存在。但它们绝对感受到了我，开始不断向我围绕靠拢，却始终无法穿过这台机器的外壳。此时这台机器终于停止了下潜，转而开始快速上浮，巨大的压力让我摔倒在地上，失去了知觉。
//
//而我再次醒来时就已经是在海面上了，我的心脏此时仍在砰砰直跳，我强忍着恐惧在这台机器里四处搜寻，最终找到了一些食物和杏仁水，同时发现了很多标记着“潜渊者”的奇怪仪器，我不敢触碰它们，只能带着补给离开了。直到今天，这些食物已经所剩无几了，我要去参宿二方向冒一次险，两天前那里曾出现过一段歌声，那台机器大概在相反的方向，由于当时是白天，我记不清具体的位置了。
//
//我仍然希望我所经历的只是一场梦 ，但显然这一切发生的都那样真实。当然，你也可以认为这一切都是 我谵妄的想象，这取决于你。但在最后，我希望你可以将这份记录公之于众，找出这背后的真相。再见。我的朋友。
//
//结果：M.E.G.已派遣两支小队前往描述方向进行探索，已在参宿二方向发现一具歌鲸骸骨，其中并无发现流浪者活动痕迹。另一支小队未获得任何有效发现。此记录真实性存疑。
//
//[记录结束]
//
//基地、前哨和社区
//潜渊者
//实体数量未知
//目的未知
//态度未知
//仅能通过“回声残骸”得知，潜渊者是以潜水钟为载体生活在Level C-51海床表面的未知团体，其科技程度极可能较为先进。但目前尚未有任何目击记录能够证实这一团体的存在。
//入口与出口
//入口
//在Level C-33中熟睡时突然惊醒可到达这里。
//在Level C-10中找到一片咸水水域，潜至底部可切入至这里。
//Level 43中一扇有少许盐渍且潮湿的门可切入至这里。
//在Level 404中错误地触碰到一块破碎的纯黑色屏幕将切入至这里。
//出口
//此方法较为危险。但你可以在“洪灾”事件的灾害形式为水龙卷时进入风眼，短暂的眩晕后会在Level 7醒来。
//找到一口具有硫磺气息的热泉，将会切入至Level 27。
//在一具歌鲸尸体旁长时间停留，将会很容易地切入至Level C-8里的一口井中。
//作者信息
//« Level C-50 | Level C-51 | Level C-52 »
//
//Footnotes
//1. “洪灾”事件的其中一种灾害形式，常表现为高为10-20米不等的巨型海浪。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1051{}