//Level C-66
//评分: 
//+39
//+
//–
//X
// 
//
//生存难度：
//不适用
//无物质
//已归档
//Level C-66是后室C层群的第66层。该层级已自行覆灭，目前其内部推测可能为一片虚空，本档案记载的情况为其覆灭前的情况。
//
//silhouette-20787_1920.png
//Level C-66内曾经的教堂外景。
//
//描述
//Level C-66由一块大陆平原和成片的海岛所组成，平均气温2℃。其中有一些海岛之上存在建筑的遗迹，但其内部已经没有人类居住。大陆上有许多城堡和村庄的遗址，除一般住房以外，教堂建筑群是Level C-66内最常见的景观。从外观上看，这些建筑已经腐朽多年。风化的墙壁成片脱落，各类砖石埋进地底，只露出其部分尚可辨识。内部装修也基本腐化殆尽，大片承重木板坍塌，墙体开裂，建筑摇摇欲坠，只能在废墟中勉强发现一些保存完好的房屋。除此之外，许多白骨的碎片暴露在西边的一片草原之上，范围可达数百里。多处类似于观察敌情的瞭望塔遗址矗立于山腰与山顶。种种迹象表明，这片大陆曾经发生过战争。
//
//Level C-66此时为夕阳时分，以前厅的时间为标尺计算，太阳将在0.2秒内完全落山。为保证在城镇中搜查到的古籍和文物不受到该层级即将自我覆灭的影响而被摧毁，前来调查的人员迅速将古籍于文物转移到其他层级。调查员的闪回记录，以及几位专业人员破译古籍所发现的内容，附在本层级的档案后，以供有需人士参阅。
//
//由于发现Level C-66时，距离其毁灭的时间已十分临近，为保证调查人员的人身安全，故并未在本层级展开更详细的调查工作。
//
//已知的情报有：
//太阳为一个黑色球体，周围散发出暗红色的火焰光芒。
//此处有原生人类曾经居住，且科技水平发展至中世纪。
//此处曾发生过世界大战，之后人类因不明原因而灭绝。
//大陆上的各种城堡所组成的城邦采用“政教合一”的治国政策。
//此处时间流逝极其缓慢，前厅的1秒在本层级约为3个月。
//此处存在“闪回”现象，在此处的人可以在闪回过程中将该地过去的事物带回现在。
//此处到处都在燃烧，但火焰与环境温度却十分低。燃烧过程十分缓慢，被燃烧之处会有黑灰色黏浆流动。
//本层级曾经并没有任何出口。发现这里的方法是在Level C-106中一处海平面上，用紫钥石打开此层级入口。并用相同的方式在本层级内打开一个出口。
//本层级具有自我毁灭的特性，最初是在城堡遗址内留下的古卷中推测出来的。
//补充情报
//在教堂深处一个巨大的地下室中央，树立着一块碑。上面的文字能辨认的部分是“愿它们的名被永世唾弃”。碑旁有一个大坑，里面填满了一些物品。值得注意的是，这些遗留之物，除武器外，还包括较为完整的日用品和衣物。
//
//根据教堂内的经文得知，此地为长着人身龙角的恶魔士兵的遗物。在传说中，恶魔曾大举入侵该层级，但被天使和救世主所率领的军队击退。天使曾经用锁链束缚住恶魔士兵，但红龙出现扯断锁链带着部分恶魔而逃走，而剩余的恶魔则被神的怒火化为灰烬。最后救世主将大地划分数个区域，让使徒各自建立国度。
//
//目前尚不知晓，该层级的文明中所记录的“恶魔”所指为何，但对遗物进行生化检测之后，发现其中某些残留成分与克西的“龙血”样本高度相似。目前也并不得知，“恶魔”是否确实是被从层级中驱逐的。不过根据遗物完整程度来看，似乎是其主动撤退并抛弃所有随身物品，原因未知。
//
//silhouette-175970_1920.jpg
//Level C-66内曾经的草原。
//
//基地、前哨与社区
//本层级无基地、前哨或社区。
//入口与出口
//该方法已失效。在Level C-106中一处海平面上，用紫钥石打开入口，并在本层级内打开另一个通向Level C-106的出口。
// 
//
//附录一
//> 关闭
//在所有人员安全撤出后，留守在出口处的人向其内部查看时，目睹并记录下了本层级自我毁灭的景象：
//
//太阳沉入地平线后，沿着地平线出现一列深蓝色火焰，环境光线变为深灰色。而大地与海水也在向太阳落下的那点塌陷，天空如同一块被拧紧的餐桌布一般，缩皱下沉。随着天空大地海洋逐渐塌入那点后，那点所出现的火焰亮度在逐渐变淡。现实时间流逝大约10分钟后，火焰熄灭，随之出口关闭。
//
//
//> 关闭
//附录二
//> 关闭
//以下为调查员F回收到的信息。在一处斑驳的壁橱上发现许多空的羽毛笔，触碰到羽毛笔时，闪回了这只笔最后一次被使用的时刻。调查员记录了用其写下的内容。
//
//瞧啊，王国的子民，众人的伙伴，荣耀的护教精兵！
//
//你们啊腰佩宝剑、大有威严，尊贵强盛、列阵前行！
//
//圣王立下誓言，要令神拣选的勇者，得以增长门庭。
//
//你们向众人宣耀自己的威名，向世界宣耀神的威名！
//
//看那外邦人假托神意，篡改圣言，又雕刻虚假的形。
//
//万军之神发了怒，举起大能的右手，投出火焰之鹰。
//
//要将他们灭绝，倾倒宫殿，连同地上长的都烧干净。
//
//好似那草棘怎会不畏惧火烧，而黑暗怎会不避光明？
//
//神与我们同在，与大敌同在，也与万有并行。
//
//然爱神者得神爱，怒神者得神怒，皆有报应。
//
//神又在天国高举宝座，敞开义门，预留给义人的灵。
//
//罚罪者必戴上冠冕，此乃神赐予人的允诺与定命。
//
//我们也必携报神爱，一如太阳般踏遍每一寸阴影。
//
//号角吹响，胜了又胜，有福的人呐，当大扬欢庆！
//
//
//> 关闭
//附录三
//>关闭
//以下为调查员K回收到的信息。当时其遇到一具趴在教堂庭院上的人类尸体，触碰了尸体手上的一张空白书页后，闪回至尸体死亡那一刻。调查员记录了当时的见闻。
//
//一位暮年的老人站在一座老化的教堂之上 ， 眼神空洞的望着夕阳 ， 嘴里哼着一首不知名的歌儿— — 那是他献给这个世界的挽歌 。
//
//起初，这片世界还在空虚混沌中翻覆，来临（presence）的神看这是不好的，便把祂的灵向沉厚黑暗的空隙中垂入。那时，神的灵散发着充盈的光芒，光芒又凝析成燃烧世界的火焰，这便是太阳；火焰又令黑暗的废弃之体熔铸千般，这便是万有所契合的型相。
//
//那巨匠将云彩以朝霞晕染，又用风把群星摇落在地，众物从星光中分得了阳炎，因着灵而受造而不全。唯人类不同，其自太阳而诞，继承了光明的美德，乐善好义，又精明强干。如神谕所述，这大地就是神赐予人的宝物，人依着许诺的权杖拿辖着万物，万物在其脚下恭敬地匍匐。
//
//午时，人类点燃心中的灵性之火，在地上多生多衍，建立了属于神的邦国。那时神之圣言托住了日月的运行，圣言之回声荡开了奇迹的验明。无数子民应着神的许诺，高举起一座座宏伟的教堂，以虔诚祷告神的嘉言善行和恩爱之广，圣咏赞诗遍传万方，映着民康物阜、朝气蓬勃之象。
//
//申时，残阳凭借那命依旧吊在虚空，但原先预留的天地却流汇为暗红，那是人民眼里的妄火所熔。旧时无暇美德在红马骑士的铁蹄下踏碎，信仰的实底在教义的争端中分毁。唯独那片妄火，将灵性之火烧灭，也将天地烧灭。啊，晚霞的火云，竟似上帝的暴怒，又如神的迟暮。这个世界，终不是恒久，美丽命定不久会被带走。
//
//当垂暮的红日坠落苍玄，我听见了圣言，看那世界如一天，一天即为一个世界的兴亡；又看见暗影，朦胧在远方。“我的神，我的神，你为什么要离弃我？”我匍匐着朝暗影前去，暗影却似笑非笑地离开了，如同从未存在一般，带走了一切，带走了我的神。
//
//号角吹响，胜了又胜，可经此一役，这世间又剩几个活人呢？宗教战争胜利之日，或许就是神明死去之时。从正午到申时，战火燃烧大地，灵的妄火燃烧于虚空，神的妄火燃烧着自体。一切不过是，讹谬的目的推动了讹谬的形态，讹谬的形式推动了疯狂的堕败。随着火焰燃烧，光芒会越来越暗，直至天和大地都燃烧殆尽，质料、灵思，乃至一切型相都彻底湮灭。
//
//这之后，世界重归一片黑暗。神离去了（absence），神死了。又或者在这个世界短暂而又漫长的一天内，从来就没有上帝？
//
//
//>关闭
//附录四
//> 关闭
//亲爱的埃维齐博士：
//
//您好。
//
//时至今日，我也难以想象，在一个层级内，竟然发生了如此多的故事。当我第一次接触关于Level C-66的文献时，前所未有的，我对我自己的古代遗物研究的专业性产生了担忧……这么告诉您吧，在我首次与我的团队将这些资料进行整理时，我们甚至都不能完成的拼凑出一条时间线。经过多方面的研究和推测，我们才敢半信半疑的确认：Level C-66从诞生到毁灭，仅仅只用了一天的时间！这意味着太阳从升起到落下，这个层级的一切就结束了。
//
//是的，虽然听起来很疯狂，但现实亦是如此。所有带有正面的、积极的色彩是诗歌抑或是文物，都详尽的描述了太阳的美好，描述了在一片明媚的阳光下，他们的部族是如何欣欣向荣、繁荣富强的发展的。不同于以往的调查，这些文物的文学内涵也大大超乎了我们的想象。他们似乎无所不用其极的利用各种信息载体描述了他们的创世神有多么伟大而慈悲。似乎整个世界都沐浴在神的光辉之下。他们将最虔诚的信念融入了绘画、建筑、歌剧等等几乎所有具有艺术表达的地方，描绘了一个宏伟而庞大的神之世界。
//
//他们所讲述的神，更是不可说的至上存在，神如同组成他们身体的“以太”一般，谁若是离开了神，谁就会消失殆尽；谁若是忤逆了神，谁就将万劫不复。纵观以前的人类历史，从来没有哪个时代拥有如此强的影响力的神，也没有如此狂热的信徒。似乎神与人本身就是浑然天成的一体，你中有我、我中有你。
//
//然而，太阳开始落山之际，这些文物的感情色彩便出现了一些变化。创作者们开始更加偏向于记叙神降临人间，抑或是神审判罪人的画面，而其中总有一些手持冷兵器，穿着严实的士兵成为神罚的执行者。那些建筑的残片，开始出现了许多由人力撞击，或是钝器破坏的痕迹。我们有理由确信，此时的世界已经发生了一起规模空前的战争，但其出现的根本原因，我们却不能在文献中找到任何线索。
//ps 来不及重新写一篇了，我把我推测的原因写在另一张纸上夹在这封信里
//最终，随着文章的落款时间越来越往后，我们研究的旅途来到了一个死胡同。一切资料似乎在某个时间点内全部停止，而停止前的那些文章，大部分都在记叙一些完全矛盾的话，比如说“神已死”和“神已降临”，抑或是“神带来了灾难”和“神会宽恕我们”诸如此类的描述。难道那场战争是神发动的？我们不得而知。
//
//我们研究出的所有成果，基本上都在这封信当中概括了。在此之后，若您有需要，我们会尽快编写一篇详实的调查报告寄给您。
//
//狄泽博士
//202█年10月1日
//
//
//
//
//>补充的字条
//
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1066{}