//Level C-95
//评分: 
//+11
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
//安全
//稳定
//中量实体
//Level C-95是后室C层群的第95层。
//
//描述：
//Level C-95是一块占地约50平方米的水泥平台，在平台边缘可以看出平台是被某些外力强制“带”到这个地方的。向其他任何方向看去，其景色都是一片不可辨识的星空，据大部分流浪者描述，他们就好像待在一块漂流在宇宙中的平台上一般。平台的中央是一个流动食摊，其风格很接近日本的居酒屋：有一个可拉动的木车为主体结构，里侧摆放着很多用于制作食物的器具，外侧放着三个木凳子，内外两侧由几块垂布分隔开了两块空间。
//
//进入该层级后，向右看去就能看到居酒屋，在大部分情况下都是有客状态。一般流浪者在看到居酒屋后就会立刻了解这里的规则，原理暂且不明。
//
//在入座后，大厨会走到面前并询问流浪者想要吃什么，这个时候只需对大厨说出一个食物的名字即可。得到食物的名字后，大厨就会去到内侧以无法被任何方式观察的方式将流浪者要求的食物制作，这通常与流浪者提出的食物的复杂程度有关，但通常不超过五分钟。这些被制作出来的食物一般情况下是被认为可以安全食用的，但其被端上来的食物的外貌与味道似乎与流浪者本身的认知有关，有一组同行的流浪者报告称，他们的一名同伴点了红烧狮子头这一道菜，结果大厨真的端上了一个被烧熟的狮子的头部，对那名点菜的流浪者询问后得知，他根本不知道狮子头是什么只是想尝一尝而已。M.E.G.在这里对其他流浪者建议，不要尝试去向大厨提出你们自己根本没有见过的食物，以免发生潜在的问题。
//
//当食用了这些食物后，流浪者只需将自己认为符合这一餐价值的物品放在桌子上便可离开，目前没有流浪者提供过没有“付款”的记录，因为他们称一旦出现这个想法，他们似乎就会变得十分的沮丧。
//
//在这个层级遇到实体是很正常的，但不必对其感到惊慌，从理论上在这个层级出现的任何实体都不会对其他流浪者产生任何兴趣，它们也都会遵循规则再次进行点菜。但不要尝试对任何实体进行侵略性行为，这样做通常会另大厨恼怒并发生严重的后果，这通常会让流浪者被扔到一个危险的层级。
//
//在座子上的一角似乎有一张被纸巾盒压着的纸条，上面似乎写着一段用意大利文手写的文字，但语法风格相对现在而言过于古老，翻译后的内容大致为：
//
//大厨你还真是个有意思的人，你让我想到了我的祖父。但说起来你让你给我做一些丹药，结果你给的只是一些面做的丸子而已。好吧，我其实身上一无分文并且只有这根笔了，我就用这最后一点墨水给你写个欠条吧，等以后我再来到这里就给你钱吧。
//
//—K
//
//2020年2月26日后更新内容：因一些原因，大厨在2020年2月26日后将不再给流浪者提供狗肉所制作的食物，详情见下述团体D.P.P.O介绍。
//
//附录
//这里记录了一些由流浪者报告的一些实体的点餐场景。
//
//- 点击收起“附录”
//实体：穿着西装的无面灵
//
//细节：无面灵晃晃悠悠的入座后与大厨面对面了大概两三分钟后，大厨回到厨房开始烹饪，最后端出一盘无法看清细节的肉排，并附赠餐刀与餐叉。
//
// 
//实体：派对客
//
//细节：居酒屋前突然爆裂出一堆彩带，从里面走出一个派对客。它入座后提出了想要一个巧克力蛋糕，大厨随后将蛋糕递给了派对客。在以一种无法理解的方式吃完蛋糕后，这个派对客似乎想拉着提交报告的这名流浪者进入爆裂出彩带的裂缝当中，随后被恼怒的大厨给直接扔了回去，并给了流浪者一杯特质的茶，最后体检证明该流浪者虽然被派对客物理接触了但没有发生同化现象。真是一个不礼貌的厨师啊=)
//
// 
//实体：悲尸
//
//细节：悲尸一边盯着流浪者一边蹒跚地入座后，对着大厨嚎叫了几声之后，大厨用类似的嚎叫声回应并最后端上来一盘无法分辨是什么动物的生肉混合着血液。悲尸用十分原始粗暴的方式将血肉吞噬后离开了这个层级。
//
// 
//实体：一个身穿黑色风衣的面具人
//
//细节：一个流浪者称自己在用餐时发现一个穿着黑色风衣背着背包并戴着一个纯白面具的人进入了这个层级。这个面具人没有理会他的招呼并十分谨慎地坐在居酒屋前，并要了一个蓝莓蛋糕，但提交报告的流浪者称他只是低头吃了一口自己的食物再抬起头后便看到蓝莓蛋糕已经被吃完了。随后面具人将一瓶杏仁水留下后便快速的离开了本层级。
//
//实体
//大厨
//
//一个没有固定形态的实体，因看到它的人而决定外形，通常都是厨师，其外貌特征都是根据看到它的流浪者对厨师的印象而成。大厨通常情况下十分的友善，并且很喜欢与流浪者聊天并询问其想吃什么，在得到结果后便会去内侧的厨房以一种不可知的方式烹饪食物。但如果有任何人或者实体在这个层级表现出侵略性行为，大厨便会恼怒地将其扔出这个层级，这个时候大厨表现出的力量相当大，甚至连体型强壮的悲尸都无法挣脱。
//
//基地、前哨和社区
//狗狗群 D.P.P.O前线观察站点
//通常由两到三只成年家犬组成，并待在居酒屋附近。这些成年家犬并不会对人类产生亲近感，但抚摸其身体被认为是没有危险的。
//
//D.P.P.O用于监督平等协议的小分队，通常由三名保卫员执勤。通常对流浪者友善其可以交流并开放贸易。
//
//- 隐藏记录
//在2020年1月15日时在Level C-95内发现几只家犬，但当时并没有流浪者上报相关内容。1月至2月期间，家犬对流浪者食用狗肉食物时表现出明显的抗拒。2月10日，层级内家犬数量减少至只剩两只。
//
//2月26日，两名常出没于此层级的流浪者因不明原因杀害了位于层级内的两只家犬，两名流浪者被大厨驱逐。3月5日，之前杀害家犬的两名流浪者再次来到此层级，但没过多久层级内出现大量家犬并对流浪者展开攻击，大厨想要驱逐闹事者是但被大量家犬纠缠。两名流浪者被家犬使用了不明物品致其惨死。此事被报告后M.E.G.立刻派遣特工小队前往此层级，但家犬们表现出友善并拥有使用人类语言的能力。
//
//随后M.E.G.与家犬群进行谈判，并签署平等协议，协议内容M.E.G.承认家犬群成立的团体D.P.P.O并不建议流浪者食用狗肉。大厨似乎因为这场争执产生了严重的PTSD并不再提供狗肉食品。
//
//动物与实体热爱俱乐部
//表面为由5人组成的对动物与实体感兴趣的流浪者团体，实则为监督D.P.P.O的M.E.G.特工，顺带提供有关实体的记录报告。
//
//入口和出口
//入口
//当流浪者因为饥饿而昏迷后，有概率会在本层级醒来并恢复部分精力。
//在任何建筑内通过一个被三条白色垂布挡住的门，便会出现在居酒屋的右侧。
//出口
//一直继续向居酒屋的左边走出将会回到之前的层级。
//在层级内展现出侵略性行为被恼怒的大厨顺着上述出口扔出去后回到达一个随机的生存难度4-5的层级。
//喝酒喝醉之后醒来会抵达Level C-18。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1095{}