//Level C-38
//评分: 
//+15
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//Level C-38是后室C层群的第38层，它于2022年2月16日被发现。
//
//描述
//Level C-38被描述为一个室内综合购物广场，其外部样貌迄今为止没有任何可供参考的可靠文字或多媒体资料，因为Level C-38没有能够通往外界的门和窗，曾经有探险者试图凿穿墙壁，但是被证明无效。
//
//Level C-38是一个长方体封闭建筑，一到四层地面均铺有米色大理石地砖，在地面边缘处饰以青绿色大理石地砖，每层的天花板由正方形浅灰色pvc板构成，并在一些特定位置挂有紫色导引牌。
//
//Level C-38里的广播喇叭会在全天播放一些令人感到放松的萨克斯音乐。
//
//plaza.jpg
//中庭影像。
//
//Level C-38的地上建筑共分为四层，地下有一层停车场，除停车场之外的楼层均有Wi-Fi供应，信号强且稳定。
//
//Level C-38的一层是综合区，其两侧的ab座围绕中庭两端分布，中庭的空间上下贯穿一到四层，中央地板置有一部长四米宽二点七米，高四米的数字电子钟，其计时方式与普通钟表无异，无法被破坏。
//
//一些衣帽店和餐厅分布在ab座，衣帽店的商品被形容和正常的服装无差异，其商标牌均为空白，被取走后会以未知方式进行补充。
//
//餐饮店只可进行扫码点餐，点餐成功后菜品会自动出现在餐桌上，用餐完毕餐具会自动消失，餐厅后厨门整体无法打开与破坏，无法观察到内部情况，据报告称后厨内二十四小时不间断发出较大的风声，但与抽油烟机运行的声音不匹配。
//
//二层三层的a座主要部分为超市，经调查，和一般的超市环境相似，内有各种商品，包括杏仁水，皇家口粮。但是Level C-38超市里的商品包装多为单一浅绿色，没有标注品牌，使用黑色油墨印有简洁直白的商品名以及“for dream plaza sale”字样。但是货架上也会出现带有其他包装的商品，将其带走并使用会传送到Level 176 。
//
//market.jpg
//超市入口处。
//
//从超市带出的物品会在每天的凌晨2点重新刷新，过程持续10分钟，其过程被形容为“发出白色的光并慢慢的融化掉”，该时间段若有人逗留在超市，会晕倒并“融化”，并被随机传送到Level C-38的任何角落后醒来。
//
//PicsArt_03-16-04.39.19.jpg
//一张摄于超市的照片，表现了凌晨2点货架上的一个辣椒是如何"融化"的。
//
//快来尝尝烘焙区的纸杯蛋糕吧，要上面插着小蜡烛的那种！把它吃掉之后就可以参加一个派对哦！=）
//
//二层三层b座由空闲的毛坯商铺构成。
//
//四层整层始终处于废弃的状态，布局和其他楼层无异，但是被灰尘覆盖，经调查四层是安全的，Level C-38四层接受的任何人为修复均会在凌晨二点后重新变为废弃状态，该时间段如果有人在此停留也会遭遇和超市相同的结果。四层安装有电梯门，但是电梯无法到达，且没有安装扶梯，只能通过安全通道楼梯到达。
//
//four%20floor.jpg
//四层影像。
//
//Level C-38中生成的任何物品都无法被携带到其他层级，离开Level C-38的探险者声称有一种如梦初醒的感觉，仿佛在Level C-38的所有经历如同梦境和幻觉一般。
//
//Level C-38的地下一层用于地下停车场，只能通过电梯到达，同样没有通往外界的出入口，环境比较潮湿，据报告负一层会出现身着保安制服的无面灵，这些实体目前没有在地面建筑出现过，他们相对友好，如果有需要，他们可以将任何人带至购物班车或者任一电梯处。
//
//实体
//无面灵，仅出现在地下一层，地面建筑无目击报告。
//
//基地、前哨和社区
//"广场人士"（"Plaza men"）
//该基地是为了保护来到Level C-38的探险者而建立，利用B座毛坯商铺作为根据地，为来到Level C-38的探险者提供保护和居住，开放贸易（仅可交易非Level C-38内生成的物品）。
//入口与出口
//入口
//bus.jpg
//一张从外向内拍摄的购物班车内部。
//
//在任何层级饮用贴有“for dream plaza sale”标识的杏仁水。
//在Level 9进入一个红色拱桥形屋顶的房屋停留二十四小时。
//在Level 11进入一些建筑物时小概率会进入到Level C-38。
//出口
//door.jpg
//防火门正面影像。
//
//乘坐电梯到达地下一层，按照停车场指引到达“出口”处，乘上购物班车，上车后会晕过去，醒来会被传送Level 36。
//在超市的货架拿走并使用了带有其他包装的商品后会被传送到Level 176
//在一楼a座靠近中庭的餐厅用餐时如果睡着可能会被传送到Level 10
//进入楼梯间的防火门可传送到Level 40。
//在停车场找到一处铺有湿地毯的房间，会被传送到Level 0
//吃掉插着蜡烛的纸杯蛋糕，来找我们，这里很快乐！=）
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1038{}