//Level C-39
//评分: 
//+25
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//Level C-39是是后室层群C的第39层的主体层级。
//
//描述：
//目前，Level C-39的所有子层级已被标记为探索完毕且进一步的探索被认为是不必要且浪费的。由于Level C-39的主体层级切出位置表现出的不确定性与其子层级表现出的危险性，建议流浪者避免进入该层级。
//
//30f1d64c3564931c.png
//主体层级内部图像
//
//
//Level C-39为一随机出现在Level 11建筑物内的可顺阶梯而下切入的地下室，内部墙面由乳胶漆粉刷而成，天花板上安装有电灯，地面由石质材料铺成。Level C-39走廊尽头有两个可由不同钥匙进入的门，个体可通过不同的门切入不同的Level C-39的子层级。Level C-39的子层级分别被命名为Level C-39-1与Level C-39-2。
//个体在切入Level C-39后，可通过原路切出该层级并回到Level 11。应当注意的是，在切出Level C-39后，个体所在位置可能与切入时有所不同。
//基地、前哨与社区
//由于Level C-39位置的不确定性，并考虑到其所有子层级均已被探索完毕，现撤除设置于其内部的前哨站，并劝阻流浪者进入其内部。
//
//入口与出口
//入口
//由位于Level 11的建筑物进入
//出口
//原路返回
// 
//
//
//警告：访问受限
//
//以下内容仅对持有相应权限者开放
//请进行权限认证以继续
//
//帐号	
//Jane Rochester
//密码	
//•••••••••
//注销
//
//
//探索记录：Level C-39.1
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//796651227cae78bb.jpg
//用于开启该扇门的钥匙的图像
//
//探索记录
//
//日期：████/██/██
//
//探索人员：先驱者019（下称人员）
//
//目标：探查此层级
//
//携行物品：杏仁水两瓶，███████牌巧克力饼干两包，运动摄像机一台，匕首一把。
//
//[记录开始]
//
//摄像机开机
//
//大约十秒的试机画面
//
//画面显示人员正站在第一扇门前，旁人正将背包递与人员，紧接着摄像机也被交到人员手上。
//
//人员用钥匙打开面前的门，深吸一口气，随后进入门中，切入Level C-39.1。切入瞬间摄像机有轻微白躁现象发生，在切入后恢复正常。
//
//人员出现在一废弃农舍内，在检查切入点无异样后，人员环顾四周，发现农舍内杂乱地堆砌着稻草，一台老旧的拖拉机停在农舍中央。人员上前检查了拖拉机，发现其油箱是满的，但火花塞已老化，无法发动。人员在一旁的工具箱内找到了扳手、长接杆和六角套筒，但并没有找到火花塞替换件，发动拖拉机的想法只好作罢。
//
//人员推开农舍大门，出现在其眼前的是一片一望无际的跃动着金黄色麦浪的麦田。麦田上堆积的干草捆在平坦的地面上显得十分突兀。
//
//916ffbfaa7d29329.jpg
//摄像机记录的图像
//
//人员眺望四周，发现在西北方不远处正有一幢冒着炊烟的木质屋舍。人员快步向该方向走去。
//
//人员在靠近屋舍时放缓脚步，蹲着慢慢靠近屋墙，从玻璃窗向内窥视。正对着窗的厨房内刚烧开的水还冒着热气，隔壁的房间内传来电视机播放节目的声音。
//
//人员绕到屋舍正门，将匕首藏在裤兜中，深吸一口气，敲了敲门。屋内的电视声停止了，传出了回应，紧接着是一阵急促的脚步声，门被打开了。从屋内走出一位红光满面，仿佛喝醉了酒一般的有着人类外貌的中年男性。他看上去对有造访者这件事显得非常激动，连忙邀请人员进屋入座，人员盛情难却，只好答应下来。
//
//一杯散发着杏仁水气味的酒红色液体被端了上来，放在人员面前的桌子上。男性坐下开始进行自我介绍，其称呼自己为怀特，曾是一个货车司机。某天在送货时因为喝醉了酒，将车开下了大桥坠入水中。当他醒来时就躺在了一片麦地里，从此被困于这个地方。从那以后他就生活在这里，靠种地与捕猎动物为生。从他来到这里至今，麦田已经收割了十七次。他还说这里根本不知道这是什么鬼地方，自己又为什么会来到这里。这里的麦田和森林仿佛会无限延伸一般，永远也无法到达尽头。当被问及以前是否有别人来过这里，以及他是否知道出口时，他摇了摇头，说他已经很多年没有尝试过去寻找出口了，而在他之后来到这里的人，人员是第一个。
//
//说完，他对人员表现出了极大的好奇心，想知道人员是否与他来自同一个世界，以及他是否知道出去的方法。人员做出了肯定的答复。在了解到该层级无异常现象及实体时，人员带领他从原路返回了Level C-39
//
//[记录结束]
//
//
//探索记录：Level C-39.2
// 
//
//生存难度：
//等级 3
//
// 
// 
// 
//272c398e518c496e.jpg
//用于开启该扇门的钥匙的图像
//
//探索记录
//
//日期：████/██/██
//
//探索人员：先驱者019（下称人员）
//
//目标：探查此层级
//
//携行物品：杏仁水两瓶，███████牌巧克力饼干两包，运动摄像机一台，匕首一把。
//
//[记录开始]
//
//摄像机开机
//
//大约十秒的试机画面
//
//人员进入门中，切入Level C-39.2，切入瞬间摄像机有剧烈的白躁现象出现，且白躁现象一直伴随整个探索过程。
//
//人员出现在洞穴内。
//
//74590a359189abd5.png
//摄像机记录的图像
//
//
//洞穴壁顶缓缓滴落的水珠使空气格外潮湿，人员向洞穴内深入，发现前方是一处断崖，一旁的空地上支着一个帐篷。人员在帐篷内发现了生锈的冰镐和攀岩绳。
//人员将摄像机的夜视模式打开，捆绑在头顶，取出冰镐，在确认可以承受自身重量后，顺着岩壁向下攀爬。
//
//数分钟的攀岩画面
//
//人员落地，洞窟地面上有着滴落的水滴汇聚而成的小水洼。洞内能见度很低，唯一的光线来源来自不知何种原理散发着荧光的岩壁。人员继续深入，最终在一处分岔的洞口前停下。两边的洞口分别延伸向两条路，而左边的洞口被用木板封住了，上面用某种不知名的红色颜料画着大大的叉。人员决定先探索右边的路。
//
//右边的洞内很黑，伸手不见五指，岩壁也不再发光。人员几乎是慢慢摸索着，一步一步向前走，最终停在一处水池边。水池中生长着未知种类的荧光植物，将漆黑的洞穴微微照亮。人员在水池底发现了一把破旧的斧头，似乎是被人刻意扔下去的。
//
//人员在水池边用巧克力饼干和杏仁水果腹后，按原路返回了分岔洞口。这次他用带来的斧头砍断了挡路的木板。在一切重归于寂静后，人员深吸一口气，继续深入。
//
//这条路与另一条不同，沿路的岩壁上长满了各类荧光植物，壁顶也十分干燥，不再有水向下滴落。人员在对植物进行了收集后继续深入。很快，人员便达到了尽头——一片开阔的空地。
//
//就在这时，人员报告有滴滴冰凉的黏液滴在其脖子上。人员猛地抬头一看，发现一只非人形实体正攀在壁顶。那实体身形修长，长有两颗没有眼睛，嘴巴开裂的头颅，细长而又尖锐的舌头从其口中伸出。实体见人员发现了它，便猛地从壁顶蹦下来，拦在人员面前，用它只有两撇分岔的没有手指的大手向人员挥来。人员顺势在地上进行翻滚，躲过了实体的攻击。刚从腰间掏出匕首，却被实体细长而尖锐的舌头夺过撇远在地。人员只好拿出斧头，一边抵抗，一边向来时的路靠近。在实体的下一次攻击中，人员精准地用斧头砍向实体的一颗头颅，但因为斧头不够尖锐，嵌在了实体的头上。实体发出尖锐的嚎叫，倒在地上不停地抽搐。人员拼尽全力向来时的路奔去，插入钥匙打开门，在实体奔入门前的最后一刻将门关闭。
//
//[记录结束]
//
// 
// 
//
//关于Level C-39子层级的调查报告
//
// 
// 
//
//根据先驱者及M.E.G.对于Level C-39子层级的探索及调查，现公布以下结论：
//
//根据对实体“怀特”的调查及长时间密切监控，确认其为流浪者的一员，于17年前意外切入Level C-39.1。根据其对Level C-39.1的了解，确认该层级内无异常效应及实体，可作为安全区进行改造，同时其内部存在大量活体生物资源及食物、木材资源，根据这一点，对Level C-39.1的环境改造及移民将于近日开始，由M.E.G.全权负责。
//
// 
// 
//
//根据先驱者的探索，确认存在于Level C-39.2内部的实体对人类个体怀有极强的主动攻击欲望，且由于洞穴封锁被破坏，目前无法得知该实体位置。劝阻任何流浪者以任何理由进入Level C-39.2。
//
//根据仅有的影像资料分析，目前将该实体命名为歧颅兽。进一步的归类整理正在进行当中。
//
// 
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1039{}