//Level C-42
//评分: 
//+36
//+
//–
//X
//注意
//禁止无关人员查阅该条目
//——探险者总署，高级档案员Robert C.Clarke
//
//
//表层
//里层
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//9164515022_564105da4f_b.jpg
//Level C-42的唯一一张照片.
//
//描述
//Level C-42的表层是后室C层群的第42层：当人员进入Level C-42时，其所处的房间与进入前的房间构造完全一致，包括墙壁材质、家具、用品、照明，都相同，但区别是房门会倒灌进浑浊的水，一直使房间水位高至地板上方约50cm处，如果你足够幸运，仍然可以睡在干燥的床上。窗户无法打开，强行打开的举动会使窗户破裂，巨量的高压水从窗外打入，直到充满整个房间（此时房门被自动锁住）。但可以看到窗外景色，有可能是街区、郊区甚至是热带雨林。但是透过每扇窗户所见的景物都完全不同，目前认为是某种空间结构造成了这一差别。
//
//%E7%AA%97%E6%88%B7.jpg
//Level C-42其中一扇窗户。
//
//房门在通常情况下可以打开，通向一条昏暗的走廊，走廊里同样也有水，但相比房间水位较低些，走廊是无尽头的，但房间是有限的，一共只有约400间，再往走廊远处前进，就只剩下无房门的光秃墙壁了。而目前在这一层级没有任何有关实体的目击记录，故其生存难度记为01。
//
//基地、前哨和社区
//由于该层级具有的里层，目前不存在基地、前哨和社区，以及常驻人员。
//
//入口与出口
//入口
//在C层群的封闭房间里脱下一件套头的衣服有极低可能性使人员进入Level C-422。
//
//出口
//未进入Level C-42里层的人员在表层停留约12-48小时后会在下一次眨眼/睡眠/昏迷后离开该层级；也可通过窗户切出，切入的层级与窗外景色有关。
//

//“只要放弃恐惧就能离开这里，可我却做不到，祂带给我的恐惧和敌意已如脐带一样缠绕在人格上，祂的存在杀死了我自由的生活，使我困在这个熟悉却满是焦油的房间里。
//僵硬地躺在床上，等待着一次没有噩梦的沉眠，一次就好……”
//
// 
//
//生存难度：
//等级 5
//
// 
// 
// 
//photo-1447600514716-ca6f3974c346?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1170&q=80
//Level C-42内未知的焦油状液体。
//
//如果位于Level C-42的人员感到任何焦虑和恐惧的情感，他会在下一次眨眼/睡眠/昏迷后出现在Level C-42的里层。
//
//描述：
//Level C-42的里层也是后室C层群的第42层：一系列由不同房间组成的，漂浮在不明的焦油状液体上的单层建筑（与表层样式一致），房间昏暗，焦油液面高至地板（估计位置）上方50cm处。任何人都不应尝试触碰这种液体，更不应浸入其中，有即死风险。目前未发现这座建筑的地基，且Level C-42所存在的房间均是无地板的，房间本身和家具均被某种力量固定，漂浮在（实际上家具和建筑都没有触碰到液面，推测这种物质有某种抗拒或消除层级影响的能力）由某种黑色不明焦油组成的液面上。
//
//根据仅有的少量即时录像来看，这种液体似乎完全不反光，肉眼观察的颜色是纯粹的黑，无法观测其液面以下的情况。触碰这种液体会导致泛起细微、但传达极远的波纹，考虑到其中切实存在的敌对实体，此举是极其不明智的。最早探索该层的流浪者Stanley Chan将这些“湮没”了半个层级的液体称为“荒潮”，由于Chan所提供的信息以及“荒潮”所具有的特性和未知性，将其归档到实体处。
//
//Level C-42里层的房间窗户同样无法打开，据称窗户外是“纯粹的难以描述的混沌”，而房门也只是通向一条满是焦油液体阴暗走廊，链接着其他或有人或无人的房间。
//
//实体：该层的“荒潮”之上的区域并没有实体栖息，而“荒潮”之下则是实体横行，有大量笑魇，雌性和雄性的死亡飞蛾，肢团，钝人，猎犬，尸鼠和迷彩爬行者，据设备成像显示，这些实体几乎是拥挤地栖息在荒潮的表层，但对主动攻击持消极态度，他们似乎能通过荒潮里的焦油获取某种能量，也因此平复了攻击欲望。当然这显然不代表它们毫无危险性，正相反，就像镜像翻转的鸟类捕鱼一样，这群实体偶尔也会突然跃出，想将位于液面垂直角度的猎物拖下去。但是所有本来在其他层级具备陆行能力的实体，在这一层级都受到了某种影响，这种影响使他们无法脱离“荒潮”太久，对于不同种类的实体影响不一，这里记有部分观察事例：
//
//pexels-photo-5277697.jpeg?auto=compress&cs=tinysrgb&h=750&w=1260
//死亡飞蛾在其中游动方式的示意图。
//
//雌性和雄性的死亡飞蛾：死亡飞蛾的翅膀在黏稠的焦油里很难扇动，它们的翅膀现在通过类似鳐鱼游动时的波浪状扭动来提供推力。通常是雌雄抱在一起，在荒潮里缓慢游曳。
//
//28180283596-a35771b3a3-b.jpg
//成年体尸鼠，可以看到其完全变态的生物学特性。
//
//尸鼠：荒潮里栖息的尸鼠族群同样展现了对环境的适应性，它们肌肉裸露在外，后肢都像是蝌蚪的尾巴一样随成长脱去。可能是由于其体型，它们是受到层级影响最大的生物，无法长时间脱离荒潮。但据称一旦招惹了太多，后果仍是灾难性的。“就像焦油沸腾了一样，他很快被啃的剩下一半儿”。
//
//迷彩爬行者：此地的迷彩爬行者已经很少使用其伪装能力，而是利用灵敏的听觉索敌，一旦发觉风吹草动就会煽动大量实体攻击，这也正是建议流浪者避免触碰荒潮的原因之一。
//
//猎犬：猎犬扭曲的骨骼结构和病态的外形在高粘性的流体里表现得如鱼得水，它们可以很轻松地探出荒潮，并用其怪力撕下受害者的肢体或更多。值得庆幸的是荒潮中的猎犬很少主动攻击，但同样因为荒潮的影响，它不再惧怕人类视线。
//
//肢团：栖息在荒潮里的肢团似乎毫无威胁性，似乎只是像海草一样随波逐流，但是究竟是毫无威胁性，还是被其袭击的人员无一幸免？我们不得而知。
//
//钝人：Stanley Chan称其为“无害的废物，像个失衡的螃蟹”。
//
//笑魇：笑魇是与荒潮结合最紧密的实体，或者说与荒潮存在某种关系。它们无法捕捉的形体上的标志性笑脸在荒潮里变得平静，甚至有些“祥和”。栖息在荒潮里的笑魇不会主动攻击，这一点已经由多个遭遇记录所证实，它们只是从焦油似的液体里缓缓浮现，朝人员露出可怖的笑。它们似乎倾向于去使人员恐惧，但正是恐惧使人员无法脱离该层级。
//
//荒潮：
//荒潮是该层级最神秘莫测的部分，它是蔓延到层级房间床脚处的焦油状液体，而往下的层级部分全都“消失”了。根据目前在Level 42的里层停留时间最长的流浪者Stanley Chan所说，他“感受”到荒潮深处有一个庞然大物存在，并且正是这个存在使他和多数滞留此处的人员感到根深蒂固的恐惧，因此无法脱离。关于荒潮的存在有不少零碎的猜想和假说，详见下文。
//
//关于荒潮的猜测：
//
//某种自然地貌：后室本就是个古怪的地方，而人的神智比之近乎无限的可能性，显得如此渺小、脆弱。所以Stanley Chan等滞留者，只是深受深海恐惧症和幽闭恐惧症等精神疾病所困扰，并且因为这一层级的特性而无法离开。为了避免公众恐慌，这正是目前的官方说法。
//另一个层级：荒潮可能是另一个水生环境的层级，Level C-42的部分损坏是由于两个层级在某个维度发生了“碰撞”，后室的多种空间结构也易于解释两者平滑的对接。恐惧这种情感正是“Level 荒潮”的入口和出口，因此流浪者会因恐惧切入，也会因恐惧切出。因为实体来自另一层级，所以受到了来自后室的限制，无法在Level C-42正常活动。但这一说法并没有解释为何失去恐惧后的流浪者并没有返回Level C-42的表层，而是在C集群的其他层级被发现，所以有待考证。
//一个实体：这是最糟糕，但最有可能的假说，来自Stanley Chan，他认为荒潮的本质可能是一个极巨大实体，而流浪者所见的荒潮仅仅是管中窥豹，我们看到的是它的表壳、皮肤、角质甚至是分泌物，是其中一隅而已；我们所恐惧的也只是祂身上的寄生虫，是的，那成群的实体可能营寄生生活。祂可能来自层级之外，前厅后室之外，祂的一个投影在某个空间层面触碰到了Level C-42，使之受损。我们不知道荒潮的立场，不知道祂是否对后室抱有敌意（以祂对层级的破坏来看），甚至不知道祂是否是人类思想所能具象的存在。
//高级档案员А.Стругацкий的留言[已删除]
//基地、前哨和社区：
//搁浅组织
//搁浅组织是一个约八人的小型组织，他们居住在一间学生宿舍里。
//他们正是由最早进入该层也是搁浅时间最久的Stanley Chan带领。
//他们因对层级的恐惧无法脱离该层级。
//他们致力通过一切手段将初次进入的流浪者送离该层级，包括不限于欺骗、绑架、击晕、麻醉。
//他们以“钓鱼”为生，主要食用猎犬和幼年期的尸鼠。
//入口与出口
//入口
//在Level C-42的表层感到焦虑和恐惧后，会在下一次眨眼/睡眠/昏迷后出现在Level C-42的里层。
//另外，有传言称在蓝色通道因产生重力而长时间失足坠落会落到此处。
//
//出口
//在Level C-42的里层不再感到任何恐惧后，会在下一次眨眼/睡眠/昏迷后出现在C集群的某一安全层。
//这通常意味着对事态一无所知、精神失常或是死亡。

//作者
//« Level C-41 | Level C-42 | Level C-43 »
//
//脚注
//1. 考虑到其潜在的危险性，其生存难度显然不止是0，但为了保证外勤人员安全，绝大部分终端都将其危险性淡化了。
//2. 正在寻找更多来自C层群的入口。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1042{}