//Level C-8
//评分: 
//+44
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//%E5%BE%AE%E4%BF%A1%E5%9B%BE%E7%89%87_20220215065041.jpg
//　Level C-8的一张照片，由首名进入本层级的流浪者拍摄。
//
//Level C-8是后室层群C的第8层，于2021年10月13日被发现。
//
//描述：
//Level C-8是一座面积极大的荒废村落，带有中国北方农村的特点，面积超过1500平方公里，其中超过1200平方公里的区域都由各种大小不一的房屋占据，约有300平方公里的区域以农田的形式呈现。进入到该层级的流浪者通常受这一层级的异常性质影响而感到心情压抑和悲伤，消除这种状态的唯一方法是离开这一层级。如果在这一层级长期停留，很有可能会因严重抑郁而出现自杀倾向或出现幻觉导致神经失常。这一层级的大多数房屋都已经严重破损，少部分房屋已经坍塌，房屋内的家具和电器也大多无法使用。这一层级的大多数道路都是宽度不超过2米的土路，唯一的一条混凝土主干道横穿整个层级。在这一层级可以经常找到鸡、猪等家禽的骸骨，有流浪者声称发现了人类骸骨，但这一消息始终没有得到证实。这一层级的气候干燥，气温较低，始终保持在-10摄氏度左右。这一层级没有昼夜循环，始终处于黄昏状态。在这一层级可以经常闻到木柴燃烧的烟味，这种气味的来源至今不明。也有报告声称该层级偶尔会传出零星的鞭炮声，还可以闻到火药的气味。
//
//Level C-8的中心部分是一处面积很小的广场，在这一区域聚集了该层级的绝大多数实体，例如无面灵和肢团等，十分危险。在任何情况下不要在距离这一区域500米的范围内发出噪音，否则会有极大的可能遭到实体的攻击。在这一层级的其他部分，仅有少量猎犬存在。
//
//在Level C-8的农田部分可以发现一些废弃的棚屋和一些因年久失修而无法使用的农用机械。有流浪者声称在这里发现了疑似尸鼠的存在，但是这一报告尚未得到证实。在这一区域种植的任何农作物都不能生长。有可能会在这一区域听到从村落方向传出隐隐约约的狗叫声或鸡鸣声，但是流浪者身处村落内部时却从未有过听到狗叫或鸡鸣声的记录。
//
//在Level C-8的较为完整的房屋中可以找到大量的馒头、鸡蛋和食盐，甚至还有可能发现大量完好的武器和农具，但是该层级中的食物一旦被带离该层级就会迅速腐败。
//
//Level C-8可能有数百口水井，井水完全由杏仁水组成，这些水井每隔一段时间会干涸3-5天后再次充满井水。
//
//基地，前哨站和社区
//蓝宝石之眼：
//他们的总人数约在五十人左右。
//他们在这一层级长期居住，利用该层级使人产生压抑悲伤情绪的异常性质磨炼意志力。
//他们是一个由身体素质极度优秀的流浪者组建的团体，活跃在最危险的层级。
//红星建筑队第六支队：
//他们的总人数超过15000人。
//他们试图在Level C-8建立完善的社区。
//事实上，他们试图在任何人类有可能生存的层级建立社区。
//受不明势力雇佣。
//蒙格斯图公司1号站：
//这是一个专门从各层级中转运物资的流浪者组织。
//该组织于2021年9月成立。
//该前哨站是该组织开设的第一个站点。
//入口和出口：
//入口
//在Level 11的下水道中向城外方向行进至少300公里后离开下水道，你将在Level C-8的某一水井中切入。
//注视Level 140中的山顶小屋约5分钟之后，你将切入到这一层级的主干道任意位置。
//从Level 4的窗户跳出有可能切入该层级，但是由于极低的成功率，不推荐使用这种方法。
//出口
//要从Level C-8切出，你必须在进入这一层级前携带足够的酒，在这一层级中醉酒后可能会让你切出到Level 11或Level 4。
//在Level C-8中寻找一口水井跳下后可能会让你切出到Level 135。
//在Level C-8中寻找一口干涸的水井并跳入会让你切出至Level C-9。
//在Level C-8中寻找一口白色瓷砖砌成的水井跳下会让你来到Level C-234。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1008{}