//Level C-27
//评分: 
//+19
//+
//–
//X
// 
//
//生存难度：
//等级 4
//
// 
//真菌威胁
//大量实体
//Level C-27是后室C层群的第27层。
//
//amy-humphries-fdeVkxtyymk-unsplash.jpg
//一位流浪者在刚切入Level C-27时拍摄的照片
//
//描述
//环境
//Level C-27为一片巨大的圆形浮空岛屿，岛屿表面为一片巨大的丛林，其中所有树木的树干、树枝和根部表面都覆盖着菌丝且长有许多灰白或发光蓝色的菌菇。Level C-27的半径为327公里，岛屿下方为浮空的锥形且充满孔洞。从岛屿的边界跳下会导致从岛屿中央的上方落下。
//
//实体
//Level C-27中存在大量被称为“菌尸”的实体，它们由死亡流浪者的尸体被层级中的真菌寄生后复苏而成。“菌尸”在此层级中存在一种奇特的特性，它们会主动贴上层级中的树木，当它们靠近那些树木时，菌丝会从树木表面长出并快速包裹它们并使得“菌尸”与树木融为一体，难以被发现，如果在这时触碰或攻击这些“菌尸”，它们就会立即从菌丝中爬出并在喷射出大量真菌的同时攻击附近的流浪者。
//
//特性
//Level C-27中的泥土、地面和树木都存在大量的致死真菌，任何试图挖掘地面或砍伐树木的行为都会导致真菌喷射并扩散。流浪者一旦吸入，这种真菌会在30分钟内长满流浪者的肺部并使其窒息而亡，随后真菌会进入流浪者的大脑并在其中生长，直至尸体变成一只复苏的“菌尸”。杏仁水已被证实可以治疗这种真菌感染。
//
//悲尸在此层级中也会被真菌寄生，菌丝长到它们身上后，它们就会变为长满菌丝的悲尸，这种悲尸在追击流浪者的过程中会喷射真菌，威胁巨大。除此之外其余实体与动物均会被真菌杀死，无法转变为“菌尸”。有人声称极少量情况下它们也有可能会变为“菌尸”，尽管这种说法并未被证实，但依然建议流浪者远离层级内意外切入的实体。
//
//基地、前哨和社区
//M.E.G. (探险者总署) 菌菇丛林前哨站
//愿意为流浪者提供食物、杏仁水、防毒面具等生存物资和必需品
//可以有效对抗实体侵袭
//“蘑菇爱好者”
//他们是一群病态的蘑菇爱好者
//他们拥有大量杏仁水储备，疑似掌握了层级中未知的杏仁水获取途径并拒绝分享
//他们靠吃层级中的蘑菇并饮用杏仁水来生存
//他们抗拒离开层级
//2017-7-17日起已无法在层级中找到他们的踪迹，疑似因各种原因已无人生还。
//入口与出口
//入口
//进入Level C-67中标有“蘑菇汉堡俱乐部”标牌的蓝色木门。
//在Level C-20中向上攀登直到找到一扇画着蘑菇的蓝色木门并进入。
//在Level C-97中探索可能会找到几个蓝色的蘑菇，拔下并手持一个蘑菇后继续探索会发现周围环境变成了长满菌丝的绿叶树木，此时就到达了Level C-27。
//在Level C-9中进行有关蘑菇或菌类的想象，周围的环境会变化并到达Level C-27。
//可通过Level C-136的大厅进入。
//出口
//在层级内一片丛林内的小湖中失去意识有可能在Level C-106的平台上醒来.
//在层级内找到一处坡度大于等于33.2°的斜坡地形切入，即可到达Level C-14。
//在层级内探索时可能会发现一片树叶与枝干均为蓝色的树木林，进入后就到达了Level C-158的其中一个小岛的丛林中。
//进入Level C-27中的一个花岗岩洞口，会从Level C-45的岩石群中的水中醒来。
//走入Level C-27的一个岩洞将有几率从Level C-222的一处山丘走出。
//在层级内走入一个伸手不见五指的洞口（树洞、山洞皆可）。当你感觉到头部“逐渐沉重而无法抬头”时，则说明已经切入Level C-31。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1027{}