//Level C-61
//评分: 
//+26
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//3.jpg
//Level C-61内11号交通枢纽的火车月台。
//
//Level C-61为后室C层群的第61层。
//
//描述：
//Level C-61表现为多座综合交通枢纽的集合。这些交通枢纽与前厅中的交通枢纽在各方面大体表现一致，但在细节上具有多处不同。这些交通枢纽没有任何数字以外的文字符号，而每个交通枢纽都有自己的数字编号。目前，编号在1～230之间的交通枢纽都已证实存在，少量编号大于230的交通枢纽也被证明存在，这些交通枢纽的总数量未知，它们的编号是否是一直按照自然数排列的也是未知的。
//
//每个交通枢纽之间的构造与大小都会有所变化，但其占地面积总体上都保持在5—10平方公里（不包括飞机跑道部分）之间。
//
//该层级内没有除植物外的一切生物与实体，这些植物虽然与前厅中的正常植物外形和特征一致，但这些植物能够在没有其他生物的情况下自行模拟正常生物圈内植物的生老病死，以及腐化消失。同样令人奇怪的是虽然这些交通枢纽基本属于弃置状态，并有大量植物在建筑裂痕中生长，这些交通枢纽的各种电器及机械设备仍能保持正常功能。并且，这些交通枢纽的检票与门禁设备一直处于解锁的状态。
//
//Level C-61内没有昼夜循环与天气变化，天空中没有云，太阳固定在正南方高度角68度35分处，气温固定在33—35℃，湿度也保持在“干爽”的范围内。
//
//这些交通枢纽内的店铺中原本并非生活必需品商店（即所谓“小卖部”）的都被清空，且未被清空的商店内将没有收银台，里面商品的包装（以及商品本身可能附带的，比如说圆珠笔芯上面刻着的批次号）上面的文字都被清空。在笔记本等私人物品上能正常书写，但尝试在建筑或交通工具等公用设施上留下数字以外的文字的尝试都失败了。值得注意的是所有的发酵食品内部的微生物都经过了去活化处理，且部分乳酸菌饮料瓶的内容物变成了杏仁水。这些商店货架上的物品每二十四小时进行一次补充，每次补充的商品都略有不同。
//
//在各交通枢纽之间的旅行方法与其细节如下：
//
//地铁：仅有往与返的两条轨道，每二十分钟将到来一列，坐上之后将会开往编号与离开的交通枢纽编号相邻的交通枢纽（数字加还是减取决于乘坐地铁的方向），1号交通枢纽仅有一条轨道，2号交通枢纽到来的地铁在停靠三分钟后将会掉头往2号交通枢纽行驶。每个交通枢纽编号之间的行驶时间（单位编号行驶时间）为110分钟。
//长途公共汽车：按照汽车上标识的数字前往相对应的交通枢纽，出发点与目的地编号相差范围不超过10。单位编号行驶时间为100分钟。（比如说从17号枢纽到22号枢纽，中间差了五个编号距离，那么行驶时间就是100×5=500分钟）
//普通火车：皆为卧铺，分慢车，普快，特快三档，按照火车侧面挂上的两个数字能确定出发点与目的地。出发点与目的地的编号相差范围大于等于10，小于等于50。慢车单位编号行驶时间为120分钟，普快为90分钟，特快为70分钟，每个交通枢纽处都会进行停靠。
//高铁与动车：分卧铺，坐位两种。除动车单位编号行驶时间为40分钟，高铁为30分钟以外，其余与普通火车相同。
//飞机：根据登机口处的数字提示可确认目的地。出发点与目的地编号相差范围大于等于十五小于等于六十。单位编号时间为10分钟。
//步行：理论上可行，但尚未进行实验，由于长时间暴露在层级内的露天气候可能致人中暑昏迷，M.E.G.在此建议流浪者不要自行尝试去做这样的试验。
//上述交通工具无法被破坏，且都是在没有驾驶员的情况下行驶的。
//
//2.jpg
//一次单人乘坐火车拍摄到的窗户外的景象，注意景象与层级气候不符合。
//
//乘坐这些交通工具时将出现一个不会对人直接造成影响的异常现象：如多人乘坐同一个交通工具时，在窗户处看见的景象将是夏季的落叶阔叶森林草原；如单人乘坐一个交通工具时窗户外的景象将因人而异，这些景象的风格从极为现实的到类似于儿童漫画形式的都会出现。出现这些景象的原因不明，但所有乘坐者都不约而同地报告说自己曾经在前厅看到过这种风格的画面，且“至少不会厌恶”这些画面。每次换乘不同的交通工具时景象都会有所变化，而在同一个交通工具内的景象将相同。由于这些景象并未引起任何正常情绪以外的反应，且景象内除了没有任何数字以外的文字外没有任何异常，M.E.G.将不对其进行考察。
//
//基地，前哨与社区：
//由于该层级内资源总量较少且分散，无法支持较大的社区，不过也有一些较小的社区存在：
//后室机器人科技测试基地
//在5号，6号以及7号交通枢纽内都存在。
//因为想要观察交通枢纽内生长的植物对机械设备的影响而设立。
//他们发现这里是一个很好的测试无线设备的地方，现在正在进行相关试验。
//“窗边风光”摄影团队
//在30～150号交通枢纽内都有可能发现他们，77号交通枢纽是他们的总部。
//专职于坐在交通工具内拍摄窗户显示出来的影像。
//通过出售精选的影像相片来换取其他用品。
//“业余探险家”
//由一群13—17岁的青少年组成。
//会在各交通枢纽之间穿梭，探索各个交通枢纽，200号以后的交通枢纽都是他们发现的。
//曾经尝试探索交通枢纽外的部分，但称“除了越来越密的植物以外什么也没有”。
//入口与出口
//入口
//在C层群内找到一张长椅，在其中一个坐位上待上半个小时，如这段时期中没有任何突发情况，那么坐位上面的人就会被传送到Level C-61编号为1，16，22，53中任意一个交通枢纽的一张长椅上。
//
//可以从速切航空的舱门处进入。
//
//出口
//搭上Level C-61任意一处交通枢纽门口的出租车将把你带到C层群内任意一处有可行驶马路的层级。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1061{}