//Level C-80
//评分: 
//+13
//+
//–
//X
// 
//
//生存难度：
//等级 3
//
// 
// 
// 
//levelc80
//一张由正在仓皇逃窜的流浪者无意所摄的Level C-80相片。该“地面”是一张凉席。
//
//Level C-80是后室C层群的第80层。
//
//描述：
//Level C-80的环境是不定的。具体而言，它会针对进入该层级的人类进行特定的变化。
//
//每个人所看到的Level C-80环境都是自己记忆中“最初的家”：所有的物件与家具都与主体记忆中的模样完全契合，而且尺寸相当的巨大，仿佛进入Level C-80的人类遭到了缩小1；根据多次比较，可以确认一个身高1.7m的人类在Level C-80的物件面前基本等同于1.7cm，即比例刚好缩小约一百倍。假如同时有多人进入Level C-80，那么Level C-80会选定其中一人记忆中的“家”进行相应变化。
//
//除此之外，Level C-80内存在两个巨型人形实体2。除去其面部没有任何器官的特点（该特点与无面灵一致）以外，它们的外观与正常人类无异。另根据显而易见的服饰与生理特征，二者为一男一女。
//
//所有进入Level C-80的流浪者都会被上述实体追击；二人似乎会在流浪者进入该层级的瞬间得知“有人到来”，并开始四下搜寻。若二人成功抓住目标，它们就会携其前往“厨房”并将目标扔进桌上的一碗“巨型”麦片粥，在确认目标溺亡之后方才离开。
//
//因此，该层级极为危险。若不慎进入，请设法迅速前往该层级唯一的出口，即“家门”。
//
//附录：
//以下是一份与Level C-80相关的探索记录，其中包含三名流浪者。现已隐去无关的姓名信息，代以A、B、C。
//
//[记录开始]
//
//
//（切入过程省略。三人身处一个类似于巨型卧室的地方，站于床脚处。）
//A：（错愕地扫视巨大的环境）这、这是怎么……
//
//C：……等等等等！我记得我在数据库里有看到过一个类似的层级，好像是那个——
//
//B：（低声、急切）过来！
//
//（B突然揪住A和C的肩膀，一把拉着二人飞速躲入床底。）
//
//A：哎哟喂，疼！咋啦？
//
//B：（示意仔细听）嘘 。
//
//A：（和二人一同聆听片刻）……地震……？不，不对，是——
//
//A，B，C：（异口同声）脚步声。
//
//（与此同时，一双穿着男式拖鞋的巨足出现在房门方向。它停留片刻，又转身离开。）
//
//A：（低声）我操。
//
//C：巨型房屋，还有“巨人”。错不了，是——
//
//B：八零楼。
//
//C：（纠正）层级。
//
//B：（烦躁）都一样。
//
//A：啧，所以现在是怎样啊？我们现在怎么办？
//
//（B和C你一言我一语地给A概述了Level C-80的层级性质。）
//
//A：这样吗？咱虽然没听很懂，但是不是说，我们只要跑出大门就安全了？
//
//B：假如档案提供的信息准确无误的话，那就是这么一回事。
//
//A：好噢，所以这里是“谁家”？（朝床底范围之外探头探脑）我……我是没什么印象。
//
//（C看向B。）
//
//B：（咬牙）我家。看到墙上那副裱起来的奖状时我就想起来了。这里和我小学时睡的那个房间一模一样。呵，用这种方式“故地重游”真是活见鬼……
//
//A：好了，没人关心那个。大门在哪里？你没忘吧？
//
//B：放心，没有。从这个房门出去，穿过过道就是客厅，再往右看就能看见大门。过道里有另外三个房间、而且客厅与厨房相连。布局的话大致就这样。
//
//C：那你带路吧。希望那两个巨人不会半路杀出来。
//
//A：这倒其次，他们走路跟地震一样，一靠近咱们都听得见。比起这个，我关心的是过道还有客厅那里有地方给我们藏吗？
//
//B：（吸气）客厅可能还有点沙发凳子，过道的话——祝我们好运吧。
//
//（三人在漫长的过道里拼命飞奔。除去过道末端、即三人刚刚离开的那所卧室，前方的左前、左中、右中还共有三扇巨大的房门，即另外三间卧室。左前方的房间里有着清晰可闻的走动声与翻找声。）
//
//B：第一次觉得我家还真大！操！
//
//A：小声点儿！
//
//C：怕啥！我们的声音对他们来说就是蚊子哼哼！
//
//A：行吧行吧！
//
//（三人飞速移动到右中位置的房门。B示意大家停下，并带领二人走入该房间，躲在沉重的房门内侧。）
//
//B：他在左前方那个房间，我们直接从门前跑过去的话难保不会给他发现。我们就先躲在这儿，等他去后面那两间找时我们再赶紧移动，跑到客厅就好躲了、离大门也近了，嗯。
//
//C：嗯，有理。
//
//A：这个是谁的房间？
//
//（房间的风格显得较为女性化。中央还摆着一张巨大的粉红床铺，笼罩在蚊帐里。）
//
//B：（仰望床垫边缘）这个是……呃对，我姐的房间。
//
//（左前方房间的翻找声停下了，随即传出一阵巨大的脚步声。）
//
//B：他换地方了！准备！他一过这扇门我们就——
//
//A：等一下！
//
//B：——赶紧移——啊？怎么了？
//
//A：（盯着B）巨人不是有两个吗？还有个女的呢？
//
//B：……嘶，对啊，那她是在——
//
//（二人身后的C轻轻拍了拍二人，示意他们看床。A和B顺着C示意的方向缓缓看去，清晰地看见了从床上坐起的另一个巨人。巨人那没有任何器官的平滑面部也正“看向”他们。）
//
//A，B，C：……
//
//（女巨人登时甩开棉被、拉开蚊帐，飞速下床奔向三人——）
//
//C：跑啊——！！
//
//（三人跑出房门，正面撞见刚从左前方卧室走出的男巨人。）
//
//A：我操！
//
//（接下来的对话无从梳理。两个巨人堵在过道内围追堵截，不断伸手试图抓住三人。三人阵脚大乱，完全失去方向，只能胡乱地朝客厅方向挣扎。）
//
//（A和C勉强冲出包围，拼尽全力地冲出过道。B在身后悲号。）
//
//C：右边右边右边——
//
//A：哪呢哪呢？？门呢？那是个啥啊——
//
//C：鞋柜！大门就在它后边儿了！错不了！
//
//A：老陈怎么办？
//
//C：哪还顾得上啊！跑吧！
//
//（在快要接近大门时，过道内忽然传出一声清脆的喀嚓声。后续分析可能是巨人不慎将B踩死。）
//
//（几乎与此同时，Level C-80的环境开始如同视频失真那般扭曲与波动、家具们也开始“粉碎”与“重组”，最终在大约短短10秒钟内彻底改变，转化成了另一副模样。幸运的是，这一布局下的大门方位没有发生太大的偏移。）
//
//C：（惊呼）——怎么回事——
//
//A：——这——我，我家？！
//
//C：你家！？
//
//A：（回头，又转头）不重要啦快跑吧！
//
//（C回头看去。原本的过道位置变成了阳台，站在阳台上的两个巨人也正显得有些好奇地四下环顾。在看到A和C即将抵达大门时，巨人们又立刻拔腿追来。女巨人左脚的拖鞋边缘染有血迹。）
//
//C：快快快快快！要到了要到了要到了！
//
//（根据C的事后描述，当时有一种寒意“飞快地滑过心头”。）
//
//C：（转头看A）嘿，我说——
//
//（一道迅捷的黄色身影高速、无声地掠过，以迅雷不及掩耳之势叼走了A。A甚至没来得及发出一声惊呼。）
//
//（C短暂失神，但立刻清醒，“又哭号又咆哮”着到达大门，冲入门外的白光，成功切出本层级。）
//
//（同样是根据C的事后回忆：现确认A有提及过儿时家中确有养猫。）
//
//[记录结束]
//
//基地、前哨和社区
//该层级不存在已知的基地、前哨和社区。
//
//入口与出口：
//入口：
//在Level C-64的事件完成后停留约2h，将有几率切入本层级。
//跳出Level C-56的落地窗。
//集体进行普通的切出/切入行为时似乎存在误入本层级的可能性。正在总结是否为真/存在规律。
//更多入口尚待探查。
//出口：
//“家门”。在所有的案例中“家门”皆不处于关闭状态，定然存在一条足以通过的门缝；走出“家门”将抵达Level C-82。
//更多出口尚待探查。
//作者信息
//« Level C-79 | Level C-80 | Level C-81 »
//
//Footnotes
//1. 事实上，当前并不能确认究竟是层级环境本身真就巨大、还是进入层级的人类受到了未知力量影响而体型变小。
//2. 相对于Level C-80的环境而言，其为正常人类体型。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1080{}