//Level C-34
//评分: 
//+19
//+
//–
//X
// 
//
//生存难度：
//等级 2
//
//基本安全
//稳定
//中等数量实体徘徊
//Level C-34是后室C层群的第34层。
//
//field_away_summer_sky_clouds_lane_landscape-1018450.jpg!d
//Level C-34基本状态
//
//描述：
//Level C-34是一块尚未完全探明平坦农场区域。
//
//Level C-34的地势较为平坦，在被流浪者最初发现时似乎是已被开拓但已荒芜的土地。其上零星散布着类似家庭农场的房屋、设施和农业机械，规模各异。甚至发现包括类似前厅大型农业企业的驻地，以及一些社会公共建筑。层级中的所有设备和房屋都呈现陈旧的状态，但不影响正常使用，并且可以清洁和翻新。未知来源的Wi-Fi信号稳定而良好，但只有在建筑周围才存在Wi-Fi信号。一条宽约100米的河流贯穿整个层级，并且拥有码头和抽水站等设施，耕地的边缘被栅栏包围，栅栏内不存在持久活动的实体，但在栅栏之外是未知种类的灌木和高草组成的茂密丘陵地形，经常可见实体在其中徘徊。
//
//Level C-34中本身几乎很少有可用物资，在一些公共区域建筑内，储物柜中或一些其他位置可以找到少量杏仁水，皇家口粮，水果、肉类罐头，酒，清洁用品，以及其他日常用品。墙壁上一些标有红十字的小型储物箱内可以找到药品和医疗用具。这些物品会以类似Level C-28中的方式自我恢复，但略有不同，小型农用货车或农用单人车辆不定时运载物品从层级外的道路上驶来，但其上没有任何实体驾驶车辆，停在建筑物门前，储物柜门自动打开，物品以漂浮的方式移动进柜中和其他位置，车辆在动作完成后自动开走。Level C-34物品恢复方式相较Level C-28比较缓慢，人员难以靠此种方式完全满足需求。
//
//此层级与后室大多数室外层级不同，不仅拥有分别10小时的规律昼夜循环，还拥有分明的四季交替，属于典型的温带大陆气候，且在季节交替的时间上与前厅近似。所有进入层级的人员，特别是长期生活或是出生在在乡村地区的人员，都报告了一种程度很高的平静，安宁感觉。这种感觉就像回到了前厅中的家乡，远离了后室中的危险感，获得了难以言说的平静，甚至有流浪者报告称他找到了一栋与他的家极为相似的房屋，甚至连装饰和摆设都完全一样。
//
//Level C-34中的每栋房屋均有独立的发电机和储水塔，可使用火盐融化后的火油做为电机燃料，每桶标准容量的火油可维持电机运行很长时间，储水塔则由河流上的抽水站负责供水。此外层级中也拥有专门的星云燃气储存建筑，由管道供应至每栋建筑单独的家庭储存设备中。大量人员搬迁入此层级后，迅速翻新清洁了建筑及设施，启用了公用功能性建筑，并清理了土地。因为几乎所有房屋都有畜棚，但整个层级内除无足鸟和高草丛中徘徊的实体外却没有其他生物，所以一些流浪者另辟蹊径，在Level 81中想方设法捕获一些动物，例如鸡、火鸡、鹅、猪、山羊、绵羊、牛、马等带到层级中饲养，Level C-34的土地目前主要用于耕种小麦，玉米和稻米，以及主要为十字花科、伞形科及一些其他种类的蔬菜，包括胡萝卜、芜菁、花椰菜、芥菜、芹菜、生菜、番茄、土豆、茄子、辣椒、甜椒、黄瓜、南瓜、甜菜，以及豆类，包括大豆、菜豆、豌豆。在一些区域则以果树为主，主要为苹果、桃子，橙橘，葡萄，樱桃、浆果。少部分土地甚至主要耕种花朵，例如玫瑰，蔷薇，薰衣草。
//
//rainbow_background_roadway_beautiful_landscape_country_road_countryside_blue_sky_clouds_sky-657518.jpg!d
//Level C-34的道路
//
//在层级中类似农业企业的驻地内拥有农产品加工区域，可加工Level C-34中产出的农作物、肉类、水果以及花朵。贯穿层级的河流中，也存在正常的水生生物活动，可收获水产。本层级也有着标准的交通设施，存在铁路和火车站台，甚至一个简易农用机场，可与其他层级，主要是Level C-28和Level 11联通。需要注意的是，隐藏在边缘栅栏外的实体在有些情况下可能越过栅栏，破坏农作物，袭击流浪者饲养的牲畜，甚至可能伤害流浪者，虽然Level C-34的实体，主要为笑魇，死亡飞蛾，肢团，窃皮者，攻击欲望相比其他层级较小，但仍具威胁。因此M.E.G.建议流浪者住宅内常备武器，并且保持一定警惕性。
//
//第一位定居在此的流浪者所写
//我曾经住在乡村，当我还在我的家中时，我记得那里。满目都是高草的芬芳，我躺在夜晚草地上，注视着那璀璨的星海，我仍然记得那广袤的银河。
//
//那时我和我的父母住在一起，我每天都能吃到母亲亲手做的饭菜，香气氤氲。父亲每天晚上工作结束后都会和我玩耍，那种快乐我仍然刻印在我的心灵，但那记忆已经离我太过遥远，那时的每天，葳蕤长日。
//
//直到那天，在我熟悉不能再熟悉的道路上，来这的每个人都应该差不多，就好像一脚踩空那样，瞬间跌入了那个满是黄色墙纸的地方。
//
//当时我茫然无措，恐惧吞噬了我，当我终于找到其他幸存者并知道终于发生了什么，我深深地陷入了绝望，自那以后，就像一个行尸般，在各个层级中游荡，我感到我真是个胆小鬼，无法鼓起勇气像那些勇敢者一样，向危险的层级进发，去寻找那可能的出口。
//
//每天浑浑噩噩，以为我的生命就会如此走向死亡，直到我发现了这里。
//
//当我一进到这个层级中，我心神恍惚了一番，一种强烈的归属感和怀念感萦绕了我，那时，我以为我回家了。
//
//我发疯般的冲进家门，那栋屋子，就像我的家，一切的一切，连墙壁的墙纸都一样，东西的摆放都一样。但是，这里却没有我的家人。
//
//终究接受了现实，我选择住在这里，这里能让我感到安心，一切都能。虽然知道，这里仍然不是那个所有人熟悉的世界，但最接近。
//
//相信，终有一天，后室里的所有人，可以找到回家的路。
//
//M.E.G.伊塔基地主管李玖夜回复：
//相信我各位流浪者，我们茫然无措的时间不会一直保持下去，前厅与后室的双向联通虽然看上去不可能，但终究就像在一个屋子里，总能从密室走出门去。我们已经发现了一些东西，也需要打破一些思维惯性，我们要做的就是整合资源，积聚力量，通往前厅的路径，也许就在我们意想不到的地方。
//
//基地、前哨与社区
//M.E.G. (又名 “探险者总署”)前哨“梦中现实”
//据有一座大型农业企业建筑区域，划分拥有据点附近沿河流分布大约30000平方公里土地
//由M.E.G.以机械化方式直接经营，并控制一座河流码头
//定期运输农作物、肉制品、动物制品、加工食品、罐头食品，鲜花奢侈品向大量人口聚居的层级
//管理人员和雇员共有260人
//B.N.T.G.34号资源收集站
//同样据有一座大型农业企业区域，拥有火车站附近52000平方公里土地
//以农业制品与其他层级交易大量生活用品和工业品，尤其是杏仁水和火盐
//开放贸易
//Level C-34的居民
//大约6000名定居在此层级的流浪者
//大多划分了属于自己的土地和房屋，从事农业生计
//经常使用农用货车通过公路，或是通过铁路和船只运输自己生产的农作物、肉类和其他动物制品到其它层级贸易以交换商品，或是在层级内与B.N.T.G.贸易
//入口及出口
//通过正北方的公路行驶200公里可进入Level C-28，同理，也有道路通往Level 11
//其他方向的公路网络可通往Level C-115、Level C-214、Level C-254
//通过河流逆流而上也能抵达Level C-28、Level 11，顺流而下出海则能抵达Level C-63
//通过铁路可以连接Level C-28、Level 11、Level C-8、Level C-214、Level C-254
//通过简易机场航空飞行能够抵达Level 11、Level 36、Level C-28、Level C-214
//无月夜晚深入高草丛中寻找红色光有可能进入Level 9.1
//以上均为稳定联通的双向通道
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1034{}