//Level C-45
//欢迎来到B.F.P.F.
//保障您的生活就是我们的职责
//B.F.P.F.已经成功在Level C-45中建立了第二个主要基地，这是B.F.P.F.从建立以来的发展过程中一个重要的里程碑，这意味着整个B.F.P.F.已经不用再龟缩于一个层级。我们成功向我们的理想迈出了重要的一步！B.F.P.F.会继续救助流浪者和友善实体，继续在后室中传播我们的理念，绝不让其他人阻止我们前进的步伐，坚持要让民主与和平把这个世界变成属于我们的圣地！
//
//——2019年11月30日
//
//
//评分: 
//+25
//+
//–
//X
// 
//
//生存难度：
//等级 2
//
//环境适宜
// 
// 
//Level C-45是后室C层群的第45层，是B.F.P.F.的二号基地所在处。
//
//%E5%9F%BA%E5%9C%B0
//Level C-45中的岩石群
//
//描述
//环境
//Level C-45在最初发现时为被浸泡在一片面积巨大的水面中的岩石群，水深1.5米，大部分岩石都露出水面0.4-1米，所有岩石均为花岗岩。层级内温度适宜，通常在15℃-26℃。天空中无法观测到任何类似太阳或月球以及其他星体的存在。岩石群的边界为圆形且半径为34公里，岩石群以外为一片郁葱的杉树林，林中的地面生长着许多蕨类植物。树林的边界暂未发现。
//
//实体
//Level C-45中存在水豚与棕熊两种生物。
//与前厅中的不同，水豚的体长能达到200厘米以上，肩高能达到100厘米以上，重量通常为140-420千克。它们的性情十分暴力，喜好破坏并食肉。它们经常以20至30个个体为一族群在层级中的岩石群中的水坑或树林的河流中游动捕猎。
//
//层级中的棕熊体长被缩到了70-80厘米，重量仅有60-200千克。习性也与前厅中不符，它们的食物大多为各种根茎、块茎、草料、谷物及果实等。因体型与习性变化，它们通常会被层级中的水豚捕食。
//
//%E6%A0%91%E6%9E%97
//Level C-45中的树林
//
//特性
//层级中不存在季节交替，但存在昼夜交替，一天的周期为30个小时，前十五个小时为白日，后十五个小时为黑夜。白天时，天空中虽不存在光源，但依旧向地面照射着阳光。动物在此时会开始觅食，温度约为20℃-25℃。
//
//夜晚时，所有动物都会休息，温度会降至17℃-23℃，天空为漆黑一片但从岩石间的水坑以及树林中河水的倒影中可以映射出月亮与星体的存在。
//
//基地、前哨和社区
//B.F.P.F.（后室家居生产厂）Eye Of The Stone 二号基地
//在岩石群的上方搭建了无数坚固的木质平台并生活在其上方。
//是B.F.P.F.的第二个主要基地。
//拥有充足的食物与杏仁水储备。
//大部分的B.F.P.F.队伍和成员驻扎于此。
//使用蓝砂及其衍生品制作武器对自己进行武装。
//拥有抵御动物侵袭的能力。
//愿意援助他人且欢迎其他流浪者在基地内住下。
//M.E.G.（探险者总署）Level C-45林间前哨站
//愿意提供食物和生存物资给除B.F.P.F.外的流浪者。
//不与B.F.P.F.进行贸易。
//在2020年起已被废除。
//豚鼠养殖联盟
//他们只有51人。
//不与任何流浪者进行贸易。
//来到层级只为捕捉并养殖水豚为其所用。
//靠驱使大型水豚对其他据点进行掠夺，B.F.P.F.的规模使他们放弃了对其攻击。
//会杀死其他流浪者。
//入口与出口
//入口
//进入Level C-27中的一个花岗岩洞口，会从Level C-45的岩石群中的水中醒来。
//走进Level C-8的农田中的一个花岗岩洞口，会从Level C-45的树林中的河边醒来。
//可通过Level C-71的交通枢纽进入层级中的树林。
//在Level C-20中攀登直到找到并进入一个花岗岩洞口，会从Level C-45的岩石群中的水中醒来。
//切入Level C-126车厢中的窗户会让你到达Level C-45。
//从Level C-85的入口返回，会到达Level C-45。
//出口
//进入Level C-45的树林中的一个洞穴可到达Level C-158的丛林。
//在Level C-45中朝任意方向行进100公里以上，会切入Level C-97。
//跳进层级内树林中的一个洞，可掉进Level А-2。
//有时在Level C-45的树林中可以找到一扇嵌树上的灰色木门，进入可到达Level C-67。
//跳入Level C-45中的一个合成器风格的洞口会掉到Level C-140中的大厦门口。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1045{}