//Level C-67
//评分: 
//+13
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//Level C-67是后室C层群的第67层。
//
//wBemip8fWAEvs5b.jpg
//寻常状态下的Level C-67
//
//描述
//环境
//Level C-67是一个巨大的且通道众多的空间，外观为标准的现代房屋楼道。楼道中各处贴有路标和标牌，看起来与前厅中的路标无异。Level C-67中所有标有“安全出口”“出口”“消防通道”等字样的路标，大概率都将通向层级的更深处。Level C-67中的Wi-Fi强度较好。楼道顶吊有很多照明用灯，使得Level C-67大部分区域都在光照下。Level C-67的空气中漂浮着一种不明物质，据多个流浪者描述，这种物质闻起来像皮革的味道。现已被证实对人体没有危害。
//
//level-c-67-2
//Level C-67中的楼梯间
//
//层级内存在中等数量的楼梯间，走上或走下楼梯均会进入其他层级。
//
//不建议沿着Level C-67中标有“电梯”的标牌行动，因为这可能会导致去往未知的层级。
//
//物资
//Level C-67物资丰富，在楼道的道路旁可能会出现各式的垃圾桶，这些垃圾桶会不定时刷新，里面有机会出现包括瓶装的杏仁水、瓶装的悲伤之水、火柴、可食用的饼干、一把蝴蝶刀等有用资源，请不要错过。
//
//实体
//Level C-67中实体数量较少，种类包括笑魇、骇笑者和无面灵且大部分都不会群体行动。
//
//已被证实层级中的墙壁中可能藏有间生。
//
//特性
//Level C-67中存在明显的类似昼夜交替的有规律的环境变化，表现为层级中的顶灯会在开启19小时后关闭5个小时，在关灯期间空气中漂浮的未知物质会明显增多，形成类似迷雾的环境，可见度大大降低。值得注意的是在熄灯期间Level C-67中的实体数量和攻击欲望并不会增加或减少。
//
//Level C-67中偶尔会出现标有“湖”的标牌，跟着标牌行动直到推开一扇绿色、红色或蓝色的带窗铁皮门会到达一个类似前厅停车场的空间，中央存在一个占地长70米宽50米的长方形杏仁水池，深度约为5米。顶灯开启的情况下停车场内实体无法进入，是绝对安全的，在熄灯后池中的液体会变为悲伤之水1。熄灯后停车场内不会出现迷雾，但悲伤之水会持续释放香气，且实体可以自由进出。已知停车场有多个入口，但都在Level C-67中相距很远的不同区域，流浪者或实体从进入的铁门原路返回会到从Level 0进入Level C-67的楼梯间内部，推测此处的线性空间发生了变化。
//
//基地、前哨和社区
//M.E.G.（探险者总署）C层群Alpha基地
//这是M.E.G.在C层群的第一个主要基地
//愿意为流浪者提供食物、杏仁水等生存物资和必需品
//可以有效对抗实体侵袭
//大部分C层群的团体和队伍居住于此
//红星建筑队第四支队
//他们试图在Level C-67建立社区。
//他们的总人数超过5000人。
//受不明势力雇佣。
//入口与出口
//入口
//该层级的M.E.G.指挥部与Level C-267的.M.E.G.指挥部由一扇紫钥门直接相连。
//在Level 0找到一个门上写着“通道”的门打开并走下楼梯会到达Level C-67。
//在Level 4找到一个顶部有“安全通道”标识的通道并进入。
//为数不多的情况下在Level C-13中会出现一个标有“消防通道”的防火门，进入后可到达Level C-67。
//进入Level C-8一间较为完整的房屋中的地下室入口并走下楼梯可到达Level C-67。
//Level C-26中铁门前方的地面上有着一扇上锁的木门，通过它即可到达Level C-67的一扇天窗。
//Level C-71中北边的红星矿区中的交通枢纽有通向Level C-67的入口。
//在Level C-45的树林中找到一扇嵌树上的灰色木门，进入可到达Level C-67。
//进入Level C-140街道上一个顶部标有“安全出口”的绿色标牌的防火门可进入Level C-67。
//踩着Level C-148的石块小心移动，直到发现一块金色石块；立于其上进行切出可以到达Level C-67。
//在Level C-86的地牢中切出会到达Level C-67。
//以上所有入口均无法原路返回。
//出口
//找到任意一个楼梯间并进入，有可能会到达Level 0、Level 1、Level 11或Level C-13。
//进入一扇有着黑白格子花纹的门到达Level C-143。
//找到并进入一扇标有“蘑菇汉堡俱乐部”的蓝色木门可到达Level C-27。
//找到一个绿色墙壁的通道进入并走上楼梯会到达Level C-8中一间破损房屋的地下室出口。
//在层级内找到一扇牌子上写有“知识的海洋”的门并进入可到达Level C-197。
//在Level C-67中找到一扇轮廓有着红色霓虹光带的门可到达Level C-140中“后室娱乐”大厦附近的街道。
//进入层级中一个大金属门到达Level C-85。
//跳入停车场中的水池底部的排水口会通往Level 420的湖中，不建议这样做。
//从楼梯间地面切入会直接到达电梯间门口，结果未知，不建议这样做。
//在层级中进行任何切出操作都会有2.3%的几率切入隐秘层级C-&。
//在层级内打开一扇藏式建筑风格的门即可进入Level C-160。
//作者信息
//« Level C-66 | Level C-67 | Level C-68 »
//
//Footnotes
//1. 已被收集或自带的杏仁水并不会发生变化。同样，自带或熄灯时收集的悲伤之水也不会在开灯后发生变化。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1067{}