//Level C-15
//评分: 
//+17
//+
//–
//X
// 
//
//生存难度：
//等级 2
//
// 
// 
// 
//sYzhtfSD.jpg
//于岛屿西侧拍摄的一张照片。因层级较暗，照片已经过高曝光处理。
//
//Level C-15是后室C层群的第15层。本层级是一座孤岛。
//
//描述：
//Level C-15的绝大区域都被海洋覆盖，而其天空的状态则类似于前厅的极夜。特殊的是，这里的“月光”略带紫色色调，且该“月亮”永远滞留于岛屿的正上方，不会移动。指南针可以在Level C-15中正常使用，这大大方便了测量工作的开展。M.E.G.将此层级与其子层级的可探索陆地大致划分为四片区域：孤岛区、平原区、森林区与峭壁区。主层级一般被认作是孤岛区。
//
//bCF5Pe.jpg
//该层级（包括其子层级）的一张手绘地图，发现于M.E.G.档案库。绘制者未知。地图的右下角有刻意的涂画痕迹。
//
//孤岛的面积约为五千平方米。岛屿地貌较为平整，且中央有一片湖泊，其中的成分已证实为杏仁水。湖泊周围生长着一种外观十分独特的荧光蘑菇。此类蘑菇大多散发黄色荧光、少数呈绿光。黄色荧光菇已被证实可安全食用，但绿色蘑菇分泌出的汁液疑似具有致幻效果。部分调查人员在食用后者后丧失了部分记忆且陷入十分狂热的情绪状态。食用黄色蘑菇可缓解这一症状，但无法弥补已经造成的记忆缺损。关于这一分泌液的后续研究还在进行之中。
//
//孤岛上的荒地普遍覆盖着暗紫色的草地，其上分布着一些低矮灌木，生长有深紫色的莓果（外观与蓝莓类似）。这一莓果常被用于制造紫色染料，且极难褪色。
//
//孤岛南处的一小块附属岛屿上有一残骸，外观上推测其为某种飞行交通工具。残骸上隐约可辨认出“S T ◼️ ◼️ F L ◼️ R E”的字迹。曾有流浪者在残骸的周边目击到脚印，但并没有任何图像资料能佐证这一点。
//
//实体：
//“月亮”
//岛屿天空中的“月亮”被认为具有生命。当人员凝视月光时，他将逐渐陷入一种极端消极的情绪状态。有调查人员声称自己在月亮当中看到了一张可怖的人脸。不仅如此，当长时间暴露于月光下时，流浪者的皮肤上还会出现不同程度的腐蚀痕迹，且流浪者的理智会加速流失。这一现象无法用已知理论解释。这类伤痕通常会在涂敷杏仁水、或是上文提及的黄色蘑菇分泌液后有所好转。此外，部分曾经陷入幻觉的流浪者声称听到了“月亮”的低声嘶吼。下面是一些由他们写下的片段。
//
//忧伤的人儿……你不要离开……
//
//那些往事……你们不该忘却……
//
//我曾……众生……而如今……
//
//不……请听我说…..
//
//真相……公之于众……你们……
//
//
//不建议任何流浪者在无保护措施的前提下在此层级久驻。
//船夫
//岛屿东边的海洋中存在着一种叫作“船夫”的奇特实体。它们形似海豚，却通体透明且散发着荧光。此类实体绝对友好，一部分甚至可以与人类进行简单交流。
//
//当流浪者对其表示出希望前往对岸的意愿后，“船夫”将以四五个聚为一群从而提供一种来源未知的向上力场。流浪者步入其中后，船夫会轻微调整它们之前的距离，直到力场大小与流浪者重力相一致，随即开始向对岸移动。
//
//当处在船夫的力场中时，流浪者不会受到逐尸鸟的锁定，也不会因“月光”而受伤。如果流浪者在此时向海中吐痰或投掷垃圾，船夫可能会显得气愤，并将流浪者掀翻至海中，随即散去。因此应尽量避免此类在前厅中被认定为是“不文明”的行为。如无异常情况，船夫最终会将流浪者送至Level C-15.1。
//
//基地、前哨和社区：
//由于“月光”存在的中等危害性，该层级没有基地、前哨和社区。
//
//入口和出口：
//入口
//当流浪者梦见一个淡紫色的月亮时，将有很大的概率进入本层级。
//在Level C-99中入睡有极小概率进入本层。
//当你坠入Level 9.1的一个深坑并陷入昏迷，你可能会在本层级苏醒。
//在Level 25中游玩一个叫作月的街机会使你进入本层级。
//出口
//经船夫的指引，流浪者能够到达Level C-15.1。
//严重陷入月光所带给你的负面影响并昏迷后，你可能会在Level C-17中苏醒，也可能直接死亡。
//在孤岛上的残骸处尝试切出，你可能会来到Level 40。
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1015{}