//Level C-21
//评分: 
//+49
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//pexels-photo-8358602.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=650&w=940
//Level C-21窗前的阳光
//
//Level C-21是后室C层群的第21层。
//
//这里只有你自己，不会有任何人打扰你。
//
//描述：
//Level C-21是一间约为三十二平方米的类似客厅的一个房间，内部摆放着一些实木家具，并且还有一间独立的卧室，其内部仅有一张三米长的双人床。值得一提的是，卧室里的窗帘总是挡住的，尽管你打开了窗帘，也会在你不经意的时候挡住窗户。
//
//客厅的桌子上一般会放着一张纸条，上面写着一句字体极其优美的话语：
//
//“希望这能对你有所帮助，这是我为数不多的祝福。”
//然后旁边会摆放着一杯热气腾腾的茶，下面同样压着一张纸条，上面写道：“接下来请安逸地享受您的下午茶吧~”
//
//室内会有一扇略微敞开的窗户，并且外面永远是大概下午两点左右的时间，阳光会洒满整个屋子，空气也始终保持着清澈。
//
//窗外仅能看到一片漂浮着几朵白云的天空，太阳偶尔会被漂浮的白云遮住，这会突然让屋里的人心情低落，不过并不会持续太长时间。
//
//屋内还有一个装满各种食物的冰箱，包括新鲜的水果，装在保鲜盒里的酸奶，和一些很精致的小蛋糕，冷冻里面则是一些已经冻起来的普通瓶装水和没有标签的大桶冰淇淋。
//
//pexels-photo-1255372.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=650&w=940
//Level C-21油画的照片
//
//在屋子里有一副放在墙角的油画，画作始终被阳光所笼罩着，并且在这种没有遮掩的情况下画作的表面并无干裂和褪色等情况。
//
//特殊的事件：
//
//Level C-21并不会永远是下午的场景，偶尔会是下着暴雨、没有晴天的场景。
//
//当Level C-21是暴雨的时候，会因为没有电源，导致屋内会显的非常的阴暗，即使你有手电等可以发光的物品，发出的光源也只能照亮不到一米的范围，具体原因未知。
//
//窗户依旧略微敞开，这会让一些雨水顺着狂风洒在屋内，并且窗户是锁死的，无法关上。平时在桌子上的纸条也不会出现，只会留下那杯茶，但是凉的。
//
//其他该有的食物和水源都会依旧存在，其中放在冷冻里被冰冻的瓶装水会化掉，口感会变得有些苦涩。除此之外冰箱里的食物至少能保证维持一个礼拜以上，不过目前为止并未发现谁能在Level C-21里待上四天以上。
//
//令人奇怪的是，卧室并不会收到天气的影响，依旧非常安静，并且雨声会变得很小，这会让在卧室的人更加的困倦。
//
//油画在窗外下着雨时会换成另一副画，由满是偏青的深灰色构成的一副关于暴雨的画作，可惜的是，没有人能把这副油画拍摄下来。
//
//pexels-photo-3888585.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=650&w=940
//暴雨前的乌云和被掩盖的阳光
//
//基地，前哨和社区
//“该层级不存在已知的基地、前哨和社区”
//
//附加内容
//有人在Level C-21发现了一本书，上面只有寥寥的几句话，下面是摘录。
//
//“我希望来这里的人都能度过一个美好的下午，并舒缓你紧张的神经，或许是因为这里是为数不多的，不会有可怕的怪物存在的地方。”
//当然，如果你来的时候正好下起了雨，那么很抱歉，你只能回到卧室舒服的睡上一觉，毕竟下雨的时候会有可怕的东西盯着你。
//别去碰那幅画，否则我只能请你出去。
//或许你不一定能看到这句话，但我还是要告诉你，这里也不是安全的，只是一个暂时能保证你不受到伤害的房间而已，请牢记这一点。
//如果我认为你已经感受到了安逸，那么我会让你离开这里，抱歉。
//入口和出口
//入口
//当你感到绝望的时候
//当你遭到背叛的时候
//出口
//当你感到安逸的时候
//在卧室里睡着后苏醒
package lvls10x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1021{}