//Level C-217
//评分: 
//+6
//+
//–
//X
// 
//
//生存难度：
// 
// 
// 
//Level C-217 是后室C层群的第217层。
//
//描述
//Level C-217表现为一间前厅中常见的民居。Level C-217中存在正常的昼夜循环，有Wi-Fi，密码为█​̴█​█​̴█​█​̴█​。层级内所有的物资1以及层级内发生的损坏均会在一个标准昼夜后重置。层级有窗户，经证实并非Entity 2。窗户不可打开，不可破坏。层级内同时仅可以存在6人，直到有人离开层级。层级中似乎有未知的隐形实体，并在Level C-217中正常生活并与层级中的物品交互。该实体似乎不会注意到探险者，因此不必对此类现象感到害怕。
//
//Level C-217主要分为主卧室、副卧室、客厅、餐厅、厨房、厕所六个空间，以下将逐条描述。
//
//C536BC23-01DF-4040-B6BB-173E5F23A5CA.jpeg
//Level C-217 里钢琴及屏风的照片。
//
//客厅
//客厅是Level C-217的一部分，面积约为20平方米，高约3.2米。客厅的中心有一张桌子桌面为木质，两端有梯形黑色的金属支撑，桌子长2米，宽1.5米，高0.7米。桌子下有三把木质椅子, 可安全使用。桌子旁有一真皮沙发，有一定磨损，有时沙发上会出现一些抱枕、靠垫等物品。沙发旁有一衣架，有时候上有衣物。沙发对面有一电视柜，其中有零食以及杏仁水，有时会出现一个装满针线的曲奇饼干盒。电视柜上有一花瓶，其中有四颗富贵竹。墙壁上有一电视，品牌未知，可观看前厅中的大部分影片。旁有一书柜，其中有大量书籍。房间北侧靠墙有一钢琴，平时用防水布料覆盖，可正常演奏。钢琴上有少许书籍，一些折纸作品，以及一幅两名未知幼童的照片。
//
//隐藏
//沙发上的玩偶会移动位置
//桌子上有时会多出一些试卷和书本
//电视会在每天的18：30左右自动播放影片，通常为电视剧《山海情》
//钢琴有时会自行演奏，此时若进入副卧室可以听见约10岁儿童的念谱声，有时会出现吵嘴声
//折纸作品有时会增加或减少
//3A19D12C-9AF5-47DD-9135-5C3D416F49E6.jpeg
//Level C-217 里餐厅及厨房的照片。
//
//
//
//
//餐厅及厨房
//餐厅正中有一木制桌子和6把木制椅子，房间东侧靠墙有一排高约0.7米的柜子，其中有食物、杏仁水以及其他物资。柜子旁有一冰箱，其中会出现冷饮和速冻食品，门上有大量冰箱贴。厨房中有大量炊具，可正常使用，柜子中有调料以及碗筷，西侧靠墙有另一冰箱，其中有肉食、鱼、水果、蔬菜等。
//
//隐藏
//每天约5：30——6：00在客厅可以听到做饭声，偶尔可以听到轻声的斥责声，而实际房间并无异常
//每天约6：00开始在客厅可以听到碗碟声，杯盏声，而实际房间并无异常
//
//
//
//厕所
//厕所位于客厅西北侧。其中，地板、墙壁，天花板均由白色瓷砖构成。此房间中有一马桶，一洗手台以及浴室，均可正常使用，尚未得知自来水来自何处以及污物前往了何处。洗手台上方的橱柜中有护肤品，口红，洗浴用品等，可正常使用。
//
//隐藏
//有时厕所会处于使用状态，此时房间门会被锁上并传来水声，尝试强行进入会导致辱骂
//厨柜内用品会增加或减少
//61433ABA-25DD-43BC-8499-B53AC8D5D8F6.jpeg
//Level C-217 中主卧室的照片。
//
//
//
//
//主卧室
//主卧室面积大约与客厅相等，位于客厅左侧，仅有一墙之隔。南面以及部分西面墙壁为窗户，窗外显现出一些树木以及其他楼房，尚未得知其是否真实。房间中有一张双人床铺，上有被褥、枕头以及一些毛绒玩具。床右侧有一白板，高1.8米，长2.0米，支撑高0.9米。床右侧有一衣架，下有抽屉，旁边有一樟木制成的箱子，其中有大量藏书，箱子上面盖了一层垫子。箱子左侧的大理石台面上有一打印机，可正常使用。
//
//位于主卧室的探险者会感到一种前所未有的放松，并回想起自己在前厅2中的回忆。探险者会不由自主地拿出箱子中的藏书开始坐在箱子上阅读，阅读时间由10分钟至2小时不等。当探险者从阅读状态中脱离出来时，有可能会感到困意，此时若坐/躺在床上，探险者会在5分钟内入睡并在第二天醒来。在醒来后，探险者精神状态会受到大幅度改善，且在未来的1天内都不会受到床的异常效应影响。该效果无法叠加。
//
//隐藏
//床上的被褥、枕头以及抱枕会自行移动
//衣架上的衣物会增加或减少
//藏书会增加或减少
//白板上有时会出现数学/物理的推导，也会出现儿童涂鸦
//
//
//
//副卧室
//副卧室的墙壁被刷成了绿色，有两张床铺，长约1.8米，宽约0.7米，上铺有席梦思床垫。右面的墙壁上粘有一张地图，经考据应该属于前厅中的书籍“神秘岛”中附赠的地图，并不属于任何一个前厅中的真实岛屿。房间的最左侧由一道窗帘隔断，有一张书桌，上有大量练习册与试卷。旁有两书橱，左侧书橱中有大量书籍，右侧书橱中有大量衣物，均无异常效应。书桌前有窗户，可以看见与主卧室类似的景象。
//
//隐藏
//书橱中的物品均有可能增加或减少
//床铺上的用品会自行移动
//基地、前哨与社区
//M.E.G.在此层级中没有常驻基地。
//入口与出口
//入口
//当你在Level C-20中进入一扇光滑的红木制成的门会来到Level C-217
//当你在Level C-48中在一间类似于儿童房的房间中登记入住，你会在醒来时来到Level C-217副卧室的其中一张床铺上
//出口
//走出位于餐厅右侧的正门，你会不可避免地睡着，并在一个安全的层级中醒来
//当你在钢琴上演奏1至2小时后，你可能会入睡并在Level C-125中醒来
//当你触摸副卧室中的地图时，有小概率被传送至Level C-49
//作者信息
//« Level C-216 | Level C-217 | Level C-218 »
//
//Footnotes
//1. 包括但不限于食物、纯净水、杏仁水、书籍等
//2. 如果有
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1217{}