//
//建立帐号 或 登入
//The Backrooms吧
//Backrooms Fandom Wiki
//The Backrooms中文wiki官方哔哩哔哩公众号
//Discord
//主页
//
//中文沙盒站
//
//图书馆
//
//层级
//|
//实体
//|
//物品
//|
//团体
//
//故事
//|
//相关人士
//|
//现象
//|
//设定
//
//搞笑文章
//|
//国际翻译中心
//
//原创图书馆
//
//原创层级
//|
//原创实体
//
//原创物品
//|
//原创故事
//
//原创团体
//|
//原创相关人士
//
//原创设定
//|
//原创搞笑文章
//
//原创艺术作品
//|
//原创现象
//
//网站
//
//最近创建的页面
//
//最近的更新
//|
//最近的编辑
//
//随机层级
//|
//随机原创层级
//
//随机实体
//|
//随机原创实体
//
//旧页面中心
//
//本月最高评分页面
//
//历史最高评分页面
//
//最低评分的页面
//
//社群
//
//讨论区
//
//翻译预定
//|
//最近的帖子
//
//作者页
//|
//中文网站作者页
//
//加入网站
//
//管理专用
//
//后台管理
//
//职员站点
//
//所有页面
//
//会员一览
//
//侧栏
//|
//顶栏
//|
//主题版式
//
//
//
//　
//
//Level C-236
//评分: 
//+11
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//Level C-236是后室C层群的第236层。
//
//描述
//Level C-236是一条长长的郊区道路。这一层有许多短的支线道路，可能通向中型房屋或其他层级，路边停着汽车。大多数支路都以死胡同结束，但是，在极少数情况下，一些支路的交通线可能与主干道相交。
//
//family-home-475879_960_720.jpg
//一栋Level C-236的房子。
//
//Level C-236的房屋似乎同时由木头和砖块组装而成。与红褐色砖块相比，房屋上的木头看起来是灰色的。房子的正面平均有5扇窗户。大多数建筑物只需打开门即可轻松进入。有些可能有没有任何锁的门。大多数房屋可能是空的，没有家具，没有冰箱或炉灶，并且可能有无法进入的房间或通向房间的门超过五扇。但是，在极少数情况下，房屋的每个房间都可以配备家具。这些可以显示人类居住的迹象。
//
//该层级有可能覆盖道路和房屋的灰色白桦树。叶子可以在光谱的每种颜色上有所不同。最常见的叶子颜色可以是绿色、橙色、红色、紫色，甚至是蓝色。流浪者将Level C-236的温度描述为大约 27-32 摄氏度。在Level C-236遇到实体的情况很少见，尽管有报告称猎犬和骇笑者会在 Level C-236的街道上漫游。
//
//基地、前哨与社区
//家具搬运社团
//该社团由11人组成
//该社团经常把家具搬运进空的房子。
//他们非常友好。
//入口与出口
//入口
//在Level C-235的地面上趴1小时。
//在Level C-116的地上找的一扇门，可以到Level C-236。
//在Level C-312找到一扇白门。
//出口
//进入一栋米色的房子，可以来到Level 0或Level 790。
//用头用力撞下一棵白桦树，有20%的概率到Level C-238。
//沿着公路向西奔跑1000米有19%几率切入Level C-215。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1236{}