//Level C-249
//评分: 
//+14
//+
//–
//X
//- 权限通过。欢迎，管理员/研究员。
//
//
//等级1
//
//
//安全性：受保护
//
//
//环境：不稳定
//
//
//实体数量：实体绝迹
//
//
//
//tsdm_0005_bl.png
// 
//tn.png
// 
//ls.png
//
//
//QQ图片20220623134328.jpg
//Level C-249 里的走廊中所摄下的照片。
//
//
//
//
//Level C-249是后室C层群的第249层。
//
//
//描述
//
//Level C-249的主体是一条约80米的走廊以及8间房间，其中，除了“资料室”之外的每个房间均有不同程度的重力错乱。此外，这些重力错乱现象似乎并非超自然现象，而是科技产物。目前已确认这些科技成果不属于任何一个已知的组织。M.E.G.现在已对此层级进行封锁以及保密以防引起争端并进行研究。
//
//以下是对Level C-249中的房间的描述。
//
//1号房间“资料室”
//此房间位于走廊的左侧，也是唯一 一个位于走廊左侧的房间。房间规模为6m*30m*30m，其中没有隔断。此房间现在被M.E.G.用作记录及储藏研究资料。
//
//2号房间“反向重力”
//此房间是位于走廊右侧的第一个房间。房间中拥有与走廊完全相反的重力，为铺设在房间顶部“反重力瓷砖”的效果。M.E.G.试图拆下其中一块，对应区域的反重力效果即刻失效。在重新安装后再次生效。M.E.G.试图将其拆解研究未果。目前正在试图使用X射线研究。
//
//3号房间“分裂引力”
//此房间是位于走廊右侧的第二个房间。房间中同样拥有大量“反重力瓷砖”。然而，所有的“反重力瓷砖”都被固定在不同角度的长竿上。这使得在房间中的物体会同时被多个引力拉扯。这导致房间有一定危险性。无重力宇航服对“反重力瓷砖”起作用。
//
//4号房间“无重力”
//此房间是位于走廊右侧的第三个房间。房间中没有重力，似乎是由埋藏于墙壁外侧的装置实现的。由于墙壁同层级内其他地方一样坚不可摧，研究停滞不前。现在此房间用于研究失重状态下细胞、细菌的生长以及物理现象。
//
//5号房间“切线运动”
//此房间是位于走廊右侧的第四个房间。房间的正中心有一明亮的白色圆球1，并且似乎有强烈的引力作用。有10个金属钛制成的空心圆球以不同角度的椭圆轨迹围绕白色圆球运动，然而并不会互相影响或碰撞，以近乎完美的切线持续运动。房间内为真空状态，以两道闸门与走廊分隔，因此金属球的运动不受空气阻力影响。两道闸门之间的舱室的左面墙壁上挂有3三件宇航服，可以让人类在房间内活动，但一般来说M.E.G.的研究人员会通过安装在房间内的监控以及其他设备进行研究。
//
//事故报告#249-05-01
//2017.10.23
//曹█​̴█​̴█​博士在穿戴宇航服进入5号房间后，在采集实验数据时意外被金属球撞到，并被卷入金属球的运动中。在金属球相切时，曹█​̴██​博士的腿部被金属球压迫并粉碎性骨折，这同时导致了宇航服的破裂。曹█​̴█​̴█​博士后来被成功救出，然而身负重伤。同时，房间内金属球的运行轨迹发生了大幅变化，多次互相碰撞。在M.E.G.进行紧急商讨后，设法取出了其中一个金属球。剩下的9个金属球重新回到正常轨迹。此后M.E.G.决定，如无必要，则不进入房间。
//
//6号房间“三体运动”
//此房间是位于走廊右侧的第五个房间。房间同样为真空并由两道闸门与走廊分隔开，舱室内部与5号房间的几乎一致，除了位于右侧舱壁上的显示屏。房间内有三个与5号房间类似的引力中心。这三个圆球以近乎混沌的方式运动，而舱室中的舱壁则在持续模拟其运行轨迹并根据其实际轨迹修正模拟。目前精准度已达到99.99875%，并且仍在上升。尚未得知此模拟的目的。
//
//7号房间“微观行星盘”
//此房间是位于走廊右侧的第六个房间。房间结构除没有金属球外与5号房间基本一致。
//
//事故报告#249-07-01
//2016.7.12
//丁█​̴█​博士在穿戴宇航服进入7号房间后，被不明物体击中头部，并在短暂时间内受到了高强度辐射。在抢救后丁█​̴█​博士脱离生命危险。经推测，房间内有一颗被引力中心束缚的粒子，以椭圆形轨迹在房间内运动，速度可能已经接近光速。
//
//8号房间“虚空黑洞”
//此房间是位于走廊右侧尽头的最后一个房间。一开始我们认为这只是无重力的漆黑虚空，然而，当我们的望远镜对准远处时，我们意外发现那里有一个巨大的黑洞。那个黑洞周围，有一个明亮的光环和一个同样明亮的星盘。我们与那个黑洞间没有任何遮挡，使得我们可以清晰的看见这壮观的美景。经过测量与计算，我们发现那个黑洞与我们距离大约5.743光年。此外，我们还观测到这个房间同样不是无限的，也有“墙壁”，距离我们约12光年。而且，经过观测与计算，我们发现越接近墙壁，空间扭曲的程度就越高，而墙壁本身的空间则十分平静，这与我们心向往之的家园十分相似。我们正在筹备用反重力装置建造一艘有星际航行能力的飞船来探索墙壁。这个计划可能会持续上千甚至上万年，在一代一代的人中延续这个目标，但我们不会停止。我们可能会失败，我们不知道墙壁后是家园，是虚无，亦或者只是无尽的黄色墙壁的循环。我们不会放弃，直到真相揭晓，或者——死亡。
//
//基地、前哨与社区
//M.E.G.“万有引力”基地
//此基地常年驻扎于Level C-249
//此基地专门研究层级内的科技
//入口与出口
//入口
//保密
//出口
//如果你想，“万有引力”基地的成员会指导你切出
//作者信息
//« Level C-248 | Level C-249 | Level C-250 »
//
//Footnotes
//1. 下称为引力中心
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1249{}