//Level C-244
//评分: 
//+9
//+
//–
//X
// 
//
//生存难度：
// 
// 
// 
//photo-1632827326368-a1980704e53e?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1026&q=80
//Level C-244。
//
//Level C-244是后室C层群的第244层。
//
//描述：
//Level C-244的主体为一条持续笼罩在黑夜之中的公路。Level C-244从未迎来白昼。
//
//该层级仅有的光源是排列在道路两侧的路灯以及可以遥遥望见的建筑灯光；路灯的相隔距离并不固定，呈现着忽密忽疏的特点。强烈建议不要试着离开公路范围而前往远方城区，因为当前记录在案的所有流浪者全在走入黑暗之后下落不明、生死未卜。
//
//Level C-244非常安静，近乎无声。除此之外，无论是肉眼观察还是设备录制，Level C-244的景象都模糊不清；该层级似乎还会对人们施加一种处于精神层面的影响，因为所有离开Level C-244的流浪者们都在事后报告称自己身处此层时的感觉仿佛“做梦”，同时出现了感官愚钝、记忆不稳、精神恍惚、行动迟缓等多种不可控的现象。
//
//流浪者们有几率在公路上遇见多样物件，包括而不限于倒在地上的单车、意义不明的路面涂鸦、垃圾堆、紧靠公路的稻草人、无人在内的破旧车辆等。
//
//离开该层级的唯一方式是等待公交车的出现。Level C-244内有着一辆没有车牌、外壳斑驳、车速极其缓慢、随机出现的公交车。流浪者们只需正常挥手示意，即可使其停泊并上车。公交车将在漫长的行驶之后抵达一座商场并就此停车，直至流浪者离开。
//
//photo-1632827326370-af72d4fa9691?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1yZWxhdGVkfDF8fHxlbnwwfHx8fA%3D%3D&auto=format&fit=crop&w=500&q=80
//商场内部。
//
//若不登车，流浪者将永远无法自然抵达商场。该商场孤零零地位于公路一旁，四周没有任何建筑；此外，商场的内部布局也颇显混乱，迷宫一般地毫无规律。
//
//值得注意的是，公交车上和商场之内都存在有一种人形实体，即公交车的“司机”与“乘客”1、商场里的“顾客”等；然而，所有流浪者都无法准确提供其外貌描述，因为“没有留意”、“不太敢看”、“光线昏暗”等等。不过，可以确认的是所有此类实体全都没有任何动作，即便是正在驾驶车辆的公交车“司机”。
//
//由于不确认它们是否具有危险性，故不建议与此类实体互动2。
//
//基地、前哨和社区
//该层级不存在已知的基地、前哨和社区。
//
//入口与出口：
//入口：
//独自走于夜路即有几率切入Level C-244。你将在意识忽地恍然片刻之后发觉自己已经进入该层级。
//更多入口尚待探查。
//出口：
//找到商场的后门即可原路返回3。
//更多出口尚待探查。
//作者信息
//« Level C-243 | Level C-244 | Level C-245 »
//
//Footnotes
//1. 但“乘客”数量极少；当前记录从未超过4名。
//2. 当前没有任意一份流浪者报告提及了与其互动的后果。不排除互动者已遭遇不测的可能。
//3. 已有流浪者尝试直接从商场外部绕往后门。但是他们要么同样失踪于无限延伸的黑暗、要么始终没有抵达建筑的背面并在放弃性的转身之后瞬间回到出发位置。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1244{}