//Level C-293
//评分: 
//+17
//+
//–
//X
// 
//
//生存难度：
//等级 4
//
//不安全
//稳定
//实体横行
//Level C-293是后室C层群的第293层。
//
//描述
//Level C-293表现为一片开阔的沙地，沙地表面呈波浪状。沙地上分布有一些石块、废弃物和已死亡的珊瑚，但这些原本应是黑白病态的珊瑚却被来历不明的颜料涂染成彩色。
//
//沙地表面的光照及能见度较低且周遭空气呈现出异样的深蓝色，空气颜色随高度升高而变浅，光照也随之增强。层级中温度约5摄氏度，不存在昼夜及季节更替，空中没有任何天体。层级内无法进行任何形式的燃烧。
//
//67d5447e924a962a.jpeg
//实体鱼钩
//
//Level C-293中大量分布有一种高危险性的实体，外观表现为体积大于常规情况的鱼钩与鱼线，密集地悬挂在层级的半空中。挂有鱼钩的鱼线完全垂直于地面且无法观测到鱼线的尽头，鱼钩距地面平均距离约1.2米。鱼钩上挂有杏仁水、罐装龙肉和皇家口粮等物资，但M.E.G.强烈建议流浪者不要冒险获取这些“诱饵般的物资”。所有鱼钩与鱼线均无法破坏。
//
//鱼钩具有极高危险性。当任何物体触碰到鱼钩并使其出现一定的晃动幅度时，鱼线将即刻带动鱼钩加速上升，最高速度可达约30公里每小时，此时无论物体处于鱼钩的任何部位都会被穿透在钩尖上并随鱼钩快速上升。此后物体将彻底消失在可观测的环境内，因此为保护自身安全，流浪者不应以任何方式触碰鱼钩。
//
//若被鱼钩拖离的物体属于非生物或植物，则数分钟后该物体将从高空缓慢落下，鱼钩也将返回原位；若物体属于生命体1，则几分钟后将有部分骨骸和物体上的附属品从高空落下，鱼钩将不会返回。值得一提的是，任何从高空返回的物体均无一例外的粘满含盐的杏仁水。
//
//流浪者可以通过爬行等方式来避免触碰鱼钩。若不幸被鱼钩拖离地面，并不意味着已经失去存活的可能，可通过脱去衣物等方式摆脱鱼钩。由于未知原因，物体从层级高空下落时会受到较大的空气阻力，因此自由落体速度较慢，不必担心摔伤的可能。
//
//基地、前哨与社区
//探险者总署（M.E.G.） - “锚地”Level C-293小型营地
//据点位于一处成年鲸鱼骨骸内，是人工挖掘的半地下空间
//常驻人员4人
//愿意为流浪者提供必要的生存物资和短期庇护
//友好但不开放贸易
//入口与出口
//入口
//在Level C-208的6号房间中找到一根鱼竿，并在离开庭院时携带这根鱼竿将进入Level C-293。
//在Level C-399中切入一块正在播放海洋生物保护的公益广告的屏幕，将切入Level C-293。
//在Level C-10中切入一块“禁止钓鱼”标志将切入Level C-293。
//出口
//切入成年鲸鱼骨骸将进入Level C-49。
//企图破坏涂有金色颜料的珊瑚将进入Level C-231。
//极少数情况下，拾起地面上一块黄色方形海绵和一只粉红色海星2将进入Level 94。
//作者信息
//« Level C-292 | Level C-293 | Level C-294 »
//
//Footnotes
//1. 植物与微生物除外
//2. 通常二者一并出现
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1293{}