//Level C-289
//评分: 
//+31
//+
//–
//X
// 
//
//生存难度：
//等级 变化
//
//变化的安全性
//不稳定
//变化的实体数量
//Level C-289是后室C层群的第289层。它整体上看是由全长约26.8公里的盘山公路以及周遭茂密的山林地形组成。
//
//描述
//qidian
//盘山公路的起点。
//
//Level C-289是在一片地形复杂多变的山林中延伸的盘山公路，山林与公路地基、护栏的造型与前厅中的盘山公路造型接近。公路的大部分路段为沥青铺筑，宽约3至5米，仅在公路的末段有一小段陡峭的石台阶。绝大部分路段两侧都有护栏或是路牙，这些被护栏保护的路段相对安全，并且栖于山林中的实体们会主动避开这些护栏1，但在盘山公路末段的沥青路与下山的石台阶均没有护栏保护，部分公路的地基还被山林的植物破坏，使得在这些路段相对更容易碰到实体，需要快速通过。
//
//chalu
//盘山公路中的一条岔路。
//
//Level C-289的山林面积十分广阔，目前仍未探索到除盘山公路起点与终点外的边界，并且由于山林中栖息着大量实体2，使得对于山林的探索极为危险。山林中的植物种类丰富，并且包含了一些未知种类的植物。盘山公路的路段中亦有数条通往山林深处的岔路，这些岔路均没有护栏保护，部分岔路通往山林中一些珍贵资源的储藏点3，但是不建议流浪者在没有充足的准备的情况下前往这些岔路。
//
//盘山公路的路况随着与公路起点的距离的延长而逐渐变差，部分路段会出现较大的起伏、路基不平，甚至是塌方的岩土彻底阻断道路的现象4。根据路况的变化盘山公路被分为了五个区域，靠前的区域在护栏的保护下相对安全，靠后的区域缺乏护栏保护，应当快速通过。
//
//区域一
//- 收起生存难度信息
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//quyu1.jpg
//盘山公路中的第一个区域，两侧有护栏和路牙保护。
//
//区域1是Level C-289中的盘山公路的第一个路段，该路段全程约8公里，两侧有着金属质的护栏与石制的路牙保护，因此实体极少接近公路。该路段保持一个不太陡峭的上坡路，并且全程无岔路，此外该路段路面情况在整段公路中最为安全、稳定，不会出现落石、塌方等现象，也不会有被山林植物破坏的情况，同时这段路也有较多该层级常驻人员搭建的临时小屋，这些小屋均对所有人开放，因此流浪者们可以在该路段适当休息，以确保在接下来有充足的体力快速通过危险路段。
//
//区域二
//- 收起生存难度信息
// 
//
//生存难度：
//等级 2
//
// 
// 
// 
//quyu2.jpg
//盘山公路的第二个区域，左侧的金属护栏被水泥柱代替。
//
//区域2是Level C-289中的盘山公路的第二个路段，该路段全程约9.8公里，相比于区域1，该路段左侧的金属护栏被水泥柱替代，虽然该水泥柱仍然有驱散实体的功效，但其保护效果要远远低于金属护栏，有相当多的报告指出部分实体会从水泥柱的间隙中进入道路，不过整体来看区域2中遭遇实体的可能性相对较小，流浪者仍可在此短暂休息。
//
//与区域1相同，区域2整体也是上坡路段，但是部分路段要比区域1陡峭很多，使得流浪者在穿行该区域时会消耗较多体力。在路牙的保护下，区域2也未曾出现过落石、塌方等现象。从区域2开始盘山公路两侧会出现岔路，这些岔路均无任何护栏或路牙保护，其路面多为石子路、沙土路等，大部分岔路通往一些珍贵的资源点，但是由于缺乏护栏的保护，岔路中极易遭遇山林中的实体，因此不建议在没有准备的情况下前往这些岔路。
//
//区域三
//- 收起生存难度信息
// 
//
//生存难度：
//等级 3
//
//不安全
//稳定
//中量实体quyu3.jpg
//盘山公路的第三个区域，道路两侧均没有护栏或路牙。
//
//区域3是Level C-289中的盘山公路的第三个路段，该路段全程约5.7公里，两侧均没有任何保护性护栏，使得山林中的实体可随意进入公路，因此应当快速穿越该路段并且准备好相应的应对措施。该区域大多为平稳路段，但由于缺乏路牙的保护，在遭遇暴雨过后时常被塌方的山体阻断，同时该路段遭遇落石的几率也大大增加5。
//
//在该区域同样可见较多岔路，但大多数岔路并没有被探索，据该层级的常驻人员称部分岔路会通向实体的巢穴甚至是陷阱，因此不建议流浪者探索该区域的岔路。
//
//在区域3也分布了较多可供流浪者休息的小屋，这些小屋都由掺杂了该层级护栏材质的建筑材料构成，流浪者在遭遇危险时可进入小屋避难。由于该路段与接下来的区域4的危险性，M.E.G.与B.N.T.G.在该路段的起点布置了一个小型的前哨站用于流浪者进行休息和补充资源，同时也提供公共的交通工具以便流浪者们快速通过接下来的危险区域。
//
//区域四
//- 收起生存难度信息
// 
//
//生存难度：
//等级 5
//
// 
// 
// 
//quyu4.jpg
//盘山公路的第四个区域，道路两侧被山林的植物侵袭。
//
//区域4是Level C-289中的盘山公路的第四个路段，该路段全程约2.2公里，相比于区域3，该路段的道路两侧的地基受到了山林中植物的不同程度的破坏，在到达该区域中段时地基受损程度达到最高，部分地段公路的宽度锐减至0.5米，流浪者需要在草丛与灌木中谨慎穿行。在该区域遭遇实体的可能性极高，并且部分实体会选择在道路两侧的植物中伏击流浪者，因此以徒步的方式通过该区域是极度危险的，建议流浪者们在此结伴而行或者等待公共交通工具。
//
//在该区域不常见落石与塌方的现象，可能是因为该路段已至接近山顶的部分。但有较多关于此地的报告显示该区域对于流浪者的精神存在一定影响，很多人声称在此处路段两侧可见大量的坟墓或者是不明的祭祀场地，亦有报告称在该区域徒步穿行时遭遇快速的昼夜交替，这些流浪者大都在该区域徒步行走超过半小时，在离开该区域后他们很快会遭遇剧烈的头疼、萎靡不振、恶心等现象，并且在这些生理现象结束后会遗忘穿行该区域的经历6。但据常在该地携带流浪者快速通过的志愿者司机反映，上述关于区域4的描述都是不属实的，因此推测该区域或许会对在此地停留过久的人的精神造成某种影响。鉴于该区域的精神危害，在该区域仅设立了一个供紧急避难的小屋。
//
//区域五
//- 收起生存难度信息
// 
//
//生存难度：
//等级 2
//
// 
// 
// 
//quyu5.jpg
//盘山公路的第五个区域，由石台阶组成。
//
//区域5是Level C-289中的盘山公路的第五个路段，该路段全程约1公里，在第四个区域遇到废弃的信号基站后可来到该区域。该区域为陡峭的下山石台阶，两侧无护栏或扶手保护，但在该区域的山林中实体数量较少，因此可以较为安全的通过。但该区域的石台阶道路经常被山体滑坡或者是塌方的泥土所掩埋，需要谨慎绕行，此外该区域的落石概率也远大于其他区域，需要做好相应的防护措施。
//
//部分流浪者反映在该区域视线较好处远眺可见山林深处似乎有着类似教堂的建筑存在，该报告已被证实，不过前往该区域的道路至今未探明。
//
//区域：岔路与山林
//- 收起生存难度信息
// 
//
//生存难度：
//等级 5
//
// 
// 
// 
//
//Level C-289中非盘山公路的区域都是极度危险的，并且对于这些区域的探索都十分局限，目前仅知在靠前的几个区域的岔路通往一些珍贵的资源点，但在穿行这些岔路时遭遇实体的几率极大，并且部分实体会伏击过路的流浪者，因此不建议流浪者独自探索这些岔路。
//同时这些岔路似乎也表现出类似于区域4中的精神损伤的危害，尤其是对于那些深入丛林探索的人来说，这也是导致对于该层级地形勘探失败的原因。
//
//昼夜交替与天气变化
//bianhua.jpg
//Level C-289中的光线变暗，预示着即将发生昼夜交替或者是天气转变。
//
//Level C-289中存在与前厅中类似的昼夜交替与天气变化现象。Level C-289在绝大多数时间保持着阳光明媚的天气情况，因此可以通过光照的变化来判断是否即将发生昼夜交替或者是天气变化。一般来说，黑夜或者是降雨持续的时间不会超过2小时。
//
//昼夜交替
//- 收起夜间生存难度信息
// 
//
//生存难度：
//等级 5
//
// 
// 
// 
//
//Level C-289中昼夜交替的现象时常发生，基本上经过约1-3天的白天后，Level C-289中的光线会开始变暗，并在半小时内进入黑夜。黑夜持续的时常一般在1至2小时，极少数情况下会持续8个小时以上。
//进入夜晚的Level C-289中任何区域都是极其危险的，因为山林中的实体们似乎会进入某种”活性化“的状态，它们会无视护栏与路牙进入公路内部游荡，并且表现出极强的攻击性，这使得在黑夜中穿行公路极其危险，M.E.G.建议流浪者们察觉到黑夜即将到来时应尽快进入小屋寻求庇护，点亮屋内的光源并准备好自己武器。
//
//同时，夜间的Level C-289会发生一些不明现象，包括一些异常的声音、屋内的光源突然熄灭、道路中间大量实体以某种规律的阵列朝同一方向行进等等。那些试图以携带式光源在夜间探索的流浪者大多在山林中失去踪迹，极少数活着回来的流浪者大都遭受了严重的精神损伤。
//
//- 收起访谈记录一
//记录一：一位在夜间穿行了区域4的商人的访谈
//M.E.G.采访-由巡逻人员进行简单的询问
//语音记录-2022年3月16日-上午10:34
//备注：该名商人在穿行区域4时首次遭遇黑夜，但他已经接近区域4的终点，于是他试图在天黑之前到达位于区域5的小型基地，最终却被例行巡逻的人员在废弃信号站发现失去了意识，身上有非常多刮蹭伤痕。
//
//商人被两名巡逻人员搀扶着进入小屋中坐下，在小屋中等待的队长有些惊讶，简单询问情况后便让两名队员先出去修整。
//
//队长：好了，先生你现在清醒了么？
//
//商人听到队长的声音后紧紧抓住了自己的衣角，并且四处观望，似乎在寻找什么东西。
//
//队长：先生？能听到我说话么？你需要什么东西么？
//
//商人：水，我需要水，很凉很凉的水！最好是杏仁水！
//
//商人忽然大声说话，引得屋外在整顿的巡逻人员全部过来围观。在接过队长送来的一瓶水后，他很快一饮而尽，随后开始大口喘气。
//
//队长：先生，现在感觉好一些了么？
//
//商人：啊，十分感谢，现在，我，稍微…感觉好一些了。
//
//队长：先生，你的名字是？你还记得起来么？
//
//商人：（沉默）…我是Owen，这个我还记得。我是来这交换一些资源的。
//
//队长：欧文先生，你为什么要徒步穿越区域4呢？
//
//Owen：我记得我好像是要回总部…我等不到车，我想着最近你们（M.E.G.）清理过一遍那里，所以，所以或许我能安全通过？
//
//队长：你在区域4行走了多久？
//
//Owen：行走？我，我不记得了，可能有半天？我感觉我在那度过了一整个夜晚？
//
//说到这个话题时他开始掩面，似乎这个话题让他很不舒服。
//
//队长：夜晚？夜晚已经是两天前的事情了！你一个人在区域4待了这么久！
//
//Owen：两天？我只记得最后我在不停不停的行走，我觉得信号塔好像很近，但是我却总也走不到那里。
//
//队长：你没有遭遇实体么？
//
//Owen：有，不过，它们不攻击我…我看到道路两侧有着成群的逐尸鸟，它们都停在墓碑上面，我不敢惊动它们…因此我走的很慢…再之后，我就想不起来了。
//
//队长：墓碑？你在区域4看到了墓碑？
//
//Owen：是，或者应该是？我从来不敢走近林子里面。
//
//提到“林子”，Owen止不住的颤抖。
//
//队长：可是你身上的伤，你还记得是怎么来的么？
//
//Owen：我，我不记得了，我记得，我误触到，踩到一根树枝，之后，之后！
//
//Owen一边说话一边大口喘气，队长拍了拍它的未受伤的手臂，示意他不要紧张。
//
//Owen：谢谢，我想起来，好像我惊动了逐尸鸟，它们全部飞起来，我一时惊慌，只知道全速奔跑，我看着信号塔的方向，但是不论我怎么跑，似乎只会离它越来越远，最后我精疲力尽，可能是那个时候，我跑进了林子里。
//
//队长：你现在还能活着已经是很幸运了，之前像你一样在黑夜探索的人没有一个能活着回来的。
//
//Owen：是，是嘛。我只觉得，我好像最后跑到了那里，我好像看到了教堂的门。就是你们之前说的那个。
//
//队长：你看到了教堂！那个地方真实存在么？
//
//Owen：是的，是的！那里，那里！
//
//Owen忽然开始干呕，并且几乎要窒息。他用尽力气说了一句话。
//
//Owen：那里，令人作呕。
//
//队长：快来人！他出现反应了！
//
//记录结束
//
//后记：该名商人在约两天后恢复，但也彻底丧失了关于夜晚的记忆，并且他的语言功能受损，难以与人正常的交流。
//
//- 收起访谈记录一
//- 收起访谈记录二
//记录二：区域3小屋中夜间异常情况的记录
//M.E.G.采访-由救援人员记录
//语音记录-2022年6月22日-下午9:39
//情况简介：两位流浪者在区域3结伴而行，他们在区域3遭遇了昼夜交替，于是前往最近的小屋避难，但在夜晚快要结束时 M.E.G.收到了他们的求救信号，于是 M.E.G.在黑夜结束后派遣救援队伍前往小屋。
//
//视频记录仪开启
//
//救援队员Jackson：队长，我们到了，视讯记录已开启。
//
//队长Harper：好，准备好武器，我们下车。
//
//队员们简单检视了一下自己的装备，随后一边警戒四周一边从小型运输车中走下来。
//
//救援队员Jackson：（小声）队长，小屋里面，你看。
//
//队长Harper：（手势）注意小屋，缓慢靠近，不要发出太大声音。
//
//队员们一边警戒四周，一边缓慢向小屋贴近。救援队员Jackson缓缓打开了小屋的门，确认情况后他示意队长没有危险。
//
//救援队员Jackson：队长，这里除了一名失去意识的不明人员别的什么也没有。
//
//队长Harper：只有一名么？我收到的情况是这里有两名被困人员，先喊醒她问问情况。
//
//救援队员Jackson：喂，女士，醒醒！
//
//在Jackson的摇晃下女性恢复了意识，一开始她很紧张的看向了窗外，发现外面已经是白天之后长舒了一口气。
//
//女性：感谢上帝，噩梦终于结束了！
//
//救援队员Jackson：女士，是你发送的求救信号么？
//
//女性：是的，是我！昨晚这里发生了很恐怖的事情！我不得以发送了求救信号。
//
//救援队员Jackson：女士，不着急，我们先去安全的地方再细说，另外，你的同伴呢？
//
//女性：我，我不知道，你说得对，我们应该先去安全的地方！
//
//队长Harper：Jackson，你送她去区域2的前哨站，我和队员在这里搜索。
//
//Jackson陪同女士回到了区域2的前哨站，将她转交给了后勤的心理疏导人员后便返回区域3参加搜索。
//
//后勤人员：女士，现在感觉好些了吗？
//
//女性：感谢，当我看到外面的阳光之后就好多了。
//
//后勤人员：女士，你还记得自己的名字么？
//
//女性：记得，我是…我是？我…我…
//
//女士用左右两手按住自己的太阳穴，想要自己回想起来，但这并没有奏效。
//
//后勤人员：女士你不用担心，出现短暂的失忆是正常的现象，大多数在这里遭受危险的人都有和你类似的经历，在短暂的休息之后记忆是会恢复的，不用紧张。
//
//女性：噢噢，这样，那就好，那就好。
//
//后勤人员：你是否还记得昨晚发生的事情了呢？这或许能为我们寻找你的同伴提供线索。
//
//女性：昨晚，昨晚出现了一些问题，一些我不能理解的情况。我感觉我说出来你肯定认为我疯了。
//
//后勤人员：女士，在这里遭遇这些非科学的现象是十分正常的，我每天都听着这些超自然的现象，你可以但说无妨，在这里是安全的，而且只有提供了讯息我们才有可能找到你的同伴呢。
//
//女性：好吧。（长叹一口气）昨天，我和我的朋友一起打算越过区域3，我们不是第一次来这里了，我们看到天气在变暗，于是我们就赶紧进入了一个小屋，你知道的，没人敢在夜间行走。
//
//后勤人员：请继续。
//
//女性：我们在小屋里过夜，一开始一切正常，我们知道夜晚外面会有很多诡异的事情，所以我们把窗户的帘子也拉上，避免外面的东西对我们有什么影响。我们都是按照你们建议做的。
//
//女士整理了一下自己的头发，思索了一会，开始继续讲述接下来的情况。
//
//女性：大约是一个半小时的时候，我们认为夜晚快要结束了，我和我的同伴正在休息，我们精神紧绷太久了。这时，我看到了，一个影子，只有影子。
//
//后勤人员：只有影子？
//
//女性：是的，我看到了，一个干枯的手臂的影子，我看着它从门缝中钻进小屋，贴着墙壁将他的手缓缓伸向吊灯。我和我的同伴都看到了这一切，我们试图阻止它，我们用杏仁水去泼那个影子，用扫帚去打那个影子，都无济于事。最后，那个影子到达了吊灯，他的手握拳，好像是要灭掉火焰一样，随后我们便失去了光源。
//
//后勤人员：天呐，于是后面你们便立刻发送了求救信号？
//
//女性：是的，我们在黑暗中试图重启光源，但是没有用，于是我只能选择向你们求救。
//
//后勤人员：接下来你们就在原地等待救援？
//
//女性：我们原本计划这样，但是失去了光源之后我感觉我们变得十分恐惧，并且我们听到了很多奇怪的声音，这让我们几乎无法忍受。
//
//后勤人员：奇怪的声音？你可以具体描述一下么？
//
//女性：我不好具体描述，但是我好像听到了乌鸦的叫声，还有令人发狂的虫鸣，但是这些我们都忍受了下来，直到，我们听见了一种类似铁链在地上拖行、摩擦的声音，那种声音令我和我的同伴极度不安，我只敢窝在角落，我的同伴最后因为忍受不了，她告诉我她要出去检查一下电闸能不能恢复供电。
//
//后勤人员：最后她成功了么？
//
//女性：她成功了，但是灯光亮起的那一刻，我看到…
//
//女士开始啜泣，但她很快稳定住自己的情绪。
//
//女性：抱歉，我看到，我看到我周围全部是那种影子，它们将我环环围住，随后，我想我应该是昏了过去，我没有接下来的记忆了，啊啊，我的头…
//
//后勤人员：你开始出现反应了，吃一些止疼片吧，这会让你好一些。
//
//记录结束
//
//后记：该名女性的头疼结束后遗忘了夜晚相关的记忆，并且表示自己开始失眠，即使入睡也总是梦到鬼影。她的同伴的尸体在小屋附近找到，尸体遭受严重破坏，通过遗物鉴别为女性的同伴，死因不明，脖颈依稀可辨认铁链的勒痕，似乎在生前遭受拖行。
//
//- 收起访谈记录二
//天气变化
//- 收起雨天生存难度信息
// 
//
//生存难度：
//等级 5e - 环境危害
//
//不安全
//不稳定
//辐射危害
//除了昼夜交替外，Level C-289也会出现天气变化的现象，但频率相对较低，大部分天气变化情况为持续约1至2小时的降雨，其前兆与昼夜交替一致。出现降雨时的Level C-289更容易出现山体滑坡与塌方等现象，并且落石的概率也大大增加，因此不建议在降雨时穿行该层级。同时，在降雨时实体的活动也大大减少，即使是区域4也少见实体，但有报告称悲尸似乎不受降雨的影响。
//同时，在对于雨水的样本成分分析显示，于2020/03后该层级的雨水开始出现放射性，但好在放射强度并没有出现进一步提高，目前还处于一种对人体无危害的范围内。M.E.G.已将在雨中的该层级的生存难度修正为"环境危害"，并且建议所有流浪者在没有防护措施的情况下不要在有降雨时探索该层级，长时间的淋雨仍可能是致命的7。
//
//基地、前哨与社区
//shaozhan.jpg
//盘山公路附近的一个简易哨站，由M.E.G.建造。
//
//Level C-289中存在着数量众多的前哨站、基地，它们隶属于多个组织，并且集中于区域1与区域2。
//
//M.E.G. “公路抢险队”团队
//该团队隶属于探险者总署（M.E.G.），由约七十人的团队组成，他们有着充足的山林探险装备与几辆大型的交通工具。他们主要负责盘山公路的清理、携带流浪者穿越危险的区域等任务。盘山公路两侧接近半数前哨与小屋由他们建造并进行维护，同时他们还负责对于山林地区的勘探，但这个任务由于极度危险而暂时被搁置了。
//
//B.N.T.G. C289号资源提取站
//B.N.T.G.在此地的多个资源点兴建了提取站，他们与M.E.G.在此地合作开采山林中的珍惜的资源，包括山中的矿产、泉水等。他们也在区域3的起点建立了一个大型的前哨站供流浪者休息、交易，同时也提供有偿的运输服务。
//
//E.P.B. 生化科技部与环境资源部联合实验室
//正电子后室有限公司（E.P.B.）在相对安全的区域1设立了这一联合实验室，其中大约有20名研究人员与7名后勤人员。他们在此地研究山林中的特殊植物并且尝试在山林中开垦一片实验田地。
//
//山林探险客
//山林探险客是由一群常驻于该层级的资深丛林探险家、猎人组成的团体，他们大约有40名成员，并且成功的在区域4建立了简易的前哨站供流浪者避难8。该团体的成员大多沉默寡言，并且拒绝透露有关山林之外的信息，但他们对流浪者还是十分友好的，时常与M.E.G.合作搜寻在山林里失踪的成员。目前仍不清楚该团体在山林中具体有多少个基地，并且与其合作过的M.E.G.成员透露该团体的成员似乎可以在山林中自由活动而不受实体的伤害。
//
//入口与出口
//入口
//在树林中遇到沥青路面会将你带到该层级。
//沿着 Level C-236的一个杂草丛生的道路一直前进会进入该层级。
//出口
//从盘山公路的终点离开，会让你来到 Level C-290。
//从盘山公路区域2的一条陡峭的上坡路行走约2公里可来到 Level C-100。
//从盘山公路的区域4的一条岔路可前往Level C-289.1。
//作者信息
//« Level C-288 | Level C-289 | Level C-290 »
//
//Footnotes
//1. 对护栏的成分分析表明其中存在数种未知物质，尚不清楚这些未知物质是否是造成实体避开护栏的原因，但将这些成分带离该层级便失去效果。
//2. 包括猎犬，雄性与雌性死亡飞蛾，爬菌，地栖怪，逐尸鸟等，该地区也曾有悲尸的目击报告，但其行为异于其它层级中的悲尸。
//3. 包括一处山泉，若干处金属矿脉，两处埋藏了食物的地窖，部分岔路据信还可通往该层的子区集，但并未得到证实。
//4. 仅在雨后出现，可等待本层级常驻的道路维护人员清理后再出发，尽量不要在山林中绕行。
//5. 可能与该区域土质松散有关，目前由于对山林的勘探十分困难而没有准确结论。
//6. 关于该区域的报告在流浪者出现生理反应前记录。
//7. M.E.G.仍在该层级中寻找放射性的源头，目前已知在公路附近未寻找到可疑的高放射污染，猜测污染源在山林深处，这为搜索带来了极大的困难。
//8. 仍不清楚该团体是如何做到在如此危险的区域建造前哨，但他们的这一努力受到很多流浪者的高度评价。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1289{}