//Level C-285
//评分: 
//+12
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//photo-1515511856280-7b23f68d2996?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1174&q=80
//拍摄到Level C-285一处地方的图像。
//
//Level C-285是后室C层群的第285层。
//
//描述
//Level C-285是完全处于室内环境的异常空间，其建筑构件与布局很像企业公司或医院，整个建筑的颜色都以白色为主要颜色，很少能在该层级中找到其他颜色，该层级内部几乎找不到窗户，即使能找到一些窗户，也只能从窗户上看到白色的场景，就好像是无穷无尽的白色虚空一样。
//
//由于很少能看到除白色以外的其他颜色，因此其亮度极高，对流浪者的视觉神经系统造成一定的损伤。可在其它层级获取到一些治疗性物品，例如治愈水晶、洁白眼药水1等。虽然本层级的实体数量极其稀少，但并不意味着该层级的安全度很好，曾有流浪者报告称，能看到敌意性实体在该层级徘徊，且徘徊时间各不相同。
//
//在一些较为罕见的情况下，你会走到一个阴暗的拐角处，这些角落亮度不会因其他地方的亮度而提升其亮度，观察报告显示，即使使用高强度的手电筒照进角落内部，然而依旧无法看清其内部环境，目前推测这些角落很可能会生成极少量的敌意实体，不建议流浪者待在这些角落附近。
//
//实体
//该层级的实体数量极其稀少，然而却都是敌意性实体，在尽可能找到更多出口前，流浪者在此层级逗留时间越久所遇到的实体就会越多，在此层级所生成的实体主要为笑魇和钝人，目前还没有在该层级发现其他层级或没有记录在案的未知实体。
//
//white-core-logo.png
//白色核心集团标识
//
//基地、前哨和社区
//白色核心集团
//关于组织的记录最早出现于1994年至1998年间。
//组织目前已在该层级中建立主要基地。
//根据调查结果显示，该组织曾是前厅中的一个商业巨头公司。
//该组织正在其他层级中建立前哨站。
//不建议流浪者们靠近该组织的前哨。
//photo-1452201200613-08b99de5b0b8?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1173&q=80
//Level C-285的一处角落。
//
//入口与出口
//入口
//在Level 255中尝试找到白色区域，尽管该方法未被记录在Level 255的记录文档中，然而在Level 255逗留的流浪者坚称仍能在其里面找白色区域，并在该区域逗留一段时间，就会被传送至该层级当中。
//在Level 321中找到白色油漆，并泼向非白色的墙壁，然后尝试直接切入，就可达到该层级中。
//从Level C-114里的手术室中尝试切入墙壁，就会抵达该层级，但注意该方法较为危险，在切入之前请考虑清楚。
//出口
//可以尝试走进一些阴暗的角落里，将有一定的几率到达Level C-360中的一处角落中。
//更多出口仍在调查确认中。
//作者信息
//Footnotes
//1. 该物品已被证实由白色核心集团所开发出的异常物品，推测其特性能直接降低流浪者对外来分辨事物颜色的能力，尽管还没有被记录在案，但一些流浪者声称已经使用过该物品。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1285{}