//Level C-250
//评分: 
//+18
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
//安全
//稳定
//中等量无害实体building01c.jpg
//Level C-250居民楼内部。
//
//Level C-250是后室C层群的第250层。
//
//描述
//Level C-250是由一片茂密的树林包围着一处中国上世纪老式居民小区组成，小区其中有许多废弃的混凝土楼房和老化的建筑结构。目前，后室娱乐组织已经将其进行改造，将其变为该组织的一处分基地。
//
//在Level C-250内，昼夜变化不定，最长的白天和黑夜分别持续了133小时和397小时，最短的则是23分钟和2小时。白天气温10~30℃且经常伴有4级以上的大风和密闭的乌云，夜晚气温反而比白天更高，达到了18~37摄氏度，但气象大多为多云或晴天。
//
//后室娱乐组织在此层级夜晚时，会不间断的在居民楼内举行各种派对活动。小区外部会布满各种紫红色的霓虹光灯和海报，吸引前来参加派对的流浪者加入他们的组织。本层级并无原生实体，目前所居住的实体均为后室娱乐组织带到本层级的工作人员。其中包括笑魇、无面灵、猎犬、死亡飞蛾、骇笑者，这些实体都会戴着霓虹眼镜，在流浪者的必经之路上帮助他们来到主会场。
//
//当流浪者进入会场内部时，会有专门的工作人员扫描来宾佩戴的霓虹眼镜的序列号，若来宾未佩戴或序列号无效，则会被拒绝进入会场。若执意进入，则会有娱乐清扫者驱逐流浪者离开本层级。因此截至目前，M.E.G.暂未获取到关于Level C-250的更多信息。
//
//调查人员走访了Level C-250周边的树林，在其中发现了许多散发着霓虹紫色的类植物实体，并将其收集带回实验室进行研究，目前，该研究工作仍在进行当中。
//
//基地、前哨与社区
//“后室娱乐”第三分基地
//位于小区内的一座较大的建筑物内部。
//居住的大约300人，均为后室娱乐员工。部分为后室娱乐实体。
//似乎只接受来自后室娱乐人员的拜访和交易。普通流浪者会被推销进入Level C-70并成为“后室娱乐”组织的一员。
//入口与出口
//入口
//在Level C-71内的丛林中有时会发现一扇发着红色光的门，进入则会到达Level C-250。
//在Level C-126内的第250号车厢内停留超过1小时即可被传送至Level C-250。
//出口
//在Level C-250小区后门的一口水井内向下攀爬即可进入Level C-40。
//推测有一条直通Level C-70的通道，但目前并无更多信息。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1250{}