//Level C-235
//评分: 
//+5
//+
//–
//X
// 
//
//生存难度：
//等级 变化
//
//安全等级变化
//稳定性变化
//实体数量变化
//Level C-235是后室C层群的第235层。
//
//描述
//Level C-235是一个大型空岛，其面积经粗略计算大约在16500平方米左右，根据实体分布量和地面材质分为四个区域。
//
//Level C-235中有很多各种损坏程度、年代，品牌及型号的车辆，路灯和用不同材质制成的停车位。
//
//Level C-235中的所有车辆的车门都可以打开门并且驾驶，以生锈的汽油为燃料，油量通常为满。车辆中可以找到幸运豆奶和油腻棉花糖，有概率在区域2、3、4找到装有物资和生活用品的货车。所有的车牌照都为中国牌照，大部分车辆的牌照均为随机，少部分车辆牌照号为LV-XXX，可以驾驶此类车辆离开Level C-235。
//
//Level C-235中个停车位都有相应序号，最大的序号为8000，每个停车区域以10个停车位为一组，每组间隔5米，每组停车位设有两个路灯，当时间为下午7点时路灯点亮,电力来源不详。
//
//停滞效应
//Level C-235里面的流浪者一进入Level C-235就会有一个叫停滞的效应，指流浪者从刚进入Level C-235就会停止发育，例如：21岁的流浪者十年后还是21岁，不会因时间而改变。原驻民就是很好的列子之一。
//
//区域
//Level C-235中有四个区域。
//由于Level C-235各区域间的主要差异，区域的生存难度, 基地，前哨与社区列表均有不同，关于不同区域的更多信息见下文。
//目前在Level C-235有四个已知的区域，命名如下：
//
//区域1：停车位6000~8000(植物园)
//区域2：停车位4000~7999(都市停车场)
//区域3：停车位1000~3999(工地区)
//区域4：停车位1~999(岩石圈)
//区域1：停车位6000~8000(植物园)
//- 点我隐藏
// 
//
//生存难度：
// 
// 
// 
//描述
//这里是Level C-235的第一个区域。
//
//该区域拥有一个完整的生态系统，以下简称植物园。
//
//IMG_20171006_082420.jpg
//一张区域1的照片
//
//植物园是Level C-235的中心区域，是最安全的地方，也是流浪者在Level C-235的主要活动区域。
//
//植物园里面车辆很少，大多被植物和原驻民破坏，物资短缺，实体友善，很安全。
//
//植物园为一个热带雨林样式的区域，有正常的时间交替(24小时制)，天气通常为晴天，阳光强烈，温度在35~40度左右，记得补充水分，防止中暑。
//
//植物园中的地面由土壤组成，无毒，可以种植植物，土壤中有大量瓷制壁画的碎片和雕像碎块，壁画主题是关于一种圆形触手实体。
//
//植物园里面有大量叫汽油树的植物和各种苔藓植物，汽油树生产汽油果(更多关于汽油树和汽油果内容请见实体篇目)，停车位由木头和石头制成，大部分因植被生长导致被破坏，停车位上寄生着一种叫黑白交流蛇的实体，被驯化前中立，驯化后友善，可以告诉流浪者车位号码。
//
//植物园里面有大量砖制建筑物，其建造时间可以追溯到800年前，目前被原驻民所居住。
//
//植物园里面有大量17世纪时期来到这里的流浪者，他们称自己为原驻民，多为白种人，所说语言大致为英语。
//
//实体
//原驻民
//原驻民是一群17世纪时期来到Level C-235的流浪者，智商经测试高于普通流浪者，对流浪者友善。
//根据DNA检验得知大部分原驻民为白种人，部分原驻民有印第安人血统，所说语言大多为英语。
//原驻民的科技程度经300多年的发展有二战时期的科技程度。
//据了解大部分原驻民来到Level C-235之前在捕杀印第安人，后同印第安人一同切入后室，后来到Level C-235，定居于此。
//据了解他们曾发动过一场攻击，攻击过一种圆形触手实体，战利品是一条触手，存放在号码为7086的停车位。
//原驻民希望和后来的流浪者一起攻击Level C-235的背面，希望整个Level C-235可以成为人类的新的栖息地。
//收费员
//收费员是一群骷髅，身穿制服，友善实体，无法死亡，在植物园中身穿破旧制服，被植物覆盖，从土地中爬出。
//当流浪者把物资或车辆停在任何一个停车位2小时后就会出现，并要求收费，一般情况下会要求要2瓶500毫升的杏仁水，如果不交则会让你的物资或车辆陷入土地并消失。
//你可以交2瓶一升的杏仁水买下一个停车位，当你买下一个停车位后收费员不会再找你，并且你会获得一条被驯服的黑白交流蛇，它可以带你回到你的停车位。
//黑白交流蛇
//黑白交流蛇是一条类似于前厅的蛇的蛇形实体，身上覆盖正面为黑色，反面为白色的鳞片，可以用鳞片交流数字，符号和简单字母，牙齿有毒。
//在未被驯化前为中立实体，寄生在停车位上。
//驯化后为友善实体，可以跟从主人(流浪者)，并通过鳞片或蛇声告诉主人周围有危险，可以用3个汽油果驯服或购买停车位得到。
//汽油树
//汽油树是一种植物实体，外形类似于竹子，喜湿润和光照，生产汽油果，在6月结果，当结果时长出类似于蒲公英的组织，成熟后随风飘落，在地面生长。(叶子有毒)
//汽油果
//汽油果是一种果实由汽油树生产，外观类似于柠檬，青色，在未经加工前有毒，汁水可以当做燃料，在经过水煮后可以食用，味道为青柠的味道。
//可用于驯服黑白交流蛇。
//基地、前哨和社区
//驻留
//驻留是原驻民的栖息地，房屋是区域1的砖制建筑，其规模有120人左右。
//IMG_20190828_115554.jpg
//一张驻留的照片
//
//驻留每年5月会派出20人离开Level C-235寻找出口。
//驻留现负责修复和研究那些瓷制壁画，现已修复完成20幅壁画。
//植物研究所
//植物研究所是由在Level C-235中的5个植系研究生流浪者所搭建。
//没有固定的基地地点。
//励志把前厅的植物在Level C-235中成功种植，现已成功把水稻和小麦在Level C-235在种植。
//附录
//触手的研究整理
//前言：该内容为对一条大约300年前的触手的研究报告。
//
//物品：触手
//描述：一条半透明黄色触手，长46㎝、宽10㎝，处在一种能量体和实体之间的状态，根据原驻民的交流得知该触手是300年前原驻民们发动攻击攻击得到的，攻击对象是那些破损壁画上的那个圆形触手实体，未杀死，仅砍下一条触手，圆形触手实体在经历过此次攻击后消失。
//
//区域2：停车位4000~7999(都市停车场)
//- 点我隐藏
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//描述
//这里是Level C-235的第二个区域。
//
//该区域是各组织的主要活动区域，以下简称都市停车场。
//
//都市停车场为一个现代停车场，地面由沥青制成，停车位由水泥制成，上面有液晶显示屏用于显示车位号，电力来源不详。
//
//都市停车场每200米有一个收费亭，里面有实体收费员。
//
//都市停车场里面有很多车辆，成色较新，生成大量牌照为LV-XXX的车辆和装半满物资的货车，少量有害实体，相对安全，很适合在这里寻找物资。
//
//都市停车场有正常的时间交替，天气在晴天和雨天之间变化，阳光程度中等，温度在25度左右。
//
//实体
//收费员
//收费员在都市停车场中身穿崭新制服，是中立实体，其他与植物园中一样，通常情况下在收费亭里待着。
//当流浪者把物资放在停车位上2小时后，不交费，则会让物资自燃。
//司机
//司机已确认友好，性别、肤色、身高、体型、着装、驾驶的车辆和牌照完全随机。
//司机平常会驾驶车辆随机出现在Level C-235中的都市停车场。
//司机看到你会向你驶来并询问你是否知道出口位置，如果你回答不知道，他会笑着离开，如果随便指个方向，他们会向你指的方向离开，如果你要求搭便车，他可以让你免费搭便车以此离开Level C-235，如果你要求要物资，他们会给你杏仁水。如果你攻击他们他们会求饶，如果你攻击车辆，他们会把车上所有物资给你并求饶，如果你还不放过他们，他们会立即驾驶车把你撞开并离开。
//基地、前哨和社区
//汽车旅馆
//汽车旅馆是由在Level C-235中的10个流浪者所搭建的基地。
//地点在车位号6980~8000处，由废弃汽车改装而成，提供住宿，食物和离开Level C-235的方法。
//汽车处理厂
//汽车处理厂位置在停车位6600~6650。
//为一个有20人的社区，负责寻找离开Level C-235的车辆，改装和拆解车辆提供给汽车旅馆和车队，并且破坏去往危险楼层的车辆，通常手法为火烧和拆解。
//加油站
//加油站位置在停车位6480~6490。
//为一个有15人的基地。
//负责收集汽油果和汽车电池，提供给汽车旅馆和车队，并研制高能燃料，提供给战车队。
//车队
//车队的总部在停车位4040~4080。
//为一个有50人的移动社区。
//负责在外寻找流浪者和食物，并且保护流浪者把他们带到汽车旅馆。
//区域3：停车位1000~3999(工地区)
//- 点我隐藏
// 
//
//生存难度：
//等级 1
//
// 
//较为不稳定
// 
//描述
//这里是Level C-235的第三个区域。
//
//该区域是一个正在施工的停车场，以下简称工地区。
//
//工地区的地面和停车位由水泥制成，上面有用油漆喷涂的停车位号码，地面会无故发生裂缝，注意脚下安全。
//
//工地区中有大量从路灯内喷出的粉尘，吸入过量有可能会致癌，请佩戴好口罩。(下雨天无粉尘)
//
//工地区里面工程车辆较多，车辆上有大量灰尘。
//
//工地区的时间定格在了下午两点左右，天气在中雨和晴天之间切换，温度在15度左右。
//
//实体
//收费员
//收费员在工地重区中除了身穿制服还会披一件反光背心，在工地重区中友善，其他与植物园中一样。
//当流浪者把物资放在停车位上2小时后，不交费，会呼叫建筑大队把物资拖走。
//建筑工
//友善实体，乐于帮助流浪者，对部分收费员抱有敌意。
//建筑工长相类似于人类，有各种方面的工人，负责修理损毁的路面。
//可以被召集，花费5瓶500毫升的杏仁水可以召集1个建筑工1个月。
//当它们看见你时，它们会要求你离开工地区(除非身穿反光背心、安全帽和口罩)，并口中说着：
//工地重区，闲人免进
//
//建筑大队
//友善实体群
//建筑大队一般由10个建筑工外加2台工程车组成，负责修理大型裂缝和拖走你的物资。
//可以群体攻击敌对实体，保护流浪者和护送流浪者离开工地区。。
//基地、前哨和社区
//无
//区域4：停车位1~999(岩石圈)
//- 点我隐藏
// 
//
//生存难度：
//等级 2
//
// 
// 
// 
//描述
//这里是Level C-235的第四个区域。
//
//该区域有大量石头资源，以下简称岩石圈。
//
//岩石圈为一个由石头构成的停车场，地面和停车位由硬度高达8的黑色岩石制成，上面有用黑曜石制成的停车位号，地面有大量裂缝和峡谷(由实体触物造成，区域3的裂缝可能因为余震造成)，注意脚下安全。
//
//岩石圈里面没有车辆。
//
//岩石圈里有大量由地面制成的破损雕像，样式大多为Level C-235的实体雕像和部分类似于人的雕像。
//
//岩石圈的天是黑的，但可见度高达下午2点的晴天，并且没有时间交替，没有任何天气，温度为准确的15度。
//
//岩石圈的边境是Level C-235的边境，这里有停车场的入口和出口，周围有铁丝网围着，铁丝网外面是类似于天空的地方，天是黑的，下面是蓝天和白云。
//
//岩石圈的石头每经一段时间就会开始互相融合复原并产生新的石头。
//
//实体
//收费员
//收费员在岩石圈中骨头为黑色，身穿黑色制服，在岩石圈中友善，从裂缝和峡谷中爬出，其他与植物园中一样。
//当流浪者把物资放在停车位上2小时后，不交费，会召唤出触物把物资从地表拉入地下。
//灵球
//一种能量态实体，外表有一层黄色半透明的护膜，里面是一种粉红色的肉球。
//该实体是流浪者被区域4的石头或者是由区域4的石头所制成的石制武器所击杀后从身体上飘出来的，类似于“灵魂”，当流浪者死亡后，灵球飘出后，死者尸体肌肉收缩，脱水，显风干状态。
//当流浪者把手伸入粉色肉球内部，就会在短时间内经历死者的一生，时间在2分钟左右。(强烈不建议这样做，经实验证明，该操作会使流浪者产生人格分裂)
//把灵球放在由区域4的石头所制成的雕像上可以复活死者，但如果不是放在建筑工制成的雕像，仅能做到四肢移动，无法说话，没有视觉，没有听力，类似于一句傀儡，仅有放在建筑工所制成的雕像可以做到真正的血肉复活。
//触物
//外貌类似于章鱼的实体，有数条触手，头部为圆形，生活在Level C-235的地下，一般情况下不会离开地下，会制造裂缝或峡谷。
//触物分为两种状态。
//第一种状态为肤色为绿色的平常状态，该状态下为友善实体，仅会在需要进食时把触手伸出来把装满物资的无人车辆拿走，会帮助流浪者解围。
//第二种状态就是受惊后肤色为白色和红色的惊吓状态，该状态下的触物请勿靠近，为敌对实体，当肤色为白色时会到处乱跑，但会注意到流浪者，尽量躲避，当肤色转换为红色时，就会进行无差别攻击，大约在2小时后会回归正常，让触物受惊原因主要为触摸触手和发出尖锐声音，加速回到正常状态办法有释放黑白交流蛇让交流蛇解决和喂食汽油果。
//(触物的外观描述来自于Level C-235的背面的区域4的考察)
//
//石头
//注：该实体仍有疑义，仅供参考
//石头大量生存于区域4：岩石圈，区域4：岩石圈的地面就是这些实体组成的。
//石头体现出一种简单智慧形态，可以互相结合形成新的石头，并且可以和灵球结合成生命体。
//已确认含有大量有毒物质。
//基地、前哨和社区
//无
//入口与出口
//入口
//在Level C-234中显大出血状态下10分钟后可以来到这里。
//在Level 11,取一块长方形铁皮，上面用白色马克笔或喷漆写上LV-235，装在任何机动车的牌照处，驾驶，可以来到Level C-235。
//出口
//驾驶牌照为LV-XXX的车辆，可以去往相应的层级。
//- 隐藏
//在区域1找到一台牌照为LV-011的城市SUV，发动引擎，以每小时80英里的速度驾驶20分钟，可以来到Level 11
//在区域2找到一台牌照为LV-022的破旧的工程车，成功发动引擎，瞬间可以去往Level 22
//找到一台牌照为LV-048印有夏威夷树，主色调为日落黄的假日旅行车，发动引擎，可以去往Level 48
//搭司机的便车去往一个随机的安全楼层。
//从出口离开Level C-235，到达Level 100。
//从入口离开Level C-235，到达Level 568。
//剪开铁丝网，跳入蓝天，来到Level 998。
//注：以下区域掌握信息有限，仅供参考，在没有足够的把握，请不要轻易去往以下区域。
//Level C-235的背面
// 
//
//生存难度：
//等级 变化
//
//安全等级变化
//稳定性变化
//实体数量变化
//描述
//Level C-235的背面是Level C-235的反面，重力颠倒，有网络，没有时间交替，天气一直保持下午2点的晴天，温度在15度左右。(如有不详请见示意图)
//
//IMG_20220719_152234.jpg
//示意图
//
//Level C-235的背面是一个露天的雕像流水线，所有在Level C-235中被收费员销毁的物资都会来到这里，Level C-235的背面同Level C-235一样有四个区域。
//
//Level C-235的背面有大量实体，负责各种工作，例如生产雕像，搬运石头。
//
//因为由于Level C-235的背面仍有大量不确定因素，所以未设站点在此。
//
//区域
//Level C-235的背面中有四个区域。
//由于Level C-235的背面各区域间的主要差异，区域的生存难度, 基地，前哨与社区列表均有不同，关于不同区域的更多信息见下文。
//目前在Level C-235的背面有四个已知的区域，命名如下：
//
//区域4：采石场
//区域3：打磨场
//区域2：陈列区
//区域1：高塔
//因为所的掌握资料文献有限，所以已进行压缩处理。
//
//区域4：采石场
//
//生存难度：
//等级 0
//
// 
// 
//实体友善
//描述
//区域4：采石场是区域4的背面。
//
//区域4：采石场有很多岩石山，岩石和区域4的岩石一样。
//
//区域4：采石场有大量触物采集岩石，触物把岩石敲下来，把岩石放在司机车上。
//
//如果触物看见你，它会把你抓住，制造裂缝，把你送回Level C-235的正面。
//
//实体
//触物和司机
//在此不过多解释。
//
//区域3：打磨区
//
//生存难度：
//等级 1
//
// 
// 
// 
//描述
//区域3：打磨区是区域3的背面。
//
//区域3：打磨区有很多建筑工在这里雕刻石像，从而产生大量致命粉尘，粉尘会通过路灯排往区域3，雕刻成功的石像在经过收费员的检查后会运往区域2：陈列区和区域1：高塔，雕刻失败的石像会被司机运往区域4，而雕刻出失败石像的建筑工会被流放到区域3。
//
//建筑工雕刻的雕像大多为骷髅并配带着武器，其中部分外貌是一些着装为中世纪的人类，少部分为Level C-235的各种实体。他们打磨的雕像可以以假乱真，也只有他们的雕像可以让灵球实现血肉复活。
//
//建筑工看到你时会竭力让你离开，部分会护送你离开。
//
//实体
//建筑工
//在此不过多解释。
//
//区域2：陈列区
//
//
//生存难度：
//等级 2
//
// 
// 
// 
//描述
//区域2：陈列区是区域2的背面。
//
//区域2：陈列区这里摆放着所有雕刻成功的雕像，经粗略计算大概有2000座雕像摆放在这里。收费员在这里看守并保养着这些雕像
//
//雕像样式大多为手持冷兵器的人类和骷髅，部分手持热武器，热武器极度粗糙，并仅Level C-235的实体操作，部分为身穿中世纪服装的人类，剩余为Level C-235的实体。
//
//当收费员看到你时会把你抓住带到收费中枢进行审讯然后杀死。
//
//实体
//收费员
//在此不过多解释。
//
//区域1：高塔
//
//
//生存难度：
//等级 3
//
// 
// 
// 
//描述
//区域1：高塔是区域1的背面。
//
//IMG_20220719_152246.jpg
//高塔
//
//整个区域1：高塔是一座高达2千米被植物覆盖的塔，上面有用蓝色染料涂的壁画，壁画大多内容都以一个圆形触手实体为主，内容有圆形触手释放一种圆形物体在石像上、石像复活，圆形触手实体消失等。(推测圆形物体是灵球)
//
//高塔周围有大量500年前制造的雕像和被拖走的物资用于祭献。那些500年前制造的雕像外貌多为人类，身穿中世纪服装，没有武器。
//
//实体
//收费中枢
//收费中枢是一个大小为100立方米的正方形石头，由区域4的石头制成，表面有大量雕刻而成的符号、线条装饰，中间有一条裂缝，用于发出类似于wifi的信号，并且可以发出声音。
//高智商实体，憎恨人类。
//收费中枢控制着所有收费员，又或者说所有收费员是收费中枢的傀儡，收费中枢把自己的意识分到收费员上，类似于一台主机和数个显示屏。
//当流浪者在Level C-235的背面被抓住会被带到收费中枢审讯，然后处决。
//
//
//
//入口与出口
//入口
//穿过区域4的铁丝网，向下爬，爬到50米处重力颠倒，向上爬50米，可以来到这里。
//出口
//无
//附录
//- 点我隐藏
//前言：该录音笔来自于Sam的尸体，发现时已损坏，SD卡在经过修复后会有些许偏差。
//
//(骨头碰撞声，推测来自于收费员，和收费员抓住了Sam)
//Sam：放开我！听到没？放开我！
//(骨头碰撞声，推测是Sam在挣扎)
//Sam：哦，行吧，很抱歉，我误入了你们的地盘，但我以后肯定不会来了，并且会告诉别人不要来，我身上东西都可以给你们，我看你们喜欢把我们的物资放在这里，你一定会对我这些东西感兴趣，对吧？
//(骨头与石砖碰撞声，推测是收费员在往高塔上走，中间有大量模糊不清的语音，目前没有修复)
//(10分钟模糊不清的语音)
//收费中枢：你好，Sam，很抱歉没有立即回答你的问题，因为这些石头架子没办法传出声音，我知道你很感到抱歉因为误入了这里，但这仅限于你被架在这里，还有我对你的那些东西不感兴趣，很抱歉。
//Sam：哦，天哪，我想你一定是一个很好说话的实体，额，我是说，那种…额..
//收费中枢：词穷了对吧，没事，你们人类对我们这种生物都是这样称呼的，还有我的脾气事实上没有你想象的那么好，但几百年来，谁的坏脾气都会磨没，况且，你是近100年来唯一一个来这里的，不把脾气收一收，属实说不过去。
//Sam：(尬笑)哦对，的确，刚开始切入你们的世界我一开始也不习惯，但久了也就那样，还有我该怎么称呼你，哦，我是说，您，还有您怎么知道我的名字，关于什么100年的事我们可以以后说说，可不可以放我一马，因为我是第一个到这里的人，我是说，近100年来，除了那些300多岁的老祖宗。
//收费中枢：放你？哦天哪，你一定只有到这种地步才会求情，如果你身上有两把斧子，你肯定不会说这样的话，肯定会想把这边砍个精光，把一切占为己有，对吗？如果在300年前我肯定会放你，但300年前把那帮人放过的教训我不会忘记！
//Sam：等等，听我解释，我跟他们不一样，听我说，整整300年过去了，这是两代不同的人，我们不会把这边砍个精光之类的，相信我。
//收费中枢：看上去要好好聊聊了。你以为那些表面看起来淳朴善良的人，在300年前就淳朴了？300年前他们可是一群可怕、残暴的侵略者！他们可以用一把斧子砍死一只触物，砍伤天启(推测是壁画上的圆形触手实体)！我们曾好言相劝，把这里一半分给他们，但他们变本加厉，把这里一半生灵杀死，要不是他们一部分人因为水土不服而死，我们基本上都灭种了，据我所知，他们乃至在来到这里之前在互相残杀，看到那些雕像了吗，等到天启回来之时，把灵球放在上面之时，就是你们在这里灭族的时候。
//Sam：哦，好吧，我可能理解不了你的愤怒，但这之间是有区别的，我们是我们，他们是他们！他们代表不了我们。
//收费中枢：不好意思，我对你们人类的信任值已经没有了，我不想出现300年前的事了。
//Sam：那你为什么不去杀死剩余的人，你们那么恨他们？
//收费中枢：我说过分给他们一半地方，我们有原则，并且我们也是要休息的，虽然只有区区100多号人，但打起来也没有足够的胜算。
//Sam：那在我死前能不能再问一个问题。
//收费中枢：我会让你死明白一点的。
//Sam：天启到底是谁。
//收费中枢：我们的神，他创造了这里，但这里类似于他的后台工作室，他创造这里是为了想出办法解决你们带来的灾祸。
//Sam：什么灾祸？
//收费中枢：一种病毒，在另外一个层级，另外一个他创造的层级，剩余的我不清楚。
//Sam：嘿，我们能帮助你们！帮你们把病毒消灭。
//收费中枢：靠什么，靠你们的侵略？把所有那边的人全杀死，病毒就没了？很抱歉，我不信。还有什么想知道的吗？
//Sam：没有，看上去你的决心无法改变，但我们会让你改变的。
//收费中枢：把他处死吧。
//(10分钟含糊不清的声音，推测是处死过程)
//
//后记：Sam的尸体在区域1：植物覆盖的7639号车位发现，发现时头部被尖锐物品戳窜，尸体显风干状态，通过录音内容了解收费中枢为何憎恨人类。
//
//- 点我隐藏
//实体
//天启
//因该实体目前未出现在Level C-235的任何区域，所以未放在正文中，以下信息仅来源于壁画和Sam的录音笔。
//一种圆形生长着数条触手的实体，触手显黄色半透明，圆形躯体不详。
//高智商实体，拥有创造层级的能力。
//属于一种能量体实体。
//300年前原驻民主要攻击对象。
//与人类、流浪者的关系不详。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1235{}