//
//建立帐号 或 登入
//The Backrooms吧
//Backrooms Fandom Wiki
//The Backrooms中文wiki官方哔哩哔哩公众号
//Discord
//主页
//
//中文沙盒站
//
//图书馆
//
//层级
//|
//实体
//|
//物品
//|
//团体
//
//故事
//|
//相关人士
//|
//现象
//|
//设定
//
//搞笑文章
//|
//国际翻译中心
//
//原创图书馆
//
//原创层级
//|
//原创实体
//
//原创物品
//|
//原创故事
//
//原创团体
//|
//原创相关人士
//
//原创设定
//|
//原创搞笑文章
//
//原创艺术作品
//|
//原创现象
//
//网站
//
//最近创建的页面
//
//最近的更新
//|
//最近的编辑
//
//随机层级
//|
//随机原创层级
//
//随机实体
//|
//随机原创实体
//
//旧页面中心
//
//本月最高评分页面
//
//历史最高评分页面
//
//最低评分的页面
//
//社群
//
//讨论区
//
//翻译预定
//|
//最近的帖子
//
//作者页
//|
//中文网站作者页
//
//加入网站
//
//管理专用
//
//后台管理
//
//职员站点
//
//所有页面
//
//会员一览
//
//侧栏
//|
//顶栏
//|
//主题版式
//
//
//
//　
//
//Level C-211
//评分: 
//+12
//+
//–
//X
// 
//
//生存难度：
//等级 4
//
// 
// 
// 
//photo-1527757780101-05985993b2e7?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=735&q=80
//Level C-211其中一条赛道。
//
//Level C-211是后室C层群的第211层。
//
//描述
//Level C-211是一座类似于标准的一级方程式赛车场地，其内部设有看台、比赛控制中心、维修站、大型屏幕。有一部分的建筑已经受到不明撞击，且显现出不同程度的损坏。虽然流浪者会在外部看到此类建筑物符合常规的建筑风格，然而，当进入建筑物时会发现其内部结构奇怪且反常，流浪者会在其内部发现各式各样的建筑构件1，且交错在一起，一些流浪者报告称都会在其内部完全迷失方向。但也有少数情况下，建筑物内部是完整的。
//
//Level C-211是没有昼夜交替这一自然现象，尽管在该层级中探索时会偶尔看到其他不同时间段的层级，例如Level C-6。但赛道的尽头却会被无形的大型玻璃罩挡住。位于Level C-211内部的观众席虽然空无一人，但总是能听到嘈杂的呼喊声，这些呼喊声似乎都是在一些为车手呐喊所使用的词语。
//
//实体：
//Level C-211生成大量的敌意实体，“F1赛车”和“维修员”是Level C-211唯二经常生成的实体，“维修员”会在流浪者失去对该层级的警戒状态时出现在其身后，通常情况下，该实体会将流浪者打晕，并带到类似于维修站的建筑物内部。之后将流浪者强行进行“维修”2。而“F1赛车”是一辆无人驾驶的F1方程式赛车，虽然大部分的实体都出现破损情况，然而，并不影响该实体的正常行动。幸存的流浪者报告称“F1赛车”总会不经意间出现，并以每小时370千米的速度朝流浪者驶来，并试图将其撞死。也有其它层级的实体会意外切入进该层级中，其中包括清道夫、车兽、逐尸鸟。
//
//附件：
//以下是后室装修公司派出的员工在Level C-211中探索所收集到的一些附件，其中包括来自空无一人的观众席上传来呼喊声的录音文件，以及在一辆报废且无法运作的“F1赛车”实体里收集到一张便签纸文件。
//
//录音文件：
//冲啊，不要停下！我们可是投你们赢啊！
//
//我靠，这也太慢了，能不能开得再快一点。
//
//不准死，不准输。
//
//谁让你们[无法破译]，你们是吃屎长大的吗？
//
//（由于多种声音混合在一起，并导致翻译工作很难，目前正在翻译当中。）
//
//
// 
//便签纸文件：
//我不能就此倒下，胜利就在前方。
// 
//家人和爱人、朋友在前方等着我。
// 
//后面的车队犹如地狱里的火焰吞噬着里面的车手，但我不会失败。
// 
//让我们驶向生命的终点，直到毁掉自己的灵魂。
// 
//你也一样，加入我们的行列吧。
//
//
// erc_logo.png
//极限赛事委员会的标志
//
//基地、前哨与社区
//虽然一些流浪者发现该层级曾经有一个异常组织，名为“极限赛事委员会”，但不知何种原因，都没有目击到任何现有的基地，前哨站和社区。
//
//入口与出口
//入口
//在其他任何层级里找到一间房间，房间门口贴着一张极限赛事委员会的标志，将其打开并进入内部后，即可到达Level C-211。
//可通过Level C-71的交通枢纽到达。
//更多入口有待探索发现中。
//出口
//该层级中维修站内部一个逃生通道中可以到达level-35。
//通过切出地板可达到Level 1。
//极少数情况下，在该层级突发性昏迷会意外切出至Level C-102。
//作者信息
//Footnotes
//1. 代指建筑物内部的各个要素，例如楼（屋）面、墙体、柱子、楼梯等。
//2. 在未麻醉状态下强行给流浪者的身体皮肤进行开刀，之后将其改造为半机械人。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1211{}