//Level C-240
//评分: 
//+48
//+
//–
//X
// 
//
//生存难度：
//安全
//宜居聚集地
//无危险实体
//Level C-240是后室C层群的第240层。
//
//formatting8
//Desktop区
//
//formatting1
//C:\市入口
//
//描述
//Level C-240是一处矩形平直空间，长为1920km，宽为1080km，高度似乎没有上限。四周的背景是由象征蓝色天空和绿色草地的色块构成，无法破坏和留下痕迹，且无论在任何方位观察都会感觉相距较远的距离。流浪者在边界处会被无法看见的墙壁阻隔，但每个人都会感觉到在阻碍以外的仍存在极大的自由空间。
//
//因Level C-240的空间性质，进入这里的流浪者可以在墙壁上竖直行走，抑或是在天花板上倒置。无论站在任何地方，总会感受到来自脚下的重力影响，但这种重力影响似乎并不会影响到非生命的物品，这些物品会随着周围人的视线而改变，通常来说总是跟随着附近的流浪者并依照其思维惯性或常识而改变自身的受力情况。
//
//在这一层级内，流浪者可以通过闭着眼睛并幻想的方式到达大部分区域，这种移动几乎是瞬间的，但仍可以通过高速摄影捕捉到移动中的身影，期间移动的流浪者不会感受到任何位移和外力，主观上仅是在闭上眼睛的瞬间就改变了方位。这种位移同样会影响到与之接触的物品，但假如该物品的归属权并不属于那个流浪者，则不会受到影响；尽管归属权的边界总是模糊不清的，但一般与其制造者或将其带入这一层级的情况相关。
//
//在这一层级内，流浪者不会产生疲倦和饥饿感，但因长时间缺乏睡眠和绝食对身体带来的影响依旧存在。食物和杏仁水在这里不会变质和腐烂，但会随着时间的推移而变得难以进食，通常会被描述为满是铁锈味和塑料燃烧的味道，而在这一层级内制作的食物则会天然的具备这种特质。
//
//任何进入这一层级的流浪者会首先到达Desktop区，在这里所有的建筑物都会间隔50m，并按照正方形网格排列。这些建筑自发现层级以来就一直在此存在，每一个建筑都是完全一致的样式：外立面为清水混凝土，前面由青石砖构成格挡并围成一个小院，建筑都有三层结构，没有任何家具和内饰，但铺设有地热设备和环氧自流平水泥，总体上呈现为米黄色，内饰墙壁为淡青色裂纹漆，以及设有大理石踢脚线。这些建筑不会风化与老化，任何形式的痕迹都无法在上面长时间保留，且受到任何程度的磨损都会以肉眼可见的速度恢复，也不会在此残留任何异味；因此流浪者也无法通过标记辨识房屋的归属，故此越靠近通道口的房屋越受欢迎。
//
//formatting2
//走廊
//
//在Desktop区的东面和西面都有一个大门，可以分别通往不同的区域。不同区域之间会存在一条访问权限检验走廊，每一个进入的流浪者都会在眼前出现可以被其理解的文字，内容通常为“正在检索你当前的访问权限，请待在原地”，下方有一条黑色的进度条。当进度条填满后，走廊末端的大门才会开启，流浪者可以通过大门进入其它区域；在此期间，流浪者可以打断权限检验并原路返回。
//
//每一个大型区域都有若干小型区域，在这些小型区域内同样有更小的子分区。子分区可以自行拓展其空间和数量，这种拓张似乎是不受限制的。当流浪者经由鼠标完成了一次新建子分区，即可对其进行命名，并决定其他流浪者的访问权限；不具有访问权限或黑名单对象无法进入该子分区。
//
//流浪者也可以借由其想象在子分区内自行创造建筑物、家具、食物和来自Firewall河的水资源，这种创造行为似乎是不受限的，但空间内的流畅程度会随着创造次数和物品数量而受影响，表现为子分区内所有情况返回到数分钟到数小时以前、无法移动任何物品、大型物品的突然消失和出现、移动物品后仍然有一个相同的物品在原处存在、身上长出额外的肢体且不断重复数分钟以前的动作等，减少其内部同时存在的流浪者和创造物可以缓解这种现象。
//
//formatting4
//鼠标
//
//鼠标
//鼠标是一个有黑色描边的白色像素实体，其看似身处二维平面，但仍可以在这一层级的任何位置出现。对于每一个主观视角而言，鼠标总是维持正面朝向，这种情况对其产生的投影同样存在。
//
//这种实体可以出现在这一层级的任何位置，不会受访问权限检验走廊的阻挡。它可以穿过任何物品和墙壁，且似乎总是浮在所有物体的上层。被鼠标选中的物品和分区会颜色加深，并在周围出现一个蓝色矩形将其包裹住，大部分被选中的物品都会消失在原地；极少数情况下，被选中的物品会恢复原样，并且鼠标消失在原处，且会经过足够长的一段时间后才会重新出现。
//
//自磁盘清理战争后，任何建筑物和分区都有可能因被鼠标选中而删除。若一个由流浪者创造的建筑物或子分区位于鼠标频繁出入的位置，则极大可能会被选中并删除。当一个物品或分区被鼠标选中时这种删除似乎是可逆的，但当前无法证实此观点。
//
//基地、前哨与社区
//C:\市
//C:\市是位于Level C-240东面的大型区域，可经由一扇写有“C:\”字样的大门进入，通过一段长500m的访问权限检验走廊后，即可到达。
//
//Program Files区
//隶属于C:\市，位于C:\市中心城区南部，因入口路上写有“C:\Program Files”字样而得名。北面与Documents and Settings区隔Firewall河相望，西面与Windows区连通，东南面为MSOCache区和Desktop区。此区域为鼠标最频繁出入的区域。根据第11次人口普查数据表明，Program Files区常住人口为15021人。
//
//在一些当地传闻中，曾有人途经此处时到达过一个名为“Program Files(x86)”的区域，其具有与Program Files区近似的结构和大小，似乎有人在里面居住。此传言未被证明或证伪。
//
//当前Program Files区可以分为一下街道：
//
//Common Files街道：总体上呈南北走向，连接Media Player街道、Outlook Express街道与Messenger街道。
//在这里会不时出现一些带“.tmp”或“.ac$”字样的建筑物，这些建筑物没有任何可观测的内容物，外立面总是不尽相同，通常出现的图案是带有浅蓝色包边的深蓝色、阶梯状的红白相间、蓝色的“3”以及红色的“A”等，这通常与鼠标在其它市辖区或街道有关。
//这里是探险者总署的kappa基地所在处，不同的M.E.G.团队会在此进行补给和休息，大部分M.E.G.成员也会在此休假。在这里由超过5000人以上的常驻成员。
//Media Player街道：在Common Files街道末端的十字路口直走即可到达，连接Common Files街道和Microsoft Office街道。总体布局看上去与一个特大型电影院的观众厅类似，整个街道光线较暗，在南面的墙壁上会不定期的播放1878年到1980年之间的电影和电视剧，也曾播放过一些未被记录和关于后室的影视作品，大部分是无声的1。
//商人之家在此设有前哨，主要看护Media Player街道的入口并向进入其中的流浪者售卖参观门票。约有12-30名成员在此常驻，负责提供爆米花（黄油制作，故有较多糊味黑点）、可乐味杏仁水（百事可乐勾兑而成）和清洁服务。
//Movie Maker街道：仅可通过Media Player街道尽头进入。目前由商人之家看守，禁止任何非组织成员进入其中。
//Outlook Express街道：位于Program Files区最南端，连接Internet Explorer街道和Online Services街道，首位分别连接Common Files街道的小巷和Microsoft Office街道。在这里存在超过20吨的信封在地上堆积，有若干小型鼠标在此搬运信封，在天花板上会不断掉落信封，再有小型鼠标运送至街道每隔20m都会有的一个绿色邮筒内。
//在此可以进行写信和寄件，大部分纸件都可以通过这里向其它层级的流浪者进行传递，邮递出去的信件毁在3个工作日后发现于收信人的随身物品内。发现过极少数邮递杏仁水和威化饼干的情况，其他更大件的物品均被拒收。
//在这里发现若干由杰瑞的信众成员组成的队伍，通常人数为3-5人。他们似乎在此搜寻某物，据信与杰瑞匿失的日记或儿时的绘画有关。
//formatting5
//文件夹
//
//Online Services街道：位于Common Files街道和Outlook Express街道之间，也是通往Internet Explorer街道的唯一通路。在这里排布着若干个文件夹样式的实体，这些文件夹似乎与这一层级内存在的分区数量相关，一些流浪者曾目击到鼠标会在此处删除文件夹，但此行为未在这一层级内发现对应的消失分区。
//有少数阿尔戈斯之眼成员会在此处休息，并且会将一些捕获到的实体带到此处进行处决。
//在此街道的一些建筑物内发现一些卡拉格灵协会的遗弃档案，似乎均为重复件和重复档号。
//不时会有一些系着彩色丝带的黄色信封被寄到此处，其内容大多为”猜猜谁不会被邀请？“和”这是一场很棒的派对，可惜有人没法参加“等。
//Internet Explorer街道：当前任何人均无法通过访问权限检验走廊进入。连接Outlook Express街道最北端，每一个到达此处的流浪者总会感受到没由来的羞耻感和伤心，这种现象的程度会随着滞留时间而增加，故此无任何流浪者在此定居。
//Microsoft Office街道：位于Program Files区最东端，仅与Media Player街道和Outlook Express街道连接。因位置远离入口和主通路而人烟稀少，目前由红星建筑队占据。
//这里是红星建筑队的一处大型基地，常驻成员超过2000人。
//会频繁出入，以及搬运建材。
//禁止任何非组织成员进入。
//Documents and Settings区
//隶属于C:\市，位于C:\市中心城区中南部，因入口路上写有“C:\Documents and Settings”字样而得名。南面与Program Files区相邻，西南面为MSOCache区。根据第11次人口普查数据表明，Documents and Settings区常住人口为201人。
//
//任何一个到达此区域的流浪者都会在本地生成一个以他的名字命名的文件夹，并且实时记录了进入这一层级后的所有行动和发言，此记录仅可由自己查看，但也可以向其他人授权分享。流浪者可以在这里对进入这一层级后所有造物进行统筹处理，包括但不限于：删除创建的子分区和建筑物、移动建筑物、扩大或缩小子分区的容量和调整子分区的进出权限等。当一名流浪者删除了自己的文件夹时，他会被移出这一层级，且在无法进入。
//
//此区域因人流量过大而没有任何组织在此设立基地或前哨，但商人之家会在街道上举办大型集市和拍卖会，平时也会有流动商贩在此进行营业。
//
//MSOCache区
//formatting6
//MSOCache区
//
//
//隶属于C:\市，位于C:\市中心城区西部，因入口路上写有“C:\MSOCache”字样而得名。北面与Program Files区和Documents and Settings间隔一座大型水泥桥。这里是单向分区，每名流浪者仅可进入一次，在离开后则无法再次进入。根据第11次人口普查数据表明，MSOCache区常住人口为14人。
//此区域为一处面积无限的服务器机房，从入口处出发沿着另外三个方向延申，内部有无数台服务器机架按照矩形网格排列，每一台服务器均有若干条橙黄色的橡胶配线相连。机箱连接至入口处的一块显示屏上，显示屏上为若干对应机箱的灰色矩形，前41个已标记为红色，第42个标记为橙色，其他均为绿色。
//
//此区域内发现有14名原住民，这些人身穿B级防护服在机箱之间游荡，随身携带着一个大型背包和一个工具箱，手上总是持有电动螺丝刀或测电笔，他们偶尔会在一个机箱前停留，用测电笔对端口进行测量，然后取出数字万用表进行检测。从未有人见过他们进行休息和进食，也从不脱下防护服。
//
//自磁盘清理战争后，MSOCache区已鲜有人出入。
//
//Desktop区
//曾隶属于C:\市，之后由于在磁盘清理战争中被无羁探险者联盟切断了原先通往C:\市主通路而被独立，在战后由M.E.G.重新开通前往C:\市的通路。此区域为流浪者在这一层级的主要活动范围，也是鼠标较为频繁出入的区域。根据第11次人口普查数据表明，由于此处系所有进入这一层级后的唯一入口，故Program Files区常住人口为无法估量。
//
//此区域主要由M.E.G管辖，有巡逻队维持治安。
//他们会与短暂歇息的流浪者进行贸易和补给。
//为居无定所的流浪者安排住房，并引导其融入社区。
//不时会有猎犬 、无面灵、悲尸和窃皮者偶然进入这一层级，但在未反应过来之前就会被鼠标移除。
//回收站
//这是一个较为独立的特殊分区，一般情况下无法正常进入，但可以通过紧靠着即将被鼠标选中并删除的物品到达。此区域内堆满了被移除的物品、建筑物、子分区残骸和实体，在这里的时间是静止的，流浪者无法对其内部的任何物品进行影响和互动。流浪者在区域内无需进食和呼吸，也不会排汗和新陈代谢，但会感觉到无法抑制的窒息感和束缚感，尽管这并不会对他造成实质性的伤害。流浪者可通过触摸鼠标返回之前的位置。
//
//当前仅有阿猫阿狗（Every Tom,Dick and Henry）的组织成员在其内部定居，他们会从回收站内搜索可回收的物品到C:\市Program Files区Media Player街道或Desktop区进行以物易物，通常仅会交易杏仁水和压缩饼干。
//
//有时候阿猫阿狗的成员会主动尝试与回收站内的垃圾进行交互，出现过多次其成员与废弃数据融为一体而发生转变的情况，后续在此层级内再无发现这些成员的踪影，似乎已被派遣往其他层级进行活动，无法确认其目的性。
//
//当前无法确认其生活在回收站内的缘由以及生存方式。
//
//
//
//
//D:\市
//D:\市是位于Level C-240西面的大型区域，可通过一扇写有“D:\”字样的大门进入。目前入口处由无羁探险者联盟把守，禁止任何非组织人员进入；其成员似乎未主动表现出敌意定位，但任何试图靠近的行为都会招致其攻击。曾有流浪者进入了D:\市的大门，但在访问权限检验走廊被以”这场派对不欢迎你“为由拒绝进入。当前无法确认其内部区域的情况。
//
//磁盘清理战争
//磁盘清理战争在2020年1月21日至4月1日发生于Level C-240。彼时一支M.E.G.小队在部分民间流浪者的指引下进入了Level C-240，但在到达Desktop区后遭遇了在巡视地盘的U.E.C.成员，没有准备的M.E.G.小队很快被U.E.C.成员袭击，其在被全歼前向基地发回了关于一个大型宜居层级以及U.E.C.在此设立基地的消息。
//
//随后被派遣进入这一层级的M.E.G.军队迅速占领了Desktop区内的多数房屋，并开始在C:\logs广场上与来自D:\市的刃岭游击队进行数次小规模冲突。
//
//刃岭游击队将一个包含了若干名战斗人员的大型木马雕塑放置在”我的电脑“附近，木马被M.E.G.巡逻队带回驻留地后立即发起攻击，但迅速被执行清理系统垃圾。
//由若干个携带着不小于20GB文件夹的成员组成的神风特别攻击队开始向C:\市内冲锋，尽管阻挡了大部分实体，但仍然有12个攻击队进入了C:\市内，由此导致了之后一段时间内的卡顿和物资运输缓慢。
//从D:\市入口处飘出若干个彩色气球，并立即占领了整个战区。尽管及时启动了Firewall河进行阻隔，但此次进攻仍然造成了磁盘清理战争以来最为严重的伤亡损失。
//一支特殊派遣的刃岭游击队开始向M.E.G.主基地进攻，该队伍已知的武装包括了一个《鬼泣4》潘多拉魔盒、12门MAN AT ARMS系列中的狼头炮、一把《传送门》中的光圈科学手持传送门装置，以及每个人都携带的原素瓶。此次进攻被迅速压制。
//M.E.G.派遣一支敢死渡过了Desktop区最南端的Firewall河，通过小路和融入环境的绿色掩体，顺利进入了D:\市内部。在进入寻找U.E.C.基地期间被其巡逻队意外发现，小队立即逃亡至一个不知名的分区内，并引导鼠标选中了子区内的每一个名为”uninst.exe“的实体——与此同时，在战场上的刃岭游击队因手上的武器突然消失而迅速被M.E.G.军队压制。
//此后的清晨，U.E.C.与M.E.G.达成和解协议，以D:\市和Firewall河为界，撤回了在其他分区的所有成员和设施，且至今没有离开过D:\市。除D:\市以外的区域由M.E.G.进行直接管辖。
//
//关于这场战争的伤亡情况至今未被公开。
//
//入口与出口
//入口
//在任何一个层级，将自己录入一个快闪存储器，并将数据拷贝进一台家庭电脑时，即可切入这一层级。
//使用一台笔记本电脑，在连通Wi-Fi后向一个名为”ENIAC“的用户进行语音或视频通话，请求接受后即可切入这一层级。
//被Level C-102的错误方块覆盖全身时有几率切入这一层级。
//在Level C-195内成功访问一个名为”消防局“的网站时会被切入这一层级内的Firewall河内。
//出口
//除饮用以外的方式接触杏仁水会被立即送回切入时的位置。
//将Documents and Settings区中关于自己的所有信息全部删除即可被送往Level 0或Level 1。
//频繁进出Desktop区的Admin文件或Firewall河有一定几率到达Level C-67的消防通道。
//在MSOCache区内找到一个黑色的门，进入后到达Level C-101的灯泡处附近。
//身处回收站内被删除时会被切出，当前无法确认切出位置。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1240{}