//Level C-204
//评分: 
//+14
//+
//–
//X
// 
//
//生存难度：
//等级 3
//
// 
// 
// 
//628de3f5489e8.jpg
//Level-C-204的标志，来自于后室娱乐宣传品。
//
//Level-C-204是后室C层群的第204层。
//
//描述：
//Level-C-204类似于一座合成器风格的热带岛屿以及其周围的海域。岛屿本身以及岛上的树木、建筑、乃至于天体都由不同形状的合成器风格的几何团块组成。目前本层级内容匮乏，仅存在一座面积约三百平方米的椭圆形小岛、少量树木和灌木等。（2018/2/3）.
//
//当流浪者通过标准方法1到达本层级时，其眼前将出现一全息窗口，内容如下：
//
//欢迎光临 后室娱乐出品
//
//Level-C-204
//
//测试版本 open alpha v 0.0.0.12
//
//数秒后窗口将消失，之后便可自由探索本层级。当没有流浪者处于本层级后层级将刷新并回到原本状态。
//
//虽然本层级几乎不存在实体，但包含大量不稳定、极易切入的物体和错误的物体（多表现为扭曲的黑色团块或以不自然的方式扭曲的物体），甚至可能产出之前被认为是Level-C-102特产的错误方块物品。不推荐任何除标准方式以外的入口。当本层级处于“停机更新”模式时标准入口将关闭。
//
//值得注意的是本层级的特有实体：“机器眼”。它表现为一个悬浮于空中的金属机械，漂浮于空中，不时为本层级创造或删减事物。每次更新后本层级的版本号都将变化。
//
//Level-C-204 0.0.0.1版本 全部内容：
//小岛主体
//海洋
//两颗棕榈树
//一把铲子
//一份埋在地下的宝藏（见下文）
//628de3f4b0b8e.jpg
//于0.02.1版本加入的公路的景观。
//
//Level-C-204寻宝活动
//使用本层级独特的铲子物品挖掘埋在小岛下的宝藏！铲子是一个由几何光带组成的物体，让人想到同为后室娱乐制造的霓虹发射器。随后，你可以去挖掘宝藏了！但铲子和宝藏都存在很多错误，建议现在不要轻易尝试。3
//
//宝藏
//一个装有金币的宝箱。金币是几片灯条不断闪烁着不同的颜色的圆形片状物。目前未知其用处。
//
//机器眼
//本层级特有的实体。一个漂浮的圆球，也是整个层级唯一一个底色为白色的物体。它拥有一个硕大的机械风格的“眼睛”，不时通过从其中射出光线的方式在层级中以一种“数码构架”的方式创造或删除物体。值得注意的是，它们在工作时会无视流浪者的存在，因此在与其接触时应当多加小心。有些时候根据创造物品的大小的需要，机器眼的大小也会十分巨大。
//
//机器眼平均一个月出现一次并带来更新。截至本文档撰写（2022/5/25），本层级已经历大小更新更新50次。
//
//更新记录（摘录）
//本条目持续更新，主要记录较为显要的变化。
//
//v0.0.0.2：更改了天空盒贴图，现在为一个合成器风格的落日风景。
//v0.0.0.4：为宝藏添加随机移动位置的功能。现在当金币被挖出后金币箱会消失。
//v0.0.0.6：更改了天空盒贴图，现在为一个合成器风格的落日风景。
//v0.0.0.7：加入八小时每昼夜的昼夜循环系统。
//v0.0.1.0：首次“停机更新”，加入了一个码头和一处沙滩小屋。小屋和码头被作为游戏的安全屋和起始点。
//v0.0.1.5：在沙滩小屋中添加几张睡袋和一个使用金币兑换瓶装杏仁水的机器。
//v0.0.1.5.2 ：经过整合信息后，现在在开始欢迎页面可查看更新记录。
//v0.0.1.8.3 ：在沙滩小屋中添加数张宣传其它后室娱乐层级的海报，如娱乐大厦、射击场、桌游厅等。
//v0.0.2.1 :添加一条公路和加油站设施，预计加入载具和驾驶系统。
//v0.0.2.4：实体测试。4
//紧急更新v0.0.2.4.2：加强了层级的安全协议，使其免受br-80端口漏洞的损害。5
//v0.0.3.1：加入了第二个较小的岛屿。其作用待定。
//基地、前哨与社区
//“霓虹疯狂寻宝者”
//一群热衷于后室娱乐提供的事物以及合成器文化的嬉皮士。他们热衷于寻宝，据称是为了等宝藏金币有了实际价值后自己就能赚到第一桶金。他们占领了沙滩小屋，并试图垄断铲子的销售，但这在一次更新使得所有人都可以从入口处的一个桶里无限地拿出铲子而告终。
//
//不过另有理论称他们只是想以此找乐子和社交。
//
//速切玩家基地
//一群以快速切出切入层级为乐的年轻人。他们利用本层级不稳定的特点使用其作为起始点。
//
//“失落军团”苦修营地
//失落军团以此层级作为训练萨满的地方，他们要求新人在此“思考这个层级的不完备和进化”。
//
//入口
//在Level C-70的“电子沙滩”区域的码头找到宣传“参加寻宝活动测试”的船只并乘上，它会把你载到本层级的小码头里。切入散布在C层群各处的宣传海报也可以达到相同效果。
//
//尝试在Level C-203向地面切入后，你就会发现自己在本层级的高空向下坠落。这时一个机器眼会出现并在你的下方制造一些柔软的垫子以接住你。需要注意的是，这有时并不能完全缓冲动能。
//
//在Level C-205的gamma区域有一个山洞，洞顶上有一个合成器风格的洞口，攀爬上去后你就可以到达Level C-204.1进而到达本层级。
//
//Level C-29偶尔会出现一个出错的人物，表现为一团黑色和紫色的团块，触摸就可能切入本层级。
//
//未经证实的消息称，Level C-86的兑换商店偶尔会出现一台可疑的、出错的后室娱乐风格的投币机，接触后就可能切入本层。
//
//为保护流浪者的身心安全，在此不再列出更多可能的入口。请各位流浪者仔细甄别探险中出现的事物，不要轻易尝试未在数据库中列出的可疑事物。
//
//出口
//登上码头的正常的船只会使你回到Level C-70的“电子沙滩”的港口。
//
//接触包括错误的船在内的出错的物体可能使你前往十分危险的或/且未知的层级，此现象是十分普遍的，请小心尝试。
//
//切入地面后你会持续坠落，有两种可能的结果：第一，最后你会发现自己正坠向Level C-140中心大厦的上空。建议大声呼救以让后室娱乐员工使用救援设备帮助你降落在中心大厦的屋顶上。第二，你可能会坠入Level C-204.1
//
//向天边划船直到你发现周围合成器风格的景色渐渐过渡为黑色，你就可以以肉身的方式来到Level C-33。不过在第七次入睡时你会在Level-C-140的餐厅的酒吧吧台前醒来，周围满是实体顾客。其他人会称你之前来这里喝得烂醉如泥后就睡下了。
//
//潜入海中通常会在约5m处触及到海面，如果你发现自己下潜的深度远超过5m且水逐渐变为黄色，你就进入了Level C-158。
//
//日落时分划船到太阳边，你会发现太阳是一个栅栏状的光条组成的很大的圆牌。从栅栏间爬进去你就会在Level C-86的Level C-5主题项目中出现。不过你也有几率坠入那美丽的紫罗兰之乡。
//
//作者信息
//« Level C-203 | Level C-204 | Level C-205 »
//
//Footnotes
//1. 一个位于Level-C-70的“电子沙滩”区域的码头的特定船只，见下文
//2. 版本号将随层级更新而变动，文中版本为第一次接触本层级时显示的版本。
//3. 已知的bug有：粘在手上无法取下、突然高频振动伤人、带着使用者一起卡入地下等等。
//4. 事实证明“测试”是灾难性的，本层级充满了疯狂且危险的未知实体。令人不安的是，它们看起来很像Photoshop。实体很快被移除了。
//5. 未知此条内容是否与**数据删除**的最新变化有关。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1204{}