//Level C-290
//评分: 
//+20
//+
//–
//X
//欢迎来到阿那亚医疗中心！
//这里是后室中最棒的医疗中心！
//包括内科，外科，五官科，妇产科，儿科，精神科等科室。
//欢迎各位后室旅行者到我院就诊！
//
// 
//
//生存难度：
//等级 1
//
// 
//健康
//友善实体
//Level C-290是后室C层群的第290层。
//
//描述：
//rBAAdmLYAcmAKnI8AABTJiHY9g4656.jpg
//一张寝室的照片。
//
//Level C-290以一座医院的形式出现，建于 2021/7/10日 ，目前已具有较为完备的科室，可以基本满足流浪者对于医疗的需求。
//
//不同于前厅的是，本院并没有设置通往外界的大门，且科室首尾依次相连，并没有设置走廊。每一个科室依次开放，开放时间为两小时。
//
//此层级存在的最主要科室是口腔科，耳鼻喉科，脑科，精神科，骨科，妇科，产科等。
//
//隐藏
//口腔科
//
//开放于0:00～2：00，主要治疗口腔溃疡等问题。
//
//耳鼻喉科
//
//开放于2:00～4：00，主要用于治疗耳膜穿孔，咽喉肿痛等问题。
//
//脑科
//
//开放于4:00~8:00，主要用于治疗脑震荡等问题。
//
//精神科
//
//开放于8:00~10:00##，主要用于治疗抑郁症，焦虑症，多重人格，斯德哥尔摩综合症等问题。
//
//骨科
//
//开放于10:00~12:00，主要用于治疗骨折，骨裂等问题。
//
//rBAAdmLZMseAWYwVAAGiQ5__D9Y619.jpg
//本院就诊区详情。1
//
//更新于 2022/6/12：目前， 妇科与 产科已被关闭。
//
//Level C-290与前厅中的医院类似，这里有工作人员工作，并且长期对外开放，您可以在这里取得到一些基本的医疗物品。此外，该层级的商店也正常开放，其所售卖的产品也大多都为在前厅中所能购到的物品，少数情况下，商店会售卖杏仁水。并有传言称，这里的每年 7/10日会售卖皇家口粮。
//
//实体：
//Cell-阿那亚工作人员
//本层级有约一百个此实体，外表为人类男性，身高1米7至1米8，待人友好，但是会对人产生一定的精神影响，主要分布在此层级的各科室内。
//
//基地和社区：
//M.E.G.探测中心：
//为M.E.G.的一支探测小队。
//此基地约十五人，成员均居住在该层级的寝室。
//会与“A.N.Y”阿那亚医疗组织进行贸易。
//“A.N.Y”阿那亚医疗组织：
//有约100名成员，目前致力于帮助流浪者。
//与M.E.G.Aleph基地进行医疗合作。
//医疗物资充盈。
//存在严格的管理制度，每名成员均有特定编号。
//入口与出口：
//入口
//触碰位于Level 1，有关于宣传本层级的海报后，将切入该层。
//当您在宜居层级患上较为严重的精神疾病，睡梦中被询问您是否需要帮助，若同意，您将会出现在这里。
//在Level 11中进入一栋标有阿那亚医疗中心的医院会切入该层。
//在Level 0中触碰到一份情书会切入这里。
//在宜居层级中饮用 酒精过多直至昏迷，有可能切入该层。
//出口
//向A.N.Y阿那亚医疗组织的首领请示，你可以来到Level C-100
//在医院大厅中反复徘徊，直至眼下的砖从白色转化为黄色，将切入Level 1。
//在阿那亚医疗中心的宿舍睡着有极小概率切入Level 200 。
//在任一房间触碰一个带血的鞭子，可能会进入Level 14
//
//
//
//- 关闭
//后室网络
//你曾经来过这里
//主题：C-290官方讨论贴
//楼主：chara_murder
//ip属地：Level C-290
//
//chara_murder
//是这样的，当时我在Level 11里看见了一个类似于医院的建筑，想过来看一看，刚进门就被切到了这里。这个层级是一个类似于医院的地方，不过确实，药还挺多的。
//发表于2021/7/12 ip属地：Level C-290
//
//chara_murder
//说实话我没什么病，不过顺便路过了一下超市。这里tmd怎么什么都卖？？？？怎么还有枸橼酸西地那非2？
//rBAAdmLYAd-AZJpTAACJ2Jsd3xM770.jpg
//刚刚去了趟厕所，想吐。垃圾桶里面全是避孕套，好像还没有处理，尿池上血还喷了一地。
//这tm的，精液怎么都变黄了！
//发表于2021/7/13 ip属地：Level C-290
//FTN_YYS1012
//什么恶趣味…
//发表于2021/7/14 ip属地：Level 48
//
//shizepiya
//以前没听说过这里，不过看来应该也危险不到哪儿去。
//@M.E.G.，有个新层级。
//发表于2021/7/16 ip属地：Level 11
//
//LKY_Cutter（管理员）
//已建立新层级，生存难度暂定为一级。待勘探完全后再依据情况做修改。
//发表于2021/7/16 ip属地：Level 1
//
//-
//-
//-
//
//此文档开始编辑于 2021/7/12
//
//此文档在 2022/7/16后不再适用
//
//该层级没有想象中那么安全，目前检测到此层级已有流浪者失联，且都为女性（或者是生理上的女性）。在上一周的贸易中，我们检测出氟西汀、帕罗西汀3有少量苯丙酸诺龙4的成分，目前我们已经将与此院的所有贸易尽数取消。
//
//— 驻C-290 M.E.G.职员Monika
//
//检测到一封新档案。
//
//正在更新中
//
//更新完毕，点击此处观看。
//
//脚注
//1. 仅包括了就诊区，并未包括寝室
//2. 春药的主要成分。
//3. 一种抗抑郁药物。
//4. 媚药的成分之一。
//
//
//Level C-290
//评分: 
//+20
//+
//–
//X
// 
//
//生存难度：
//等级 2
//
// 
//稳定
//欺诈性实体
//Level C-290是后室C层群的第290层。
//
//描述：
//本层级以医院的形式出现，自 2021/7/16日 后不可使用。虽然看似有完善的医疗体系，但不能满足流浪者对于医疗的需求。
//
//Level C-290与前厅中的医院类似，您可以在这里取得到一些基本的医疗物品，但仅限于外用的医疗设施，任何的内用药都由安慰剂组成。本层级的商店也正常开放，购买的物品中以前厅的东西为主，不推荐购买饮品，因为有旅行者声称他们在饮品中喝到了奇怪的味道1。
//
//本层级相对安全，心理和生理的效应较弱，一般在1年左右才能造成最为严重的后果。不同的区域对于人的精神认知能力影响是不同的，口腔科和耳鼻喉科的影响最弱，而妇产科的影响最强。确保安全离开此层级的最好方式是不与实体进行过多交谈。
//
//rBAAdmLZMrWAArlaAAF80e4qVAg030.jpg
//不同层级的心理效应。
//
//红色越深代表效应越强。
//
//进入本层级的流浪者会受到一种心理效应，这种心理效应此效应被称为 “蛊惑”。这种效应带来的影响，在女性探险者上体现的更加充分，主要表现为产生对此层级的依赖心理，再对这些探险者进行检测后，发现他们的大部分换有严重的创伤后应激障碍或斯德哥尔摩综合征。
//
//在生理上，进入本层级久居的旅行者可能会出现皮肤疼痛，关节疼痛，耳膜穿孔，骨裂骨折等现象，甚至部分女性出现了停经，丧失生育能力，子宫脱坠等现象。
//
//- 关闭
//虚拟实体：148号
//姓名：刘璐（已进入脑死亡）
//性别：女
//年龄：21岁
//
//效应：
//
//第5天，停经。
//第16天，皮肤和关节开始疼痛，口腔溃疡。
//第1个月，出现怀孕迹象，但并没有受孕，检测出创伤后应激障碍。
//第2个月，身体出现骨折，出现精神分裂。
//第6个月，丧失生育功能，小便失禁。智商检测到达重伤二级水平。
//第7个月，检测出宫颈癌和乳腺癌。
//第10个月，失去所有生命机能，M.E.G.结束观察。
//发表于2021/7/12日
//截止至2022/6/18日
//
//实体
//阿列夫
//阿列夫为一个人形实体。据其外表及生理状况推测为女性。于2022/6/16日在此层级被发现。其身高140cm，体重35kg。M.E.G.在对她进行初次检测时发现她已经失去了生育功能，而且很难再发声，全身共四处骨折。
//
//对她进行精神测试时发现她有很严重的双重人格障碍和认知障碍，适应行为极差，面容明显呆滞；运动感觉功能极差，通过训练，只在下肢、手及颌的运动方面有所反应。
//
//通过这种智力状态的实体，获取到这个层级的信息几乎是不可能的，因此M.E.G.已放弃对她进行进一步的探索。
//
//Cell-阿那亚工作人员
//本层级有约一百位此实体，外表为人类男性，身高1米7至1米8，待人友好，但是会对人产生一定的精神影响，主要分布在此层级的各科室内。
//
//此实体目前并未表现出对人类的过多敌意，但 M.E.G.发现此实体在进行医疗活动时会用安慰剂或者是代替原本药物，因此并不推荐。使用此实体所推荐的药物。
//
//基地和社区
//M.E.G.探测中心：
//为M.E.G.的一支探测小队。
//此基地约十五人，成员均居住在该层级的寝室。
//目前已停止与阿那亚医疗中心的任何贸易。
//2022/7/16后，阿那亚医疗中心不再被信任。
//
//出口和入口
//入口
//触碰位于Level 1，有关于宣传本层级的海报后，将切入该层。
//当您在宜居层级患上较为严重的精神疾病，睡梦中被询问您是否需要帮助，若同意，您将会出现在这里。
//在Level 11中进入一栋标有阿那亚医疗中心的医院会切入该层。
//在Level 0中触碰到一份情书会切入这里。
//在宜居层级中饮用酒精过多直至昏迷，有可能切入该层。
//出口
//向A.N.Y阿那亚医疗组织的首领请示，你可以来到Level C-100
//在医院大厅中反复徘徊，直至眼下的砖从白色转化为黄色，将切入Level 1。
//在阿那亚医疗中心的宿舍睡着有极小概率切入Level 200 。
//在任一房间触碰一个带血的鞭子，可能会进入Level 14
//回到原文档
//脚注
//1. 被认为是血液和精液。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1290{}