//Level C-218
//评分: 
//+5
//+
//–
//X
// 
//
//生存难度：
//等级 3
//
// 
// 
// 
//QQ%E5%9B%BE%E7%89%8720220721165913.jpg
//Level C-218的第一张照片。此时流浪者处于最底层。
//
//Level C-218是后室C层群的第218层。
//
//描述
//Level C-218总体上是个无限高度的楼道，楼道内的湿度较大，气温稳定在27摄氏度，层级内的二氧化碳浓度偏高，易使流浪者产生闷热的感觉与烦躁的情绪。
//
//Level C-218内楼梯的扶手材质、阶梯材料及外观、墙壁的材料与外观都会随着流浪者探索的高度变化。扶手材质将由光滑的金属铝逐渐变成锈蚀的铁，阶梯外观逐渐由红黄平瓦片变为简单的混凝土材质，墙壁将由小瓷片逐渐变为普通刷漆白墙。该层级内的墙壁或天花板上有着微弱且不断无规律闪烁的白炽灯，运行功率较小但噪音大，类似于Level 0中的噪音。
//
//任何对Level C-218的破坏均会在流浪者移开视线后被修复，使用录像机拍摄修复过程的尝试均以失败告终。在该层级内，类似于Level 0，该层级的线性空间处于不稳定的状态，任何进入该层级的流浪者不可能遭遇其他流浪者。
//
//在探索足够高的楼层之后，Level C-218的墙壁上将随机出现窗户，窗户外只有一片空白，没有任何景象，在测试后可知，这是正常的窗户而非“二号实体”窗户。
//
//该层级总是有着微弱的WiFi信号，同时，瓶装杏仁水可以在阶梯上找到，食物、饮用水等其他物资均无法在该层级找到。
//
//+<- 收起附件
//QQ%E5%9B%BE%E7%89%8720220721165909.jpg
//Level C-218景观，图片因流浪者手电筒影响而曝光。
//QQ%E5%9B%BE%E7%89%8720220721165934.jpg
//流浪者此时身处35层，层级环境已发生变化。同时可以看见后续出现的窗户。
//QQ%E5%9B%BE%E7%89%8720220721165930.jpg
//更多有关Level C-218的图像
//实体
//与Level C-218的外观不同，该层级的实体分布是均匀的，每上15层楼平均遭遇一个实体。已上报的目击实体有笑魇、猎犬、尸鼠、死亡飞蛾。由于该层级狭窄且湿滑，不建议流浪者与实体展开追逐战。理智的做法是在实体被激怒或者发现你之前安静缓慢的下退至其看不见的地方，等待至少5分钟之后再继续探索，返回原处后实体将消失。这种现象出现的原因未知，推测与该层级的非线性结构有关。
//
//基地、前哨与社区
//由于该层级的非线性空间与匮乏的资源，暂时没有任何基地、前哨站或社区驻扎于此。
//
//入口与出口
//入口
//在任何有长途阶梯的层级对着阶梯切出都有一定概率到达该层级的最底层。
//更多入口待发现
//出口
//在探索足够级阶梯后，窗户将出现，对着窗户切出将到达Level 63或Level 998
//试图从最底层的地板切出将有小概率到达Level 35。
//试图从墙壁切出将有极小概率到达Level 26或Level C-173。
//更多出口待发现
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1218{}