//Level C-219
//评分: 
//+7
//+
//–
//X
// 
//
//生存难度：
//等级 4
//
// 
// 
// 
//89.jpg
//Level C-219内部图片
//
//6.jpg
//郑仁木在Level C-219的庇护所内拍摄的“天珧”照片
//
//描述
//Level C-219是一个地势低平，由沙漠覆盖的行星，围绕着恒星“天珧”（当地土著命名）转动，无自转运动，故一昼夜时间长。Level C-219上一年约等于480地球日。检测发现“天珧”散发的能量与太阳几乎相等。Level C-219全年不断地刮着大风，可见度极低，空气中粉尘含量极高，故大气层看起来是土黄的，颗粒物直径约为2.5微米，进入Level C-219必须佩戴防护措施，避免吸入粉尘。Level C-219水资源极度匮乏，全年无降水，水分只存在于地表下，当地土著发明了提取地表深层中水分的装置。白天最高地表温度达49摄氏度，昼夜温差小。此外，Level C-219表面辐射剂量达4000mSv/h，不适合生物生存。
//
//Level C-219中实体为人形生物群体，分雌雄两性，年龄在0到60岁间不等，成年身高约1.2到1.6米，成年体重约20到35公斤，大多表现出受核辐射的症状，衣物材料以薄布为主。这些实体居住在他们建造的防辐射庇护所内，庇护所包括以下设施（资料来自郑仁木）：
//
//十栋居民楼
//一家博物馆
//博物馆展品主要包括：
//旧时人们使用的物品
//动植物化石
//改善恶略环境的科研用具和科研结果
//四家超市
//两家餐厅
//三所研究院
//研究项目主要包括：
//改善环境的方法
//培育抗干旱植物
//抵抗辐射的技术
//十五所学校（包括小学，中学，大学）
//农业大棚和畜牧业用草场
//四座工厂
//轻工业为主
//一个中心广场
//该群体科技发达，改善了庇护所内土壤质量使其能够种植作物，地表有植被覆盖，已种植梧桐等树木。群体有专门语言，发明了同声传译器翻译各种语言。群体采用民主制度，文化教育发达，庇护所内有多个大型雕塑，题材多为动植物，整个群体表现出对自然的极大向往和崇拜，反对且抵触战争。法律严明。其宗教主要信仰“天珧”，当“朱狱”现象发生时，该群体会停止一切活动，在中心广场举行某种祭拜仪式。该群体定期会外出采集矿产，矿工穿着特制的防辐射服。该群体极度排斥外人，如有外人进入他们的领地，他们会将外人杀死并会在下一个“朱狱”来临时将他吃掉。不过，有一个例外，████年██月██日，流浪者郑仁木无意间闯入该群体领地，但却收到他们的欢迎，郑仁木在那里详细调查了他们的生活和历史，离开后与M.E.G.合作，为M.E.G.在Level C-219建立前哨站提供了条件。
//
//“天珧”会不定期不明原因地变成红色，并将天空染成红色，持续时间最长达73小时，土著将这一现象称为“朱狱”。暴露在红光下人会觉得不适，症状包括头晕、呕吐等，但有证据证明祭拜活动能减轻这些症状。症状随“朱狱”现象消失而消失。
//
//5.jpg
//郑仁木在Level C-219庇护所内拍摄的“朱狱”现象照片
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//- 附录一
//郑仁木与土著长者的访谈记录
//
//郑仁木：您这个星球一直是这个环境吗？
//
//长者：唉，也就二十来年，这是我以前的日记，你看看吧。
//
//长者递给郑仁木一本日记，郑仁木翻开看了看
//
//郑仁木：原来如此……
//
//一阵寂静
//
//郑仁本：那您怀念以前的生活吗？
//
//长者有些生气
//
//长者：废话！那么好的坏境，那么新鲜的空气，那么美丽的树木，那么清澈的河流，那些鸟，花，虫子，我怀念吗？你说我怀念吗！
//
//长者生气的拍着桌子，大声喊叫，随后眼里闪出泪花，望着天空，话语中带着哭腔
//
//长者：一去不复返了……
//
//郑仁本看着长者，一时语塞
//
//死一般的寂静……
//
//- 附录二
//长者的日记
//
//3984年3月21日
//今天又到公园溜了一圈，拍了不少照片，那些鸟啊，蹦蹦跳跳的，怎么能不让人爱呢？
//
//3984年7月2日
//今天谢尔顿调来我们实验室了！上次我们见面还是在大学，看来研究生活会更多彩了！:-)
//
//3984年10月2日
//朱狱又来了，停工在家宅了一天，不过也挺爽的。
//
//3984年11月2日
//最近实验室经常停电，这可是不寻常，不知道跟最近报道的资源短缺有没有关系。
//
//3985年6月18日
//那帮政客嘴里天天“核武器”“核武器”地喊着，真当他们能吓到谁一样，成天指责别的国家，我看他们是想借此发动战争掠夺资源吧，真是无语。
//
//3985年10月19日
//果然被我说中了，用一个冠冕堂皇的理由在别的国家驻军，背地里开采能源，还大搞生产，天上被他们弄得都是雾霾，水也脏的不能看，不可理喻。
//
//3985年12月31日
//疯了…他们全都疯了！为了那点该死的能源就要发核弹，还把我们都扔到所谓的“庇护所”里，我看他们脑子只剩下能源了！
//
//他们…他们竟然██████,该死！
//
//9月21日
//如果我死了，请帮我把这本日记流传下去
//
//4.jpg
//长者日记里画的画
//
//- 附录三
//无名诗人的诗
//天边闪烁的星
//是晶莹的宝石
//是人们的信仰
//指引人们走向前方
//可是
//不知何时
//星星成了人们的心灵的依托
//精神的庇护所
//成了脆弱、孤独的灵魂的避风港
//它在这乱世中闪烁着
//笑着俯瞰世间
//它在这乱世中闪烁着
//笑着俯瞰世间
//
//基地前哨与设施
//M.E.G.“蚁狮”前哨站：
//负责帮助当地土著采集矿物
//入口与出口
//入口
//在Level C-262的沙滩上站10分钟可进入Level C-219
//尚未发现其他入口
//出口
//陷入流沙中有几率进入Level C-409
//尚未发现其他出口
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1219{}