//Level C-269
//评分: 
//+9
//+
//–
//X
// 
//
//生存难度：
//等级 5
//
//不安全
//不稳定
//环境危害
//Level C-269是后室C层群的第269层。
//
//描述
//Level C-269是一片极其广阔的沙漠，沙面上有一些零散的骨骸，与一般沙漠不同的是，Level C-269的沙子颜色为灰色，而且沙子颜色会跟着对此层级的探索而逐步加深。探索的距离越远，沙子就越松软。这些柔软的沙子会使得流浪者疲惫并感到无助。该层级没有严格意义上的白天及黑夜，日月颜色永远保持灰色且难以辨认。
//
//Level C-269的天空中云层稀少且无任何颜色，不过这些云雾仍具有能够降雨的特性。这些降雨是该层级可饮用水的唯一来源。值得一提的是，降雨的时间几乎是固定的，每两次降雨的间隔大约在10天左右，每次降雨量大约在1.5毫米左右。
//
//绿洲
//在该层级中有可能会遇到“绿洲”，绿洲内长有大量植物且环境多变。绿洲内通常会出现小型湖泊。请务必注意一点，不论是湖泊中的水还是绿洲中植物均具有毒性，食用这些物品会产生持续1-5小时的腹痛，晕眩，呕吐等症状，杏仁水可以有效的缓解它们。在绿洲中有可能会出现1-3栋废弃的建筑，建筑中将存在杏仁水之类的生存物资。
//
//绿洲中的环境与事物均为灰黑色。
//
//失色现象
//在进入Level C-269后的大约48小时后会开始出现"失色"症状，携带的物品将会随时间氧化，身上的颜色也会慢慢失去。在失色的同时，流浪者体内的养分会被沙漠所吸收——用于加深自身沙子的颜色。当流浪者完全失去颜色时，其养分已被完全吸干，身体上的皮肉也被氧化，留下骨骸并化作沙漠的一部分。
//
//在失色的过程中，补充养分可缓解此类症状，但由于该症状为层级特性，故无法完全根除，只有离开该层级才能够摆脱。
//
//ds.jpg
//有关Level C-269的一张照片，发现时该照片已部分氧化。
//
//流沙坑
//有的时候，该层级内会形成一些或大或小的沙坑，这些沙坑极其危险。基于这些沙坑的特性，我们将其称为“流沙坑”。
//
//当流浪者踏入流沙坑中时，其颜色会被扭曲并快速在其身体中央汇聚为黑白颜色的漩涡。在此过程中，流浪者的位置会以一种超乎常理的方式向流沙坑中心靠近。当其位置与流沙坑中心几乎重合时，流浪者身体上的漩涡将会连带其肉体飞入流沙坑内部。一般情况下，这会导致流浪者死无全尸。
//
//海市蜃楼
//与大部分沙漠一样，Level C-269中可能会出现海市蜃楼。不过与之不同的是，Level C-269中出现的景象是固定且真实的。在海市蜃楼出现时，流浪者正前方的天空会幻化出一座金碧辉煌的宏伟神殿，流浪者可以进去进行短暂的休息，在神殿中能够发现一些物资，例如杏仁水与火盐。任何事物在神殿中均会停止褪色，但离开后会加速褪色效果，该神殿最多存在12小时。
//
//实体
//Level C-269中不存在任何实体。有传言称此层级自身就是一个实体，不过这并未被证实。
//
//基地，前哨与社区
//这一层级中没有已知的基地，前哨站和社区。
//
//入口与出口
//入口：
//Level C-60打开一扇有颜色的门有到达。
//在Level C-30被屠戮众杀死后有可能进入。
//在Level C-288中太阳再次升起之前被沙尘暴卷走可能会进入。
//在任意层级来到沙滩有机率（<0.2%）进入。
//出口:
//在出现失色状态的时候，在一片区域中切出可以来到Level C-153，但只有极小的概率。
//从特定建筑切出可能到达其他的C层群内的Level。
//在下雨时利用任何可以装水的瓶子装满一瓶水并切出可以到达Level C-7。
// 
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1269{}