//Level C-272
//评分: 
//+26
//+
//–
//X
// 
//
//生存难度：
//等级 4e - 环境
//
//不安全
//不稳定
//无常规实体危害
//Level C-272 是后室C层群的第272层，建议流浪者在做好保暖准备后探索该层级。
//
//描述：
//j41XjJ.jpg
//Level C-272的海面。
//
//Level C-272 为一片面积无限的冰原已被证实是一片冰封的海洋，海面上散落有少量的废弃船只。层级内的气温常在 -35℃ ~ -42℃ 之间，没有保暖措施的流浪者在此游荡有死于失温的风险。
//
//层级中的废弃船只多为18世纪风格的木质船只，多数因年久失修而无法使用，部分较为完好的船只会在流浪者登船后自动运作并从冰面中滑出，随后将不断向前行驶1直至流浪者下船。对于这些船只为何拥有这一能力尚无定论，关于其是否为实体的问题同样尚存争议。
//
//据目前推测， Level C-272 中仍至少存在3000艘以上能够运行的船只。流浪者有时能够发现其它正在运行的船只，但尚未有这些船只相互碰撞或碰撞其它物体的记录。
//
//Level C-272 存在周期为18.2小时的昼夜更替（其中10.6小时为白天，7.6小时为黑夜），但层级中的天空似乎长期被云层遮盖，因此流浪者无法通过日光取暖。
//
//有时层级中会有降雪，一次性降雪量从 2mm ~ 600mm 不等；极少数情况会产生暴风雪，届时层级内温度将下降至 -60℃ 或更低。
//
//层级内的多数船只资源匮乏，仅能找到极少量冰冻的杏仁水和冰冷的罐装龙肉，但部分特殊船只中能找到数目可观的物资，目前已知的相对常见的特殊船只及物资种类如下：
//
//船只种类	物资类型
//货船	大量生存必需品，如食物、饮品，衣物等。同时存在大量木箱，可拆卸作为原料或修补船只的材料
//商船	少量生存必需品，大量贵重物资，如时空水晶、火盐、寂静汁液等
//战船	大量冷、热武器2及火盐和常规火药
//采油船3	大量星云及一定量的石油与可燃冰，同时有少量现代工具；船体可拆卸作为金属资源
//基地、社区与前哨站
//M.E.G. “忒修斯”号探险船
//作为移动基地使用；
//由一艘废弃船只改造而来，因几乎翻修了全部船体而得名；
//物资充足，允许流浪者搭乘且开发私人贸易，但不接受长期居留请求；
//全副武装，与 B.F.P.F. “冬居”号交恶；
//M.E.G. 在本层级仅有该船只，并无传言所谓的“大型战船”。 ——监督者 A
//无畏先锋“冻洋大盗”号
//由一艘战船改装而来，配备有重型火力；
//目前已知有5名抛锚客和3名无面灵船员，均全副武装；
//经常掠夺流浪者的物资并杀死他们。
//B.N.T.G. “寒商”号
//由一艘货柜船改装而来；
//仅开发贸易，不允许流浪者登船。
//B.A.G. “冰蓝救援”号
//由一艘战船改装而来，配备有大型奇术装置；
//允许流浪者登船，但不允许长期居留；
//不接受私人贸易。
//第一钢铁集团“乘风”号
//由一艘采油船改造而来；
//和 B.N.T.G. “寒商”号一同行动；
//配备重型火力；
//不开放私人贸易，但经常和 B.N.T.G. “寒商”号、 M.E.G. "忒修斯"号和 B.F.P.F. "冬居"号交换物资。
//B.F.P.F. “冬居”号
//由一艘货船大幅度扩建而来，其规模已可被称为“移动岛屿”；
//M.E.G. 已派遣特工伪装为流浪者潜入M.E.G. 从未在此层级进行任何间谍活动。 ——监督者 A
//目前已知船上有普通流浪者241人、B.F.P.F. 一般人员102人、武装人员42人及管理人员3人长期居留；
//除上述人员外，有2名速切玩家协会人员暂住并提供报名服务；
//船上共配备42把自动步枪、2挺轻机枪、105把手枪、2门火炮、1门迫击炮及大量冷兵器4、3把滋水枪、2吨火盐、16加仑（约合72升）苦痛汁液]、腰果水和寂静汁液各4加仑（约合18升）用于武装；
//有1000浦式耳（约合36368升）杏仁水、18吨龙肉罐头、80磅（约合36千克）盐等必要生存物资和10浦式耳（约363.7升）星云作为储备燃料；
//储存有600贴诺克立普贴作应急使用；
//经常从废弃船只搜刮物资并扩建船只；
//与 M.E.G. “忒修斯”号交恶。
//“为什么他们对我们了如指掌？”
//
//——“冬居”号主管 Robert Lee ，有收藏灯泡的癖好，目前收藏了36个灯泡。
//
//入口与出口：
//入口：
//切入 Level C-271 中的一片冰面即可进入 Level C-272 ，该冰面已被 M.E.G. 标记；
//在 Level C-273 的暴风雪中被掩埋将在 Level C-272 的冰面上醒来；
//在 Level C-129 的水潭中溺水会在全身湿透的情况下来到 Level C-272 。
//出口：
//一直乘船向一个方向行驶，流浪者将感到气温逐渐降低，最终流浪者将抵达Level C-273；
//直接切入冰面将来到 Level C-271；
//跳入雪堆似乎有概率切入 Level 129；
//落入冰洞将到达 Level C-431；
//跳入融化的水潭将到达 Level C-129。
//作者信息
//« Level C-271 | Level C-272 | Level C-273 »
//
//Footnotes
//1. 此时的流浪者仍可以通过舵来控制船只转向。
//2. 均为18世纪的款式。
//3. 层级内极为少见的现代船只种类之一。
//4. 共241件。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1272{}