//Level C-203
//评分: 
//+25
//+
//–
//X
// 
//
//生存难度：
// 
// 
// 
//Level C-203是后室C层群的第203层。
//
//gw410h.jpg
//第一张Level C-203的照片
//
//描述
//Level C-203 的外观是一条普通的郊区街道，与Level 9相似，但层级时间停留在正午而非午夜。
//
//值得注意的是，即使处于正午，层级的天空依旧黑暗。Level C-203的空气稀薄，大气压强仅有5.414*10^4Pa(约为前厅标准大气压的一半)，且主要成分为二氧化碳。
//
//Level C-203的天空中的发光体类似于前厅。天空中的发光体会周期性的靠近或远离层级的地面。在发光体靠近的半周期内，层级内的温度将从0摄氏度飙升至102摄氏度；在发光体远离的半周期内，层级内的温度并不会急剧下降，而是从102摄氏度缓慢下降至0摄氏度。
//
//该层级几乎不含任何资源，因此M.E.G.不建议流浪者前往探索该层级。若要探索该层级，建议携带足够的探险物资。
//
//街道旁的房屋内有目击笑魇、猎犬的报告，但并未得到证实。
//
//街道上有着极少数量车辆，均与Level 49中悍马类似。
//
//基地、前哨与社区
//该层没有已知的基地、前哨或社区。
//
//入口与出口
//入口
//从Level 9或Level 11的街道意外跌倒有较大几率切出到该Level的街道。若非意外跌倒，则无法切出。
//出口
//进入街道上的悍马能够到达Level 49。
//切入房屋地下室的地面将到达Level 8。
//在地下室内徘徊足够久将有可能到达Level 6。
//对着地下室天花板切出将会到达Level 9。
//研究员阿里：“从传输过来的图像与信息来看，那个新的鸟不生蛋的Level太像Level 9了吧。”
//
//研究员文丽：“对啊，这简直一模一样。”
//
//[短暂的沉默。]
//
//[终端显示了一封来自在Level 9探索的流浪者传来的照片，照片中一大片街道突兀地
//消失了]
//
//研究员阿里：“这什么东西？”
//
//研究员文丽：“Level 9的一大片街道平白无故地消失了？”
//
//研究员阿里：“后室里这种Bug一样的事情见怪不怪了。”
//
//研究员文丽：“等等……Level C-203的发现时间与这封邮件只差了一天，它们的外观又很相似……。”
//
//研究员阿里：“巧合而……等等，你不会想说……”
//
//研究员文丽：[扎起头发，开始发邮件]“我要给总部发送信息，让他们深入调查一下。”
//
//发件人：wenli.researcher@backmail.com
//收件人：m-e-g.basementalpha@backmail.com
//主题：关于Level C-203
//申请对于Level C-203进行进一步调查，目的：研究Level C-203与Level 9可能存在的联系。
//
//研究员文丽
//
//附件：disappearoflevel9.jpg
//
//发件人：m-e-g.basementalpha@backmail.com
//收件人：wenli.researcher@backmail.com
//主题：回复：关于Level C-203
//批准，正在向Level C-203派遣探索人员。
//
//发件人：m-e-g.basementalpha@backmail.com
//收件人：wenli.researcher@backmail.com
//主题：Level C-203档案已更新
//根据“罗经点”小队的探险报告，现已更新Level C-203的档案，详情请参阅附件。
//
//附件：查看附件
//Level C-203
//评分: 
//+25
//+
//–
//X
// 
//
//生存难度：
//等级 5e - 环境
//
//不安全
//不稳定
//无实体危害
//Level C-203是后室C层群的第203层。
//
//描述
//gw410h.jpg
//第一张Level C-203的照片
//
//Level C-203在地理特征上表现为一个巨大的球体，类似于前厅所定义的类地行星。
//
//Level C-203 的行星体积约为0.631个地球，质量约为0.667个地球。土壤主要成分为氧化铁、氧化镁、硅酸盐、氧化钙与硫氧化物等，与前厅中的火星类似。
//
//Level C-203的行星被其恒星潮汐锁定1。
//
//在恒星靠近的半周期内，行星永昼面的温度将从0℃急剧升高至102℃；而在发光体远离的半周期内，层级内的温度将从102摄氏度缓慢下降至0摄氏度。
//
//在行星永夜面，气温随时间则随地理位置保持在-271.9摄氏度（接近绝对零度）到-9摄氏度之间。
//
//在永昼面与永夜面的交界处称为“黎明区”。“黎明区”的气温在-9摄氏度到0摄氏度之间波动。
//
//值得注意的是，在永夜面可以观察到许多天体。
//
//该层级几乎不含任何资源，因此M.E.G.不建议流浪者前往探索该层级。若要探索该层级，建议携带足够的探险物资。
//
//Level C-203的永昼面中心地带突兀地出现了一片街道。现已确认这片街道是由于不明原因从Level 9切出至此。此现象被认为是首次观察到的地形切出现象。
//
//与Level 9街道不同的是，此处的街道马路上似乎还有来自Level 35的悍马，推测也是地形的意外切出。
//
//街道旁的房屋内有目击笑魇、猎犬的报告但并未得到证实。已经被证伪。
//
//据推测，该Level本不存在入口，但Level 9的地形意外切出使得本Level具有了出口与入口。
//
//基地、前哨与社区
//该层没有已知的基地、前哨或社区。
//
//入口与出口
//入口
//从Level 9、Level 11的街道意外跌倒有较大几率切出到Level C-203。若非意外跌倒，则无法切出。
//出口
//进入街道上的悍马，以此到达Level 49，但强烈不建议这样做
//切入街道周围的房屋的地下室可以到达Level 8
//在地下室内徘徊足够久，有概率到达Level 6
//切出地下室天花板，将会到达Level 9
//研究员阿里：“不对劲，这个Level太不对劲了。”
//
//研究员文丽：“真的，永昼永夜、“太阳”时远时近、夜面的星星……”
//
//研究员阿里：[喃喃自语]“一个椭圆轨道、潮汐锁定的近日矮行星……”
//
//研究员文丽：“没错！！没错！！就是这个！ [急匆匆地打开电脑，开始打字]
//“必须赶快通知总部，用望远镜也好别的什么也好，必须赶快调查。”
//
//发件人：wenli.researcher@backmail.com
//收件人：m-e-g.basementalpha@backmail.com
//主题：关于Level C-203
//申请对于Level C-203进行进一步调查，目的：研究Level C-203所处空间的可能性质。
//
//研究员文丽
//
//发件人：m-e-g.basementalpha@backmail.com
//收件人：wenli.researcher@backmail.com
//主题：回复：关于Level C-203
//批准，正在向Level C-203派遣探索人员。
//
//发件人：m-e-g.overseera@backmail.com
//收件人：wenli.researcher@backmail.com
//主题：Level C-203有重大发现
//“罗经点”小队在Level C-203发现了一些重要的信息，现在Level C-203的信息会被加密。
//
//研究员文丽，你现在被任命为Level C-203的研究项目组主任，希望你能带领M.E.G.探知这个层级背后的世界。
//
//文档更新！输入 管理员密码以查看新的版本。
//
//
//作者信息
//« Level C-202 | Level C-203 | Level C-204 »
//
//脚注
//1. 即该行星一面永远面向恒星，一面永远背向恒星。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1203{}