//Level C-239
//评分: 
//+27
//+
//–
//X
// 
//
//生存難度：
//
//等級 2
//
// 
// 
// 
//Level C-239被編號為後室C層群的第239層。
//
//andre-benz-qf4Vota7_g4-unsplash.jpg
//一張攝於Level C-239內的照片，其招牌已被在此居住的流浪者更換過
//
//描述：
//Level C-239是一座面積約五百平方公里的近現代都市樣貌的層級，並且一直下著雨。該層級具有非歐基理德性質，前往該層級邊緣的嘗試。最終都會讓嘗試者到達城市的另一端。但估計該層級長25公里、寬20公里。此外層級的中心區域擁有一座高達2000公尺的高塔，這座高塔頂端不斷的放出雨雲，是該層級不斷下雨的原因。
//
//而這裡因為高塔所造成的氣候與極端天氣，正是對於路經此層級，以及目標為該層的流浪者們最大的威脅。偶發性的暴風雨除了夾帶有超過每小時100毫米的驚人雨量外，還伴隨著可達14級蒲福氏風級之狂風。這種暴風雨是對於進入該層流浪者最大的威脅。當前M.E.G.與B.F.P.F.跟部分組織，與最早到達此層級的失落一族"最初的薄暮"已在該層建立前哨，以供應流浪者們安全區。
//
//對於研究該層級的高塔，M.E.G.與B.F.P.F.以及E.P.B.都嘗試使用無人機探索高塔，卻遭到不自然的雷擊摧毀無人機，而對於大門口的破壞性實驗，則被"方塊機器人"所阻擋、並被反擊而宣告失敗。
//
//而除了"方塊機器人"此種該層特有的實體外，該層級確認到存在少量的窗戶、笑魘、悲屍、使節這些實體。
//
//我們著重在方塊機器人上，該機器人也被稱為基礎結構方塊單元。在非活性狀態下它們會呈現黑灰色的正方體方塊，長寬高為2公分，重約86公克。此情況下，它們通常會隱藏在層級的下水道、建築物屋頂等通常情況下，難以發覺的地方。
//
//在層級內的部分建築，或著區域有大規模損壞時，方塊機器人體表上會閃現藍色條紋，並與其他個體結合，在到達損壞部分後，並以自身修復損壞部分。而在它們發現主動損壞的行為時，它們會聚集在一塊，形成以電磁力驅動的電磁砲，此時它會從周圍地面取得電力，然後發射已他們自身組成的砲彈。當前尚未有人成功抵擋此類砲擊。但在變形階段的五秒鐘內，依舊有可能摧毀砲管已阻止射擊，但M.E.G.極端不推薦此種作法。M.E.G.強烈建議流浪者們避免摧毀建築物，以及迴避有大量方塊機器人聚集的場合。
//
//而大多數情況下，方塊機器人並不會理會，建築物內部的非結構性損壞，這讓我們在此擁有建立長期基地的能力。
//
//在該層級中，主要擁有幾個對於流浪者們，來說非常重要地標與設施，第一個是橫穿整個層級的大河，寬可達五百七十公尺，河水深度不明。
//
//而該條河流上，擁有橫跨都市兩岸的四道橋樑，約間隔四到五公里。在下流到達折疊邊緣的地方，該處是該層級的電力來源，水力發電廠。同時也是M.E.G.、B.F.P.F.在此層級設立的第一個前哨。用以保護該層級的電力來源。上遊數來，第二道橋樑，左側大道五公里則是"最初的薄暮"在這裡設立的基地。第三道橋樑，右側大道七公里則有黃家餐館與旅社。這三個設施是流浪者們，在沒有熟悉環境與指引的情況下，最容易到達的人類聚集地。而最下游第四道橋樑之後的地區則是工廠與倉庫區。該區域由金瞳族控制，也擁有連往Level C-239.1的入口，但不建議流浪者們接近，金瞳族對於該區域嚴格把守。
//
//而如果在路上，看到展示商品的商店，也可以進入並獲取物資。但商店是這層級的自動商店，往往並不會有流浪者聚集，也對於強大的狂風與暴雨沒有絕對的防護力。
//
//此外對於剛到達該層的流浪者們來說，他們會感受到難以想像的放鬆，但長期待在此層的流浪者，有部分則會產生抑鬱、壓抑、情緒失控，最後可能自殺。
//
//<特殊報告A-76>則是由M.E.G.與B.F.P.F.所整理的金瞳族相關報告。
//
//此外該層級，擁有幾個特殊區域，種植場、方塊製造中心、下水道。
//
//種植場
//這是該層級十分重要的區域，其中三個已被"最初的薄暮"控制，剩下最後一處由M.E.G.、B.F.P.F.、E.P.B.共同合力控制一處。這些種植場，同時也是該層級所有無人商店的食物來源。
//
//其主要以水耕摘種作物，根據破解的日誌信息可得，某位"執政官"封鎖了種植場，直到"最初的薄暮"到達為止。
//
//方塊製造中心
//方塊機器人的製造中心，也是當前M.E.G.、B.F.P.F.、E.P.B.致力破解的設施之一，目前仍然毫無成果。根據系統日誌，"執政官"刪除了所有適配武器圖譜，與鎧甲武裝等設計圖，而"最初的薄暮"早已控制了所有方塊製造中心，並在該層級中獲得高於其他人的權限。
//
//下水道
//下水道是整個層級最危險的地方，無數的水流在這裡匯流，流進中央河內。永遠不要進去。
//
//關閉檔案
//<特殊報告A-76>
//數據存取等級：低
//
//歷史價值：高
//
//組織內重要性：中
//
//<特殊報告A-76> 為M.E.G.與B.F.P.F.對於該層級的調查報告結論。該文件主要紀錄該層級的歷史與特殊發現。
//
//龍血族 派（π）是一位雌性龍血族，當前已歿。她是該層級的統治者，是昔日該層居民的神與王。派是當時龍血族的一員，卻最早脫離龍血族而居。遽聞她是因為反對奧米茄的要求，而被他追殺，最後死於奧米加帶給她的傷勢。
//
//該層級是派的龍裔"金瞳族"與她一同建設的城市，根據與我們友好的龍血族透露，她十分擅長生物體的改造，而對於智慧生物的改造更加擅長。而她對於改造物更是友好與友善，甚至被形容為對待喜愛的子嗣，甚至寵物的態度。
//
//金瞳族在她引導下飛黃騰達，並一步一步的占據C層群的宜居層級。而他們也與"大齊"發生衝突。大齊曾因為與金瞳族的戰爭，被迫摧毀了與其基地層級"桃花源"聯繫的層級。
//
//然而奧米茄的要求她處死所有的金瞳族。她拒絕了這項要求，並與奧米加發生戰鬥。最終她成功逃離追殺。然而她依舊因為傷勢過重，在返回該層級後，逝於該層級的高塔上。
//
//金瞳族的執政官，選擇自願殉死。以對這位他們的神王效忠。而最後金瞳族封閉了所有該層級的入口與控制權限等待直到復活的那一天。而大多數金瞳族撤離了層級，在其他層級建立新家。而在70年前，該層重新能被切入。金瞳族在為避免龍血族的闖入而派出一部份戰士駐守。
//
//但根據大齊人與金瞳族給予的信息，派可能正在重生，就像她的代號π一樣，是無窮的、是無理的。
//
//基地、前哨與社區
//M.E.G.與B.F.P.F.聯合基地"發電廠":
//位在河流最下游處。
//由大約九十人駐守。
//目的是守護該層級電力來源
//M.E.G.與B.F.P.F.及E.P.B.聯合前哨"種植場"：
//合計約有一百三十人駐紮。
//允許流浪者臨時避難，但暴風雨及危機結束後，會驅趕流浪者。
//目的是研究該層級的種植技術與機械。
//大齊 基地"領事館"
//位於第二道橋樑，左岸大道五公里。
//是"最初的薄暮"跟背後組織"大齊"的對外交流地。
//大約具有兩百人。
//允許流浪者在此交易。
//金瞳族觀察者前哨
//位於上游第一道橋樑右岸大到約六公里處。
//擁有八十三位駐紮者，且配備重火力。
//會庇護流浪者。但暴風雨及危機結束後，會驅趕流浪者。
//不要對其挑釁與攻擊。
//黃家餐館與旅社
//位於第三道橋樑，右岸大道七公里
//擁有大約六十位服務人員，與四十三位保安
//歡迎流浪者入住，沒有錢就要幫忙收集物資，與當洗碗工
//E.P.B.第三十六研究基地
//由M.E.G.與B.F.P.F.保護
//不歡迎流浪者
//用於研究該層的方塊機器人
//金瞳族工廠基地
//控制通往Level C-239.1的入口
//不歡迎流浪者
//控制大量方塊機器人
//除此之外，該層還具有許多未登入庫、非永久性的流浪者營地。總體來說，你可以在該層找到許多流浪者。
//
//入口與出口
//入口
//在Level C-78找到一面映照下著雨的近現代都市樣貌的鏡子，可以藉此鏡切入此層。
//在Level C-360找到繪有雨中都市的大幅畫像，可以切入此層。
//在Level C-366中找到繪有雨中都市的壁畫，可以藉由壁畫切入此層。
//在具有現代都市樣貌的層級內1，下雨時，在雨中停留並睡著，可以到達此層級。
//在Level C-7中，聆聽WORLD BEYOND的Bewitched與Witchers Tale，可以到達此層。
//在地貌為下水道或是擁有下水道環境的層級中，對於聽到雨聲最大的地方2，嘗試切出有可能到達此層。
//藉由實體81進入此層。
//在Level C-238中，對於牆壁嘗試切出，可能到達此層。
//在Level C-239.1中，由奏樂者指引出口。
//出口
//在下水道切出，會到達其他層級的下水道。
//在該層對於鏡子嘗試切出，會到達Level C-78。
//由於該層的的環境，實體81很常出現在此層級，可以藉此離開。
//對該層級的原有的電子設備嘗試切入，會到達Level C-240。
//在金瞳族工業基地中，前往Level C-239.1
//作者信息
//« Level C-238 | Level C-239 | Level C-240 »
//
//脚注
//1. 如：Level 11
//2. 如：Level 41
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1239{}