//Level C-274
//评分: 
//+25
//+
//–
//X
// 
//
//生存难度：
//等级 4e
//
//极端气候威胁
//高度稳定联系
//少量原始实体6353a1f5c6640.jpg
//Level C-274一处未完全封冻的海洋，拍摄者已失踪。
//
//Level C-274是后室C层群的第274层。由于历史久远，最早发现时间已无从知晓。
//
//描述
//Level C-274主体是被封冻海洋环绕的陆地。其中，环绕陆地的海洋液体成分主要为普通盐水，水温于1.5℃至3 ℃间浮动。海洋深度未知，推测部分地区的深度至少大于8000米。海面90%以上的区域全部结冰，且冰面深度通常超过1千米。
//
//该层级陆地基本分布在层级中心地带，分为南，北两大块，同时还有其它小部分脱离的地块和岛屿。陆地层基底由岩石与少量沙土构成，地面上方长期覆盖着数米的积雪，而且不会自然融化。
//
//层级内偶尔会出现暴风雪天气，但陆地的积雪高度并不会因此发生变化。同样的，所有尝试破坏冰层与积雪的行为，都会使被破坏的冰雪层以0.01m/h的速度缓慢恢复。
//
//所有陆地上都不存在人造建筑物，只有自然生成的山脉，丘陵与盆地等地形与无穷无尽的冻原。陆地中经常被发现埋藏在雪下的裸露矿石，如铁，金，银等，但除此之外几乎没有发现任何可用资源，包括生存必须的物资。因为这些因素的存在，所以于该层级长期居住是极端困难且弊大于利的。
//
//Level C-274内平均气温为零下28℃，且最低气温被发现达到了零下91.2℃。为了防止受到低温伤害与昏迷，来到本层级的流浪者应当做好保暖御寒措施。
//
//特性
//当流浪者进入Level C-274​后，如果长时间（约一小时到一天）处于无厚重衣物御寒，远离热源的情况下，将可能产生以下症状:
//
//◆从体内发出的明显寒意​
//◆出现幻觉，听到说话声
//​◆饥饿，口渴，疲劳等状态消失
//
//以上症状均可通过取暖，加热周围温度解除。出现症状的十分钟后，流浪者将直接陷入昏迷。而且体温瞬间冷却至环境温度，不过这种情况下的流浪者还是具有生命体征。在流浪者昏迷后，通过置身其于温暖环境下可以成功救治令其苏醒，且不会有任何后遗症状。
//
//倘若流浪者长时间​没有被发现或救治，将彻底从所在地失踪。有传闻称流浪者失踪前，其周围的积雪（或者冰块，如果流浪者昏迷在水面上的话）将发生剧烈扰动从而掩盖昏迷状态的流浪者身体。但任何在流浪者失踪地区的挖掘都没有找到失踪者的痕迹。
//
//实体
//Level C-274很少被目睹实体出现，且该层级实体几乎都是无威胁的，类似于前厅寒武纪前的生物状态1。
//除了微生物外，它们全部以死亡的尸骸形式被发现。
//
//基地、前哨与社区
//由于气候过于恶劣，本层级没有已知的基地、前哨与社区。
//
//入口与出口
//入口
//在Level C-93发生剧烈震动时切入木屋地板，有极小概率来到Level C-274
//如果你在Level C-212的火炉附近睡着并且在睡前尝试切入墙壁，有极小概率概率在Level C-274醒来
//出口
//暴风雪发生时，待在海拔1000米以上的地方就可能随时传送至Level C-205的Sigma峰2
//难以解释的是，虽然进入该层级方式困难，生存条件恶劣，缺乏必备资源，但该层级的流浪者数量远超于其它更安全，更容易抵达的层级。
//
//- 我还在。
//冷静一点，我会给你讲清楚的。
//
//
//
//我们都知道后室与前厅在空间上的大相径庭——“时空”，空间与所谓时间是密不可分的。那时间轴的差异在哪里？如果有一个层级，它与前厅有一丝的联系，自身也相对稳定，自然是研究这个问题的圣地。
//
//Level C-274与前厅太过相似了，这里的生物，地形，资源找不到任何一个后室的特征，就连唯一的，可以说比较奇怪之处——自动恢复的冰雪，与其说是超自然的表现，倒不如说是一种维持状态的机制。就像是，一个素材库……
//
//仔细对照一下吧，整个Level C-274就是雪地地球的样貌，前厅在七亿年前的休伦冰河期——既然我们从现实切出，为什么不可能发生后室切入前厅的情况？（如果不可能，我们寻找出口也没有意义了。）还记得我说的时间轴吗？这就是一个很简单的事实:Level C-274的时间与前厅错位了七亿年，并且这个层级的绝大部分特征切入到七亿年前的前厅。
//
//还有别的问题——那些诡异的昏迷是因为什么？前厅与这里的关系就是一场切入？为什么会有这么多流浪者在这里活动？如果你够聪明，这个问题答案已经有了，但我还是得告诉你我的调查成果。
//
//后室与前厅有且只有一条绝对联系:人数。前厅人数越多，概率上撞到这里的人也越多，理论而言，还可以创建一个数学公式，所以每个层级的人数与前厅人数是有紧密关联的！假如前厅没有一个人，后室怎么可能冒出个流浪者来？好巧不巧，真的发生了类似的情况。
//
//时间轴上，出现了一个七亿年前的凹陷，自然就多了一个一模一样的七亿年后的凸起。七亿年前的后室与前厅都没有人，但七亿年后……至少那时前厅有人活着是个好消息。可那个七亿年后的Level C-274空间，是七亿年前的该层级复制的过来的，根本没有人存在。
//
//前厅有人活动，尝试切入后室持续了七亿年，后室的人也探索了七亿年，在这样长的时间里，没一个流浪者来这个该死的层级，概率上讲太不可能了！所以这是个错误。而且事实也正是如此——“有个流浪者进入Level C-274”这件事早该发生了，可由于那场时间的错位，实际人数却一直为0。
//
//因为“高度稳定联系”存在，一个自然现象修正着这个矛盾——抓人到七亿年后去！呸，真是个简单的方法。它不是什么层级自我意识，它就是前厅与后室的高度联系表现。
//
//我还依稀记得当我拍下那张照片后，感到寒冷迅速裹挟着我，但意识却越来越清醒。突然眼前一黑，我倒在地上——可下一瞬间又醒过来了。我摸索着通讯设备，当我想尽一切办法看到具体时间时，我已经逃逸了七亿年……
//
//然而，处于现在的流浪者无故消失了，也产生了人数上的矛盾。于是我猜想，那些被切入七亿年后的流浪者，又有着处于现在的分身，与七亿年后的他们同步。
//
//没必要问为什么不离开这个层级，我们已经不需要费心费力去维持生命了——这算补偿吗？所以完全能呆在这个稳定的地方，每个和我一样的人都过得很幸福，我们也能够通过现在的身体与你们交流。而且，我可不希望刚离开Level C-274就被大气毒死和切入虚空。
//
//
//看完就赶紧把信件烧了取暖吧，这种材质能燃烧很久。
//
//
//
//至少，我们逃过了时间。不是吗？
//
//作者信息
//« Level C-273 | Level C-274 | Level C-275 »
//
//Footnotes
//1. 即类似真核微生物，原始藻类植物，原始树木的生物形态。
//2. Level C-205内的北极山山峰，可以在极昼期间较好地观测太阳。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1274{}