//Asset 271-C
//评分: 
//+34
//+
//–
//X
//Asset 271-C
//本文档为 后室不结盟贸易集团 的公开文档。
//j51oIx.jpg
//Asset 271-C 的街道。
//
//价值： 中等
//
//优先级： 低
//
//描述： Asset 271-C 表现为一座面积近乎无限的城市。与 Asset 11 类似，层级内的时间似乎定格在下午；但由于 Asset 271-C 的天空似乎总是阴云密布，您会发现此处较为阴暗，且气温常年保持在 -20℃ 以下。
//
//Asset 271-C 有时会有降雪，但我们从未观测到大规模降雪或暴风雪现象，不过您长期在此层级停留仍有失温的风险。
//
//Asset C-271-C 大致可分为街道、建筑与郊区三部分来介绍：
//
//街道： Asset 271-C 的街道多处被冰雪覆盖而较为光滑，部分街道已被证明动摩擦因数为0。
//
//街道两旁存在商店与自动售货机以供您获取商品，但目前已知的商品仅有冰冷的饮料和食物，因此我们建议您尽快进入建筑物探索。
//
//建筑物： Asset 271-C中的建筑物种类繁多，且不缺乏资源丰富的建筑，此处列出了我们记录的一些建筑物与对应物资：
//
//建筑种类	物资类型
//酒店	大量高级食材、饮品及其它奢侈品；可住宿
//办公楼	办公用品及大量办公电子设备（如传真机、笔记本电脑），部分办公楼通向 Asset 4
//居民楼	可住宿，可观的生存物资
//百货公司	大量商品，一应俱全
//影院	少量物资，较多放映机等电子设备
//毛坯房	不具有保暖设施，但可以找到大量建筑材料或工具，注意塔吊带来的潜在风险
//停车场	通常在地下，有时能够找到机动车
//仓库	通常依附于某些大型建筑，物资类型与建筑主要功能高度相关。1
//警局	可找到服装与少量近战武器。部分警局内有部分房间上锁。
//医院	通常有大量医疗物资。住院部可住宿。不建议进入标有“放射性”和“生化废料”的房间。
//餐厅	后厨存在多种食物（和食材），不过有部分餐厅没有供暖，使得食物被冰冻。
//网吧	网吧里有一些可以访问互联网的电脑，并具有空调以及一些自助饮料机。
//杂货铺	物资极少、甚至少于普通的商店。
//军事前哨站	通常坐落于郊区，可以发现军装2、防弹衣和大量的热兵器及其配套子弹。
//别墅	通常坐落于郊区，数量较少，建筑风格多变，最为常见的是欧洲哥特风和现代简约风。内有大量奢饰品，可居住。
//图书馆	分A座与B座。阅览室中拥有大量书籍，但仅有A座中的书籍文字可识别。书籍资料中包括该层级中的新闻资讯、文学作品与地图工具等，可用以了解层级中的基本信息。
//礼品店	实用类资源极少，仅有大量装饰性的纪念品，但供电与供暖十分稳定。有通向Asset 113-C的稳定出口。
//高级服装店	内有大量华丽精美的服饰
//学校	由东西南三栋教学楼及一个标准操场构成，东，西教学楼有三层多为教室，教室内有少量物资，南教学楼为教师办公室，内有自助热水机，顶层的校长办公室有大量物资
//这些建筑物通常保暖设施齐全（被特别标记的除外），因此我们建议您在这里探索或考虑定居。
//
//如果您发现了其他建筑物，请按照此格式进行编辑：
//
//[[row]]
//[[cell style="background-color:rgb(var(--white-monochrome)); color:rgb(var(--black-monochrome));"]] 书店 [[/cell]]
//[[cell style="background-color:rgb(var(--white-monochrome)); color:rgb(var(--black-monochrome));"]] 仅有极少量物资 [[/cell]]
//[[/row]]
//郊区： 除大量树木及冰冻的淡水湖泊外，仅有少量物资匮乏的村舍；但根据第一钢铁集团分享的资料，此处有大量的矿藏（如煤、铁、石油等）可开采。
//
//实体： 除了在建筑工地栖息的塔吊之外，尚未有其它实体的目击报告。
//
//集团基地： 本集团“C层群商人之家”设立于此，欢迎您的到来。
//
//其他组织： Asset 271-C 中仍然存在较多的大、小型组织，列表如下：
//
//M.E.G. C层群 Gamma 基地： M.E.G. 在此处设置的基地，与集团友好且经常有贸易往来。
//后室防御委员会： 与集团敌对，经常在此处收集物资并试图摧毁集团的基地。目前从Level C-20中引进了部分工业设施，并且现阶段正在尝试将在此处建设社区。
//后室财团： 与集团友好且贸易关系密切，集团定期与其开办集市，和后室重工集团共享产业园。目前同样引入了大量的工业设施和财团私兵。
//第一钢铁集团： 与集团友好且经常有贸易往来，在郊区设有瓦特级二号工业区。
//物理学家们： 在一处动摩擦因数为0的街道活动，借助此街道完成力学实验；每协调时年都会参加后室学术大会。
//速切玩家协会： 在这里的一个游乐园设有一个报名点。
//后室厨师联盟：在本地尝试利用本地气候来保存食材以及烹饪特殊食物，控制的工业产业园主要生产食品以及厨具。
//无畏先锋：它们在尝试将毛坯房群落改造成适合生长“母巢”的建筑物，受层级影响它们的长相变得与常人无异。
//网瘾少年： 他们占据了一个网吧，会在流浪者进入该网吧前对其进行检查，似乎不准备离开网吧；有大量食物储备。
//有识血肉： 一支由各个氏族成员组成的长期驻扎小队在这里建立了有识血肉贸易巢，为当地流浪者提供医疗和改造服务。
//躯 - Organ-271 ： 在郊区的深处设置的一个小型基地，出售产品并帮助他们的消费者进行装备由Asset C-156的商人协会管理；拒绝为集团提供任何技术资料或商品，但和有识血肉往来密切。
//B.A.G.冻伤救援基地： 在一座医院的-1~2层设立了大型救援点，囤积了一定量的医疗用品，并对任何流浪者进行救助。这间医院3层以上也成为B.A.G.搜救队成员的一个驻地，目前已知的编号为AS-271-A、AS-271-B与AS-271-C。
//B.F.P.F. “寒城”基地： 设置在一处居民楼密集的区域，会为流浪者安排住宿；与集团友好，但和 M.E.G. C层群 Gamma 基地交恶。
//E.P.B.“低温实验室”： 由一座没有供暖的空仓库改造而来。用于进行低温生物学实验、冰芯样本分析及高温3超导体研究等。
//后室娱乐： 位于一家百货公司内，向顾客大量出售他们的产品。
//B.B.D. 市中心广播站： 由 B.B.D. 的两支记者团队及新闻部门设立，为Asset 271-C内的流浪者传递层级内外的新闻，物资储备充足。
//K.V.Z.(后室幸存者联盟)"枕头"前哨站 : KVZ的小型前哨站，位于“杂货铺”的范围内，仅仅是为了获取资源。
//流浪者之盾(S.O.W.)"火炬"基地 : 流浪者之盾的首个在C层群的稳定基地，共32名人员，位于一家办公楼内。
//F.O.J.(Jerry的信众)"蓝色勇气"前哨站: 由13名人员组成的前哨站，占据某一家仓库。
//后室旅游集团： 占据礼品店，驻有导游，提供“旅游服务”并向流浪者出售店内的纪念品，尽管基本没有顾客。
//B.E.F（后室实体交友会）： 在此处设有物资收集站。
//U.E.C.：似乎在某处设有小型前哨；会不定期突袭M.E.G. 的基地。
//摩尔奏瓜察餐厅：后室厨师联盟的参与组织之一，与集团友好且贸易关系密切，在此层级占据有一家55层的酒店作为分设施，可以通过建筑上增设的“摩尔奏瓜察五星酒店”字样识别，会有偿为流浪者提供餐饮，客房和接待等服务。
//更多的组织等待记录。
//
//如果您发现了其它组织，请按照此格式进行编辑：
//
//* **组织名称：** 组织描述
//出入口： 您可以通过以下方式来到这里：
//
//切入 Asset 272-C 的海面；
//在 Asset 11 中将自己关入冰箱；
//在 Asset 129-C 的树林中游荡；
//在 Asset 214-C 的公路向北行驶。
//您可以通过以下方式离开这里：
//
//沿着公路向南行驶可以到达 Asset 214-C ；
//切入一片被 M.E.G. 标记的冰面会进入 Asset 272-C ；
//在冰面上滑倒有概率切入 Asset 184-C 。
//档案员信息
//« Level C-270 | Level C-271 | Level C-272 »
//
//Footnotes
//1. 需注意的是，部分仓库为空仓库，内部不储存物资。部分标注有组织徽标的空仓库为该组织专有，请勿随意进入。
//2. 不属于前厅中任何一个国家的军装样式。
//3. 此处“高温”只是指相对原来超导所需的超低温高许多的温度。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1271{}