//Level C-245
//于后室寻求真正美味！ » Level C-245
//评分: 
//+21
//+
//–
//X
// 
//
//生存难度：
//等级 3
//
//不稳定
//低风险性
//实体绝迹
//Level C-245是后室C层群的第245层。该层级内气温恒定在30℃，无实体存在，无任何天气变化。
//
//描述
//Level C-245由一个悬空的大型披萨和其四周的虚空组成。其中，虚空的面积和大小均尚不知晓。据目前现存资料推测，虚空的高及面积均为无限。流浪者在该层活动时应远离虚空部分，将活动范围控制在披萨之上，并且不要食用披萨的边角部分。
//
//披萨的表面积约为16000平方米。构成披萨的成分均为食材（例如芝士，香肠，青椒，胡椒粉），这些食材的大小均远大于正常食材，但仍可以正常食用，口感和味道也和正常食材无任何差别。
//
//jvDyJH.png
//流浪者于该层拍摄的披萨一部分。此时披萨口味为意大利番茄口味。
//
//披萨表面的温度会逐步下降，当披萨的温度降到5℃，或者被食用的部分占其整体75％时，整个披萨会在10分钟后突然上升，并在上升五十秒左右后，以极快的速度持续朝下坠去。直至完全消失在虚空中。每当披萨消失后，该层级将在5—10天内处于无物质期。在这段时间内，层级将被封锁。
//
//无物质期会持续5天。在无物质期过去后，披萨会准时出现在层级内部。但口味会进行更换。
//
//以下为少量口味更换抽样：
//
//- 关闭
//更换时间：2020/11/4
//更换前后口味对比：海鲜披萨→夏威夷风味菠萝披萨
//
//更换时间：2021/5/14
//更换前后口味对比：芝心葡式咖喱鸡肉披萨→巴厘岛披萨
//
//更换时间：2022/1/9
//更换前后口味对比：厚型披萨→薄脆披萨
//
//值得一提的是，披萨刚更换后的24小时内，其表面的芝士温度将高于120℃。在这段时间过去后，披萨的温度会立刻下降至30℃左右。意图切入的流浪者应谨记这点，避免烧伤烫伤。
//
//披萨会排斥一切灰尘。故不必担心卫生问题。可以放心食用。
//
//基地、前哨与社区
//前哨“披萨小队”（Pizza Team）
//由十五位M.E.G.特工组成。
//无据点存在。并不常驻于Level C-245。
//负责在披萨被食用到极值或其表面温度至5℃时驱散所有仍位于该层的流浪者。
//流浪者社区“披萨管理团队”（Pizza Management Team）
//由五十位拥有武装力量的流浪者组成，与M.E.G.呈盟友关系。
//会有限度的控制流浪者对披萨的食用。一定程度上防止了Level C-245内披萨被过度食用导致危险提前到来的情况发生。
//后室厨师联盟（Backroom Chefs Alliance）“西餐爱好者俱乐部分部”
//由12名热爱西餐的实体组成。
//会与流浪者分享菜肴。
//其对披萨有着疯狂的热爱，因此受到流浪者社区的严格监视。
//入口与出口
//入口
//从Level C-260的任意部分跳下，你会在落地之前切入该层级的披萨之上。
//在Level C-18饮用红酒直至醉倒。你会有一定的几率切入该层级的披萨之上。
//出口
//把现有披萨上的所有食材都尝遍。你会在咽下现有披萨中你没有尝过的最后一种食材后切入level C-124。
//吃掉一块完整的香肠，培根或者菠萝后跳入虚空。你会瞬间传送至一个随机宜居层级。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1245{}