//Level C-225
//评分: 
//+28
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
// 
//敌对实体绝迹
//Level C-225是后室C层群的第225层。
//
//O4wWJP.jpg
//Level C-255一面正在生长的墙。
//
//描述
//Level C-225是一个无限延伸的现代化城镇，每个流浪者在进入时都会随机进入到层级内部的一栋大楼中，流浪者进入的房间多为未装修过的空房，偶尔可以看见杏仁水等物资。这些大楼层数约为二十层且有未知的电力供给，但也有极少数的大楼中断绝了电力流通。大楼内部有电梯，流浪者可以使用这些电梯在大楼中上下出入，同时一些电梯会出现通往负一层的按钮，它们无法被点亮。
//
//每栋大楼的一层都是商铺，目前发现商铺种类有：早餐店、彩票店、便利店、电脑店、复印店等，在这些商铺中，它们的内部除去应有的设施以外就只有一些宣传Level C-225内部风景和宜居程度的张贴画，这些张贴画做工简单潦草，是某些流浪者的作品。
//
//电脑店中的电脑通常会处于打开的状态，且页面会附带有一个进入“level.cn.225.com”网站的快捷方式，进入这里电脑中的浏览器的收藏夹也会看见这个网站。实际上，这个网站中并没有什么值得一提的内容，只是一个充斥着大量低质量的有关于Level C-225的图片的图床，但在无特定出口的其他层级中通过电子设备打开该网页会进入此处该层级。早餐店通常能发现一些没有被吃完的早餐，似乎有人刚刚在这里吃完早餐，这里总是会有一些人的气息。彩票店里会出现一些被随意置弃的文件，它们的内容大多与该层级相关联。尽管便利店是一间真正的便利店，但这里的一些食物早已过期很长一段时间，只有一些日用品能给流浪者带来帮助。
//
//这里，植物并不以具体的方式出现，只有当流浪者对回归前厅中的生活抱有希望或是对绿色植物极度渴求的话，那么绿植们将在最靠近流浪者的一栋大楼的墙壁上冒出，绿植的种类众多，但大多数是多种植物的某种特征的集合体。这些植物蔓延速度在开始时极快，而后将会变得缓慢然后固定在墙壁上，它们有能够镇定流浪者心神的功效，通常会散发独特的芳香。每当流浪者远离这些植物一段距离并且过去二十分钟后，这些植物将会消失。尤其值得一提的是，如果流浪者与这些植物相处时间超过五小时，那么植物由原先的绿色变为暗淡的青绿色，与腐烂的植物无异，而且当植物腐烂时，它们将会散发出一种气味刺鼻的气体。流浪者不当吸入这些气体，一旦吸入这些气体，那么他们将会出现反胃、头晕脑胀甚至出现缺氧的现象。
//
//如果流浪者一直向城市边缘行走的话，那么行走距离越远，城市的延伸速度越慢，但至今没有一个人超过城市延伸的速度，即便是跟上它也做不到。原因也很简单，引用某位流浪者的话说就是：“如果哪天这个层级的延伸速度比不上人类的话，那么这个层级恐怕会瞬间崩塌。当然我不排除那个‘超能力者’会死的可能…。”
//
//当流浪者在这个层级中滞留时间将要满足二十四小时时，他们的眼前将会浮现前厅生活中的回忆。虽然一些景象对于流浪者而言是不好的回忆，但它们确实或多或少的对流浪者的情绪方面的稳定起到了一些作用。
//
//基地、前哨与社区
//鉴于该层级的性质，所以没有已知的基地、前哨与社区，但绝大多数的时间都至少会有些人待在这里。
//
//入口与出口
//入口
//- 关闭
//通过窗户进入Level 11一个名为“二二五地产”的筒子楼。
//进入Level 177中编号为225的一排座位间的出口。
//拆开Level C-113中编号为225的隐藏款层级盲盒。
//进入Level 4中一个贴满了level.cn.225.com网站广告的楼梯。
//同理，在任何人类可以生存的层级中，带有明显225字样的广告的通道都将通向Level C-225。
//出口
//在该层级停留24小时会被强制切出至一随机C层群层级。
//附录
//事实上，我们从复印店和彩票店散落的文件中找到许多手稿，它们不仅揭示了这个层级的其他面目，也向我们展现了独属于后室流浪者们的特别心境。
//
//手稿一
//
//好了好了，我现在除了写上那么一些文字还真不知道有什么可以在这里得到消遣的方法。这里真的很像我以前所居住的小区，那些在钢筋水泥的森林中扎下最深的根的小区。真是叫人怀念，我在那里生活了多久呢？我的初心失去了多久呢？恐怕它们早已经被那些钢筋水泥所筑起的不含有情感的高楼压在下面了。
//
//……
//
//不过话说回来，就在我对着这些景色陷入回忆时，那些回忆居然真正的化为了现实在我眼前展现，尽管这些回忆很短暂、很飘渺。同时它们似乎对我发出了离开的邀请，这恐怕是我的幻觉吧。
//
//要是永怀自己能够离开的希望该多好啊。
//
//手稿二
//事情还得从我刚进来时说起，因为这些大楼与我在前厅中所居住的地方很像，于是我怀念起了久违的前厅生活。就在这时，那些大楼的墙壁上忽然生长出了一些植物，它们速度极快，很快覆盖半块墙壁。实际上我并不爱欣赏植物，尤其是在后室这样的有着高度未知性的地方里，即使是再诱人的东西我也不会多看一眼，当然除了杏仁水和皇家口粮。
//
//但这次，这些植物们所焕发的生机与我之前所进入的层级内容格格不入，并非是某种特殊特征的突出体，它们之中的特征是众多植物的融合、展现，它们似乎本就不应该在这里存在。我发现我爱上了这些东西，它们给予我一种久违的感觉，一种从未见过的情感。既不是极度的绝望，也不是无谓的希望，而是切切实实的能够给我离开后室的感觉。
//
//不过也请注意，别跟这些植物待太久，当我在它们旁边睡下的时候，一种窒息感把我从刚刚获得珍宝的喜悦中拉了出来。再一看，那些绿植竟然全都表现出腐烂的姿态，这并不是一个好的象征。
//
//手稿三
//就在几小时前，我发现这个层级至关重要的一个秘密。
//
//那时我正好组建起一支小队想要探索这片偌大的城市，在互换消息时我认识到在小队中有一个进入时间比我早两个多小时的队员。尽管我们的探索一无所获，但在时间来到中午三点时，那个队员消失了，就如同“人间蒸发”般消失了，这不难做出他是被切出了这个假设。
//
//但假设总得要验证，单凭这他离奇消失一点不足以说明是被切出了，我们在队员消失的地方短暂地进行了搜索，但没有发现什么特殊的东西。之后我们遇上了另外一支小队，在简单的交涉过后我向他们提出了忽然切出的这个问题。所幸的是，他们的队伍有一个二次进入的队员，他在这里经历了约二十四小时后忽然切出到了任意的一个层级，但进来的方法就不得而知了。
//
//现在我将这个问题写在纸上，希望有能像M.E.G那样的组织能发现这篇手稿并加以验证，最后撰写进这个层级的记录里面。这也算是我为探索这个层级做出了那么一点的贡献了，我并不是什么冒险家、科学家，只是一个想为探索后室做出那么一点贡献的家伙。
//
//手稿四
//在三小时前，我不停地向这个城市的边缘走去。
//
//在三小时后，我回到原点写下这篇草稿。
//
//实际上，在那前进的三小时里，我不下五次地感受到了自身的无力与迷茫，我通常喜欢搬出概念来比对出人类之渺小，但现在不需要任何的概念、任何的比对，我的身体就自发地被大脑中模拟出来的概念而感到恐惧，这些恐惧快要渗透进我的身体里。
//
//在思考中，我发现那些藏在层级下面的东西就跟那些藏在电脑内部中、无时不刻运算的代码一模一样，它们生成着这个层级的边缘。越发探索，运算就会越发缓慢，我不敢再继续探索，那些对未知事物的恐惧让我迈不动步子。不过这也反向说明了这个层级并非是一台真正意义上的超级计算机，恐怕这整个后室都不是。它总会有个尽头，而超出尽头之人，要么成“神”，要么成“尸”。
//
//我们终会看见它的尽头的，无论是前厅的，还是后室的…。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1225{}