//Level C-268
//评分: 
//+44
//+
//–
//X
// 
//
//生存难度：
//等级 4
//
// 
// 
//少量实体
//Level C-268是后室C层群中的第268层。
//
//描述
//Level C-268在主体上是一个由大量错落复杂的隧道组成的层级，这些隧道大都十分低矮而狭窄，因此在此层级中流浪者几乎无法在舒适的情况下直立行走。
//
//上行道
//上行道是Level C-268中的第一个区域，也是绝大多数流浪者在切入该层级时第一个进入的区域。
//
//Z6vS6E.webp
//一张上行道的照片。
//
//上行道是一条笔直的隧道，宽1m，高1.3m，长度仅有约800m1，其墙壁均由不同材质的木材拼凑而成2，地面则是由土坯构成，它们无法以任何形式被破坏。
//
//上行道内不存在任何形式上的光源，但其内部依然拥有正常的光照3，原因未知。
//
//上行道内是绝对空无一物的，里面从未出现过任何物资，实体，或是其他事物，同时这里也没有任何可供切出的方式。
//
//“这鬼地方真没什么好说的，别碰墙就好了，因为上面全是木刺。”
//
//——来自M.E.G.探员Clyde的报告
//
//主干道
//主干道是Level C-268中的第二个区域，也是该层级中最大，最有探索价值的区域。从上行道穿过一扇门将会来到主干道。
//
//Z6wPmg.jpg
//拍摄于入口与主干道的交接处，照片经过加亮处理。
//
//主干道是由大量以混凝土作为墙壁的圆柱状隧道组成的区域，其宽度从2m至0.6m不等，并且同上行道一样是无法被破坏的。主干道缺少光源，其内部仅有稀少的白炽灯4进行照明，其余大部分区域都是完全黑暗的，因此在Level C-268进行探索时携带一个移动光源十分必要。主干道的空间不再如上行道那般笔直，而是及其错落复杂的，隧道可能会以任何角度弯折，弯曲，甚至垂直向上或向下。整个主干道空间呈现出一种非常典型的非欧几何空间标准，也正因如此，目前尚未有相关于该区域的三维测画和稳定记录。
//
//考虑到其非欧几何空间的特点，主干道内部的隧道随时都有可能产生位移，重组，包括以流浪者本身为中心的无限制变幻等，频率不定。该性质已经对Level C-268的探索带来了巨大困难5，这也是我们将该层级归类为生存难度等级4的主要原因之一。
//
//在罕见的情况下，你能发现隧道之间出现了“错位”的情况，即隧道与隧道之间连接不当，其交接处出现了裂隙6，尝试切入这些裂隙会使你离开Level C-268，但由于相关案例过少，我们无法确定此举会将你具体带到哪些层级，并且不排除这样做的人已经失踪的可能，因此我们强烈建议不要通过此方式离开Level C-268。
//
//主干道的温度保持在11℃~17℃之间浮动，空气湿度较大，这导致主干道的墙壁与地面时常会凝结大量水珠7，有时隧道中会出现影响视野的水雾。据报告称，主干道中会弥漫着很强烈的霉味。
//
//Z6rnW1.jpg
//快递箱。
//
//主干道内的空间大多覆盖着大量杂物与废品，同时也会随时在杂物堆里生成一些或由灰色聚乙烯袋或由硬纸板制成的快递箱，它们大小形状不一，表面均有不同程度的破损，变形与污渍。每个快递箱上都贴有一张白色标签，上面记录着该快递箱的信息，其内容大体如下:
//
//编号	BKR06042JR8
//寄	你在期待什么？9
//收	The Backrooms
//快递箱内总是会包含一些物资，但与Level 1的补给箱不同的是，这些物资的种类十分广泛，它们被描述为“可以在网购软件上购买到的”物品10，并且除了杏仁水与罐装龙肉外，几乎不会出现后室内的原生物品。值得注意的是，快递箱内的物资并非总是崭新的，有些快递箱可能在该层级内存在了相当长的时间，而这一点对食物的影响尤为突出，请在食用来自快递箱的食物之前先检查其是否变质。
//
//“这些箱子里面乱七八糟的啥都有，什么牙刷，茶叶，刀子，还有零食，种类太多了，都能列满几张A4纸。我甚至还在里面拆出来过一盒避孕套，不知道啥牌的……什？兄弟，你想啥呢？我可不卖。”
//
//——来自对一名隧道之狼成员的采访记录。
//
//
//在主干道的隧道里找到一扇崭新的，明显与该层级破败的场景不相符的不锈钢制通风口，并钻入其中，你就会来到杂货间，同时可以通过此方法原路返回，但有很大概率不会回到你进入该区域前的位置。通风口的出现十分随机且不确定性，曾有人报告称其一分钟内遇到了两个通风口，也有人在该层级中探索了数天也未遇到任何通风口。
//杂货间11
//杂货间是Level C-268中的一个房间，同时也是该层级唯一一个可供长期居住的区域。
//
//Z6h1R5.md.webp
//杂货间最初被发现时的样子。
//
//杂货间看起来是一个还未进行装潢的混凝土房屋，由五个房间和二楼一处狭小的阁楼组成，拥有稳定的Wi-Fi与水电供应，目前该区域被一个由流浪者自发组建的小型组织“隧道之狼”占有。
//
//目前杂货间已被组织隧道之狼改造为小型基地，该基地拥有：
//
//九个床的宿舍
//简易卫生间与厨房
//一个大厅，用于用餐与会议
//阁楼用于储物，并且也有一张床
//侧厅，摆有若干货架，用于与其他流浪者交易
//若流浪者有幸来到杂货间，可在此稍作整顿，以更好的状态去面对Level C-268中可能随时到来的危险。
//
//杂货间的大厅上挂着一块白色硬纸板，上面写有以下内容：
//
//欢迎来到杂货间！
//
//这里提供免费Wi-Fi，热水，食物和住宿！当然，也可以在咱这买点杂七杂八的小玩意。
//
//Z8a0ng.png
//W.O.T. - 隧道之狼
//下水道
//下水道是Level C-268的第三个区域，同时也是最难以生存的区域。
//
//Z83Rrz.md.webp
//下水道。
//
//当你逐渐深入主干道时，就会感到空气的湿度，温度，以及霉味都会显著的上升，此时如果仍然继续向下，你将会滑落到下水道。
//
//下水道的隧道由不规则网格状分布，并且不再会出现向上和向下的方向，其隧道的宽与高皆为1.5m，足够一名身材正常的成年流浪者猫腰行走。下水道的墙壁由混凝土构成，其居中位置有一条排水槽，排水槽上有铸铁制成的筛板，这些筛板无法拆卸，但有些位置会出现筛板缺失的情况，可以从中看到排水槽中流动的污水。
//
//整个下水道中都布满了令人作呕的恶臭，其墙壁上长满黑色的霉菌，地面皆是已经腐烂的厨余垃圾和藻类植物，天花板上不规则的分布着超负荷运作的日光灯，发烫的灯管导致下水道始终保持着27℃~35℃的高温与高湿度。
//
//所有从主干道通向下水道的入口都是单向的，因为其湿滑的墙壁使人无法攀登与下水道垂直的隧道，所幸的是，下水道与主干道的交接处总是会有若干钢筋制成的阶梯可供人攀爬一段距离，虽然这并不足够流浪者返回主干道，但藏在上方的隧道内可以使流浪者规避一些来自下水道的威胁。
//
//在下水道中仍有少量快递箱生成，但所有处于下水道中的食物其变质速度都会大大增加，因此在进入下水道前储备一些如罐装龙肉等不易变质的食物十分有必要。
//
//几乎每隔5~8小时，下水道就会经历一次涨潮，在涨潮期间，排水槽内的水位会逐渐上升，污水从筛板涌出，然后在大约0.6m的位置停止，3小时后，这些污水又会重新退回排水槽。经实验证明，与这些污水接触并不会对身体健康造成危害，你甚至可以安全的饮用该液体但尝试饮用该液体会导致食用者长时间的口臭，反胃，失去食欲，症状会由无到渐显，持续时间目前推测与其免疫力与摄取量有关。
//
//涨潮的威胁并不仅仅是污水上涨。下水道中存在一只高度危险性的畸形实体，并且其只在涨潮时出现并游荡，因为此实体的存在，我们强烈建议在涨潮期间进入主干道与下水道交接的隧道内以规避该实体的攻击。
//
//实体
//主干道中有少量警铃虫存在，注意不要招惹它们。
//
//在罕见的情况下可以在下水道发现井蛇，此类井蛇体型更小，体长仅有约0.6m~1.5m，并且被此种井蛇啮咬会产生与饮用了污水类似的症状，但是其发作更快，效果更显著，目前将此实体归类为井蛇的变种。
//
//蜥恶
//IETS
//
//蜥恶是Level C-268中的独有实体。
//
//Z8ERbE.jpg
//一张疑似为蜥恶的照片，但由于图片质量过于模糊，我们无法证明其是否属实。
//
//蜥恶的外貌被描述为在前厅中的两个生物：巨蜥与短吻鳄的畸形结合体，此实体对人类有着高度的恶意，并会将发现的人类当做猎物追捕，杀死并食用。
//
//蜥恶仅会在下水道的涨潮期间中出现并搜寻猎物，流浪者可通过倾听隧道内是否有响亮的划水声来判断蜥恶是否在附近。因为蜥恶有着畸形笨重的身躯，其移动速度并不快，但在涨潮期间没过小腿的污水也会对流浪者产生行动上的阻力，想要在速度上甩开蜥恶相当考验流浪者的身体素质。
//
//蜥恶的视力不佳，但是听力却十分敏锐，如果流浪者在行动过程中发出了过大的声音会快速的引起此实体的注意，定位和追踪，因此在涨潮期间请尽可能不发出声音。
//
//蜥恶有着极高的物理抗性和再生能力，目前后室中现存的武器几乎无法对其造成任何伤害，我们曾试过对该实体进行高压电击，但这仅造成了短短几秒的麻痹，而且此举彻底激怒了该实体，此次行动招致了两名M.E.G.探员的阵亡。
//
//更新12：关于蜥恶的应对方式
//我们发现了这个老怪物似乎十分惧怕干燥与辐射传热，只要用火焰或者高功率的手电筒对付这家伙就会使它的行动速度显著的减缓甚至直接停下来打湿身子，所以我们用从快递箱里拆出来的喷漆罐和打火机做了一些简易的喷火器，只要一小包火盐就能带走，欢迎来到杂货间进行选购！
//
//基地、前哨与社区
//隧道之狼
//隧道之狼是一个由流浪者自发组建的小型组织，拥有17名固定成员，并轮流提供9名成员驻扎在Level C-268。
//
//Z8a0ng.png
//隧道之狼的组织标志13，可明显发现其改自M.E.G.的旧版标志。
//
//他们由一个名为Lehr的人领导，此人同时也是杂货间的第一个发现者。隧道之狼在杂货间中组建基地，此组织对外友好，对外来的流浪者与探员免费提供食宿，并且开放交易。此组织长期活动在Level C-268中搜集资源与有用的信息，并且对Level C-268的资料提供了大量资料，我们在此对隧道之狼做出的贡献表示由衷的感谢。曾有报告称隧道之狼似乎有一种能够自由往返主干道，下水道，Level C-28之间的方式，但该组织始终对其矢口否认。
//
//目前暂未知晓隧道之狼的存在是作何目的。
//
//入口与出口
//入口
//找到并进入一个木质门框的门洞14，其墙壁和天花板将会随着流浪者的前行而变得逐渐狭窄，此时继续深入就会使流浪者切入Level C-268的上行道区域。
//在Level C-429中昏厥有较低概率在该层级的上行道区域醒来。
//出口
//在主干道持续向高处爬行有可能使流浪者到达Level 8或Level C-20，但由于该区域极不稳定的特性，尝试通过此举离开Level C-268相当困难。
//通过切入裂隙可以离开该层级，但我们不确定这会将你带向哪里，不推荐通过此举离开。
//在下水道找到一个由红砖作为墙壁的下水道井，攀上它会使流浪者从Level C-28中的随机一个下水井盖爬上来，待流浪者离开后井盖会自行关闭。
//作者信息
//« Level C-267 | Level C-268 | Level C-269 »
//
//Footnotes
//1. 流浪者在切入该层级总会出现在该区域的中心位置，因此只要朝任意方向爬行约400m即可离开该区域。
//2. 这里的墙体非常粗糙，完全没有经过任何处理。
//3. 值得注意的是，处于该区域时能见度仅有五米远，超过五米的区域均被描述为“一片漆黑”的，即使使用任何外来光源也无法改变这一现象。
//4. 白炽灯旁的墙壁总会有1~3个电源，但经实测这些电源并不稳定，时常会出现断电的情况。
//5. 且由于该层级区域的特性，已推进的探索工作几乎无法进行。
//6. 从裂隙向外看不会观测到任何事物，外面是完全黑暗的。
//7. 这些液体并非是水，并且无法采集，任何使其脱离其附着表面的行为都会使其迅速蒸发。
//8. 推测其首三个字母“BKR”为“Backrooms”的英文缩写，而后为五位随机数字和两位随机字母，暂未查明此类编号有何意义。
//9. 此处的信息总是被模糊的。
//10. 这些物品均没有任何可辨识的商标。
//11. 消歧义：本条目中的杂货间并非Level C-28中的杂物间，请注意辨别信息内容。
//12. 以下内容皆由组织隧道之狼提供，未经证实，请酌情对待这些信息。
//13. “……你要说这玩意是蝙蝠我倒觉得更像点。”——匿名流浪者。
//14. 这些门洞会无规则的出现在各个层级，据统计报告，似乎在流浪者被追赶而慌不择路的时候遇到门洞的概率会大大增加。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1268{}