//Level C-216
//评分: 
//+9
//+
//–
//X
// 
//
//生存难度：
//等级 3
//
//不安全
//不稳定
//少量实体
//Level C-216为后室C层群的第216层。
//
//描述
//4af01be915f60d83808490a0feadf87b.jpg
//其中一条人工矿洞
//
//Level C-216为处于地下的一个大型矿场，其深度无法测量。
//
//在Level C-216的中心为一坐大型的采矿基地，采矿基地内有许多的采矿设备与研究人员。基地周围有许多的大型采矿设备与灯光。
//
//在基地周围会分布出许多的分支矿洞并会向前无限延伸出许多分支，每个矿洞高约3米。矿洞内中间铺着一条矿车轨道，灯光每隔5米安装一个，矿洞内有许多的矿工。
//
//矿洞内的环境极其恶劣，温度高达30度，空气中含有大量的粉尘颗粒，不建议长时间逗留。
//
//在矿工的餐盒里可以找到1~2瓶杏仁水并在采矿基地的周围能找到氧气罐、杏仁水与安全帽。
//
//adc1ceaf67ebacae45fe6f94577d8dab.jpg
//基地中的矿工
//
//矿工大多数服装相同，佩戴着带有头戴式手电筒的安全帽，身着着比较脏的蓝色工装，脸部都戴着防尘口罩。
//
//矿工基本不会和流浪者做任何的互动，只会在自己的地方挖矿或维护设备。
//
//事故
//经过对Level C-216的多次调查，建议所有进入此层级的流浪者尽快做好准备，因为矿场内会发生随机事故，事故发生时间不定，以下三种事故为几率最大也是最严重的事故。
//
//事故1 坍塌
//当流浪者在此层级逗留时间足够的长时此事故发生几率会逐渐加大。
//
//在坍塌之前会有前兆如略微的震动、灯光闪烁、支撑柱开始掉落，这时的矿工们也开始发现异常。
//
//待前兆5分钟后矿洞开始坍塌，所有的矿工开始尖叫并逃跑，流浪者也需要尽快逃向采矿基地，在基地内不会受到坍塌造成的伤害。
//
//约10分钟后坍塌结束，这时的流浪者会感到疲劳并沉睡，待醒来时一切都恢复正常。
//
//事故2 爆炸
//当流浪者在矿洞深处时此事故的发生几率最大。
//
//在爆炸时的前兆为空气中出现煤粉与许多的难闻的气味，这时的流浪者就需要尽快朝采矿基地奔跑，待3~4分钟后一名矿工用打火机点烟时打火机引燃了空气中的易燃气体导致爆炸。
//
//爆炸的速度极快，流浪者必须全速的跑向基地的地下室内才不会受到爆炸伤害。
//
//待大约5分钟后爆炸结束，外面早已是一片废墟，这时的流浪者会感到疲劳并沉睡，待醒来时一切恢复正常。
//
//事故3 地下水泄露
//此事故无特殊条件，可能随时会发生。
//
//发生前的前兆为矿洞明显渗水、矿洞潮湿。待5~10分钟后一名矿工在敲下一块矿石后导致地下水泄露进来，流浪者要尽快的奔向基地并在基地周围搜集氧气罐后进入基地的其中一个房间将所有的缝隙封死并加固门，氧气罐备用。
//
//待20分钟后地下水开始退去，流浪者也感到疲劳并沉睡，待醒来后一切恢复正常。
//
//基地、前哨与社区
//由于此层级的特殊性，无已知基地、前哨与社区。
//
//入口与出口
//入口
//在Level C-20中用稿子敲击石头约有几率切入Level C-216中。
//在Level 8中用稿子敲击石头约有几率切入Level C-216中。
//出口
//在坚持过三次不同的事故后会自动切出Leve C-216并来到C层群的随机一个层级。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1216{}