//Level C-251
//评分: 
//+18
//+
//–
//X
// 
//
//生存难度：
//等级 2
//
// 
// 
//实体绝迹tuDg6Lsq3p8VKal.jpg
//Level C-251中向上拍摄的照片
//
//Level C-251是后室C层群的第251层。
//
//描述
//Level C-251表现为一座高压电塔，流浪者最初来到的地方到最高点的相对距离为约2680米，电塔周围没有电线或其他电塔。每隔约15米有一塔臂，长度在25-10米间。M.E.G.在部分塔臂上建立了前哨基地，为流浪者分发物资，治疗伤口，或协助其攀登。共120个塔臂。M.E.G.按顺序为塔臂命名为1-120号塔臂（其中流浪者最初来到的塔臂为1号）。
//
//Level C-251的一号塔臂并非最低点，事实证明，流浪者仍然可以从一号塔臂向下攀爬。然而，向下攀爬甚至比向上更困难。M.E.G.多次试图派遣队员向下攀爬，小队均失去联系。M.E.G.试图直接向下丢掷相机，然而相机在下落约300米后撞在电塔塔身上并失去联系。通过使用指向树脂的勘探，塔底（如果有的话）并非另一个出口，因此失去了研究价值。这方面的研究现已停止。
//
//由于Level C-251极高的高度，大部分流浪者在攀登电塔外的梯子1时会对脚底的万丈深渊感到极端恐惧。因此，前哨站的人员会极力阻止你向下看并告知你原因。Level C-251经常出现流浪者死亡事故——人员从电塔上坠落并失联可视为死亡。电塔高度越高，横截面积越小。在最后的5米中，横截面积仅为4平方米。这同时伴随着因风和体重引起的摇晃，因此这里无法安装安全绳。2
//
//基地、前哨与社区
//M.E.G.“仰望者”一号前哨
//“仰望者”一号前哨位于1号塔臂
//“仰望者”一号前哨会为流浪者分发物资，治疗伤口，或协助其攀登
//下同
//M.E.G.“仰望者”二号前哨
//“仰望者”二号前哨位于10号塔臂
//隐藏
//M.E.G.“仰望者”三号前哨
//“仰望者”三号前哨位于25号塔臂
//M.E.G.“仰望者”四号前哨
//“仰望者”四号前哨位于40号塔臂
//M.E.G.“仰望者”五号前哨
//“仰望者”五号前哨位于60号塔臂
//M.E.G.“仰望者”六号前哨
//“仰望者”六号前哨位于90号塔臂
//M.E.G.“仰望者”七号前哨
//“仰望者”七号前哨位于120号塔臂
//这是Level C-251中最后一个前哨，他们会为你的攀登做最后准备，接下来的旅途将由你自己完成
//祝你好运
//入口与出口
//入口
//Level C-98中会随机出现一个以超自然方式悬浮的梯子，顺着梯子向上爬，即可来到Level C-251
//在Level 63的冥想点处有时可以看到一架梯子，顺着梯子向上爬，可来到Level C-251
//出口
//到达塔顶会来到一个随机的安全层级
//作者信息
//« Level C-250 | Level C-251| Level C-252 »
//
//Footnotes
//1. 也是唯一一个可供攀爬的道路——除非你愿意直接攀爬电塔的铁架。
//2. 事实上，虽然你在下面可以在梯子上安装安全绳，其并不会起到太多的保护作用——众多的事故报告表明了这点。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1251{}