//Level C-284
//评分: 
//+55
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
//安全
//不稳定
//无有害实体
//Level C-284是后室C层群的第284层，表现为一座老旧残破的无人都市。其于2022年5月10日被来自中国的流浪者温██发现。
//
//值得注意的是，在发现了该层级后M.E.G.再也没有收到流浪者温██的任何消息，且自文档上传后所有有关该流浪者姓名的信息都会被“██”替代，复原这些信息似乎是不可能的。该文档是温██留下来的最后一篇文档，M.E.G.推测其已遭遇不测。由于不明原因，M.E.G.无法对该文档主体内容进行编辑，但即使如此文档内容依然会不定时更新，所有追踪编辑者的尝试都失败了 为了表现对逝者的尊重，M.E.G.决定不再对该文档进行改动。以下内容均为流浪者温██上传的原版文档。
//
//描述
//Level C-284是前厅中某座城市的复制品，根据流浪者温██所言，其与中国省会城市██市有着极高的相似度。该层级内没有昼夜循环，时间永远处于夜晚，气温恒定在20℃至25℃，天气多为阴天，偶有多云或晴天，气候类似于██市的暮春时节。
//
//46877c6012ac69e4.jpg
//一栋典型的Level C-284建筑
//
//该层级内的建筑的外观总是十分陈旧的，初次发现此层级的流浪者将其形容为“就好像在连绵不绝的阴雨天里发了半个世纪的霉”。几乎所有建筑的外表都布满了水渍、霉斑和苔藓，墙皮发黑起翘，玻璃灰暗开裂，偶尔会有大块墙皮和砖块从建筑物上剥落，但总是在即将砸中行人时凭空消失。路面整体潮湿且陈旧，偶尔可见积满了水样液体的坑洼，坑内的“水”已被证实为被污染的杏仁水。该层级的空气总是凉爽且潮湿，混合有绿化植物的清香，偶尔会有流浪者报告称他们“闻到了一股源头不明的水臭味和霉臭味”，目前未发现这些特殊气味对人体有任何影响。
//
//故障建筑
//作为██市的复制品，该层级的复制是粗糙的。除部分地标建筑与特殊建筑外，Level C-284的绝大多数建筑都有不同程度上的故障，如部分缺失或增生、逻辑上不可能的形状、悬浮在空中、外表模糊不清等。第一次进入Level C-284的流浪者将这些建筑描述为“就像渲染出错的3D游戏一样”。该现象越靠近城市边缘越严重，越靠近西华小区4号院则越轻微，因此目前认为西华小区4号院是该层级的核心。
//
//3075578af235a832.jpg
//一栋只剩下了骨架的建筑
//
//值得一提的是，故障建筑的内部空间是紊乱的，当流浪者向正前方直行时，他可能会发现自己正在往随机的方向移动。偶尔会有流浪者被困于其中无法逃出的报告，这些流浪者常常要等待半天至一天才能等来救援。
//
//【2022.5.12更新：所有故障建筑的入口都被单向封锁，只能出不能进。目前没有任何流浪者被困于故障建筑中，请各位流浪者放心探索，安心居住。】
//
//安全活动区
//Level C-284内的道路和土地也拥有相似的异常性质。理论上来说，该层级的面积应是无限的，然而由于各种原因（主要是菜），该层级空间结构稳定、“可以安全活动”的范围仅限于部分城市主干道、城市地标建筑、西华小区内部和部分特殊建筑，其余部分均处于程度不一的故障之中。不建议流浪者贸然进入“安全活动范围”以外的区域，这可能导致许多无法预料的危险事件发生1。另外，由于远离层级核心，三环路以外的地区常常发生极严重的故障。这里的时空是完全混乱的，任何进入其中的物体都将被该区域无处不在的时空湍流绞碎，因此请流浪者无论如何也不要试图走出城市。
//
//安全活动区的所有楼房均拥有完整的内设和内容物，且拥有无限供应的水电和稳定的WI-FI。这意味着流浪者可以在安全活动区内的建筑物中找到食物、工具、生活必需品和大量杏仁水。这些建筑的所有内容物都将在午夜0:00进行刷新。楼房里亦存在大量实体，但这些实体绝大多数性情温顺，不会主动攻击流浪者。流浪者可选择与实体和睦相处，但不建议对它们进行无理由的暴力攻击。善待他人就是善待自己，切记。
//
//目前，Level C-284内的安全活动区包括：人民路全段，天南路全段，一环路全段，二环路全段及路边所有购物商城，三环路南段（日光城购物中心至武南立交桥），光迎路全段，四生花鸟市场全域，全球购物中心全域，东部客运中心全域，西华小区全域，牛首路全段即周围建筑。在安全活动区的边缘往往有醒目标示进行提醒，请流浪者小心脚下，注意提示。“安全活动范围”正在稳定扩大中，请各位流浪者无需担心。
//
//【2022.5.13更新：新的安全活动区：春华路步行街全域，军民路全段，莎草街全段，日光城购物中心全域。请各位流浪者放心探索，安心居住。】
//
//【2022.5.20更新：出现流浪者于西华小区东部居住后罹患神经症的报告，当事人已被送至Level 1进行治疗。目前推测该异常效应的源头为“西华小区0号院”，请流浪者们注意身心健康，保持积极心态，若感到不适可通过饮用杏仁水缓解。】
//
//【2022.6.5更新：出现流浪者于二环路东南段发现未知类人形实体的报告。经确认，该实体为本层级原住民，性格温顺无攻击性，请流浪者们无需惊慌。同时，我们尚未知晓该实体在激惹状态下会有何行动，如无必要，请不要对其进行暴力攻击。】
//
//西华小区
//作为Level C-284的核心区域，西华小区全域均为安全活动区，且不存在任何故障建筑。西华小区是一个建设于上世纪80年代的老式小区，占地面积约█平方千米，首次进入该层级的流浪者温██称该区域精细且完美地还原了前厅中真正的西华小区的样貌，“连路边小商店门口贴着的对联都一模一样”。
//
//该区域内不存在有危害的实体，仅存在具有【十一效应】的钝人、悲尸、无面灵、骇笑者以小区居民的身份在其中生活，偶尔也可见具有【十一效应】的猎犬作为宠物狗或流浪狗在小区中出没，这些实体均拥有智能和交流能力。流浪者可免费在小区内获得工具和补给品，也可将小区内的无人房屋作为据点，甚至可以与小区内的实体共住一个房间——这些实体大多善良好客而且十分孤单，他们并不介意与流浪者分享房间。
//
//但这并不代表西华小区绝对安全。首先，该小区内的【十一效应】十分强大，这意味着小区内存在由实体组成的、以维护秩序为目标的暴力机关。若流浪者在小区内做了违反秩序的行动，可能招致暴力机关的逮捕、处罚甚至驱逐（通常是驱逐至安全活动区以外）。其次，在西华小区内存在着一个较危险的区域，被命名为“西华小区0号院”。该院落的位置是不确定的，每隔一段时间它就会移动至不同的地址，因此被该层级的流浪者称为“幽灵院”。该区域会对人类产生精神影响，居住在附近的流浪者常常抱怨他们“非常焦虑但又不知道为什么”、“毫无理由地感到绝望”，严重者甚至会因此罹患神经症2。饮用杏仁水可缓解和消除这一影响。
//
//试图进入西华小区0号院内部的行为是不明智的，该区域的精神影响在院落内将达到顶峰。几乎每一个走进0号院大门的流浪者都出现了严重的惊恐发作，且在离开院落后罹患不同程度的神经症。虽然该影响依然可以用杏仁水消去，但仍然建议流浪者不要进入0号院。在后室罹患神经症极有可能导致悲尸循环，即使在Level C-284也不例外。
//
//若想查阅更多西华小区0号院的相关资料，可点击下方链接↓
//
//-收起
//西华小区0号院是Level C-284中的一个危险区域，它会对进入其中的人类产生强烈的精神影响，且该影响常常是负面的。
//
//西华小区0号院的总体结构与位于西华小区东部的4号院几乎相同，但其建筑的外观较4号院更为破旧，其中的空气较层级中其他区域更加潮湿浑浊，且常常漂浮着下水道和泔水的恶臭。目前0号院中总共有1栋~5栋五座居民楼，但除4栋可以进入外，其余四座居民楼均为完全实心的水泥柱。
//
//5e483c7cbe30718c.jpg
//0号院的入口（已屏蔽有害信息）
//
//0号院的院落呈狭长的L型，周围的花坛内长着稀疏且状态不佳的绿化植物，中心的院落里总是摆着一个常见于上世纪90年代的塑料灵棚。灵棚内摆设一应俱全，有鲜花、牌位、贡品、花圈，以及作为餐桌的若干折叠桌椅。由于某种异常效应，牌位上的文字无法被阅读，死者的遗像也模糊不清，但隐约可以看出是一位年轻亚裔男性，其脸部轮廓和身材都与失踪的流浪者温██极为相似。供桌和餐桌上的食物均为塑料模型，不可食用。
//
//0号院4栋共有七层，每层有四个房间，但除了四层的000号房以外，其余房间均无法进入。试图进入的流浪者报告称可以看到门后房间的景象，但面前“有一堵坚不可摧的空气墙”。包括000号房在内，所有房间的内部风格均与生活在上世纪90年代的典型中国家庭相符。需要注意的是，阅读该房间内的所有文字信息（包括000号房门口的对联）均会对阅读者造成严重的不良影响，包括头痛、头晕、恶心、呕吐，甚至是昏厥，且过后阅读者往往会忘记这些内容。
//
//000号房的内部结构
//如前文所述，000号房内部呈现出典型的上世纪90年代中产家庭的风貌，但由于维护不佳与时间久远，房间内家居略显陈旧。房间中的灯泡可正常使用，但该房间内的空间似乎会吸收光线，这导致房间内的光线总是灰暗的。前来调查的温██称，这个房间的气味就像“潮湿发臭的脏地毯”，“像极了Level 0里的味道”，尽管该房间中没有铺设任何地毯。该房间的大致结构为两室一厅、一厨一卫。
//
//春联
//张贴于000号房门口的对联。该对联为非常普通的量产春联，在前厅的商店中随处可见，红色底纸烫金文字，文字上画有祝贺鼠年吉祥的花纹。但其内容有明显异常，且对仗完全不工整。为避免信息危害，本页面不展示照片，仅列出内容：
//
//上联：你去哪里了
//
//下联：我们好担心
//
//横批：快回家吧
//
//值得注意的是，对联的横批中央黏贴着一张2寸大小的黑白人像，其面目已被泪水浸泡得模糊不清，只可知其为一名成年的亚裔男性。经过对比，相片中人物的身材、衣着、脸部轮廓等都与院落灵堂中的遗像相符，疑似为同一人。
//
//奖状
//张贴于000号房客厅内的奖状，其主人为温██。根据内容可知，该奖状为温██在小学三年级时获得，但与对联一样，其内容有非常明显的异常。为避免信息危害，本页面不展示照片，仅列出内容（已编辑危害信息）：
//
//奖 状
//
//亲爱的 温██ 同学：
//
//您在2020.5.17的切入事件中，与朋友一起落入后室Level 0。在后室中，您充分发挥了自己的幼稚和不熟练，成功地令您的朋友在Level 0游荡3天后脱水衰竭致死。为了感谢您的帮助和支持，您的朋友【已编辑】特地赠与您无耻的背叛者 杀人凶手 【已编辑】称号，望您再接再厉，继续努力！
//
//你为什么活着
//快点去死去死去死去死死死死死死死死死
//2020.5.20
//
//合影
//摆放于000号房客厅茶几上的合影，共有两张。
//
//第一张合影：一张全家福。根据背景，该照片可能摄于前厅某公园的喷泉前，其上共有五人，分别为一对老年夫妻、一对青年夫妻以及一位10岁上下的少年。其中，老年夫妻与青年夫妻的面容似乎被泪滴晕染，模糊不清，而少年的面容则被黑色圆珠笔狠狠涂抹。其右下角有两行手写文字：
//过去的残渣
//我抛弃了他们。我背叛了他们。
//
//第二张合影：一张三人合照，背景为一个宽阔的黄色房间，其地毯和墙纸的样式与Level 0高度相似。其中，左一男性的脸被一个黄色的笑脸=）覆盖，左二男性的脸被血渍污染，左三男性的面容被黑色圆珠笔狠狠涂抹。其右下角有两行手写文字：
//前厅生活的毕业典礼
//他们死在了我面前。是我害死了他们。
//
//两张合影的背后都有同样的打印文字：欢迎来到后室，你永远和最后的家园。
//
//第一个卧室
//第一个卧室位于000号房入口的东南面，为一间双人卧室。卧室内有一张双人床，以及衣柜、书桌、梳妆镜等家具。双人床上放有两套成年男性的衣物，其中一套被油漆染成了黄色=），另一套被溅上了大量血迹。
//
//4ef62f231bd93dcd.png
//卧室内墙纸的图案（用画图软件复原）
//
//该卧室是整个000号房被破坏得最严重的房间，房内布满了飞溅式的血迹，每个家具的表面，包括墙纸上，都留有深刻的野兽爪痕和咬印。该卧室也是整个000号房中唯一铺了墙纸的房间，墙纸图案是无数被划了红色大叉的黄色笑脸=）。前来调查的温██报告道，他刚一踏进卧室就感到了“一股前所未有的恐惧和狂怒，我几乎要发疯了”。
//
//第二个卧室
//第二个卧室位于000号房入口的西面，为一间单人卧室。房间布置简朴，仅有书桌、椅子、衣柜以及一张单人床。值得注意的是，单人床上有一个巨大的黑洞，其大小足以装进一个成年男性。黑洞内部似乎是无限的，且偶尔会闪过Level 0的景象。尚不知进入其中会去向哪里。
//
//前来调查的温██报告道，他在这个房间里感到“极其绝望，几乎丧失了活下去的勇气”。并且他声称他听见自己耳边有一个模糊的男声在哭诉，内容大致为“这里是哪，我想回家”。
//
//卫生间
//典型的老式小区卫生间，内部略显肮脏和陈旧。供水设施完好，但水龙头内只会流出腐败的血液，流浪者温██称，其气味极其浓烈，“仿佛一种潮湿地毯和腐烂墙纸的混合物，在阴暗潮湿的角落发酵了至少一星期”。关闭卫生间大门并打开卫生间顶灯后，卫生间将会【信息危害内容，已删除】
//
//【信息危害内容，已删除】
//【信息危害内容，已删除】
//【信息危害内容，已删除】
//【信息危害内容，已删除】
//
//
//不要啊
//这里是哪
//谁来救救我
//
//
//-收起
//实体
//普通实体
//该层级内存在的实体有笑魇、钝人、悲尸、猎犬、无面灵、死亡飞蛾（几乎全部为雄性）、骇笑者，它们大多栖息于安全活动区的楼房内。绝大多数实体性情温顺，不会主动伤害流浪者，推测其原因可能是不温顺的都死光了。
//
//偶尔地，安全活动区的楼房附近会出现亮黄色的皮肤碎片、彩色氢气球残骸、被绞碎的血肉等物品，推测可能是派对客的残骸。它们不配进入这座城市，无论它们温顺与否。这座城市中不会出现任何派对客，请流浪者们放心。
//
//【2022.6.5更新】该层级特有实体
//周期性地（大约每周一次），一只该层级特有的实体将会显现于该层级。该实体身高180cm左右，外表为一具身材高大、皮肤破溃的成年亚裔男性尸体。其总是身着破烂的探险装束，背着一个肮脏的绿色旅行包，除了外表腐烂以外，该实体的各项特征与失踪的流浪者温██都极为相似。该实体在行进过程中会用细小的声音自言自语，且内容常常是重复的。其使用的语言尚不明确，似乎并不包含在已知的人类语言中。
//
//该实体的行动有着明显的规律。他通常于20:00左右显现于东部客运中心，随后沿【东部客运中心】→【光迎路】→【二环东路】→【牛首路】→【西华小区】的路线缓慢移动。在到达西华小区后，该实体会试图进入西华小区4号院4楼404号房，并在进入房门后凭空消失。目前为止所有阻止实体前进的行动都失败了，该实体似乎拥有控制自己能否被触碰的能力。
//
//偶尔地，该实体可能会进入0号院4楼000号房。他不会在进入房间后消失，而是会跪在客厅茶几前，看着合影默默流泪。在30至60分钟后，实体将起身走向单人卧室，跌入单人床上的黑洞，然后消失。
//
//该实体性情温和，有一定智能和语言能力，且十分乐于与流浪者交流。不建议流浪者对该实体进行无理由的暴力攻击，善待他人就是善待自己，切记。
//如果可以的话，抱抱他，和他说说话，他会很开心的。
//
//基地、前哨与社区
//虽然该层级适合生存，但目前该层级内没有任何基地、前哨与社区。
//
//为什么呢？难道是这个层级的入口还不够多吗？还是这个层级不够出名？
//
//【2022.6.7更新】M.E.G.探险者总署昨夜发布了一则声明。声明称，经过分析后，他们认为该层级内存在层级之主类实体，出于安全考虑，他们暂时不会在此层级建立任何基地、前哨或社区。同时他们也呼吁其他组织和流浪者谨慎考虑将此层级作为永久定居点使用，即使对人类态度友善，一个层级之主类实体依然是难以控制的危险因素。
//
//说老实话，他们可真是一群无聊迂腐的老不死，这完全是子虚乌有的污蔑。欢迎各位流浪者来这个层级定居，Level C-284是一个宜居的层级，并且在未来将变得越来越宜居。
//
//入口与出口
//入口
//饮用【泪水饮】可导致流浪者昏迷并于Level C-284醒来。【泪水饮】可于Level 3中随机刷新，也可于Level 4的自动贩卖机中获得，本层级中的许多商店亦有该饮品出售。
//在Level 7的初始房间内有一本 两本 许多本无法被水沾湿的笔记本，阅读笔记本第284页上的内容即可进入Level C-284。
//进入Level 11的一座无人老旧建筑并在其中睡眠8小时以上，将在Level C-284安全区中的一个房间里醒来。
//在Level 188中有一扇 四扇 十扇及以上标有“C-284”字样的窗户，进入这些窗户可到达Level C-284。
//在Level fun=）中进入一扇标有“C-284”字样的老旧防盗门可到达Level C-284。此门将在击杀一名派对客后出现。
//在Level C-9中想象一座处于夜间的破败城市，有概率切入Level C-284。
//在Level C-70中进入一家名为“夜间城市Bar”的酒吧，向酒保无面灵点一杯“夜中起舞马丁尼”，将饮品饮尽后即可切入Level C-284。
//非常偶尔地，Level C-283中可能出现一面与众不同的镜子，穿过它即可到达Level C-284。该镜子的特征是外观异常陈旧，它可能是肮脏的、发霉的、蒙尘的甚至破碎开裂的。
//切入Level C-400的大门可来到Level C-284。
//在后室咖啡厅中点一杯【海盐芝士拿铁】并切入幕墙即可到达Level C-284。
//更多入口正在建设中，敬请期待。
//你们快进来啊求求你们了来个人陪陪我吧一个人在后室到处走真的好恐怖好寂寞好孤单我快死了我不要一个人我不要一个人我要人我要人我要人我要人我要人我要人我要人我要人我要人要人要人要人要人人人人人人人人
//出口
//在西华小区4号院的4栋4楼404号房的任意一张床上睡眠8小时以上，将被送入一场美好的梦。
//在安全活动区内的楼房中找到充满五彩斑斓灯光的房间，进入其中你将会来到一场派对=）
//有流浪者发现该房间的入口已被单方向封锁，可出不可进。欢迎快乐的黄衣服朋友：）来该层级玩耍，该层级的主人已经为你们准备了许多激动人心的派对小游戏：）
//从安全区中十层以上的高楼上跳下，将在坠落的途中昏迷并于Level 11醒来。
//将整罐杏仁水倾倒入天南广场内的任一水池中，随后跳入水池，即可在Level 178内的温泉旁醒来。
//用杏仁水浇灌军民路与莎草街交界处的腰果树苗将切入至Level 178.1。
//食用商店中的“电子cookie”牌饼干，将被传送至Level C-70。
//西华小区内有时会刷新一扇写有“基地”字样的白色木门，进入木门将来到Level C-285。
//有时，层级的街道上会出现一个写有“衰退神殿”的路牌，跟随路牌前进即可到达Level C-400。
//踏入安全活动区范围外的土地有极小概率切入随机层级，但并不推荐这种做法。
//理论上来说，跨越三环路并向远离市中心的方向移动一段距离后将到达蓝色通道。但由于三环外区域极端危险的特性，这似乎是不可能完成的。
//更多出口正在建设中，敬请期待。
//创 作 者 后 记
//
//hello，亲爱的流浪者，这里是本层级的创作者，眩病月3。既然你能看到这段话，那么就说明你和我们一样是拥有资格者。这段幕后花絮就当做我送你的见面礼吧，这可是没几个人知道的内部消息哦。
//
//说来惭愧，本层级是我的处女作。创作完了回头一看才发现，我的作品真是充满了各种瑕疵和缺憾呢，和后室中的其它层级完全不是一个水平，真是令人感叹。
//
//不过鉴于这是我的处女作，我就先原谅了自己吧（乐观）
//
//做完了这玩意，我终于明白为什么后室总是充斥着各种恐怖又危险的东西了。这个空间本身就是不适宜人类居住的，它们要么像Level 0一样贫瘠到了极点，要么就像Level 3一样什么乱七八糟的危险玩意都有。像Level 1或Level 11这样东西不多不少，刚好比较宜居的层级，没有一个是不需要精心设计、小心打造的。
//
//而我作为一个新人，在技术这方面着实有点不过关。就算这里是属于我的层级，我对自己领地的管理能力依然糟糕得令人绝望。
//
//正如之前所说，后室天生就比较倾向于生成陈旧破败的层级，而且由于其生成过程完全随机，层级内大概率都是bug遍地，实体横行。这个层级最初的模样就是如此，这里到处都是泥垢和霉菌，满眼都是出了故障的建筑，各种奇形怪状的玩意在其中横行阔步，然后被不知道哪里窜出来的时空湍流搅成碎片。要是就这么把它上传到M.E.G.的档案库里，它肯定能摘得“生存难度：死区”的桂冠。
//
//极不安全，极不稳定，敌意实体横行，可以说是死区中的三好学生了。这个层级再怎么说也是以我家为原型制作的啊，变成这副模样也太滑稽了，唉。
//
//这个遍地陷阱、安全区只有一点点的层级已经是我经过很多次努力的版本了，为了让这个层级更安全，我已经排除了无数bug，修复了无数故障，干烂了无数派对客，并掉了无数头发。然而就算如此，这个层级里依然有两个致命的缺陷：0号院，Level C-284特有实体。
//
//不知道为什么，我就是修不掉它们，不管我把它们删除多少次，它们都会若无其事地继续出现在层级里。鬼月说它们是从我心中流出的影子，是层级之主的灵魂在层级内的投影，只要我还存在，它们就永远不会消亡。要是他说的是真的，那这真是一个一点也不好笑的笑话。
//
//我真的一点也不希望它们出现在我的层级里，因为它们会不知羞耻地向所有流浪者展示我最不堪回首的过去。那个荒芜破旧的小院子真是恐怖得痛彻心扉，而在路上蹒跚行走的死人就是它最悲哀的注脚。
//
//0号院，第0层，那是最让我头痛的东西。它那么阴森，那么可怕，却又怎么也排除不了，它就像一场挥之不去的噩梦，梦里只有无穷无尽的黄色房间，还有嗡嗡作响的日光灯。
//
//可那里明明是我的家，我最亲切和熟悉的地方。我的家已经变了，它染上了潮湿地毯和腐烂墙纸的臭气，再也回不到以前的模样了。
//
//唉，或许真正的我早就已经死在了那个院子里，在某个归家的夜里掉进床上的空洞，一去不还。所以那个院子才那么残破，所以那个灵堂才怎么拆也拆不掉啊。因为那里在举行葬礼，那里供奉着我的灵位啊。
//
//还有那个永远在回家的死人，真是滑稽得令人落泪。
//
//“我回来了，但这里是哪”，一边这么说着，一边还执拗地往家里走，简直不可思议，太愚蠢了。
//
//他难道不知道吗，他明明清楚得很啊，其实他走在虚伪的街道上，回的也是冒牌的家。他的家人不会等他，朋友也被他害死了，他的家里只有到处弥漫的湿地毯味，和一个正在做梦的蠢蛋。
//
//真可怜啊。哈哈哈。
//
//……
//
//亲爱的流浪者，感谢你听我发了这么大一通牢骚。如果你在这个层级里看见一个衣着破烂的死人正在往家里赶，请停下脚步，抱抱他，和他说说话，他会很开心的。
//
//虽然他已经回不了家了，他在骗自己。
//
//
//
//
//哦对了，我还接了个广告来着。马上放马上放，甲方爸爸不要打我。
//
//疯狂王国的遗产™！后室玩家们的好伙伴！
//每一个新潮的后室玩家都应该拥有属于自己的作品！
//既然无法回到前厅，为什么不试着用另一种方法从后室毕业呢？
//加入我们吧，为了快乐，为了疯狂，为了向伟大的深渊献上更多欢愉！
//
//Footnotes
//1. 目前有记录的事件有：被割伤，被未知力量吹飞，被点燃并烧伤，卡入地面，切入至随机层级，剧烈头痛（回到安全区内立即缓解）。目前没有流浪者因此受到生命威胁。
//2. 主要为焦虑障碍、恐怖症与抑郁障碍，罕见强迫类障碍，未见分离类障碍及其他障碍。
//3. 我已经抛弃了原本的名字，所有关于我原名的信息都会被污染，因此在这里我只能透露我的花名，抱歉。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1284{}