//Level C-283
//评分: 
//+18
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
//非欧几里得空间
//无实体7caf5f07c8eea7dd.jpg
//该层级的一张相片，尚未知晓拍摄者是如何避免自己出现在画面中的
//
//Level C-283是后室C层群的第283层，为一个未知大小的镜子迷宫。
//
//描述
//Level C-283是一个大小未知的镜子迷宫，每根立柱上都有紫色的荧光涂料，地板为紫光灯条。每根立柱之间随机存在的镜子构成了一个复杂的迷宫。迷宫内的地形并不固定，在沿记号原路返回时发现原有的地形发生了改变，因此任何在该层级内做记号的行为被认为是无用的。该层级内的镜子是可以破坏的，破坏后镜子不会破碎，而是会保留破碎一刻镜子上反射的图像并随破坏程度大小出现不同程度的裂痕，并会在观察者离开后复原或是变成一条通路。
//该层级内基本是安静无声的，在该层级内发出的任何声音都会带来明显的回声。偶尔的，可以在该层级内听到疑似幻听的不属于自己发出的声音，例如：
//
//一阵急促的脚步声
//刮玻璃声
//踩到碎玻璃的声音
//无法辨别的低声轻语
//目前未能成功追寻到声音的源头，也未发现任何实体存在。
//部分镜中的倒影可能会出现如下异常：
//
//行为动作镜像相反
//行为动作与实际动作存在细微差异
//镜中的人影逃出镜内视野
//表情微笑或是沮丧
//随着在该层级内时间的增长或是长时间凝视镜中的自己，其声音异常和倒影异常发生的频率会增加，且其异常程度会加剧。
//声音异常加剧如下：
//
//途经身旁的奔跑的脚步声
//身边镜子持续发出的刮玻璃的声音
//玻璃的碎裂声
//未知方向发出的哭嚎或是骇笑声
//倒影异常加剧如下：
//
//镜中人影为背后视角
//完全异于自身的行为动作
//镜中人影反复从镜子一侧跑进并从另一侧跑出
//狂笑或是沮丧地哭泣，并伴随敲击玻璃的行为
//实体：
//暂未发现该层有实体存在。
//
//基地、前哨与社区
//由于本层的性质，据点或前哨不可能被建立。
//
//入口与出口：
//入口：
//试图切入一面大小与你的身材相似的镜子将会有大概率把你带到本层。
//在Level 283找到一扇紫黑色且略显透明的门并进入即可来到本层。
//出口：
//尚未发现出口。在本层尝试自杀或切出的行为都会使你被随机传送到另外一个房间，且该房间与你之前所在的房间相同。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1283{}