//Level C-258
//评分: 
//+24
//+
//–
//X
// 
//
//生存难度：
//等级 3
//
//不安全
//不稳定
//少量实体
//描述：
//Level C-258是一片处在永久降雨中的开阔地区。wifi强度一般。该层级内的天空中不存在可辨识的光源，背景亮度较为均匀且通常维持在500-1000lx左右。有一定量的灰色云层按照同方向缓慢漂浮，但观察显示其与该层级内的降水密度无关。Level C-258内的地表平坦，一般由沥青混凝土或水泥构成，少量地面为青石砖，石子，泥土或木质材料。这些材料大多透水性不佳，但积水总是维持在相对稳定的程度，不会超过2cm。雨中的能见度较低，且推测具有不完全孤立的性质，进入本层的流浪者几乎无法遇到其他智慧个体，同行者在行进过程中同样大概率会走失，因此建议流浪者在进入前务必准备好充足的雨具与饮食。
//
//因其特殊性质，Level C-258内不存在常见的实体。该层级特有的实体被称为“无垢者”。其外形与人类一致，不存在敌意，无智慧或情感，对外界刺激反应甚微。他们通常保持面无表情的状态，身体无衣物遮挡，没有观察到其有进食或排泄的需求。由于其异常效应，流浪者难以辨识或记忆其任何特征，长时间直视会导致受到近似雨水的异常效应并产生烦躁感，进行无防护的接触也会导致同样效果。他们中的大多数会在层级中漫无目的游荡，在遭遇流浪者时可能跟随，由于杏仁水对他们的作用微乎其微且通常不具备敌意，因此建议流浪者在遭遇他们时不必感到惊慌或浪费精力攻击。
//
//尽管在视野远处通常存在较高大的山丘或建筑虚影，但Level C-258内似乎并不存在可到达的建筑或非平原地形。向着它们前进并不会缩短距离，因此其位置大多数时间可以作为稳定的参考系。以切入处为原点，以最高的塔形建筑为正北方向，流浪者向北偏西35度角左右行进17公里可以到达目前已发现的唯一一处未完全损毁的遗迹。该遗迹的主体是呈圆锥形堆放并点燃的木柴与稻草，大部分结构已经碳化破损。木柴的燃烧似乎不受雨水的物理性质或异常性质影响，木柴本身总是保持干燥，且燃烧并未进一步消耗木柴堆。木柴堆的中央疑似数千具烧焦的人形尸体，面部特征及躯干特征因严重烧灼已难以辨认，但从肢体及面部扭曲程度来看可以推测这些个体在死前遭受了剧烈的痛苦。因未知效应，试图对其结构的破坏或尝试熄灭均未成功。流浪者Quintius2718对其进行的熄灭尝试取得一定程度的成功，并导致了记录Level C-258-B，进一步实验被否决。在遗迹周围聚集了大量的“无垢者”，数量仍处于增长中。遗迹周边的“无垢者”会盘腿坐在地面上，并保持注视木柴堆。这可能给试图靠近遗迹的流浪者造成一定麻烦，但存在衣物阻隔的情况下直接踩踏他们通过是安全的。
//
//Level C-258最明显，危险系数最高的异常效应来自雨水。该层中液体状态的雨水具有溶解抽象事物的异常性质，包括但不限于：情绪，记忆，时间，知识，自我等。在带出本层后，雨水仍将具有一定的异常性质，因此受到M.E.G.与其他组织的关注。直接接触未饱和的雨水会触发其异常效应，被溶解的上述事物将具象化为不同的颜色，气味，味道和触感（详见记录Level C-258-A），并使被溶解的主体失去对应的事物。饮用杏仁水可轻微抑制溶解效应，无法彻底终止或逆转。饮下溶解饱和的雨水可少量回收溶解在其中的事物。雨水对于不同的概念的溶解度存在差异，下表提供了一些常见概念的溶解度：
//概念	溶解度（单位s/cm3）
//情绪（喜悦）	790-1310
//情绪（悲痛）	4760-6810
//情绪（恐惧）	2610-3780
//感觉（痛苦）	2930-3001
//感觉（快感）	210-408
//记忆	12800-15301
//自我（以完全形成认知为界，一般成年人记为15年）	1209-1909
//时间（生物）	1-2
//时间（无生命物质）	3004-7600
//依据不同溶解度，雨水会优先溶解具有较高溶解度的概念。因此，流浪者长时间暴露于雨水中时，通常经历4个阶段：
//
//第一阶段：流浪者的记忆会快速丢失，由于对于记忆与情绪，感觉的溶解度存在较大差异，记忆中的情绪与感觉会发生溢出，流浪者会因此变得多愁善感，并显得有些反复无常。
//第二阶段：流浪者的记忆在上一阶段已流失殆尽，余下的记忆会变得破碎无序，此时雨水将快速溶解负面情绪，流浪者会逐渐呆滞并极其困惑，短期记忆的丢失会使其不断重复一个动作。
//第三阶段：由于正面情感的溶解度与负面情感差异巨大，在负面情感几近丢失的情况下，流浪者会感到难以言喻的喜悦与祥和，脸上将出现明朗的微笑。此时流浪者的自我将遭受不可逆的受损，认知开始崩溃。
//第四阶段：这一阶段，流浪者灵魂已彻底死去。喜悦，悲伤，痛苦，困惑，罪恶将离他而去，流浪者将逐渐转变为“无垢者”，他存在过的一切历史会逐渐被雨水溶解，被他人忘却，他的一切将加入Level C-258的水循环，流淌在Level C-258里。
//
//由于其不可逆性，再次强调，流浪者在进入前务必携带具有一定历史的雨具。
//
//> 关闭
//记录一
//溶解对象：流浪者guest2189的一次生日派对的经历，可能混杂部分对于课堂的回忆
//雨水使用量（cm3）：2
//颜色：品红色
//气味：淡淡的奶油香气
//味道：甜，有奶油质感，回味略咸
//描述：（来自guest2189）“嗯，想起了蛋糕的味道。双层的水果蛋糕，铺满了动物奶油和糖霜，额，为什么上面还写着奇变偶不变？”
//
//记录二
//溶解对象：流浪者sand0082的部分经历（对象拒绝透露）
//雨水使用量（cm3）：100
//颜色：红色
//气味：辛辣的刺激性气味
//味道：芥末味，舌头有类似花椒的酥麻感与刺痛感
//描述：（来自sand0082）“（喘息）别，别，不要……（流泪）唔，好痛……（抱住头缓慢蹲下）别过来，别过来啊……（突然冷静下来）这不是我想的，不是，不是，对不起，对不起……”
//补充：sand0082在结束实验后再次申请记忆溶解测试，已否决。经过一个星期的心理疏导后恢复正常。推测雨水对记忆与情绪起到了浓缩的效果，被短时间大量摄取可能发生无法预料的精神损失。不建议使用超过30ml的雨水进行记忆溶解实验。
//
//记录三
//溶解对象：流浪者gary10322的爷爷的葬礼
//雨水使用量（cm3）：10
//颜色：深灰色
//气味：酒精的醇香，铁锈味
//味道：辣，伴随苦涩，舌尖有刺痛感
//描述：（来自gary10322）“这味道真怪。那个老头挺不错的，会带我荡秋千，打猎，偷奶奶的菜园。可惜是个酒鬼，发起疯来还硬给我灌烈酒……（沉默，低声啜泣）别说，他那瓶老酒味道还真不错。”
//
//记录四
//溶解对象：流浪者cloud&sun的一把从前厅带入的knirps x1伞
//雨水使用量（cm3）：200
//颜色：浅灰色
//气味：极淡的清新气味，温热且湿润
//味道：微咸，略粗糙
//描述：（来自cloud&sun）“总感觉喝这杯东西花了10分钟。没想起什么，硬要说的话记起来这伞经常放不干，上面的雨水流个不停。”
//补充：在场的人员模糊地认为伞的磨损被修复了，但照片显示伞无明显变化。
//
//记录五
//溶解对象：流浪者cloud&sun的一块表（型号未知，疑似从前厅带入）
//雨水使用量（m3）：0.5
//颜色：银灰色
//气味：铁锈味
//味道：微咸，带有铁锈味
//描述：（来自cloud&sun）“喝这个真的好无聊，感觉浪费了好多时间。还是没想起什么，就是感觉手腕老是湿湿的，是洗脸的时候没擦干？”
//补充：在终止实验时，研究员只发现了一些由常见金属组成的零件，在场人员均失去了投入实验时对物品外观的印象，检查录像显示放入水中的只有一把湿润的金属零件。再组装显示该物品应该为一块表。
//
//
//> 已确认
//以下记录来自Quintius2718：
//
//摄像机应该在正常工作。
//
//我还是简单解释一下这次的意图吧。不知道你们有没有读过《左传》，就是前厅那本。我本来也忘得差不多了，直到前几天切入到了这个层级。
//
//“夏大旱，公欲焚巫尪。”
//
//我从这里切出之后满脑子都是这个。整层被求来的，绝望的雨水覆盖，在千万年的冲刷下被抹掉了一切痕迹。按理说篝火要是熄了雨也就停了。要是这个假说是真的，那些考古的就有事干了。
//
//（沉默，踩踏积水）
//
//（浑浊的雨水从伞上流淌下来，融入脚底的水坑）
//
//快到了。这些空白的人越来越多了，也不知道里面有几个M.E.G.的倒霉蛋。借你的腿用下，反正你也不会再站起来了，踩断了都没事。
//
//就在前面了。还好篝火周围没有那些烦得要命的实体。先试一下普通的水。
//
//（倒水声，火势无变化）
//
//行吧，猜到了。再试试杏仁水。
//
//（倒水声，火势几乎无变化）
//
//作用也不大。
//接下来才是重头戏。
//
//（Quintius2718从背包里拿出高香并点燃，拿出酒瓶）
//
//按理说，只要具有这方面的意图就行……可我怎么这么没底呢……不管了，来都来了。
//
//（Quintius2718含住一大口酒，用力喷出）
//
//道由心学，心假香传。香热玉炉，心存帝前。真灵下盼，仙佩临轩。令臣关告，径达九天。
//
//（雨水忽然在一瞬间静止在空中，木柴堆中的火焰猛然变小，Quintius2718手中的香在一瞬间化为了灰烬。）
//
//（木柴堆中的焦尸开始挣扎，金色的阳光洒落在堆顶，无垢者们抬起了头，缓缓站起）
//
//（片刻，雨水继续降下，阳光褪去，火焰重燃，焦尸发出了一瞬的怒吼后回归平静，无垢者再次盘腿坐下，注视着木柴堆）
//
//操。
//
//Quintius2718随后申请进一步测试，已否决并对其加强监管。
//
//基地、前哨与社区
//层级的特殊性质决定了无法建立长期哨站。为利用其中的雨水资源，M.E.G.组建了特别行动小组“祈雨者”，每星期进行一次雨水采集，使用低温容器将其冻结并保存。
//
//入口与出口：
//入口：
//长时间无防护地行走在雨中有小概率进入本层。
//长时间行走在极度干旱的地区有小概率进入本层。
//脱水且情绪波动较大时有概率进入本层。
//出口：
//在木柴堆上切出将到达一个干旱缺水的层级。
//在地面上切出将坠入虚空或到达Level C-7。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1258{}