//Level C-223简体版
//Level C-223 » Level C-223简体版
//简繁
//
//此文章是为了进行繁简转换页面而建。此文繁体版本最早于2022/06/05发布，你可以藉由右下角的繁简转换按键前往繁体页面投票，由于繁体页面早于简体页面之建立，请至繁体页面投票，避免计分困难。
//我是一位M.E.G.的档案管理员，是属于信息纪录与安全部门的一员，我的责任是确保M.E.G.层级与实体条目内容的完整与直观。说实话，这份工作并非易事。我们的工作不间断，我们必须确保所有内容是正常的，以及直观。
//
//后室内部并非一成不变，有的层级会不断改变。像Level 16，当有人回报它的改变时，重新进行编撰也是我们的工作。而某些实体与某些层级，则会改变档案内容，诱骗我们。例如：派对客。
//
//Level 14则是另一回事，我们只能如此的去描写那个地方。我们每天会接到数十次层级改变的通知，而我们必须找罗经点，或是踪迹制图者去确认。
//
//很多时候是误报，但有时候某些事情，就是真的会发生。如果真的出现改变，大多数时候都会迎来悲伤的消息。
//
//我们的责任，就是让悲伤不再扩大，让牺牲与悲剧得来的信息能让更多人活下来。
//
//「让他详细描写那个基地的情况，并把那位的ID记录下来，让他之后来领报酬。」我正在审核一个新层级的档案，没时间管克罗宁。
//
//「这一个感叹词是不需要的……这个层级面积还没探勘完毕，居然擅自描写成无限……。」我开始进行漫长的更正，与建议。
//
//深红森林里又多了一个孩子
//
//Level 84里出现新的基地。是B.F.P.F.的
//
//有人回报可以从Level 54到达了Level 58。尚未确认真实性。
//
//有人从Level C-8到达了Level C-13，罗经点已经确认了真实性。
//
//一条又一条的信息，被传入了我们这里。键盘与数据库是属于我们的战场，但很少有人对于我们的存在表达感谢。
//
//「L283又被那些派对客增加了东西。」Herman又脸色发青的说。
//
//「这是这周第二十三次了？对吧！」Agnes 满脸疲惫。他们是数据库攻防组的人，他们打最多的入侵者就是派对客。
//
//「我们会处理这件事的，你们先下班吧。」他们两如此地说。
//
//虽说如此，这座办公室永不熄灯。因为恶意永远不会休息。
//
//但在离开前，我看到我的计算机上，出现了一份审核表，是属于层级纪录申请。反正多留意一会儿也不会出什么大事。我如此地想着。
//
//我重新坐下来，并打开文件。但出现在我眼前的不是常见的文字，而是图片文件。
//
//- 关闭文件
//%E7%AC%AC%E4%B8%80%E7%89%88.png
//Level C-223
//
//这啥玩意啊？！这是啥鬼？
//
//禁止摄影还是无法摄影？我可以理解那是代表宜居的绿叶、被画叉的骷髅头又是甚么？禁止死亡？无法死亡？那八人又是什么意思？旁边的是信息封锁吗？
//
//我往下翻，超正方体吗？常规方式的表达空间异常，但无法确定是无限，还是有限。人类、兔子、鸟。后室部分层级里，也有正常的兔子与鸟类。但还是先当作类似型态的实体看待好了。
//
//基地……正电子、我们MEG跟BFPF，但看不出人数，是因为被限制了吗？
//
//这入口与出口……是甚么鬼？
//
//我朝向发信者的信息栏看过去，是MEG内部发送过来的，但部门是……守密人？
//
//「嘿！Agnes你们可以过来看看这个吗？」我叫来攻防组的两人，并希望他们可以给我。
//
//「发生什么事了？」Herman闻声靠了过来。
//
//「你看看这个。」我将屏幕转向他的脸。
//
//「你需要休息。我的朋友。」他一脸严肃地看着我。
//
//我转过身子，看到的只有桌面的画面。
//
//在接下来的数十天里，我只能对着这个图片信息干瞪眼。无数次发生类似的对话。令我的精神疲惫。最终我只能向后室论坛求助。
//
//但没有人响应，好像所有人都没有看到我发的帖子一样，就连管理人员都看不到。无论如何，那怕我故意搞爆硬盘、换座位、改ID与删除文件，这该死的邮件都会寄到我这边。
//
//无论如何，我都找不到守密人这个部门的存在，我现在每天都在无视它。但它总是会自己跳出来。
//
//我不知道它是愚蠢的实体恶作剧，还是有着某种指向性的目的。我现在只能无视它。但我正在L11的大街上等人，一个自称知道这个层级的人，一位自称属于守密人的人。
//
//「很高兴。你/妳能接受邀约，我们希望你能够完成认知。」
//
//「认知？」我手上并非没有武器，杏仁水与手枪在手。至少可以拖延一两集。
//
//「我们需要被认知，而能够认知到我们的妳，是被许可的人。」宛如机械一般，毫无波动的声音。
//
//「做得漂亮！我的引路人。」监督者Kat如此地说。
//
//我因为漫长、不变的时间而腐朽，我必须到达外面，去迎接我的死期。
//
//而在我面前的是，M.E.G.的两位监督者，Stretch与Kat，他们俩人将与我一起完成我最后的工作。
//
//我身负纪录者的使命，而最后将由他们二人审理。M.E.G.早已发现这个层级很久，但它的异常特性一直阻碍着我们。去揭露它的存在。没有资格的人，一旦走出就会遗忘，拥有资格者，也无法说出、无法写下。
//
//而如今我们完成了至少能够在这里阅读的文件。
//
// 
//
//生存難度：
//
// 
// 
// 
//Level C-223。于2021年12月25完成纪录，并被信息纪录与安全部门确认其存在性。
//
//描述：
//Level C-223当前面积只能预估为无限。此外由于该层级的特殊性质，而无法更进一步确认。其整体地貌为庞大、无边界的草原与森林构成。在其中混杂杏仁水河流与湖泊。在以探勘完成的区域中，都未发现任何对于人类群体有害之物与环境。
//
//该层级中，最主要的实体是已经建立村庄的智慧兔，以及与之共存的无足鸟。以及被E.P.B.在此处养殖的电仔。
//
//该层级主要具有以下五种异常性质，遗忘与不可言以及掩饰，还有摄影失效，跟不死。
//
//1.遗忘性质，会让部分人员离开此层级的一瞬间，便失去对于该层积的认知。
//
//2.不可言性质，对于能够记忆此层情况的人来说，他们无法说出与纪录该层级的状态、信息与其他。
//
//3.掩饰性质则是，让所有从此层级带出去之物品与信息，只能被识别为另一层级出产之物品与信息。
//
//4.摄影失效，在此层级拍摄的所有图片，都会显示被损毁。
//
//5.不死特性涵盖，此层所有已探勘区域，在此层所有的生命死亡前一瞬间，都会回复原状。
//
//以上五种特性，导致多年来大型组织无法发现该层级之状况。但依然有一定数量之流浪者已经在此定居。
//
//基地、前哨与小区
//M.E.G.哨所"守密人"
//由大约20人所维护。
//其第一责任是维护M.E.G.与其他组织之和平地区。
//其第二责任是在必要的时候，带领M.E.G.重要成员到达此处。
//B.F.P.F.哨所"守密人"
//由大约10人所维护。
//其第一责任是维护B.F.P.F.与其他组织之和平地区。
//其第二责任是在必要的时候，带领B.F.P.F.重要成员到达此处。
//E.P.B.第9实验基地
//由大约5人所维护。
//其第一责任是打破该层级的自我掩饰效应。
//遵守与B.F.P.F跟M.E.G.之约定。
//无名之村庄
//有大约两百人
//一样具有守密人性质
//接受各种贸易，尤其是金属原料
//以小村庄的形式居住在该层级
//监督者-B之纪录
//
//Stretch？你还记得吗？你说过C层级的含意是Combined。而如今我们终于要到达那一步。Combined between the Human。
//
//当初我们与Andrew、Aliza、Donald Claud、Diana Stewards，还有那个想钱想疯的家伙一起组建M.E.G.。而如今我们分崩离系，商人带着他的老部下创造了B.N.T.G.。而Diana Stewards与属下因为我们的无知与无谋，离我们远去。
//
//Aliza、Donald Claud更是直接脱离了我们，甚至不惜发动战争。只有我、你、Andrew还留在这里。相信着我们能够带领流浪者们回家。
//
//而现在Aliza、Donald Claud同意了我们的请求，我们在这一层一起达成了一场美丽的宴会，也希望不会是最后一场。我们终于又重新团结，也许总有一天Diana Stewards会接受我们的道歉。为我们所有人的未来一起做出努力。
//
//入口与出口
//由于该层级的特性，只有守密人们可以被记忆，你必须经由守密人们才能到达与离开。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1223{}