//Level C-213
//评分: 
//+8
//+
//–
//X
// 
//
//生存难度：
//等级 3
//
//不安全
//稳定
//少量实体
//Level C-213为后室C层群的第213层。
//
//描述
//2c87ef1232a192a4a3362231b89d1d2a.jpg
//烟草种植园
//
//Level C-213为一个烟草种植基地并且会向四周无限延伸。此层级拥有基本的昼夜交替。
//
//Level C-213中有大面积的烟草种植地，并且每个种植地都有自动的洒水系统与除虫系统，每个种植园周围都有多名采收工人进行采收。
//
//35f09db4cf82726437f3e05aee996c1d.jpg
//晾晒房
//
//在基地周围还有大量的晾晒房，采收工人会把采收好的烟草全部都挂在晾晒房中进行晾晒。流浪者可以在里面找到许多的烟丝与晒干的烟草。经过测试，这些烟草都可以进行吸食。
//
//548dae7e7bc21c8051eae6b512e1f2d5.jpg
//制作好的雪茄
//
//总基地处有大量的工人与自动化机器，工人会把烟草制作成雪茄与香烟，每小时会生产约3000~5000支雪茄与香烟。自动化机器会把所有的上品良好的烟草挑选出来制作成雪茄或高级香烟，其余的会制作成普通香烟。
//
//此层级里的工人不会与流浪者做任何的互动，只会在自己的岗位进行工作，他们的服装大多相同。
//
//实体
//在此层级夜晚前，所有的工人都会回到基地内锁住基地大门。夜晚时会出现另一种极具攻击性实体。
//
//烟鬼为此层级夜晚出没的实体，烟鬼身体修长并且全身通黑，两只手能进行伸缩来抓捕猎物。其走过的路段会留下黑色物质，经过检测显示为焦油。
//
//烟鬼无面部五官，只有一张嘴并且会不停的大声咳嗽，会模仿人类说话但发音不标准。身体周围围绕着许多的气体，气体检测为二氧化碳，一氧化碳等。
//
//烟鬼无法奔跑，他们只会靠手臂或从口中吐出大量的焦油来抓捕或困住流浪者。一旦流浪者被抓住就会被烟鬼吐上大量的焦油包裹住，流浪者被焦油包过1~2个小时后就会成为新的烟鬼。
//
//基地、前哨与社区
//M.E.G.前哨站 “吸烟者”
//帮助流浪者度过夜晚
//消灭出没的烟鬼
//帮助白天的流浪者尽快离开
//入口与出口
//入口
//在Level C-265中走进焦油瀑布有几率切入此层级。
//在任意层级中禁止吸烟区域吸烟会切入此层级。
//出口
//在制作雪茄的地方吸光一支高级雪茄会切出此层级。
//在晾晒房内找到一些烟丝与卷烟纸卷成一支烟吸光会切出此层级。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1213{}