//Level C-248
//评分: 
//+18
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//Level C-248是后室C层群的第248层。
//
//描述
//Level C-248是一个边长100米，高5米的小型层级。层级内的白色混凝土墙壁将整个空间平均分为16个边长25米，高5米的长方体“区块”。空间内有来源不明的光照，“区块”中每面墙壁的中央有通往相邻“区块”的门框，但并没有开门洞。尽管如此，流浪者们虽无法观察到相邻“区块”的情况，但只要稍加接触就可以切入到相邻的“区块”。
//
//Level C-248的特性在于其不同的房间。每个流浪者切入的Level C-248均是独立的，不会遇见其他流浪者（除了2048号房间），切入此楼层后到达的会是16个“区块”中的其中一个，此“区块”内没有任何物体（也称为0号房间）。当你移动到下一个“区块”后，移动前已经存在的房间将向你移动的方向移动到层级的边界，若房间移动后你离开的区块为空，将会生成一个2号房间。相同编号的房间接触将叠加并生成一个新房间。例如两个2号房间叠加会生成一个4号房间，两个4号房间叠加会生成一个8号房间，而一个2号房间和一个4号房间接触则不会有任何反应。叠加效应可能是连锁的，例如两个相邻的2号房间和一个4号房间可能因为流浪者一次移动而直接叠加生成一个8号房间。目前已知编号最大的房间是2048号房间，这是此层级内唯一公用的部分，来自各自Level C-248的流浪者可以在此相遇，但通过此房间尝试进入他人的Level C-248被证明不可行。
//
//每个房间的功能各不相同，进入此层级的流浪者可以通过自身移动来生成不同的房间进行修整。由于所有房间的移动并不会连带处于其中的流浪者，因此随意走动可能无法进入想要进入的房间，移动前请深思熟虑。此外，每个房间都是独立的，新房间的生成会刷新其内部的物品，因此强烈建议将随身物品带在身上。层级内唯一一种实体是符合“第11效应”1的无面灵，他们在不同房间扮演不同职位，是完全友好的。
//
//由于此层级的结构、规则与游戏“2048”几乎一致，M.E.G建议可以通过游戏“2048”了解房间的移动和叠加机制。此外，每次离开此层级后重新进入此层级的时间会成倍增加（第一次离开此层级后你可以在2小时后重新进入，第二次离开此层级后你可以在4小时后重新进入，以此类推），因此请珍惜在此层级内的时间。
//
//- 收起房间列表
//f4ff56b139ff17eb.jpeg
//更衣室
//
//2号房间：更衣室
//一间更衣室，衣柜均未上锁，内部有可能生成各类衣物，其尺寸均与进入其中的流浪者相适配。此房间内有两个穿着奇特的健壮无面灵，暂不确定他们存在的意义。尽管两个无面灵符合“第11效应”，但不建议激怒他们，如果他们开始互相攻击，无视他们。更衣室内有一个装满杏仁水的饮水机和一个装有压缩饼干的柜子。
//
//
//b0f0dde49b20718f.jpeg
//手术室
//
//4号房间：手术室
//一间普通的手术室，中心有一张手术床。躺在手术床上将自然入睡，当你醒来时你身上的伤口将被治愈。
//
//
//
//
//0fa7bf50480562b9.webp
//浴室
//
//8号房间：浴室
//一间浴室，拥有一个卫生间，一个淋浴间，一个浴缸和一个桑拿房。
//
//
//
//
//
//
//
//e39ebb28b137b206.webp
//卧室。
//
//16号房间：卧室
//一间5星级宾馆规格的酒店房间，内有一张大床（也有报告说房间内为一张情侣房的圆床），一个电视机，一台可以正常使用的电脑等，并附赠两瓶杏仁水和一份水果拼盘。若使用房间内的座机呼叫总台可索要杏仁水、方便面等生活用品。索要的物品会在5分钟内出现在房间门内。
//
//22af137c959a426f.jpeg
//厨房。
//
//32号房间：厨房
//一间厨房，配有各类厨具和食材。餐桌上有一些现成的食品（有极低概率生成一份皇家口粮）。
//
//
//
//
//
//
//
//
//2a2859d5d10cdd3d.jpeg
//客厅
//
//64号房间：客厅
//一个现代风的客厅。所有家具均可正常使用，但电视没有信号。
//
//
//
//
//
//
//
//8213b0089020cc0d.jpeg
//泳池
//
//128号房间：泳池
//一个正常规格的泳池。由于未知原因，此房间的大小远大于外部大小。房间内有三个无面灵。分别是位于泳池左侧被称为“救生员”的实体、泳池右侧被称为“教练”的实体和泳池吧台被称为“管理员”的实体。如果你向“教练”请求，他会教你游泳。你也可以向“管理员”索要杏仁水。“救生员”不会对你作出任何反应，除非你溺水了，它会把你救起。
//
//
//
//300c0291878eff83.jpeg
//商场
//
//256号房间：商场
//一个商场，与128号房间类似，其内部空间的大小远远超过外部观测，具体大小随进入其中的流浪者而改变。此房间的无面灵分为“顾客”和“收银员”。“顾客”会游荡在房间中，如果你干扰“顾客”行动，“收银员”会将你赶走。在房间内你可以买到大部分你能在后室中获得的物品，价格往往会调整到在你接受范围内的最高价。在你挑选好商品后，你可以寻找“收银员”结账（结账方式为以物换物）。
//
//
//
//d334f395414ff232.jpeg
//影院
//
//512号房间：影院
//一间影院房间，后台的电脑中保存有“前厅”的部分影片，包括且不限于“教父”，“阿甘正传”，“肖申克的救赎”，“让子弹飞”。此房间没有无面灵。
//
//
//
//
//
//e6bc4afe0ab6fcf9.jpeg
//图书馆
//
//1024号房间：图书馆
//一个小型图书馆。房间内的书籍资料杂乱的摆放，其内容几乎涵盖所有领域，小概率会出现Level C-248本身的文档打印稿。
//
//
//
//
//
//4018b5a69e7eca25.jpeg
//终点
//
//2048号房间：终点。
//一个普通的房间。此房间连接着所有Level C-248。房间内已被其他流浪者带来的家具装饰成现代风。你可以通过切出地板回到你原来的层级。如果你尝试切入天花板，这会重制你的Level C-248。
//
//- 收起房间列表
//基地、前哨与社区
//本层级没有已知的基地、前哨与社区
//
//入口与出口
//入口
//在后室C层群内几乎任何层级找到一扇写着“2048”和“play now”字样的金属门通往Level C-248。
//出口
//在8号房间的浴缸内入睡，醒来后离开该“区块”会使你到达Level C-44。
//在16号房间打开房门会使你到达Level C-48。
//64号房间可能会出现一个迪斯科灯，打开它，然后离开该“区块”会使你到达一个派对=)
//从128号房间的泳池底部切出可到达Level C-51
//512号房间的荧幕有有一定概率呈现出梵高的《星空》。此时切入荧幕会使你到达Level C-166。
//从2048号房间的地板切出可以到达你进来前的层级。
//作者信息
//« Level C-247 | Level C-248 | Level C-249 »
//
//Footnotes
//1. 来自Level 11中的概念，它使实体的行为发生变化，使它们表现为正常的行人。这种效应会导致实体与漫游者进行互动，以达到沟通的目的。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1248{}