//Level C-295
//评分: 
//+31
//+
//–
//X
// 
//
//生存难度：
//等级 5E
//
//不安全
//不稳定
//光污染
//描述
//Level C-295表现为一片面积大小未知，由草地与戈壁滩所组成的地带，虽其环境与前厅极其相似，但其天气系统与前厅大有差异，且无昼夜循环。大多数人称其到达该层级时都认为其已回到前厅，但后续发现该层级并非前厅，且这里与前厅相比极其危险。
//
//rainbow
//彩虹，由M.E.G.的观测摄像头拍摄。
//
//经研究，该层级中的可见光光谱波长为前厅中光谱波长的近千分之一，以至于该层级中的任何可见光都将对人体造成伤害。也就是说，在该层级暴露于可见光的时间越长，遭受的伤害越大，甚至会造成一些不可逆的损伤，如放射性损伤、炎性病变、基因突变及癌症等。而短时间内可造成一些轻型症状，如恶心、呕吐与心悸等。
//
//同时，由于该层级异常的天气系统，导致暴雨成为该层级常见的天气现象。虽降雨时可减少部分可见光的照射，但身体淋湿所造成的失温对人体来说依旧致命，并且雨后光波折射所形成的彩虹对人体将造成更大伤害，且彩虹出现频率较高，危害极大。
//
//需要注意的是，该层级中的彩虹在肉眼下相较前厅而言更为艳丽，一些人可能会在此驻足观赏。但必须牢记彩虹会对人体造成极大的伤害，当目击到彩虹时请尽快离开该区域！
//
//“当我们第一次到达这里，这里是如此的美丽，说实话，我们都愿意驻扎在这里，但随后我们才发现，这里并非我们所想的那般美好。
//
//揭开它美丽的面纱，里面却是致命的面孔。它的光线刺穿我们的每一处肌肤，深入骨髓，它的糖衣炮弹使我们几乎每一个人都葬身在这里，鼻腔中的血液使我们失去血色的面庞变成猩红的色彩。但好在，我们戳穿它了，我们的探索将成为历史。现在，我们剩下的人都在这阴冷的山洞中等待着我们的终局，希望你们会记住我们吧。”
//
//——M.E.G.避光前哨，
//探索日志，节选
//
//因为该层级危险的异常性质，所以进入该层级的人应尽快找到附近的山洞以进行躲避。
//
//至于Level C-295的补给问题，曾有人试图饮用过从该层级所收集的雨水，但饮用后出现乏力、疲倦的现象。经过检测发现该液体呈弱碱性，但可饮用。所以该层级的雨水可在应急情况下饮用，但不建议长期饮用。
//
//山洞
//在该层级中拥有一些山洞，虽分布较为分散但拥有一定规律，其内部通常十分蜿蜒，目前所观测到的最浅山洞深约300米，且阴冷黑暗，以至于大部分可见光几乎无法照射甚至通过反射进入山洞内部。正因为山洞的这一特性，使得大多数人选择在该处避雨并避免可见光的照射，并且几乎所有营地都设立在山洞中。
//
//天坑
//据说在该层级的中心处拥有一直径约为10米的大坑，在该坑中的石头极其平滑，以至于该坑中的光线十分密集，且有人称天坑即为彩虹的发源地。若进入该坑中或将造成极其大的伤害，以至于转瞬间成为灰烬，但传言说该地的中心极其不稳定，到达此处即可回到前厅。虽曾有过一些人目击到天坑的相关报告，但天坑相关的任何信息都未得到证实。
//
//社区
//M.E.G.避光前哨
//M.E.G.在多数山洞中设立了前哨以提供补给与避光物品并帮助人们找到出口，同时其在山洞入口处尽量摆放显眼的标志以引导人们进入山洞。
//
//流浪者小队
//由一些失去希望的人组成的小队，目前仅剩12人。他们大部分时间在该层级外部游荡，帮助他们在外部所看到的人提供避光措施并带领他们进入最近的山洞。
//
//入口与出口
//入口
//当你在Level 0中游荡时，腐臭的地毯可能会逐渐转变为草地，此时你将感受到格栅灯闪烁着的微光逐渐变为了那一抹刺眼的万丈光芒，这便意味着你来到了Level C-295。
//
//出口
//Level C-295的一些山洞中拥有稳定的地点可用于切入Level 8，一个同样阴冷且黑暗的地方。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1295{}