//Level C-288
//评分: +47+–X
//
//
// 
//
//生存难度：
//
//死区
//
//极度难以生存
//环境极端恶劣
//没有实体危害
//Level C-288是是后室层群C的第288层。它被无边无际的沙漠所笼罩。
//
//IMG_20220421_233050.jpg
//死寂的沙漠。
//
//
//
//描述
//Level C-288是一片极度干旱的广袤的沙漠。这里被称作“干极”1，千百年来，不曾有一滴雨珠降临这片龟裂的大地。这里是生命的禁区。
//
//“这片大地不欢迎生命。”
//
//
//这里只有单调的色彩：灰蒙蒙的天空，死沉沉的白沙，炽灼灼的烈日，偶然出现在天穹上、如同幽灵般漂浮的云丝，荒山脚下嶙峋的乱石。这里是上帝创造世界设计的废稿，是一件不折不扣的失败品。
//
//
//关闭
//Level C-288勘探日志
//
//
//记录人：M.E.G.干员 史蒂夫·███
//
//
//
//我和亚历克斯在Level 35探险过程中发现了一辆从未发现过的银灰色吉普车。出于某种原因，我们打开车门并且坐了上去，在短暂的失去意识后，我们发现自己连车带人置身于一片灰蒙蒙的沙漠中。我们很快意识到这里并不是Level 46或者任何已知的沙漠层级。我们就这样误打误撞地进入了一个新的层级。
//
//
//吉普车里的油还够我们开一段路。我们驱车在沙漠里奔驰，试图寻找一丝人烟。直到油箱里的燃油耗尽，我们才发现所做的一切都是徒劳！这里根本不可能有什么前哨站和基地！有的只是……死寂。
//
//我们被困在了无边沙漠的这辆吉普车中。亚历克斯决定下车去找点吃的。我目送着他走进那边的红砂岩洞……就在他快要在我的视野中消失之际，周遭刮起了大风。我知道……那是沙尘暴的迹象。
//“回来！！”我摇下车玻璃，对他大喊。
//可是他似乎没听到；猛烈的风沙逼着我关上车窗。在灰色的狂沙吹打下，车玻璃开始出现裂痕，但愿没事……
//
//我居然奇迹般地从沙尘暴中存活了下来。但是当一切恢复平静，我重新走下吉普车，向亚历克斯前往的那个方向走去……我一无所获，所找到的只是一堆灰白色的沙子。
//
//我呆立在原地良久，全然忘记了炽灼的烈日和沙尘暴的威胁。直到……夜幕降临了。
//
//
//这一层级的夜晚比白天短许多，但是温度依然会骤降至零度以下。……我已经不在乎了……？
//
//
//
//忽然，有什么湿漉漉的东西打湿了我的脸颊。
//
//
//
//
//“下雨了！”
//
//
//“雨水”似乎是杏仁水；可是我很快注意到，这雨里，有一半是沙。
//
//
//关闭
//
//
//沙尘暴
//沙尘暴是这里的常客。它并非任何一种已知的实体，却会无情地夺走其所触及的一切实体的生命。每当沙尘暴发生时，天地仿佛融为了一体，全部被灰色的氤氲吞噬。因此，请任何流浪者在沙尘暴到来前离开本层级，或躲进荒山的岩洞中。
//
//荒山的岩洞也不是一个安全的庇护所。在狂风的风蚀作用下，任何岩石都会逐渐变脆、碎裂，最终混杂在沙漠细碎的砂粒中无法区分。因此，随着时间推移，岩洞发生坍塌的可能性将大大提高。一旦塌方发生，内部的流浪者几乎没有机会生还。
//
//对于从Level 35进入的流浪者而言，沙尘暴到来时最安全的做法是待在进来时乘坐的那辆银灰色吉普车中。然而，吉普车可能在经受数次沙尘暴后破损而失去庇护功能。
//
//
//
//“沙雨”
//
//
//
//“沙雨”是Level C-288极其罕见的一种现象。据估计，“沙雨”发生的频率可能数十年2才会有一次。流浪者的报告中提及的“沙雨”是含有约一半质量沙子的杏仁水浊液，经收集后过滤掉沙子可供饮用。而这也是本层级内几乎唯一的补给来源。
//
//
//
//基地，前哨站与社区
//鉴于本层级极端恶劣的自然环境，在本层级设立基地和前哨站是几乎不可能的。
//
//
//入口和出口
//已查明的入口：
//在Level 35发现并进入一辆银灰色的吉普车，流浪者会短暂失去意识，之后会与车辆一同来到此层级。
//在Level 46漫游并进入一处岩洞会来到此层级。
//在Level C-11.1进入一座银灰色的混凝土建筑有几率来到此层级。
//在Level C-30进入一个灰色的花岗岩洞有概率来到此层级。
//在Level C-194远离中心建筑的沙漠中尝试切入地面有微小概率来到此层级。
//出口
//很抱歉，目前并没有发现稳定出口。
//
//也许，事情并非想象中的那么糟糕？
//作者信息
//脚注
//1. 前厅中智利阿塔卡马沙漠别称也为“干极”，该地年降雨量平均小于0.1mm。1836~1945年间该地滴雨未下。
//2. 以前厅时间计。本层级中时间流逝速度尚不确定。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1288{}