//Level C-298
//评分: 
//+12
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//Level C-298 是后室C层群的第298层。
//
//描述：
//xdhzee.png
//Level C-298 的一张照片。
//
//Level C-298 似乎表现为一片城市建筑群的顶端，但试图看向地面时所能看到的似乎只有一片与天空颜色相同的虚空。这些建筑物之间的距离通常在 1m ~ 5m 左右，因此流浪者在穿越该层级时可能需要较多的技巧；该层级中存在周期为23.2小时的昼夜更替，但目前尚未观察到天气变化。
//
//这些建筑物的门窗1通常无法以任何方式开启或摧毁，少数能够被开启或摧毁的入口似乎都通向了其它层级——因此该层级被推测不存在室内结构，而所有能够看到的室内画面应均为投影或其它层级。
//
//层级中有时会出现一些明显高于其它建筑物的结构2，这些建筑物已被证实能够进入，且内部通常存在极少量物资——如杏仁水和罐装龙肉，极少数情况能够找到装着星云的容器或是电子产品。此外，这些建筑物中似乎均存在稳定的 Wi-Fi 信号。但值得注意的是这些建筑物的一些阴暗的角落中似乎存在笑魇。
//
//若流浪者不幸坠落，将有可能切入其它层级的空中，但更多的流浪者似乎不知去向。
//
//基地、社区与前哨站：
//速切玩家跑酷赛道：
//有5名裁判玩家常驻，他们似乎都很擅长在该层级穿越；
//愿意引导流浪者穿越该层级；
//定期举办比赛，闲置时期会充当跑酷技巧练习场和临时报名点；
//规划了一条跑酷线路；
//定期外出补充物资。
//B.N.T.G. “空中贸易”基地：
//有23人常驻；
//控制了一栋摩天大楼样式的建筑物；
//开放贸易并允许流浪者暂住（需缴纳物资）；
//似乎由交易保险库直接供货；
//与后室防御委员会298前哨交恶。
//后室防御委员会298前哨：
//常驻人数与基地位置尚不知晓；
//经常骚扰 B.N.T.G. “空中贸易”基地；
//乐意让流浪者加入。
//入口与出口：
//入口：
//在Level C-297的重力颠倒时坠落并切出将来到 Level C-298 ；
//在Level 11、Level C-271等具建筑群结构的层级的空中3切入建筑物墙体外部将来到 Level C-298 。
//在入口2所述层级中爬上楼顶也有几率进入 Level C-298 。
//出口：
//尝试进入建筑物，这通常会通向 Level 4 、 Level 20 等室内空间层级或 Level C-28 、 Level C-271 、 Level 11 等层级的室内；
//坠入虚空可能会切入上述层级的空中；
//击碎脚下的平面似乎会进入 Level 444 或 Level C-299 。
//有流浪者发现了 Level 998 的入口，但尚未被证实。
//作者信息
//Footnotes
//1. 这些窗户已被证明非实体。
//2. 通常相对其它建筑物高出 50m ~ 100m 。
//3. 高度不低于 50m 。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1298{}