//Level C-226
//评分: 
//+10
//+
//–
//X
// 
//
//生存难度：
//等级 5e - 环境危害
//
//不安全
//不稳定
//非实体危害
//Level C-226是后室C层群的第226层。
//
//描述
//Level C-226的建筑部分是一座由钢管焊接建造的类似工厂的建筑；但是其中大部分钢管已经生锈，断裂，外部环境则一直保持阴天的状态。
//Level C-226中所有的物品都是静止的，但是却受到了正常情况下近百倍的重力；因此，进入此层级的流浪者几乎无法移动Level C-226中的任何物品。
//
//XwgdxS.md.jpg
//“第一秒”时Level C-226的景象。
//
//Level C-226中存在大量的窗户和经过反复勘探，确认存在的唯一一只悲尸。这些窗户受到一种特殊效应，使得当流浪者在进入窗户后会传送至Level C-226中另一个窗户外1
//，并且此时的工厂与进入窗户前的工厂相比更加破败，甚至有可能发生坍塌，每跨越一次，流浪者所携带的计时设备显示的时间就会增加一秒，因此该现象被称为“跨越时间”。塌陷物可能会阻挡部分窗户，由于传送位置只会在窗户前，并不会因为阻挡而发生改变，因此在进行传送后流浪者有可能会被阻挡物挤压而死，或被突出物刺伤或刺死，由于窗户的栖息地的特殊性，所以发生突发状况的可能性大大增加。目前仅有一名误入Level C-226的流浪者离开该层级，其他人员俱已失联。
//以下是跨越第零秒至第六秒后的景象:
//
//第零秒:工厂除了有些破败外，并没有任何其他的现象。
//第一秒:工厂最高处的烟囱发生坍塌，其他部分并无现象。
//第二秒:工厂西侧的仓库屋顶发生坍塌，工厂主建筑二楼南侧墙壁断裂，导致三楼的地面发生大幅度倾斜，其他部分并无现象。
//第三秒:工厂西侧的仓库南侧的墙壁发生倒塌，仓库屋顶剩余部分漂浮在空中，工厂主建筑三楼完全坍塌，工厂北侧第一个储水罐发生爆炸，储存的液体喷涌而出，液体成分尚不明确，其他部分并无现象。
//第四秒:工厂西侧的仓库完全坍塌，工厂南侧的出入口岗哨完全坍塌，工厂北侧第二个储水罐产生形变，工厂主建筑二楼西侧墙壁产生裂纹，一楼西侧墙壁也产生裂纹。
//第五秒:工厂的多处地面出现裂纹，工厂北侧第二个储水罐发生爆炸，第三个储水罐被破开，储存的液体倾斜而下。
//第六秒:工厂南侧的地面出现了一道极深的裂谷，工厂北侧支撑储水罐的支架断裂，第三个没有发生爆炸的储水罐漂浮在空中，工厂主建筑二楼完全坍塌。2
//Level C-226中只存在一只悲尸实体，尽管它会受到流浪者以及环境的伤害，但每名进入该层级的流浪者以及探员都报告了它的存在。因此M.E.G.需要对其进行更多的研究，暂时将其命名为“Only”3。
//
//- 点击收起
//事件起因：2020年5月29日，一名Level 11居民来到M.E.G Beta基地寻求帮助，声称其在误入Level C-226后成功逃离，M.E.G.对其进行了询问，以下为询问记录：
//
//Level C-226误入人员成功逃离事件询问记录
//询问人: 探员B743
//被询问人: [已保密]
//记录员: 探员B784
//
//探员B743：好了，[消音]先生，我们可以开始了吗？
//[已保密]：开始吧。
//探员B743：你声称你成功逃离了Level C- 226是吗？
//探员B743：是的。
//探员B743：能方便说一下你成功逃脱的事件经过吗？
//[已保密]：可以。那天我刚吃完饭，在家附近散步，再经过一个我没有探索过的工厂的时候，我就打算进这个工厂看看，说不定能找到一点物资，我想这大概是一座用来生产钢管的工厂，不过已经废弃了。我在触摸了一根生锈的钢管后，便进入了Level C-226，但是这里实在是……
//探员B743：太恐怖了是吗，这是当然的，毕竟那么危险。
//[已保密]：不不不，这里实在是太熟悉了。
//探员B743：这是什么意思？
//[已保密]：那里很像是我进入后室之前所工作的工厂。
//探员B743：这未免也太过于巧合了吧？你肯定没有记错？
//[已保密]：肯定没有，那里太像了，虽然我工作的工厂是砖瓦造的，但是我们厂是生产钢管的，这么一说肯定就有关联了。
//探员B743：(沉默几秒)
//探员B743:这件事我们会去调查的，还请你继续陈述接下来的事。
//[已保密]：我之后进入了第一个窗户，意料之内的，这座工厂坍塌了。
//探员B743：你怎么能肯定它肯定会发生坍塌？我们查过你的上网记录，你好像不常关注我们M.E.G的资料库。
//[已保密]：因为我知道，它在很久之前就……啊……我的腿……
//探员B743：怎么了，啊，这么大的创口！一定是在那里受的伤，喂！你！带这位先生去止血！
//
//由于突发状况，询问不得不停止。
//事后，[已保密]表示其经过八次窗户的传送，在第九次进入其中后，切入了Level 11一栋楼房的23楼的一个窗口内，这表明Level C-226总共可以跨越八秒，八秒后进入剩余的窗户内，即可离开Level C-226，根据其描述，第七、八秒内Level C-226的具体状态各如下：
//
//第七秒:工厂北侧的第三个储水罐落在地面，并碎裂，工厂主建筑一楼完全坍塌。
//第八秒:已知可被观察区域仅剩被埋没在工厂主建筑废墟下尚存的三角区域，其他部分的改变尚不明确
//该描述对于M.E.G.相当重要，这可以使得更多误入的流浪者和探员避免危险并离开该层级，因此，我们会尽快公布该报告。
//
//- 点击收起
//2020年5月30日，M.E.G.正式开始对于悲尸“Only”的研究，基于[已保密]在事后提供的信息可以猜测，“Only”很可能在前厅时与[已保密]为上下属关系，“Only”为工厂的厂长，因为某些原因，该工厂发生了坍塌，坍塌的具体原因有待调查，在进入后室后，“Only”很有可能因为发现了Level C-226与其工厂的超乎寻常的相似，进而想起工厂的坍塌而悲伤过度而转变成了悲尸。为证实该猜测，M.E.G.计划对其进行跟踪拍摄。
//2020年5月31日，M.E.G.开始在level C-226对“Only”进行72小时的跟踪拍摄。由于level C-226内无法使用计时器4，因此拍摄时间可能不准确。
//2020年6月2日，追踪拍摄顺利结束，录像被带回Level 1 Alpha基地做进一步研究。
//2020年6月2日，通过对录像的分析，我们初步得到了以下结论：
//
//“Only”与一般悲尸不同，完全没有敌对性。录像中有多处“Only”看向镜头的画面，这表明其已经发现了执行拍摄任务的探员，但是并没有对探员发动攻击，反而做出挥手动作。
//所有窗户对于“Only”表现得十分服从。
//“Only”的行动就像是一位工厂厂长，长期处于工厂主建筑三楼的一间房间中，偶尔来到一楼，来时的行为表现为左顾右盼，时常招手，频率不固定，说着含糊不清的话语，内容时常出现重复。
//对于“Only”表现出的友好性，M.E.G.计划与其进行交流。
//
//2020年6月6日，M.E.G.派出四名探员尝试与“Only”进行交流，由于“Only”可以对中文产生回应，交流较为顺利，录音被带回Level 1 Alpha基地做进一步研究。
//2020年7月3日，通过语言学专家对音频进行的分析和推测，初步得出了以下单词及其翻译：5
//
//aoo 好；好的
//aww 我
//baoo 不好；不好的
//ciao 进去
//fow 窗户（指实体）
//ganger 工厂（可能指Level C-226）
//hoo 如何
//hom 后；向后
//mer 我们
//ness 高兴的
//qiu 前；向前
//qoo 你
//yoo 你们
//you 右；向右
//zoo 左；向左
//由于分析能力有限，暂时只能分析出这些单词，但相信“Only”的秘密远不止于此，后期我们会继续尝试与其交流，希望可以得到Level C-226的真相。
//
//- 点击收起
//基地、前哨与社区
//M.E.G.“悲语”基地
//M.E.G.在第零秒时的Level C-226所建设的基地。
//常驻人员四人，三名为安保人员，一名为语言学家。
//用于与“Only”交流以及在本层级长时间驻扎所用。
//存有大量杏仁水以备不时之需。
//入口与出口
//入口
//在Level 11的一座废弃工厂触摸其中的生锈钢管有几率切入Level C-226。
//更多入口仍待调查。
//出口
//在通过窗户的八次传送后，第九次进入窗户后会被传送至Level 11中的任一栋建筑的任意一个窗口，关于窗口的朝内朝外，窗口所在的楼层，有待调查。
//更多出口仍待调查。
//作者信息
//« Level C-225 | Level C-226 | Level C-227 »
//
//Footnotes
//1. 窗户原有的异常性质没有发生变化，只是不会对流浪者造成伤害。
//2. 之前的探员与流浪者仅到达这里便失联，直到下文的事件发生
//3. 对于“Only”是否为悲尸仍有争议。
//4. 任何时钟及计时器全都因未知原因失效。
//5. 该语言无法使其他悲尸个体产生回应。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1226{}