//Level C-252
//评分: 
//+8
//+
//–
//X
// 
//
//生存难度：
//危险环境
//极度难以生存
//无有害实体
//Level C-252是后室C层群的第252层。
//
//1 
//多面体图片
//
//描述
//Level C-252由一个形态不断变化的空心多面体及其外围的空间组成，经估计其体积为3.2×106m³，多面体由无色透明玻璃制成，其形态结构不断拉伸，挤压。进入Level C-252后流浪者会被传送至距Level C-252约500m的位置并被引力以2m/s的速度拉向多面体。在即将与多面体接触时，流浪者会被传送进入多面体。
//
//多面体中储有一种蓝色液体，饮用200mL以上该液体将会多器官衰竭。当有流浪者进入多面体时，流浪者会浮在水面上，身体周围的部分水将汇聚成许多直径约为2.5cm的水球，每秒将有一个水球向多面体顶部飞去，接触多面体顶部后消失。每飞走7个水球，流浪者将衰老一岁（离开Level C-252后恢复原来年龄）。如果在水球全部飞走前仍未离开Level C-252，流浪者将死亡，尸体溶解成为多面体内液体的一部分。
//
//- 附录一
//Level C-252探索记录
//
//
//特工1839：报告总部，我已进入Level C-252，现正向多面体移动。
//总部：收到。进入多面体后做进一步汇报。
//特工1839：收到。
//约4分钟后
//
//特工1839：我即将进入多面体内部。
//总部：收到。
//
//画面一黑
//
//特工1839：报告总部，我已进入多面体内部，其内壁形状不断变化交融，我的身边出现许多水
//　　　　　球，它们正向容器顶部飞去。
//总部：收到，请在多面体内进行探索，不过记住，速度一定要快。
//特工1839：收到。
//
//一分钟后
//
//
//总部：特工1839，有什么发现吗？
//特工1839：没什么特别发现，水的密度大，特别黏稠，我已完成采样工作，请做进一步指示。
//没有回复
//
//
//特工1839：总部，收到请回复，收到请回复。
//没有回复
//
//
//特工1839：总部，收到请回复！收到请回复！
//信号中断
//
//
//特工1839：总部，收到请回复……
//总部：特工1839，立即离开Level C-252，立刻！
//特工1839：收……收到。
//特工1839的声音越来越沙哑
//
//
//特工1839：总部……我可能回不去了……照顾好我老婆孩子……我没劲了……咳，咳咳……这里什么
//　　　　　也没有，除了空虚，我感觉到前所未有的空虚……真希望这天杀的水球能慢一点，我还
//　　　　　没做什么呢……
//信号中断
//
//
//总部：特工1839，收到请回复！特工1839！
//记录结束
//
//- 附录二
//　　　　　　　　　　　　　　　　　多面体内液体实验报告　　　　　　　　　　　　　　　　　
//实验1
//实验目的：探究液体对其他动物的影响。
//实验方式：将实验白鼠带入多面体，观察现象。
//实验结果：白鼠接触液体后身旁同样出现水球，但数目比人接触液体产生的少，经计算白鼠年龄
//　　　　　与水球消耗时间的总和与白鼠平均寿命相近。
//实验结论：多面体中液体对其他动物有影响且水球数量随该种动物平均寿命而变化。
//
//实验2
//实验目的：探究液体对植物的影响。
//实验方式：将夹竹桃带入多面体，观察现象。
//实验结果：夹竹桃接触液体后出现数量极其庞大的水球，水球数量不可数。
//实验结论：推测液体对植物有影响且水球数量随该种植物平均寿命而变化。
//
//实验3
//实验目的：探究液体在Level C-252外对生物的影响。
//实验方式：将多面体内液体带出Level C-252，将白鼠放入，观察现象。
//实验结果：液体带出后变得透明，将白鼠放入后不出现水球且白鼠无不良反应。
//实验结论：将液体带出带出Level C-252后异常效果消失。
//
//实验4
//实验目的：探究液体对物品的影响。
//实验方式：将不同规格材质的信号发射器带入多面体，观察现象。
//实验结果：发射器接触液体后不出现水球，约15分钟后信号消失。
//实验结论：液体对物品不起作用，推测物品进入液体约15分钟后被液体分解消失。
//
//实验5
//实验目的：探究饮用杏仁水对液体影响的作用。
//实验方式：特工在多面体内饮用杏仁水，观察现象。
//实验结果：特工身旁仍出现水球且水球数量没有变化。
//实验结论：饮用杏仁水对液体影响不起作用。
//
//实验6
//实验目的：探究外界对液体的影响。
//实验方式：在多面体内使用胶雷，将液体放入高压锅加热，观察现象。
//实验结果：液体没有凝胶化，但多面体内部分气体凝胶化，高压锅内液体温度没有上涨，没有沸腾现象。
//实验结论：外界因素无法对多面体内液体产生影响。
//
//基地、前哨与社区
//无已知基地、前哨与社区
//入口与出口
//入口
//从Level C-331中切出有几率进入Level C-252
//出口
//在Level C-252的多面体中用全力向下游有几率进入Level C-353
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1252{}