//Level C-262
//评分: 
//+9
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
//安全
//较稳定
//实体绝迹index1.jpg
//Level C-262的街道，注意其完全对称。
//
//Level C-262是后室C层群第262层。
//
//描述
//Level C-262看起来是一条商业街，街上有各种店铺和建筑。这些建筑里面似乎都没有人，但都以一种未知的方式提供着水、能源、WiFi和物资。
//
//在层级中轴上会有一面类似于镜子的墙。该墙面似乎无法以任何方式破坏，也无法以任何方式穿过。这使得流浪者的活动范围被限制在街道的一半。目前，该墙暂时被称为“镜子”1。
//
//据很多流浪者所述，“镜子”后面的人与物似乎是真实存在的。若流浪者拍打“镜子”，可以很明显地感到对面传来的冲击力。对着该墙面扔出一个物品，也能清楚感觉到对面的振动。某些流浪者声称如果紧盯着“镜子”里的“自己”看会有一种被自己监视的感觉。该种感觉会让人十分难受，并会造成精神损伤。
//
//特殊性质
//Level C-262最特殊的性质就是其镜像复制能力。从该层级切出的流浪者表示他们携带的部分物资会复制一份。比如一位流浪者随身携带了一瓶杏仁水，切出时却发现自己多出了另一瓶杏仁水。瓶上的字似乎被镜像翻转过，且M.E.G.经过化验发现其中某些分子的手性都被反转了。此外其它某些物品似乎也能被镜像复制，但某些特殊物品如层级密钥无法被复制。
//
//该种复制似乎对人和实体无效。不过，如果长时间待在Level C-262，切出后可能会对流浪者自身产生影响。影响的大小与造成影响的几率随流浪者在此层级逗留的时间而增长。
//
//下面是对发生异常状况的人的记录
//Makridy，女，24岁
//切出Level C-262后，由右撇子转换为左撇子，且写出的字也经镜像翻转。
//
//John，男，31岁
//经检测，其内脏器官全部反转，心脏长到了右侧。
//
//Perssy，男，27岁
//方位感错乱，左右混淆。
//
//佚名，男，35岁
//因部分内脏错位而死。
//
//虽然Level C-262比较安全、物资充沛、无有害实体、有独特的复制能力，因其能对流浪者产生影响，目前不建议流浪者到达此层级。若不慎切入，应尽快离开。
//
//基地、前哨和社区
//该层级不存在已知的基地、前哨和社区
//
//入口与出口
//入口
//切入偶尔在街道上发现的银框镜子
//出口
//切入此层级任何一面镜子将使你来到你进入的位置
//警告！！！
//我们在一次对Level C-262的监测中，意外地发现了不同寻常的脑电波。经分析，此脑电波与U.E.C.的赫尔墨斯装置高度相似！我们推测，Level C-262是一个U.E.C.设下的陷阱！他们企图用物资复制将人引诱至此，然后偷偷复制一份。没人知道他们要做什么！目前对Level C-262的进一步调查已经开始。请各位流浪者不要进入此层级。我们正在对所有银框镜子进行搜寻和保管，请各位一经发现银框镜子立即向M.E.G.报告！
//
//-欢迎你，U.E.C.成员
//镜子计划
//2022年1月初，我们在澎湖湾启动了赫尔墨斯装置。我们来到了一条商业街上。我们注意到了这堵像镜子一样的墙，并且找到了它的控制方法：在一栋银行里，有一台可以通向其控制中心的ATM机。目前该机器已经锁定，只有通过特定方式才能启动，这个方式我们不便在此说明。
//
//此控制室可以监视这一堵墙周围的所有情况，并且可以操控人是否能离开以及其离开时可以将什么复制的东西带走。我们在此设立了一个据点，并建造了一批赫尔墨斯装置。我们利用此层级的复制功能作为诱饵，应用那些“流浪者”进入这里。然后，镜子会复制一个完整的他，并在他走后将复制品转移到实验室，以此得到其完整思维和躯体。
//
//计划进行的很成功，我们成功得到了许多有用的情报，同时为我们的赫尔墨斯装置提供了良好的制作材料——新鲜的人脑。
//
//目前，M.E.G.那帮人似乎嗅到了一点气息。他们将会对此层级展开全面检测。这正是我们所期待的！
//
//作者信息
//« Level C-261 | Level C-262 | Level C-263 »
//
//Footnotes
//1. 本文中对该墙面的称呼统一加上了引号
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1262{}