//Level C-242
//评分: +9+–x
//twist_1.png
//Level C-242是 扭曲 C层群的第242层。 本层级的所有物质、时间发生错乱和扭曲现象
//
//photo-1639746292626-690a884030b5?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1074&q=80
//扭曲吧，别再做无谓的挣扎
//
//描述：
//Level C-242是一非线性空间，整个层级的视觉呈现各不相同，就好像 扭曲且反复一样 ，但唯一的共同点是对流浪者的视觉神经系统会造成一定的损伤，产生相应的疲劳感和眩晕感。推测Level C-242投影出的场面在1900年至1990年间，且该现象不断循环。因此在该层级中你可能会因为时间错乱现象，导致自身的年龄不断 反复扭曲 。
//
//目前确认Level C-242有至少三个 扭曲 区域，这些 扭曲 区域在该层级随机切换，Level C-242被描述为不存在可供常规观测的地质结构，造成无法被理解的 疯狂切换 ，这让探索者在该层级很难生存下去，因此探索者可能会在该层级中 落入万丈深渊 ，最好的建议是 接受扭曲的事实 ，因为 别无他法 。
//
//Level C-242.1
//Level C-242.1是探索者进入Level C-242最容易遇到的空间，整个空间是漆黑的虚空区域，除了像损坏的rgb色彩模式一样的投影画面，就没有其他多余的事物存在。到目前为止Level C-242.1内部还未任何实体。
//
//你不记得吗？你真的不记得吗？我们小时候坐在电视机面前看电视的美好童年，拜托，亲爱的，别告诉我你忘了，这么重要的记忆你不可能忘掉，让我们好好回忆一下，好吗？
//
//Level C-242.2
//photo-1635438004811-54b5864e57eb?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=735&q=80
//这是我们的画作，你一定会想起来的。
//
//Level C-242.2在视觉上，被认为故障艺术风格，探索者给出的描述则是整个空间的色彩就像瀑布一样往下流动，探索者的视觉都产生极大程度的眩晕感。在该空间中，会发现唯一生成的实体“扭曲之人”，一般情况下该实体对探索者不会有任何攻击行为，只有受到外界的刺激才对探索者实施攻击。
//
//看啊，多么漂亮的画啊，这可是你和我小时候所创作出来的画作，等一下..他们和你说了什么？你也不至于忘记这些事情，他们真是混蛋玩意，放心，我一定让你恢复记忆的，一定…
//
//Level C-242.δ
//Level C-242.δ到目前为止是还未被发现的空间，目测是漆黑的虚无地带。
//
//不会的，我们的世界不会就此结束，我们还有许多事情没有做呢，你应该和我在一起的，不是吗？亲爱的，你不应该背叛我的，童年，记忆，扭曲，错乱，就在这里重生，看啊，多么美好的阳光照射你我的脸上。
//
//实体
//扭曲之人
//扭曲之人是Level C-242唯一生成的实体，该实体的体型与成年男性或女性人类相似，但其面部的形状常常是极其怪异的，常被形容为“被某种力量强行扭曲”，扭曲后的样貌各不相同，但唯一的共同点是对探索者不会有任何攻击行为，只有受到探索者的刺激才对其实施攻击。
//
//但对于该实体的目击事件极为稀少，因此是否存在还有待进一步确认。
//
//我是存在的，我不能失败，你的回忆是唯一证明我的存在，我爱你，亲爱的，让我们永远待在一起，可以吗？
//
//基地、前哨与社区
//由于Level C-242的特殊环境，任何建造在Level C-242的基地、前哨与社区的尝试均已经失败
//
//我们不能被忘记，我们的世界是最美好的。
//
//入口与出口
//入口
//你可以从Level 0或Level C-5卡入墙壁后，就会达到这里。
//回来吧，我想你了，你不能忘记我，以及那段感情。
//
//出口
//目前还未发现任何出口。
//别离开我，你真的忘了吗？快回来吧，我会一直等着你。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1242{}