//Level C-257
//评分: 
//+8
//+
//–
//X
// 
//
//生存难度：
//等级 变化
//
//变化的安全性
//不稳定
//变化的实体数量
//Level C-257是后室C层群中的第257层
//
//描述
//Level C-257是一片由无数个巨大的相互连接的骰子房间构成的空间，每颗骰子都为边长500m的立方体，内部完全相同，进入该层级后流浪者会到达一个固定的骰子房间，骰子房间的数量似乎是无限的，目前未发现边界。层级内wi-fi信号强，通讯几乎不受限制。该层级内没有重力，因此流浪者可以不受限制的在骰子房间内移动。
//
//wcajTxtfR3JO7qK.png
//房间内景。
//
//骰子房间内部六面都是由不可破坏的红色混凝土构成，在墙上有深色的0到5的数字来指明该面骰子的点数，点数加一后与前厅中最常用的骰子点数顺序相同，由于六面都有数字，因此流浪者不用担心方向错乱。骰子内部有未知光源照亮整个骰子房间，且各处亮度均相等。各面没有任何门或窗口。
//
//在0面上有一个装有骰子的玻璃罩与一个按钮，按下按钮后骰子会自动被掷出，转速不断减慢，最后停止，面向房间“3”面的点数便是投掷结果。在流浪者投掷骰子之后会“打开”相应点数面上的墙。打开后可以直接穿过，到达另一个相邻的完全相同的骰子房间，该层级在骰子掷出后亮度会降低，并且同时会根据骰子点数改变周围环境的生存难度。
//
//投掷记录：
//投掷0点
//
//生存难度：
//等级 0
//
// 
// 
// 
//无实体出现，环境无变化，产生1-2瓶杏仁水，0号墙开启。
//
//投掷1点
//生存难度：
//等级 1
//
// 
// 
// 
//出现极少量实体，不主动攻击流浪者，目测不超过5个，出现少量噪音，产生少量杏仁水，幸运豆奶，1号墙开启。
//
//投掷2点
//生存难度：
//等级 2
//
// 
// 
// 
//出现少量实体，至少包括幼年无面灵、肢团、蠕灵、猎犬、雄性死亡飞蛾、悲尸和窃皮者，出现少量幻觉，轻微头疼，产生数瓶杏仁水，幸运豆奶，和少量糖果等，2号墙开启
//
//投掷3点
//生存难度：
//等级 3
//
// 
// 
// 
//出现中量实体，种类繁多，无智慧，各种在多层级分布的实体均有出现，有很强的眩晕感，头痛，产生许多物资，杏仁水，幸运豆奶、糖果、苦痛汁液、火盐等，以及食物和少量锐器，3号墙开启。
//
//投掷4点
//生存难度：
//等级 4
//
// 
// 
// 
//几乎每走20米都能遇到不同实体，无智慧，种类与点数3时类似，实体会自主寻找流浪者并进攻，间歇性十分头痛，环境完全黑暗，开始变不稳定，流浪者能听见幻觉引起的交流声，流浪者需要自带光源，与之相对应的资源十分丰富糖果、苦痛汁液、火盐、皇家口粮、滋水枪、瓶装闪电、记忆汁和腰果水等，4号墙开启。
//
//
//投掷5点
//生存难度：
//等级 5
//
// 
// 
// 
//投掷点数5：到处都是实体，无智慧，种类与点数3时类似，几乎每走几步都有实体出现，资源十分丰富，甚至出现了热武器，还有更多种类的物品出现，环境很不稳定，光源无效，流浪者视野只剩下约10米，方向感迷失，头痛，5号墙开启。
//
//
//
//在流浪者离开房间后，内部实体会瞬间消失，来源与去路未知。由于所有实体都没有智慧，所以难以沟通。同样地，流浪者留下的物品也会消失，甚至死亡的流浪者也会。
//
//如果不投掷骰子，该层级将十分安全，没有实体，环境稳定，无精神干扰，可以作为一个暂时的休息地。如果投掷骰子，由于只需要逃离实体数十米到数百米，哪怕生存难度5下生存几率也会大大提高，这里便是一片赌场，以生命博取物资。来此博取物资的流浪者建议在掷出骰子后快速向4号墙与5号墙方向移动，尽最大可能增加生存几率。
//记录一：关于Level C-257的实体来源 2022/3/6
//
//目的： 找到该层级物资与实体来源
//主要参与人员 ：窃皮者 M.E.G.专员
//日期：：2022/3/4
//
//<记录开始>
//
//将一只窃皮者跟随一名专员进入Level C-257,使窃皮者独自进入新房间并按下按钮，带入摄像机记录。
//
//投掷点数为3，出现大量无意识人类，空中有漂浮的肉块，其中有曾在该层级失踪的流浪者。
//
//下一个房间 投掷点数为5，出现大量人类，但远少于M.E.G.探索时实体数量，窃皮者被热武器击杀死亡，摄像机传输信息中断。
//
//专员进入新房间投掷骰子，产生的无意识实体中可以找到刚刚死去的窃皮者。
//
//<记录结束>
//
//研究可知其中无意识实体是之前在该层级死亡的实体，但对于实体如何从其它层级来到Level C-257仍未知。
//
//附录：关于Level C-257的新发现 2021/11/14
//
//采访记录 2021/11/13
//M.E.G.采访 - 残疾的流浪者
//采访者：M.E.G.特工
//受访者： 流浪者
//
//M.E.G.特工： 请问您可以在采访中透露下姓名吗？
//
//流浪者： 不，不了。
//
//M.E.G.特工： 行吧，没关系。请问您可以解释一下起初发生了什么事吗？
//
//流浪者： 起初我就像其他流浪者一样，来这里快速获得一些有用的物资。很快我就通过了数个房间，而且通常都是远离初始的房间，大概几个小时后，我就收集了足够多的资源。但我……并没有停止，仿佛是不受控制般的又掷了骰子。（突然停住）
//
//M.E.G.特工：请继续。
//
//流浪者： 抱歉我只是有些后怕，然后我又过了几个房间，突然间掷到了5，周围实体遍布，我飞快的离开，接下来，又是一个5，再然后的第三个房间里，我第三次掷到了5，这次并没有安全的离开，一个实体快速的扯断了我的双腿，巨大的痛苦让我突然醒了过来，告诉我不要太过贪婪，为了一点破东西差点丢了自己的命，于是我尝试切出，但这里突然变得稳固异常，哪怕在如此不稳定的条件下，我还是失败了。来不及多想，我引爆了大把的火盐，滚烫的热浪灼烧着我的后背，巨大的冲击力把我击飞，快速向墙面冲去，通过了这个恐怖的地方。之后我便不想着再去掷骰子，多次尝试切出无果，正当我想办法的时候，突然间就被传送到了Level 0，物资也还在手里，不管怎样，还是活下去了。（苦笑）
//
//M.E.G.特工：这听起来很可怕。对你的遭遇我们感到很遗憾。我可以给你一些药物，之后你要去哪里？
//
//流浪者：我会回到营地，还有，多谢了，我会拿着它们。
//
//总结：这位流浪者在接受采访后返回到位于Level 1的alpha营地，并且双腿以及背部的烧伤和骨折已经有了一定程度的好转，我们对该区域也有了新的认识。
//
//结束记录：21:31
//
//这个层级在靠近初始房间的地方通常比较安全，但是随着不断的远离，可能会有精神影响，使流浪者愈发贪婪。当流浪者完全深陷其中时，切出似乎会无效，但是当流浪者抵抗住自己的贪婪之后，可能会被强行送出。
//
//基地、前哨和社区
//该层级不存在任何原住民，仅有一处基地。有组织曾经试图在其他房间建设基地，但在有人离开后该所有资源以及建筑会立即消失，因其特殊的性质而无法建立。
//
//M.E.G. - Random基地
//由于流浪者去路的随机性，M.E.G.仅在最初始的房间设立了一处补给点和通道，以供流浪者安全离开该房间并获取少量生存物资。
//有10人驻扎于此。
//开放贸易。
//入口与出口
//入口
//在C层群内不封闭的群层中不使用任何作弊的手段使用一颗任意大小且质量均匀的骰子连续掷出六次点数6有大概率进入。
//
//有大义的人，能转死为生；而贪婪的人，只会成为我的养分。
//出口
//在上一次掷出1-5时，在任意房间内切出，即可到达上一次投掷点数所对应的level。
//如果上一次掷出0，在任意房间切出，会回到来时层级。
//如果在投掷前切出，即可保留所有获得资源。
//如果在投掷后切出，会失去一切在骰子房里获得的物资，包括已经饮用或食用的物品。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1257{}