//Level C-292
//评分: 
//+12
//+
//–
//X
//
//
// 
//
//生存难度：
//等级 1
//
// 
// 
//大量无攻击性实体
//Level C-292是后室C层群的第292层。该区域已经建立起许多流浪者社区。
//
//已存取[点击隐藏]
//以下内容主要面向需要快速理解层级的流浪者，M.E.G.推荐流浪者完整阅读此层级信息。
//
//此层级为一个安全且开阔的空间层级，具有许多物资，鼓励流浪者在此层级探索和生活。
//此层级受到阿尔戈斯之眼的管理，应该认真阅读此层级的规章制度。
//如果你的合法权益受到侵害可以前往阿尔戈斯之眼的驻扎点求助。
//此层级有大量组织活动，贸易活动频繁。
//此层级拥有可用且稳定的Wi-Fi。
//此层级的温度适宜，天气晴朗，有24小时昼夜循环。
//此层级没有敌意实体，天桥的无面灵以及猎犬都受到类似“第11效应”得影响。
//不应贸然前往此层级的公路区域，车道上的车兽是致命的。
//应知晓此层级的出入口信息，请将你在此层级的发现汇报给M.E.G.。
//描述
//Level C-292为一处空间大小未知的开阔层级，该层级目前所有被勘测区域的地形都是非常平坦的。该层级主要由三个部分组成。
//
//Level C-292拥有强度保持在3的Wi-Fi和类似前厅的24小时稳定昼夜循环，没有出现过任何除晴天外的天气现象，此层级内温度持续稳定于24~27℃之间。
//
//以下为各个部分的详细情况。
//
//人行道
//其为一个长约297米，宽约8米，以及与公路有0.07米高度差的铺设有红砖和黄砖的矩形平台。黄砖在该平台宽边的中点以直线贯穿整个人行道，类似于前厅的盲道，平台其余区域以红砖铺设。人行道除面向公路的一侧外，其他边界都是虚空。
//
//为了防止失足掉落，M.E.G.（探险者总署）已在此区域周边搭建围栏。
//
//公路
//公路为Level C-292中面积最大的区域，所有区域都是以沥青铺设的黑色地面。此区域的长和宽均无准确数据，目前已确定的数值为长270千米以上，宽1500千米以上，以白色油漆划分有成千上万条平均宽约3.75米的车行道分界线。
//
//公路也是本层级最为危险的区域，在此区域有大量车兽以40~250km/h的时速行驶，期间伴随零散的鸣笛声。他们总是分别行驶在固定的车道上，且都是从左侧向右侧1行驶。但是由于未知影响，所有车兽只会不断向前行驶，不会因道路中的任何障碍物而停止前进，并且他们也有能力对任何障碍物进行破坏。
//
//%E5%A4%A7%E9%81%93
//Level C-292公路的其中三条车流量大的车道。（图例1）
//
//目前可以确定除了第一车道没有车兽以外，所有车道的车速和车流量都是固定且各不相同的。M.E.G.（探险者总署）正在天桥上对这些车道进行标记。
//
//天桥
//天桥是一条未知长度的宽约11米，以及与公路距离为7.5米高的人行天桥，入口位于其与人行道连接处的数个楼梯。天桥横向深入了此层级，是安全进入公路区域的最佳方法。
//
//%E6%A5%BC%E6%A2%AF
//Level C-292天桥的其中一个楼梯。（图例2）
//
//在天桥的路面角落和栏杆上能够寻找到丰富的物资，多以杏仁水，罐装龙肉和油腻棉花糖为主。在天桥上最容易发现的实体是无面灵，并且显示出受到类似“第11效应”的影响，因此其基本是无害的。
//
//值得注意的是，天桥整个建筑结构中除了入口处的楼梯外，没有任何能够进行支持的结构，尽管其建筑材质显示为普通的水泥混凝土，这明显不符合桥梁工程学。在一次极端爆炸事件中，即使连接处损坏的情况下天桥也不会倒塌，这表示天桥也可能是受到未知外力而悬浮于空中的。
//
//由于天桥建筑结构的异常特性，目前许多组织正在以天桥为基础进行扩建或改造工作。
//
//特殊现象
//特殊红色出租车作为进入Level C-292的主要入口，根据计算其只会在该层级整点的时间段出现，每次都会出现一批数量200辆的运载有或没有流浪者的出租车，在其他时间段发现并乘坐出租车的流浪者均表示在整点时间到之前，出租车是一直在行驶的。
//在Level C-292远处似乎可以观察到移动的巨大山体和建筑，不过无法证实其真实面目，因为任何接近的尝试都显示两者之间的距离没有变化。
//实体
//车兽（Entity C-3）
//在公路中最常见的实体
//车兽是此层级中数量最多的实体。
//他们在此层级中展现出了相当丰富的车型。
//不同车道分别以不同时速行驶，速度一般都在40~250km/h之间。
//与其交互的可能性相当低，目前没有任何成功记录，他们仅会以固定时速前进，对于出现在道路上的障碍物会直接将其摧毁。
//无面灵（Entity 9）
//在天桥中最常见的实体，似乎都受到类似“第11效应”的影响。
//无面灵的行为多以漫无目的地游荡或靠在栏杆处观察公路为主
//可以理解简单的命令，大部分情况下都能够也愿意帮助流浪者。
//基地、前哨与社区
//常驻人口
//该层级常驻人口约700人，每日流通量大约1300人。
//许多流浪者和团体已经以天桥为基础建设了许多建筑物。
//由于Level C-292地形开阔难以进行有效藏匿，且有阿尔戈斯之眼成员定期巡逻，因此该层级基本不存在严重冲突。
//此层级有大量团体，在此仅列出较主要的团体。
//
//后室家居生产厂 - “道路施工”建设站点
//常驻人员38人，流动人员4人。
//成员态度友好，不对外贸易。
//正在进行人行道扩建和天桥建筑工作。
//团体或个人可以雇佣其成员建造符合需求的建筑。
//建设站点位于人行道。
//阿尔戈斯之眼 - “持法者”分队
//常驻人员未知，约15人以上。
//定期于天桥和人行道巡逻。
//成员态度一般，仅接待需要规则咨询或有起诉请求的流浪者，不对外贸易。
//声称将负责此层级的秩序维护工作。
//已制定并通过一份关于此层级的规章制度，流浪者应认真阅读。
//拥有武装力量。
//驻扎于人行道。
//不结盟贸易集团 - C群层292号贸易大厅和资源回收点
//常驻人员35人，每日流通量约1250人。
//成员态度友好，对外开放贸易。
//支持流浪者在此地自主进行交易。
//正在长期进行该层级的资源回收工作。
//在入口处建造了一座机械电梯和覆盖至天桥3000米的微型车站，能够帮助流浪者快速移动，需要支付相应报酬。
//设施位于天桥入口处，占地全长200米。
//探险者总署 - “天桥”前哨站
//常驻人员25人，流动人员10人。
//成员态度友好，对外开放贸易。
//可以为有困难的流浪者提供帮助。
//正在长期进行该层级的资源回收工作
//前哨站位于天桥750米处。
//后室厨师联盟 - 摩尔奏瓜察餐厅分店
//常驻人员34人，流动人员12人，每日流通量大约150人。
//成员态度友好，不对外贸易。
//允许流浪者支付相应报酬之后进店享用食品。
//该团体曾由于造成人行道严重拥挤而在B.F.P.F.、B.N.T.G.和阿尔戈斯之眼的帮助下转移到了天桥上，后来该建筑经过数次转移来到现在的位置。
//该建筑有另外3名阿尔戈斯之眼成员保护。
//该建筑位于 人行道 天桥 1600m 4700m 7600m处。
//速切玩家 - 292号中转站
//常驻人员12人，大量流动人员。
//成员态度友好，对外开放贸易。
//此层级的速切玩家成员热衷于在车兽之间跳跃和切入切出，似乎有很多未透露的能够轻易到达该层级的方法。
//中转点位于天桥9200米处。
//“拾荒边界”联合哨所
//多组织共计常驻人员21人，流动人员11人，每日流通量大约13人。
//成员态度友好，对外开放贸易。
//此处是根据目前该层级不同区域的人流量划分出的稀少人口区边界，在此哨所之后150米外的区域属于不再被阿尔戈斯之眼管理的区域。
//该哨所驻扎有5名M.E.G.成员，正在长期进行该层级的资源回收工作。
//该哨所驻扎有8名B.A.G.成员，会每日定期于天桥11000米范围以内进行巡逻，接收到流浪者的求助信号时会提供支援。
//该哨所驻扎有8名阿尔戈斯之眼成员，负责对通行人员进行检查并维护治安。
//该哨所位于天桥10000米处。
//后室机器人科技 - 小型测试站点
//常驻人员7人，流动人员11人。
//成员态度一般，不对外贸易。
//该站点是该组织用于进行速度控制测试和飞行器灵敏测试的设施，由于这些测试具有危险性，设施被要求转移至流通量较少的位置。
//拥有武装力量。
//该站点位于天桥 9600米处 16000米处，设施全长200米，实际占地长度1300米。
//拾荒流浪者社区
//常驻人员95人。
//成员态度友好，对外开放贸易。
//该团体是一群流浪者自发形成的，其致力于在此层级寻找到珍贵物品。
//一个中型交易区位于天桥13600米，也有一些B.N.T.G.的商人在此地回收珍贵物品。
//后室装修公司
//详细资料未知，但所在位置都在20千米之外的区域。
//拾荒流浪者成员以及“罗经点”探索兵团成员发现的多个特殊公路区域。
//这些车道已经全部都被破坏，几个明显为后室装修公司的员工似乎在进行公路翻新的工作，这些特殊公路区域不会出现车兽。
//与其交流没有任何值得注意的信息。
//探险者总署 - “罗经点”探索小组（“正向距离”）
//该团体正在通过天桥深入探索此层级，目前已前进至1500千米以上。
//由于没有任何特殊发现，大部分成员选择以切出层级来返回，目前还有26 20 13 7人正在继续探索。
//已发现超过35把层级密钥、许多稀有物品和超过800个正在被后室装修公司翻新的特殊公路区域。
//入口与出口
//入口
//%E5%87%BA%E7%A7%9F%E8%BD%A6
//一份对特殊红色出租车的图片记录。（图例3，摄于Level 11）
//
//当你在任何层级的公路中发现一辆特殊红色出租车（图例3）并乘坐时，无面灵出租车司机会驾驶出租车来到此层级的第一车道，目前在Level 11，Level C-28、Level C-70、Level C-140和Level C-236的公路上是最容易发现此出租车的。
//在Level C-151的屋顶能够发现特殊红色出租车，乘坐时能够到达此此层级的第一车道。
//根据速切玩家提供的方法之一，在任意层级的人行天桥上一跃而下并切入下方的公路可以来到此层级的天桥区域9000米处。
//在任何层级的公路上，当载具以90km/h以上的速度行驶且司机想象着该层级标志建筑天桥时，有很大概率会发现公路的车道越来越多，并最终来到此层级的第一车道。
//乘坐后室地铁可以来到此层级的人行道边界区域。
//更多入口正在探索。
//出口
//乘坐进入第一车道的特殊红色出租车，你将随机前往Level 11，Level C-28、Level C-70、Level C-140和Level C-236。有报告表示有流浪者曾以此到达过Level C-117。
//对天桥栏杆上贴有“安全出口”字样的贴纸进行切出可以到达Level C-67。
//对此层级内任何贴在天桥上的广告进行切入都有极小的概率切入Level C-385。
//在公路区域部分车道上会出现外观为拖着挂车的货车型车兽，这些挂车上的集装箱都是可以被切入的，根据集装箱上的图案，会切入相应的层级，不过这些指向都是模糊的，并且有可能前往生存难度高的层级，最好远离图像显然是负面主题的集装箱。目前主要推荐选择以下图像：
//一个以蓝色为主色调的城市图像，这可以前往Level C-28或Level C-297。
//一个以绿色为主色调的森林图像，这大概率能前往Level C-289或Level C-236。
//一个以黄色为主色调的麦田图像，能够前往Level C-116或Level 10。
//一个黄灰线条相见的图像，能够前往Level 0或Level 1。
//其他未知的图像不推荐随意尝试，除非你做好了准备。
//作者信息
//« Level C-291 | Level C-292 | Level C-293 »
//
//脚注
//1. 以流浪者在人行道面向公路时为参照。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1292{}