//Level C-280
//评分: 
//+6
//+
//–
//X
// 
//
//生存难度：
//等级 4
//
//不安全
//稳定
//大量实体dark
//黑暗
//
//Level C-280是后室C层群的第280层。
//
//描述
//Level C-280为一片全黑区域。目前尚未探明其是否为封闭空间。所有经历过此层级的流浪者都报告Level C-280室温处在12℃~16℃之间。
//
//已知流浪者前往Level C-280时通常会出现在能见度极低的房间里。房间左侧靠近床头的橱柜中可以发现饮用水与食物，另一侧存放有手电筒，不过根据流浪者报告，手电筒发出的光只能照亮3米左右的前方。需要注意，Level C-280中的手电筒并不恒定，有流浪者报告在房间中发现没有电池的手电筒或根本没有手电筒。除此之外，房间衣柜中有着可以抵御寒冷的衣服，床上放有电脑，没有网络，显示时间是2022年2月29日，可用于资料存取。
//
//房间房门上有概率发现未知符号“نايت”，在手电筒的映照下会发出淡蓝色的微光。目前尚未破译文字信息，不过可以确定因为该符号致使层级中的实体不敢轻易靠近房间，因此房间中有符号的房间是绝对安全的。如果不幸穿越到Level C-280，流浪者可以将发现的符号抄下，以驱除该层级的实体，如果没有发现符号，那么不建议对Level C-280进行探索，在床上睡一觉，流浪者将前往其它Level。
//
//安全房通常位于Level C-280的西北角落，根据探测者的丈量，Level C-280的占地约三亿平方英里。其中道路错综复杂且伴随陷阱，失踪流浪者不计其数。
//
//离开安全房后，在没有光源的情况下，流浪者无法看清任何事物。实际上除安全房手电筒外，任何外来光源都将失去效果。房间外的装饰可以推断出似乎是处于某栋建筑内部，但向上无法观测到Level C-280的天花板。该层级墙体与地板均由大理石瓷砖构成，道路蜿蜒，两边分布有房间，可以在其中获得大量补给品或穿越到其它层级，不建议进入以木料为材质的房间，因为房门间隙中传来光明。
//
//有符号的房间一定安全。
//
//陷阱
//在Level C-280中，有着许多诸如地洞之类的陷阱。目前已探知的陷阱种类有：
//
//地洞。通常出现在木门前，流浪者踏上松动的地板坠入洞穴，50%的概率在底部出现尖刺，30%的概率该洞穴为无底洞，1%的概率流浪者将去往其它层级。
//坠落物。随机出现，随机物品从无法观测的地方掉落，在遭遇此陷阱前通常会听到人类的窃语。
//夹层。随机地点，若流浪者不幸踩中红色的大理石板，会被两边的墙体夹成肉饼，需注意，当红色大理石两边的墙体上有门时，陷阱不会生效。
//… …
//实体
//目前已知的存在于Level C-280的实体有五种：
//
//攀爬者：危险。出现在大理石墙体上，通常被描述为一种四肢畸形的人形生物，面部扭曲，关节朝外凸起，双目无珠，牙齿外翻，嘴角流着未知的绿色液体，皮肤呈死灰色，通常不会穿着衣服，目测该实体可能长期营养不良，少数攀爬者身体开始腐烂，伴随着令人窒息的恶臭。该实体移动速度较快，可以轻易追上流浪者，移动途中会发出指甲摩擦大理石的声音，但是其不会接触地板。攀爬者具有趋光性，流浪者遭遇攀爬者时，应立即关闭手电筒并靠近没有攀爬者出现的墙体，待摩擦声消失后可以继续前行。攀爬者皮肤感知度低，可以接触它而不被警觉，实体可以被杀死。
//捕食者：危险。通常被描述为肥胖的，令人恶心的，厌恶的，邪恶的，可怖的，压迫的，阴暗的，扭曲的实体。其头部戴着鸟类头骨，头骨嘴里咬着一颗明珠，可以照亮直径约十米的空间，身着黑色未知材质的羽绒大衣。在Level C-280遭遇该实体时，请绕道而行。实体有趋光性，会主动寻找除自己以外的光源，捕杀任何进入其光亮范围的生物，发觉猎物时，实体会发出骇人的尖叫从而吸引攀爬者。除流浪者外，捕食者为该层级唯一光源。
//倒吊人：危险。该实体通常伴随着大量另外实体出现。被描述为被绷带缠满的人型生物，像尸体一样倒吊在走廊中挡住流浪者的道路，有报告显示倒吊人会突然从不可观测的天花板上坠落下来挡住流浪者去路。同时也有报告称存在活动的倒吊人在墙体上留下“رفض الضوء في ضوء”后消失。实体是否有趋光性未知，不会攻击流浪者。
//跟踪者：安全。被流浪者描述为一坨灰绿色的扭曲蠕动遍布黄褐色粘稠液体的生物，可以勉强看出该实体有着两个似乎可以称之为腿的东西，身体上随机分布着无数孔洞，中间有着深红色或黑色的绒状物。实体移动时会发出类似于肥皂泡破裂的声音，且在地上流下一摊油滑的液体，发出令人厌恶的气味。实体在流浪者未察觉的情况下顾涌接近流浪者，在流浪者发现后实体会迅速离开，不久再悄无声息的回来。会发出人类一样的窃语——“الله نزل الظلام في الوقت المناسب ، مخلوقات الأرض ضد السماء للصلاة من أجل النور ”。
//转变者：危险。关于此实体的记述甚少，有流浪者报告其为一匍匐爬行的人形实体，也有报告称其拥有修长的手臂与佝偻的躯体，目前仍未确定流浪者报告的真实性。最近一次有关转变者的目击是2021年12月3日，接近Leve C-280社区Free-Gaq的区域，人员报告目击一个五边形的生物与捕食者缠斗，此过程中该实体成功杀死捕食者并将其吞噬，随后自身蹂躏成一团滚动离开。有流浪者注意到转变者身体带有与安全房一样的符号，由此推断安全符号不可抵御转变者。除此之外，2021年3月数个流浪者遭遇该实体，据幸存人员描述，转变者将尸体卷曲成一种难以置信的状态并将起吞下，过后不久会有类似于攀爬者的生物从其腹部爬出。转变者移动速度较慢，是否拥有趋光性未知，每次目击事件均发生在社区Free-Gaq附近。
//基地、前哨与社区
//Level C-280 Neighbourhood Free-Gaq
//位于安全房西北方向，占地未知，设施未知，状态未知。周遭实体数量较多，相对的安全房数量也较多，地板上随处可见空电池与空水瓶。中心可发现用红蜡描绘的不规则圆环与正方形，以及大量杂乱的笔迹。社区内未发现人类残骸，推测未有流浪者靠近此区域。社区内安全房不再留有符号，而是特殊的字符串“أنا مخلوق من الليل ، وأعتقد في العدم”
//基地 Light-α
//被人类摧毁，显示摧毁时间早于Free-Gaq。
//入口与出口
//入口
//在任意层级的房间中睡眠可以进入Level C-280。
//在不可见光源的黑暗中停留超过40分钟会进入Level C-280，需注意，该进入方法可能不会使流浪者出现在安全房内。
//在黑暗中睡着会进入Level C-280。
//出口
//穿越随机房间可以进入其它层级，无规律。
//掉入洞穴陷阱可以进入其它层级，无规律。
//在安全房睡着可以进入其它层级，无规律。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1280{}