//《望乡旅馆介绍及守则》
//
//
//
//
//亲爱的流浪者们，欢迎下榻望乡旅馆！
//
//
//当您驻足望乡台，回顾您所向往之处时
//
//
//当您探望长久思念之故人并流连忘返时
//
//
//何不在此歇息片刻，放松您的身心呢？
//
//
//您还在留恋着家的温暖吗？
//
//
//望乡旅馆欢迎您!
//
//
//
//
//介绍
//
//
//
//望乡旅馆是我们为了满足流浪者思乡之情而配套望乡台推出的旅店。您先前是否为只能默默旁观而不能与亲友互动感到寂寞难耐呢？您是否为不能与家人团聚，共进晚餐而感到遗憾呢？
//
//只要来到望乡旅馆，您便可在这里与家人团聚，与他们诉说您的孤寂、痛苦与悲伤。您离开您的家人多久了？他们一定非常想念您。去吧，和他们共进晚餐，同床共枕。享受那短暂而又珍贵的宁静与团圆吧。
//
//您想在这里住多久都没有问题。
//
//这里永远是只属于您的，温暖的家。
//
//
//
//守则
//
//
//
//
//流程
//
//
//
//1、进入方式：当您走下望乡台时，顺着路牌的指引，沿着小径，即可抵达望乡旅馆。
//
//2、入住方式：当您进入望乡旅馆之后，请在前台办理入住手续。前台的工作人员将会把房间钥匙与住户指南分发给您。您可以将行李带进房间内或交由工作人员寄存。放心，包括住宿在内的一切服务都是免费的。
//
//3、享受这段时光：当您进入房间后，闭眼，回忆您的故乡，您的家人，您温暖的家。在心中默数三秒后睁开双眼，您就会回到您朝思暮想的家中。您的伴侣已经做好了热乎的饭菜，您的孩子围绕在你的身边嬉闹，您的父母正坐在沙发上，慈祥地看着你。您可以与家人共进晚餐，向他们诉说您的苦难，并给他们一个吻，或是拥抱。
//
//4、退宿方式：若您去意已决，可在家人们都熟睡后，离开房间。将房间钥匙与住户指南交还给前台工作人员，取回您的行李，即可离开。快跑
//
//住户指南
//
//
//
//1、前台的工作人员是友善的成年无面灵，您可以放心与其互动。
//无面灵没有面部特征，本旅馆也不会雇佣人类作为工作人员。如果您发现前台工作人员有着人类的面部特征，请不要入住旅馆。
//2、在您办理完入住手续后，您可以乘坐电梯前往对应的楼层与房间。
//望乡旅馆没有楼梯间，如果您看到了，请无视。
//
//3、旅馆的火灾报警系统运作正常，除发生火灾之外的任何情况，都不要按下旅馆走廊的警铃。
//若您在走廊内察觉到周遭的地形发生了改变，或是记忆模糊不清时，请立刻按下警铃。旅馆工作人员会立刻前往您所在的位置。
//4、如发生火灾，请不要乘坐电梯，立刻前往走廊尽头的楼梯间并下楼寻求工作人员援助。请确认其与为您办理入住手续的是同一工作人员，如果不是，请无视他并直接离开旅馆。
//若您在走廊内发现您的家人，请立刻进入电梯。电梯内是绝对安全的，在电梯内您不会受到任何攻击或伤害。您的家人无法进入电梯。
//5、请不要跳出旅馆的窗户，这一般都会导致您的身体受到伤害。
//如果您在房间内发现您的家人面部特征缺失，请立刻从窗户跳出。
//
//6、您家人的活动范围仅限于房间内，请不要尝试将他们带出房间。
//房间内只有您一个人。
//
//7、为了您的身心健康，我们建议您不要熬夜。
//请您务必在家人上床休息之前睡着，若您无法入睡，请闭眼装睡，但请不要假装发出鼾声，直到您入睡为止。若您在睡梦中被任何声响惊醒，请继续装睡。
//8、本旅馆晚上10点至第二天凌晨四点为电梯自检时间，该时间段内无法乘坐电梯。若您有任何上下楼需求，请前往楼梯间。
//无论如何都不要进入楼梯间。
//
//9、本旅馆晚上10点至第二天凌晨四点提供宵夜，若您有需要可前往餐厅获取。
//请不要食用除您家人制作的之外的任何食物。
//
//10、若您在住宿期间发现有记忆力衰退或是模糊不清的情况时，请不要惊慌，这并不重要。还有什么是比能和家人们团聚更重要的呢？
//如果您发现有记忆力衰退或是模糊不清的情况，第七条作废，请在家人熟睡后离开旅馆。
//11、请在退宿时确认给您办理手续的无面灵与入住时是同一人，如果不是，请无视他，直接离开旅馆。
//如果您在退宿时发现前台内站着您的家人，请无视并离开旅馆，无论他们在背后多么急切地喊你，请不要回头，立刻离开旅馆。
//12、在离开旅馆后，闭眼默数三秒即可回到原层级。
//请不要再回到望乡旅馆。因为它们已经记住你了。
//
//
//撰写人：Jane Rochester
//介绍及守则 第 255 份复印件
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1255{}