//Level C-212
//评分: 
//+31
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//Level C-212是后室C层群中的第212层。
//
//O6yNvj.jpg
//Level C-212中的废弃建筑物。
//
//描述
//Level C-212是一座巨大的城镇，整体呈长方形，城镇内部只有老式建筑物，分为三部分。外部为整齐排列的写字楼，这些写字楼大多破旧不堪，最高层数不超过六层，街道分布在每栋大楼之间，它们以整齐的排列方式组成了整座城镇。中部是一条宽大的马路。Level C-212的中间部分是一个圆形广场，是该层级的唯一出口，这两个地区无法以正常步行的方式到达。
//
//寒冷常年以往地成为寒潮、冷风来撞击城镇内部的写字楼。那些大楼都成为了流浪者的居住地，并且在写字楼中偶尔会出现一些杏仁水和音乐播放器，音乐播放器的型号通常不一致，在播放器上面通常会歪斜地刻着一些俄语，但这些俄语并没有什么实际的内容，只是几句谚语。播放器里存有一些后朋克、后摇等风格的乐曲。
//
//城区内的建筑会显现出一种孤独、寂寞的格调，流浪者们通常称其为“失去了重要东西的感觉”，但它们对人体并不会造成过度的危害。相反，在多数时候这些感觉能让流浪者保持高度的冷静。如果流浪者想要摆脱过度冷静带来的症状，那么流浪者可以使用播放器播放音乐。
//
//但请注意，整个层级的温度都保持在八摄氏度以下，且没有四季更替，还通常伴有细雪飘落，雾霾充斥着整个层级，这使得层级内部的视野较差。你必须做好保暖的准备，否则这里长年的寒冷将会随意地杀死你。当然，你也可以寻找在大楼中遗留下来的火炉等保暖设施，在拥有保暖设施的房间内有着极其微弱的WIFI，许多幸存者就在那些有火炉的地方建立了组织。同时外圈部分没有实体，你在此处将不会受到实体的侵扰。
//
//特殊现象
//火炉的燃料来源未知，但它们是保持一直燃烧的状态的，火炉的火势随着靠近火炉的人数的增加而增加。而那些音乐播放器的电量也似乎不会被消耗完，只要有人使用就会一直保持高度的电量。但因为在该层级刷新出的音乐播放器的质量不佳和严寒环境的毁坏，这些音乐播放器即使有着接近无限的能源也依旧会被用坏。
//
//偶尔，当你在道路间行走或是在大楼间穿梭时，一些子弹会从小的坑洞中以“逆熵”的形式射向流浪者，这意味着一旦流浪者被倒着射出的子弹击中后将会受到致命的伤害，但这些子弹射出的概率极小且速度并不快，身体素质好的流浪者可以轻松躲开。
//
//基地、前哨和社区
//黄鸟（Yellow Bird）：
//
//“黄鸟”内部大概有三四十人，他们保持着高度的善意，偶尔会在城镇外部接送新的流浪者进入城镇并将物资分享给他们，还会教流浪者如何在这里生存下去。
//“黄鸟”的内部成员偶尔会组成队伍向城镇内部探索，你可以加入他们。
//入口与出口
//当流浪者在Level 11中一个特定房间中入眠并睡眠超过八小时后再打开房间门后将进入此处。
//在一些不封闭或是不包含特定出口中的层级中接触“雪”或是带有“雪”的字眼的物品都有极小概率传入此处。
//尽情深入吧，你可能可以从那里出去，看见他们所说的关于这个楼层的真正的现实。
//层级其余地区报告
//- 收起报告
//让我们开门见山的说吧，这里的中部是一条马路，这条马路比起城镇中任意一条道路都要长得多。关于“中部”这个定义嘛，倒有些模糊，总之可能是由于这个层级的特性吧，每个流浪者只要在与楼层相连的街道上游荡过久就会在不自知的情况下走上这里，实际上看楼层平面图时根本找不到这里。它的尽头与这里的的终点“中央广场”相连，不过能通向中央广场的路只有这一条。
//
//尽管这条马路四周比一般的道路宽大，但除了一条仅能供两人通过的小路以外，道路两侧统统塞满了大量落叶，它们保持着异样的金黄色，与刚从树上落下来的叶片无异，闻起来跟那些刚砍下的金黄稻谷无异，而且摸起来是湿湿的。落叶下面通常藏有一些杏仁水等物资，但是它们的刷新时间是不等的，这些落叶中深藏的物资是我们内部成员的生存依据。
//
//组成马路两侧的建筑与那些外圈的写字楼无异，但与外圈的写字相比它们的层数会更加的多，似乎接近20层。尽管他们看起来十分的气派，但千万不要跨过落叶堆靠近它们，我们并不知道在大楼的内部藏有多少处于“休眠中”的实体。值得庆幸的是，至今没有出现过一次实体突然对流浪者们发起攻击的现象，只要保持你不向大楼靠近，你就可以尽情搜索这里的物资。
//
//——由黄鸟中的队员撰写
//
//- 再听听吧。
//“寒冬腐蚀着你的身体，侵占着你的意识。你意识到死神将至，就只需要脱下你的衣衫，跪倒在雪地上，浸入黑暗中。你可以呓语些什么，尽管它们没有什么作用。在你的呓语之后、呼出来的蒸汽之后屹立着死神的身影，他挥舞着那把大镰向你冲来。请看着他吧，请你最后再好好看一次那个词语——‘死亡’。
//
//死神甚至不需要挥动那把镰刀，寒冷使他疲于去做这件事，他只需要看着你，使你心生恐惧。死亡播下的种子将依靠着恐惧疯狂地生长，只消一瞬间，死亡的种子就会生根发芽，长出瑰丽的死亡之花，你的性命就是它们的燃料。你快死了。
//
//现在，请认真回顾你的生命吧。无论是阳光下的沙滩还是湿热的丛林，至少有那么一个能让你感到这辈子里你所得到的体悟最深的感受的地方，去寻找它吧。如果没有带着它们进入天国的话，就乖乖地等待着被死神做成标本挂在那面墙上。
//
//这样你就会看见真正的现实。”
//
//你知道吗？讲真的，我原先觉得我这一辈子都不会进入这里的。
//
//听好了，这里是内圈的报告。虽然说是出于私心想要离开也好，本着为各位流浪者做贡献也好，我离开了原队伍并越过警戒线进入了这里。如果说外面的气候是严寒的话，那么这里就是冰雪所构建的、搭建而成的无上地狱，冷风与冰雨、雪雾们侵袭着我的身体，扰乱着我的视线。我现在什么也看不见！
//
//[狂风呼啸]
//
//有东西在移动！那是我对于这个世间产生的未知现象而萌发出的恐惧。它们变成了实体…！它们正向我冲来！！
//
//[喘息声]
//
//它们消失了，隐匿回了寒冬之中。现在我看见了一座巨大的圆形广场，它很气派，我想进去看看。等等……那是什么？！那里隐藏着更多的实体！我回不去了，我将看见他们所说的、关于这里的，真正的现实。
//
//你永远也回不去了。
//
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1212{}