//Level C-256
//评分: 
//+17
//+
//–
//X
// 
//
//生存难度：
// 宜居
// 
// 
//Level C-256是后室C层群的第256层。
//
//描述
//Level C-256是一家占据整个层级的后室古法“盲”人按摩理疗店。
//
//初次进入店内的流浪者将会被店内的无面灵理疗师进行全面的身体检测，并针对流浪者的具体情况进行理疗项目的推荐。经过理疗的流浪者在接受M.E.G.的医学检测后，身体状况均被证实有大幅度的改善。建议身体状况不佳的流浪者定期接受理疗。
//
//店内的通用货币是杏仁水。不同程度、时长、部位的理疗项目均以不同毫升的杏仁水进行结算。结算时使用浓郁、优质的杏仁水会得到理疗师的赞誉并成为店内会员，反之理疗师的态度则会下降。
//
//店内除理疗区外的大部分区域均为客房，住宿于店内的流浪者的衣食住行会得到保障。
//
//以下是理疗师分发给流浪者的一张传单：
//
//
//还在被腰腿酸痛而困扰？
//
//还在因体虚无力而迷茫？
//
//不用看了！就是我们！
//
//后室传统古法“盲”人按摩！给您超越前厅的体验！
//
//数十位特级无面灵理疗师，只为您的至尊体验！
//
//超大面积理疗/客房区，只为您的舒适安享！
//
//更有超多理疗项目！欢迎进店体验！
//
//精品奢华理疗，Level-C-256，盼您到来！
//
//
//（本店更驻有B.F.P.F.特级理疗团队为您服务，详情请店内咨询）
//
//实体
//理疗师
//Level C-256中存在的一种特殊的无面灵，这些无面灵整体数量未知，且分布在层级各个区域，通常对流浪者没有任何敌意。
//这些无面灵会根据流浪者的身体状况，为他们进行拔罐，刮痧，药灸等理疗。
//这些无面灵每过24小时会对层级中的所有幸存者进行身体的检测
//基地、前哨与社区
//流浪者聚集室
//一间面积较大的房间。
//第一次到达Level C-256的流浪者都会先出现在这。
//该房间聚集了许多流浪者，有的流浪者会乐意交易。
//B.F.P.F.理疗哨站
//该小队共有21人组建。
//他们大多数都精通理疗知识，并会协助Level C-256中无面灵给其他流浪者做理疗。
//有时也会亲自其他流浪者做理疗。
//由于只是理疗师，所以不会进行交易。
//入口与出口
//入口
//在Level 11进入一间理疗店
//在Level C-114，对一个医生无面灵说自己想要养生，医生无面灵会带你到Level C-256
//出口
//向无面灵请求离开，无面灵会将流浪者带到Level 11或Level C-114
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1256{}