//Level C-247
//评分: 
//+11
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
// 
//空洞现象
// 
//﻿
//
//描述
//iceberg-antarctica-polar-blue-53389.jpeg?cs=srgb&dl=pexels-pixabay-53389.jpg&fm=jpg
//科考队拍摄的图片
//
//Level C-247是一片冰雪覆盖且温度极低的大陆，流浪者将其命名为天极洲，天极洲包括天极大陆及其周围岛屿，总面积约1400万平方千米，其中大陆面积为1239万平方千米，岛屿面积约7.6万平方千米，海岸线长达2.47万千米，天极大陆95%以上的面积都被冰雪覆盖且另有约158.2万平方千米的冰架。天极大陆之外是无尽的海洋，海洋中层平均温度为3度，平均深度为1300米，含有较少种类的海洋生物。
//
//值得注意的是，位于天极大陆有数个极为规整的圆型空洞（无限接近于圆周率），几乎不可能是人类和普通实体的产物。正对此进行研究中。
//
//经过一些勇于探索的流浪者证实，Level C-247似乎是一个球形的层级，朝四周海洋航行最终都会回到天极大陆，初步估计赤道为40085千米。
//
//天极大陆外的海洋是极其不适宜航行的，终年被7500万平方千米断断续续的冰山围绕，初步探索证实天极大陆环海有不下31万座大型冰山，76万座中型冰山，226万座小型冰山。以及数量难以估计的微型冰山。
//
//想要在这里辨认方向是几乎困难的事情，单调且相同的白色沙漠会让你抓狂，所幸我们已经掌握L磁极的具体位置，两处磁极均不在天极大陆，磁极1位于（0,°125°），磁极2位于（180°,250°），可以依靠磁极性质制成的指南针判断方向（特殊磁极表示方位）。
//
//实体
//【鉴于该地的特殊性，不需列举实体】
//
//基地、前哨与社区
//幔核基地/科考站(原名319工程)
//
//目的:抵抗潜在威胁生物和非自然因素（圆）现象研究
//
//建设时间：原世界线开始后2014——2039年2049重建
//
//重建原因：
//原基地因资金缺乏暂时停工，后随着对地下的探索，似乎发现潜在威胁，经多次确认后，再次召集原基地人员重建基地/科考站。
//
//
//
//
//
//- 隐藏
//发展史（以下内容均为秋博士口述整理）：
//天极科考——随着流浪者对天极大陆的多次检测，有大量空洞出现，绝大部分是自然塌陷，有少数是陨石撞击。开始时一些博士并未在意，这还要从偶然发现的“圆”开始。不知何时有人看到了这个“圆”起初以为是自然形成，但他太完美了，经多次测试后，发现绝不是自然形成，那是直径五百多千米，深度无法估测的圆。随着进一步的调查，竟发现“圆”消失了，仿佛从未出现过一般。大家认为是航拍探测器出了点故障造成的，但两年后那个圆又再次出现。比之前的要大上几百米，但仍就保持规整且不变。
//
//随后建立了科考队编号16H319进行考察，但要知道圆周围有极光出现，这就意味着考察时间必须为冬季，气温可达零下50多摄氏度，没有哪个记录的先例会在冬天对天极大陆进行科考，但没办法，因为必须这样做。一年后圆果然又出现了，但科考队正到达位置时，圆竟然消失了，要知道之前圆的出现时间为一个月左右，而这次它仿佛知道会被人找到似的，一星期后便消失了。但既然科考队已经抵达，还是让我们去了那里一探究竟。当我们到达指定位置时，却感觉到一阵寒气，虽然身着隔冷服但仍然冻得发抖……
//
//【时间已屏蔽 地点已隐藏】
//
//“锤子。”队长说。
//
//队员将锤子递于队长，随着一锤下去，冰面竟仍未动静，锤子飞出了十几米远。
//
//“不然我回去拿电钻？”“没用，太光滑了，把握不了重心。
//
//队长去下手套触摸冰面，哪知刚去掉手套……
//
//“啊！开水，开水！”队长叫道。
//
//几瓶开水浇上去仍不解冻……回到科考站后，医疗队把队长的整只胳膊截了，那只胳膊如石头般落在地上。——后记
//
//第二天，由副队长吴柏辉领队再次前往“圆”。他想用红外线温度计测量冰面的温度，谁知温度计刚贴近冰面就炸开了。险些把副队长的隔冷手套炸裂，否则也是队长的下场。后面几天他们考察了周围环境，也只能进行这些了。
//
//一个月后，决定返回。我们把文献交给基地，至于说检样呢？无法获取，那冰面如钻石一般坚硬。”上级对科考成果感到深信不疑。显然，巧合已经说不过去了。于是再次派16H319进行考查。队长由吴柏辉担任，副队长由陈正彬顾问担任。下海对天极海域进行考察，计划9个月。
//
//深海探索一一天极常驻科考站建立后，又组织了一只新队伍对海底进行探索。这次探索放到前厅足以惊动世界了，即使在后室的探索中也是一个浩瀚的工程！若诺奖有地质学，证书发十次都不为过，不过如果保密了，起码能发个和平奖。
//
//当对天极海域进行探索时：“这海纳他妈坏了吗！组织还说这海纳值1500多万美金，我看都是放屁。”一个探索队员破口骂道，这也不奇怪，毕竟我们已经等了几十分钟了还没见反应器有任何动静。队长不得不让大家耐心等待，一小时后，一个令人吃惊的结果显示出来，海沟大于20000米。
//
//多次测试，深度并未消减，最终确定为大于25000米。“快！再找架海纳！”队长发话。随着不同方式的检查，上级决定深海探索。深海1800米之内有大量的鱼，偶尔会看到鲸鱼，2580米以下只有少数藻类植物，到3000米很少再见到生物，又下到了8000米，几乎已经不再有生命活动。10000米以下已经毫无生命迹象，再往下仍是如此。每天看到的都莫过于如此，直到接到新任务，浅水到30000米。看到这个任务我们很震惊，但也知道上级是不会开玩笑的。
//
//于是准备了充足的氧气后，我们下水了。到15000时，海洋尽管开着灯仍是一片漆黑，有一部分人开始呕吐。20000米时，有人开始头晕乃至昏迷，其中甚至有医护人员。于是暂时终止了这项计划，并开始返回。但次日仍要开始执行，经过多次建议但都被驳回，我们便只得再次上了路。这次潜水人很少，大多都请了病假（包括我），但大多都是心病。没走的基本都是被队长硬拉过去的，到了海底，还是一望无际的黑（我从地面监控上观察）。
//
//20000米时，潜艇扛不住水压，直接成了一块铁板。其实这次探索的结果是在所有人的意料之中的，基本上每个人都猜的到，组织在利用我们。吴柏辉在组织中还是比较有威望的，如果换成别人带队，下海的人超不过3个。吴柏辉死了有什么用呢？对尸体进行打捞，果真这次参与打捞尸体的人还是比较多的。
//
//组织将最新研制的抗压潜艇交给了新队长——罗栋杉，我以随行博士的身份强迫跟随下潜，正如吴柏辉之前所回报，一切都是一如既往的黑。4000米时，便没了去路，往下再也走不通了。
//
//骗局？我怎么也想不通，一个几万米的海沟，几个月内竟消失地无影无踪！“对地表采样检察！”队长说。此时潜艇伸出那双“钳子”对海底进行“开采”，采取十几样后，队长便令探测海底其余地域，他也根本就不相信海沟会自己消失。
//
//“报告，检查完毕！海纳并未探测到有深沟出现。”“继续检查！”队长再次下令道。但事实终究证实了我们想法的错误性，只得带队伍返回。但在检样过程中，竞发现土壤中有机物含量达到前厅平均土壤的1/23。“不可思议！”这是上级对本次探索的评价……
//
//后记：
//
//当第三只科考队再度考察“圆”时，已经毫无16H319考察那样。在耗资巨大，成果无任何进展的情况下，他们最终是放弃了考察。
//
//他们在这里选择了武器储备和研究。开始研究的都是导弹系统（为了保卫流浪者被动的探索局面），并未有什么太大突破，但随着一篇《导弹是武器突破的最大障碍》发表，在内部引起不小的轰动，内容为：传统技术将科技封锁，威力更大的武器必定是脱离物理技术的。
//
//随后专门召开会议讨论论文的现实性，一方认为应放弃物理技术寻找别的技术，得到更大的突破。另一方面认为论文纯属扯淡，至少百年内的重大武器一定是围绕物理技术发展的。随后针锋相对的气氛越来越浓了，甚至差点动手。
//
//没办法，会议就这样草率地结束了。不过对于可实施性而言，还是先将技术继续建立在传统武器方面。对于前方论点还是缓解了几个月。在研究物理武器方面，唯一突破比较大的就是核裂管，口径在30到40厘米，可以在水中开炮（能消灭大部分实体）。其他项目都在原地不动的状况。研究十几年后，资金资本耗尽，不得不终止项目。一切项目结果归MEG所有。至此耗资巨大，耗时26年的Level C-247的工作至此结束。
//
//只有剩下简陋的科考站和二十多名流浪者驻扎在那里……
//
//
//
//
//
//入口与出口
//入口：
//
//任何温度低于-35度的层级环境都可能传送至Level C-247。
//
//将任意层级某片范围内的温度，五秒内迅速降低20度会有接近百分之百的可能传送至Level C-247。
//
//更多入口待探查中。
//
//出口：
//
//在Level C-247中接触一个60度温度的物品即可随机传送至任意层级内的基地，前哨与社区。
//
//更多出口待探查中。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1247{}