//Level C-208
//评分: 
//+19
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
//较安全
//稳定
//实体绝迹
//Level C-208是后室C层群的第208层。
//
//描述
//Level C-208表现为一座包含正方形庭院和阁楼的六层独栋小楼，层级地表边长约30.48米，层级边界由一圈木制矮栅栏围成，栅栏无法翻越，栅栏外是无边的蓝色天空，天空中除卡通形象的太阳和白云外无其他物体。整个层级呈现出类似于粉笔和蜡笔涂画的模样，色彩较为艳丽。层级结构被证明是无法破坏的。
//
//7278e4b54ee22dac.jpeg
//Level C-208中的独栋小楼
//
//小楼高约20米，共六层外加一个阁楼，每层由一条走廊、一部楼梯和一到两个房间组成，楼梯之间由跨越楼层的走廊连接。虽然小楼从外部看上去十分窄小，但小楼内部却反常的宽敞。
//
//小楼共九个房间，每个房间门上都标有房间序号，各房间基本具备常见的家庭功能，包括客厅、浴室、厨房、书房、主卧室、次卧室、储物间和车库，房间内的设施均无法使用，但可以移动。
//
//房间中物资较少，且可摄入的饮品及食品被评价为“没有味道的”和“干硬的”。每个房间中都存在一些绘画在纸板上的人物，形象包括妇女、老人和儿童等，这些纸板人并非实体，不具有危险，尽管有流浪者坚持认为这些纸板人的目光一直在跟随自己。
//
//房间分布如下：一至三层分别为1、2、3号房间，四层为4和5号房间，五层为6号房间，六层为7和8号房间，阁楼为9号房间。
//
//9号房间相对较为特殊，该房间的出入口为位于六层走廊天花板上的一扇标有数字“9”的地板门。直至目前，9号房间内的具体情况仍然未知。曾有流浪者擅自进入9号房间后失踪，直到目前仍杳无音信，即使是摄像或无人机设备也会在进入9号房间几秒内失去影像并消失，消失前所拍摄到的画面仅为一片纯白色的环境。故不建议流浪者进入9号房间。
//
//庭院中存在杂草、石块、邮箱、狗窝、桌椅和秋千等固定物体，在这些固定物体附近存在一些可移动物体，包括但不限于石子、骨头、报纸、玻璃瓶、布沙袋和各种球类等1。流浪者需将某一可移动物品，用抛掷或发射的方式扔出并精准砸中小楼上一玻璃窗2，届时四周将传出类似玻璃破碎的声音，同时被砸中的窗户里将亮起黄色灯光3。此后，小楼的正门将自动打开。
//
//流浪者需要从正门进入小楼并自下而上到达六层，并原路返回。在返回过程中需从特定的房间内寻找并将自己扔出的物体带回庭院。此后该房间的灯光将保持照亮，但房间门将自动关闭，无法再次进入该房间。流浪者需使全部八个的房间4灯光亮起，并安全返回，即完成全部流程，方可离开Level C-208。
//
//在完成全部流程的过程中需要遵循以下规则：
//
//流浪者进入小楼后，需要按照所在楼层的房间数量改变自己的移动方式，目前仅两种方式：若该楼层存在一个房间，即“单房间”楼层，则需要流浪者以单脚跳跃的方式移动；若该楼层存在两个房间，即“双房间”楼层，则需要流浪者双脚分开大于等于肩宽并以双脚跳跃的方式移动，注意双脚应几乎同时离地或落地。通过两个楼层之间的楼梯时同样如此。
//若在去程过程中一个“双房间”楼层中有一个房间内存在抛入的物体，则流浪者需要遵循单脚跳跃的方式通过该楼层。若是“单房间”楼层则依然是单脚跳跃通过。
//小楼内的墙壁和天花板不可触碰，地板和楼梯不可用除脚以外的身体部位触碰。除此之外，房间内的所有设施和物品均可触碰。
//若违反上述规则，则将被一种未知且无形的力抛出窗外，此时流浪者会面临摔伤风险。目前M.E.G.已在小楼下方的庭院中铺设气垫，以减轻流浪者受到的摔落伤害。
//
//在Level C-208中无法通过团队协作使一部分流浪者同时完成全部流程，但流浪者们依旧可以互帮互助。
//
//每当一名流浪者完成全部流程后整个层级将会重置，层级结构不会发生改变，但庭院和房间内功能样式、设施布局和物品配置将随机变化。
//
//值得一提的是，20世纪50年代至80年代期间，Level C-208内的自然光照呈现出类似于正午的阳光，而在进入21世纪后，光照逐渐暗淡，并最终呈现出类似于黄昏时的阳光。尚不知产生这种变化的具体原因。
//
//基地、前哨与社区
//该层级不存在任何已知的基地、前哨和社区。
//
//入口与出口
//入口
//在Level C-8中游玩“跳房子”游戏5，若未一次性完成将进入Level C-208。
//更多入口正在探索中。
//出口
//完成全部流程可通过庭院的大门进入Level C-129。
//在4或5号房间中找到一条红领巾并正确佩戴将进入Level C-386。
//在7号房间中找到一条领带并正确佩戴将进入Level C-29。
//在2号房间中找到一张挂在墙上的奖状，并逐字逐句阅读奖状的内容，有一定概率进入Level C-16。
//更多出口正在探索中。
//作者信息
//« Level C-207 | Level C-208 | Level C-209 »
//
//Footnotes
//1. 这些物体无法带出层级
//2. 若窗户所在楼层较高，可以使用弹弓等工具
//3. 若利用非该层级中的物品则上述情况不会发生
//4. 9号房间除外
//5. 也称“跳飞机”，前厅一种儿童游戏
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1208{}