//Level C-254
//评分: 
//+25
//+
//–
//X
// 
//
//生存难度：
//等级 功能
//
//消费地带
//超量娱乐设施
//区域年龄限制
//Level C-254是后室C层群的第254层。
//
//描述：
//disney-919926_960_720.jpg
//Level C-254的入口附近
//
//Level C-254是一处具有娱乐功能的建筑群落，大约60平方公里，温度在14℃-26℃之间浮动，整个层级被划分为多个不同区域，各区域的昼夜循环各不相同，层级内部几乎都是和娱乐和消费有关的建筑和设备，有着强大稳定的Wi-Fi信号，内部有着繁多但并不特别明显的非欧几里得空间，即内部实际空间大于外部表现。所有建筑及设备由佩戴发声装置的无面灵进行操作和维护，流浪者需要支付比较昂贵的货币或杏仁水才被允许进入，而后在一定时间内畅玩各种设施，如果超过时间，无面灵会来提醒流浪者，如果流浪者仍拒绝离开，将会有无面灵安保部将其驱逐，并在长时间内无法再次进入。各区域分别有着自身的入口，但越往限制级的区域行进需要支付的价格也越高。层级内的食品、设施、药物都被认为是安全的。
//
//童话乐园：
//这是所有流浪者不论年龄都可以进入的区域，也是位于离入口最近的区域。昼夜循环为30小时，长白天，黄昏和夜晚都较为短暂，展现为庞大的、童话风格的、知名动画人物的游乐园，存在前厅游乐园近乎一切种类的游戏设备，例如摩天轮、旋转木马、过山车、鬼屋、碰碰车、海盗船、跳楼机、飞行塔、高架缆车等设施，质量与前厅中最高等级近乎相同，且其品牌与前厅知名娱乐公司相同，景点划分，建筑风格也完全类似。零散的小吃摊贩散布其间，可以随意免费享用，以及专供流浪者短期休息的钟点客房和意外受伤提供医疗的诊所。区域内有一座童话风格的火车站，存在多列童话风格的火车，此车站铁路与铁路网络连通，以作为连接一些其他层级的通道。除游乐园外还有装饰优美的公园、童话风格小镇，适合全年龄的点餐式餐厅，极具特色标志的奇幻童话城堡，均与前厅存在的知名乐园极为近似，其中充满了大众熟知的童话人物形象，此外本区域还拥有全年龄级的电影院，播放内容几乎全部来源于前厅，且会随着时间同步更新，为老少皆宜的动画和真人电影内容。
//
//日期：2020.2.11
//
//“太怀念了，真不敢想像在这个地方还能见到这里，而且不是面临危险，不过这地方进来一趟也确实够贵的，话说我们交的钱会到哪去？我猜无面灵收的钱不会给Disney，他们一定想不到这竟然有这么大的一个地方打着他们的名义营业，但是Disney法务部应该是追不到这来了。”
//
//——一名流浪者在留言板写下
//
//日期：2020.2.13
//
//“不，先生，在切入后室之前我是Disney法务部员工，如果能回去我会提起控告。”
//
//——一名现B.N.T.G职员
//
//商场步行街：
//oxford-315979_960_720.jpg
//Level C-254商业街区的一间零售商店
//
//此区域表现为一处20平方公里的繁华商场街道，24小时规律的昼夜循环，限制进入年龄为14岁以上，内部包括大量前厅知名品牌高端的零售商店、超级市场和购物中心。流浪者需要支付额外的货币购买商品，层级出售各种质量优越但价格高昂的食品、酒、生活物品、服装、电器、数码物品、书籍、家具、装饰品、珠宝、奢侈品，几乎囊括了能在前厅找到的所有昂贵奢侈商品种类，在购物中心内部可以很容易找到美食区，并在此点餐。此外步行街也有很多功能完备、装饰华丽的旅馆，可供流浪者住宿。区域同样拥有电影院，播放的电影和能购买的书籍内容属PG-13，开始出现一些暴力、强硬措辞和色情内容。最吸引人的地方是出售豪华车辆的4S店，同样包括近乎所有的豪车品牌，而且存在一些类似前厅车辆规格，但装饰更加华丽，颜色明亮，灯光绚烂且加速性能良好的，但不存在于前厅的豪华车辆，这些4S商店是目前在后室中发现的唯一可以无异常可由流浪者购买豪华车辆的地方，价格非常昂贵。购物中心和商场中还分布着不少的24小时电玩城和网咖，可供流浪者畅玩到在区域入口处购买的时间结束，其中的游戏和视频都会随着前厅时间同步发布和更新。
//
//日期：2020.3.16
//
//“开瓶香槟！祝贺我在后室的第一辆豪车！”
//
//“这些皮草、首饰和化妆品是我在前厅根本买不起的，现在竟然在这种地方买到了。”
//
//“上次跟兄弟们网咖开黑开了两宿，后来实在撑不住了，一醒来结果躺层级外边了，没办法这地方收费实在太贵了。”
//
//——流浪者们在留言板上的评价
//
//酒店度假区：
//restaurant-1837150_960_720.jpg
//Level C-254酒店内的景象
//
//由白色金属栅栏和大理石环绕的30平方公里的五星级大型酒店区域，建筑物超乎想象的庞大和宏伟，存在27小时的昼夜循环，白天很短暂，黄昏和夜晚相对较长，只有18岁以上的成年人可以进入本区域。酒店每间客房都拥有空调，阳台/露台，迷你吧，书桌，运行流畅的高规格电脑，卫星频道/有线电视，DVD/CD播放器，冰箱，淋浴设施，浴缸，吹风机，茶/咖啡机，免费瓶装纯净水、饮料、杏仁水，浴袍等设施和物品，客房的形制各不等同，包括室内别墅、单人豪华间，庭院豪华间，总统套房等。外部的设施同样齐全，包括但不限于：
//
//接待大厅（宽敞、豪华、光线充足，近旁有客人临时休息场所）
//中、西及异国风味音乐餐厅（装修豪华、风味众多，布局合理，并配有专门的厨房）
//咖啡厅（格调高雅，能完美满足高档下午茶需求）
//大型宴会厅（可以容纳300人正式宴会，配有专门厨房）
//酒吧、茶室、面包房（能提供名贵酒、茶、饮料和面包蛋糕）
//停车场（足够停车位）
//公共卫生间
//精品零售店（日常物品、旅游物品、纪念品和高档品牌服饰）
//通讯服务中心（紧急电话、网络、能在层级间传递的信件、传真、复印、行李托运、票务服务）
//医务室（充足药品和医疗器械，大量使用治愈水晶）
//洗衣房（24小时服务）
//便利店
//恒温游泳池（分为露天、室内）
//高档健身房
//SPA（水疗护理）
//游戏机室（包括大量高性能游戏机和电脑，供畅玩前厅游戏）
//棋牌室
//影剧场（播放含有血腥、暴力、不遮掩的色情内容）
//多功能厅（冷餐会、酒会、兼为派对大厅）
//网球场
//保龄球场（存在8道球道）
//桌球室（共计6桌）
//露天高尔夫球场（至少13洞）
//枪械射击场（枪支类型和弹药不计）
//高档赌场（几乎包含所有赌博游戏内容，道具制作精良）
//美容美发室
//婴幼儿看护及娱乐室（便于携带无法离身幼儿的父母）
//以上所有娱乐活动只要支付足额货币即可在规定时间内畅玩，均不额外计价，但由于其不加限制的特性，即使有充足财力，M.E.G.仍极不建议流浪者在此沉迷过多时间，否则将会很大程度影响流浪者日常生活。
//
//日期：2020.6.7
//
//“后悔来这了，告诫后来者干什么也千万不要赌博，我本来在Level C-214大赚了一笔，结果在赌场赔了个精光，现在倒欠了不少债。”
//
//——来自于一名刚从赌场走出的流浪者
//
//日期：2020.6.19
//
//“同意楼上，好在我及时收手，之后的余钱还够在这地方待上几天，在前厅都没享受过这么高档的服务，要不是钱不够真想一辈子待在这里。”
//
//“真不错，虽然叫美容室但是还真的很大，里面什么都有，过了大半天等我出去的时候男友竟然不认识我了。”
//
//——好评的流浪者
//
//
//
//【关闭访问内容】
//欢愉都市：
//alley-89197_960_720.jpg
//Level C-254欢愉都市街道
//
//拥有最特别入口的区域，其入口是从酒店区更深侧一道从天空垂下的深色幕布，欢愉都市完全停留在午夜时分，没有黄昏和白昼，其进入的年龄限制最高，24岁以上的人员才被允许进入，呈现为一座黑夜中50平方公里的小型城市，路灯和霓虹灯光虽然众多但仍处于光线昏暗状态。区域内充满了酒吧、夜店、KTV、歌厅、舞厅等娱乐场所，在其中可以购买到高档的啤酒、红酒、朗姆酒和烈酒，也有着高质量的，散发着多种霓虹光色的DJ音响设备，在本区域服务的无面灵衣着外观十分暴露，除发声装置外均会佩戴一种未知技术的头套面具，佩戴之后的无面灵拥有完全仿真的人类面容，可变化的表情，甚至是真实的面部器官，经佩戴之后的无面灵与普通人类几乎无异，皮肤保持类似涂油效果，呈现反光，半透明且顺滑触感。乃至于其中不少无面灵还会打扮成前厅知名动漫、电影人物形象，且其形象令人极富欲望。
//
//流浪者在都市娱乐设施进行一般娱乐的同时，无论男女均可与无面灵进行性互动，而且拥有众多专门的场所，此外，在街道上与任何游荡的无面灵进行对话，可以很容易的受邀请进入其居住公寓并进行互动，在区域内的无面灵体态种类众多，无论流浪者喜欢什么类型，癖好基本可以得到满足。这里的无面灵与其他机械且情感缺失的无面灵不同，不仅同人类一样拥有丰富情感，而且能像各种性格的普通人类一般与流浪者进行交流，每个无面灵会在家中常备多副面具，使他们能够以多种面容出现。
//
//由于留言内容过于露骨，经M.E.G.部门要求禁止在文档内转述。且理论上除特别批准外，M.E.G.人员被禁止进入‘欢愉都市’区域。
//
//
//
//
//
//Level C-28的暗夜，M.E.G.中阶主管林雨薇失魂落魄的走向政府大楼，她的脸上有着难以言说的失落。
//
//这里既是她的办公场所，也可以说她的家。中、高阶主管的办公室一般是和起居室相连，让他们完全可以在内部完成自己的生活需求。
//
//等她跌跌撞撞走进自己的房间，一头栽在了床上。
//
//虽然眼前的景象如此失真，但她却有了一种难以言说的安心感。
//
//该死，这一趟本来想在工作之余好好的放松放松，没想到却看到了那种令人心悸的场景。
//
//虽然每前厅年去一次Level C-254是M.E.G.新近增加的员工福利，所以林雨薇自己并没有花什么钱，她也不像大多女性有强烈的购买欲望，而且这一次除了那件事，整场旅行还是相当舒适的，但与她看见的事情相比，她宁愿自己没有去过。
//
//等第二天，她满心疲惫的去见自己的长官，Level C-28的高阶主管李玖夜。
//
//那个雪银发丝的少年怪异的看着她“雨薇，你不是刚在Level C-254休假回来吗？你是玩的太疯了？怎么现在还像没睡醒？”
//
//林雨薇怅然的回答“长官，如果我好好休假就不会这样，怪我这该死的好奇心，我真不该向监督者议会申请探查命令。”
//
//“探查？那地方还有什么我们不知道的吗？”
//
//“是的长官，一些秘密，后室中每个层级都有黑暗，那里也一样。”
//
//林雨薇尝试组织语言“虽然如果我们不去触碰，那几乎就可以忽略，但是它仍在那里。”
//
//“你看见了什么？”
//
//她轻叹“我去了欢愉都市。”
//
//看见李玖夜脸上那冰冷的笑意，她连忙解释“我向监督者议会申请了许可，我觉得那片地方还有一些东西我们了解的很少，所以我想去看看是否有些我们还没注意到的东西。”
//
//“刚进去的时候还比较正常，很多寻求肉体欢愉的男男女女，甚至一些大型组织的高管。”
//
//“我可没有想做那种事，一直在黑暗的街道上闲逛，直到我看见了那个入口。”
//
//“那看上去像是个通往地下商场的通道，之前好像在文档中并未提到，所以我进去看了看。”
//
//“但我希望我从来没有进去过。”
//
//“怎么，那里有什么我们不知道的事情吗？”
//
//林雨薇顿了顿，随后说“是的，长官，在那下面，我…看到了一个市场，不过出售的商品是…”
//
//“我也说不好那是什么，也许是…某种实体？但他们的模样，与人类无异。”
//
//李玖夜露出不可置信的表情“你说什么？有人在那里从事人口买卖吗？”
//
//“我说不清。我不能确定那究竟是不是人类，那些人就像是奴隶一样被束缚着，男人，女人，什么类型的人都有。”
//
//“我向管理的无面灵付了一些钱，问了他们一些问题。”
//
//“他们能和我交流，但不是流浪者，也不来自于前厅，他们完全不知前厅为何物，也没有在后室中流浪过。他们天生如此。”
//
//“所以，我不知道能否称他们为人类，还只是后室中诞生的和人类近似的某种实体。”
//
//“我还看到了一些人，一些其他大型组织的人，甚至是一些流浪者，向无面灵谈起了买卖。”
//
//“我不知道，也无法去指责，因为这些无面灵只是按照某种后室既定的规则行动。”
//
//“就像有流浪者说的，这个层级能满足一切欲望，无论合理或黑暗，甚至，也许某一天，我们也需要从那黑暗的角落中获得帮助。”
//
//她说完，两人轻轻叹息。李玖夜低头说“我明白了，我会报告这件事。”
//
//
//
//经监督者议会讨论决定，暂时隐藏此信息，同时根据事态发展决定是否进行进一步调查。
//
//
//
//
//
//基地、前哨和社区
//由于本区域的性质，虽然总有不少人员在此消遣娱乐，但无法形成真正意义上的基地、前哨和社区。
//入口及出口
//主要入口处的公路正北方可以通向Level C-214
//由主入口延伸的公路连接Level 11-Level C-28的公路网络，由此其他方向可以连接Level C-34、Level C-115
//层级中童话风格的火车铁路能够连接Level 11、Level C-8、Level C-28、Level C-34、Level C-214
//一些流浪者声称在酒店区域的一条冗长的地下走廊可以通往Level 5
//以上为稳定的双向通道
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1254{}