//Level C-232
//评分: 
//+18
//+
//–
//X
//关键词：Level C-232
//这是一个消歧义页面，罗列了所有与“Level C-232"相同或相似的标题，但内容不同的页面。
//
//有关“Level C-232"已找到4个页面，已按发布时间排序。如有最新页面，将自动排序到此页面最低端。
//
//-关闭
//各位流浪者同胞注意了！在电梯上不要按照4-2-3-2的顺序按按钮！
//具体是这样的，这天我登上电梯的时候，我随便按以上顺序的按钮。然后就发现了这个鬼地方！
//乍一看，我还以为这是一个安全的蛋糕店，至少它的装修看起来还行。
//然而，我马上就被这里的蛋糕吸引住了，很难描述是个什么感觉，就像是精神和视野被固定在了那坨鬼玩意上。
//也不知道过了多久，我瞬间就被一个飞来的蛋糕打清醒了，它还在往我的皮肤里面钻！而且简直就像在啃我的肉！随后，我就看见成百上千的蛋糕再向我靠拢。我的一条腿直接被一个飞来的菠萝包腐蚀了。
//好在我爬得够快，要不是我早点回到电梯里，我怕是就死在这了。
//
//目前，此流浪者已被安全转送至 Level C-114，根据流浪者的描述，暂时将此层级命名为Level C-232，M.E.G.已派遣成员进入此层级调查。
//
//-关闭
// 
//
//生存难度：
//等级 5
//
//极度不安全
//特定变化
//少量实体
//Level C-232是后室C层群的第232层。仅从外观上看，该层级为一个布置装潢温馨的面包店或蛋糕店。更多内容见下文描述。
//
//描述
//·Level C-232的装修风格表现为现代化的蛋糕店风格，长达20公里左右的柜台上摆满玲琅满目的糕点。同时，此层级没有收银台，但有少数自称“员工”的无面灵在走廊上游荡，它们状态消极且十分被动。
//·Level C-232似乎一直被柔和的暖光覆盖，由于良好且正常的灯光与温馨的布局，此层级常常给人的第一印象为浓烈的怀旧感与安全感，然而，事实却背道而驰。
//·Level C-232中随处可见的糕点被认为是此层级主要的危险源。当流浪者留意它们时，柜台上的糕点会向流浪者产生一种”信号“，流浪者会莫名的被其吸引至柜台近处，同时，墙壁上会凭空出现大量海报，内容通常由”后室独家“”无限美味“”享受随机“等带有陷阱色彩的标语与失真的蛋糕图片构成。1
//·受”信号“作用，当流浪者的身体足够靠近柜台时，较近位置的糕点将被未知力量牵引无视任何障碍地笔直“飞”到流浪者的脸上，同时糕点会以极快的速度分解并渗透进流浪者的肌肤，2并随即融入毛细血管进行”消化“。随后，所有的糕点都将缓慢逼近流浪者，甚至直接从柜台上坠落。任何糕点都有概率毫无征兆的砸向流浪者的身体，接触糕点会像上述文本描述一样开始消化。”消化“效果因糕点种类而异，但通常伴随着层级场景的变化和对人体危害极大的副作用，多种效果可以同时存在，“消化”效果叠加通常会导致更混乱的结果。
//
//1.提拉米苏
//效果：层级场景转变为二战时期的意大利街区，但是柜台依旧存在。震耳欲聋的爆炸声会在流浪者耳旁响起，同时所有的无面灵服务员的服饰会转换为纳粹德国的军服，并围聚到流浪者身旁进行”斥责“，”斥责“内容包括含糊不清的德语脏话与暴力的肢体攻击。流浪者通常会感到无端的羞辱与恐惧。”消化“结束3分钟后，效果消失，层级场景重回正常，无面灵服务员服饰恢复并重回被动。
//备注：意大利战场为什么需要德军镇压？
//
//2.草莓杯子蛋糕
//效果：流浪者的四肢会出现2到4条”切线“，鲜红的草莓味糖浆会沿切线流出。任何剧烈的运动都会导致肢体沿切线断裂，但是庆幸的是肢体的断裂除了剧烈疼痛外并不会失血过多，而且抢救及时，肢体可以通过沿切线夹紧断裂处重新接回并愈合。”消化“结束5分钟后，切线消失，如果抢救不及时，肢体断裂的情况可能无法挽回。
//备注：看到草莓杯子蛋糕向你袭来，赶紧跑吧。
//
//3.维多利亚水果蛋糕
//效果：层级场景转变为肮脏的公共卫生间，四周空气弥漫着氨气的气味。流浪者会感到剧烈的不适，据被体验的人声称，感觉就像是被食用了排泄物一样。3”消化“结束6分钟后，效果消失，层级场景重回正常。
//备注：真恶趣味…
//
//4.马卡龙
//效果：色彩不同的马卡龙“消化”后会给予流浪者不同的心理感受，如红色会让人愤怒且亢奋，蓝色则让人心情抑郁等。4同时，马卡龙的蛋白成分会直接转换为氨基酸，马卡龙也被证明有类似杏仁水的效果。
//备注：正常。
//
//5.黑面包
//效果：无，但由于黑面包的硬度过大，如果砸向流浪者后将不可避免的产生创伤，严重者可能造成休克。
//备注：物理。
//
//6.泡芙
//效果：泡芙的奶油成分将直接转化成原油，极度易燃。如果与慕斯蛋糕进行二次接触，将产生严重后果。
//备注：真正的油腻食品。
//
//7.慕斯蛋糕
//效果：层级场景转变为室外荒地，天空将下起奶霜雪，地面质感被形容为十分柔软。同时，火焰5将在流浪者肢体表面燃起，”消化“结束20秒后，效果消失，层级场景重回正常。
//备注：想象和泡芙接触是什么后果吧。
//
//8.菠萝派
//效果：与菠萝派接触的皮肤表皮将直接溶解，造成剧烈阵痛。
//备注：菠萝本身就可以溶解蛋白质。
//
//9.饼干
//效果：层级场景转变为昏暗的储藏室，所有无面灵将转变成前厅中流浪者记忆中的幼时“欺凌者”的形象，将对流浪者进行殴打与勒索，勒索内容包括抢走流浪者身上的贵重物品。“消化”效果结束15分钟后，层级场景重回正常。
//备注：这就像小时候最讨厌的人抢走了你身上唯一的零食一样。
//
//20.巧克力熔岩蛋糕
//效果：层级的地板转变为凝固的黑曜石，1000摄氏度的熔岩将不断从地板渗出。与蛋糕接触的肢体部分将产生灼烧感。“效果”结束10分钟后，层级场景重回正常
//
//E-1.仰望星空派
//淆果：啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊魇靖！！！！！
//备注：再次见面∴)
//
//E-2.生日蛋糕
//效果：这是妈妈给你最爱的生日礼物，忘记了嘛？妈妈爱你。
//备注：要找到我哦。
//
//E-3.画有笑脸的蛋糕
//效果：欢迎派对=）
//备注：不要再来了！
//目前仍有许多效果是未知的。
//
//
//•现在暂不清楚走廊尽头的细节，有关柜台的长度目前仅由激光探测器测量。
//基地、前哨与社区
//出于明显原因，本层级不存在任何社区和基地
//
//入口与出口
//入口
//在偶然情况下，流浪者会在任何有室内环境的层级内发现舱门打开的Entity-81，即电梯。进入后按照某种特定顺序按下不同按钮则会将流浪者带到该层级。
//（不推荐）在极偶然情况下，停留在电梯内超过44分钟不操作按键时电梯仍未自主运行，在这种情况下操作随机按键会导致电梯开始运行并将流浪者送到该层级。（注意：该方法不稳定且成功率较低。）
//出口
//正常情况下，流浪者只能通过从电梯进入该层级，若需要离开则原路返回即可。
//-关闭
//M.E.G数据库论坛备份_2022_5_17_12_40_11_H3458HE2
//讨论串标题：去哪个5级生存难度探险合适？（旧）
//讨论串状态：备份
//讨论串创立者：用户Cheng
//讨论串创立时间：2022年5月25日13时20分01秒
//最后回复：2022年5月26日20时34分11秒
//
//2022.5.25.13.20
//>>用户：Cheng
//如题，我想找一个5级的地方探探险，有有经验的流浪者出出主意嘛?
//>>用户：Doppler leaf
//？为啥要去5级，level8,9,909那种吗(°д°)
//>>用户：chroma Vox
//你怕是有病…
//>>用户:Cheng»RE:用户：chroma Vox
//谁叫level 11的生活那么无聊呢，我在坠入后室之前就热爱野外探险，你要是不想讨论此话题，那么就离开这个讨论串。
//>>用户：chroma Vox»RE:用户：Cheng
//抱歉，只是个人感想。这么看，最近的那个Level C-232挺合适的，要去也挺简单。（但我还是不怎么推荐你去）
//>>用户:Cheng»RE:用户：chroma Vox
//让我看看去。
//2022.5.25.13.25
//>>用户:Cheng
//看了，确实很合适，话说这个文档是不是还没写完，给的信息也太少了吧。
//>>用户:Atha2a»RE:用户：Cheng
//我看这个文档倒像是带点儿实体污染，话说，我已经很想吐槽这个极度危险了。信息内容里面怎么不像那么危险啊，就算蛋糕会使你陷入困境，但是电梯门又不消失啊，跑几步还是可以回去的，就像之前的那个流浪者。
//>>用户:Cheng»RE:用户：Atha2a
//就是，你看最近的层级，一个个还写不全（全部标注未探索完毕我也是服了）。我的想法就是尽量探索新层级，没准还能得到点新资料造福流浪者呢。
//>>用户:Atha2a»RE:用户：Cheng
//你就是想红罢（笑）也行，话说都讨论到这个份上了，就把标题改一下吧，免得让人认为我们是疯子。
//用户Cheng已将此讨论串标题修改为“层级探索 Level C-232”
//>>用户:shortopia
//我去，还真改了。
//>>用户:GOOD dash
//话说楼主在level 11哪呢，我想去一块探险。（我之前也去过level C-28，对付危险层级我还是有点经验的。）
//>>用户:Cheng»RE:用户: GOODdash
//家居酒店。如果可以，到地儿联系。
//>>用户:GOODdash»RE:用户: Cheng
//2022.5.25.14.21
//>>用户：chroma Vox
//我的天啊，他们怕是真去了。
//2022.5.26.8.11
//>>用户:Atha2a
//卧槽，都过去一整天了。他们怕是寄了吧。
//>>用户:xxxZigma»RE:用户: Atha2a
//虽然说一般这种讨论串都是钓鱼之类的，但我看这个真不像…不是，后室还真有这种分不清调侃和真实建议的人吗？
//>>用户:Atha2a»RE:用户: xxxZigma
//可能，但还是先报告Meg总部吧，没准他们真进去了。
//>>用户:temzpizo»RE:用户：Atha2a
//
//快！
//>>用户:komaka
//我去问了家居酒店的人了，那两个人真去了，而且压根不是什么资深后室探险家。那他妈是两个看起来不到20岁的小鬼！就因为他们带了点治愈水晶。
//>>用户:temzpizo»RE:用户：komaka
//艹
//>>用户:bombBom»RE:用户：komaka
//为什么最近不理性的流浪者这么多啊！
//>>用户：chroma Vox
//后室就是一个拼接了不同层面上的人的畸形社会…
//2022.5.26.25.25
//M.E.G.已将此讨论串备份
//
//- 关闭通知
//M.E.G.在此先声明道歉，由于我们最近的疏忽，我们没有像往常一样重视层级的编写，进而导致了最近的恶劣事件。
//其次，我们建议每个年轻流浪者不要将自己的生命开玩笑！探索5级生存难度极度危险！Level C-232 的事件就是极端的例子。我们没有能力去阻止每个人去探索电梯进而进入此层级。如果你想直面危险，请务必做好准备。
//
//
//
//
//
//
//作者信息
//« Level C-231 | Level C-232 | Level C-233 »
//
//Footnotes
//1. 此现象很难被流浪者本人发现，一般是被分散注意力后发现的。
//2. 甚至包括非糕点本身的成分，如水果装饰等。
//3. 然而我们并不知道此人之前是否真食用过排泄物：（
//4. 虽然在这里也可能压根没有抑郁的机会：（
//5. 颜色因蛋糕本身而定。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1232{}