//Level C-265
//评分: 
//+11
//+
//–
//X
// 
//
//生存难度：
//不安全且不稳定
//危险环境
//极度难以生存
//Level C-265是后室C层群的第265层。该层级是根据已牺牲调查员的报告和实验室后续研究总结而来。
//
//描述
//photo-1603181515710-eb48bc3a9a1d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8M3x8JUU2JUIyJTk5JUU2JUJDJUEwfGVufDB8fDB8fA%3D%3D&auto=format&fit=crop&w=500&q=60
//荒漠的沙地。
//
//Level C-265是一片面积约2.2平方公里的贫瘠荒漠。荒漠由沙地和丘陵组成，层级内没有任何植被，也无其他生命迹象。层级的部分区域有巨石堆叠的结构，尚不清楚是否是建筑遗迹。层级的周围被透明的墙壁包围，墙壁非常的坚固，无法被破坏。
//
//层级的沙地区域十分的不稳定。据调查报告指出，该层级的沙地区域似乎有部分的中空结构，仅有表面有较薄的沙子覆盖，其下方是中空的孔洞。部分暴露在外的孔洞内部充满着一种黑色的粘稠液体，经研究发现这种黑色粘稠物质为焦油1。曾驻扎在此的调查人员利用探测设备发现沙地的地面30米以下有错综复杂的地下暗河系统，但因地下河深度过深，调查人员只能根据猜测认为地下暗河内也是充满了焦油，暗河内部分的焦油溢出到了塌陷的洞窟区域。
//
//Level C-265内没有昼夜循环，始终保持在正午时分，这导致了该层级内的气候十分炎热，气温基本维持在35℃左右。该层级的空气当中弥漫着一股非常浓重的臭味，臭味的来源是该层级内充斥的焦油，该层级的空气中有大量弥漫的焦油分子。这种分子似乎具有感染和同化的能力，十分的危险。
//
//焦油瀑布
//这是一个在层级一侧的峭壁上发现的瀑布，但瀑布上奔涌而下的液体并不是水，而是焦油。瀑布的高度大约为44米左右，平均宽度1.5米。瀑布流下的焦油直接落入下方的焦油洞窟，并渗入沙地之下且可能汇入了暗河之中。
//
//调查人员曾用无人机试图找到瀑布的来源，但使用无人机到达指定高度后，只看到了绵延无限长度的焦油河。无人机在河流上飞行一小段距离就被墙壁阻挡无法再前进，所以对这条瀑布的形成原因无法进行探索。
//
//危险因素：焦油分子
//该层级内的空气中似乎弥漫着一种特殊的焦油分子，这种特殊的焦油分子十分的危险。根据曾经驻扎的调查人员带回的报告以及对他们的遗体解剖和后续的小白鼠实验，发现这种焦油分子可以慢慢的腐蚀和破坏机械结构，并且会像病毒一样感染人体，通过人体的血液系统和淋巴系统流经人体的全身各处并将人体的组织同化，导致流浪者死亡。
//针对焦油分子的研究发现，该分子可以直接穿过防毒面具等呼吸型过滤防具，且具有特殊性质：该分子似乎只有在接触到生物时才会触发感染的特性，在任何可达到的条件下都无法与其他物质进行化学反应。
//在实验室中针对探索层级的人员带回来的焦油样本的研究发现，此层级内的焦油性质与前厅的焦油有很大的不同。该层级的焦油味道更重，且物理化学性质与前厅的大相径庭。实验分析发现层级内的焦油无法通过提取纯化加以利用。其熔点为5℃，达到30℃会开始挥发，在空气中以一种未知的方式转变为具有高度感染性的焦油分子。
//M.E.G.的科学家们提出观点认为该层级的焦油实际上是一种还未发现的极其微小的聚合性实体，在达到挥发点时会挥发到空气中，成为单个的焦油分子实体。但目前在实验室中的各种针对其生物特性的研究均没有取得进展，所以此观点目前存疑。
//2022年3月17日，M.E.G.在Level 2内发现了一具尸体。尸体通体呈黑色，且散发出焦油的臭味。目前M.E.G.已将死者的遗物整理完毕，并对其进行了尸检。
//
//M.E.G.在这名的流浪者身上发现了一本日记，以下是日记的内容。
//
//- 关闭日记
//第一篇
//我今天在Level 2里面瞎逛，看到了一个滴着焦油的管道，这个管道还挺大的。我也不知道我突然犯了什么病，我钻进去了。我在里面爬了一段时间，看到外面有亮光，然后我就来到了这个该死的地方。
//
//话说这地方是真的特别的热啊，我带的东西其实不是特别的多，不过我带了挺多的补给，应该还能生存的一段时间。本来我是打算到在线数据库上看看是哪个层级来着，但是我发现这鸟地方没有Wi-Fi，所以我只能先记在笔记本上，到时候出去再说。
//
//这地方的空气是真的特别难闻，有股恶心的臭味，很像那种焦油的味道。话说我在里面绕了一会，然后我走到一块沙地的边上，嘭的一声我一头怼到了空气墙上，我用手摸了摸头，然后试着碰了一下我刚撞上的地方，好像不能穿越，是一个真的墙。我摸着墙一路走，走了一段时间，然后我发现我走回来了。我才发现这地方是个封闭的地方，而且看起来面积也不大。
//
//这里除了沙子还是沙子，还有那些奇奇怪怪的石头，我也不知道是干啥的，哦对了，有个地方有个特别高的瀑布，瀑布上流下来的是一种黑色的东西，我不知道是什么，但是肯定不是水。
//
//这鬼地方真的太热了，我还是先休息一下吧，我还得想想怎么从这个鬼地方出去。
//
//第二篇
//啊，我睡了一会，热的我只睡了一会。我感觉我好像有点不太舒服，有点咳嗽，我平时也没啥呼吸系统的疾病来着，我觉得可能是这儿的空气太难闻了，有点刺激到呼吸道的感觉。我吃东西的时候感觉嘴里有股很奇怪的味道，这种感觉真是恶心。
//
//我在这地方的沙地上走着，看看有没有门或者什么特别的地方能出去，结果有一块沙地突然就塌陷下去了，玩他妈被吓了一大跳，还好我用手勾住了沙地边上一块凸起的石头，很费劲的爬上来了，我感觉我要是掉进去就寄了。我爬上来之后趴在那个洞口看了一下，我发现洞口还挺深的，下面都是一种黑色的液体，应该也是焦油。我也没啥能下去的工具，只能猜一下了。
//
//我感觉今天特别的累，不知道为啥，我感觉我今天的运动量还没昨天大，也就在里面随便走走，也没做什么特别费体力的活动。而且我回休息的地方的时候，我发现我皮肤上有一些颜色有点深的斑块，我试着擦了一下，发现擦不掉，我觉得应该是刚刚沙地塌陷溅了点焦油在我皮肤上，算了我还是出去再洗吧。
//
//第三篇
//我感觉我的头很疼，而且我皮肤上那些斑块颜色更深了，有点发黑变硬。我的咳嗽更加严重了，我感觉我快把肺都咳出来了，我这是怎么了，我不明白。我在这停留的两天，也没被实体攻击过，也没碰什么奇怪的东西，我感觉我行动都开始迟缓起来了。
//
//我发现我的鼻子和耳朵里好像有什么液体在流，我擤了一下鼻子，发现里面有一些黑色的东西。操，我都不知道这是啥东西。后来我在休息的时候费力的弄了点东西吃，结果没过多久我吃进去的东西全吐出来了，而且里面也有那种黑色的东西。
//
//我突然发现我看东西好像变的有点暗，就像戴着墨镜一样，而且这种情况越来越严重了。我到现在还没有找到出去的地方，我拖着沉重的身躯试图在各种地方切出这个层级，但是尝试都失败了。
//
//这个地方也太恐怖了，我感觉我当初真的不应该去好奇爬进那个管道，我不知道我会不会死在这里，也不知道会不会有人再进来。我感觉我越来越行动不了了，我不会死在这里吧，我好害怕，我感觉我的视野越来越黑了。我……
//
//
//第四篇
//我要死了，我感觉我要死了，救命……
//
//
//- 关闭日记
//基地、前哨与社区
//由于该层级极度危险的环境性质，无基地、前哨与社区在此建立。
//入口与出口
//入口
//在Level 2内发现一个滴着焦油的开放式管道，爬入即可进入该层级。
//2022年4月4日，M.E.G.在Level 2内又发现了几具焦黑的尸体，经确认为M.E.G.派出的几名全副武装调查Level C-265的人员。M.E.G.随即封锁了入口。
//出口
//根据死者留下的证据表明该层级无法切出，似乎只有在流浪者死亡之后才会被送回到原层级。
//M.E.G.目前公布了其中一名死者的尸检报告简版，以下是报告内容。
//
//- 收起尸检报告
//M.E.G.医学中心尸检病理报告书（简版）
//
//尸检号：M.E.G.医学中心第1105号尸检
//
//鉴定单位：M.E.G.医学中心
//鉴定缘由：鉴定AD2的死亡原因
//解剖日期：2022年3月17日
//报告日期：2022年3月18日
//负责人员：ZX CC RTX
//
//一、病理学检查
//
//〔一〕、尸表检查
//
//死者姓名为AD，32岁，身高181厘米，体重81公斤。发育无异常，营养状况良好。尸体未发生尸僵，未见尸斑。尸体皮肤通体呈黑色，皮肤完整无破损。头发黑，头皮完整，眼部黑色侵染，无法分辨具体结构。口唇黑色，口鼻腔及双侧外耳道见黑色分泌物。气管居中，胸廓对称，腹壁偏硬，敲击有回音。四肢无畸形，指、趾呈黑色。
//
//〔二〕、内部检查
//
//死者的体腔内充满黑色的粘稠液体，皮肤上大块黑色斑块覆盖。头颅的部分区域被感染成黑色，神经系统异常。内部器官均已被感染成黑色，大部分器官坏死。体内体液均被感染成黑色粘稠状液体。骨骼仅有少部分被感染成黑色，骨髓未见异常。
//
//〔三〕、尸检病理学诊断
//
//1.可能与血栓形成诱发脑卒中或肺栓塞死亡
//2.可能与过度感染导致多器官同时衰竭死亡
//3.可能与其他还未发现的原因有关
//
//二、结论
//
//由于尸体被严重感染且出现多种可能的死因，暂无法确定其死亡的真实原因。仅能确定其死亡时间为2022年3月16日。
//
//尸检病理检验报告人：ZX
//2022年3月18日
//
//- 收起尸检报告
//作者信息
//« Level C-264 | Level C-265 | Level C-266 »
//
//脚注
//1. 此处及下文中均指煤焦油。
//2. 报告中涉及人员的字母均为姓名首字母缩写。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1265{}