//Level C-200
//评分: 
//+47
//+
//–
//X
// 
//
//生存难度：
// 
// 
// 
//Level C-200是后室C层群的第200层。
//
//描述
//Level C-200为一由流浪者自身情况而改变的层级，据目前已知的所有进入过该层级的流浪者对该层级的描述，每个流浪者进入该层级所遭遇的场景无完全相同之处，但所有流浪者在刚刚进入该层级时的场景都为黑暗状态。且在该层级内无法与其他流浪者相遇，若遭遇到人形生物，那不是其他流浪者。
//
//几乎所有流浪者称，其在该层级内所遭遇的场景极其熟悉，并感到恐惧。在此时，部分流浪者附近会出现实体或是人形生物，其通常对流浪者表现出极大的敌意；而未遭遇实体或人形生物的流浪者将会在此感到恐惧感再次加重，其空间环境也会根据流浪者的内心创伤处所改变。据调查，其所遭遇的内容多为童年时的记忆。
//
//目前我们对该层级仍并非十分了解，若有过疑似进入Level C-200的经历可于M.E.G.档案部报告。
//
//实体
//未查明，疑似存在实体。
//
//基地、前哨和社区
//由于该层级的异常性质，无任何基地、前哨和社区。
//
//入口与出口
//入口
//多次在脑海中沉浸于自己先前所受到的创伤中。
//在梦境中，充满自己小时的梦魇。
//时常因一些环境或事件回想起创伤。
//以上皆有可能导致流浪者进入Level C-200，其余进入方法待补充。
//
//出口
//暂未知。
// 
// 
// 
// 
// 
// 
// 
//
//夜晚，你逐渐陷入梦乡，这是你最讨厌的事。日日在梦中都将回想起那自己所不愿面对的事。
//
//她，抛弃了你。
//
//一声坠落，身后坚硬的木板转为冰冷的混凝土地面，陷入了伸手不见五指的黑暗。
//
//伸出手去触摸，摸到了同样冰冷的墙面。灯光逐渐亮起，你发现手上沾满了油漆。嗅闻着手上未干燥的液体，这充满甲醛的味道使你想起那并不美好的回忆。
//
//看向被照亮的墙壁，那墙壁被粉刷的如此纯洁，侧头望去，是片黑暗，这黑白渐变，产生了鲜明的对比。
//
//你的面庞犹如墙壁般惨白，毫无血气。
//
//曾经的场景在你的脑海中回溯，这是梦吗？
//
//这是现实，你回到了这里。
//
//你的手掌貌似变成了孩童般的模样，那片黑暗对于幼小的你，犹如即将毁灭的末日。
//
//向背后望去，是个面部模糊的女人，正在转身，从你身后远去。
//
//此时，你的背后出现了一面墙壁，向你推挤。
//
//你不由得向黑暗走去。
//
//走啊，走啊，走。
//
//你迷失了方向，忘记了回去的路。
//
//瘫坐在地上，声嘶力竭地喊着：
//
//“妈妈！”
//
//这是你永不得以磨灭的梦魇。
//
//你处在崩溃的边缘，仿佛这黑暗就要将你吞噬。
//
//突然，你找到了方向。
//
//似乎上天为你指引了一条路。
//
//你向前方奔去，不知为何，你忘记了恐惧。
//
//你看到了她。
//
//你冲破了她。
//
//你醒了。
//
//打开手机，是那张照片。
//
// 
// 
// 
//
//通知
//近日多名流浪者提供了该层级的相关信息，故该文档得以更新。向下继续浏览以查看更新内容。
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
//
//部分流浪者提供的描述
//一
//
// 
//
// 
//
//3
//照片，并未拍摄到任何实体或人形生物。
//
//该流浪者所遭遇的场景为一无限重复的街道，街边灯光始终照射向该流浪者。由于该流浪者对宽阔且较为重复的区域感到恐惧，在进入该层级约5分钟时便感觉到心悸、流汗等症状。
//
//后该流浪者称其被一人形生物跟踪，且其试图对该流浪者进行攻击。但所拍摄的照片中并未出现该生物，暂推测该人形生物为该层级异常性质带给该流浪者的幻觉。
//
//该流浪者称，其在14岁放学回家的路上曾被跟踪，并导致右臂被利器划伤。在此之后对宽阔且较为重复的区域感到十分恐惧。
//
//
// 
// 
//二
//
// 
//
// 
//
//1
//照片。
//
//该流浪者所遭遇的场景为一近似卧室布局的房间。门后不定时传来如砸击、打斗、哭泣与尖叫声等，且门把手会不时进行转动，在转动过后会出现谩骂声，谩骂声中的姓名为该流浪者的真实姓名，该门无法开启。
//
//流浪者所遭遇的该场景书桌、床与书架等家具上的物品摆放极其混乱，灯光不时闪烁，地上留有一些干涸的血渍，窗外十分黑暗，且该窗户无法打开，玻璃无法被损坏。该流浪者在该层级中同样感到恐惧心理，并开始哭泣、自责，甚至在约10分钟后试图自尽。
//
//该流浪者称，其学生时代时常遭到家暴，也曾在16岁时试图割腕自尽。
//
//
// 
// 
//三
//
// 
//
// 
//
//4
//照片，此时流浪者还未开始攀登。
//
//该流浪者所遭遇的场景为一重复的楼道。在刚刚进入该层级时，流浪者便感受到下方传来脚步声，并促使流浪者通过楼梯向上攀登，此时流浪者称感到十分紧迫，并且充满危险。并且该层级内每层的楼梯阶数与每一阶的高度会随着流浪者在该层级内停留的时间而增长。
//
//这一场景使得该流浪者在该层级中感到恐惧，并在攀爬一段时间后逐渐感到疲劳，出汗量也会不断增加，但体力仍未减小。据推测可能是恐惧感导致肾上腺皮质释放肾上腺素才使得该流浪者体力得到保持。
//
//该流浪者不愿向我们透露其先前遭遇。
//
//
// 
// 
//四
//
// 
//
// 
//
//3
//照片。
//
//该流浪者所遭遇的场景为一极其宽阔且正在翻修中的大型商场。该场景极其昏暗，而且灯光亮度随着流浪者的深入而减小，在该流浪者探索入一定距离后，陷入了几乎完全黑暗的环境中。并且在该场景中，远处会时常传来未知的回声，该流浪者对回声的描述为“这令我十分恐惧”，并感到身后被跟踪与监视。
//
//在该层级中该流浪者感到恐惧与迷失，在向内探索后，无法找到返回的路径。在约15分钟后开始哭泣，并瘫坐在地上，不停呼喊“妈妈”二字。
//
//该流浪者称，其约10岁时，被其生母遗弃于商场的消防通道中。该流浪者迷失在该商场的装修区并度过一晚后，被其他人带出。
// 
//
//
// 
// 
//据目前所收集到的内容，可得出虽进入该层级的流浪者会遭遇对其造成创伤的相关场景，但在该层级停留一段时间后便会逐渐开始面对自己曾经的创伤，这些流浪者在离开该层级后大多数都从此困境走出，并更敢于直面恐惧。而在该层级中无法受到任何伤害，即使在其中受到或对自己做出一些伤害行为。并且该层级对流浪者起到了引导作用。
//综上所述，故将该层级生存难度修改为生存难度0。
//
// 
//
//生存难度：
//等级 0
//
// 
// 
//无实体
// 
//
//实体
//未查明，疑似存在实体。据目前的所有报告与调查可得，该层级的一切“实体”均为该层级异常性质所对流浪者造成的幻觉，在该层级内无真实存在的实体。
// 
//
//入口与出口
//出口
//暂未知。在引导下敢于面对自己的创伤后，缝合裂痕，击碎梦魇，即可离开该层级。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1200{}