//Level C-277
//评分: 
//+9
//+
//–
//X
// 
//
//生存难度：
//等级 3
//
//不安全
//不稳定且不宜居
//实体绝迹
//为了区分新旧文档，我们在修改部分用紫色特别标明.
//Level C-277是后室C层群的第277层，此层级只能容纳一名流浪者，且内部没有实体。
//
//描述
//Level C-277是一间米色的封闭房间，其大小约有1 000m³，其墙壁和地板 具有粘性和腐蚀性。
//
//每当流浪者移动10步，整个层级会下降一级台阶的高度，大小也会随之减小。
//
//当层级缩小到只剩400m³时，墙壁与地板逐渐出现大量尸骸，且出现 红色 的字，初步推断是流浪者所写的。
//
//当层级缩小到只剩██m³时，墙壁上的尸骸相继脱落，铺满底部，随后墙壁凝固，不再具有粘性和腐蚀性。
//
//墙壁和地板会一直缩小到流浪者被挤压而死，随后，墙壁和地板再次具有粘性和腐蚀性，与流浪者的尸体完全融合后，层级恢复到原本的样貌。
//
//灯光
//一般情况下Level C-277内十分明亮，但在层级内未发现任何可发光设备。随着时间推移层级会逐渐变暗，直到亮光完全消失，待流浪者死亡后恢复常亮，去此层级请务必带上手电筒。
//
//墙壁和地板
//Level C-277的墙壁和地面都具有粘性以及腐蚀性。移动会变得十分艰难；腐蚀性不强，但长时间接触会导致组织融化，然后与墙壁或地面完全黏合在一起。
//
//基地、前哨与社区
//由于Level C-XXX只能容纳一人所以无法设置基地、前哨与社区。
//
//入口与出口
//入口
//当上一个在这里的流浪者死亡后，那么接下来所有人都有到达Level C-277的可能性。
//出口
//仍在寻找当中。
//⚠️注意⚠️
//以上文档内容已不适用
//此层级资料于2022年5月14日更新
//以下为最新版本的文档。
//
// 
//
//生存难度：
//等级 3
//
//不安全
//不稳定且不宜居
//实体
//Level C-277是后室C层群的第277层，此层级只能容纳一名流浪者。
//
//描述
//Level C-277是一片碧绿的原野，附近有一条清澈的河流。但流浪者进入此层级时不会在这里，而是在一只实体内部，其大小约有1 000m³，实体具有粘性和腐蚀性。
//
//每当流浪者移动10步，实体会下降一级台阶的高度，大小也会随之减小。
//
//当层级缩小到只剩400m³时，实体逐渐露出大量尸骸，并出现七个狮子的头，最大的狮子头上有十只角，十只角戴着十个冠冕，且出现 红色 的字，这些字已被证实是实体所写。
//
//
//可悲的人类
//加入我们，你将获得救赎
//
//
//
//当层级缩小到只剩██m³时，实体上的尸骸相继脱落，铺满底部，随后实体死亡，不再具有粘性和腐蚀性。
//
//死去是为了获得新生
//
//
//
//实体会一直缩小1到流浪者被挤压而死，随后，实体复活，再次具有粘性和腐蚀性，与流浪者的尸体完全融合后，层级恢复到原本的样貌。
//
//汝不必担心，不必害怕，跟随着我
//吾将永远在你左右，永远，永远… …
//
//
//生命
//一般情况下Level C-277内十分明亮，但在层级内未发现任何可发光设备。随着时间推移层级会逐渐变暗，直到亮光完全消失，待流浪者死亡后恢复常亮。去此层级不能携带手电筒等一系列可发光设备，光是实体的生命。
//
//
//感受这圣洁的亮光，这是吾给予你的恩惠
//
//
//“使徒”
//Level C-277的实体为固液共存态且具有粘性以及腐蚀性。移动会变得艰难，腐蚀性不强，但长时间接触会导致组织融化，然后与消化系统完全黏合在一起。当流浪者死亡后，实体腐蚀掉了除骨头外的所有组织。经过检测发现实体内有11具还具有生命特征的“尸体”，尸体的皮肤被实体替换成白色，且具有自我意识并服从于实体，当实体受到伤害时会从墙壁钻出，攻击施与伤害的人。2
//
//
//
//相信我，跟随我，服从我，将汝的生命奉献给我
//我将为你展现一个全新的世界
//
//
//
//基地、前哨与社区
//由于Level C-277只能容纳一人所以无法设置基地、前哨与社区。
//
//入口与出口
//入口
//当上一个在这里的流浪者死亡后，那么接下来所有人都有到达Level C-277的可能性。
//出口
//有一定几率意外切入level C-88
//在下台阶时有中等概率切入level C-13
//在与墙壁相隔一定距离时冲向墙壁会切入level C-499
//在层级内跪下闭眼祈祷666秒，睁开眼后你会到level C-192
//
//
//隐藏
//曾有一名流浪者使用武器攻击实体，实体受到攻击后发出巨大的嗡鸣声，并开始剧烈颤抖，被刺伤的地方迅速硬化，随后，“使徒”从实体内部钻出并手持红色的镰刀向流浪者移动，流浪者便开始与其周旋，随着移动，层级逐渐缩小，最后流浪者无路可退，被斩首而死。
//实体在流浪者尸体旁写道：
//
//
//反抗者，应当被制裁
//
//
//
//随后，尸体的底部露出一个洞，尸体掉入洞中，不见了踪影。
//隐藏
//曾有一名无神论者在看见七个狮子头后对着最大的头原地跪下，并向实体表达自己对它的崇拜与虔诚，实体开始向最大的狮子头移动，层级露出了真正的面目——一片碧绿的原野，附近有一条清澈的河流。实体变成了一只拥有七只狮子头，足为熊掌，豹子身体的生物。实体站在水中，身边是11位“使徒”，实体犹豫了一会，在流浪者的头上倒水，并说道：
//
//
//
//“████，吾以神之名，给你授洗”
//
//
//
//“你是第十二个使徒”
//
//
//
//“但你们中间有一个是叛徒”
//
//
//
//
//话毕，流浪者进入了level 999，并几乎安全的回到现实，在此之后，实体没有再施与流浪者任何的洗礼，并再也没有因此展开真正的层级。3
//作者信息
//« Level C-276 | Level C-277 | Level C-278 »
//
//Footnotes
//1. 此实体具有像蛇一样的条件反射神经，这使其即使是死亡也能进行运动
//2. 见附录1
//3. 如果是附录1的情况仍会展开
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1277{}