//Level C-286
//评分: 
//+9
//+
//–
//X
// 
//
//生存难度：
// 
// 
// 
//https___dogefs.s3.ladydaily.com_~_source_unsplash_flagged_photo-1575143837079-efa006aa9a02_ixlib%3Drb-1.2.1%26ixid%3DMnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8%26auto%3Dformat%26fit%3Dcrop%26w%3D1474%26q%3D80.jpg
//秋博士操纵无人机拍摄的Level C-286
//
//Level C-286是后室C层群的第286层。
//
//描述
//Level C-286是由一座山及周边云雾组成的层级，山体高度约为五万千米，含氧量却是前厅平原地区的1.37倍，全年平均温度约为19.7℃，全年温差不超过2℃。平均湿度约为65%。该山体部位顶端总面积不超过3平方千米。该地无任何动物，且由于该地土壤贫瘠，无任何高大的被子植物，仅含有覆满山脊的苔藓和蕨类植物种类的矮小植株。山体四周呈陡崖状地貌，倾斜角度约为90度，且极度光滑，几乎不可能通过攀爬的方式着落到底部，经过进一步的猜想和研究，证实了该地极有可能是一座悬浮在空中的岛屿，因其完全违背了物理性质，该异常特性目前没有合理的说法支撑……
//
//该地周边的云雾现推测无任何异常性质，由自然界普通水分子组成的水汽，小水滴，和小冰晶等，能见度大部分时间都低于1500米。由于山体部位高于云层，且之上由于未知原因并没有云雾的组成，所以山体部位的年降水量几乎为零1。该层级的云雾通常是高层云2和高积云3。
//
//经过研究测量，该层云雾面积应蔓延到此层每一处角落，其厚度远远超乎流浪者的想象，初步保守估计约为10000m～15000m，大约是前厅平均厚度的2～3倍。由此可以推断出，山下气候应全年闷热多雨，几乎没有任何常见的动物或植物（因为被云层遮挡，没有太阳能资源），仅有山峰和山脊的一小部分适合人类居住。
//
//目前已知只有这一处山峰，M.E.G通过各种手段现已探查半径为5000km的区域，均没有发现第二处“落脚点”。
//
//基地、前哨和社区
//M.E.G.驻Level C-286基地
//常驻人员近135人，大部分是气象领域的博士
//探索“云层”及发现第二处落脚点为其首要目标
//该基地为科考性质的基地，有部分区域禁止通行
//尽可能接纳所有友善的流浪者
//“后室救援小队Level C-286分部”
//常驻成员一般在35人与45人之间
//与隔壁M.E.G基地处于友好状态
//负责治疗流浪者及情报管理
//不进行任何贸易活动
//资源由总部定期调配
//尽己所能帮助流浪者
//接纳流浪者并允许短暂居住
//入口与出口
//入口
//若你当前处于的层级出现能见度极低的雾气现象，会有很大概率切入Level C-286
//若你当前所处的层级出现云雾遮挡住太阳的现象，会有切入Level C-286的可能
//更多入口尚待探查中。
//出口
//在早晨第一缕阳光出现时面朝太阳五分钟，周围的世界开始逐渐扭动模糊，等到再次稳定时，你会来到Level 10。
//连续在一天内捡拾十块含铁元素的小石头，有概率传送至Level C-216。
//在夜间12：00整看向月亮，你会感到身体十分轻盈，渐渐失去知觉，醒来时，你将来到Level 24。
//每当温度降低至10度时，会有概率传送至 Level C-274，但因该层气温非常稳定，几乎可以忽略不计。
//更多出口尚待探查中。
//作者信息
//« Level C-285 | Level C-286 | Level C-287 »
//
//脚注
//1. 仅仅是山体部位顶峰，并不是本层级的降水量，由于终日被厚厚的云雾笼罩着，本层级的年降水量甚至超过了1600mm。
//2. 大部分情况下掩盖整个天空，云体逐渐变厚变黑，是云层的一种分类。
//3. 常常连成一片，底部有波浪状的云彩，与高层云一样，是云层的一种分类
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1286{}