//Level C-261
//免责声明
//本文包含与自杀有关情节。如果该内容使您感到不安、烦躁等其他不适感，请跳过该层级，或是自行决定是否阅读该层级。
//
//
//评分: 
//+31
//+
//–
//X
// 
//
//生存难度：
//等级 C
//
//未探索完全
//稳定性无法预测
//实体数目未知
//在时间中寻找生命，永恒只是遗忘的骗局。
//
//IMG_20220801_234219.png
//依据Cangten的口述还原的黑色十字架，画师画技有限。
//
//描述
//Level C-261是后室C层群的第261层。该层级位于海洋上一座的小岛上。在登岛前看到的是充满绿色牧草的岛，中央长有一棵椰子树，而登上小岛后视野内的东西会在半分钟内扭曲，重塑，最终变成由灰色混凝土建成的岛屿。期间唯一能做的只有大声呼喊让没有上岛的同伴远离这里1。此层级大小未知。岛屿中有一个高百米2的黑色十字架。形态各异，损坏程度不同的灰黑色石像散乱分布在此层级。一种梯形建筑，灰青色玻璃片通过两根玻璃柱连接灰黄色玻璃片，较大的玻璃片永远朝向十字架。石像低端刻有字符，推断为该石像创造者的名字3。
//
//时间
//这座岛屿上没有确切的时间。不同位置，时间显示也有所差异，但时间只在特定的时间段中循环。这意味着流浪者可以同时看到处于不同时间中的自己，或者同时处在不同的时间中。
//
//区块大小未知，区块中时间的流速未知，区块内的时间段未知。
//
//目前已知的可靠方法为—依据可显示时间工具的转速与切换时间的速度来确定自己位于哪个时间点，和区块间的时间流速差异。可以使用秒表4，这一悖论事件却成了查看驻留在此层级的时间的最好方法5。
//
//海水
//小岛周围30m内的海水呈现淡红色，味道微甜，蓝紫色的结晶尝起来类葡萄。接触海水五分钟后会晕厥，会在小岛任意位置苏醒。跳入水面下一分钟后视线会逐渐变黑，恢复视野后会到达黑色十字架下方。
//
//虚拟的建筑
//有极低概率遇见黑色十字架与一个纯白色立方体框架交织的场面。虚拟实体6在此居住。此地并没有可为生命提供营养的物品。“居民”没有实体，类似于数据，3D虚拟模型。
//
//此区块不存在时间，显示时间的机器均会出现乱码。手表，时钟类，时针与分针会出现转向相反，以二十倍的速度旋转的情况。
//
//影响
//对精神7状态的影响。
//
//处在该层级的5min内只会感到口渴。
//5min以上，流浪者则会听到耳旁的轻声埋怨“你怎么什么都干不好。”重复持续2h。
//处于此层级的2h后会出现幻觉，此时离流浪者最近的石像则会用流浪者能听懂的语言不停的重复“为什么你这么的没用。”
//在这里停留超过3h。精神会逐步崩溃，出现自残，癫狂，自杀等行为。
//死亡即永生。
//流浪者的状态。
//
//离开该层级后会不顾一切的寻死。
//情绪不稳定。
//有很高几率患上精神类疾病。
//记忆出现问题。目前，生还的流浪者的表现有记忆混乱、缺失、无法分清梦境与现实。
//实体
//哭猫
//7只哭猫在此旅行。无姜色变种。
//石像
//在该层级死亡8会变成石像，转化时间未知，转化原理未知。
//摧毁石像的头部会遗失与其面部相关的记忆。摧毁其他部位也有着同样的影响。
//摧毁整个石像的影响未知，推测为失去与其相关的所有记忆9。
//白色羽神
//当流浪者心跳接近100次/min的时候，便可看见她。
//她身高数百米，披散着拖地的白色长发，上百双洁白的翅膀笼罩着雪白的身体，展开一双羽翼掩盖天空。白色的瞳孔凝望着流浪者。
//心率正常后便会消失。
//白色羽毛可安抚心神。减轻环境对精神状态的影响10。
//一个少女
//墨黑色及腰头发，背后有一双海蓝色翅膀。
//在心率接近50次/s时，她会出现，并递上一枝花。半分钟后心率恢复正常。
//根据幸存者描述，她见到一个即将死亡的人，有个女孩出现在他前面，随后，他的身体逐渐覆盖上大理石块。
//基地，社区和前哨
//由于此层级的特殊性，无法建立基地。
//
//出入口
//入口
//在Level 404中找到错误的石灰石碎片。
//在Level C-51中有几率找到此层级。
//在海洋11上有几率遇见此层级。
//出口
//唯一稳定可靠的方式为，寻找哭猫，对它们实行暴力后拾起它们。
//
//
//- 收起
//自:M.E.G.的omega基地
//到:M.E.G.的C基地
//
//
//
//关于Level C-261，目前仅有一名流浪者生还。鉴于Cangten可提供的信息，与她目前的精神状态，我们一致决定将她送往omega基地。
//
//我们希望所有迷失在Level C-261的流浪者可以找回自己的同伴。
//
//
//也希望失踪的人越来越少。
//
//
//—M.E.G.的omega基地
//
//
//
//采访者:M.E.G.成员
//收访者:Cangten
//时间:2022年7月5日
//采访开始
//
//gatot:您是怎么逃出Level C-261的？
//Cangten:在我接近死亡的时候，我抱紧了一只哭猫。
//gatot:您是怎么进入的？
//Cangten:我不记得了。
//gatot:哦抱歉，那您能说一下大致经过吗？
//Cangten沉默了一会儿。
//我被它的外表欺骗了。
//
//在海上漂泊了三天，本以为那是希望，谁成想…
//
//
//Cangten抽泣。
//美好的景色在扭曲，不加掩饰的扭曲，像是在嘲笑我的无知。石像，破损的，人，动物，充满这里。还有那该死的玻璃板。
//这里没有一点生机。
//你猜我看到了什么？一个人张开嘴大笑着，双手死命掐着自己的脖子，然后一个少女出现，那个人，我眼睁睁的看着他变成了石像。少女又散成白色粉末了。
//
//
//gatot:少女？
//Cangten:或许有160cm，我算不准。她纯黑的头发蓝色翅膀我倒是看到清清楚楚。
//gatot递上一杯温水。
//我的手机是防水的，哦，我还有个防水的数字手表。我边看表边向前走，时间，突然，倒退了2个小时。我愣住了，紧紧的盯着手表，80%的电让我心慌。五分钟，我来岛上已经五分钟了，秒表依然安安静静的往前走动。
//
//
//Cangten哭泣。
//我一个人担惊受怕没什么，为什么还要不停的说“你什么都干不好”我做错了什么，呜…
//在我前进一段距离，约为5m，时间又迅速的前进，前进了6小时，我心里默数了三下，代表分的数字已经跳动了20下。
//我加速奔跑，心脏的跳动，时间的飞跃，灰黑的混凝土，压抑的深蓝色天空，自杀的人。心脏跳的越来越快，我支撑不住倒在了地上。
//我看着秒表，十秒内我心脏跳动了15次。勉强支撑住身子后我抬头，一个纯白色不着片缕，发着光的女神，全身被羽翼覆盖，高，展开的一双翅膀就把天空掩盖住了。我撑起身体，祈祷自己能够活下来。当我再次睁眼，20cm长的一片羽毛放在地上。
//我狂灌了一瓶杏仁水，没有用，只能解渴。我看了眼秒表，2h17min36s，当我回过神来，发现耳旁的话早已停止，离我最近的石像在高声喊着“你为什么这么没用！”我咬了咬牙，捡起了羽毛。
//石像的声音变小了，我的心率逐渐平稳。呼。
//
//
//Cangten喝下一杯温水。
//Cangten的情绪逐渐稳定下来。
//我继续走，走了一个小时，一个发疯的人，砸碎了一个石像后向我跑来。我被打到了，他一拳杵在我的后背，向我的大腿砸了一个石块，或许是刚才那个石像的一部分。他踩到我的头上，我与大地来了个亲密接触。我反抗了，在他放下脚的时候侧滚起身，抓起刀，嗯，对。他踢在了胸口上，他发疯了，我知道，因为我的刀在他手里，他割下了我的肉吃，很大块。也是因为这样我才有时间一刀扎进他的喉咙中。然后我发了疯的跑。
//我缺血了，缓慢跳动的心脏，但我依然感受不到死亡，我慢慢的数着心跳，1.2.3….49.50.51.52…一分钟过去，那个少女出现了，她拿走了我的羽毛，她告诉我，大海就在我的旁边。她告诉我，她可以带我出去。
//
//
//gatot:大海？
//Cangten:毕竟是个岛屿嘛，有意思的是，大海是淡粉色的，我当时没认出来。混凝土上有结晶，蓝紫色，葡萄味。
//我想都没想就跳了进去，眼前逐渐变黑，恢复正常后我还在岛上。气，生气，我跳了三次海，精神逐渐奔溃，但每次都是一样的结果，除了位置不一样。
//我认命了，慢慢的洗着手，胳膊，脸上的血迹。看着水里的手，这个区块我很喜欢，一分钟就是60s，大概5-6分钟，我晕过去了，可笑的是我醒了后才发现我晕过去了。
//黑色十字架，太高了，没有那个女神高。我见过他一次，当时我没有注意。
//现在，一个非常大的，白色立方体框架，出现在这里。我颤颤巍巍的摸出了手机，时间是乱码你敢信？我的手表，秒钟，均为乱码。打开相机发现，无论拍什么结果都是纯黑，什么都拍不到。奇了怪了。
//哦！我看到了我的朋友！我上前搭话了！万幸他还认得我，他失踪很长时间了。嗯，好朋友！来个击掌！
//然后我穿过了他的身体，他的身体和乱码一样，完美的3D投影，他在微笑，说
//我现在永生了，你为什么不一起呢？只需要放弃肉体，自杀，将肉体奉献给这里，石像可以妥善保存这些，为什么不呢？
//
//
//Cangten:之后，我便昏迷了，醒来就到了M.E.G.C基地。
//gatot:那个，石像有没有什么…
//Cangten:啊！我忘记说这茬了！
//石像，低端有字，我看见一个曾经偶遇过的流浪者，这个石像和她一模一样，低端的字就是她告诉我的名字。
//这样的不止一个，她不是我遇见的第一个。
//我打碎了一个石像的头，从此我就忘了她的容颜。我打碎了她的胳膊，我的记忆里她就是没有双臂的。
//我..打碎了另一个人的石像，只留下了他的名字，哦不，记忆中，他被无数的白色字体错误，与名字覆盖，我很害怕，很可怕。
//
//
//Cangten:哦不。
//Cangten顿了一下，突然蹲下用双臂捂住自己的头，把脸埋在膝盖中间。
//gatot:哦不。
//记录结束12
//
//- 收起
//- 收起
//Cangten的日志与在她房间内的影像。
//
//含有与自杀有关情节13。
//
//第一天
//终于，我从那里回来了。离开了漫无边际的混凝土土地，自杀的人，还有我自己。
//
//我没有同伴，一个人在后室里穿，切入，切出。孤独席卷了我，我感到孤独，我以前感到孤独。被接到这里，活动范围只有这么一个房间，一张床，一个桌子，三餐。有窗户，却看不到外面。稳定下来了，我现在依然感受到孤独。
//
//孤独，与孤独。
//
//我总是能梦到哪里，就像在此进入到哪里一样。我没有错，不应该有错，存在于我已经中，曾经见过面的人，消失了，这是我的错。
//
//这不是我的错，我救了我自己，我从那个荒无人烟的地方，回来了，我救了你，我救了我。
//
//头疼，感觉要炸开了。想不起来任何东西..好困，终于能有个安稳的睡眠了，开心。
//
//监控记录中…
//
//Cangten在房间里走动了一圈，之后拿起笔写日记。桌上的饭菜并没有动。
//
//Cangten将枕头摔在了地上又小心翼翼的捡起，拍打上面的尘土。坐在床上望着天花板30分钟后，躺下睡觉。
//
//第三天
//就在刚才，我回到了前厅，阳光倾洒在我的身上，暖洋洋的。清新的空气出入我的肺部，我感觉整个人都被洗涤了。还有我的朋友和邻居，他们笑..他们的面貌，长相？诶？长什么样子来？
//
//我在这里找到了我的朋友，闲弃，她有着黑色及腰的长发。她会从门下的缝隙里将信件塞进来，我很期待与她的对话。今天的伙食有紫菜汤，我很好奇M.E.G.是怎么搞到它的。
//
//汤里有药？为什么会有点苦？我没有上火，我敢肯定我没有上火。这味道我尝过，像…氯丙嗪！
//
//啊！就在写日记的这个时间里，闲弃给我送来了信！
//
//嘿，Cangten，你知道么，我很激动！你猜猜我最近干了什么？我向上级申请了你的手机使用权！除了这个，关于你的血液抽取，我没有得到信息。很抱歉。我会想办法带你离开这里的，等我。
//
//
//等等，我的手机？我的手机不是一直在这里？
//监控记录中…
//
//Cangten起床后，并没有食用早餐。而是坐在墙边自言自语，说“你的名字叫闲弃？我们现在是朋友了！”
//
//每日的血液抽查，并无异样。
//
//食用午餐时，Cangten将汤倒入了垃圾桶中。两小时后，Cangten开始大笑，砸碎了一个玻璃杯并说自己刚从前厅切入这里。
//
//随后，Cangten突然冷静下来，拿起笔写信，并放在了门口的位置，坐回去开始写日记。写到一半，去门口拆开信封，边笑边将信件撕碎。
//
//晚餐并无异样。
//
//第七天
//哦…我怎么在这里，奇了怪了。
//
//我刚才明明又回到了哪里，我清晰的记着，每一个死在我眼前的人，他们为我的生命提供了…不…我将我的生命分享给了他们。他们却覆盖上了大理石…或许有其他成分？在他们的尖叫声中，从脚底逐渐覆盖到头顶，惊吓又绝望的面孔从此定格。凌乱的发丝，眼角的泪水，放大的瞳孔，一件艺术品。
//
//但我看不得这些，后退几步，将他的脸打碎了。我不明白，永生有什么不好？脖颈处流下几股血液，很快就变成了石像的一部分。
//
//我是不是太残忍了？当我说出永生时，他的眼睛露出来的光让我颤动，他开心的笑着，双手合十向我祈祷。我拔下自己的蓝色羽毛，递给他。之后，打碎他的头颅。我向羽神忏悔，但羽神，自始至终也没有看过我一眼。很快，我明白了，这不是永生。
//
//我向另一个进入这里的人询问，问她，什么是永生？她笑了笑“永生，永恒的生命。如果时间暂停，那么生命也会被暂停。这也算一种永生。”她明媚的笑容感染了我，从此，她永远定格在了那个动态的笑容，时快，时慢。但这不是永生。
//
//闲弃最近不给我写信了，我想念前厅，关于以前的事，家人，曾经的朋友，他们出现在了房间里。当我激动的拥向他们时，他们消失了。
//
//M.E.G.，也就是我在的这里。提供的饭菜，额..也太不用心了…刀片居然落在了盘子底下…
//
//我很快就能来见你们了…等我…呜..
//
//我没有什么可以留恋了，我不曾得到过什么，我也不曾失去过什么，但我依然在…我在..但我不被需要。
//
//监控记录中…
//
//Cangten起床后申请了一副跳棋。
//
//早餐后，Cangten在房间内走动了一圈，运动完后在椅子上坐下。随即，出现哭泣的声音，与写字的声音。
//
//3min后，Cangten冷静下来，继续写日记。
//
//午餐后，Cangten突然笑出声并对着空气喃喃自语，突然上前抱住空气后便开始哭泣。
//
//抽血与喂药环节，Cangten表现为厌烦。
//
//Cangten在晚餐的盘子下拿了7cm长的刀片，并用纸包裹起来放到了枕头底下。
//
//第八天
//今天没有做梦。闲弃也一直没有给我来信。
//
//我感觉我与世界之间，有着无数层的塑料膜。它把我与世界隔开，也把声音从我身边隔开。我始终无法融入这里，我不属于这里。
//
//这里只有我一个人，我知道，我明白这个道理。为什么偏偏选中我！凭什么！
//
//我到底做错了什么！告诉我！
//
//我想起了，我第一次到这个地方，把我困住的岛屿。混凝土造就这里，无边的，清澈的深蓝色大海将我隔绝。我在这里哭泣，在这里死去，又在这里重生。无边的孤独包裹着我，直到，我遇见了她，以我的幻想，用我的精神塑造的她。
//
//明明一天了，我却感受不到饿。我把所有的，能见到的东西都打碎了，但是依然压制不了我心底的躁动，那种升腾的感觉。
//
//我想，我好了。就像我的心沉入了海底，又将我的身体在海水中沉浮。我见不到阳光，海水进入我的鼻孔，我的口腔。无法呼吸，无法大声说话。
//
//什么时候才能结束这一切…
//
//监控记录中…
//
//3:45，Cangten起床拿出了枕头底下的刀片，向手腕处划动。持续了半个小时，结束后将刀上的血液擦洗干净。
//
//4:20，Cangten蜷缩在床上，咬着手背，有着明显的颤动。
//
//7:30，Cangten将早餐扔到地上，十分钟后，Cangten将食物与碎片打扫干净。
//
//10:47，Cangten摔碎了玻璃杯与玻璃窗户。紧紧的握紧碎片。23分钟后，Cangten将碎片打扫干净。
//
//12:10，Cangten将午餐打碎。将绿豆汤倒在垃圾桶中，说“我知道你们往里面下了药，当我傻么。”
//
//16:10，抽血环节Cangten表现为顺从。而喝药环节，Cangten将药藏在了手中。
//
//17:13，Cangten将室内除了垃圾桶，床铺，桌子等搬不动的东西外，易碎物品全部摔碎，布料，皮革等物资全部撕碎。打扫完毕后发出了物品申请。
//
//18:30，晚饭时间，Cangten将所有东西打碎，并收拾。
//
//19:41，Cangten先开始大笑，一分钟后开始大哭。很快便冷静下来，开始写日记。
//
//23:38，Cangten躺下睡觉。
//
//23:50，Cangten起床并对监控微笑，随后躺下睡觉。
//
//第十天
//一夜无梦。
//
//断药已经两天了。一天比一天头疼，但呼吸明显的有力了…他们到底给我喂的什么药！
//
//一些遗忘在脑海深处的记忆被重新翻出来，我不明白，我不确定这是我。
//
//她在一个时间段来来回回。但再也不能和我说话了。我又问了一个人，他拿出一把小刀，蓝白色刀身。在他所谓的演示后，我倒下了。
//
//我又站起来了。在他充满戏弄的眼神中，我犹如一位失败的舞者，表演着劣质的复活戏。在第18次后，我夺下了那把刀。终于，他说:“机械飞升。”
//
//在他的指导与演示中，黑色十字架建起，白色的立方体框架浮在空中。我让他成为了第一个，意识上升数据的，一位“自由的”永生者。
//
//我…我累了。我不想再去寻找什么所谓的“真正的”永生方法。我只想逃离这里。逃离我制造的她…和它们。
//
//我最后的机会。
//
//奇了怪了，白天的记忆我一点没有，眼睛一闭一睁就到了夜晚，头依然是昏昏沉沉的，但没有那么疼了。
//
//如果，我活着本身就没有意义。那我为什么活着？
//
//如果我活着只为了衬托别人，那我为什么要活着。
//
//我习惯了孤单与落寞，被别人的光辉所打压…没人需要我…我…我是个废物，我该死！我活着就是种浪费！
//
//啊！我到底什么时候才能解脱离开！让我走！求你了
//
//我相信，这样的日子很快就能结束。
//
//监控记录中…
//
//6:14，Cangten起床，并申请了一份换洗的衣服，三天后送来。
//
//6:30-18:40，进食时间，抽血与服药环节，Cangten表现为顺从，而药物扔到了垃圾桶中。其余时间Cangten则观看与后室有关的资料。
//
//18:41，Cangten开始写日记。
//
//20:46，Cangten尝试吞服刀片。
//
//第十一天
//活着，是为了什么？死了，又是为了什么。为什么有人想活，却有人杀人。为什么有人想死，却在死亡最后的时刻反悔。
//
//我还是认为生神是对的，生命珍贵但不能轻易放弃，那怕未来充满希望与绝望。但我依然不想在闭上眼后还会睁开。
//
//跳棋…我对它已经没有兴趣了。看着它我总是能回想起曾经做过的，愚蠢的事情。到这里的十一天，我无时无刻在记忆中穿梭，在泪水与欢笑中寻找。对过去产生厌恶，对即将到来的未来产生恐惧。
//
//我不知道我能不能遇见生神，我想赌又不敢赌。
//
//我将自己囚禁在这具躯体里，与世界隔离开。期待有人走向我又抵抗有人触碰我的内心。我无可奈何，我也想出来…对不起…
//
//啊对了，我看见闲弃了，就下午的时候，她来找我了，虽然我不知道她是怎么进来怎么离开的。但是，我能看到明天的希望了。
//
//加油！Cangten！
//
//监控记录中…
//
//5:37，Cangten起床。
//
//5:41，Cangten开始写日记。
//
//12:10，午餐时，Cangten摔碎一个盘子，将碎片收集藏在枕头底下。
//
//抽血与喝药环节，Cangten表现为顺从。
//
//17:16，门口出现一个人，为黑色及腰长发，身高约160的女生。Cangten与之交谈。
//
//17:39，少女走向门口，面对摄像机露出微笑。没有触碰门把手就消失不见。
//
//22:15，Cangten将盘子碎片拿出来，吞服。并尝试自杀。26分钟后，Cangten将刀片上的血擦拭干净。
//
//第十三天
//今天，我又一次看到了哪里…那个小岛…
//
//混凝土与石像，死亡与永生，烙印在我的脑海里，就在今天，我感觉到我又一次回去了。
//
//我即将回到哪里…
//
//那里对我来说不再是恐惧与未知，而是心痛与绝望。
//
//
//
//
//她到了那里了。-闲弃留
//
//监控损坏…
//
//7:45，Cangten拿出了用被单制成了绳子与枕头下的刀片。
//
//8:26，Cangten长呼一口气，踩上板凳。
//
//8:27，一个女生出现在门口。
//
//8:30…
//
//8:31…
//
//8:28
//
//8:25
//
//监控损坏。
//
//自:M.E.G.omega基地
//
//
//自Cangten从Level C-261逃出后，我们检查了Cangten的身体，发现她身上并没有伤痕，仅有脖子不适 。
//
//
//我们备份了Cangten手机中图像的内容，其中有虚拟建筑的图片，和一张刻有Cangten名字的破碎石像。其手机中秒表停在3:17:36。
//
//
//悲伤的是，十三天后，Cangten离开了人世，其尸骨由同伴闲弃带走。
//
//—M.E.G.omega基地
//
//- 收起
//作者信息
//« Level C-260 | Level C-261 | Level C-262 »
//
//Footnotes
//1. 这段时间内，岛上的流浪者无法移动。
//2. 由于探测困难，本文所有数值均为约数。
//3. 判断依据为:一位流浪者在此层级找到了失联已久的同伴的石像。
//4. 秒表的计算包括从现在的时间减去开始计时的时间。但在此层级却不受时间流速和时间回转的影响。原理未知。
//5. 目击者描述，他见到最小的区块仅有三步长。而高度无法测量。
//6. 用“实体”描述不准确，目击者见到了一位白皮肤穿着黑夹克的人类，该目击者上前打招呼后发现，该“人类”拥有在前厅的记忆却没有真实存在的肉体。
//7. 药物失去作用。
//8. 自杀不会遇见生神。
//9. 若只保留底部文字，则记忆中与该人有关的内容会被白色文字“错误”与其名字所掩盖。
//10. 羽毛可通过对羽神祈祷获得。
//11. 后室中有海洋的层级均可。
//12. Cangten是唯一幸存的人。此文档是依据这次采访与Cangten写的文档撰写的。采访后由于Cangten的精神状态不乐观，没有继续采访。直到她死后才发布这篇档案。真实性存在争议。
//13. 如果阅读过程中感到不适与心情状态的切换，请去看心理医生。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1261{}