//Level C-238
//评分: 
//+14
//+
//–
//X
// 
//
//生存难度：
//等级 不适宜进入
//
//不安全
//精神影响
//无有害实体
//Level C-238是后室C层群的第238层。
//
//1
//Level C-238白色区域墙壁上的文字（不可识别）。
//
//描述
//Level C-238是由六个区域组成的非线性空间，各个区域由走廊和房间组成，无内饰，走廊与房间没有门分隔开，六个区域的墙壁分别被粉刷成白色，灰色，黄色，红色，蓝色，黑色，部分墙壁上有刻字，来源未知，推测为Level C-238内自带文字，部分文字不可识别1，墙壁材质为混凝土或陶瓷。区域的大小不断变化，最大时可达730万平方公里，各个区域首尾相连，但每个区域结构不断变化，因此区域连接处没有确切位置。Level C-238内有光源，主要分布在天花板，其他各处分布微弱光源，黑色区域光源最少，可携带光源进入。另外，Level C-238内有某种干扰波会对电子设备造成影响，干扰波随着探索的深入而不断变强。Level C-238内未发现实体
//进入Level C-238会对人的精神和情绪产生影响，不同区域对人产生的影响不同，具体影响见附录。Level C-238对人精神的影响有几率致人产生过激行为，因此该层级不适宜进入，且影响程度随探索的深入而增加。
//
//- 附录
//白色区域
//2
//Level C-238白色区域。
//
//进入白色区域会在一瞬间想起进入后室前后经历过的所有事，但脑子里“只有经历过好多事的感觉，并没有具体事件”2。回忆过后身体会变得十分疲惫，休息一会可恢复体力，不过这种回忆的感觉会一直存在直至离开白色区域。
//以下是白色区域墙壁刻字
//
//像流水一样
//
//甜美，迷人，怀念，不舍
//
//他们如今怎么样了？
//
//一去不复返啊！
//
//
//灰色区域
//进入灰色区域后，应尽快寻找出口
//
//
//进入灰色区域会变得焦虑不安并在心中产生极大的来自各个方面的紧迫感，如生存压力。流浪者进入后会尽可能试图离开该区域，不过也有流浪者会停止移动，最后因过于焦虑而死。这种焦虑的感觉会一直存在直至离开灰色区域。
//以下是灰色区域墙壁刻字
//时间怎么这么快！
//
//我为什么一直在原地踏步！
//
//没有第二次机会，想想自己一直在干嘛。
//
//焦虑属于明天…吗？
//
//黄色区域
//进入黄色区域，切勿将武器显露出来，说话不要拐弯抹角
//
//
//进入黄色区域后会变得多疑，同时伴随出现被迫害妄想症症状。流浪者脑中会产生对各种事件的多种猜想，其中多数是妄想，流浪者可能因为多疑而互相攻击。这种多疑会一直存在直至离开黄色区域。
//以下是黄色区域墙壁刻字
//他那天为什么会那样做？
//
//狐之笑靥
//
//猜疑，猜疑，猜疑
//
//这是为什么？是我的问题吗？
//
//红色区域
//进入红色区域后，应不顾一切，立刻，迅速寻找出口，避免交流，可携带镇静剂
//
//
//进入红色区域，人会变得愤怒和激进，任何争吵都会演变为肢体冲突，对于他人说的每一句话，无论对错，都会有反驳的想法，不过在红色区域中办事效率会有明显上升。这种愤怒会一直存在直至离开红色区域。
//以下是红色区域墙壁刻字
//去他妈的！一帮混蛋！
//
//不爽
//
//控制不住的，心中燃烧的火。
//
//人不犯我，我不犯人。
//
//蓝色区域
//进入蓝色区域后应立刻寻找出口，如果结伴而行，要制止他人的过激行为
//
//
//进入蓝色区域会产生忧伤的情绪，具体表现为对事情提不起兴致，无论想什么事情都会变得悲观，十分沮丧，不时会产生自杀的想法，这种忧伤会一直存在直至离开蓝色区域。
//以下是蓝色区域墙壁刻字
//夕阳下离去的背影，是最后的告别。
//
//一起度过的时光，是怎么消失的？
//
//生而为人，我很抱歉。
//
//世界上，真的有真正的朋友吗？
//
//黑色区域
//进入黑色区域后应迅速寻找出口，如果结伴而行，要制止他人的过激行为，可携带镇静剂，要坚持希望
//
//
//进入黑色区域，人会变得绝望，万念俱灰，丧失对说话，饮食的欲望，自杀的几率大幅上涨，绝望程度随在黑色区域内部停留的时间增长而增长，这种绝望会一直存在直至离开黑色区域。
//以下是黑色区域墙壁刻字
//天上的鸟儿，好快乐啊…
//
//这就是尽头吗？
//
//千里迢迢而来，一无所有离去。
//
//结束了…
//
//
//在黑色区域尽头，有一扇黑色木门，这是离开Level C-238的唯一方法，门上刻着一串字：“这就是人”。
//
//
//基地、前哨与社区
//无已知基地、前哨与社区
//入口与出口
//入口
//从Level C-362中进入一扇白色铁门可进入Level C-238
//出口
//从Level C-238黑色区域的木门中离开可进入Level C-327
//作者信息
//« Level C-237 | Level C-238 | Level C-239 »
//
//Footnotes
//1. 部分可识别文字见附录
//2. 一位流浪者的回忆
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1238{}