//Level C-205
//评分: 
//+45
//+
//–
//X
// 
//
//生存难度：
// 
// 
// 
//Level C-205是后室C层群的第205层。
//
//描述
//Y5xt1XuRF3y7SMV.jpg
//Sigma冰山附近的一处前哨点，于无风时拍摄。
//照片由冰海基地提供。
//
//Level C-205是一片无垠的冰封冻土。其气候性质接近极地冰原气候，大部分地表被冰雪覆盖。其天空为蔚蓝色，天气晴朗，无云无雨。
//
//Level C-205全年严寒，平均气温约为-24.7℃，长年大风，易形成雪雾，能见度较低。该层级存在昼、夜之分，以南方地平线上可以观测到的巨型白色天体的起落作为划分依据。该天体尺寸明显大于前厅的太阳，呈现带有略微发蓝的白色，其上有时可以观测到深紫色的纹路。Level C-205内的昼夜交替周期约为3个月，即其内的一年约为6个月。
//
//在Level C-205已探索区域的中心，存在一片规模庞大、连绵数十里的冰山区域，被称作“北极山”，也是所有流浪者在切入时会到达的位置。在初步对该区域完成探索后，M.E.G.将北极山划分为了18片地区，并分别以希腊字母命名。
//
//北极山是Level C-205内最安全的区域，其中出现暴风雪等天气灾害的频率较低，实体数量也更多。在远离北极山后，暴风雪出现的频率会逐渐增加，且其强度也会随距离增强。北极山以外15千米被视为危险区，无法进一步探索。
//
//Level C-205内的冰雪融化后水质纯净，含锌、硒、镁等微量元素，经红白光检测为可饮用。此外，北极山中的Lambda峰构造特殊，含有微量冻结的杏仁水。同时，得益于其便捷、稳定的出入方式，该层级便于运输补给，提供了宜居条件。
//
//自然现象
//极昼
//Level C-205内的极昼维持3个月，共计约91-92天。在极昼期间，该层级内气温约为-22℃，由南方的巨型白色天体提供照明（以下简称“太阳”）。
//
//太阳是Level C-205内光照与温度的主要来源，常年位于观测仪器指出的南方方位，且其具体方位与北极山之间不会发生相对偏移。据估计，太阳的高度角最大约为17.5°，在极昼的中期时到达。太阳表面白色偏蓝，可与蔚蓝色的的天空作出区分。
//
//在北极山中的Sigma峰上可以较好地观测太阳。太阳表面状似光滑，没有与前厅中太阳类似的天体活动；但有时其上会出现深紫色的纹路，构成不同的花纹。这些纹路出现频率较低，意义、作用不明，必须用专业设备才能观测。太阳疑似是在变化或是旋转的，因为从同一地点观测到的两次纹路会出现较大差异。
//
//极昼期间，由于雪地的漫反射，Level C-205内的亮度极高，推荐流浪者在进入该层级前佩戴护目镜等保护装备。当然，由于极地风的出现，其他冰原探险设备也是必须的。
//
//极地风在极昼期发生的概率较小，相对地，北极狐出现的频率也更高。
//
//极夜
//GPiOEr1k7g8BURb.jpg
//极光，照片由冰海基地提供。
//
//在极昼即将结束时，太阳将缓缓下沉，直到彻底没入地平线；此时，Level C-205也就进入了长达3个月的极夜。
//
//极夜时期的气温低于极昼，最低曾达到-47℃，流浪者需要准备好保暖措施。极夜期间，北极狐出现频率明显下降，大多进入北极山内的山洞或是地洞中躲藏或睡眠。
//
//极地风在极夜的出现次数大幅增加，北极山常常能在72小时内遭遇至少1场极地风。
//
//极夜期间，Level C-205的天空变为深蓝近黑色，但会出现数目繁多的小天体。星空中会有大量来源不明的带电粒子散射入Level C-205的大气层内，造成几乎不间断的极光现象。由于这些极光的出现，极夜期间的天空亮度常常高于地表。
//
//极地风
//极地风是偶尔出现在北极山中的异常天气，通常以暴风雪的形式出现。
//
//有报告称，在北极山的极地风中，有时可以在风雪中看见一个人形实体，但受限于极地风的异常性质，未能探明实体的具体情况。
//
//当遇见极地风时，需要立即寻找一个足以避风的山洞或是一个可供暂时避免暴露于极地风中的地形。紧急情况下亦可自挖冰洞以抵御极地风。出现极地风的一个显著特征是在北极山的地平线处出现一道近似于白墙的屏障，因此流浪者需要不时留意北极山的天气状况和最近的山洞位置。
//
//雪噬
//雪噬是一种仅会发生在北极山区域的特殊现象。其具体表现为：地表的雪层会逐渐将地表上的物体下拉。
//
//最初，这种现象被认为是由正常的重力所导致的；直到有多个报告指出流浪者摆放在雪地上的物品会在一小时内迅速沉入雪中，这一现象才得到重视。
//
//令人庆幸的是，雪噬现象是无法危及生命的。这一现象发生的速度极慢，且随着物体体积的增大，下拉的速度会随之减小。据估计，雪噬将一个成年男性拉入雪中的时间至少是17个小时。在这期间，被雪噬者不会受到除寒冷以外任何的威胁，且随时可以自行、或在他人的帮助下脱出。
//
//雪噬发生的原因尚不明确，但这一现象导致流浪者无法在北极山储备物资。在确定雪噬的具体表现后，M.E.G.开始建造冰海基地以应对这一情况。
//
//实体
//北极狐
//LpiSmdMy5QhfNZx.jpg
//一只幼年北极狐，照片由冰海基地提供。
//
//在北极山内活动时，有时可以看到北极狐。
//
//北极狐是一类外观近似于犬科动物的实体统称，包括但不限于狼，狗，狐等生物实体。通常情况下实体的大小形态不一，但外表都被有白毛。
//
//实体一般单独出现在流浪者周围，目前已收录并确定的表现有，靠近流浪者试图寻找食物，跟随流浪者行动等类似于正常流浪小动物的行为。部分报告提及有些北极狐会撕咬流浪者衣物或做出一些攻击行为，但鲜有实体伤人的报告。
//
//值得一提的是，几乎所有的报告都指出，北极狐十分惧怕人造火光。一旦流浪者开启人造光源，例如手提灯或火把等光源，北极狐就会立即跑到阴暗处或者是未被光源直接照射的地方。因此，人造光源被确信可以有效驱散北极狐，建议流浪者们在背包中带上一支火把。
//
//基地、前哨与社区
//M.E.G.冰海基地
//冰海是M.E.G.在北极山的Sigma冰山中开辟的一块空间，目前是一个在建的M.E.G.半永久基地。基地内常驻二十余人，悉数为冰祈站点的工作人员。由于北极山的自然原因与层级内部特有的异常效应，冰海暂时被充当为一个存放物资的临时仓库。
//
//冰海对所有流浪者开放。
//
//M.E.G.冰祈观测站
//冰祈是M.E.G.设立的一个观测站点，位于北极山Delta峰的峰顶。北极山特有的天文条件吸引了无数的流浪者驻足，因此冰祈站顺势而生。冰祈站配备有顶尖的观测设备，并常驻有数十位研究员，是一个综合型的研究站点。
//
//冰祈站既是一个天文站，同时也被用于监测北极山的气象状况，并在当极地风形成时尽可能通知北极山内的流浪者以做好准备。
//
//冰祈站仅接受事先在M.E.G.预定过的流浪者的拜访。
//
//入口与出口
//入口
//在卡兰冰山的山洞中打碎一块任意大小的冰块，然后拾起一块碎片走出山洞，即可到达该层级。
//在任意层级使用透镜观察任意一座冰山片刻，保持视线接触直到它的颜色完全变成暗蓝紫色。然后登上冰山，即可到达Level C-205。
//在任意层级使用层级内的的水凝结出一块近似正三棱锥的冰块，打碎，并饮用其中一块碎片。然后从剩下的碎片中穿入Level C-205。
//出口
//在极夜期间，直接目视极光的流浪者将在进入下一个极昼时被强制切出至上一个层级。
//用取自Level C-205的天然水凝结成一块近似正三棱锥的棱镜，使用它观察太阳，直到棱镜融化的水滴入眼睛，然后闭眼稍等片刻。等到冰水浸透眼球，即可切回上一个层级。
//附录
//- 收起
//对冰海基地负责人的采访节选
//采访时间：2022年4月2日
//采访地点：Level 1
//采访者：Rachel小姐
//受访者：James Klaus
//
//采访内容
//
//……
//
//Rachel：下午好，Klaus。欢迎来到“夜话围炉”的访谈现场！
//
//Klaus：你好，Rachel小姐，真是久闻大名了。我们基地里就有不少人一直在听你的节目，小伙子们经常把收音机和节目的录音带进来。
//
//Rachel：哦！真的吗？（轻笑声）真是太荣幸了，Klaus。那我们现在开始吗？
//
//Klaus：好的。
//
//Rachel：很好，那么首先……正如刚刚我们介绍的那样，冰海基地是一座位于Level C-205的中小型基地，那里生活着二十多名冒险者总署的成员，而你是他们的队长。Klaus，关于Level C-205，你有没有什么想要介绍或者说明的？
//
//Klaus：当然。我更愿意叫它“北极山”，这是我当年的小队最初给它起的名字。北极山是一个相当寒冷的地方，跟前厅里的北极差不多。不过比起大部分后室里的层级来说，那里已经非常安全了——至少那里没有乱七八糟的实体。这也是我们当初把它划入宜居层级的原因。
//
//Rachel：哦——听起来，你对北极山有很深的情感。
//
//Klaus：是的，这是由我亲自发现的层级，也是我之后长期驻留的层级。
//
//Rachel：嗯。说到驻留，Klaus，你为什么要选在那里扎营？我们都知道，北极并不算是一个好住处。
//
//Klaus：这有很多原因。首先，就像我刚刚说的，这里很安全，也没有实体的威胁。而且那里与外界连通方便，我们获得补给也非常容易。最重要的是——北极山有一股神秘的力量，让我和我的队员们流连忘返。
//
//Rachel：哇喔！Klaus，你这下把大家的好奇心都提起来了。
//
//Klaus：事实就是如此。冰海基地在开始建造到现在，已经过去六年了。这六年来，我们迎接了不少的朋友——我们有充足的物资。他们中只有两个最终也留了下来，而九成九的人都在不到半个月里离开了。
//
//Rachel：听你这么说，想在那里过日子一定很麻烦？
//
//Klaus：是这样的。北极山的时间与其他地方不同，想要适应极昼与极夜是一件非常困难的事。同时，那里的低温也让人难以久留，即使我们已经建立了基地让他们可以暖和一些。
//
//Rachel：（轻笑声）喔喔，Klaus，你既然都这样说了，那么它到底是施了什么法，把你牢牢地拴在那里？
//
//Klaus：太阳。
//
//Rachel：哇！那可真是个出人意料的答案。
//
//Klaus：当然，那只是一部分。北极山的太阳非常特殊，它是白色的，比我们所知道的太阳要大得多。我们基地的人都发现，当注视着太阳时，就会感到自内心而发的平静，就像在Level 63那样。还有一种……特别的，呃，归属感。
//
//Rachel：你知道我想到什么了吗，Klaus？
//
//Klaus：喔喔！我当然知道，精神影响对吧。确实，这个鬼地方有很多可怕的地方——Level 14、Level 200之类的，我早就有所耳闻了。这些地方确实都会对进入的人造成严重的精神污染，更可怕的是M.E.G.还会给它们很低的生存难度评价。不过可以放心，我们已经确定那种情感只会在注视太阳的时候出现。北极山一直与外界保持着联系，我们的人员也会定期来M.E.G.的其他基地做精神测试。一切正常。
//
//Rachel：（夸张地松了口气）说真的，你的上一句话真是太吓人了！不过我很好奇，那种归属感能让人一直在那里待六年吗？
//
//Klaus：显然，有些人是，有些人不是。对我来说，那种感觉正是我毕生追求的——我在前厅四处流浪，而在这里却找到了真正的家。就在冰山间，在风雪里，那种天地相通的壮阔……你应该看看极昼里无穷无尽的白色雪地，还有极夜里连绵不绝的璀璨极光……大自然的伟业，那能让人忘记所有……亲爱的。仿佛你就是自然的一部分，是那太阳的一部分。
//
//Rachel：Klaus，你一定不知道这些话多么诱人。我敢打赌，收音机前已经有不少人开始想要去北极山看看了。
//
//Klaus：当然可以！冰海基地的大门向所有人敞开——还有可爱的小狐狸。
//
//Rachel：哦！你能详细说说吗？
//
//Klaus：哈哈，当然了。
//
//……
//
//收录完毕。
//
//
//
//- 收起
//Untitled_Picture_04
//2oltIyPsJE67Ore.jpg
//欢迎来到北极山。
//
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1205{}