//Level C-276 - “英雄的诞生”
//评分: 
//+21
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
//安全
//稳定
//少数实体
//Level C-276是后室C层群的第276层。
//
//描述
//grassland-3533120_960_720.jpg
//Level C-276 一次稳定状态的照片，Dr.Bright 所摄
//
//Level C-276始终处不稳定于变化状态，但总体在虚空与前厅发现的奇幻文学作品所述大陆状貌之间变化，目前已知最短的后一状态持续时间为 45 秒，最长的持续时间近 200 年。目前本层级仍处于短时间的快速变化中。
//
//因此，层级内存在的实体数量也是不稳定的，最多的一次记录描述实体数量近五亿个，这接近于同时期前厅欧罗巴地区的人口。Level C-276 最常见的实体为伪人与守书人，此外还存在大量前厅常见的动植物。在本层级处于大陆状貌时，将必定存在一名来自前厅的人类，往往被称为做梦者，这意味着其处于非常规意义的「睡眠」中，在此睡眠中其具有与清醒时一样的所有感官，与此同时大陆内部的社会变化将作为奇幻故事围绕做梦者展开，这类故事多符合做梦者最喜欢的奇幻冒险故事，即一次梦境。
//
//流浪者切入时将处在「边缘地带」，边缘地带常表现为一片纯白的空间，并有一个温暖的壁炉、木桌与无限供给的咖啡，守书人常与流浪者友善地交流各种话题，尤其是冒险题材相关话题。在层级内出现的奇幻冒险故事往往出现于「核心演绎地带」，若流浪者希望进入核心演绎地带生活，通常情况下守书人将给予其一套平民衣物及一个身份，后流浪者将被允许进入核心演绎地带生活，在不做出破坏性举动的前提下流浪者可以在此层级生活直到梦境结束，但多数时候，人数被控制在几名内，且每人都不具有较强势或易引起反感的性格，他表示这是出于保护梦境不被恶人破坏。
//
//根据与守书人的交流记录，从前厅进入该层级的方式需要通过一本无标记、绿色的精装皮书籍。在翻开该书籍第一页时将显示一句短语——「英雄的诞生」，随后在读者睡觉时将被切入该层级，并在梦醒后从层级回到前厅，这被认为是一种进入前厅的方法，然而守书人声称只是读者的灵魂进入了梦境而非读者切入了梦境，所以这一方法不能用于将流浪者送回前厅。
//
//new1230.png
//无标记绿色的精装皮书籍
//
//伪人
//伪人是 Level C-276 大陆状貌时社会的基本组成者，它们往往有着与人类同等的体型与行为举止，并呈现出常规的情感变化。其他情况下伪人也存在其他外表，如侏儒或体型较大的龙形生物。除非人类要求，否则它们对人类并不具有任何意义上的攻击性。
//
//但据守书人介绍，伪人不存在任何意识或记忆能力，在其内部存在判定机制以确定它们在不同情况下的不同行为与表情，研究负责人 Dr.Bright 倾向于它们是一类哲学丧尸1，这一说法目前被较为广泛的接纳。伪人将在每次梦境结束时中随大陆一同消失，并在梦境开始时随大陆一同出现，尚无法判定每次出现的伪人是否相同。
//
//这类实体相较于人类而言存在一明显特征，即在他们的右脸颊下方有一个五芒星印记，这一印记不显眼但可被轻易发现。这是在 Level C-276 中唯一一种辨认人类的方式。
//
//守书人
//守书人被描述为一个身着绿色斗篷、长满络腮胡的男性。他自称为 Level C-276 本体的化身，他对流浪者或做梦者都保持友好态度。该实体具有对本层级的一切调控能力，梦境结束时他表示乐于使做梦者在梦境冒险中感到快乐，并表现出悲伤，希望其「尽快再次来访」。他十分热衷于讲奇幻故事以及形形色色的在本层级发生的故事，他最经常讲的故事是一个刚进入梦境就找火山口跳入然后强制自己醒来的人。
//
//然而，强制闯入核心演绎地带或冒犯性的行为仍会引得守书人反感并导致拉入黑名单，这将使被拉入黑名单者无法再切入层级。
//
//百年梦境
//早期对于核心演绎地带并未有过多要求，在其中生活的三名人类往往可以接近做梦者，甚至与其建立一定的关系。随后守书人对此有了严格的规范。即「进入梦境生活的人类不得与做梦者存在任何交集」，这一规范的制定普遍被认为来自持续时间长达两百年的迄今为止最长梦境，一般被记作「百年梦境」。
//
//前厅回合制游戏爱好者 Bera 教授为此梦境的做梦者，守书人称其「有着那么活跃的想象力！」，因此百年梦境十分广阔与宏大，Bera 教授征服野兽、解救一名由当时生活在梦境中的人类扮演的公主 Claier，并与其成家立业，建立王国。尽管守书人一再提醒梦境的虚伪性，他仍拒绝醒来。
//
//「他在幻想世界里陷得如此之深，让我很快意识到他对现实世界而言更满意这里。我告诫他这都是幻觉，不过他不听我的。他说如果他被迫离开，他会立即结束自己的生命。我试着让他保持快乐尽量久……」守书人说道。
//
//在二百年后，极度不稳定的梦境走向崩塌，Bera 教授离开 Level C-276，Claier 被强制召回到 Level 1，在回到 Level 1 后她似乎处于失忆状态，时任项目负责人 Dr.Bright 向她解释了她在哪里以及她是谁，数分钟后，Claier 恢复记忆，并于当晚在洗手间使用一捆绳子将自己吊死。她的遗言被写在手机备忘录中：「致我亲爱的 Bera 国王，我永远回不去了。」
//
//Dr.Bright 递交的报告中描述了上述内容，并在结尾处写到：
//
//他的精神状态比那天 Claier 刚刚自杀时好得多，他告诉我那位做梦者在回去之后也因此自杀，有人给他一些善意的建议，现在他又开始去筹划那些奇幻冒险故事了，并且打算设定一些规则以防止再出现这种悲剧。我认为此后应控制进入层级的流浪者数量，尽量让那些对冒险故事感兴趣的人进入。鉴于我或许会忙于其他研究，故卸任本职，但请保留我的进出通行证，守书人似乎希望我与他多聊聊天。
//
//就像他说的那样，这可能是最甜美的梦，可最终我们必须醒来。
//
//基地、前哨和社区
//暂无法建立有效的基地、前哨和社区。
//
//入口与出口
//入口
//翻开 无标记绿色的精装皮书籍 的第一页，熟睡后进入本层级。
//在任何一本常规意义上被称之为「书」的物品的第一页用任一自然语言正确拼写「英雄的诞生」，熟睡后可能进入本层级。
//出口
//在层级内向守书人要求离开将被切出至 Level 1 或 Level 466 的森林生物群系边界。
//作者信息
//« Level C-275 | Level C-276 | Level C-277 »
//
//Footnotes
//1. 即从外观与行为上与常人无异，但客观上没有意识的存在。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1276{}