//Level C-214
//评分: 
//+30
//+
//–
//X
// 
//
//生存难度：
//等级 功能
//
//货币来源
//商业繁盛
//金融交易
//Level C-214是后室C层群的第214层。
//
//描述：
//city_manhattan_sunset_town_buildings_skyscrapers_traffic_dusk-1087339.jpg!d
//黎明时的Level C-214，可见街道已经非常繁忙
//
//Level C-214是一座空前繁荣但不完整的城市。气温恒定于24℃，拥有非常规律与前厅时间相近的昼夜交替，层级的面积为130平方公里，有着完善的交通网络，内部存在装饰豪华的火车站，和近似前厅服务企业高级管理，政府高官和名人的VIP小型机场，城市的功能以金融为主，其他所有设施和功能都围绕着金融交易进行。
//
//Level C-214存在大量实体，全部为无敌意的无面灵，他们从事各种工作，同样围绕着为金融贸易服务。整个层级内充盈着强而稳定的Wi-Fi，拥有大量的证券交易所、银行、保险公司、期货交易所，内部设施齐全，装饰豪华。由无面灵担任服务员工。所有无面灵都佩戴发声装置，使他们能够以多种语言与流浪者进行交流。层级能够提供所有前厅的金融服务，包括股票、基金、债券、金融衍生品、货币、保险、期货、贵金属，同样也能为发生在大型组织或流浪者之间的贸易提供金融服务，并从中收取费用。
//
//交易面板上显示的，能够进行金融投资的公司名称有很多属于前厅，但有一些企业名称并不为人所知，且命名风格诡异而离奇，推测可能属于后室。金融曲线的变动经过Wi-Fi连接前厅网络探查，与现实中存在的企业经济情况和金融市场变动保持一致，注意属于后室的公司金融曲线变动比前厅公司更为不稳定，剧烈的大范围涨跌可以更频繁的发生。尚不清楚大型组织和流浪者的投资是否会流入前厅公司，以及是否会对其经济业务产生影响，也不明确发放给流浪者的利润从何而来，如果就此问题询问柜台服务的无面灵，将得到投资会流入前厅公司的肯定答复，但无论是员工或高级管理阶层都拒绝进一步回答问题。
//
//层级内有着无面灵安保部门，他们拥有完善的防护装备和武器，如果出现了人员之间的肢体冲突他们将出动并制止，如果冲突剧烈他们会使用非致命武器殴打并驱逐人员，被驱逐人员在一定时间内被禁止进入层级，如果出现了伤亡情况，无面灵安保会使用致命武器进行镇压，如果情况需要，还会出动镇暴车辆。另外，Level C-214不允许宠物入内。
//
//金融及衍生品交易：
//brooklyn_nyc_new_york_new_york_city_city_manhattan_bridge_brooklyn_bridge-1071720.jpg!d
//一些携带货物的流浪者，正徒步前往Level C-214
//
//Level C-214内部的交易不接受杏仁水或其他任何实物货物，只接受前厅流通的各种主要货币。在层级公路入口附近有一个专门的货物交易所，专供各类大型组织和流浪者将所携带的实物商品转换为前厅流通货币，包括美元、卢布、人民币、英镑、欧元、日元等主要货币。可进行兑换的货物种类繁杂众多，但每日可进行兑换的商品种类和最大额度都略有不同，且有最低货物数量限制，如果流浪者个人携带的商品数量小于最低阈值则不予兑换，另外层级每日兑换的货物数量也存在最高限度，但上限通常很高，一般不必担心达到交易上限。注意，杏仁水总在可转换商品之列，且价格与各种货币以发现层级第一天的固定汇率锚定，使杏仁水每日总能以不定数量和各种货币的固定价格交易，不受汇率变动影响，这意味着所有货币种类都能使用不受汇率影响的固定价格交易杏仁水，此种情况会导致何种后果目前未知。
//
//将实物商品转换为货币后，即可进入层级内随意的金融交易所进行交易。普通的流浪者可以根据自己的财产，看好的交易对象和金融服务种类进行有限投资，并从中收获利润或承担损失。大型组织的一般业务也将如此，如果更富有的流浪者进行较大投资或大型组织需要发起大额业务，则会有专职的无面灵高层管理者将他们请入高级，装修奢华的VIP商谈室，告知一些内部信息，洽谈业务。
//
//层级内的保险公司也如同层级其他公司的一般特征，既拥有前厅众多知名的保险公司品牌，又拥有名称怪异的后室专属公司，自Level C-214被发现后，各大型组织为员工在此购买了充足的人身、财产保险。以作为各大型组织员工一项专属福利，目前为止所有保险赔款均得到及时交付。
//
//Level C-214内部的银行则均为前厅著名银行，没有名称怪异的不知名银行现象出现。在此大型组织和流浪者可以办理存贷款，支付结算和银行卡、信用卡、担保、代理、托管、咨询业务。一些切入后室时身上仍带着银行卡和信用卡的流浪者发现携带的支付卡仍然可以使用，并可提取现金。各大型组织和流浪者已在层级银行进行了一定程度存款，一些组织和流浪者甚至办理了贷款业务，感知其安全性和保密性后，不少流浪者和规模不大的组织甚至将大部分的财产都存入了银行，鉴于尚不确定是否会发生意外事件，各大型组织对于是否在Level C-214银行扩大存款额度，依然存在不小争论。层级拥有统一的交易软件，大部分的交易均可在后室中寻找到，连接Wi-Fi的电脑上完成，且也可以进行电子支付，但一些金钱额度过大的交易，涉及个人和组织私密信息的事务，及一些专属的VIP交易则需本人或组织代表到场进行。
//
//期货和大宗商品贸易：
//the_shard_london_architecture_england_united_kingdom_landmark_building_places_of_interest-747080.jpg!d
//Level C-214的运河，无商船通过时
//
//Level C-214拥有一条宽阔的人工运河，长度达数千公里，直通海洋，宽阔程度足以行驶万吨级巨轮，以运输大宗货物。运河尽头有大型码头，可以装卸集装箱运载的海量商品，码头附近有专属的期货交易所，可供期货交易和购买大宗商品。可供购买的大宗商品种类繁多，包括粮食、棉花、油料作物、橡胶、煤炭、钢铁、有色金属、木材、塑料、能源（火盐、星云）、工业原料（沥青、线缆、硅铁、不锈钢板、锰硅、热轧卷板、玻璃、塑胶、pvc、甲醇、聚丙稀、纸浆、纤板等）、稀土、贵金属。购买数量的下限很高，普通流浪者无法负担，只有有财力的大型组织有需求和能力在此购买大宗商品。价格随前厅情况变动，尝试跟踪商船去向的行动没有结果。大型组织购买粮食、能源和工业原料，用来弥补后室可能出现的粮食供给不足，或满足对工业生产的能源和原料需求。
//
//居住环境及零售：
//time_square_new_york_city-1085227.jpg!d
//夜间Level C-214居住和餐饮区域，实体多为无面灵
//
//Level C-214能允许流浪者将大量实物商品转换为货币，甚至流浪者可以在层级内出售自己的劳动力，层级中无面灵担任的工作岗位会不时出现空缺，希望寻找工作的流浪者，可以相对容易找到工作，包括不限于快餐店、超市、酒店、零售商店职员，能力合格的流浪者甚至可以找到金融交易所，保险公司，银行职员的工作，并在月末领取工资。层级内部有着可供居住的区域，多为高层公寓，但住宅内居住的实体大多是无面灵，但其中也存在一些空房间可供出租给流浪者，同时，也有不少大量空置的廉价公寓，专供在此工作的流浪者租住。注意层级只能租用房间，不可购买不动产。
//
//城市内存在大量零售商店和超级市场，出售食品和生活物品，均须使用货币支付，价格与前厅保持一致。同时有着多条美食街，其中包含麦当劳、肯德基、星巴克等知名快餐品牌，品种众多中国地方小吃，日本寿司店，土耳其烤肉，意大利面馆，墨西哥卷饼店，及其他世界知名小吃。层级零星散布多家奢华大型酒店，提供餐饮和住宿服务，并提供会议室和其他设施，主要供各类组织洽谈经济往来，及随后的宴会和住宿需求。餐饮拥有几乎所有前厅各国美食菜系种类，例如正式西餐，牛排，中国八大菜系，及其他国家正式美食。酒店住宿环境豪华程度堪比甚至超过前厅五星级酒店，自然，费用不菲。
//
//自层级被发现后，由于其本身的特性，各类组织和大量流浪者纷至沓来，用在后室中能够寻找到和能生产的一切实物商品兑换货币，由于货币价格和杏仁水锚定，以及能在Level C-214购买大宗货物，零售商品和金融服务，所以各类前厅货币被认为存在使用价值。大型组织和流浪者在层级发现后开始使用前厅货币进行交易，由于杏仁水无法大量携带并且价值有限，现阶段后室的贸易流通中纸质货币与杏仁水并行，以前厅的价格交易物品，大型组织也开始给愿意接受的员工发放纸质货币，同时为不愿接受的员工继续发放杏仁水。相当数量的流浪者，尤其是前厅有投资经验的流浪者前往Level C-214，渴望继续在后室中赚取可观财富，由于金融衍生品本身的特性和后室公司金融曲线更加不稳定的特性，成功者的比率并不高。
//
//关闭邮件：
//发件日期：2020.10.29.
//
//致各位监督者：
//
//如各位所见，我们已经找到了新的层级，近乎完美地解决了后室贸易日渐扩大而货币短缺的问题，如今我们在后室中找到了前厅货币的购买力，使货币再次成为货币，而非纸张。
//
//但同时，这在极大解决我们问题的同时，却产生了一些目前不知后果的影响。
//
//这个层级除了里面有无面灵，根本不像后室。
//
//在新层级的消息传播的时候，不少流浪者都兴奋起来，那几天真的是很难形容，很多流浪者一个层级一个层级地搜集物品，大包小包的装车带走，只要是没人常住的地方都被搜刮一空，尤其是杏仁水，那段时间我在各个层级转了转，能取杏仁水的地方都排着长队，Level C-28的自动售货机一连好几天基本一瓶杏仁水都没有，喷泉周围总是人山人海，Level 4干脆排队排得看不见边，连Level 11也没剩几瓶。后来连能动的车都捜刮了个一干二净，火盐和星云气站供应那段天天见底，大家排着队开车去Level C-214，没有车的大包小包挤上火车，生怕落在人后边。
//
//很多人都希望通过金融交易，更便捷地谋取金钱，但成功者寥寥，如果我们太大规模地将实物兑换为货币，那可能造成实际的物品短缺。后室能自动生成的物品的频率并不是很快，就像Level C-28虽然能无限制运来物品，但同一时间内存在的货物终究是有限的。过多将实物转换为货币，可能会把后室那些本来不多维系生存的实物商品，如同那变幻的金融曲线般，流向虚无。
//
//我们虽然能在Level C-214购买包括粮食、能源和工业原料在内的大宗商品，但运输需要时间，虽然层级看起来十分安全稳定，不过我们无法保证那些在宜居层级中发生的灾难还会不会发生在此，不能过分依赖这种途径。
//
//各组织和流浪者在层级进行的金融交易导致了一种浮躁的情绪，每个人都希望更快地得到金钱，就像前厅一样。加上交易对象中存在大量未知的公司，使得交易更加不稳定，有人一夜暴富，腰缠万贯，有人一贫如洗，红色日和黑色日发生得更加频繁。在后室中我们应当谋求安全而稳定的生存，乃至更进一步的发展，而不应该让这种浮躁的心理过大地影响内心。
//
//以上，希望能够推出措施在后室内保证物资不被过度兑换，以及平静近期流浪者过于浮躁的情绪。
//
//我也会在Level C-28尝试采取措施，并且执行监督者议会的命令。
//
//
//发件人：李玖夜
//
//基地、前哨和社区
//虽然层级内部总是有大量人员在进行金融和商务活动，甚至有不少人员居住，但并未形成任何真正意义上的基地、前哨和社区。
//入口及出口
//层级的向东的主要公路行驶200公里可以抵达Level 11-Level C-28的公路网络，由此其他方向可以连接Level C-34、Level C-115、Level C-254
//在VIP机场起飞进行航空飞行可以抵达Level 11、Level 36、Level C-28、Level C-34。
//层级中的火车站可以通往Level 11、Level C-8、Level C-28、Level C-34、Level C-254
//由运河向下能够抵达连接Level 230、Level C-63的海洋。
//以上均为稳定的双向通道
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1214{}