//Level C-243
//评分: 
//+6
//+
//–
//X
//Level C-243为后室C层群的第243层。
//
//关于本层级的报告仅此一例，故直接将报告作为文档呈现。
//
//本照片除采用了RGB256编码方式外，每像素还新增了一个无法理解的 0~F 之间的编码。此外，它的压缩方式我们无法解明，只得呈现一张较为模糊的图像。
//
//kazuend-19-SC2oa-VZW0-unsplash.jpg
//层级的林地
//
//本录音资料但收到于2022年6月28日。章琮黎确认在前厅有其人，但未进入后室。录音资料的编码是无法理解的无线电波频率，经过E.P.B.解码方获得音频。而且由于波段的调幅部分已经无法编码，所以推断资料其实是录像文件。
//
//“我现在已经进入了层级建筑物的大门。”
//
//“喂？总部？”
//
//“总部？能听到吗？这里是章琮黎？”
//
//“没有回应啊。”
//
//“发照片呢？这个是层级外部的照片。”
//
//“是不是断连了……不管了，就拿手机当录音机用吧。反正内存也够。”
//
//“好的，我现在是在这个层级的建筑内了。四周没有发现任何实体，但是有一些窗户……这些窗户与外面看见的是一样的，应该不是实体。阳光还透过这些窗户照进来。”
//
//“这里有一间教室。这间教室好像，嗯，真的很像我前厅的中学。真的，这个石灰墙面，还有墙面上的脚印。一模一样。”
//
//（推门声。推门后出现嘈杂的人声。）
//
//“这……这是……”
//
//（关门声。）
//
//“怎么回事？我的……同学？”
//
//（推门声。）
//
//“确实是无面灵没错啊，可是怎么……好吧，看着真的很像……无面灵……无面灵没有发声器官……这个声音……”
//
//“冷静……听一下……”
//
//“它们都……算了，我还是找个无面灵交涉一下。”
//
//（足音。嘈杂的人声渐渐增大。）
//
//“林永源？是……是林永源？”
//
//（嘈杂的人声中传来，并且有着强烈的杂音和粗劣的混响，和广播中传来的音质相似。）“琮黎。”
//
//（低声）“好的……冷静……”
//
//“今天几号啊？”
//
//（失真）“六月二十八号啊。”
//
//“啊……”
//
//（失真，并且是一瞬间进入音频）“对了，暑假你准备出去玩吗？”
//
//“暑假……我……六月……二十八……”
//
//（低声）“呼。现在我，我为了迎合毕业那天的时间线，得尽量地装成像那天一样。不然……不然谁也不知道会出什么事。”
//
//（失真）“啥呀，你说话能不能大声点。”
//
//“我不确定，毕竟分数还没出来。”
//
//（失真）“呀，我也是。”
//
//（失真持续）“对了，你上次要我带来的书我拿来了……只是找了好久，都没找到你想要的那个情节。”
//
//（低声并快速）“我当时说了啥？我，我应该没有讲感谢一类的话，我，我应该是讲了……”
//
//“嗯。”
//
//（失真）“看这个桌游，我新设计的。”
//
//（失真）“规则是…… [无关内容略去不记录]”
//
//（低声）“又讲了一遍……和他之前讲的是一样的。我没想到，我无聊时天天重演的游戏……”
//
//（低声）“我根本没想到我会听到第二遍。他和我已经不在一个世界了……”
//
//（低声）“好的，我下一句是……”
//
//（失真）“懂了吧，想玩一局吗？”
//
//（低声）“当时我下了一局，惨败。现在这个情况还是不要玩了。”
//
//“不用。”
//
//（失真）“好吧。”
//
//“我上座位去了。”
//
//（足音。落座声音，以椅子在地面上刺耳的摩擦结尾。人声更加嘈杂。）
//
//（用袖子擦汗的声音。）
//
//（低声）“那天我在干什么呢？好像是……坐在这里，什么都不干。好傻啊，我都不知道那之后我们就不能再见了。我毕业几年就失踪了，说好的同学聚会也没有去成。”
//
//（低声）“可是我为了保持世界线，只能坐在这里什么也不干。欸。”
//
//（低声）“好热啊。”
//
//（低声）“无聊啊。为啥要保留那个世界线呢？”
//
//（低声）“他们都在玩着啊。现在看来，也是最后的疯狂了吧？”
//
//（失真）“给我签个字啦，[已编辑]1。”
//
//（惊异）“啊，哦哦，好。”
//
//（低声）“完了，这么多年没写字，连签名怎么写都忘了……算了，写楷书……”
//
//（拾笔声；在胶质纸面上写字声。）
//
//（低声）“好热。”
//
//（失真）“这个是我要去的桌游店的地址哦。我什么时候去还不确定，会打电话叫你。”
//
//（低声，并用惊讶的假声）“这……这是……是Level C-120……”
//
//（低声）“怎么……好吧，冷静，我应该知道的，我的声音和那时候不是一样的了，它们不应该听不出来……Level C-120，好吧，林永源——”
//
//（低声）“他走了啊。”
//
//（低声）“不到一会这些无面灵怎么全走了？算了，我也出去吧。”
//
//（起身的声音。推椅子声，并且带着刺耳的滑动声音。跑动的足音；推门声。）
//
//“林永源——”（回音）
//
//（杂音）“一起走吗？”
//
//“你给我的地址是Level C-120。”
//
//（杂音）“嗯。后室，前厅，我们都知道。我们本来就是无面灵——只是在这里重现世界上的每次毕业，每次不告别就离去的遗憾。”
//
//“无面灵没有声音。”
//
//（杂音）“这当然不是无面灵的声音。”
//
//“那是什么？”
//
//（杂音）“只是我不喜欢如此仓促的告别罢了。”
//
//“好吧。那四年你们就一直在这里，演着一次毕业？”
//
//（杂音）“不是的——这里只有一天。就是那一天。”
//
//“原来我从进入大门的那一刻就一直在过去？”
//
//（杂音）“没错。好了，到门口了。”
//
//“嗯。我那天没说再见。”
//
//（杂音）“没关系——顺便说一句，今天是2022年6月28日。”
//
//“啊——怎么？”
//
//（杂音）“外面是？”
//
//“2026年2月17日。”
//
//（杂音）“那么，因为这段信息是在2022年6月28日就传出去的，所以那年的后室人类，会收到这条信息。”
//
//“啊？！时间折叠对无线电波没有影响吗？难道我们从2023年起就提出的四维散布空间理论2错了吗？”
//
//（杂音）“我不知道。我只知道，这里是这样，只有你穿过大门才能进入过去。”
//
//“稀有的四维彭罗斯楼梯形空间……我会叫M.E.O.D.拓扑部3来研究的。”
//
//（杂音）“不行。因为我们对未来的接入仅限这一天……已经完成了。无论再多来多少个人，都不会进入这个空间了。你看，那边的夕阳已经快下山了。”
//
//“嗯。好吧……好吧。再见。”
//
//（低声）“即使再也不见。”
//
//根据上面的记录整理出的层级文档。仅为参考。
//
// 
//
//生存难度：
//未探索
//实体绝迹（不确定）
//时空高度不稳定
//Level C-243是后室C层群的第243层。
//
//描述
//目前我们对Level C-243所知甚少，唯一资料甚至来源于未来的一段音频与一张照片。根据音频推测，层级主要分为两个区域。
//
//室外区
//室外区由一片竹林环境构成。这个区域的实体、环境皆不详，唯一可以确定的是区域有一片正常的天空，天空中有发光天体（暂时称为太阳）。在照片中可见的竹亚科植物确实竖直向上生长的条件下，照片中的太阳高度角约 60~70 度。
//
//室内区
//室内区的性质据推断根据进入者不同，会定向变化。
//
//层级的建筑物推断为学校式建筑。对于每一间教室，性质都是相同的。4教室中聚集着大量无害无面灵。无面灵的穿着通常与进入者在前厅的同窗相似，或是无面灵本身就有一种特殊性质，能够使进入者想起前厅的同窗。与无面灵交谈是可能的，但似乎无面灵本身不发出声音，发出声音的是一种类似广播的发声器械。
//
//无面灵认识到后室以及一切有关后室的信息，但仍然似乎保持着进入者毕业当日的言行。
//
//无面灵这么做的目的似乎是让进入者与其道别。不知道为什么，这一目的的完成没有使无面灵做出反应。
//
//时空异常
//将进入者毕业之日称作层内时间，与层外时间对照。对于一个从大门进入的进入者来说，在进入瞬间他已经来到了过去的层内时间，并在从大门离开时回到未来。但对于无线电波来说，它会一直保持层内时间。
//
//这种时间运作方式并不多见。
//
//入口与出口
//入口
//待探索
//出口
//待探索
//附录
//对于层级 Level C-243 的相对位置已在考量中，但是至今仍未发现任何能够通往该层级的线索。目前内部大部分认为层级出现的日期并未到来，但这种理论使电波变得无法解释。对于阻拦章琮黎进入后室的事宜也在考虑中，只是我们无法确认由此带来的一系列世界线变化是否会影响 M.E.G. 与更多后室组织。
//
//作者信息
//« Level C-242 | Level C-243 | Level C-244 »
//
//Footnotes
//1. 应当事人要求，外号删除。
//2. 未找到数据
//3. 未找到数据
//4. 因为我们知道记录员章琮黎只是在推门之后就将会进入特定的一间教室。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1243{}