//Level C-234
//评分: 
//+13
//+
//–
//X
// 
//
//生存难度：
//等级 基因危害
//
//不安全且不稳定
//实体绝迹
//恶劣基因影响性
//Level C-234是后室C层群的第2̵̨̭̖͍̗͐́̊̋͋͂̈́͌͘3̴̬̹͔̈́̑4̵̡̪̞̮̩̣͙̄̅̆͑̋̇ͅ层。
//
//描述
//Level C-234为一片开放性非欧几里得空间，空间具体面积未知。光线在Level C-234无法正常沿直线传播，因此无法留下该层级的影像资料。该层级无Wi-Fi信号，且磁场极其混乱，人类的方向感会在进入该层级的第一时刻完全消失。据唯一一次对Level C-234的探索记录报告，Level C-234似乎还会对初进入该层级的人类产生精神影响，具体性状包括：精神崩溃、感官失灵、思维错乱等。而饮用杏仁水似乎可以减弱这种初期的精神影响。
//
//进入Level C-234一小段时间后的人类会产生剧烈的头痛、恶心等症状，并出现非本性别的第二性征，严重者肢体会出现变异，例如会出现长出多余的附肢，头部长出角质等现象。
//
//在Level C-234中的时间超过一（1）小时以上的人类会产生更加明显的变异，骨骼及肌肉组织会与正常人类严重不符，最后会因多种原因导致死亡。据分析，Level C-234本身具有极强的基因影响性，γ射线以极为紊乱的路径传播，强烈的电离辐射会对生物染色体、细胞组织和基因信息段产生巨大破坏，致使生物产生变异。
//
//由于发现该层级内的γ射线传播的异常情况，M.E.G.又利用可见光等进行传播实验，得出波和粒子在该层级无法以正常状态传播的结论，可能与该层级混乱的磁场有关。
//
//Level C-234的威胁性极其特殊，不适宜进入其内部进行多次实验，故在第一次探索后，经过监督者内部讨论，M.E.G.现已明令禁止任何人员进入Level C-234。违反禁令进入者将直接被认定死亡。
//
//探索记录
//[记录开始]
//[前言：在本次记录前，M.E.G.已得到未证实消息，该层级无Wi-Fi信号连接，故使用特种设备进行通话记录。]
//
//M.E.G.：“您好，请不要害怕，按要求进入该层级，我们会保障您的安全。”
//
//流浪者：“真真真的吗？”
//
//M.E.G.：“是的，该层级非常安全，不会威胁到您的生命。”
//
//（流浪者切入了Level C-234。）
//
//流浪者：“我操！”
//
//M.E.G.：“您好？请回答，您看到了什么？”
//
//流浪者：“什么都没有！我什么都看不见！”
//
//M.E.G.：“可能是该层级亮度较低，您可以使用我们为您配备的高强度手压电筒。”
//
//流浪者：“行不通！我是不是瞎了！”
//
//M.E.G.：“根据我们对您身体的实时监测，您的视觉绝对正常，请按照指示向前探索。”
//
//（物体碰撞地面的声音）
//
//M.E.G.：“您好？发生什么了？”
//
//流浪者：“我感觉不太妙！头昏脑涨，没走两步就摔倒了——我不干了！快告诉我怎么出去！”
//
//M.E.G.：“对不起，我们暂未发现该层级的出口。”
//
//流浪者：“你们这群狗娘养的！你们他妈的骗我！快高素我怎么初曲！”
//
//M.E.G.：“您好？发生了什么事？您的思维系统为什么如此紊乱？请您立即饮用我们为您准备的杏仁水。”
//
//流浪者：“我河布了幸人水，我步之到我的嘴在哪李了¡”
//
//（呕吐声）
//
//M.E.G.：“您好？您好？究竟是什么情况？”
//
//流浪者：“啊啊啊啊啊啊啊者室身么？我长初地三之首了啊啊啊啊啊啊啊啊啊啊！”
//
//M.E.G.：“您好？您好？！”
//
//[记录中断]
//[后记：本次探索记录后，M.E.G.监督者内部根据多方面评估，对Level C-234发出严禁进入命令。]
//
//基地、前哨与社区
//由于Level C-234具有严重基因影响性，不适宜任何生物长时间停留，故没有任何基地、前哨与社区。
//
//入口与出口
//入口
//在Level C-8中寻找一口白色瓷砖砌成的水井跳下会让你来到Level C-234。
//出口
//暂未发现任何出口。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1234{}