//
//建立帐号 或 登入
//The Backrooms吧
//Backrooms Fandom Wiki
//The Backrooms中文wiki官方哔哩哔哩公众号
//Discord
//主页
//
//中文沙盒站
//
//图书馆
//
//层级
//|
//实体
//|
//物品
//|
//团体
//
//故事
//|
//相关人士
//|
//现象
//|
//设定
//
//搞笑文章
//|
//国际翻译中心
//
//原创图书馆
//
//原创层级
//|
//原创实体
//
//原创物品
//|
//原创故事
//
//原创团体
//|
//原创相关人士
//
//原创设定
//|
//原创搞笑文章
//
//原创艺术作品
//|
//原创现象
//
//网站
//
//最近创建的页面
//
//最近的更新
//|
//最近的编辑
//
//随机层级
//|
//随机原创层级
//
//随机实体
//|
//随机原创实体
//
//旧页面中心
//
//本月最高评分页面
//
//历史最高评分页面
//
//最低评分的页面
//
//社群
//
//讨论区
//
//翻译预定
//|
//最近的帖子
//
//作者页
//|
//中文网站作者页
//
//加入网站
//
//管理专用
//
//后台管理
//
//职员站点
//
//所有页面
//
//会员一览
//
//侧栏
//|
//顶栏
//|
//主题版式
//
//
//
//　
//
//Level C-275
//评分: 
//+16
//+
//–
//X
// 
//
//生存难度：
// 
// 
// 
//Picture
//Level C-275是层群C的第275层。
//
//描述
//Level C-275是一块盆地，盆地周围的边缘由高度未知的山脉组成，内部存在少许地势较低的丘陵地形和大片的森林，流浪者主要活动的城镇就坐落于丘陵中。盆地的面积似乎是无限大的，至今未有抵达山脉脚下的报告。
//
//城镇中有78栋居民房屋，这些房屋装修完善，但是房屋内没有安装任何家具。城镇内有非常完整的基础设施、电力系统和道路。基础设施均没有标记生产厂家和日期。城镇中电力设备均能正常使用，但是暂时无法定位电力来源，只能确定电力来自城镇外东边的远程输电塔。城镇道路仅在城镇内分布，没有发现朝城镇外延申的道路。道路上有车辆，虽然车辆完整没有损坏，但是无法启动。
//
//整个城镇像是被放弃了一样，但是内部设施却非常完备，似乎是因为某些意外不得不放弃。
//
//——M.E.G.275C号探索与研究基地成员，陈冬
//
//Level C-275中广泛分布大量的森林。森林中的植被种类众多，但是动物物种分布却只有无足鸟一种。这种类型的生态系统极其不完善，暂时不能说明为什么这种生态系统不会崩溃，对于Level C-275中生态研究和改造的工作正在进行中。
//
//Level C-275存在较为正常的昼夜变化，天空中可以观察到天体。气温恒定保持在21℃（70℉）左右，环境适宜，植物可以生长，具有极大的宜居潜力。目前Level C-275的开发计划已经启动。
//
//基地、前哨与社区
//M.E.G.275C号探索与研究基地
//这是M.E.G特别成立的基地。
//主要工作是对Level C-275进行探索、研究以及对可开发资源进行统计。
//群山探险队
//由一群爱好远征探险的流浪者自发组成。
//目标是向 Level C-275 盆地边缘的进行远征。
//和 M.E.G.275C 号探索与研究基地进行合作。
//协助 M.E.G.275C 号探索与研究基地进行探索。
//M.E.G.275C 号探索与研究基地经常会派遣人手协助探险队。
//星空社
//由一群热爱天文的流浪者自发组成。
//每天晚上都会到城镇边上小山的山顶进行星空观测活动。
//目前正在招募社员。
//入口与出口
//入口
//在Level C-194中寻找槲栎并切出会使流浪者出现在森林中。
//通过Level 90后院的老橡树也会出现在森林中。
//出口
//在任意森林内切出会出现在Level 11的森林公园中，但也有小概率进入Level C-107，因此除非意外不推荐在森林中切出。
//找到地势最低的房屋，对准大门切出会进入Level C-199。
// 
//
//至：M.E.G.总署
//自：陈冬
//主题：（邮件未命名）
//时间：2021.11.29
//
//快把Level C-275的层级出入口全都封锁掉！这里被人入侵了！
//
//至：（群发邮件）
//自：▉▉▉▉▉▉▉▉▉▉
//主题：Level C-275的等级调整
//
//（无用内容已经被删除）
//根据越来越多的资料发现和分析，现决定将Level C-275的等级调整至ω级，直到Level C-275的危险被完全消除为止。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1275{}