//Level C-259
//评分: 
//+6
//+
//–
//X
// 
//
//生存难度：
// 
// 
// 
//
//
//
//Level C-259是后室C层群的第259层，由一片无限延伸的木制无土栽培架构成。
//
//描述：
//e4b5a5434d683.jpg
//一张Level C-259的照片
//
//Level C-259的地面由湿润，肥沃且松软的黑土构成。黑土中不存在任何形式的生命，但是却充满对植物有益的无机物，而且无机物会在减少时以未知方式得到补充。理论上这是层级内最适合植物生长的地方，但是整个Level C-259的土层都寸草不生；M.E.G.多次尝试种植植物的行动都失败了，种子在吸收一定无机物后就会因不明原因死亡；尝试利用土层饲养蚯蚓、甲虫、微生物、菌类的实验也都没有结果，貌似所有有机物都无法在这里的土层里存活。对土壤的化验结果也没有任何异常。
//
//Level C-259里遍布由未知木质材料构成的无土栽培架，这些栽培架的结构与普通无土栽培设备差距很大，没有一点科学技术含量、没有相应配套设施、没有控温设备，好像只是粗制滥造的木架，但是其种植植物的平台内却有来源未知且会自动补充的营养液。这些营养液的成分未知，但是会加速根部浸泡其内的植物的生长速度，效果惊人1。但这些营养液一离开Level C-259就会失效，根据最新的研究报告发现，这些“营养液”似乎是由木架分泌出来的。
//
//无土栽培架上利用营养液大量栽培着一种草本植物，但是这种草本植物同时拥有灌木，乔木和多肉植物的生物特征，在营养液中时它们不会生长、开花、结果，但一旦离开营养液，这些植物就会在15分钟之内开花结果，并在果实成熟后迅速死亡；对这种植物的果实及花朵的化验结果
//在此。
//Level C-259内有两种无法解释的现象，这两种现象直接影响了Level C-259生存难度分级，请在Level C-259 E-1内检视。
//
//- 存储文件
//“C-259 症候群
//Sindromus
// ”
//“C-259症候群”是一种只会在Level C-259和与之相关的地方2出现的病症，表现为在视野尽头出现树木和大棚的幻觉和听到一种类似重复电子音的奇怪白噪音。在Level C-259内部的该病症症状更加明显，并会跟随在Level C-259内部停留的时间以及“C-259现象”的影响逐渐加重。
//
//“C-259现象”
//“C-259现象”是一种只会出现在Level C-259内部的诡异现象，具体表现为无论同时有多少流浪者在同一时间，同一地点切入Level C-259，都不会在该层级内部相遇；不排除本层级过大或拥有多个子层级的可能。
//但幸运的是，Level C-259内虽然没有wifi的存在，但是流浪者还是可以通过通讯设备联系对方及其他层级。
//一旦确认切入Level C-259且确认已经受到“C-259症候群”影响后，就应该迅速通过通讯设备联系M.E.G.C-259支援小组的人员并在指引下在20小时内离开Level C-259。原因是在M.E.G.在该层级探索行动中所有在20小时内未离开Level C-259的人员全部突然失联，并且所有探索人员在失联前其身上的通讯设备都会向指挥部发送一条同样的信息：
//
//wkh sodqwv zloo jxdug wkh Lqghvfuledeoh vhfuhw.
//
//
//
//
//基地，前哨和社区：
//M.E.G.C-259支援小组
//该团队是 M.E.G.为了帮助切入Level C-259的流浪者顺利在20小时内逃离本层级成立的
//团队有24位成员
//团队驻扎在Level C-160,拥有稳定的服务器
//在几个已知的Level C-259出口设置了联网遥控烟雾弹
//联系方式：Email 2959593929@meg.com
//拥有Level C-259部分区域的地图
//在层级内设置了多处通向速切中点的诺克立普贴
//
//
//
//入口和出口：
//入口：
//在C层群内进行切入/切出行为时有0.2％的概率进入Level C-259
//连续切入/切出6个生存难度低于1的层级时有1％的概率进入Level C-259
//在切入/切出时身上携带Level C-65产物时会进入Level C-259
//在Level C-12内穿过一个门框（双向入口）到达Level C-259[已封锁]
//出口：
//穿过层级内少见的木架构成的门框后会被传送到一个随机的安全层级，且未来24个月之内Level C-259的入口对你失效
//切入M.E.G.C-259支援小组在Level C-259设置的诺克立普贴后到达速切中点
//
//
//
//
//附录：
//M.E.G.探索小组“血葬”对Level C-259的探索记录
//- 存储文件
//录音日志记录
//
//日期：2022.7.15
//
//探索队伍：M.E.G.探索小组“血葬”
//
//目标：Level C-259深层区域探索
//
//领队：龙潇
//
//探索成员：何晓-记录员 李牧-后勤人员 Carmen·Poter-探索人员
//
//探索装备：
//
//有线通讯装置（兼作为防止迷路的绳索）
//长刀
//计时器
//诺克立普贴一张
//[记录开始]
//
//龙潇：一切正常，进行通讯测试；Carmen你能听到吗？
//
//Carmen·Poter：通讯正常，就是有些杂音，影响不大；开始进行探索。
//
//龙潇：好，注意安全，现在开始计时。
//
//两小时倒计时开始。
//省略1小时30分钟的无意义内容。
//
//龙潇：Carmen注意，开始返回。
//
//Carmen·Poter：等一下，我发现了一些东西…
//
//龙潇：赶紧返回，时间不够了！
//
//Carmen·Poter：哦…不，它….好像在指引我…
//
//龙潇：别跟上，快回来！！
//
//通讯杂音
//
//Carmen·Poter：再给我些时间，我马上回来。
//
//龙潇：你疯了吗，你忘了那些流浪者的下场了吗？
//
//Carmen·Poter：我不一样，我有武器，还有诺贴，怕啥。
//
//通讯杂音
//省略1小时50分钟无意义内容
//
//龙潇：已经过了快三个小时了…..Carmen，报告状态。
//
//Carmen·Poter：通讯杂音
//
//龙潇：什么？
//
//Carmen·Poter：天哪…..
//
//龙潇：Carmen你发现什么了？
//
//Carmen·Poter：我的妈呀，如果你能看见我所见到的东西….[奇怪的杂音]
//
//龙潇：怎么了？Carmen你看见什么了？
//
//Carmen·Poter：潇哥，这真可怕——恐怖——难以….形容….[奇怪的杂音]
//
//龙潇：Carmen，什么东西？什么东西？
//
//Carmen·Poter：我不能告诉你，潇哥！它完全无法想象——我无法告诉你——没人在知道它之后还能安然无恙——老天啊，我从来没见过这种东西！[奇怪的杂音]
//
//龙潇：Carmen，快回来，我们在入口接应你！
//
//Carmen·Poter：不….已经太晚了，看在上帝的份上，封锁在Level C-12的入口，不要进来！快逃到其他层级，快！——抛掉一切逃到安全层级——这是你们唯一的机会！按我说的做，不要问为什么！[奇怪的杂音]
//
//龙潇：到底发生什么了，Carmen；你到底看见什么了？
//
//Carmen·Poter：[奇怪的杂音]
//
//Carmen·Poter发出了一声尖叫
//
//Carmen·Poter：跑啊！！在老天的份上，封锁入口，跑啊，龙潇！！！！
//
//龙潇：Carmen，撑住，我们来了！
//
//Carmen·Poter：不，你们不会理解的！太晚了——我的错！没有用了——你们必须走——一个总比四个好！——[停顿了一下]就快结束了——不要再为难了——封锁那该死的入口然后逃命吧——你们这是在浪费时间——再见，潇哥，我不会再见到你们了….[奇怪的杂音]
//
//Carmen·Poter发出了一声尖叫，并传来了肌肉和骨头碎裂的声音，怪异的杂音突然变大，然后在一瞬间陷入寂静
//
//龙潇：Carmen，Carmen你还在吗？Carmen！Carmen·Poter，你还在吗？
//
//怪异的杂音
//
//龙潇：Carmen？
//
//
//[记录结束]
//
//在Carmen·Poter发送完最后一条消息后，“血葬”小队立刻封锁了在Level C-12的层级入口并迅速撤离；利用诺克立普贴到达了Level C-160，在探索小队撤离1小时后，Level C-12所有出入口瞬间失效，其内部流浪者在这次探索任务结束12天，Level C-12出入口恢复正常后被发现全部失踪，包括Carmen·Poter。
//
//值得一提的是，在“血葬”小队撤离之前曾经尝试通过收回通讯线缆的方式找回Carmen·Poter，但是在收回5\1的线缆时，发现线缆断裂；根据线缆断裂口的状态判断，这根线缆是Carmen·Poter在出发2小时50分钟时断裂的。
//
//
//作者信息
//
//« Level C-258 | Level C-259 | Level C-260 »
//
//脚注
//1. 但却对Level C-259 的原生植物无效
//2. 包括本文档，但是在本文档内只会出现幻觉 你说对吧
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1259{}