//Level C-279
//评分: 
//+10
//+
//–
//X
// 
//
//生存难度：
//等级 4
//
//不安全
//不稳定
//实体绝迹待查
//Level C-279是后室C层群的第279层。
//
//描述：
//Level C-279环境类似于前厅中的南极地区，但此层级的面积仅有约864.7万平方千米（2009年测量）。此层级的绝大多数地区被一个永久冰盖所覆盖。在一般情况下，此层级在一天当中的9~13个小时都处在风暴状态，在此状态下的Level C-279极易发生如雪崩等自然灾害，因为有着与前厅不同的气候，所以此层级在绝大多数情况下温度都低于零下30摄氏度左右。
//
//目前于此层级中尚未发现有害实体，但由于此层级拥有“化雪期”的缘故，因此不排除有部分实体会在“化雪期”出现。
//
//Level C-279拥有着基本正常的昼夜变化，因此在安全的情况下可以搜寻此层级的物资。和大多数流浪者的想法不同，Level C-279并不是一个物资匮乏的层级，相反，在一些刚结成的灰色冰块中可以寻找到火盐，呈黄色颜色的冰块大多数情况下为此层级凝固的杏仁水，但此层级的蓝色冰块所融化出的水并不能正常饮用，因此此层级的绝大多数水源是不可饮用的。1
//
//“化雪期”
//研究发现，此层级在一些特定时间及情况下会出现大规模的当地雪吸热融化的现象，这一现象被流浪者称之为“化雪期”，具体形成缘因未知。一般“化雪期”出现在每年的一月到二月期间，偶尔也会持续到三月，于此状态下，此层级的温度会保持在10摄氏度～15摄氏度左右，且会比往常大量减少自然灾害出现的频率，因此在此状态下的Level C-279被认定是安全的。
//
//photo-1596568689074-ca07a70bdf1c?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1548&q=80
//Level C-279在“化雪期”时的景象
//
//在“化雪期”所被融化的雪并非直接吸热变为水的状态，而是会保持一种类凝胶的状态，具体形成缘由未知，此状态大约能维持10～15天，且此状态下的雪温度大约为零下20摄氏度到零下30摄氏度。
//
//在经过部分测试后发现，触摸此状态的雪时间过长一般情况下并不会被冻伤，且根据研究发现此状态的雪在融化时会放出热量，原因未知。由于此原因，这种“放热融化”的特性被研究人员称为“反融化”，这种状态下的雪也被称为“反融化状态”。同时，也因为此特性，这种状态的雪也被作为此层级著名的饮料“反冰冻酒”的主要原材料。
//
//基地、前哨和社区
//“凿冰队”
//由D.P.P.O的62名成员组成。
//2008于此层级建造了“凿冰基地”。
//经常于“化雪期”大量收集凝胶状态的雪来制造“反冷冻酒”。
//部分情况下会接管非化雪期期间前来的流浪者。
//入口与出口
//入口
//从Level C-11中发现一个冷库后进入。
//进入Level C-205中的一个挂着“南极”的牌子的冰洞口后来到此层级。
//出口
//在“化雪期”进入一个充斥着大量凝胶状雪水的洞口后可来到Level C-7。
//在非化雪期期间掉入一个刚形成的冰面后可来到Level C-21的冰箱上方。
//作者信息
//« Level C-278 | Level C-279 | Level C-280 »
//
//Footnotes
//1. 不包括此层级的雪所融化的雪水。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1279{}