//Level C-299
//评分: 
//+30
//+
//–
//X
// 
//
//生存难度：
//等级 2
//
//因人而异
//稳定
//安全
//Level C-299是后室C层群的第299层。同时仅有一名流浪者能进入和留在该层级。
//描述
//Level C-299的初始环境为一个黑暗的舞台。幕布为关闭状态，无法人为拉开或破坏；通往后台的门无法打开；地板为木质，同样无法被破坏。在触发Level C-299的效应前，流浪者无法离开舞台前往别处，也无法由本层级切出至别的层级。
//
//如果流浪者在舞台中演唱任意时长超过1分钟的歌曲1，将触发Level C-299的效应。歌曲的种类没有要求，哼唱无歌词的纯音乐同样会触发效应。
//
//流浪者开始演唱后将无法停止演唱，同时层级中将会响起同一首乐曲的交响乐版本作为流浪者的伴奏。2幕布将立刻拉开，8盏舞台灯将以令人舒适的白炽灯光点亮整个舞台。幕布外为一处剧院，座椅上坐满了神态与行为各异的、形似普通人类的实体，这些实体似乎无法听见或看见流浪者除了演唱歌曲以外的任何行为。在流浪者演唱的过程中，后台的门会打开3，若干实体会从中跑出来到舞台上，这些实体不会对流浪者造成伤害。
//
//通常来说，舞台实体的行为、数量和外观与流浪者演唱的歌曲的“剧情”有关。如，哼唱有关人类男女爱情破裂的歌曲时，舞台实体的外貌为2名人类4，其中一名实体会在与另外一名实体“吵架”后拂袖而去回到后台，留在舞台上的实体会开始“伤心欲绝”地“哭泣”。若流浪者演唱的歌曲没有具体的“剧情”，则舞台实体的行为会根据歌曲的风格、歌词、歌名和节奏变化。目前推测。这些实体是在进行一种“表演”，但无法得知这些实体是如何了解流浪者所演唱歌曲的内容并以此进行“表演”的。
//
//演员实体的表演和音乐伴奏总是会在流浪者唱完歌曲的同时结束。表演结束后，观众席上的实体将会报以热烈的掌声，同时灯光将会关闭，幕布也将落下。之后，流浪者将会被传送至Level C-144的一处餐厅。在Level C-144转变为死区层级后，Level C-299传送的目的地也由Level C-144变为Level 11的一处歌剧院的大门口。这扇大门同时也是Level C-299的入口之一，但流浪者在离开Level C-299后的3天内无法再次进入该层级。
//
//隐藏
//近日，一名名为莫利卡的流浪者误入了Level C-299，在演唱歌曲时因忘词中断了演唱。此后他被发现蜷缩着躺在Level 1的一处地面上，明显受到惊吓。目前莫利卡正在接受心理治疗，对其所遭遇事件的采访将延至其心理问题康复后。M.E.G.建议各位流浪者在该层级演唱歌曲时选用自己有把握能唱完整曲的歌曲，以免遭遇不测。
//
//基地、前哨站与社区
//Level C-299因其特性，同一时间仅能容纳一位流浪者，故无法形成任何社区。
//
//入口与出口
//入口
//由Level 11的一处剧院大门可以进入该层级。
//
//Level 1、Level 6.1和Level C-1445中均有一张破损的、无法识别具体内容的歌剧海报，切入这张海报可以来到该层级。
//
//出口
//目前已知完整唱完一首歌曲会被传送至后室C层群的随机一个安全层级。
//
//层级资料更新，本文档即将归档。
//
//关闭
//Level C-299
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//
//Level C-299是后室C层群的第299层。
//描述
//Level C-299是一个类似于剧院的层级。原先的Level C-299带有一系列特性，但在2021年2月22日，一名流浪者报告该层级的特性已经全部消失。在经过一系列调查后，M.E.G.确认了这一报告属实，并将该层级的生存难度重新划分为0级。
//
//现在的Level C-299已经不含有任何特性。流浪者可以在来到该层级后跳下舞台自由活动。除了作为目前唯一出入口的剧院大门外，剧院内的所有门窗均无法打开或破坏。该层级限制流浪者数量的特性也已经消失，剧院的空间可以容纳大量流浪者。剧院的座椅也无法破坏。
//
//尽管Level C-299内部不会生成物资，但仍有流浪者来此活动。目前，Level 11的流浪者社区已将Level C-299作为正常剧院和社交场所使用，一个表演爱好者小组和一个业余交响乐团定期在此表演节目。
//
//M.E.G.仍在调查引起Level C-299转变的原因。
//
//基地、前哨站与社区
//如上文所述，一个表演爱好者小组和一个业余交响乐团会定期在Level C-299表演节目。由于来往于该层级和Level 11十分便捷，许多流浪者也经常来到该层级进行社交活动。
//
//入口与出口
//入口
//由Level 11的一处剧院大门可以来到该层级。
//
//出口
//由入口中提到的同一大门即可回到Level 11。
//
//切入观众席墙上的一幅褪色的、疑似商场迎新广告的海报可以来到Level C-800
//
//附录更新
//演奏落幕。
//脚注
//1. 指歌曲本身的长度，而非演唱者演唱的时间长度。
//2. 若流浪者哼唱纯音乐，同样会响起伴奏，但流浪者依然无法停止哼唱。若流浪者演唱的歌曲为自己即兴创作的歌曲则不会触发这一效应。
//3. 由于视角及灯光有限，流浪者无法看到门后的场景，也无法穿过门来到后台。
//4. 在这种情况下，其中一名实体的外表为男性，另一名则为女性。
//5. 该入口在2020年2月21日后失效。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1299{}