//
//建立帐号 或 登入
//The Backrooms吧
//Backrooms Fandom Wiki
//The Backrooms中文wiki官方哔哩哔哩公众号
//Discord
//主页
//
//中文沙盒站
//
//图书馆
//
//层级
//|
//实体
//|
//物品
//|
//团体
//
//故事
//|
//相关人士
//|
//现象
//|
//设定
//
//搞笑文章
//|
//国际翻译中心
//
//原创图书馆
//
//原创层级
//|
//原创实体
//
//原创物品
//|
//原创故事
//
//原创团体
//|
//原创相关人士
//
//原创设定
//|
//原创搞笑文章
//
//原创艺术作品
//|
//原创现象
//
//网站
//
//最近创建的页面
//
//最近的更新
//|
//最近的编辑
//
//随机层级
//|
//随机原创层级
//
//随机实体
//|
//随机原创实体
//
//旧页面中心
//
//本月最高评分页面
//
//历史最高评分页面
//
//最低评分的页面
//
//社群
//
//讨论区
//
//翻译预定
//|
//最近的帖子
//
//作者页
//|
//中文网站作者页
//
//加入网站
//
//管理专用
//
//后台管理
//
//职员站点
//
//所有页面
//
//会员一览
//
//侧栏
//|
//顶栏
//|
//主题版式
//
//
//
//　
//
//Level C-273
//评分: 
//+19
//+
//–
//X
// 
//
//生存难度：
//等级 5e - 环境
//
//不安全
//不稳定
//无有害实体
//Level C-273是后室C层群的第273层。由于此层级的极端环境所带来的危害，在没有做好万全准备前，极其不建议流浪者进入此层级探索。
//
//描述
//Level C-273的外观类似于前厅中的海洋，但海洋中的水完全由液氮1所代替，沙滩则似乎由致密的雪和冰屑所代替。目前仅对Level C-273进行了小范围探索，推测该层级可能是无限的。
//
//2093320779_61d5168227_b.jpg
//Level C-273的地面。
//
//mountain-3427481_960_720.jpg
//Level C-273的山脉（通过无人机拍摄），图中雾气为下文中提到的氮气雾。
//
//6829144465_a081749580_b.jpg
//一些上述实体在Level C-273中生成。
//
//该层级极其寒冷，M.E.G.观测到该层级温度在-196º~-210ºC之间。因此该层级没有可供给呼吸的空气，建议前往Level C-273时携带呼吸设备以及可靠的极端防寒装备2。
//
//Level C-273存在周期约为16.3时的昼夜更替，但日光辐射所提供的热量远不足以温暖这一层级，仅能使少部分表面的液氮蒸发形成氮气雾。
//
//由于此层级的极端环境，M.E.G.对于此层级的探索以短时间目视或无人机观测为主。根据观测结果，暂时将Level C-273分为海洋、海岸及山脉三部分。
//
//海洋
//Level C-273的海洋如前文所述由液氮构成，似乎占据了Level C-273的绝大部分可观测区域，面积可能趋于无限。此海洋拥有与普通海洋类似的海床结构，最深处可能有约3000m3深。海洋中似乎没有任何其它物体。
//
//海岸
//Level C-273中的主要可探索区域，地表由致密的雪和冰屑组成，因此可以放心在其上方站立。此区域暂时不存在任何形式的建筑物或道路。暴风雪4有时会侵袭这一区域，造成视野受限。
//
//山脉
//Level C-273中距海岸约30km处似乎有一座山脉，M.E.G尚未能够对此区域进行探索。与Level 420不同，这一山脉似乎不存在类似于山洞或裂谷的结构，并终日被氮气雾环绕。此山脉平均海拔约为2000~3000m5，地势似乎较为陡峭，而山体似乎较为平整。
//
//实体
//由于此层级的极端环境，本层级不存在任何常规的有害实体，目前观测到的有且只有一种此层级的特有实体，其外观类似于结冰的肥皂泡，但似乎无法被击碎。该实体能够自发在Level C-273中生成，并通过某种未知的方式飞行。尝试将其带离Level C-273将导致实体死亡。出于可能的对于该层级生态的保护需要，M.E.G.建议不要将这些实体带离Level C-273。
//
//本层级除极端环境外没有任何已知危害，因此该层级被推测可作为一个液氮等低温物质的稳定来源6，但不建议流浪者在未经充分准备的情况下擅自进入。
//
//基地、前哨与社区
//M.E.G.“低温应对小组”
//M.E.G.针对诸如Level C-273这样的低温层级设置的专门小组。由于Level C-273的极端环境意味着短期内无法设置一个可供长期驻扎的基地，该小组负责Level C-273的成员通常在Level 11的M.E.G.贝塔基地待命，仅会不定期执行对Level C-273的巡逻任务，并指引流浪者离开Level C-273。
//入口与出口
//入口
//在Level 11中进入名为“极致冷冻体验”的店铺。
//在Level 16中切入铺有沙子的雪地，由于该层级的不稳定性，这个入口并不可靠。
//在Level 6.1中把自己关进任意一个冷藏柜273秒。
//出口
//在Level C-273中试图切入沙滩可能会进入Level 16，由于该层级的不稳定性，这一出口并不可靠。
//跳入 Level C-273的海洋273秒后会在Level 6.1的冷藏柜中醒来，此方式似乎能够解除在Level C-273探索带来的负面效果。
//出口2可能会导致流浪者进入蓝色通道
//作者信息
//« Level C-272 | Level C-273 | Level C-274 »
//
//Footnotes
//1. 一种氮气在-196ºC的低温下凝结成的液体
//2. 宇航服可能是不错的选择。
//3. 等待精确测量
//4. 由固态氮、氧等物质组成
//5. 等待精确测量。
//6. 这些物质可用于低温超导、快速冷却、麻醉等领域。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1273{}