//Level C-264
//评分: 
//+19
//+
//–
//X
// 
//
//生存难度：
//等级 1？
//
//安全？
//不稳定
//实体绝迹
//Level C-264是后室C层群的第264层。
//
//描述
//Level C-264的主体为一艘大小约为1000平方米的太空飞船，飞船内部大部分设施已损坏，在M.E.G.探险队员的修复下，部分设施恢复正常。飞船内部的颜色大多为银色、灰色和深蓝，部分舱门无法打开，其余舱门可打开的舱室多为储藏室。
//
//透过飞船前端控制室的玻璃可以看到外部的太空，飞船前方常有陨石飞来，可通过操控武器系统将其摧毁。但当该层级没有流浪者存在时，不会有陨石击中飞船，原因未知。控制室中有一台显示器，两个座椅，以及一些不知道怎样使用的按键。在控制室中，Wi-Fi信号非常强，任何电子设备均可连接。
//
//储藏室中有几排货架，上面放有一些食物，如皇家口粮、杏仁水等。奇怪的是，在储藏室中，Wi-Fi信号微乎其微，摄像机会受到强烈的干扰，无法正常使用。储藏室中的杏仁水相当一部分是有毒的，无法饮用。有报告称在一些储藏室中，有些货架可以移动，移动后原处会出现一扇橙色的大门，推开即可进入其他封闭的舱室。
//
//milky-way-starry-sky-night-sky-star-956981.jpeg?cs=srgb&dl=pexels-felix-mittermeier-956981.jpg&fm=jpg
//Level C-386中的太空。
//
//飞船之外的太空温度低至绝对零度1，故无法对其进行探索。根据L.E.B.提供的信息和数据，可以确定飞船一直在以百分之十的光速航行，但与周围恒星的相对距离却一直保持不变，原因未知。
//
//- 返回
//确定要继续访问吗？
//
//- 取消
//M.E.G.重要文件
//在群星的尽头2
//亲爱的流浪者们，如果你看到了这篇文章，则代表着我已经离开了这个层级，或者说我死了.总之你们无法在此处见到我了。
//
//我是这艘飞船的船长，十几年前一次外出执行任务时，飞船引擎出了故障，我们无法减速使飞船停下，或者改变航向返回，飞船就这样一直以百分之十的光速行驶着。
//
//直到有一天，飞船与地球的通讯中断了，我发现飞船受到了严重的电磁干扰，于是派了一名队员前去检查，可是他刚走出舱门，就被冻成了冰块。我们立马关上了舱门。但还是造成了舱内部分损坏。我们惊奇地发现飞船的燃料过了很长时间仍然没有减少，而且周围的恒星貌似和飞船以相同的速度和方向飞去，在我们看来它们是静止的。
//
//我迅速让大部分船员进入休眠状态，好在休眠舱的能源也变成了无限的，我将苏醒时间设为2000年后，然后带着剩下的船员维持着船上的运作。
//
//后来，有两个自称流浪者的人闯入了飞船，他们告诉我们，我们所有人都进入了一个叫做后室的空间，这个空间独立于前厅，也就是现实世界。我了解到我们的飞船和这个宇宙已经成为了后室的一部分，也就是层级。同时又知道了这个空间还存在着更多不同的层级。可是我在飞船上待了很长时间，从没见到过什么出口。那些人邀请我们合作，我答应了。我们成立了L.E.B.，即后室光轮探索者组织。
//
//几天前，我们发现了一个与Level C-386双向连接的出口。于是我留下了这封信。希望这封信对你们有一定帮助。
//
//我要走了，离开这里，而这艘飞船将继续行驶，直至，飞向群星的尽头。也行有一天，我还会回到这里，但一切肯定早已变了。
//
//我们飞向群星的尽头，我们就是群星的尽头……
//
//基地、前哨与社区
//L.E.B.总部（Light wheel explorer in the backrooms，后室光轮探索者）
//这个组织由一群从前厅卡入后室的宇航员组成，整艘飞船就是他们的总部，目前成员有100余人，还在缓慢扩大中。他们对M.E.G.的成员和流浪者十分友好，对他们提供帮助。
//M.E.G.前哨站
//M.E.G.在L.E.B.的同意下建立的前哨站，固定成员有10人，主要工作是研究Level C-264的一些特性。
//入口与出口
//入口
//目前已知的入口不多，主要有三个，从Level C-386穿墙有一定的可能性到达这里，不过更好的方法是从Level 15切入，还有一种方法是从Level 8的水池进入，不过不建议使用。
//出口
//由于该层级不稳定的特性，目前没有固定出口，但不时会出现一些通向其他层级的虫洞。
//作者信息
//« Level C-263 | Level C-264 | Level C-265 »
//
//Footnotes
//1. 即-273度
//2. M.E.G.在控制室的信息库中发现的一份加密文件，已解密。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1264{}