//Level C-296
//评分: 
//+23
//+
//–
//X
// 
//
//生存难度：
//等级 5
//
// 
// 
// 
//Level C-296是后室C层群的第296层。
//
//描述
//Level C-296是一个无限循环的地下防空洞，并有部分通道尚未完工。该层级起初由一名无名流浪者于2021年2月27日所发现，但却在2021年3月6日才得到了完全探索。据M.E.G.考察，该防空洞名为“曙光”最早建造于一战时期，并经过了多次的改造。防空洞内气温保持在-2至39摄氏度之间。防空洞内部空间时大时小，据准确测量后，通道最宽为6米，最窄仅有50厘米。通道内唯一的光源来源为其顶上的探照灯，并会发出频率不明的嗡鸣声。这些通道可能会以任何角度弯折，弯曲，甚至垂直向上或向下，使得探索其内部变得极为困难。防空洞内部的地面异常泥泞，遍布废弃的防毒面具和各种食品包装袋；通道内的墙壁大多由可以水泥墙所组成，且会时不时溢出杏仁水，但据M.E.G.调查该杏仁水重金属超标且含有一定剂量的核辐射，建议流浪者不要饮用，空气中也有一种铁锈与腐尸混杂的味道。当流浪者在防空洞内部探索时，可以听到防空洞外炮火轰鸣的声音，当这种声音出现时，防空洞会突然震动，某些通道会轰然坍塌。有流浪者报告称在通道坍塌后听到了多种野兽咆哮的声音，但具体原因未知。
//
//photo-1623411902459-d1f809a0908d?ixlib=rb-1.2.1&dl=ricardo-gomez-angel-bt-ZiOql8Hc-unsplash.jpg&q=80&fmt=jpg&crop=entropy&cs=tinysrgb
//一些正在施工的通道。
//
//流浪者在探索该层级时会时常发现一些宽广的通道，这些通道内都搭建了脚手架等施工用具，其内部的灯光也在不断的闪烁，有报告曾说在此通道内探索时听到了通道深处传来猛兽的咆哮声，但真实情况尚未得知，目前通道内最远的探索记录为深入了10公里。据流浪者所说，越往深处走，其内部的灯光将会愈来愈昏暗，并最终完全熄灭，空气中也会逐渐散发出一种类似硫磺酸的刺鼻气味，流浪者会感受到有不明的物体从身边擦肩而过。路上也会出现许多的障碍，这些障碍以一种不明的形态摆放，以此来阻挡流浪者前进。目前尚未有人探索到通道内10公里外的区域。
//
//2022/6/19/更新
//据报道，有流浪者突破了通道中的障碍，并继续深入通道内部大约20公里的距离，视频画面显示，通道内横七竖八堆满了残缺的尸体，并有大量的钝人盘踞在内。当这支流浪者小队深入了30公里的距离并继续准备前行时，视频画面突然消失，只能听到其传来了多名流浪者的尖叫声，目前这只探索小队已失联，我们还未能清楚他们遭遇了什么。
//
//在防空洞的某些通道中弥漫着灰色浓雾，流浪者靠近时将会出现两种状况，一是感觉呼吸困难并在逐渐窒息而至死亡，二是感觉轻微头晕与重度腹痛，同时皮肤会有强烈的灼烧感，所以建议流浪者遇见浓雾应该选择绕道而行。此类浓雾已被证实为该层内的特殊实体。
//
//本层级中全面覆盖了Wi-Fi，Wi-Fi名全由P3Ac3Ful组成，只有极小的几率会出现名字为WorldWarIII的Wi-Fi，连接上后你将会被传送到Level C-498。
//
//令人费解的是，每当流浪者接近类似出口的地方时，四周的地面墙壁会立即以一种扭曲的形态延伸出去。并会在一定时间后变得稳定正常，此时流浪者才可以继续前进。在扭曲期间时最好不要接近被扭曲的区域，以免受到不明的伤害。
//
//房间
//防空洞内共有六种不同类型的房间，它们分别是武器室，餐厅，储藏间，医务室，娱乐室与休息室，除此之外，该层内同样也有一些没有名字且上锁的房间，这些房间的门无法被破坏，任何物理攻击都会导致流浪者被吸入且传送至未知的楼层。
//
//武器室：
//
//武器室内没有任何的光照来源。并会在其中随机刷新少量的枪支，弹药与军用短刀，但每当流浪者想要拿起枪支时，将会有一种不明的眩晕感。直至真正拿起时，流浪者的手会有一种莫名的强酸侵蚀感，与上文提到的灼烧感不同的是，这会立马使你的手被腐蚀以至其完全断裂。不过当你触碰弹药，军用短刀时则不会有任何影响。目前尚不清楚为何触碰枪支将会导致流浪者受到伤害。
//
//除此之外，武器室时常游荡着大量的钝人，它们展现出了惊人的再生能力与攻击能力，一般情况下它们不会轻易攻击流浪者。建议流浪者在非必要下不要试图激怒它们。
//
//储藏间：
//
//储藏间中储藏了大量的物资，包括但不限于杏仁水，手电筒，电池，压缩饼干，能量棒，过期的罐头等，但是长期呆在该房间会受到不同程度的精神影响，轻则出现人格分裂，幻听，重则出现幻觉，并在最终七窍出血而亡。值得注意的是，该症状只可通过杏仁减轻，不可消除，且这种风格症状会伴随流浪者就进入的次数而叠加。除非是在物资非常缺乏的情况下，擅自进入储藏间并不是一个明智的选择。
//
//餐厅：
//
//整个餐厅占地约为100平方米，其中后厨的门已被锁上，不可被强行进入。餐厅整体呈圆拱形，其内部灯光昏暗，十分的压抑。墙壁周围贴满了长度不一的管道，这些管道多由铁制成，并时刻在运作中，管道上面锈迹斑斑，并不断散发着高温，触碰它会导致流浪者的受到严重的灼伤。餐厅内杂乱的摆放着许多长条桌椅。流浪者可以在餐桌旁见到部分正在进食的无面灵，即使这些无面灵都受到了Level 11效应的影响。建议流浪者不要尝试掠夺他们的食物，无论它们看起来有多么可口。食用它们将会导致严重的腹泻。
//
//该区域内可以找到的物资有杏仁水与能量棒，但是极为的缺乏。
//
//休息室：
//
//宿舍该层级内较为安全的地方，内部空间大小无法被探测，似乎是无限的。墙壁不断的在往外渗水。宿舍里面摆放着数量未知的破旧三层床，这些床可供流浪者进行休息。有时个别的无面灵会在上面休息，请流浪者多加注意，遵从上文的提议，非必要的情况下就不要打扰他们。有时休息室内部会传出来源未知的女人与婴儿的哭声，有个别的无面灵会捂着双脸坐在床铺旁边，不建议流浪者接近它们。有个别的床上摆放着正在运作的老收音机，其播报的内容大多为战事时讯，这些时讯的内容大多为一战，二战等大型战争的战况，偶尔参杂着一些前厅里的时讯。目前尚未清楚收音机为何会播报这些内容。
//
//流浪者可以在柜子中找到手电筒，安眠药等物品也会有很小的几率找到残缺的纸与墨水将尽的笔。
//
//医务室
//
//医务室是该层级中最为危险的地方，面积为19平方米，内部有着很强的核辐射，但同时也充满了各种医疗药品，为了流浪者的安全起见，该区域大部分时间都是锁上的，并有安保人员在此站岗。
//
//娱乐室
//
//photo-1572961660679-17c95ea97d3a?ixlib=rb-1.2.1&dl=hmsse-khan-rq18UXGXMyo-unsplash.jpg&q=80&fmt=jpg&crop=entropy&cs=tinysrgb
//唯一一张有关娱乐室的照片。
//
//娱乐室是该层内一个占地面积约为34平方米的区域，里面有着较为奢华的装饰，并有着酒水吧台，台球桌等娱乐设施，本层内的沙发已被证实为是经过伪装过的柔软沙发。该区域内的唯一光源来自于多盏天花板上的吊灯。同时，一些幼年无面灵被发现于该区域内，她们大多数时间里都是无害的，有时会主动要求与流浪者进行一些小游戏，这些有游戏包括但不限于石头剪刀布，躲猫猫等，尽管如此，想要战胜她们是一件较为困难的事，在赢了她们后流浪者可以得到手电筒，杏仁水等物资，但如果流浪者被发现作弊了的话，幼年无面灵会直接挖瞎流浪者的双眼。并在此后做出一些怪异的举动，如身体突然的扭曲，唱起怪异的童谣，用头砸墙等
//
//实体
//普通实体
//包括但不限于笑魇、钝人、悲尸、猎犬、无面灵、死亡飞蛾等具有极高攻击力的实体，流浪者会时不时在走廊中碰到它们。
//
//本层特有实体
//CookMaster
//一个自称CookMaster的厨师，本名为James Adam。其外貌表现为中年男性，他的工作就是在后厨为无面灵与流浪者提供食物，你可以直接向他点菜，也可以与他交易，但他只对杏仁水感兴趣，可交易得口香糖，电池，军用短刀等实用物资，同时他也会保护你免受于除无面灵之外其他实体的攻击，但只限于餐厅内。
//
//安保人员
//安保人员身穿黑墨色制服，他们可以保护你在走廊上免受除笑魇外的实体攻击，当你出现在走廊上呆太久时他们会询问你是否要把你送回休息室。但是不常出现，且出现时长不过30分钟，到时后便会如灰烬般消失。
//
//Fog
//如上文所述，其会在防空洞的某些通道中出现，具体形状为黑灰色迷雾，可致人死亡。
//
//PTSD
//原为一种精神创伤，但在该层内幻化为了一种无形的实体。其主要表现为使流浪者的思维、记忆或梦中反复、不自主地涌现与战争有关的情境或内容，该影响会使流浪者在精神崩溃后不受控制的舔舐墙上的杏仁水或直接走进迷雾中。
//
//事件
//“崩坏”
//当流浪者行走在过道上时，有可能会遇到“崩坏”事件，崩坏的特征为无征兆的地面塌陷，墙壁挤压，突然遭受不明实体袭击等，此时流浪者将面临两个抉择，一个是进入到最近的房间躲避崩坏，二是切入正在崩坏中的地面，但只有极少数的流浪者在选择切入地面后生还了。除此之外当流浪者在走廊上停留太久时，其本身的听觉会变得异常灵敏，会听到更为强烈的炮火声与各种呻吟声，同时伴随的还有幻觉等，这种状况可以通过咀嚼从CookMaster那里得到的口香糖来减轻。
//
//“集合”
//有时防空洞内会发出刺耳的警报声，在警报声过后将会有大批的无面灵从各个房间内涌出，并来到餐厅内部集合。由于部分过道过于狭窄，会经常使得流浪者遭受从四面八方而涌来的无面灵踩踏而死。大部分的无面灵会在“集合”后瞬间消失，只有少部分的无面灵会重回它们所在的房间。
//
//“敌袭”
//“敌袭”事件表现为有不明的武装分子突然攻入防空洞内部，并不断的搜索并掠夺每个房间的物资，他们装备精良，但没有统一的着装，相反，他们看来像是来自不同时代的人。不仅如此，他们会无差别攻击任何看到的流浪者，无面灵与其他的实体，并且不会受到“崩坏”事件的影响。他们会在出现30分钟过后消失，据流浪者声称，他们好像凭空消失的一般，直接消失在了流浪者的眼前，并好像什么事都毫无发生般。“敌袭”事件通常发生在深夜，值得庆幸的是，他们不会进入宿舍里掠夺。
//
//基地、前哨与社区
//M.E.G.“曙光”救助基地
//M.E.G.派遣的救助团队，扎根于某休息室中，人数为12人，主要救助那些受到精神影响的人，并不断尝试找出更多离开此层级的方法。
//
//GodSlayer
//一个由生存专家组成的小队，小队成员性格偏激，数量未知，初步判定为10个，极度排外，拥有武器，且知道自由进出本层级的方法，与M.E.G.地穴救助者基地极度仇恨，猎杀每一个M.E.G.成员，可以与他们进行交易。
//
//战争被迫害者
//据传闻，这些人是本来就居住在这的流浪者，人数约为35人，他们会积极救助那些意外进到本层级的流浪者，拥有许多物资，愿意分享，与M.E.G.地穴救助者基地一同对抗GodSlayer。
//
//Mark的信仰者
//传说该组织为由一个名为Mark的人所建立，他拥有数量庞大的物资，并且成功的打开了一间被锁上的门，听说他还可以治愈那些受PTSD影响的人，人数约为6人。
//
//入口与出口
//入口
//在Level 11中触摸一辆名为P3ac3的坦克会立马传送到这里。
//在Level 14中触摸一个沾满血迹的石头会在短时间内传送到这里。
//在Level C-74中切入地面，同样可以来到这里。
//在Level C-144 中找到一个名为“曙光”的地堡，进入它，你会传送到这里。
//在Level C-157中被几名鬼警围攻，就会有一定的几率来到这里。
//可以通过Level C-256来到该层级，但具体方法未知。
//出口
//只有极小几率会出现名字为WorldWarIII的Wi-Fi，连接上后你将会被传送到Level C- 498。
//走进浓雾，有极小的概率进入Level 75。
//在餐厅点一份沾满糖霜的蛋糕，你会进入一场派对=)。
//流浪者只有很小的几率在切入崩坏中的地面时来到Level 1，注意，此时流浪者身上不能携带任何的物资，否则会导致切入失败。
//陷入扭曲中，你有极小的几率会来到Level 356。
//如果你侥幸在崩坏中存活了下来，你会有几率来到Level 69。
//切入过道中的墙壁，你会来到Level 71。
//在与幼年无面灵的游戏中作弊，会有一定的几率来到Level 501。
//强行打扰休息室中的无面灵，你将会在遭受攻击后来到到Level C-163。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1296{}