//Level C-207
//评分: 
//+18
//+
//–
//X
// 
//
//生存难度：
//等级 3
//
//不安全
//不稳定
//中量实体
//Level C-207是后室C层群的第207层。
//
//描述：
//Level C-207 的结构类似于一座设备完善的游泳池，拥有两大分区游泳区和休息区。休息区通常在游泳区的右侧出现，拥有三层和16间可以进入的房间，在每层的右侧都会有一条从外表看起来为无尽头的走廊，走廊内均匀分布假休息室。
//
//休息区：
//在休息区内的16间房屋均可以安全进入，并很大概率出现对流浪者有帮助的常见物资。在休息间内睡一觉是个不错的选择，因为未知原因，几乎所有流浪者都表示在此房间内休息比在其他地方更加惬意舒适。但要注意，每进入一次休息间都会导致假休息室内出现实体的概率增大。所以请不要过于贪婪，这无助于你在走廊区域的继续探索。
//
//wildwood-392754_960_720.jpg
//一张“休息区”的照片。
//
//假休息室：
//假休息室为走廊区域内的所有外表和休息区外观一样的房屋。一旦你进入走廊区域，那么你会立刻拥有坚定不移继续探索长廊区域的心理。当你打开一间假休息室时，迎面扑来的有可能是实体，也有可能是一份惊喜大礼：比休息室内更加丰富的物资。但要注意，这种概率远远低于你撞上实体的概率。
//
//在你开门遇到实体之后，你打算继续探索长廊区域的信心会立刻消失，并想要立即离开此区域。在此区域探索遇到实体和奖品的概率被证实为探索进度越深，实体越强大，奖品也越丰富和高级。已被证实到的休息区和假休息室内的物资包括：杏仁水、皇家口粮、火盐、滋水枪、瓶装闪电。有人称他在第2973个假休息室内发现了禁止访问，其真实性有待考证。
//
//游泳区：
//游泳区的外表看起来和正常泳池别无二处，为深蓝或浅蓝色的水池，深度每天会随机变化，但都在2m以内。在任何情况下进入游泳区都是不明智的选择，因为其内部大多数时间都含有大量的邻里守望。在游泳区的底部有几率找到一个过滤板，打开它会让游泳区内的实体消失三分之一。出于不明原因，在游泳区内浸泡或者游泳会让你感到饱腹感，经过证实其确实可以补充少量各类营养。在游泳区内停留超过30分钟会让你逐渐感觉疲惫，尽管你没有做任何事。
//
//swimming-pool-504780_960_720.jpg
//由一名正在探索“游泳区”的摄影师拍摄。
//
//基地、社区和前哨站
//本层级尚未有任何已知的基地、社区和前哨站。
//
//入口与出口
//入口：
//在Level 7的海洋部分中溺亡会来到此层级。
//在Level C-10的湖内躲避实体追击时有较低的概率来到此层级。
//出口：
//在”游泳区“内尝试从过滤板中切出会来到Level 43。
//被200间之后的”假休息室“内的实体击杀有3%的概率来到Level C-43。
//在”休息区“内尝试切出有中等概率到达Level 0。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1207{}