//Level C-287
//评分: 
//+12
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
//时间及空间稳定
//仅存在特定实体（友善且智慧）
//特殊精神影响
//Level C-287是后室C层群的第287层。
//
//描述
//Level C-287是一片广阔的雪原。雪原十分平坦，无任何植被覆盖，雪原上覆盖的雪厚度约为12厘米，成分与正常的雪完全相同。层级内气温恒定在-5℃。该层级具有昼夜循环，恒定表现为一天24小时，白昼10小时，黑夜14小时。
//
//层级内的雪原上只存在一个建筑，是一块巨大的单体岩石，位于该层级的中心点，也就是来到该层级的流浪者的起点起东北方向约200米处。单体岩石内一部分已经被凿空，凿空部分已经被精细地装修而且布置了完备的可正常使用的家具，这里被称为“灰狼森的家”，层级内唯二实体生活的地方。相关实体信息在下文实体部分中将详细提及。
//
//来到该层级的流浪者都会受到一种精神影响，效果包括但不限于使流浪者产生安全感，温馨感，使流浪者的行为举止变得得体。目前还没有对于该精神影响的系统研究，因此并不确定该精神影响的具体特性。
//
//实体
//该层级只存在两个实体，两个实体均定居在层级内中心点的单体岩石内的建筑中。
//两个实体分别被称为“灰狼森”和“小柯赛特”。（两个实体的名字来自两个实体对对方的称呼）
//
//“灰狼森”
//该实体是一个身着巴斯尔时期男士市井服的灰色毛发的狼人。该实体身高约为1.76米，体重未知，通过对该实体样貌的观察，以人类的年龄尺度估计年龄在四十岁左右。（但该实体曾透露自己的真实年龄实际上很小）
//
//该实体性情温和，举止得体，谈吐文雅。其绝大多数时间都在单体岩石内的建筑中活动，打理着日常事物以及陪伴“小珂赛特”。
//
//如果有流浪者前来拜访，该实体会负责接待流浪者，目前已经有至少数十位流浪者前来拜访，而且每一位流浪者都对拜访经历给予极高的评价。
//
//在少数情况下该实体会出门离开单体岩石内的建筑，根据该实体的说法是要去买一些东西。曾经有数位流浪者请求与该实体一同去买东西，但都被该实体拒绝，目前也没有任何关于该实体在其他层级出现的记录。不过有在该实体刚好回到单体岩石内建筑时来拜访的流浪者注意到该实体确实手持着装满食物和少许未知钱币的篮子。在极少数情况下，“小珂赛特”会和“灰狼森”一同出门。
//
//“小珂赛特”
//该实体是一个身着类似英伦风格纯黑色童装的小女孩。该实体身高约为1.24米，体重未知，通过对该实体样貌的观察，以人类的年龄尺度估计年龄在七到九岁左右。
//该实体的行为举止都与同年龄段的人类无异，其绝大多数时间都在单体岩石内的建筑中活动，受“灰狼森”照顾，在极少数情况下，“小珂赛特”会和“灰狼森”一同出门。
//
//该实体非常喜爱与动物玩耍，如果前来拜访的流浪者有动物随同，该实体会表现出极大的喜悦。
//
//下面是 附属文件1
//
//收起
//所需食材:
//带骨牛肉一千克
//甜菜二百五十克
//莲花白一百八十克
//红芸豆一百克
//洋葱一个
//土豆一个
//胡萝卜一个
//西红柿一个
//红甜椒半个
//西红柿酱一大勺
//白糖一勺
//植物油六十毫升
//罗汉叶三片
//风干的维罗尼卡婆婆蓝花朵三朵
//蒜适量（原配方共用三瓣蒜）
//盐适量（原配方共用六小勺盐）
//
////烹饪步骤:
//一千克带骨牛肉放入盛有冷水的炖锅中炖煮
//水开后除去肉沫，放入一百克红芸豆
//盖上锅盖，中火或中小火熬一到一个半小时
//
//这期间准备其他食材
//一百八十克莲花白切成细丝
//二百五十克甜菜削成细丝
//一个洋葱切成小丁
//一个土豆切成小块（比小丁大一点点）
//一个胡萝卜削成细丝
//半个红甜椒切成细条（比细丝粗一些）
//一个西红柿切碎加入一大勺番茄酱混合
//三瓣蒜切成小块碎末
//
//汤熬好后盛出带骨牛肉，加入三片罗汉叶与风干的三朵维罗尼卡婆婆蓝花朵
//放入切好的莲花白与土豆
//盖上锅盖，中火熬十五到二十分钟
//
//这期间再准备其他食材
//煎锅烧热，加入六十毫升植物油
//先放入切好的洋葱，翻炒三到五分钟
//待洋葱变软后再放入削好的胡萝卜，翻炒三到五分钟
//再放入切好而且混合番茄酱的西红柿
//再放入切好的红甜椒
//再加入切好的蒜
//再加入两小勺盐轻轻翻炒
//再放入削好的甜菜
//最后加入白糖，翻炒两到三分钟
//
//汤再次熬好后盛出少量肉汤
//煎锅中加入少量肉汤翻炒一到两分钟
//煎锅中炒好的食材全部放入汤中
//盛出的带骨牛肉去骨切成小块放入汤中
//加入两到四小勺盐，盖上锅盖，中火熬十分钟//
//
//注意:
//烹饪过程中每次炖锅中的汤熬好后加入食材的期间不要完全关火，小火让汤保持轻微沸腾。
//烹饪用的炖锅不要太大。
//使用刀具时一定要小心！！！
//
//当你们尝到这个汤的时候，就会明白我们为什么要拼尽全力申请上传这份文件了。——众流浪者留
//
//收起
//注意:该文件被上传时没有标注文件中文章的作者，目前并不确定是疏忽导致还是有意为之。
//
//……
//跟随着灰狼先生，我进入了这块巨大岩石的内部。
//在客厅与灰狼短暂寒暄后，我仔细地将整个建筑参观了一遍。事实上，这里没有想象中的那么宽敞，但整个结构却是相当复杂精巧。
//总的来说整个建筑一共分为五层。一层是一条长廊，长廊的尽头是一条楼梯分别连接着地下一层与二层，地下一层是一间储物室，二层是客厅与厨房。二三四层是由一条连贯的内嵌于岩石中的螺旋楼梯互相连接的，三层有三个房间，分别是灰狼与珂赛特的卧室以及一个书房，四层则是一个小阁楼。整个建筑里的物件摆设都被打理的很好，非常整洁而耐用。
//……
//如果说这一切都是灰狼所做的工作，我想或许可以邀请他去bfpf或者其他什么组织去当后勤干部了。
//……
//
//……
//整个建筑中书房与阁楼给我留下了极深刻的影响，因此特地在此介绍一下。
//书房被布置在一个倒置的半球体房间中，整个房间内部面积不算大，目测也就是十立方米多一些。房间的顶部中心安装了一个恒常开启的暖光灯，事实上，整个建筑中都安装了一定数量的电灯，而且都是欧洲二次工业革命时期制造出来的规格，不过在整个建筑中我实在是没有找到任何电线电闸这类的设备，我想应该是后室本身导致的这种反常理情况。暖光灯的四周都安装了延伸到空间地面的书柜，书柜似乎是半内嵌在墙壁上的，书柜上摆放着大量书籍以及少量的装饰品与铜烛台。关于书房唯一的遗憾就是书房里的书籍我都无法阅读，因为所有的书籍都由一种未知的文字写成。我想下次拜访时应该带几本书来，在这里阅读绝对是一种享受。
//阁楼则是被布置在一个不规则形体的房间中，不过与其说是房间，不如说是这块巨大岩石中自然产生的密闭空穴。房间的地板与墙壁分别用淡金色的羊绒地毯与浅黄色壁纸装饰。房间顶部有一个巨大的天窗，在天窗下的地板上架起了一块苗圃，苗圃上种植着维罗尼卡婆婆蓝。苗圃旁还摆放着一个摇椅和几个橱柜，橱柜上有几本和书房里一样的书和一些容器，其中一个容器里盛放着风干的维罗尼卡婆婆蓝，其他容器里盛放着纯净水以及一些未知的溶液。不得不说灰狼真是一个懂得生活情调的实体。
//在后室有这样一处栖息之所真是一件让人羡慕的事情啊。如果这里有额外的卧室，哪怕是有偿我也希望在这里住上一段时间。
//……
//
//……
//我想在这里感谢一下珂赛特，在参观的全程中她成为了我最细心热情的向导，她为我介绍了整个建筑中一些物件的来历与故事，我想日后有时间可以多写一些文章来介绍一下。只是可惜我没有养什么宠物，不然小珂赛特应该会和它们玩得很开心。
//说实话，我实在不明白为什么灰狼要给这个孩子穿这么一身肃穆的黑衣，这实在是和这个孩子的性格不搭。
//……
//
//收起
//发件人：S.CInformationSite@backmail.com
//收件人：C287.S.CInformation@backmail.com
//主题：通知
//层级Level C-287的文档的详细信息补充工作上面经过讨论决定正式停止，给出的原因是之前流浪者联名申请上传的两份文件中的其中一份已经补充了大量层级详细信息，无需额外再做补充。
//另外建议将这份邮件公示在该层级的文档中，避免其他终端信息管理员做不必要的工作。
//2021.7
//——S.C终端信息处理员6号
//
//收起
//发件人：C287.S.CInformation@backmail.com
//收件人：S.CInformationSite@backmail.com
//主题：报告
//在最近我们收到了数个流浪者对层级Level C-287中新出现的实体的报告，对此我们迅速地进行了调查。在确定这些报告的准确性后我们组织数名特工尝试与新发现实体接触并进行调查。
//目前已经有一位特工成功与其接触并获取了两份被认为有实际价值的语音记录。
//包括调查语音记录在内的相关实体信息将在稍后上传，请注意查收。
//2022.2
//——“覆霜”层级营地S.C管理员
//
//新发现实体信息
//
//该实体是一个身着██旧式宪兵制服的中年男子。该实体身高约为1.83米，体重未知，通过对该实体样貌的观察，以人类的年龄尺度估计年龄在五十岁左右。
//该实体性情温和，在大多数情况下可与该实体进行交谈，不过在问及该实体身世时该实体时常表现得孤僻易怒，因此不建议流浪者及特工在非必要情况下讨论该话题。
//
//交涉调查语音记录02
//交涉调查语音记录03
//＜记录开始＞
//
//S.C特工:感谢您对我们调查的配合，奥列格先生。
//
//“奥列格”:嗯，有什么问题吗？
//
//S.C特工:请问是否能透露一下您的身份，或者说自己的事情？
//
//“奥列格”:啊，我是一名退役宪兵，之前一直在北国服役了十来年。
//
//S.C特工:北国？您指的是██吗？
//
//“奥列格”:是的，一个遥远的北方国度，远在世界尽头。
//
//S.C特工:那您为什么来到这里？
//
//“奥列格”:我来这里的目的和你们大部分人一样，拜访森，也就是你们口中的灰狼先生，“灰狼森”。
//
//S.C特工:还有最后一个问题，就是您和“灰狼森”怎么认识的？
//
//“奥列格”:说来话长，总而言之就是他之前被冤枉了，我可怜他就帮了他一些事情，也算是认识了他。
//
//S.C特工:您真善良。
//
//“奥列格”:谢谢…呃，差不多。当然，这不是单纯的（实体的语气突然激动）良心发现，这到底是因为我弟弟的事情。
//
//S.C特工:好的好的，我明白，请您冷静一点，如果您不愿提起一些事情您可以不开口。
//
//“奥列格”:啊，抱歉，非常抱歉，请让我（实体的语气恢复）休息一下，抱歉，我刚刚太激动了。
//
//S.C特工:好，谢谢您了。
//
//＜记录结束＞
//
//基地、前哨与社区
//“灰狼森的家”实体之家
//上文已详细提及，不再此赘述
//
//S.C（苦难邦联）-荒诞的花“覆霜”层级营地
//位于该层级中心点起正东方向约3千米处
//由数十名苦难邦联成员组成
//团体对外尽可能保持隐蔽
//该营地建立的原因是层级内十分安全
//入口与出口
//入口
//尝试切入任意一片覆盖了雪的土地有概率进入该层级
//出口
//在该层级的雪地上切出，流浪者即可到达Level C-93
//作者信息
//脚注
//1. 前两份文件由拜访过层级内实体的流浪者数次联名申请后被批准上传，前两份文件内容由流浪者编辑，第一份文件无任何修改，第二份文件有部分修改，第四份文件有部分修改
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1287{}