//Level C-227
//评分: 
//+9
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
// 
//实体已镇压
//Level C-227是后室C层群的第227层。2014年，通往该层级的按钮在某台电梯中被首次发现。鉴于该层级的潜在便利性。M.E.G.已派遣调查队对此层进行了详细调查。
//
//在2015年的事件后，M.E.G.对层级关键部分进行了封锁。
//
//描述
//Level C-227是一艘巨型邮轮的内部楼层，由两个部分：客房走廊和电梯间构成。其内部的陈列与装饰与前室中的邮轮并无区别。
//
//types-of-elevators.jpg?resize=1080%2C675&ssl=1
//电梯间照片，于一次标准勘探任务中拍摄
//
//根据走廊与电梯间墙上所悬挂的邮轮剖面图，该邮轮拥有一高度为16层的上层甲板和层数未知的下层空间。
//
//此图亦显示了该邮轮所拥有的数个设施，如：“中心广场”、“接待大堂”与“顶层酒廊”1。
//
//该层级的异常之处体现为，走廊内部本应通向不同区域的，传统意义上的“门”，在此层级内全部被各类电梯所取代。
//
//走廊与电梯间
//根据调查，电梯间内的电梯并非实体。其内部的可达楼层数随每次进入皆有不同2。超过16层的按钮将把流浪者送往一个与1-16层完全相似的楼层；其长度被认为是无限的，且与下层一样，每扇门都被实体的电梯所替代3。
//
//位于前16层的走廊与16层以上的走廊存在一根本差异：1-16层走廊的墙壁上会随机出现上书“中心广场”字样的方向指示牌。通过指示牌后继续步行10分钟，流浪者将抵达此层级的“中心广场”。
//
//中心广场
//中心广场是一个面积超过15平方公里的巨型广场，每次进入将在内部随机生成多个设施，目前已被记录的设施如下：
//
//- 隐藏设施记录
//设施名称	描述
//有着“头等舱接待区”字样的小房间	内部除了红木构成的桌子外，空无一物。桌子内部未发现任何文件
//一个巨大的水上乐园滑梯的上半部分	可以通过楼梯抵达其入口。该滑梯的下半部分在甲板下方的未知位置。尝试进入的人员全部宣告失踪
//一个自助餐厅	根据调查人员的报告，其内部的食物可食用、无毒，且“相当美味，这是我在后室吃到的仅次于皇家口粮的东西”
//一间双人客房	内部的装饰与走廊类似
//一间豪华套房	内部装饰精美
//一个国际标准长度的泳池	内部水体成分被证明与level 7一致
//一个纪念品商店	货架上的商品均为由未知语言写作的书籍。根据书中配图，调查人员大致确定这些书籍的内容包括食谱、后室武器制作指南和部分层级的描述，尽管这些层级此前从未被发现
//一个游戏机厅	提供大量前室里不同时代的街机框体。调查人员报告发现了“外表类似洗衣机的街机，至少我进后室前没见过”。游玩其中的游戏不会触发异常效应
//一个小超市	内部的冰柜可以无限获取杏仁水
//一个有落地窗的酒吧	窗户均为实体
//需要管理员权限	登陆以解锁所有文档
//事件
//2015年，出于未知原因，中心广场在进入时不再存在上述设施。取而代之的则是大量进入应激状态、穿着船员制服的无面灵——他们会不断追逐并试图杀死任何见到的流浪者，哪怕受害者逃离“中心广场”并进入内部走廊后也是如此。
//
//同时，根据先前部署于“中心广场”入口附近的监控显示，流浪者进入此层级也会导致大量已经应激的无面灵从“中心广场”处涌入内部走廊并展开攻击。
//
//鉴于对通过此层级进行换乘的流浪者造成的危险性，M.E.G.已经派出中队“电梯间清扫员”对1-16层的“中心广场”入口进行了封锁，并配置了由杏仁水喷管构成的“消杀区”和重型杏仁水喷射器构成的“二次清洗区”以应对实体威胁。目前，该措施被证明有效的解决了实体入侵。
//
//考虑到电梯作为后室之中少数可以快速穿越层级的工具，虽说具有其独特的不确定性，但在这一层级中却被近乎无限多的选择所对冲。因此，在解决了实体威胁后，M.E.G.仍然选择将此层作为安全的换乘层级（电梯目的地）在流浪者之中宣传。
//
//基地、前哨与社区
//M.E.G. “电梯间清扫员”中队
//驻扎在1-16层的“中心广场”入口封锁线附近。
//装备有重型杏仁水喷枪和使用杏仁水喷管制造的“消杀区”（killzone）以镇压恶意实体。
//入口与出口
//入口
//某些电梯里能发现通往该层级的按钮。
//通过Level 11的一个邮轮公司大楼切入有概率到达该层级。
//通过Level 36的邮轮旅游广告切出能抵达该层级。
//出口
//通过电梯离开此层级。
//从16楼以上的天花板切出，有概率抵达Level 0。
//从中心广场的边缘跳下有极小几率抵达Level 7，却有极大几率抵达Level 69。故极度不建议这么做。
//在中心广场的“客房”里睡着将抵达Level 5。
//欢迎您，M.E.G.管理员
//
//- 凭证已确认，显示机密内容
// 
//
//生存难度：
// 
// 
// 
//Level C-227是后室C层群的第227层。2014年，通往该层级的按钮在某台电梯中被首次发现。鉴于该层级的潜在便利性，M.E.G.已派遣调查队对此层进行了详细调查。
//
//描述
//Level C-227是一艘巨型邮轮的内部楼层，由两个部分：客房走廊和电梯间构成。其内部的陈列与装饰与前室中的邮轮并无区别。
//
//types-of-elevators.jpg?resize=1080%2C675&ssl=1
//电梯间照片，于一次标准勘探任务中拍摄
//
//根据走廊与电梯间墙上所悬挂的邮轮剖面图，该邮轮拥有一高度为16层的上层甲板和层数未知的下层空间。
//
//此图亦显示了该邮轮所拥有的数个设施，如：“中心广场”、“接待大堂”与“顶层酒廊”。
//
//该层级的异常之处体现为，走廊内部本应通向不同区域的，传统意义上的“门”，在此层级内全部被电梯所取代。
//
//走廊与电梯间
//与公开文档一致，不再赘述。
//
//中心广场
//中心广场是一个面积超过15平方公里的巨型广场，每次进入将在内部随机生成多个设施，但以下设施在每次探索中皆被发现：
//
//设施名称	描述
//一个位于广场正中心，直通上层虚空的混凝土立柱	底部发现一台梯门由黄铜制成的电梯，上有大量类似装置艺术风格的复杂雕花。在被发现时，电梯的呼叫按钮被点亮，梯门保持关闭
//2015年，调查人员注意到电梯门被打开。随后的测量显示该电梯有一4m*4m*3m的轿厢和长度未知的电梯井。轿厢内异常之处表现为两点：
//
//此电梯拥有后室绝大多数电梯不存在的“紧急呼叫”按钮。按下该按钮使得调查人员连接到了一个自称“公寓管理员”的个体。但听到调查人员的自我介绍后，通话在对方惊恐的“闹鬼了”的惨叫中被切断。随后的呼叫均告失败。
//电梯内部只有两个楼层可供选择：楼层“1”的按钮旁边的标注为“Level C-227”，另一楼层为“2,838,240,000”，旁边的标注为“Path to the Frontroom”。
//这一目的地已引起研究人员的极大兴趣。对此地的探测计划已被提上日程。
//
//载人探测计划
//考虑到前室最快的电梯速度为18米/秒，理性判断，到达电梯终点需要至少15年，一次往返则至少需要30年。考虑到电梯的狭小空间无法支持乘员至少15年的维生需求，对该目的地的载人探测计划已被放弃。
//
//无人探测计划
//使用无人探测车进行探测的可能性已被探讨，但最大的问题来自于：目前后室工业能力与前室存在巨大断层，尤其在硬件工程和自动化技术方面。这使得短时间内制造一台胜任此任务的探测车的可能性变得极其渺茫。
//
//综上所述，无人探测计划要求大量远超当前工业实力的技术、伴随巨大的时间成本和面对完全未知的环境。作为结果， M.E.G.管理层在中心广场设立了保密的研究设施“深渊之桥”以进行探测车的研究与制造。对目的地的进一步探索在探测车投入使用之前无限搁置。
//
//作为临时措施，此电梯与研究设施的存在已被严格保密。同时，M.E.G.已经调动中队“电梯间清扫员”对1-16层的“中央广场”入口进行了严格封锁，以防止人员擅自进入保密区域。该措施将持续，直到此探索被认为有必要/有能力进行为止。
//
//考虑到电梯作为后室之中少数可以快速穿越层级的工具，虽说具有其独特的不确定性，但在这一层级中却被近乎无限多的选择所对冲。因此，M.E.G.在封锁关键部位之后，仍然选择将此层作为安全的换乘层级在流浪者之中宣传。
//
//基地、前哨与社区
//M.E.G. “电梯间清扫员”中队
//驻扎在1-16层的“中心广场”入口封锁线附近。
//拥有伪装成重型杏仁水喷枪和杏仁水喷管组成的“消杀间”以对流浪者展示中队的专业性。
//M.E.G.前线研究设施“深渊之桥”
//于2015年在“中心广场”内部被建设。
//用以研究和制造无人探测器所需的前置技术。
//为保证内部设施稳定，该设施长年需要保持至少25人以防止设施被人员的进出改变。
//入口与出口
//入口
//某些电梯里能发现通往该层级的按钮。
//通过Level 11的一个邮轮公司大楼切入有概率到达该层级。
//通过Level 36的邮轮旅游广告切出能抵达该层级。
//出口
//通过中心广场上的电梯前往前室（未证实）。
//通过电梯切出。
//从16楼以上的天花板切出，有概率抵达Level 0。
//从中心广场的边缘跳下有极小几率抵达Level 7，却有极大几率抵达Level 69。故极度不建议这么做。
//在中心广场的“客房”里睡着将抵达Level 5。
//作者信息
//« Level C-226 | Level C-227 | Level C-228 »
//
//脚注
//1. 除“中心广场”外，其余设施皆未被发现
//2. 已被记录的楼层数位于16到650层之间
//3. 鉴于这一异常性质，对该层级内部除了走廊和“中心广场”以外空间的探索已被认为不可行
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1227{}