//Level C-241
//评分: 
//+8
//+
//–
//X
// 
//
//生存难度：
// 
// 
// 
//Level C-241是后室C层群的第241层。
//
//照片
//Level C-241内部树林照片。
//
//描述
//Level C-241是由多个生态系统组成的整体。Level C-241内部温度永远保持在令人舒适的温度，空气湿度以及含氧量适宜，天气以晴为主，无极端天气，WIFI信号强，重力比前厅小，大气呈金色，是流浪者休闲度假的圣地。Level C-241的空气中包含一种未知物质。这种物质会使人产生轻微晕眩，头晕的症状，同时会刺激大脑皮层听觉中枢产生某处正在低声播放舒缓轻音乐的错觉，人体会在7天内适应这种物质。Level C-241内物品均颜色鲜艳，长期注视也可引起轻微眩晕、头晕的症状。人眼可在14天内适应Level C-241内部颜色，Level C-241内的颜色不符合已知的任何一种颜色1且Level C-241内部颜色不可呈现在照片上，任何在Level C-241内拍摄的照片都是黑白的。
//
//- Level C-241内主要景观
//森林
//以木本植物为主，高矮不一，长度短至4厘米，长达25米，类鸟动物多，种类丰富，体表覆羽毛，颜色纯度极高且颜色种类多，因为Level C-241内颜色的特殊性，有记录羽毛可达15种红色。
//
//雨林
//以木本植物为主，极其高大，平均长度240米，树干极粗，直径32米，树叶呈蓝色与青色混合后的颜色，空气湿度较大，动物体型庞大，有类鳞翅目昆虫翼展可达1米。
//
//海岸
//沙滩呈纯度极高的金黄色，岸边岩石呈鲜红色，海水碧蓝，海床珊瑚礁颜色鲜艳，有类鱼动物，体型小。
//
//
//
//实体
//Level C-241内实体不会无故伤人，且十分友善。Level C-241内最高等生命是一群类人生物，无性别之分，身材高大，成年身高在1.9米到2.5米不等，寿命极长，有记录最长寿命可达3亿年。该群体科技发达，但Level C-241内没有大型科技设施，大部分被植被覆盖。该种群在初次见到流浪者时，会热情地派出一名向导，指导流浪者接下来十天的生活，并送给流浪者一个头盔，带上该头盔可抵御Level C-241内的不良反应。该群体交流的方式是意念交流，该群体也可读取他人想法，但他们并不经常这样做。该群体主要的娱乐方式有：冥想，摆弄星球模型。靠近该群体会使人感到温暖，放松。
//
//住宅.jpg
//“瓦度”照片。
//
//Level C-241的建筑只有一种形式，为大小不等，离地0.5米悬浮在空中的黑色圆球。接触圆球会被吸入圆球内的高维空间，室内空间往往比圆球体积大数倍且室内空间可无限扩建。当地居民称这种建筑形式为“瓦度”。“瓦度”可识别生命体，以此来防止树叶等杂物进入室内，风可进入“瓦度”且进风量可调节以通风。“瓦度”内部温度可调节，冬暖夏凉，同时墙壁的材料特殊，隔音性极好，不易燃，不导电，不吸水。“瓦度”可以控制吸收空气中水分以作生活用水，同时生活废水会以水蒸气的方式回到大气。
//
//
//- 访谈记录
//M.E.G.访谈人员与当地居民“奥”的访谈记录
//访谈人员：您好，奥……请问您的名字是只有一个字吗？我用不用给您加什么后缀？
//
//奥：哈哈，说实话，我们都没有名字，我们不需要名字也能明白对方想说什么，意念嘛，会意就行。
//
//访谈人员：好的。那我想请问您第一个问题，您对M.E.G.在您这里建立站点有什么看法？
//
//奥：欢迎，有客人我们很开心，能帮到你们也是我们的荣幸，我们不需要你们有什么回报，只要在这里开心，舒服就好。
//
//访谈人员：您们都很喜欢冥想，这是为什么呢？
//
//奥：因为我们找不到不这么做的理由，我的意思是，有什么比冥想更好？我们不要大鱼大肉，宁静祥和是我们的精神食粮。我们不要金银首饰，大自然的美好是我们最美丽的衣服。
//
//访谈人员：这么看来，您们非常喜欢自然？
//
//奥：对啊，相比你们文明的争权夺利，勾心斗角，我们更爱自然。
//
//访谈人员：您是怎么了解我们的呢？
//
//奥：哈哈，我建议你先问我下个问题。
//
//访谈人员：您们为什么总喜欢玩星球模型呢？
//
//奥大笑起来
//
//奥：这么说吧，那根本不是星球模型，而是真正的星球，我们创造了星球上的陆地，海洋，生物，我们尽量不干预这颗星球的发展，只会在这颗星球真正面临困难时，比如饥荒，地震，海啸，我们才会出手相助，有人将我们称为“神”，为我们写下很多史诗，很多故事，这些故事再一代代的流传下去。有人崇拜我们，有人质疑我们，但我们乐此不疲，闲暇之余看看自己创造的世界，怎么能不开心呢？这也回答了你的上个问题，你们的星球说不定也是很久之前某个人创造的，而看到你，我就能看到你的命运以及你们星球的命运，只可惜，我不能说。
//
//访谈人员：为什么呢？
//
//奥：如果我说了，这可能改变你们星球的命运，这就打破了维持这么多年的平衡，况且，谁会想被剧透呢？对吧？
//
//二人相视一笑
//
//访谈人员：非常感谢您接受我们的采访，希望我们将来的合作愉快！
//
//奥：合作愉快！
//
//基地、前哨与社区
//M.E.G.“仙境”基地
//建立在“瓦度”中，可容纳无数流浪者
//大量士兵和文职人员驻扎
//M.E.G.通往其它层级的重要枢纽
//入口与出口
//入口
//在任意层级与Level C-241内居民建立精神连接后可进入Level C-241
//在任意层级冥想有小几率进入Level C-241
//尚未发现其他入口
//出口
//当地居民可按照需求将流浪者传送至任一层级
//作者信息
//« Level C-240 | Level C-241 | Level C-242 »
//
//Footnotes
//1. 本文将尽可能用已知的颜色描述Level C-241内的颜色 。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1241{}