//Level C-267
//评分: 
//+10
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
// 
//实体隔绝photo-1578762532473-1ed0ce7d60df?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=987&q=80
//一条通往主穴的途径。
//
//Level C-267是后室C层群的第267层。
//
//描述：
//Level C-267是一处四通八达、结构错综的洞穴空间。该层级的岩壁组成物是一种外观类似于水晶的材质；但其准确成分无从取样分析，因为它们极度坚硬，根本无法破坏，哪怕只是尝试划痕。
//
//尽管如此，流浪者们仍在岩壁上发现了相当数量的、图腾模样的纹路。它们由谁所刻、用何所刻全都不得而知。除此之外，Level C-267的岩壁能够散发出亮度不等的蓝色光泽，为整个层级提供照明。
//
//值得注意的是，Level C-267的中心位置有一片开阔空间（被称为“主穴”），而在其中有着一具极为巨大的骸骨；骸骨看上去年代已久，且由于过于庞大而无从辨认其整体结构。它的头部（？）、四肢（？）、附肢（？）、双翼（？）等部分直接探入岩壁并与后者融为一体；同时，在Level C-267的大部分地区也能够看见在岩石中出入的骸骨结构。根据长期勘测，当前初步确信此为一只超巨型的爬行类实体，且身体结构怪异。它在死亡并化作骸骨之后，于漫长的岁月里逐渐与Level C-267的洞穴系统融合。
//
//若朝着该层级的正东方向前进，将抵达一处洞口模样的地点。但是，洞口已被一扇刻有未知语言的金属巨门封住。不要打听门外是什么、有什么1。
//
//Level C-267内的气温较为寒冷，请有意前往该层级的流浪者做好保暖工作。
//
//基地、前哨和社区
//M.E.G.（探险者总署）C层群Beta基地
//这是M.E.G.在C层群建立的第二个主要基地2，主要统管C3层区3事项。
//M.E.G.总部往该层级调配了大量设备、食品、建筑材料等物资，现已成功在Level C-267内各处建立了或大或小的分散型建筑4。基地的本质即为所有此类建筑彼此关联而构建的聚落。
//C层群监督者团体“生肖”成员之卯兔居住于此，并担任该基地的总负责人。
//接纳所有友好团体或是个人的入驻，并会给予他们相应的扶持。
//重视武装力量，因此兵团实力极强；兵团们在多处地点皆有驻守，尤其是洞口区域。
//入口与出口：
//入口：
//该层级的M.E.G.指挥部与Level C-67的.M.E.G.指挥部由一扇紫钥门5直接相连。
//找到Level C-201中的一处蓝色石质地板，切入其中即可到达本层级。
//走入Level C-202的一扇刻有龙头印记的石门。
//若你在Level C-210内听说了“第12艘船”，请勿诧异并提出相关疑问；如果恰好有前往Level C-267的需求，此时选择迅速前往并进入第12艘船的船长室即可到达该层级。
//站在Level C-250的一间地下室里尝试切出。位置越低、成功率越高。
//更多入口尚待记录/探查。
//出口：
//上述入口全部都能够原路返回/切出。
//奇怪的是，当前没有发现任何能将Level C-267作为原始起点而抵达的其他层级。
//作者信息
//« Level C-266 | Level C-267 | Level C-268 »
//
//Footnotes
//1. 如有疑问，请联系卯兔。
//2. 第一个主要基地位于Level C-67。
//3. Level C-200~299。
//4. 曾与红星建筑队合作。
//5. 由帕尔特博士与安瑟博士借助紫钥石联合开发。但该技术当前并不成熟，成功率也相当之低，因此目前仅存在这一扇成功运作且相连地点无误的紫钥门。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1267{}