//Level C-221
//评分: 
//+42
//+
//–
//X
// 
//
//生存难度：
// 
//生还几率渺茫
// 
//Level C-221是后室C层群的第221层，该层级在一年中只会开放一次。
//
//描述：
//photo-1601577660951-9c33bf5ad9fe?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1865&q=80
//前往赌场的走廊。
//
//
//Level C-221主体是一个与前厅中的中国澳门赌场极为相似的赌场，其风格与九十年代的类型相仿。整体上分为休息区和赌场两个部分。两者由一条长直的走廊连接，走廊墙壁为黑绿色，地上铺着印有花纹图案的地毯。
//休息区是一个面积约为300平方米的方形房间，房间中央放置有100张椅子，并呈方块形整齐排列。天花板四角和中央各挂有一吊灯，散发着较淡的白光。椅子正对着的是一扇褐色的双开门，通常情况下该门处于关闭状态，并且无法以任何人类已知的方法打开。休息区是流浪者在赌局开始前的等待场所，亦是流浪者初到该层级的所处位置。
//
//赌场是流浪者进行赌博游戏的地方，其装潢与走廊相似，其中放置有大约20张绿色的赌桌，部分赌桌上放置有扑克牌或筛子。天花板上的灯嵌在椭圆环形的金属壳中，并在每张赌桌上方悬挂着，发出亮金色的光。该赌场与前厅的赌场唯一的不同之处在于前者并未安装任何监控设备，但流浪者在赌博游戏中仍会产生被人监视着的感觉，原因未知。
//
//赌场中的工作人员会引导流浪者进行赌博游戏，并维持赌场内的秩序。工作人员无法以任何方式被伤害，其原因未知。
//
//在通过赌场入口处后，流浪者随身携带的电子设备和计时设备均无法正常使用。入口处的桌子上摆放有100个装着塑料筹码的布袋，每个袋子上标识着对应流浪者的姓名，筹码数额因人而异。在所有流浪者拿到自己的筹码后赌博游戏正式开始。
//
//赌博游戏
//第一场
//在第一场赌博游戏中，所有流浪者会被平均分配至10张赌桌展开对局，其所进行的赌博游戏为多人对局，道具使用以扑克牌和骰子为主，类型是在前厅中常见的猜点数，五张种马等。本场赌博游戏持续时间约为3小时，流浪者在此期间不可暂停或拒绝下注，违反规定或是输光筹码的流浪者会被赌场工作人员带走，结果无从探究。
//
//第一场游戏时间到后，身上仍保留有筹码的流浪者会被工作人员带往休息区，并等待下一场开始。
//
//第二场
//第二场赌博游戏分为两个阶段，若流浪者人数为双数，则不需要进行第二阶段。本场游戏不需要使用筹码下注。
//
//第一阶段开始前流浪者需要寻找一人作为自己的对手，若赌场上的流浪者人数为单数，未选择对手或未被选中作为对手的流浪者则需等待第一阶段结束后参与第二阶段。
//
//第一阶段开始时，工作人员会给组成对手的两名流浪者分配一把左轮手枪，手枪弹仓内仅装有一枚子弹，两名流浪者须轮流使用手枪朝自己的头部开枪，直到其中一人死亡，另一名流浪者可获得对方的所有筹码。
//
//第二阶段，未参与第一阶段的流浪者须从第一阶段的获胜者中选出自己的对手，然后进行与第一阶段相同的对局，胜出方可获得对方的所有筹码。
//
//本场赌博游戏的获胜者则在休息区等待下一场开始。
//
//第三场
//流浪者平均分为两组分别进行第三场游戏，本场游戏的荷官由工作人员担任。
//
//游戏开始，以面值数额为100元的筹码为最低注，每名流浪者必须至少一次提出愿意“捐出”的数额，并且提出的数额必须大于前一名流浪者所提数额，在所有流浪者完成“捐献”后，每人须上交自己“捐出”的等额筹码，提出数额最大的流浪者须先上交等额筹码，然后便可得到其他流浪者“捐出”的筹码。
//
//以此形式进行共五轮游戏，期间筹码清零或是提出数额大于自己拥有的筹码金额，均会被视为失败。
//
//第四场
//本场作为赌博游戏的最后一场，时间不限，形式为一对一21点（Black Jack）。剩余流浪者需选择一人作为对手进行赌博，直到一方输光筹码，若剩余人数为单数，则该单体流浪者与最先结束第一局的胜出方赌。
//
//每一局的胜出方要继续进行下一局赌博，直到剩下最后一名流浪者，本场游戏结束，第一名可离开该层级。
//
//消息查看
//
// 
// 
//来自用户的消息 Wallse Red …
// 
// 
// 
//日期: 04/27/----
//主题：第1次记录
//| 消息形式：电子邮件
//
//日期: 04/28/----
//主题：第2次记录
//| 消息形式：电子邮件
//
//日期: 04/29/----
//主题：第5次记录
//| 消息形式：电子邮件
//
//
//
//选择要查看的页面：
//
//
//
//Return
//2022.4.27
//
//我不清楚自己是否还能坚持下去，在下一场赌局开始前，我必须让你们知道这些事。
//
//一天前我收到了一封神秘的电子邮件，内容大致是邀请我参加某个有关赌博的游戏，没有署名，也查不到任何发送源。一开始我以为这只是朋友的恶作剧，直到今天，真希望这只是一场梦。
//
//还记得每年四月末夜里总会有人离奇失踪吗？我们一直认为他们是被“抬棺者”带走的，错了…都错了，真实情况是他们都被带到了这，聚在一间宽敞的房间中，我亦是如此。经询问，几乎所有人在进入后室之前有过赌博经历，这是想让我们“互殴”吗？
//
//事实证明，我猜对了。
//
//一些奇怪的人引导我们到达赌场，我不能确定他们是否是真的人类，至少从外表看来像人类。他们全都穿着黑色西装，头上戴着个像模特头似的纯白色头盔，头盔包裹得并不严实，我能看见露出来的头发，头盔面部有一个红色的“X”。他们双手的手背上都有一个像火焰一样的黑色图纹。
//
//我们被迫参加这个“游戏”，上一场已经有四十多人输光了他们的筹码，那些人带走了他们，我不知道迎接他们的会是什么，我也不想知道。
//
//Return
//2022.4.28
//
//真是不敢相信…我竟然在这种死亡地带找到了失踪整整两年的朋友！我很确定那个工作人员就是Upshur！我尝试过呼喊他的名字，其他流浪者都用诧异的目光看着我，他只是将脑袋转向我，没有任何回答便又转了回去。看着那惨白的头盔，我感到无比陌生。
//
//所以，工作人员是人类？老天…他们就这样看着同类互相“残杀”！
//
//Return
//2022.4.29
//
//我需要冷静一下，我…为了赢下去出卖了队友，那些人只是接触过赌，命运欺骗了他们，毕竟赌场上任何人都不能轻易相信。
//
//我可能可以活着离开，只剩四个人了，愿上帝保佑我…
//
//基地，前哨和社区
//该层级不存在已知的基地、前哨和社区。
//
//入口和出口
//入口
//该层级似乎没有确定的入口，但所有误入了该层级的流浪者均有以下遭遇，在此列出，仅供参考。
//
//收到一封印有筹码图案的贺卡，第二天醒来便来到了该层级。
//独自行走时被钝器砸晕，醒来后便来到了该层级。
//收到了一封邀请其进入该层级的电子邮件，第二天醒来便来到了该层级。
//出口
//唯一已知离开该层级的方式是在赌场中赌赢其他99名流浪者。在赌博游戏结束后，第一名会被传送至C层群中的一个安全层级。
//附录
//“Level C-221事件”失踪者Wallse Red在回归后，于2022年5月4日再次失踪，其同事在他最后出现的建筑里发现录音机，其所记录的是该流浪者在二次失踪前的留言。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1221{}