//Level C-231
//评分: 
//+14
//+
//–
//X
//（关闭档案）
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//Level C-231是后室C层群的231层，该层级表现为一片金色的树林。
//
//gratisography-8H-free-stock -photo-585x780.jpg
//一张Level C-231的照片
//
//描述
//Level C-231是一片生长许多着不明品种树木的树林组成，树木的树干很纤细，层级中无论是树木整体还是地面都有一层镀金，层级中没有类似太阳的照明物，但是天空中却有不明光线从未知的地方提供照明。Level C-231的温度保持在10°-25°之间，层级的天空中不存在云，不知什么原因任何能查看时间的设备到层级中都会失灵，所以层级中的时间不明，层级中也没有WIFI可以使用。
//Level C-231的地面不同于其他树林的地面，本层级的地面很平坦，同时层级中有一片湖水，湖水没有镀金，但是在周围环境的作用下湖水也呈现金色。
//Level C-231中的树木可以被砍倒，地面也可以被挖掘，并且被砍完的树会以惊人的速度重新生长出来，树木被砍掉或地面被挖开会露出镀金下的木头和地面上的土，但是镀金会慢慢重新长回来，该层级的所有表面上的镀金似乎会以未知的方式再生。
//
//实体
//层级中不存在任何实体。
//
//基地、前哨与社区
//该层级目前没有已知基地、前哨或社区。
//
//入口与出口
//入口
//在Level C-113拿起一个小型的镀金树雕塑。
//在Level C-126自言自语说，自己想去镀金树林。
//在Level C-101切入一个报废的镀金芯片。
//出口
//切入一块没有“镀金”的地面，会来到Level C-65
//（关闭）
//档案管理员：先生，你请求要修改档案，请说明一下原因。
//
//流浪者：好，是这样的，当时我正在跟我的朋友游览Level C-231，这时我朋友说想刮下一些树上的镀金。
//
//档案管理员：那么你是阻止他了吗？
//
//流浪者：不是，我也同意刮下来一点，但是由于我们两个人都没有带工具，所以我打消了这个念头，但是我那个朋友很耿直，他想直接用指甲去把镀金扣下来。
//
//档案管理员：嗯，然后呢。
//
//流浪者：然后他摘了手套就摸树上的镀金，但是还没开始扣，那些“镀金”突然动了起来，很快把我朋友的手给包裹住了，当时我被吓了一跳，我朋友本来想跑，但是这些“镀金”速度很快，转眼间我的朋友就完全被它们包裹起来了，我觉得我继续待在这也会是同样的下场，所以我就拼命跑，后来我通过切入一块没有镀金的地面离开了。
//
//档案管理员：嗯，你的情况我已经了解了，我们会尽快进行调查并修改档案的，谢谢你的配合。
//
//（关闭档案）
// 
//
//生存难度：
// 
// 
// 
//Level C-231是后室C层群的231层，该层级表现为一片金色的树林。
//
//gratisography-8H-free-stock -photo-585x780.jpg
//一张Level C-231的照片
//
//描述
//Level C-231是一片生长许多着不明品种树木的树林，层级中无论是树木还是地面都有一层“镀金”，层级中没有类似太阳的照明物，但是天空中却有不明光线从未知的地方提供照明。层级的天空中不存在云，任何能查看时间的设备到层级中都会失灵，所以层级中的时间不明。
//根据流浪者描述，Level C-231的树木和地上不是镀金，M.E.G.调查员经过调查，这些“镀金”其实是有着黄金质感的微生物，它们附着在物体上就如同一层镀金一样，几乎层级所有表面都有“镀金”，只有一两块地面不会有“镀金”附着。
//当他们感应到有生命体触碰到它们时，它们就会以极快的速度包裹住实体，并且将其吞食，所以强烈建议不要直接触碰它们，这也间接说明了为什么层级中没有其他实体的原因，所谓的镀金再生其实是它们在繁殖。
//目前M.E.G.已经取消了所有在Level C-231中提取黄金资源的计划。
//
//实体
//实体为层级中的“镀金”，M.E.G.暂时叫它们“镀金者”，它们几乎会吃掉所有实体，并且在没有食物的情况下它们还会相互吞食，这也就导致层级中的“镀金”始终不会变厚。
//根据M.E.G.的调查，镀金者似乎能够侦测到实体的生命力，如果侦查到触碰者具有生命力，那么它们会以极快的速度包裹住对方并进食。
//
//基地、前哨与社区
//由于该层的极度危险性，无法在此建立任何基地，前哨或社区。
//
//入口与出口
//入口
//在Level C-113拿起一个小型的镀金树雕塑。
//在Level C-126自言自语说，自己想去镀金树林。
//在Level C-101切入一个报废的镀金芯片。
//出口
//切入一块没有“镀金”的地面，会来到Level C-65
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1231{}