//Level C-297
//评分: 
//+8
//+
//–
//X
// 
//
//生存难度：
//等级 3
//
//不安全
//极不稳定
//非实体威胁
//Level C-297是后室C层群的第297层。
//
//ab stract-1138967_960_720.jpg
//Level C-297
//
//描述
//Level C-297是由许多摩天大楼组成，但是由于层级的重力方向会随机向东南西北四个方向改变1，所以一栋栋的摩天大楼就是脚下踩的地面，层级不存在太阳和昼夜交替，层级中的光来自天空所照射下来的不明光线，层级内的时间停止在上午9：00左右，层级不存在任何云，气温稳定在10° C~17°C左右。
//
//Level C-297中的摩天大楼由整块的巨型花岗岩和防弹玻璃板构成，其表面异常光滑，所以移动时很有可能打滑，每座摩天大楼不知为何都呈现出极其扭曲的形态而导致凹凸不平，并且大楼会随时会改变自己扭曲的形态2以至于经常会出现极其陡峭的高坡，目前最高的陡坡高度差达到了夸张的40米。
//
//Level C-297中的摩天大楼上的防弹玻璃窗有一些可以打开，打开以后可以进入到其内部房间，其内部大多数为普通的办公室，只有少数的房间是茶水间或杂物间等，由于层级的特殊性，这些房间也变得极为扭曲和混乱，房间与房间之间不会连接，它们只能通过对应的防弹玻璃窗才能进入，办公室经常会有装着杏仁水的饮水机、少量的瓶中闪电、火盐等资源，茶水间则会有大量的罐装龙肉，瓶装杏仁水，幸运豆奶等资源。
//
//实体
//Level C-297中只存在一种特殊的无面灵，它们身穿类似清洁工的服装，手拿各种清洁工具，通常会以2到3个为一组，对摩天大楼内外进行清洁工作，其会在杂物间源源不断的生成，它们似乎会无休止的进行清洁工作，根据推测它们可能就是将摩天大楼外部变得极其光滑的原因。
//
//基地、前哨与社区
//该层级无法建立也没必要建立任何基地、前哨与社区。
//
//入口与出口
//入口
//在Level 11进入一栋大理石构成的摩天大楼
//在Level C-28一栋摩天大楼最高的一层往下看，有可能会进入Level C-297
//更多入口尚待探查
//出口
//对其中一名无面灵清洁工说自己想离开，它会带你去Level 11
//找到一栋摩天大楼的边境跳下去会来到Level C-86，但是不推荐这么做，因为也有可能会切入蓝色通道
//更多出口尚待探查
//作者信息
//« Level C-296 | Level C-297 | Level C-298 »
//
//Footnotes
//1. 根据测试记录表明每48小时会改变一次重力方向
//2. 改变的时间经过统计似乎是随机的
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1297{}