//Level C-282
//评分: 
//+16
//+
//–
//X
// 
//
//生存难度：
// 宜居
// 
// 
//Level C-282是后室C层群的第282层。
//
//pexels-photo-709541.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2
//由M.E.G.拍摄的Level C-282照片。
//
//描述
//Level C-282是一片热带丛林，多种昆虫与动植物栖息于此。高大的丛林木在森林中矗立着，你可以在此听到蝉鸣与鸟叫声。森林中间有一片被山峰所包围的空地，一座木屋建造于此，木屋旁有一处花田，五彩斑斓的花朵渲染了这片“绿海”。延绵不断的山峰直直通向远方，淅淅沥沥的小雨为这片雨林带来了些神秘感。
//
//实体报告
//仑迪
//
//这是Level C-282已知唯一存在的实体，他与普通流浪者并无较大差距。
//
//仑迪的性特征约等于十八周岁的男性，他的上身穿着一件蓝白色T恤衫，戴着一顶黑色且帽檐雕刻着玫瑰的鸭舌帽，下身则穿着一条米白色牛仔裤。
//
//空地上的木屋就是他的家，流浪者可前往木屋进行休息。他对流浪者并无任何敌意，还会为流浪者提供杏仁水、皇家口粮等补充能量的物品。
//
//据M.E.G.调查得知，仑迪可以控制Level C-282的天气。若仑迪离开Level C-282，该层级将彻底坍塌，变为废墟。
//
//仑迪无法离开Level C-282。据了解，该实体曾尝试过多种方法，但仍然无法离开该层级。
//
//pexels-photo-371662.jpeg
//Level C-282中的木屋。
//
//木屋
//位置
//在广袤的雨林中央，被山峰包围起来的一片空地上，一座木屋修建在这里，四周有着花田。
//
//外部
//这是一栋由丛林木修建而成的木屋，我们无法推断其建造时间。木屋有三层楼，屋顶的瓦片是用岩石修成的，屋内的窗户则是普通的窗户。
//
//房屋前有一把木制的躺椅，躺椅已经发黑了，仑迪经常躺在上面发呆。
//
//内部
//木屋内部的生活设施齐全，滋滋作响的壁炉让人有一种归属感。插着花朵的木制花瓶静静的被放在餐桌上，墙壁上挂着仑迪和一位女子的合照。
//
//二楼三楼均有许多空房间，流浪者可以和仑迪进行交谈，来长住于此，仑迪会很乐意帮助流浪者。
//
//阁楼、储藏室均被锁了起来。
//
//M.E.G.与仑迪的采访资料
//资料一
//M.E.G.成员：请问你是怎么来到Level C-282的？你在这里生活了多久？
//仑迪：我从有自我意识时就生活在这里了，我不知道我在这里待了几年……一百年？还是二百年？我记不清了……
//M.E.G.成员：请问那片花田是否为你修建的？
//仑迪：是的，我喜欢花朵。她也喜欢花朵，所以我为她建造了一片花田。
//M.E.G.成员：你拥有控制天气的能力，请问为什么这里老是在下雨呢？你一直很难过吗？
//仑迪：我不知道……你们别在问我了！我不想回答这些问题了！！！快点离开我的家！！！
//该实体突然暴怒，不久后突然哭泣，采访暂停。
//
//资料二
//M.E.G.成员：实在不好意思，上次是我问得太仓促了，我们可以开始今天的采访了。
//仑迪：是我无法走出那个阴影，不好意思吓到你了。
//M.E.G.成员：请问您所说的“阴影”是什么？方便与我们透露一下吗？
//仑迪：你们并不是第一个到达这里的流浪者，一个女孩先来到了这里。我身上的衣服全是她送给我的，我原本只是一个穿着树叶衣服的野人，这栋木屋也只是一个如同废墟的地方。
//M.E.G.成员：所以那位流浪者帮助您成为了现在这个样子？
//仑迪：是啊，她用那些树叶摆出花朵的形状，告诉我如果木屋多一些花朵会更温馨。她用丛林木给我建造了许多家具用品，她用树枝教我写下了第一个单词。她曾经提议要和我一起开一间休息站，让和她一样的流浪者在此缓解疲劳，我所掌握的烹饪技术就是为了这件事，杏仁水与皇家口粮是在阁楼上找到的。
//M.E.G.成员：听起来她是一个非常温暖的流浪者，那她现在在哪里？
//仑迪：不知道……她说要找一些花种子，打开储物间的门后便消失了。她曾告诉我还有很多空间，但我始终不敢相信。直到你们来到了这里，或许她到了别的层级去了吧。我这几天一直都试图通过储物间前往她所在的层级，但均失败了……
//M.E.G.成员：今天的访谈就到此吧，后续我们调查后将联系您。
//仑迪：好的，再见。
//
//资料三
//M.E.G.成员：非常感谢您为我们提供的这些信息，我们将在Level C-282建造新的基地与前哨，今天来就是想征求下您的意见？
//仑迪：我没有意见，不过我有一个小小的请求。你们可以专门派人帮我寻找这个女孩吗？我家可以让你们随意进出、调查，请答应我这个请求。
//M.E.G.成员：目前我们已经组建小队寻找此流浪者了，请您放心。
//仑迪：那就好！谢谢你们！
//M.E.G.成员：新的基地将在三天后完成建造，届时欢迎您来参观，我先回去了。
//仑迪：好的，我送送你们吧。
//雨突然停了。
//
//基地、前哨与社区
//（探险者总署）M.E.G.“归来”基地
//最早建立在Level C-282的基地，由仑迪为此基地命名。
//由M.E.G.所建造与管理的基地，坐落于雨林空地处，流浪者可进入该基地获取M.E.G.的帮助。
//基地常住人口为60人，包括居住于此的流浪者、M.E.G.的调查研究人员、武装人员。
//流浪者可在此基地获取杏仁水、皇家口粮等补充能量的物品。
//志愿者社区：“盼望”
//“盼望”社区是在“归来”基地建造后成立的一个志愿者社区，组建者为仑迪。
//这是一个由50名在后室与伙伴、爱人走失的流浪者组建的互助社区。
//社区成员每周将通过仑迪的木屋前往别的层级，他们想找到那些失踪的朋友与亲人。
//社区成员会无偿帮助进入Level C-282的流浪者，为他们提供住宅与补给，并诚恳的邀请他们加入社区。
//入口与出口
//入口
//在Level C-496下车进入公交站台会有概率进入Level C-282。
//在Level 1中深入探索，可能会找到一扇绿棕相间的丛林木门，进入门中即可到达Level C-282。
//在Level 11进入一栋木制大楼即可来到Level C-282
//在Level 188有极小概率遇见一栋被刷着棕色油漆的窗户，进入窗户即可到达Level C-282
//出口
//进入木屋中的储物室，会有概率进入Level 11或Level 188。
//进入木屋中的阁楼，会到达Level 10或Level 3。
//在雨林中深入探索，可能会发现一个山洞，进入山洞即可来到Level 5。
//附录
//- 收起这份报告
//M.E.G.“归来”基地紧急报告：
//在本次搜寻人员时，我们于Level 188发现了一具女性尸体。
//死者的死亡时间大约在3个月以前，死因为长时间未进食。
//我们从死者手中发现了一袋花种子以及一张相片。
//经初步推断，这具女性尸体为Level C-282中实体要找寻的流浪者。
//我们目前已经妥善的处理了这具尸体，为确保Level C-282的稳定，我们将会把这份报告永远封存。
//向所有为流浪者们奋斗的M.E.G.成员致敬
//M.E.G.“归来”基地
//
//- 收起这份报告
//- 收起这份报告
//近两周来“盼望”社区的报告：
//这两周以来，我们救助了更多的流浪者，但也牺牲了一些成员……以下是我们社区的荣耀！
//我们于Level 10救助了一名濒临死亡的流浪者。
//我们在Level 3中找到了与其中一位队员走散的亲人。
//我们在Level 5中找到了与其中一位队员走散的朋友。
//我们于Level 188救助了3名流浪者，并成功阻止了其中一位流浪者靠近“窗户”。
//但老大（这里指仑迪）所说的那个姑娘还并未找到，我的妻子也没有找到。
//
//- 收起这份报告
//- 收起这份演讲稿
//“所有“盼望”社区的成员们:
//除去我这个本就生活在这里的实体以外，大家每个人都是一个鲜活的个体，每个人拥有不同的情绪与情感。
//在大家进入后室时，肯定是慌乱的、紧张的。现在，生活在Level C-282的每个人都摆脱了那种危机感，但其他进入后室的流浪者并没有。后室虽然是冷漠无情的，但后室中的流浪者不应该也是冷漠的。我们应该去帮助那些被困难、噩梦缠身的流浪者，这是我们社区成立的目的！
//
//每个人心中都有自己所牵挂的人，我同样如此。你们所牵挂你们的父母、妻儿以及共同在后室中穿梭的伙伴。他们或许去了其他的层级，或许仍在前厅，我们能做的只是努力加快的找到他们、救助他们。如果每个人都行动起来，我坚信总有一天，那些与我们在后室中分离的流浪者们，他们终将会回到我们的身边！”
//
//仑迪
//
//- 收起这份演讲稿
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1282{}