//Level C-246
//评分: 
//+10
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
//不安全
// 
// 
//uisoNjnSMOmD2Ic.jpg
//非常干净的Level C-246
//
//Level C-246是后室C层群的第246层。
//
//描述
//场景：
//Level C-246是一个封闭的男性公共卫生间。其大小可能只有大约6m*10m，是后室里最小层级之一。卫生间里共有5个男性小便池，1个障碍者小便池，3个洋式马桶，1个存放清扫工具的隔间和4个洗手池。除了最左边的障碍者小便池和他右面的小便池之间没有隔板，每个小便池间都有一个隔板。洗手池的上面有4面镜子，此镜子没有任何的效果。卫生间十分的干净，甚至能在里面闻到花香味，且看起来大小便池都没有使用过的痕迹。
//
//ikKLNHs4TUOJgQo.jpg
//进入卫生间前从入口处照的洗手池
//
//特征：
//该层级似乎会影响流浪者的身体。在该层级逗留时，一开始流浪者不管有无尿意都会变得尿意全无。随着时间的推移尿意会更明显，汗液分泌也会变的非常快。这会导致流浪者会忍不住上厕所。声音会引起饥渴者的注意，所以不要想在该层级上厕所。但似乎以很慢的速度一点点尿到手上不会引起饥渴者的注意。曾经有一位流浪者用此办法接住自己的尿并喝了下去，得以使他在该层级呆了约5小时之久，并且成功逃了出去。
//警告：靠近小便池会触发自动清洗，把手放在洗手台的水龙头下面也会触发自动出水，所以强烈建议不要靠近小便池和洗手台。
//
//流浪者情报：
//该层级只能进入一个人而且似乎不止一个种类。有两位流浪者称，他们在一起进入Level 11的一个男性公共卫生间的时候发现了该层级。根据两位流浪者之后的描述得知，似乎两人出来方式不同。一位流浪者似乎是在里面呆了10分钟左右之后就发现原本是墙的出口变成了刚刚从Level 11进入时的入口。另一位流浪者称自己在里面呆了20多分钟也没有发现出口的墙打开的情况，而是在尿意袭来准备上厕所时，切入了最右面小便池的右侧墙壁，并在Level 11卫生间入口出来。该层级去到其他层级的方法好像不固定，目前的猜测是该卫生间有多种种类，其中有两种分别是上文所叙。
//
//请不要妄想去探索该层级！因为你永远不知道该层级的种类，可能会导致你忍不住漏尿被饥渴者杀死。
//
//饥渴者
//身体特征：
//似乎是只有在这个层级才有的实体。大小跟一般人类的头差不多大，类似章鱼的软体实体。但跟章鱼不同的是饥渴者的触手似乎是富有弹性的，可以伸的很长。触手似乎有20多根，每根大概粗细2cm，长度大概40cm。触手上并没有吸盘，但在前端有一个硬的类似针头似的东西，应该是用来吸食液体和血的。
//
//能力和捕猎机制：
//该实体速度极快，而且似乎会瞬移。通常在该层级是不会见到该实体的，只有在有液体流动和落在地上发出声音的时候他才会从天花板出现来吸食液体。该实体十分危险，如果流浪者在他吸食完液体之后被发现，他会直接扑上来用他的触手割掉流浪者的脑袋取代他，之后会慢慢吸食流浪者身体里的血液直到吸干。所以强烈建议不要发出流水声和水滴在地上的声音。
//
//层级种类
//目前发现的种类共有五种，虽然五种的布局都是一样的，但是出去方式不同。
//
//第一种：
//在该种类层级呆10分钟后，出口的墙会消失变成进入时的入口。
//第二种：
//在该种类层级呆到想上厕所时，切入最右面小便池右面的墙可以让你在进入的入口处出来。
//第三种：
//在该种类层级的饥渴者吸食液体的时候，趁他不注意从他出来的地方切入会在进入时的入口出来。
//
//KpRMUbJnQeBdVfo.jpg
//出口墙上的镜子
//
//第四种：
//在该种类层级呆足约5个小时之后你会昏迷，醒来后会发现你在进入时的入口处。
//第五种：
//在该种类层级里你需要破坏所有的镜子，注意碎片划伤你的手流出的血液也会引起饥渴者的注意。在你不受伤的情况下破坏所有镜子时，你会发现出口的墙上会多出一面镜子，切入他后你会在进入时的入口出来。
//
//授权成功
//2022.6.16
//记录者：？？？
//？？？：操，我明明只是想上个厕所怎么他妈的被困在这里了。
//
//？？？：而且刚刚的尿意也完全没有了，真是搞不懂。
//
//？？？：还是说这是个新层级？
//
//？？？：妈的不至于这么背吧，总之先找找出口吧。
//
//（约5分钟后）
//
//？？？：这层级他妈怎么这么小？就一个厕所大小是什么鬼？这要怎么找出口？诶… 抱怨也不是办法，还是再找找吧。
//
//（约10分钟后）
//
//？？？：怎么突然又有尿意了，而且明明不热怎么出这么多汗？不管了先上个厕所。
//
//？？？：啊～～～，真舒服，这该死的地方有小便池也算是不幸中的万幸了。
//
//？？？：天花板那个是什么东西？那是章鱼？
//
//？？？：我去他开始在小便池里动来动去的。好像在…吸我的尿？
//
//？？？：怎么回事，他怎么不动了？这个实体是没有攻击力的… …
//
//之后的录音里只有一声很短的惨叫和一个东西砸到地上的声音。该录音设备被发现在Level 11的一个公共卫生间入口。
//
//基地、前哨与社区
//由于Level C-246的特性和实在是太小且拥有多种种类，在此建立一个基地前哨或者社区都是不现实的。
//
//入口与出口
//入口
//目前只发现在Level 11的任何一个只有男性卫生间的公共卫生间入口都可以到达Level C-246。有些流浪者还称他们是从C层群进入的，但未得到证实。
//出口
//10分钟后出口的墙会变成进入时的入口。
//一直到想上厕所时，切入最右面小便池右面的墙可以让你在进入时的入口处出来。
//等到饥渴者在吸食液体的时候，趁他不注意从他出来的地方切入会在进入时的入口出来。
//在大概5个小时后你会昏迷，再次醒来你会发现你在进入时的入口处。
//你需要破环所有的镜子。在安全破坏所有的镜子后，出口的墙上会多出一面镜子，切入他后你会在进入时的入口出来。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1246{}