//Level C-228
//评分: 
//+8
//+
//–
//X
//
//
// 
//
//生存難度：
//
//等級 抑鬱
//
//低氣壓
//菌體充斥
//實體橫行PSX-20220427-050505.jpg
//Level C-228的部分景觀
//
//Level C-228是後室群的第228層。
//
//描述
//環境
//Level C-228是由一排公寓住宅區、一排老舊公寓組成的街區，在朝北的方向明顯能看到一座公園，但無法進入。這裡的天空時常呈現異常的深藍色，空氣濕度長年維持在90%以上，這使的Level C-228永遠只在陰天和雨天中循環。氣溫則長年維持在華氏62.6度至68度(攝氏17度~20度)。
//
//特性
//儘管沒有直接證據表明，Level C-228能使來到此層級的流浪者情緒低落。但大部分來到此層級的流浪者即便抵禦了實體DP-228 ，依舊會隨著時間推移，而產生長時間的情緒低落。
//
//關閉
//以下物資皆會以救難箱的形式，隨機出現在此層級。
//
//武器
//名稱	生成機率
//美工刀	100%
//軍刀	70%
//水果刀	69.5%
//阿拉伯彎刀	50%
//武士刀	50%
//.12口徑子彈	49.5%
//雷明頓1998霰彈槍	40%
//.45ACP子彈	39.8%
//克拉克36手槍	39.8%
//補給品及雜項
//名稱	生成機率
//瓶裝閃電	100%
//一打杏仁水	100%
//士力架	80%
//一箱未知來源的肉罐頭	80%
//未知來源的軍糧	80%
//寫著瑪鈉的麵粉（2公斤）	70%
//一手青島啤酒（冰）	50%
//醫療用品
//名稱	生成機率
//醫用酒精	100%
//培養皿	100%
//手術刀	100%
//乳膠手套	100%
//過濾DP-228用的半年性口罩	70%
//實體
//DP-228
//此level最常見的實體，生成在空氣中。
//該實體為一種未知菌體，通常在空氣中是未激活狀態。一旦吸入人體內，在48小時後就會進入激活狀態。
//激活狀態的DP-228，會集中寄生在人體的神經細胞。
//在感染初期不會有任何明顯症狀。
//到了中期，實體中的CITT-1 蛋白質則會開始集中攻擊嗅球，進而併發憂鬱症。
//到了末期，體內CITT-1的陽性抗體會佔據人體的80%，實體會開始攻擊人體的免疫系統、杏仁核等。
//此時的末期患者會如同癌末病人一般 ，因諸如感冒等一類小病而喪命。
//在患者喪命後，實體會以未知的手段重新控制屍體。這個階段開始，人體的皮膚組織會逐漸形成異常的焦黑狀。而體內的實體會產生一次變異，這個過程會開始吸收屍體中殘存的脂肪，進而導致屍體骨瘦如柴。
//最終會進化成受難者。
//整個過程僅需1個月。
//受難者
//該實體為人形。
//皮膚皆呈現三度灼傷的焦黑狀。
//全身不存在任何脂肪。
//不存在任何智力表現，但會不斷重複一些消極言論。
//通常呈現雙膝跪地的姿勢，也有部分實體成站立姿勢，但並不會移動。
//對任何流浪者沒有敵意，只是一但流浪者與其產生物理接觸，會引發實體爆裂而亡，爆炸產生的衝擊波，會在5公尺的範圍內釋放大量被激活的DP-2281，即便只是沾黏在皮膚組織，也能直接滲透進體內。從潛伏到發病僅需10分鐘，一旦發病患者會直接同化為該實體。
//有40%的機率會變異成苦修者。
//苦修者
//此層級第二多的實體。
//受難者的變異體，對流浪者抱有強烈敵意，會主動追擊流浪者。
//外觀特徵與受難者雷同，但部分區塊呈現龜裂狀，裂痕中會散發異常的紅光。
//身邊時常配有一把來源未知，且鑲上鐵刺的皮鞭。
//難以被殺死，但能被擊暈。
//物理接觸不會傳播DP-228。
//社區、基地與前哨站
//黎明村
//由受困此處的流浪者，及治癒者、擺渡人等組織建構出來的唯一社區。
//總人口為250人，規模相當於一座精神療養院。
//據點位於一座橘紅色磚瓦的公寓社區，該據點仍能再容納400人。
//治癒者
//一個由34名不同領域的醫生，及100名護理師所組成的自發性組織。
//會為來到該層級的流浪者，免費提供醫療服務；其中包括但不限於精神疾病及情緒疾病的治療、皮外傷及開創性傷口的治療。
//擺渡人
//該組織為此層級第一個組建的團隊。
//現與治癒者達成合作，專門提供治癒者，或到訪的旅行者醫療用品及武器和食品。
//該組織由15名來自M.E.G的志願者，和50名自發參與的黎明村社區住戶組成。
//據點01
//據點常駐於此層級的入口，由黎明村的住戶自發組織的安保人員，專門協助並保護意外到訪的流浪者，安全的抵達黎明村社區。
//
//據點02
//該劇點位於此層級的出口處，專門協助護送流浪者離開此層級。
//
//入口與出口
//入口
//在任何包括但不限於，刀具自刎、用餐具插進插座試圖電自己等自殘行為，持續超過兩週以上，有99%的機率會來到此層級。
//亦或是在任意宜居的層級中，產生消極、低靡的情緒持續超過兩週以上，則會在陷入一陣昏迷後來到該層級。
//出口
//此層級唯一的出口位於通往公園的巷口，不斷的直走直至眼前的亮光沒過身旁的景色，之後便會切出本級，到達一處宜居的層級。
//請注意流浪者若患有包括但不限於抑鬱症、躁鬱症等精神或情緒疾病，會導致原先的出口變成一處暗巷，且會生成4到5隻受難者或苦修者。
//作者信息
//« Level C-227 | Level C-228 | Level C-229 »
//
//Footnotes
//1. 由受難者體內釋放的DP-228是常態的DP-228的變異株，比常態更具攻擊性，且能擬態成蛋白質躲避免疫系統攻擊。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1228{}