//Level C-270
//评分: 
//+82
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
//安全
//稳定
//友善实体
//Level C-270是后室C层群的第270层。
//这是你的高中哦！享受吧，美好的校园时光！
//
//描述
//yale-university-landscape-universities-schools-159490.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=650&w=940
//目前唯一一张Level C-270的摄影。
//
//Level C-270的外观会根据进入者的记忆而变化。其总体外观为被七座山环绕的高中校园，校门口有"七岭高级中学"的字样。校园内共有3-5幢教学楼(其数量会随着流浪者记忆中的校园而变化)，均有4层，且一律有着灰白色的外墙。教学楼的内部构造疑似为非欧几里得空间，即使你已经到达了最高层，仍然可以继续往上走。教学楼是附近还会有一幢实验楼，其与教学楼相通。实验楼共有2层，每层有3个实验室。里面有少量火盐和杏仁水。有时会有呈粉末状的寂静汁液。
//
//该层级内部有许多游荡的无面灵。他们多出现在教学楼内，有时在其他的地方也能看到他们。他们的身上有一种特殊的效应。据目击报告称，流浪者遇到无面灵时会自发地认为他们是自己曾经的同学。这些效应目前仅存在于Level C-270。值得一提的是，在该效应影响下，无面灵为友善实体。
//
//基地、前哨与社区
//介于该层级的特性，故不存在任何基地，前哨与社区。
//
//入口与出口
//入口
//在任意层级与无面灵发生肢体冲突有小概率进入Level C-270。
//出口
//从教学楼上跳下，你会来到Level C-996。
//通告 M.E.G探险者总署
//
//注意！
//自2136“调查”事件发生后。确定更换文档。
//
//故以上文档已过期。
//
//以下为新文档。
//
//— 监督者A
//
//2136“调查”事件
//Level C-270于2021.3.1首次被发现。此后已有多名流浪者进入，且均安全离开。为更仔细探索该层级，M.E.G.派出一名调查员进行调查。但是在一个月后，该调查员彻底与M.E.G总部失去联络。
//以下为该调查员的调查日志：
//
//- 关闭
//[以下为文本记录]
//记录时间：2021.3.6
//记录内容：我切入了Level C-270。这里就像我高中时候的样子，甚至比我的高中还要好的多。感觉是个不错的地方。
//我的左侧有3座教学楼。这里面的过道比我学校的要干净，宽敞的多。我随便找了一间教室走了进去，里面有不少的杏仁水。真不错，看来这里是建立基地的好地方。
//迎面走来一个无面灵。她看上去好面熟……等等，她明明没有脸，我却可以清楚的肯定她是我的高中同学。“艾利克斯！”我喊她。她竟然还朝我挥了挥手！难道，这些无面灵真的是我的同学，或是他们以某种方式的投影吗？
//天要黑了。这里唯一的缺点似乎就是没有宿舍。看样子只能住在教室了。
//
//- 关闭
//[以下为文本记录]
//记录时间：2021.3.7
//记录内容：我开始仔细的探索这个层级。每一个教室里都有很多杏仁水。我甚至找到了两盒皇家口粮。从外面看，这教学楼都有4层，但是我到顶之后，还是可以继续向上走。
//我担心这里的结构不稳定，最上面的楼层会崩溃，于是我很小心地走了上去。但是这里看上去一切正常，并没有发生崩溃的迹象，整个层级结构也十分稳定。我又走了几层，并没有发现任何异常现象，但是楼层越高，资源越少。
//总体来说，这里是个不错的地方。没准可以在这里建立基地。
//
//- 关闭
//[以下为文本记录]
//记录时间：2021.3.8
//记录内容：今天是一个阴天。周围好像发生了一些微妙的变化。但是我说不出那是什么，并且也无法预测这些变化会带来什么后果。
//教学楼的大部分区域已经被我探索完毕。我遇见了许多无面灵，尽管他们没有脸，并且我清楚的知道他们是实体而不是人类，但是我还是可以叫出来他们中任何一个的名字。其中还有不少是我高中时候的好朋友。在其他层级，我都没有发现过类似的效应，看来这是Level C-270的特有效应。我决定称之为"相似效应"。
//
//- 关闭
//[以下为文本记录]
//记录时间：2021.3.9
//记录内容：对于教学楼的探索已经结束。今天出现了另外一些无面灵。我的意识告诉我，它们代表着我在学校比较讨厌的家伙。我甚至看到了那个恶霸，也是我的情敌，这让我感到有点气愤。
//我尽量不去惊动它们，小心翼翼地到达了实验楼。实验楼里非常安静，没有一个实体的影子，空荡荡的。我打开一个实验室的门，看到桌子上摆着几个试剂瓶，里面装着一点火盐。这让我感到非常意外。在另一个实验室里，我发现了一小瓶的寂静汁液的粉末。没想到这里的物资也挺丰富。今天也是收获满满的一天呢。
//
//- 关闭
//[以下为文本记录]
//记录时间：2021.3.30
//记录内容：我在这里已经生活了近一个月。周围的环境确实是变化了。从两个星期前，这里就一直阴天，再也没有出现过阳光。一个星期前，大雾降临，能见度连50米都不到。走廊里十分潮湿，因此我已经摔了好几次。
//仇恨我的无面灵越来越多，它们几次把我逼到墙角，抢走我身上所有的物品，甚至撕破我的衣服。我只能更小心的躲着它们走。我发现自己位于教学楼的临时基地也经常被扰乱。有时，我的东西会莫名其妙的少好多，或者是被随意的翻乱，一片狼藉。周围的课桌上密密麻麻的贴着写有恶毒话语的纸条。真是令人厌烦。
//我已经很确定是那些仇恨我的无面灵干的。本来我想拿枪在基地守一天，但是我发现自己的枪都被偷走了！完了，这下我真的没有还手之力了。
//
//- 关闭
//[以下为文本记录]
//记录时间：2021.3.31
//记录内容：我感觉自己快要被逼疯了。无面灵的行为越来越过分了。它们在我基地的周围放了一些不明物质，导致基地周围的空气已经混浊的几乎无法呼吸。这里已经无法居住了。
//为什么要针对我?我无法理解。我从来没有作出攻击无面灵的行为，也从来没有打扰过他们，为什么被攻击的是我，而且只有我?我的记忆告诉我，这些无面灵明明有不少代表着来自不同敌对校园帮派的人，但是在这里他们仿佛团结起来针对我。
//我尝试联系M.E.G.总部，打算让他们派部队前往救援。但是总部报告说所有的入口都消失了，增援无法到达。这下，我真的陷入孤立无援的境地了。
//我打算把基地搬迁到4楼，那里也许可以减少无面灵的侵扰。我已经开始一点点地转移物品了。
//
//- 关闭
//[以下为文本记录]
//记录时间：2021.4.2
//记录内容：经过两天的努力，我成功把基地搬到了4楼。途中又损失了大部分物资。我收集的资源已经所剩无几了，而且我有不祥的预感：整个层级内的资源都在减少。我不会真的死在这里吧！
//
//- 关闭
//[以下为文本记录]
//记录时间：2021.4.3
//记录内容：无面灵似乎开始进攻4楼了，他们到底想干什么？
//
//- 关闭
//[以下为语音记录]
//记录时间：2021.4.3
//语音内容：他们……他们就在教室外面，我好害怕……
//（门被撞开的声音，调查员绝望的哭喊声）
//[语音中断]
//
//- 关闭
//[以下为文本记录]
//记录时间：2021.4.8
//记录内容：原来的记录仪被它们抢走了，还好我带了个备用的。我被它们关进了这个黑房间，它们不停地折磨我，我的精神几乎崩溃了。现在我全身都是伤口，两条腿都被它们打断了。我已经不能逃跑，几乎连打开记录仪的力气都没有了。可是我的脑海中仍回响着它们辱骂我的话语……那些肮脏的词汇……
//我是疯了么？
//我的存在，有什么意义吗？难道我生来就要遭受这般苦难，先是掉进了后室这个鬼地方，然后又被囚禁在这里，任由无面灵践踏和辱骂?
//我想不清楚，也不敢再往下想。
//只有一点我是清楚的，就是对于这个层级的勘探，只能到此为止了。
//这根本就是个地狱。
//这不是人类能够生存的地方。对于从这里出去，我也不再抱有希望了。
//与其在这里遭受屈辱，我还不如死在这里……
//再见……
//
//补充内容
//补充时间：2021 4 20
//该日志为该调查员的最后一篇报告。此后，该调查员彻底失联。在多次寻找无果后，推测其已经死亡。
//经过多次召开会议，决定依照该调查员的报告修改文档。
//
//- 关闭
// 
//
//生存难度：
//等级 5
//
//不稳定
//实体性质转变
//来自实体的精神危害
//Level C-270是后室C层群的第270层。
//
//描述
//yale-university-landscape-universities-schools-159490.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=650&w=940
//目前唯一一张Level C-270的摄影。
//
//Level C-270的外观会根据进入者的记忆而变化。其总体外观为被七座山环绕的高中校园，校门口有"七岭高级中学"的字样。校园内共有3-5幢教学楼(其数量会随着流浪者记忆中的校园而变化)，均有4层，且一律有着灰白色的外墙。教学楼的内部构造疑似为非欧几里得空间，即使你已经到达了最高层，仍然可以继续往上走。教学楼是附近还会有一幢实验楼，其与教学楼相通。实验楼共有2层，每层有3个实验室。里面有少量火盐和杏仁水。有时会有呈粉末状的寂静汁液。
//
//层级中仅有的实体是无面灵。他们受到层级的特有效应"相似效应"影响，使得进入的流浪者自发认为他们是自己的同学。在流浪者到达Level C-270的最初一段时间(目前对于具体时间并无确切数据，因为调查开始之前进入的流浪者均在三天之内离开了层级)，遇见的无面灵几乎都被认为是与自己较为亲近的同学。在超过一段时间后(具体时间无确切数据，原因同上)，仇敌身份的无面灵将出现并对流浪者实施暴力行为，直到流浪者心理崩溃而死。
//
//基地、前哨与社区
//介于该层级的特性，故不存在任何基地，前哨与社区。
//
//入口与出口
//入口
//在任意层级与无面灵发生肢体冲突有小概率进入Level C-270。
//出口
//从教学楼上跳下，你会来到Level C-996。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1270{}