//Level C-263
//评分: 
//+19
//+
//–
//X
// 
//
//生存难度：
//等级 4
//
// 
// 
// 
//Level C-263是后室C层群的第263层。
//
//描述
//vsZcbF.jpg
//休息区的照片。
//
//Level C-263看起来像是一家正在营业的大型家具城，其店铺摆设类似于前厅中一家名为“宜家”的品牌连锁店，但这家店更多的看上去像是“宜家”的山寨品。奇怪的是，该层永远处在黑夜中，原因未知。
//
//当流浪者进入该层时，首先会出现在此家具城的入口内，并听到一声欢迎光临“贻家”家具城的广播声，随后便有一名此家具城的员工前来询问是否需要导购帮助，流浪者可以依据自己的需求来进行回复，之后流浪者就可以通过入店通道来进入各种家具区。“贻家”家具城一共有四层，室内暖色的灯光搭配着其淡白的屋顶，并一只循环播放着《Sun Rise》这首歌，流浪者会感到十分惬意并有一种不愿离开的念头，其各个区域的名称如下：
//
//小型家具与日用区（一楼）
//板式家具区（二楼）
//软体，办公类家具区（三楼）
//家用电器区（四楼）
//同时，流浪者可以在每层发现名为“员工休息室”的房间，从里面可以找到杏仁水之类的物资，但如果被员工发现的话，则会被立即赶出该层级。
// 
//
//小型家具与日用区
//这是每一个流浪者想要参观家具城时第一个进入的区域，该区域的中心是一个身高约为4米的巨型布偶熊，据了解它是“贻家”家具城的吉祥物，同时有一群中号的布偶熊围绕着它摆放，流浪者可以选择购买这些中号玩偶，售价为3瓶杏仁水。
//
//流浪者可以在离中心50米开外的地方找到休息区，休息区内提供茶水服务，你可以在这里向员工寻求帮助，大多数的请求都会被接受，流浪者可以选择在这里短暂休息，如果在此休息停留时间过久的话员工会前来提醒离开。休息区可用作于短暂的躲避"断电"事件。
//
//流浪者可以在这一层中购买诸如磨损的麻袋，糖果，傻瓜口香糖等对探索有用的物品，交易货币为杏仁水。各个物品购买所需的杏仁水数量不同，有些的价格甚至异常的高昂，请流浪者们在考虑后再进行购买。
//
//板式家具区
//这一层主要以各类木板式家具组成，其家具类型大多为高达3米的木制柜子，这些柜子无法被破坏，也无法被攀爬。
//
//二楼大部分的区域都被因未知原因而被摆放成了一个又一个复杂的迷宫的柜子，这些迷宫每过30分钟就会进行变换，具体表现为柜子在未知力量的推动下改变了原本的摆放方式。
//
//流浪者想要前往第三层时必须通过这些迷宫，但由于迷宫的变化规律十分的随机，毫无逻辑可循，使得流浪者很难能够逃离这里，你甚至可以看到其他因物资耗尽而死在这里的流浪者的尸骨。如果运气的好的话，流浪者可以遇到一些员工，可以向他们寻求帮助，从而来到第三层。
//
//软体，办公类家具区
//这里为本层中最为安全区域，流浪者可以选择在这里进行歇息调整，但在该层的员工极少，且流浪者被明确提醒不能接触任何办公类型的家具，只能进行观赏，当流浪者向员工询问为何时，总会以产品升级的理由搪塞过去。
//
//流浪者可以在这一层中找到各式各样的卧室样板房间，可以选择在此进行长时间的休息，直到被员工发现为止；这里同时也是本层级中Wi-Fi信号最强的地方，且可以免疫“断电”事件带来的影响。
//
//家用电器区
//每当流浪者想要接近通往家用电器区的楼梯时，都会有员工出现并阻拦流浪者，且员工尚未给出任何理由，所以目前关于这一层的信息是最少的。
//
//- 关闭流浪者Kevin探索第四层的视频
//视频开始
//一群流浪者围在通往四楼的楼梯处。
//
//流浪者们：为什么不让我们进去！
//
//员工看起来惊慌失措，但还是一言不发，微笑着想阻挡他们。
//
//忽然，Kevin趁着这名员工不注意，一下子跑上了楼梯。
//
//员工回头看了一下他，叹了口气，就这么放他上去了。
//
//Kevin：四楼不就一卖家用电器的吗，神神秘秘的搞什么名堂？
//
//Kevin来到了第四层，这里原本关着的灯忽然打开，Kevin被吓了一跳。
//
//Kevin：这么智能？还能自动感应！
//
//Kevin环顾四周。
//
//Kevin：这里和普通家具城中的电器区简直毫无两样，就是空调温度有点低罢了。
//
//Kevin在第四层中四处的闲逛，饶有兴趣地看着这些电器，它们好像与前厅中的差距很大，似乎更加的智能。
//
//Kevin：让我看看…..这是什么牌子的洗衣机？还写着：智能牌！有多智能？
//
//话语刚结，Kevin的身后突然传来一句话：看看我吧。
//
//Kevin：啥？
//
//他转过身去，并未发现什么，只是他身后另一排的洗衣机不知为什么突然启动了。
//
//Kevin：吓死我了，原来是洗衣机开了，这怕不是内置语音吧！
//
//Kevin长呼了一口气。
//
//Kevin：奇怪，怎么越来越冷了？那我再看看就下去吧。
//
//Kevin朝别处走去，他所到之处，无论什么电器都会突然开启，并发出：买下我吧！的声音。
//
//Kevin又走了许久，当他想离开时，却发现身边围满了家用电器，伴随着越来越多电器开启的声音响起，他才终于发现了不对劲。
//
//Kevin：这些东西他妈是长脚了吗？！能不能别吵了啊！草，怎么一直在说”买下我啊“?这他妈的都是什么玩意啊。
//
//电器围得越来越紧，Kevin显得动弹不得。
//
//Kevin：妈的，欺负我是吧？我就让你们这帮没有开化过的”人工智能“看看我的厉害！
//
//Kevin先是一脚踹开面前的冰箱，但其他的电器都好像活过来了似的，纷纷向前想压住Kevin。
//
//Kevin：想当年我他妈上战场的时候你们这帮电子垃圾还没生产出来！！！！
//
//Kevin突然爆发，那些家电一下子都被Kevin撞翻了。
//
//Kevin抄起身旁的消防斧直接一斧头砍爆了挡在他面前的冰柜。
//
//摄像机掉在了地上，等到再次被捡起时，四周一片狼藉，Kevin扛着那把消防斧下了楼。
//
//此时，那群围在楼梯口的流浪者还未散去，他们看着Kevin扛着消防斧，包括那名员工在内，无一不目瞪口呆。
//
//视频结束
//
//在此事结束了之后，四楼的家电区得到了重新开放，但任然会受到“断电”事件的影响。Kevin则应聘成为了一名“贻家”家具城的员工，专门负责管理四楼区域。
//
//事件
//在本层中，有时会发生一个名为”断电“的事件，该事件发生时，整个家具城会突然失去电力，陷入一片黑暗中，只有休息区不受影响，并在除三楼以外的区域出现大量的实体，目前已被目击到的实体有：笑魇，钝人，猎犬，死亡飞蛾，悲尸等。同时，位于一楼的巨型玩具熊将会苏醒过来，践踏所有它所看到的流浪者，流浪者只能躲在休息区以免被其攻击。不仅如此，流浪者的听觉与视觉将会受到极大的削弱，在这种情况下的流浪者将无法观察到实体的动向，所以当该事件发生时，建议流浪者选择向身旁的员工求助，员工会尽快的将流浪者带到安全地带。
//
//实体
//除只在“断电”事件发生时出现的实体以外，该层还存在名为“员工”的特殊实体。
//
//员工统一身穿蓝色制服，他们主要分布在家具城一楼，工作是给流浪者们提供导购帮助并在“断电”事件发生时负责维修电源并保护流浪者，员工有时会驱逐长时间呆在休息区或三楼样板房中的流浪者，除了”断电“事件发生时。
//
//他们的真实身份暂且未知，其中似乎有几名后室装修公司的成员。
//
//基地、前哨与社区
//后室装修公司（Backrooms Remodeling Co) 分基地
//约为15人驻守在这里，并不断招收新的成员，主要工作为搬运家具。
//开放交易。
//该层疑似为后室装修公司的进货处。
//入口与出口
//入口
//事实证明，“贻家”家具城在每一个有关城市的层级都有出现，目前已知在Level 11，Level C-28，Level C-151，Level C-195等层级都有“贻家”家具城的存在。
//出口
//如果你在进入后选择立即转身离开，你就会回到原本的层级。
//如果有流浪者在休息区内吸烟，便会直接被员工带到Level C-294。
//如果流浪者在任意一层意外的切入了地板，会来到Level C-345。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1263{}