//Level C-209
//评分: 
//+20
//+
//–
//X
//Level C-209
//已廢棄Level C-209版本
// 
//
//生存難度：
//
// 
// 
// 
//Level C-209是後室C層群的第209層。
//
//描述：
//Level C-209是被藍色通道所滲入、浸染的層級。其大多數部分已被藍色通道取代，該層本來的組成部分，現在皆漂浮在由藍色通道所構成的虛空中。原本的重力大多數已經無效，很多時候只要輕輕一躍，就會飄盪到藍色通道中。
//
//因此建議到達該層的流浪者，攜帶堅韌的長繩來穩固自己的立足點，並能隨時返回該層的安全區域。
//
//該層級主要由以下兩個部分構成
//
//藍色通道交界地帶
//該層除了原本的構成土地外的組成部分，如果飄盪該區域，最終只會飄盪到藍色通道中。區域性質與藍色通道一致。但可以藉由該區域到達Level C-209，藉此回到常規層群中。
//
//板塊浮島
//該層是原Level C-209層的組成部分，其原本的大多數水分，都已經飄盪到藍色通道中，而其中的樹木大多已經枯萎。其補給品極為少見。而原本該層自有的晝夜現象已經消失，並被藍色通道所構成的虛空取代。該層級此區域的非歐幾里德現象已經消失。你可以查閱舊版本中，關於該層原本的樣子。
//
//該層變化沿革
//基地、前哨與社區
//該層級不存在任何已知的基地、前哨與社區，也不適合建立這些結構。
//
//入口與出口
//入口
//如果你在Level 10找到一片果樹林，你可以在此果樹林切入此層。(已失效)
//如果你在Level 11的看到果園田地的標誌路牌，順著走下去。你將會逐漸進入此層。(已失效，原本被確認位置的路牌已經殘破不堪。)
//在Level 37中，往前廳沒有的果樹，或是大量果樹成林的地方，有可能進入此層。(已失效)
//在Level C-7聆聽音樂，有可能切入此層。(尚未確認)
//在Level C-9與Level C-12，及Level C-34中，對果樹嘗試切出，有可能切入到此層。(已失效)
//在Level C-192中，找到一顆綁紅繩的柑橘樹，對其嘗試切出，有可能切入此層。(乃然有效，當前柑橘樹已經枯萎。)
//在藍色通道中找到該層級破碎板塊能夠進入此層。
//出口
//如果你在該層看到往麥田的路牌，順著走會到達Level 10。
//如果你在該層看到往都市的路牌，順著走會到達Level 11。
//如果看到該層有大量非果樹樹種組成之樹林，進入其中待一段時間，你將到達Level 37。
//對於在該層對於果樹嘗試切出，可能切入Level C-9與Level C-12，及Level C-34。
//找到該層中綁紅繩的柑橘樹，對其嘗試切出，有可能切入Level C-192。
//跳離該層的破碎板塊，或是進入該層板塊邊緣的藍色通道中，將進入藍色通道。
//
//
//生存難度：
//
//等級 1
//
// 
// 
// 
//描述：
//Level C-209是一片面積大小約三萬平方公里可食用果樹為主體樹種，所構成的林地。內部有大量非歐基里德空間，除了該層級本有的道路、房舍與林中空地，除此之外的區域，均不維持線性空間。
//
//而在樹林的空曠地帶，通常有一間大小約80到100平方公尺的類農莊房舍。通常這些房舍，會擁有WIFI、普通水。杏仁水通常會置於其中。但注意該層的大多數房舍，缺少可以驅動電子產品運作的電力供應，又或者缺少儲存水的水塔而無法使用。此外房舍中，通常會有著在前廳中，並不存在的農業公司之肥料產品、農業用具、水果大小分類器等農業機械。
//
//同時該層級的房舍之間，會由一條寬約一到兩公尺的碎石子路連接，你可以藉由這些道路找到下一間房舍與人類在該層建立的聚集地
//
//Level C-209擁有的樹種，包含且不限於亞熱帶、溫帶與熱帶樹種，此外該層的樹種包含擁有大量具有食用價值的果樹。
//
//特別需要注意，如果你找到一間門被鎖上，且窗簾緊閉的房舍，請不要嘗試進入其中。通常在你敲門後，其屋內的成年無面靈，會開門並招待你補給品後，請您離開。
//
//此外該層具有大量的無面靈，該層的無面靈與Level 11中的同類，具有同樣的行為。該層的無面靈會主動採摘，其居住房舍周圍的成熟果實，然後儲存於房屋內，並對果樹施肥、澆水等行為。
//
//儘管我們不知道這些果實消失去哪裡，而無面靈們也拒絕回答此類問題。同時該層的幼年無面靈，與其他層級幼年無面靈不同，它們通常與成年無面靈共同出現，且沒有出現攻擊性。
//
//該層級具有大約8小時交替一次的日夜循環。在該層入夜後，會有少量的敵性實體生成。包含、但不限於笑魘、死亡飛蛾、鈍人、獵犬、竊皮者。
//
//需要注意的是，近日有部分居民、流浪者發現氣球的存在，這表示派對客可能在此層活動。
//
//+ 2023年7月18日M.E.G.內部紀錄
//+ 2023年7月19日後室網路廣播紀錄
//基地、前哨與社區
//M.E.G.（探險者總署） 哨所"農舍"（M.E.G. Outpost "Farmhouse"）:
//大約有兩百位M.E.G.成員在此。
//與B.N.T.G.共享設施。
//踪跡製圖者與志願者班組，分別為該層繪製道路地圖，與主要聚集地提供巡邏保護。
//願意為在該層級，建立新的聚集地而提供幫助。
//B.N.T.G. C-209資源貿易站：
//大約有七十位B.N.T.G.成員在這工作。
//主要工作是將該層產出的食物，皆由B.N.T.G.10級資源站轉移到其他B.N.T.G.據點。
//傑瑞的信眾（The Followers Of Jerry）：
//這個前哨站是一個由The FOJ成員組成的團隊。
//大約有三十人。
//主要為組織成員，與傑瑞採集水果。
//這個組織是友好的，除非有人以任何方式侮辱傑瑞。
//B.F.P.F.（後室家居生產廠）蔬果採集站：
//大約有五百位B.F.P.F.成員駐紮。
//在2022年1月9日簽訂部分和平協議以後，維持著有限度聯繫。
//和B.N.T.G.跟M.E.G.嘗試在此層級耕作。
//為其他B.F.P.F.設施提供蔬果。
//在維護該層級聚集地的態度上，與M.E.G.合作。
//紅星建築隊：
//可能是紅星建築隊的分隊。
//大約有四十人。
//會砍伐該層級的樹木，並轉移到其他樓層建設。
//M.E.G.將持續觀察動向。
//最初的薄暮（First Twilight）:
//大約有四十人。
//似乎是C層群的失落一族。
//需要觀察動向。
//Level C-209的公民：
//大約有十一個營地。
//大約有兩千多人。
//由B.F.P.F.跟M.E.G.提供保護。
//入口與出口
//入口
//如果你在Level 10找到一片果樹林，你可以在此果樹林切入此層。
//如果你在Level 11的看到果園田地的標誌路牌，順著走下去。你將會逐漸進入此層。
//在Level 37中，往前廳沒有的果樹，或是大量果樹成林的地方，有可能進入此層。
//在Level C-7聆聽音樂，有可能切入此層。
//在Level C-9與Level C-12，及Level C-34中，對果樹嘗試切出，有可能切入到此層。
//在Level C-192中，找到一顆綁紅繩的柑橘樹，對其嘗試切出，有可能切入此層。
//出口
//如果你在該層看到往麥田的路牌，順著走會到達Level 10。
//如果你在該層看到往都市的路牌，順著走會到達Level 11。
//如果看到該層有大量非果樹樹種組成之樹林，進入其中待一段時間，你將到達Level 37。
//對於在該層對於果樹嘗試切出，可能切入Level C-9與Level C-12，及Level C-34。
//找到該層中綁紅繩的柑橘樹，對其嘗試切出，有可能切入Level C-192。
//
//
//
//
//自U.E.C.突襲了Alpha基地以來，我就沒有休息過。我不斷地再行動，在各個層級切出、切入來躲避U.E.C.的追擊。我不能前往M.E.G.尚未投降的基地。因為我很確定U.E.C.肯定在周圍設上陷阱。
//
//而基地內的人也無法救援，目前M.E.G.成員只能靠自己。杏仁水已經沒了。至少沒有受傷，是唯一可以慶幸的事。
//
//我很清楚投降可以讓我輕鬆不少。但我並不想投降。我不能說M.E.G.是個很好的組織，至少過去他們的積極行動，導致了許多意外事故，甚至造成重大災害。這些並不是不可避免的犧牲。
//
//我很想家，真的很想。我進入了這該死的後室快十五年。我卻不知道該如何離開這裡。在M.E.G.出現前，就有很多自發性的搜索出口的行動。不管是大型還是小型，都以失敗為終。M.E.G.是截止到目前為止，我所知道規模最大、人數最多的出口搜索活動組織。同時他們也拯救了無數無意間進入後室的流浪者。我們不斷地前進、編寫檔案、探索後室。我也是其中的一員，而在M.E.G.的日子，是我重獲新生的日子。它讓我看到了希望。
//
//十五年來，我的時間停滯。我維持著這副十九歲的樣貌，除了身體上的傷痕。甚麼都沒有改變。
//
//而我的家人，甚至可能已經逝去。我甚至未能報答父母之恩，就來到這個鬼地方。
//
//而U.E.C.已經放棄了搜索出口的活動，一個有可能威脅到他們的出口搜索組織是不可能被他們允許。他們要在後室裡建立屬於它們自己的帝國。它們可不會讓未來的子民逃跑。
//
//我打算先跑到Level 140，那裏的情況很複雜，而且也有一些M.E.G.成員到達那裏。我停下觀看數據庫時，一條簡訊寄到了我的手機。我不確定要不要打開它。後室裡通訊用的電子產品，總是會收到奇怪的信息。永遠不要亂打開與回撥。但通知預覽顯示信息只有一句話"打開Level C-209。"
//
//作為惡作劇過於低端，而且我很清楚Level C-209已經在RUSH戰爭幾乎毀滅了。但我還是打開了檔案，幸運的是U.E.C.沒有關閉資料庫，它們很清楚，如果它們真的關閉資料庫，他們將會是後室的公敵，無數人正是因為M.E.G.的資料而生存下來的。
//
//我看的了一個密鑰輸入口，我開始思考這是陷阱，還是有甚麼特殊的含意。
//
//我扔下硬幣，正面輸入，反面當作笑話。
//
//我最終輸入了密鑰
//
//ID	
//Reed 2-17
//密碼	
//••••••••••
//登出
// 
//
//生存難度：
//
//等級 3
//
//不安全
//不穩定
//極少量實體
//Level C-209是後室C層群的第209層。
//
//描述：
//Level C-209是被藍色通道所滲入、浸染的層級。其大多數部分已被藍色通道取代，該層本來的組成部分，現在皆漂浮在由藍色通道所構成的虛空中。原本的重力大多數已經無效，很多時候只要輕輕一躍，就會飄盪到藍色通道中。
//
//因此建議到達該層的流浪者，攜帶堅韌的長繩來穩固自己的立足點，並能隨時返回該層的安全區域。
//
//該層級主要由以下三個部分構成
//
//藍色通道交界地帶
//該層除了原本的構成土地外的組成部分，如果飄盪該區域，最終只會飄盪到藍色通道中。區域性質與藍色通道一致。但可以藉由該區域到達Level C-209，藉此回到常規層群中。
//
//板塊浮島
//該層是原Level C-209層的組成部分，其原本的大多數水分，都已經飄盪到藍色通道中，而其中的樹木大多已經枯萎。其補給品極為少見。而原本該層自有的晝夜現象已經消失，並被藍色通道所構成的虛空取代。該層級此區域的非歐幾里德現象已經消失。你可以查閱上個頁面內舊版本之紀錄，關於該層原本的樣子。
//
//穩固之島
//該層是原Level C-209層的組成部分，並距離板塊浮島區域的外圍，至少五十公里的距離。目前該區域是，該層級中唯一能夠長期維持基地與前哨的區域。並且有大量果樹林與農地乃可使用。
//
//該區域大小約為一百八十六平方公里，主要由九塊浮島構成。並藉由大量穩固的鋼索連結。
//
//基地、前哨與社區
//M.E.G.（探險者總署） Lambda基地（M.E.G. Base "Lambda"）:
//當前有五百位M.E.G.成員駐紮在此。
//Lambda基地是目前M.E.G.的戰時指揮部。
//監督者-Stretch，目前在此處。
//有大量非歐幾里德區域包圍。
//目前可維持大約三個月的消耗。
//失落的大廳協會（The Lost Hall Society）：
//大約有二十三人，與三名噬命之靈在此處。
//與M.E.G.維持和平關係。
//不要隨便接近他們，只有他們邀請你時，才推薦進入。
//入口與出口
//入口
//如果你在Level 10找到一片果樹林，你可以在此果樹林切入此層。(已失效)
//如果你在Level 11的看到果園田地的標誌路牌，順著走下去。你將會逐漸進入此層。(已失效，原本被確認位置的路牌已經殘破不堪。)
//在Level 37中，往前廳沒有的果樹，或是大量果樹成林的地方，有可能進入此層。(已失效)
//在Level C-7聆聽音樂，有可能切入此層。
//在Level C-9與Level C-12，及Level C-34中，對果樹嘗試切出，有可能切入到此層。(已失效)
//在Level C-192中，找到一顆綁紅繩的柑橘樹，對其嘗試切出，有可能切入此層。(乃然有效，當前柑橘樹已經枯萎。)
//在藍色通道中找到該層級破碎板塊能夠進入此層。
//出口
//如果你在該層看到往麥田的路牌，順著走會到達Level 10。(已失效)
//如果你在該層看到往都市的路牌，順著走會到達Level 11。
//如果看到該層有大量非果樹樹種組成之樹林，進入其中待一段時間，你將到達Level 37。
//對於在該層對於果樹嘗試切出，可能切入Level C-9與Level C-12，及Level C-34。
//找到該層中綁紅繩的柑橘樹，對其嘗試切出，有可能切入Level C-192。
//跳離該層的破碎板塊，或是進入該層板塊邊緣的藍色通道中，將進入藍色通道。
//我不知道是否該信任這個消息，這個消息很讓人出乎意料，Lambda基地？
//
//Stretch還活著？
//
//有些過多的信息震撼了我的大腦，當Alpha基地被攻擊後，無數的消息的說Stretch已死。而現在他還活著？
//
//我不知道該如何去面對這個消息。它很大概率是個陷阱，更有可能是某個渾蛋趁著U.E.C.尚未完全掌握數據庫，而創造的惡作劇。
//
//最終，我選擇相信幫助我許多次的硬幣。正面前往，反面不去。
//
//我注視著它騰飛於空中，緩慢的落下。
//
//作者信息
//« Level C-208 | Level C-209 | Level C-210 »
//
//脚注
//1. 為了讓所有人回家，為了讓所有人安全，為了讓所有人活下去。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1209{}