//Level C-281
//评分: 
//+15
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//Level C-281是后室C层群的第281层，分为标本馆与工作室两个部分。
//
//描述
//标本馆
//标本馆部分是一间面积未知的大厅。其中充斥着光线难以穿透的黑暗，只有在靠近地面的部分有着来源未知的微弱光照。M.E.G.曾派遣无人机以探测该层级的高度，但均因超出最大探测范围而失败。大量的标本及其展示台将这里分割成了类似迷宫的结构。这些结构与地面相连，且强行破坏这里的标本会使破坏者被传送至随机生存难度为5或死区的层级。因此，建议流浪者应小心接触馆内的标本。进入该层级的流浪者通常会出现在存放小型普通动物标本的区域，但随着探索的深入，标本的体型通常会变得更大并且其中还会夹杂部分实体以及未知生物的标本。这部分标本对于实体研究有较高的参考价值。另外，需要注意的是虽然标本并非活物，但有些标本依然会对接触者产生各种各样的影响。因此不建议没有学习过实体学专业知识的流浪者过于深入地探索该层级。
//下面是部分已发现的值得注意的标本列表：
//标本	描述	发现时间
//三叶虫	前厅早已灭绝的史前海底生物。保存完好，足肢可以活动。	2017/03/09
//雷克斯暴龙	前厅早已灭绝的恐龙。高5.7米，长13.6米。皮肤经过鞣制处理依然保持柔软。	2019/05/17
//小不点？	推测为小不点的亲族。体长约为2万米。盘踞在一个充满福尔马林的500m*500m*100m的加固水箱中。	2019/07/26
//天使	一个由大量翅膀与羽毛包裹的巨大眼球。具有一定的心理影响，使之无法触碰。	2021/12/25
//注：那个长13米的大乌贼叫大王鱿，在前厅就有广泛分布。请不要再加入此表格了！—— M.E.G.实体学家 Dr. Light
//
//
//标本工作室
//kPZJ6nIKwvaBejo.jpg
//工作室一角
//
//如果在标本馆走的够久，流浪者有较大概率找到一扇可以进入标本工作室的门。标本工作室是一间堆满了制作标本所需工具以及许多经过简单防腐处理的动物尸体的房间，还包含一个小型焚烧炉、一间小型冷藏室以及一个休息用小隔间。整个工作室的空气中都弥漫着淡淡的福尔马林气味。在该房间，M.E.G.的探员回收到了一个严重损毁的可穿戴录像设备。
//
//下面是从修复后的录像设备存储卡中提取的信息：
//
//[数据损毁]刚进入[数据损毁]作室的门就出现在我的面前。听说标本师已经失踪很久了，看看里面有没有什么物资吧。
//
//这是什么！这里怎么会有人类的标本? 眼睛里……是空的……记录里可没说过有这个。
//[数据损毁]
//这是 ……一个笔记本，里面记了什么？
//
//
//1995年8月23日
//
//今天我遇到了一只特别的鸟儿。它有着美丽得无与伦比的尾羽，哪怕它的肉身已然残破，但是我还是能感觉到他在呼唤着我将它留下。它实在是太美了！
//
//
//2001年4月28日
//
//这简直是暴殄天物！这些可恶的野兽怎么能将我可爱的小宝贝糟蹋成这样！好在这对翅膀依然完好……
//
//
//2003年6月7日
//
//这不可能！这完美的肌肉线条与靓丽的羽毛怎么会和这般丑陋的脑袋拼合在一起，造物主一定是搞错了什么……对了！我这里还有一些材料，我得修正造物主的这个小错误。
//
//
//2004年7月13日
//
//我终于要完成了！这集合了我所有技术的至高作品。可是为什么这双眼睛是这样的突兀，我应该再修改一下。
//
//
//2004年12月5日
//
//只差一双眼睛了！只差一双眼睛了！可是尸体的眼睛永远都是死板丑陋的，我需要一双灵动的眼睛！
//
//
//2005年1月16日
//
//今天我正在办公楼区的窗边思考如何改进作品。一只鹦鹉落在了我的手边，它的眼睛盯着我看。在那一瞬间，我想它是理解了我的情绪。我听见它在安慰着我，它说要为我完美的造物献身。
//
//
//2005年1月17日
//
//我的新作终于完成了。它静静地停在展台上，用那双灵动的眼睛看着我。它就好像活着一样……不，它就是活着的……它像新生的雏鸟微微抖动着翅膀，它在适应新生。
//
//
//2005年6月18日
//
//我来到了战壕。这里的环境确实十分糟糕，但我想在这里一定能找到我所需要的材料！
//
//
//2005年11月11日
//
//他们的情绪是统一的，痛苦是统一的，麻木是统一的，灵魂是统一的。战争将一切私人的想法都抹杀。他们终于用生前永恒的对立换来了死后永恒的统一。
//
//
//
//2006年4月4日
//
//如果想要完美地得到积木塔中间的一块积木，最好的方法并非抽走它，而是拿走覆盖在它上面的所有积木……
//
//
//
//
//
//
//- 收起视频记录
//摄像设备摔落在地上
//鲜血在地面蔓延……
//
//标本师跪在那个人类标本面前，标本在他面前轻轻舒展着手臂。它缓缓地弯下腰，使面部靠近标本师。
//[画面缺失]
//痛苦的呻吟，骨骼折断的声音，咀嚼声……
//[数据损毁]
//
//- 收起视频记录
//实体
//标本师 (已失效)
//曾经时常出现在Level 81的实体。外表为颓丧，沉闷，疏于打理仪表的中年男人。收集了大量死于后室的动物尸体用于制作标本，并表示该行为是希望这些动物能以另一种形式生活在后室。于2005年6月左右失踪。根据回收的资料，推测其在2006年4月死于实体——Evin的攻击，故该词条现已失效。
//
//Evin
//标本师的最后一件作品。外表为十几岁少年的人形实体，有着浅灰色的头发与极其精致的外貌，自称为Evin。时常在后室的各个层级之间旅行，但是会回到标本工作室停留。在这里，他似乎会模仿睡觉的行为，但相关测试证实他并没有真正地睡着。当他注意到周围有流浪者的存在，他会请求流浪者为他讲故事，如果该流浪者讲的故事他从没有听说过任何类似版本，那么流浪者可以要求他将自己传送至任意层级。据报告，所有拒绝为该实体讲述故事以及讲述了与该实体所知故事类似故事的流浪者全部失踪，因此M.E.G.建议流浪者尽可能避开该实体。
//
//基地、前哨与社区
//该层没有已知的基地或前哨站。
//
//入口与出口
//入口
//在Level 81进入一扇标有"标本馆"字样的实心木门。
//切入一个位于Level 5某条走廊尽头的雄鹰标本背后的缝隙中。
//在Level C-83的食材仓库中有较小概率找到一条正在发酵的完整鲨鱼，爬入鲨鱼的口中将会在该层级的同种鲨鱼标本的口中爬出。
//出口
//从一个大象标本的身上滑下，将会从Level 283的一处大象造型的滑梯滑下。
//跳入装有小不点？的水箱将会掉入Level 7的水中。
//损坏任意标本馆内的标本会被传送至随机生存难度为5或死区的层级。(不建议)
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1281{}