//Level C-230
//
//
//评分: 
//+31
//+
//–
//X
// 
//
//生存难度：
//等级 永生
//
//安全
//永恒
//不腐
//Level C-230是后室C层群的第230层。
//
//jX45md.jpg
//墨菲•罗斯特尔所摄的Level C-230 。
//
//描述
//Level C-230是一片开阔的海洋，其深度约为1100m，面积约为30000万平方公里。 Level C-230内部有着极强的Wi-Fi信号，其内部由“城池”群构成，类似于前厅中的巨藻林，海面上不存在任何自然的支撑平台。
//
//通常的，以20小时为一周期，Level C-230的海面上会在随机地点漂来11艘长约3.2米，最宽处约1.2米的木船。木船上一般会放置有长度不等的粗麻绳，细线及大小不等的防雨布，物资提供来源目前未知。
//
//经调查，当流浪者切入Level C-230时，其味觉与嗅觉会奇迹般的消失，这种症状似乎会在离开该层级时消失。
//
//基地、前哨与社区
//jjAa90.jpg
//Level C-230的海面上漂来的木船，通常作为开拓者协会据点的一部分。
//
//开拓者协会
//由乘坐在Level C-230木船上的流浪者们构成的组织，目前协会人数已有78人。“开拓者”利用粗麻绳将木船连接在一起，并利用各式工具与材料搭建海上住所。目前该协会成员已搭建了12个木制的漂浮平台，并定期向海中派遣“开拓者”，或将实时影像传输设备固定在部分鱼类上，意为寻找Level C-230的出口，这一活动如今收效甚微。
//M.E.G.补给站（已废除）
//M.E.G.曾经将捕捞到的食物放在20个木制的箱子中，每10天投放一次，用于漂流补给物资，随后因投放漂流物资的不确定性及资源的消耗过大而被废除。
//实体
//由于Level C-230的特殊环境，该层级只存在“城池”一种智慧型实体，其余物种的生物学特征与前厅中的贝类及中小型鱼类完全相同。“城池”被开拓者协会的生物学家墨菲·罗斯特尔发现，且只存在于Level C-230与Level 7中。
//
//据研究，其个体具有低等智慧，且会进行有意识的活动。其个体的外形类似于前厅中的巨藻，体长从30m至1000m不等。且其周围覆盖着厚度约3cm的抗腐蚀胶状物质，目前尚未得知该物质的生成方式。
//
//与巨藻不同，成年的“城池”个体具有坚硬且极具穿透力的“根”。成体“城池”个体会不定期在基部分泌一种油状发光物质，据研究，这类物质会强烈地吸引流浪者并致幻那些被其所吸引的流浪者们。
//
//流浪者们可以采集“城池”个体的某些部分用于食用，其口感被开拓者协会描述为“裹满沙土的皮革。”非紧急时刻建议不要食用。
//
//入口和出口
//入口
//在Level 3中找到一身氧气瓶上标有“Nature”字样的潜水服并穿戴即可切入该层级。1
//出口
//据开拓者协会内部消息，Level C-230的出口似乎处于其底部的某处“岩穴”，该消息尚未得到证实。
//未被证实存在物理层面的出口
//- 收起日志
//墨菲·罗斯特尔的日志
//
//2013/7/2
//这个层级很平常，只是一片海，只有海水感觉有些奇怪，蒸发的速度很惊人。海里长着数以千计的巨藻，说不定这是个只由巨藻林构成的层级？海面很美，可惜我戴着头盔，无法感受这令人舒怡的海风。
//
//2013/7/3
//今天遇到了一群热心的小伙子，他们自称为“开拓者”，还自发组织了“开拓者协会”，总共只有八个人，少得可怜。我和他们们聊了很多，包括那美丽的巨藻林，“开拓者”们说，巨藻深不见底，曾经有人潜到深处，那里全是这玩意儿的“根”。我嗤笑于他们把固着器认成根，不过没什么奇怪的，自然总是千奇百怪。
//
//2013/7/5
//传言说潜到海底的人永远回不来，这要算作传言吗？
//
//2013/7/6
//“开拓者”们最近要进行对海底的勘探，如果我也要算作“开拓者”的话，我实在愿意试一试。
//
//2013/7/7
//他们带了实时录像设备，用于把海底的情况传输给我们这些在船上的人，他们已经在欢呼声中一跃而下了。
//
//2013/7/8 7：05
//设备传输过来的画面，我实在不敢相信这是真的，海底有着近乎万数的尸体，绝大部分是人类的，那些巨藻的根深入了这些尸体，这绝不是巨藻。
//他们没有回来。
//
//2013/7/8 20：34
//这些“巨藻”拥有坚硬无比的根，这不可思议，他们如同城池一般，是这样磅礴，密集。我喜爱“城池”这个名字。
//我要一探究竟。
//
//2013/7/9
//我利用潜水服内的传声装置，将我的话记录在那本日志上。
//我到达了临近海底的地方。
//往下望去，黑漆漆的一片，只是充满着水与叶片。
//海底有时不时飘动的萤火。
//它们在爬行。
//为何要被一层头盔限制永恒?
//突破机械的屏障，拥抱真正的永恒。
//福尔马林。
//灼烧!我在灼烧!
//海底有不腐的尸体，有永恒的自然。
//我看到了出口，那是美丽的岩穴，人类的温床。2
//脑海中有声音指引我：跳。3
//我是墨菲·罗斯特尔。
//我与自然共生。
//
//jX5UAI.jpg
//“唯有开拓永恒。”
//致我们的开拓者
//墨菲•罗斯特尔
//
//B.Q.I. Inspection certificate展示区
//
//BmUdsXUz.svg
//经B.Q.I.检验，该层级各项指标均符合要求，为其颁发检验合格证书，
//
//B.Q.I. Inspection certificate编号：B.Q.I. Inspection certificate C-003
//
//检验项目：Level C-230	颁发日期：2021年12月18日
//颁发人员：X1193	截止日期：2022年12月17日
//作者信息
//« Level C-229 | Level C-230 | Level C-231 »
//
//Footnotes
//1. 该潜水服的材质具有不可破坏性及强大的抗压性，且当流浪者穿戴该潜水服进入Level C-230时，直至离开该层级该潜水服才可被脱下。
//2. 为纪念墨菲·罗斯特尔女士对Level C-230的探索作出的卓越贡献，此“岩穴”被开拓者协会命名为“墨菲岩穴”，经勘测，“墨菲岩穴”为Level C-230底部一座正在剧烈活动的火山的火山口。
//3. 疑似受到油状发光物质的致幻效果影响。
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1230{}