//Level C-278
//评分: 
//+10
//+
//–
//X
// 
//
//生存難度：
//
//等級 2
//
// 
// 
// 
//於入口處向遊樂園門口拍攝
//(長按放大瀏覽)
//
//Level C-278是後室C層群的第278層。
//
//描述
//Level C-278是一座整體結構與自然環境融合的遊樂園廢墟，該層級雖有日夜循環，但天空時常呈現異常的深綠色，光照變化極為不明顯。
//
//該層級的入口處位於園區位址的半山腰；該處為一座平面停車場，由於夜晚容易聚集大量的猎犬不建議流浪者逗留。
//
//在停車場東南方500公尺的階梯，是通往遊樂園唯一『安全的』通道；尚不確定進入樂園是否仍有其他管道，不建議流浪者隨意勘探以免遭遇猎犬與紅杉妖精的襲擊。
//
//園區異常現象
//園區中的設施到凌晨3:00時會以未知的形式重新運作，但以免發生危險故不建議乘坐。
//
//室內餐廳中生成的食物經檢測發現具有大量的致幻、麻痺毒素，且急劇成癮性。過量服用將導致神智不清、痛覺神經損壞、具攻擊性且該毒素能藉由啃咬進行傳播。但白天時有極低的機率生成一塊皇家口粮。
//
//魔童
//園區內時常出沒此類的人形實體，主要特徵是外貌接近6到10歲的孩童，通常肢體都會出現殘缺。該實體不會對人類產生敵意，但會主動要求人類陪同去尋找他的母親，只是往往都會將人類帶離園區送到更深處的森林中，隨後便會遭遇紅杉妖精。一旦人類回應魔童即使是拒絕，實體都能以催眠手段使人類無法拒絕的跟隨牠。
//
//而上述現象包括室內餐廳的食物到白天時都會同步消失。
//
//基地、前哨與社區
//該層級不存在已知的基地、前哨和社區。
//
//入口與出口
//入口
//Level C-22由北面的大門出去後有機率切入該層級
//Level C-228在出口處（成功激活的情況下）停留三分鐘，便會得到一份園區遊覽地圖，打開後便會切入該層級。
//出口
//於園區南邊的女廁第三個隔間中，先關上門隨後拉下沖水，之後打開廁所門將會切入Level C-82
//在園區北邊的過山車等候區，擲3次以內三顆骰子1皆是6的情況下2便能切入Level C-8。
//進入園區東邊的海盜船設施便會切入Level C-214
//進入園區西邊的鬼屋設施走到深處，打開工作人員專用通道的門會切入Level C-444。但鬼屋設施中常有大量的魔童及紅杉妖精出沒，還請流浪者格外小心。
//作者信息
//« Level C-277 | Level C-278 | Level C-279 »
//
//Footnotes
//1. 關於骰子可以使用自帶、自製的，若未攜帶您能在園區中心的周邊商店中找到。
//2. 雖尚未得到證實，但據過去的流浪者表示唯有等候區，實現三次骰到18點的機率高達90%
package lvls12x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1278{}