//Object C-71 - “安全睡袋”
//评分: +17+–x
//统合物品分类系统
//物品编号 #：C-71
//位置：全境
//安全性：安全
//用途：
//防护/休整/探索
//状态：
//可获得
//Object C-71可以让流浪者在较为危险的层级中获得一个安稳的睡眠。
//
//photo-1558477280-1bfed08ea5db?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=688&q=80
//Object C-71的一个典型实例
//
//描述
//安全睡袋颜色不一定1，但外形一般与前厅中的睡袋一致。睡袋通常长1.9米，宽0.5米（摊平），其表面一般为尼龙或塑料制成，其因为未知原因变得极为坚韧，需使用锋利的小刀才可以艰难地切割开，可以抵御部分常规实体的攻击。然而，这种材料一旦离开了睡袋主体，其性质就会变得同普通尼龙/塑料一致。安全睡袋的内衬为一种极其细腻的织物，据使用过的流浪者声称，在其中睡觉时感到十分安稳，以至于可以迅速进入睡眠。在表面与内衬中填充有一种未知动物的羽毛，使得睡袋的保暖性极强。睡袋一端有开口与拉链，可以供使用者自由进出。
//
//
//其他特性
//即使在睡袋里紧闭拉链，也可以有较好的透气性。
//隔音性优秀，可以有效阻止睡袋内不高于55分贝（dB）的声音传出。
//实体似乎会无视拉上拉链的睡袋（包括其中的人类），只要其没有做出大幅度动作或传出声音。2
//睡袋的耐火性不佳，且不可燃，表面材料可被融化，因此应急时可以使用打火机进行切割。
//睡袋似乎可以一定程度上地抑制悲尸循环
//photo-1506303185793-7b5fe8035d04?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=954&q=80
//Object C-71卷起来时
//
//使用
//将安全睡袋上的魔术贴打开，并展开睡袋。你可以打开睡袋头部的拉链并进入睡袋内部。打开或关闭拉链睡觉皆可，若你选择拉上拉链，建议在睡袋外粘帖一张便条，以防其他人错认为裹尸袋。此外，我们建议搭配Object C-21使用，它会在实体到来时提前提醒您。你可以将它装在玻璃瓶中，鉴于睡袋的隔音效果，此举是安全的。当你不需要使用睡袋时，你可以将他卷起并扣上魔术贴，然后随身携带。
//
//在应急状态下，安全睡袋也可以作为临时防护衣。当你需要这么做时，你可以用打火机对其进行简易加工。将睡袋的两端用打火机烧下，随后将剩下的部分切割3成三部分，两小一大，再用撕扯成布条的内衬捆绑固定在身前与双臂处。若固定得当，理论上制成的防护衣可以抵御一般的刀砍、刺与实体撕咬。剩余的内衬布料也可用于止血。
//
//
//寻找与发现记录
//安全睡袋于2008​̴.10.23在Level C-407中被发现。理论上安全睡袋可以在任何层级内被发现，但似乎其在越安全的层级中生成概率越高。建议在捡到后先清洗再使用。
package wupin;

public class anquanshuidai1071 {

}
