//Object C-69 - “安瑟的信物”
//评分: +18+–x
//物品编号：C-69
//
//位置：派对博士的办公室
//
//分类：物品 – 丙级
//
//O69.jpg
//“安瑟的信物”的外观。
//
//描述：
//安瑟的信物是暗色博士安瑟在红星建筑队处得到的一把钥匙。在安瑟和派对博士帕尔特来到M.E.G.并第一次参与M.E.G.庆功宴上时，安瑟拿出了Object C-69并表示作为挚友的礼物将其送给他。帕尔特收下后放在了办公室里的某个橱窗内。
// 
// 
//Object C-69的神奇之处在于，当有两人因为意见不合而争论不休，甚至即将大打出手时，让两人分别手握着钥匙两端，并使钥匙向任意方向转动180度，两人将会对对方表现出歉意和理解，往往两人会在各自的立场上各退一步，双方的矛盾因此解除，两人的关系将回归正常。在接下来的一周以内，若为上述两人制造矛盾，两人将会以不论任何理由始终站在同一方。暂不清楚对其他实体是否有效。
// 
// 
//由于Object C-69能有效缓解执行任务中的矛盾，因此帕尔特经常会在研究所出现纷争时使用这把钥匙化解矛盾。为M.E.G.的科学研究保驾护航。
//
//附录：
//你好，我是安瑟。
//
// 
//感谢安泽同志代表红星建筑队将这把钥匙送给了我，这是他们对我，更是对M.E.G.的友谊的象征。安泽同志希望我能将这把钥匙送给我生命中最重要的人，因此我选择送给了帕尔特。帕尔特之后告诉我，它想让这把神奇的钥匙造福更多人，而不是当作孤高的宝物收藏着。一开始我是不太情愿的，因为这份礼物最重要的意义，对于我来说仅限于我和它两人之间，这种意境一旦有第三者的加入，就会被破坏。不过当我深思熟虑以后，我觉得帕尔特其实也并无道理，安泽同志交给我时，它也希望这把钥匙能在M.E.G.里作为建筑队的友谊的象征，我这么做未免也太自私了。
// 
// 
//于是我告诉帕尔特，既然送给了它，那无论怎样使用，我都会支持它。它听完我的观点后很是感激，找到了两位因为一次实验而意见不合的两位研究人员，并成功的化解了他们的矛盾。对此我们都感到十分自豪。时至今日，我们已经用这把钥匙化解了许多矛盾，我想这也是安泽同志愿意看到的情景吧。
//
//实验记录：
//两位匿名博士在争吵后1小时内使用Object C-69按照规定进行了操作，操作完成后，两人的态度发生了极大的转变，很快便在友好的沟通下解决了问题。自此一周内再无出现争吵的现象。
//[数据隐藏]A和[数据隐藏]B是一对夫妻，感情上出现裂痕，冷战时间长达半个月。在M.E.G.组织的劝说下，A与B使用Object C-69按照规定进行了操作，操作完成后，双方关系很快重归于好。
//“狂野战士”兵团某分部出现暴乱现象，[数据隐藏]博士借用Object C-69对每位军人按照规定进行了操作，操作完成后，该分部在次月“最佳部门评选比赛”中一跃几十名，斩获冠军。
package wupin;

public class anshedexinwu1069 {

}
