//package wupin;
//
//public class antefeitihanpian1110 {
//
//}
//PLS-IV-110 - “安特非提含片”
//评分: +17+–x
//统合物品分类系统
//物品编号 #：PLS-IV-110
//位置：帕拉斯研究所
//安全性：安全，不稳定
//用途：
//医疗及劳保用途
//状态：
//可量产
//物品编号：PLS-IV-110
//位置：帕拉斯研究所 & 小范围外部流通
//描述
//PLS-IV-110在药理学上被命名为安特非提含片。产品呈淡黄色，圆形，每瓶装35片。此类药物可以十分有效地抑制麻醉药、麻醉品、催眠药和酒精的神经抑制作用。所有此类药物都可引起深度精神作用，包括专注性、积极性与主动性，欣快感、疲劳感抑制。同时由于此类药物的异常性质，短时间内使用者的新陈代谢与血液流速会被成倍数加速。由于神经元链接迟滞，使用者会出现欲望低下的现象，本品测试起效时间10-15分钟，标准有效时间为8至14个小时。
//
//以下为帕拉斯研究所方面节选的一些使用人员回复，有助于流浪者们了解安特非提含片。
//
//发信人:ihatework@backmail.com
//收信人:plstechnology@backmail.com
//主题:关于物品PLS-IV-111“安特非提含片”的试用反馈
//效果不错，使用后让我连续工作了整整10个小时。
//劳保良品，强力推荐！
//——一位建筑工业从业人员
//
//发信人:workinthemine@backmail.com
//收信人:plstechnology@backmail.com
//主题:关于物品PLS-IV-111“安特非提含片”的试用反馈
//药很强，但是情况很不理想。
//药物过强的抗疲劳效果让我连续两天没有睡觉，我的心脏感觉要炸了一样的痛。
//一般，不怎么推荐。
//——一位矿工
//
//发信人:doctorsiyu@backmail.com
//收信人:plstechnology@backmail.com
//主题:关于物品PLS-IV-111“安特非提含片”的试用反馈
//我不是来打消你们的积极性的，但是我不得不说一个事实。
//我们所有部门都存在额外完成工作就能获得奖赏的情况，显然这种让人长时间不睡觉同时保持工作效率不变的药物是所有想多赚钱的人的最优解。
//可是这种药物目前被大量滥用了，长时间没有充足睡眠同时高强度工作加上药物刺激，已经有16个工人被送进急救室了。
//我们设法拯救他们，但还是有3位工人因心脑血管破裂而死了，我们必须严格监管控制这些药物！！必须做点什么！！
//——帕拉斯研究所急救室医生
//
//附录：
//安特非提含片的药理说明书（节选）
//安特非提含片的规格：35片/瓶
//安特非提含片的作用功效：
//安特非提是一种强效中枢神经兴奋剂，通过影响突触神经元对肾上腺素和多巴胺的再摄取等机制，以及暂时性阻断脑神经对身体各处疲劳感的感知来抑制疲劳感。安特非提左旋构体相比于右旋构体更具药理活性。
//
//安特非提含片的普遍用途：
//本品用于抑制人类的疲劳感及提升工作效率，提高使用者的工作时长。
//
//在符合PLS-VI诊断标准的18-30岁志愿者参加的三个对照试验中证实了本品对于弥补人类注意力及思维障碍，提高使用者的反应速度的功效。当咖啡因等促醒类药物效果不佳时。本品可作为药理解决方案的一部分。对弥补人类注意力及思维障碍的解决方案可能还包括其它措施(如：物理的、心理的和外部的)。应根据PLS-VI标准或者PLS-IV的规定。并基于使用者的病史和体质分析做出诊断。
//是否使用本品需依据对每名使用者面对状况的严峻性的全面评估，并非所有情况下均可以使用本品。
//
//安特非提含片的不适反应：
//呕吐、腹泻、以及使用过量导致的胃不适等。
//然后是皮肤方面，可能会有：起皮疹，局部化脓，内出血症状。
//其他记录不适反应：头痛，神经紊乱，癫痫，心肌梗死。
//
//安特非提含片的不适人群：
//
//1.孕妇及哺乳期妇女禁用。
//
//2.对本品过敏者禁用。
//
//3.皮肤大规模破损者禁用。
//
//4.心脑血管疾病者禁用。
//
//安特非提含片的其他注意事项：
//
//1.心脑血管类疾病或疾病史禁用此药物。
//
//2.不要长期大量使用或一次性使用过多本药。1
//
//3.劳动过多者或长期大量劳动者请慎重使用本药。
//
//4.请不要在使用本药品后使用任何活血类物品。
//
//安特非提含片的药理毒性：2
//1.缓解疲劳：明显的加快人体及部分实体的新陈代谢与血液流动速度，能够缩短人体新陈代谢间隔期，对人体动脉血管调有明显的膨胀作用。
//
//同时从神经层面抑制疲劳感，但药效消失后产生的疲劳感将无法避免。
//
//2.增加脑活力：对脑中褪黑素产生了强烈的对抗反应。明显刺激神经元加快交换，加快了脑部血液的流动速度，小脑活动明显，有一定的减少人脑毛细血管急性血栓形成的作用，使脑中及人体皮肤处流出血液更不易凝结。
//
//作者信息
//« PLS-IV-109 | PLS-IV-110 | PLS-IV-111 »
//
//脚注
//1. 建议在一周内将本药的使用量维持至1片/2天。
//2. 主要以志愿者及其他人型实体实验结果作为结论得出。
package wupin;
public class antefeitihanpian1110{
}