//Object 25 - “巴别润唇膏”
//描述
//xtvbPsfZg4dcp28.jpg
//三支无盖的巴别润唇膏1
//
//巴别润唇膏是一种可以在无标签的红色胶囊中找到的物质，外表类似于标准的润唇膏。
//
//胶囊长度约为4~8cm，宽度不超过2cm，巴别润唇膏胶囊通常出现于 Level 0。Level 3、Level 4 和 Level 11.
//
//胶囊中的物质微不透明，呈白色，稠度与标准润唇膏类似。其释放出少量可见光可在黑暗中被看到，这一光亮不会明显照亮附近环境。
//
//性质
//如果将其涂在嘴唇或靠近嘴唇处，巴别润唇膏将让使用者可被听音者理解他的意思，而不会出现语言障碍。听者会认为使用者在说他们的母语，使用者的嘴唇运动会和听者认为的语言相同。然而这一效果无法让使用者理解听者（在听者未涂巴别润唇膏的情况下）的话，故讨论时应允许多人使用。
//
//另外，如果将巴别润唇膏涂在实际存在的文本上，文本对任何潜在的读者来说都是可读的，这只适用于书面/印刷文本，对数字媒体文本不起作用。
//
//巴别润唇膏效果持续时间取决于使用情况而有所不同，多语言前哨进行的非正式实验表明巴别润唇膏效果可持续10分钟~2小时不等。
//
//巴别润唇膏和常规润唇膏同样可以用于滋润干裂嘴唇，使用者称该润唇膏的味道类似于原味的“有俏唇润唇膏”2。
//
//用途
//巴别润唇膏的其他用途还有待探索，但目前它常用于前哨的通信。探险队通常供应巴别润唇膏，用于在前哨进行交易并在新的流浪者进入后室时使用。
//
//巴别润唇膏也同样用于流浪者发现使用其他语言书写的废弃日记时的翻译，你可以在前哨的标志和文档中配备巴别润唇膏以更方便的阅读。
//
//M.E.G. 成员想知道巴别润唇膏是否可以用于实体的沟通，即钝人、无面灵 与 笑魇。然而目前没有找到一个安全有效的方式去讲巴别润唇膏用于这些实体，由于实体缺乏嘴唇，人们怀疑巴别润唇膏无法对它们起作用，尽管一些 M.E.G. 人员仍对此感到好奇。
//
//实验
//M.E.G. 已经对巴别润唇膏进行了数次实验以掌握所有用途，下面是这些实验的记录以及结果。请注意，未经允许而使用巴别润唇膏进行的实验没有被记录，这些所谓的“实验结果”也没有经过验证。
//
//实验 25A-1：所有观察这场实验的 M.E.G. 成员都说英语，另两名 M.E.G. 成员被涂上巴别润唇膏：其中一人只会英语（E-1） 而另一人只会俄语（R-1），E-1 被涂上巴别润唇膏并似乎在说英语，R-1 声称可以完全听懂 E-1 说的话。
//实验 25A-2：所有观测这场实验的 M.E.G. 成员都说俄语。重复实验 25A-1 的程序，结果十分类似，只是现在 E-1 和 R-1 都被观测到在说俄语。
//实验 25A-3： 一名会说英语和俄语的 M.E.G. 成员对该实验进行观察。重复实验 25A-1 和 25A-2 的程序。 E-1 似乎在说英语，R-1 似乎在说俄语，但 E-1 和 R-1 都声称他们可以完全理解对方。E-1 和 R-1 被要求尽可能长时间地进行对话，大约一小时的交谈后，E-1 和 R-1 突然表现出困惑并声称他们无法再理解对方在说什么，尽管他们说的语言与一小时前相同。
//实验 25B-1：说英语的 M.E.G.成员们发现了一名使用普通话流浪者留下的日记页。将巴别润唇膏涂在页面一角后，整个页面的文字突然逐渐给人使用英文写成的感受。页面上写着“找到一些含糖的水。喝了它，我的头上的疼痛消失了。希望我甩掉了那些阴影里的怪物。” 15 分钟后，文本恢复为初始语言。
//实验 25B-2：一名说英语和西班牙语的成员（S-1）将手机短信发送给一名说英语的成员（E-2），内容是“Hola Quiero ver si esto trabaja3”，巴别润唇膏被涂在 E-2 的手机屏幕上，数分钟等待后，E-2 感到沮丧并表示这一信息并没有发生改变，测试结果不确定。
//实验 25C-1：一支由三名 M.E.G. 成员组成的小队配备驱笑剂以及三支巴别润唇膏前往 Level 2并试图与一笑魇（ES-1）交战，ES-1 现身后，两名队员试图在 ES-1 嘴上涂抹巴别润唇膏，但被攻击前无法被涂抹，第三名队员使用驱笑剂驱逐了 ES-1。
//实验 25C-2：两名 M.E.G. 成员探索 Level 0 以寻找一个钝人（ED-1）。ED-1 最终被找到了，正如预期的那样，它注意到这两个成员时就开始逃跑。其中一名成员急忙涂抹了一些巴别润唇膏并喊道：“等等！”。然而 ED-1 并未停止奔跑，但它回头看了一眼那个喊话的成员，而后瞬间就消失在角落里。至于 ED-1 为什么回头看，尚不清楚 M.E.G. 成员是否真的听懂了，还是这只是 ED-1 对声音的反应。
//实验25C-3：一名成年无面灵（EF-1）徘徊在 Level 0 的 M.E.G. 前哨。前哨一名成员在自己的脸上涂抹了巴别润唇膏，并询问 EF-1 它想要什么。但并未得到回应，该成员拿起巴别润唇膏，试图涂在 EF-1 的下半脸。EF-1 在巴别润唇膏接触到自己的脸之前抓住了它，强行将其扔掉，并跑出前哨。
//M.E.G. 计划在不久的将来对巴别润唇膏的能力进行进一步的实验，特别是对实体的影响。
//
//作者信息
//« Object 24 | Object 25 | Object 26 »
//
//脚注
//1. 译注：「巴别塔（Babel Tower）」是基督教典籍《圣经》中的建筑物，人类试图建立这一「塔顶通天」的建筑物以向上帝彰显自己的权威，于是上帝「变乱人的口音，使他们分散在各地」。
//2. 译注：美国润唇膏品牌。
//3. 译注：即「你好，我想看看这是否有效」package wupin;
//
//public class babierunchungao25 {
//
//}
package wupin;
public class babierunchungao25{
}