//Object 47
//800px-Sega_Master_System_Rank_Arena.jpeg
//运行中的 BackROM 游戏机
//
//物品编号：47
//
//
//存放位置：Level 40
//
//
//威胁等级：不定
//
//
//Object 47-A:
//Level 40 内有各式各样的街机游戏，但最神秘、最受喜爱的，还属 Object 47。许多 Level 40 内的流浪者将其称作“BackROM”1。游戏机本身，即 Object 47-A，并不会产生过多异常效应，但是在运作时会使周围环境轻微变色，呈紫、绿色调。机器顶端有一小型 LOGO，LOGO 下方印有“BackROM”字样，不过 LOGO 本身似乎与任何团体或个人无关。
//
//640px-ViC20_Cartridge.jpg
//一块 Object 47-B，标题为 CLOWNS（小丑）
//
//Object 47-B:
//Object 47-B 指多块小型2游戏卡带，表面印有各色图样与文字。卡带在与 Object 47-A 分离时不会产生异常现象3；但只要插入 Object 47-A 内，卡带的异常属性就可能影响到周围环境、卡带使用者，或其自身。很多 Object 47-B 都不会产生益处，常常会伤害到使用者。由于表面风化，有时难以辨认启动了哪款游戏。不过，据传 Level 40 内的 “B.N.T.G. 资源前哨”与“Starflare 上将的太空学者”两团体成员都不顾风险利用着 Object 47-B 能来带的益处。下方列出部分 Object 47-B 游戏卡带。为保证各位流浪者的安全，请尽力将新发现的卡带加入其中。
//
//GAM
//
//unknown%20%281%29.png
//“GAM”的实机截图。
//
//“GAM”乍看之下不具危害性，外表不易辨识。唯一的特点是卡带下方有一小型凹槽。“GAM”的游戏内容并不特别，类似一款“物理模拟器”，玩家可以在游戏内的 3D 环境中操控数个物体。游戏制作似乎十分急促，背景还没附上材质，呈现黑白方格状，游玩时难以判断方位。
//
//游玩过“GAM”的流浪者会受到若干异常效应的影响，一般经 12 小时才会逐渐消退。下方按出现时间顺序排布了各个效应：
//
//极度不安或偏执
//出现幻觉，看到他人头部变成了茶壶
//非常想要喝茶，尤其是格雷伯爵茶
//突然呕吐
//12 小时过后，受害者会突然昏迷不醒；据一些人所说，他们在这期间梦到了 Blanche 来访。不过这种说法并不可靠，如果只是为了同 Blanche 聊天，不建议游玩这款游戏。
//
//DEATH GUY!!
//
//Screenshot%202022-06-10%2011.30.34%20AM.png
//“DEATH GUY!!”的实机截图。
//
//“DEATH GUY!!”（死亡老哥）不论放在何时都算得上极其优秀的游戏。凭借优秀的游戏玩法、完善的互动故事、惊人的游戏画面，“DEATH GUY!!”一举拿下了 9990 亿个游戏奖项。你想不想成为死亡老哥，在游戏里对着丧尸们大杀特杀？！# ！他们偷走了我e的秘方，引起了丧尸危机，一定要杀a光他们！拿起你那把丧尸屠戮9000TM，干碎他们的屁股！！！！！！不玩的就u是坏人4。
//
//CLOWNS
//
//Icon_smile_clown.png
//“CLOWNS”的游戏标志。
//
//“ClOWNS”（小丑）的游戏卡带样貌较为普通。卡带表面有三个向右的箭头，指向一侧的游戏名，顶端有 Commodore 64（一款 8 位家用电脑）的标志。将卡带插入 Object 47-A 后，使用者会立即失去意识并昏迷 48 小时。据尝试游玩这款游戏的人士称，他们在昏迷期间做了非常真实的梦，梦到他们和一些带着小丑面具的人碰头，接着去往银行抢劫。这一体验的相关信息并不好收集，卡带使用者在梦中的体验太过强烈，一旦讨论此事总会引起激烈的情绪崩溃。我们唯一了解的信息是从梦中醒来的方式：使用者会梦到自己被枪击，随后立刻苏醒。
//
//值得注意的是，梦中抢来的物品在使用者醒来后也会出现在现实中，不过这些物品较梦中会发生一些变化。下方列出一些梦中的物品及其在使用者苏醒后变成的样子。
//
//抢到的物品	现实中出现的物品
//各类钻石	一小瓶酸液
//金块	装满沙子的钱包
//美元	橡树叶
//各类武器	杏仁口味饮料
//ATM机	浴缸
//Totally Finished Game
//
//Totallyfinishedgame
//“Totally Finished Game”的图片，游戏已损坏。
//
//该游戏卡带似乎经受过破坏。卡带上有划痕和燃烧过的迹象，内部电线外露，不断滴出某种液体，推测为电池酸或冷却液。卡带表面有黑色记号笔标记，似乎是匆忙写就，内容为“Totally Finished Game”（绝对做完了的游戏）。卡带一侧有小字标注“Full game not included”（本卡带不包含游戏全部文件）。游戏内存在很多故障，大部分功能无法实现。游戏漏洞过多，无法一一列举，此处列出数个较为重要的。
//
//打开标题界面时，显示出的文字有小概率会更换为游戏内其他任意一处的文本内容。
//尝试进入游戏关卡时，可能无法加载地图，使得主角一直处于下落状态。解决办法是重启游戏。
//完成任意关卡后，游戏可能还原一切设置，导致进度清零。
//该游戏有很多内容缺失，包括最终关卡、一些首领敌人、设置菜单、大量子画面等。唯数不多能显示的子画面有游戏主角（一个无面灵）以及一些关卡的地面、背景，其他子画面则没有材质覆盖。游戏玩法类似“马里奥兄弟”“刺猬索尼克”等普通的横板卷轴跳台游戏。
//
//游玩该游戏约两小时后，使用者会受到异常影响，表现得仿佛自己出现了“故障”，比如说话时突然卡顿、若无其事地使用一些不存在的词汇、周期性发出类似电脑故障的声音；这些“故障”还会影响到使用者的行动，他们会不时摔倒，还会做出各种无意义的动作，比如不停地原地跑步，或者嘴巴一开一合，不断打手势，仿佛在和人说话，但全程不发出声音。
//
//隐藏模板 (-)
//你好，这里是文章作者！如果想把自己的游戏添加进文章该如何做呢？
//
//首先，复制粘贴下方的代码，根据需求更换文字。
//处理好之后呢，找到现在文章里的最后一个游戏，把你的内容写到后面。
//之后，别忘加分割线（——）。
//最后，把你和你使用的图片、授权信息加入“作者”部分。
//
//至于具体内容该写什么，完全由你自己决定啦！
//不过一般来说，可以写一些游戏卡带的样子、游戏内容、游戏带来的异常效应。
//要是不确定你写得如何，也可以先给我看看，Wikidot 和 Discord（PinDead#0888）都可以联系到我。
//
//感谢查看这部分内容，希望能见到大家添加的游戏！
//
//[[div class="blockquote"]]
//[[size 186%]]你的游戏标题[[/size]]
//
//[[div class="scp-image-block block-right" style="width:300px;"]]
//[[image 图片名或URL style="width:300px;" link=#]]
//[[div class="scp-image-caption" style="width:300px;"]]
//图片描述
//[[/div]]
//[[/div]]
//
//----
//游戏描述放在这里。应该包括卡带外形、游戏内容、异常效应。  
//[[/div]]package wupin;
//
//public class backrom47 {
//
//}
package wupin;
public class backrom47{
}