//package wupin;
//
//public class baikerusi1187 {
//
//}
//Object C-187 - “白客乳丝”
//评分: +7+–x
//物品编号：Object C-187
//白客乳丝是有识血肉用于传输思想、访问无限思维站点的工具。同时该技术被其盟友躯所用于制造生物计算机与连接互联网。
//
//描述：
//白客乳丝为乳白色的丝网状物品，略显半透明，内含大量神经细胞，边缘包裹有其他细胞为其提供保护与养分。其生产工艺被有识血肉保密。
//
//组成该物品的丝状部位被称为“乳丝”，“乳丝”内芯部位的神经细胞经过特殊改造，信号传输速度较正常人类神经细胞约快10倍，且能承受较大程度的拉伸。每根丝截面直径约为1.23mm，表面对生物体具有一定粘性。“乳丝”可以接收并传输使用者的脑电波，“体外型”和“体内型”的白客乳丝所使用的接收方式不同。
//
//白客乳丝的某些部分具有一片不透明且无孔隙的较厚区域，内部含有大量基因组难以识别的细胞。此类器官被有识血肉称作“白饼”。
//
//经测试，确认“白饼”为汇集“乳丝”传输的信号、编码、发送信号及接收、解码WiFi信号的器官。该器官可实现“汇集’乳丝’的神经信号->将神经冲动信号编码为电磁波信号->发送信号”的发送过程和“接收信号->将电磁波信号解码为神经冲动信号->将信号输入大脑”的接收过程，详细原理暂未探明，据有识血肉称，白客乳丝中的改造细胞能通过特殊细胞器组成微型信号共振阵列，对特定频率电磁波产生反应，从而实现接收和信号解读。
//
//白客乳丝分为体外型和体内型。
//
//体外型白客乳丝，为可多次使用的物品。欲使用体外型白客乳丝，首先需将其套于头上，让每根“乳丝”都紧贴头皮。“乳丝”末端将分泌一种未知化学物质，诱导脑部神经产生神经冲动的同时产生向外部散发一种未知形式的波动供“乳丝”接收。
//
//体内型白客乳丝为永久植入性物品，使用一种由有识血肉特殊改造的细菌于大脑表面进行铺设。将体内型白客乳丝铺设菌注射入血液后，该菌将随血流快速到达脑部，穿过血脑屏障，最终到达脑组织表面。此时，铺设菌将开始分裂，当数量达以足够形成完整的白客乳丝时，覆盖于脑组织表面的铺设菌将开始分化为组成白客乳丝的各类细胞。在整个过程中，铺设菌将分泌出具有麻痹功能的化学物质，避免安装者感到疼痛。
//
//用途
//白客乳丝被有识血肉广泛用于将个体思维与所谓“无限思维”连接，同时“乳丝”相关技术也被躯用于制作血肉计算机和需要进行思维链接的其余工具。
//
//- 关闭
//快抛开那些笨重、冰冷的无机物终端吧！我们的白客乳丝让你不再需要担心用于连接无限思维站点的终端的损坏和丢失！白客乳丝让你的大脑成为可直接连接无限思维的终端！现在下单，体外型只要51.4升杏仁水，体内型只要40.4升杏仁水!
//
//获得途径
//可于躯和有识血肉处购买。
package wupin;
public class baikerusi1187{
}