//package wupin;
//
//public class baixingzhishi1013 {
//
//}
//Object C-13 - “白星之矢”
//评分: +14+–x
//物品编号：C-13
//位置：全境均有可能遇见。
//描述：
//形态：白星之矢，为一根高亮度且半透明的箭矢状物体，目前随着时间的推移轮廓越发清晰，颜色越加接近纯白。其出现时间地点尚未发现确切规律。
//
//特性一：已知其出现之处，约过一个星期后，周围以20m 30m 50m作为直径，会形成一个存在特殊影响的球形区域。具体表现为，区域内不遵循一般物理法则，凭空出现带有严重受损的事物和拙劣的仿人工产物，大部分后室实体会避开区域并显露出恐惧，以及区域空间内事物的突然消失、蚀毁、破碎等等情况。据报告，影响区域有逐渐扩大的倾向。
//
//白星之矢，其自身则无法以物理手段接触，会在出现之时会缓慢地向一方移动。它仅能被部分智能生物，特别是来自前厅的人类，用肉眼观察到；且其大小方向及距离不会随着这些个体的移动而改变，亦即总固定悬浮于个体的前方。而任何个体在直接观察到其时，会异常地产生惶恐的情绪和幻觉与谵妄，并试图朝它飞行的方向追赶跑。在个体奔跑一定时间后，所受到的认知危害之类的症状会随着对白星之矢感知的消失而消失。但在此期间个体因各类原因，例如试图利用载具进行位移而停止跑动时，自身会近似被某种外力物理彻底摧毁，包括焚烧、挤压、穿刺等。
//
//但龙血族在遇白星之矢时，并不会做出以上行为。相反，他们会本能地朝着其反方向奔跑。据克西和德尔塔称，他们在与之相逢时，似乎听到箭矢后方有某种熟悉的呼唤，感到血脉上的牵引；而若顺着呼唤奔去，能感受到自身的力量有小幅度的增强。
//
//按克西所述，龙血族常常视之为龙神的恩赐，故欧米茄偏好以白星之矢经过时所形成的特殊区域，作为敬拜龙神的仪式场所，或者将其他实体转化为龙裔仆从的孵化基地。
//
//特性二：任何目睹过白星之矢的人（下称“获知者”），似乎都会在经历一场幻觉后，凭空产生出某一方面的认知，或者得到某些知识，大体如下：
//
//后室情报：涉及未被 MEG 记录在案的实体、物品、层级的具体信息，其中部分在后来被证实存在。
//超自然能力：涉及无法被前厅中现有的科学解释的力量的运用方式，包括隔地传送、凭空造物、改变能量传递效率等。
//未知文明：涉及一个不存在于前厅中的文明，依获知者的习惯说法命名为里院文明。
//黑灰幻景：获知者在幻觉中所见到的里院的景象，这些景象与前厅有所相似。但略有不同的是，无论在开阔野外还是室内，整个视野的颜色都是昏暗的，且没有除了破损的物品之外的事物。而随着接触次数变多，幻觉景象会变得更像是前厅与后室情况的混合堆叠，且其中后室景象的比重也随之变大。
//黑色符号：获知者称在幻境中，随处可见某个大概是该文明文字的特殊符号。在抄录后，无论被何种语言的使用者阅读，都会被解读为阅读者自身母语中“黑色月亮”这一概念。
//黑月之弓：从黑月符号中，延伸出来的知识。似乎与白星之矢配套，但未发现实物。
//黑月廷：似乎为该文明的最高统合机构，其制造了黑月之弓和白星之矢充当某种超自然仪式的道具。
//IMG_Blackmoon-count.png
//据说是黑月廷的标志
//
//相关团体：末风使徒
//末风使徒由最初发现白星之矢的李维斯在脱离MEG后，将一群似乎较一般获知者知晓更多相关知识的人，组织而成的类宗教结社性质的团体。该团体无敌意且可安全接触，一般也不会主动打扰他人强行宣传其理念。
//
//该团体宣称其自身继承了黑月廷的衣钵，并致力于搜集和安置白星之矢所带来的事物以拼凑线索。其还认为，白星之矢会越来越频繁地出现在人们面前，同时带来更多异常现象和超自然知识，并最终会在某一时刻完全显形后掉落在地上。而黑月之弓则是将白星之矢重新射出去的物品，必须及时找到并效仿黑月廷进行最后的仪式。
//
//在他们的传说里，所谓的里院文明，已经被“宛如神明”的恶龙和其他充满敌意的生物摧毁，而黑月廷则倾尽整个文明的力量制造了一把黑月之弓和三根白星之矢。白星之矢一根射向恶龙，一根射向侵占人类生存空间的其他智慧种族、一根承载着全人类文明的遗产射向新世界。然而恶龙并没有被杀死，反而逐渐追上了射离里院的白星之矢，同时导致了前厅中不曾有的异常事物在后室出现。
//
//又说，前厅和里院相碰撞时产生了后室，随着两者逐渐重叠，后室将会堆叠出越来越多层级和其他异常事物。而与此同时，后室也将与二者有更多的重叠。所以该团体就此推定，跟随白星之矢的方向，可以找到通往前厅的出口。
//
//以下内容节录自该团体的《黑月咆哮》一书，自行判断是否听信其理论：
//
//逃吧，逃吧，从所有的堡垒中逃出去
//教团的珍品，国王的宝库，全人类的工艺
//终有一日，尽被那恶龙的阴影给遮蔽
//尽被那贪暴的孔弗拉克拉西翁所吞噬
//可叹诸生渐渐被夺取所有，相杀致死
//
//逃吧，逃吧，在花园的迷宫中逃跑吧
//那层叠的小径不断分岔和被宇宙遮蔽
//而残响终究会在重重困惑中渐渐消止
//不轨的外族也将被抛下在旧界崩毁时
//
//逃吧，逃吧，向没有鬼神的乌有乡逃去
//不歇的晨星啊将未来追赶，还请不要停息
//我们和我们的造物，就在黑月的咆哮声里
//就在璀璨星光里，就在无限前行的步伐里
//飞向仅属于人类的天地， 重新书写新故事
//
package wupin;
public class baixingzhishi1013{
}