//Object 13 - “办公终端”
//object13.jpg
//Object 13的一张照片。
//
//描述
//Object 13是一台计算机终端，可以在Level 4内偶尔发现。如果按下电源按钮，计算机将启动，开始一段聊天会话，并连接到所有其他Object 13终端。直至撰写本文为止，通过Object13终端进行沟通的双方都没在后室内能找到对方，因此整个聊天可能都是由计算机创造的假象。但不管是真是假，只要不是与你交谈的人毫无帮助或在欺骗你，那么在聊天中可以获得有价值的信息来帮助你生存。
//
//该终端可以拔下其电源并带往其他地方，虽然终端可能有一定重量，但你可以从Level 176内拿上一个购物车进入Level 4以携带该终端，当然你也可以用其他东西。
//
//许多人已经成功地将终端从Level 4带到了其他层级，尽管得是一个有插座的层级才能使用它。但可以确定的是，在其他层级，该终端仍然可以工作并连接到聊天室。
//
//聊天功能
//聊天系统与一个普通的聊天频道没什么差别。当你第一次打开计算机时，系统会要求你为自己取一个用户名。此名称将出现在聊天消息的旁边并永久绑定你。也就是说无论你是否使用了新终端，你的名称信息都不会改变。所以别随便取一个愚蠢的名字。
//
//终端内只有一个聊天室，没有私密聊天系统。聊天室内通常有5到15个人。还有聊天室“管理员”，会删除那些在聊天室内发送垃圾邮件的人。我们不确定他们到底是什么人，但它们绝对不是人类。管理员似乎存在于电脑之外的后室某处，但我们不确定它在哪以及它是如何做到的。在聊天室中，管理员的名字是蓝色的。并很少露面。
//
//发现
//有一段时间以来，一直有传言称Object 13存在，但直到有用户拍下上面的照片并为下面的聊天记录截图过后，它才正式被确认存在。
//
//BenTen: 所以我进到了一个储物间里，是吧？我四处漫游的时候找到的。这里很舒服。比如，有一大堆柔软的扫帚。我要在这躺一会儿。就在这些扫帚上。
//
//Edddddddddd: 听起来像是个陷阱啊
//
//kel: 没错，就是陷阱
//
//BenTen: 接下来会发生什么？你们有谁找到过这个储物间吗？
//
//Edddddddddd: 我去过一次。但不是扫帚间。那是一个办公用品间。我还发现了一个订书机枪1。这玩意非常方便吓跑怪物。
//
//kel: 你他妈的为什么要和订书机亲热
//
//Edddddddddd: 什么？不，我可没和订书机吻来吻去。我只是把它带走了。
//
//kel: 哦，原来是个普通的办公用品室。我还以为是像BenTen扫帚间的陷阱。
//
//BenTen: 不，这个房间怎么可能是陷阱呢。我待在这里的每一分钟都变得越来越舒适。
//
//kel: 伙计。这显然是个陷阱
//
//Edddddddddd: 它正在把你吸进去
//
//BenTen: 你什么意思
//
//kevin: 你在储物间里还能用电脑？
//
//BenTen: 这地方有个插座，傻子
//
//kevin: 哦
//
//Edddddddddd: 兄弟，如果你很珍惜自己的小命的话，就赶快从那个储物间里出来。我以前见过这种。你现在觉得越来越舒服，之后不知道这个储物间会变活了还是什么，把你整个吞进去。
//
//BenTen: 滚，你这个vore控。这个小房间明明很温馨
//
//kel: 他已经没救了。我们现在没办法了
//
//Edddddddddd: 也许是吧
//
//目前还没有其他报告称Level 4内有任何危险的扫帚间。如果你遇到一个储物间内有很多奇怪的扫帚，应该避开它。如有发现请立即报告以便归档。
//
//作者信息
//« Object 12 | Object 13 | Object 14 »
//
//Footnotes
//1. 译注：原文为“I made out with a staple gun”这里是双关package wupin;
//
//public class bangongzhongduan13 {
//
//}
package wupin;
public class bangongzhongduan13{
}