//package wupin;
//
//public class beishangzhishui1011 {
//
//}
//Object C-11 - “悲伤之水”
//评分: +14+–x
//
//物品编号：C-11
//“悲伤之水”是后室C层群中特有的物质
//M14P8uOijJsz2gR.jpg
//在某层级的山林环境所拍摄的悲伤之水
//
//描述
//悲伤之水是一种颜色与橙汁类似的液体。它几乎无时无刻都在散发一种奇妙的香味。不论有意或无意吸入悲伤之水散发的气味都会使人感到悲伤。这种悲伤被许多流浪者描述为抑郁、烦躁、对未来的恐惧或患得患失。在流浪者无意吸入的情况下很难察觉到是什么对他们产生了影响。
//
//长期吸入悲伤之水的气味会大大增加流浪者转变成悲尸的概率。直接饮用悲伤之水会迅速将人带入悲尸循环的第三个阶段。
//
//保存方法
//悲伤之水需要在密封的容器中保存，防止其气味扩散对自身或他人产生影响。
//
//悲伤之水可以在10摄氏度以上的环境保存。
//
//当温度低于10摄氏度时会开始凝固，并有可能将容器破坏，导致气味在流浪者无察觉的情况下散播出来。
//
//悲伤之水不可以在41摄氏度以上的环境保存，这会使它汽化1并迅速扩散，吸入汽化的悲伤之水依旧会将人带入悲尸循环的第三阶段。
//
//来源
//它经常出现在C层群的地板上或者墙壁缝隙中，有时会从天花板上落下，目前只有一例从天花板上滴落悲伤之水的记录。在C层群的自动售货机中也可能买到瓶装的悲伤之水。
//
//用途
//悲伤之水在泼洒到骇笑者身上时会使其受到重创，泼洒量过多时可杀死骇笑者。有助于流浪者在无法移动且被其锁定时脱困，也可用于收集骇笑者的牙齿。
//
//作者信息
//« Object C-10 | Object C-11 | Object C-12 »
//
//Footnotes
//1. 已被证实汽化的悲伤之水与其散发的气味并不是同一种物质，气味为其与空气接触所生成。
package wupin;
public class beishangzhishui1011{
}