//Object C-87 - “便携式烤炉™”
//评分: +10+–x
//物品编号：C-87
//
//位置：大部分实体数量较少的层级。
//
//描述：
//便携式烤炉™表现为各种款式/颜色不同的烤箱，体积随款式不同而不同，但是总小于0.06立方米。便携式烤炉™的材质和正常烤箱没有区别，但是明显的更轻，任何款式重量总小于5kg。便携式烤炉™可以被破坏，其结构和正常烤箱等同。任何款式的便携式烤炉™都不需要通电和拥有一个在设备顶端的指示灯与设备表面的标签。
//
//后室厨师联盟
//便携式烤炉™
//
//For YumYum
//
//用途：
//将人类尸体组织1放入便携式烤炉™内时，便携式烤炉™上方的指示灯将会亮起，在灯亮起的情况下闭上烤箱门，烤箱门会自动上锁，等待灯熄灭后2可将组织取出。取出的组织呈过度膨胀变形且严重失水状态。研究表明该部分含有充足的蛋白质、各种脂类、维生素等人体必要元素且完全无害可食用。食用者称该部分”酥脆且有弹性“，微甜。
//特殊情况下，在便携式烤炉™工作时，内部会发出呜咽与嗡鸣声，属正常现象。
//
//发现记录：
//便携式烤炉™首次发现于Level 1的一处角落，其箱门半开且被膨胀的异物堵塞。流浪者发现异物可食用的情况下在该处定居，那之后发现了首个便携式烤炉™，后异物被证实为人类尸体。
//
//附录：
//来自B.C.A.的使用指南
//或许您并没有听说过我们，但是我们，后室厨师联盟会满足每一个流浪者的口腹之欲。或许您并不对那些美食或者是精致的小吃感兴趣，在后室这种消耗巨大的地方，就需要多补充能量！
//不管是悲伤还是高兴，肉永远是你自己的！它永远不会背叛你！！！
//
//
//配料
//炸鲜肉面包
//
//人类尸体组织	50g
//I. 使用净水充分清洁尸块，切作小块或丁备用。
//
//II. 将经过处理的尸块码放在盘内，送入烤炉。
//
//III. 等待烤炉自行处理完毕取出即可。
//
//
//
//来自M.E.G.的通知
//必要时刻，关键的资源将被利用。
//考虑到伦理道德问题，尽量避免分配给流浪者属于其亲属的部分。
//非常抱歉，但是大灾将至，我们无路可选。
//
//另
//考虑到其异常性质，使用便携式烤炉™以侦测流浪者存活情况的实验正在进行中。
package wupin;

public class bianxieshikaolu1087 {

}
