//Object C-75
//评分: +21+–x
//Object C-75“便携式提灯”
//Object C-75是由E.P.B.的高能实验室研发的“便携式提灯”。
//
//位置：位于离E.P.B.高能实验室最近的3个仓库内（待销售）。
//
//描述
//Object C-75是一个多功能的提灯，其外观表现为带有一个多面体且四周通透的灯罩，内部中央包含一管储存电量可供照明10小时的瓶装闪电1，上部拥有一根带有吸盘的可拉伸灯杆的“便携式提灯”。
//
//e3362cd01540108a.jpg
//吊挂着的Object C-75 开启时的外观。
//
//Object C-75的所有功能都可以在无Wi-Fi环境下发挥，Object C-75的能量消耗来源于其中心的瓶装闪电。
//
//这款“便携式提灯”的设计初衷为:为流浪者的探险保驾护航。所以E.P.B.为流浪者设计了除照明外的功能，具体请见下文。
//
//使用方法以及功能:
//下列内容一部分来源于Object C-75出售时配备的说明书，内容已将其文档化，以供流浪者购买前进行参考。
//——最终解释权归©Electron Positive™ Particle Technology Co.,Ltd. of Backrooms所有。
//
//功能:
//1、照明：配备大功率的瓶装闪电，其分为小、中、大、极四个照明亮度阶层，亮度由小到大逐步递进，每一阶层的每小时耗电量的差值大约为瓶装闪电能量的10％，最大亮度不亚于核能手电筒2。
//
//2、防卫：在Object C-75的可拉伸灯杆内包含了一个存有M.E.G.为E.P.B.提供的已拥有的实体生物检材信息的芯片，当芯片内读取了已知的具有敌意性、攻击性的实体时，Object C-75的瓶装闪电上部会探出一个内置的摄像头来识别实体位置，“多面体灯罩”下部的所有平面端点3将会伸出长度为60厘米4的机械臂，此时Object C-75的外观将会转变为蛛形，摄像头的附近将会探出两个折叠的小型机关枪5，对已识别的实体进行开火。在弹药耗尽后，如果锁定目标仍保持威胁性，Object C-75的前两只机械臂将会伸出锋利结构，并跳跃向其锁定目标攻击。流浪者可自行设置攻击顺序，即两者先后进行或同时进行。
//
//3、 定位：若流浪者想使用Object C-75识别自己所在的层级时，Object C-75就会动用内部摄像头以及储存M.E.G.的数据信息的芯片读取流浪者附近的环境信息，并进行逐一比对，结果会在与Object C-75一起配备的电子平板上显示，若无法识别，请阅读下文的脚注6查看相关原因。6
//
//4、 通讯：Object C-75配套的电子平板可以在无Wi-Fi环境下与其任何一个Object C-75的拥有者进行交流，在其电子平板上打开“通讯服务器”将会出现通讯列表，E.P.B.在出厂设备内默认设置了以下通讯对象以及群组：E.P.B.客服，M.E.G.救援申请7，E.P.B.客户交流群。其他通讯对象以及群组可由流浪者自行添加，在右侧界面找到搜索框，输入有效“群号”或“用户ID”可找到相关群组或人员，每个群组的“群号”以及每个用户的“用户ID”都会在所处页面的右上角显示。
//
//5、 装饰：拉长Object C-75的“可拉伸灯杆”，将其最顶端的吸盘吸在天花板或地面上，可转变为吊灯/落地灯形态。若不拉伸灯杆，直接将Object C-75立于其任何一个表面上，即可作为装饰。
//
//使用方法
//1、照明：在Object C-75顶部找到一个黑色按钮，其周围有一块小型电子屏幕，在按下按钮后滑动周围的小型电子屏，滑动到选择的亮度即可，在开启后重新按下黑色按钮即可关闭。
//
//2、防卫：其行为为Object C-75自动控制，若流浪者想控制Object C-75进行防卫行为，在配备的电子平板上找到“操控”程序，进入并使用内部的按钮控制即可。
//
//3、定位：在配备的电子平板内进入“操控”程序，点击“位置识别”，Object C-75就会自动扫描四周环境，对比数据库信息，结果最终将会显示在您的屏幕上。不要在Object C-75扫描时进行触碰或阻挡，这会导致无法出现识别结果或结果偏差。
//
//4、通讯及装饰：上文已提。
//
//购买途径：
//在Level 4的M.E.G.Omega基地找到E.P.B.销售部人员开设的销售点进行价格面议。
//在epbparticletech@backmail.com发送表明购买意愿的邮件，附上您的姓名、联系方式、购买数量以及方式，待回信后，我们会派送E.P.B.销售部人员前往信中的指定位置，并在信中的指定时间到达，如您与信中时间冲突，请回信表明您的收货时间。
//暂不支持除电子邮件以外的方式线上购买。
package wupin;

public class bianxieshitideng1075 {

}
