//package wupin;
//
//public class bianxieshiguzhang1033 {
//
//}
//Object C-33 - “便携式Glitch”
//评分: +26+–x
//统合物品分类系统
//物品编号 #：C-33
//位置：危险的城市层级
//安全性：中性
//用途：
//武器
//状态：
//较难获取
//物品编号：C-33
//
//发现位置：第一例被发现于Level C-284的某处超市货架上，在各种生存难度大于或等于3的城市层级均有低概率出现。
//
//便携式glitch故障是一种可能出现于城市层级的异常物品，较为罕见，常用作小范围杀伤武器。鉴于其高随机性、高危害性的特征，建议流浪者小心对待它们，谨防误伤误触，非万不得已之时不要使用。
//
//描述：
//便携式glitch外形为一个大小不定、形态不定的密封玻璃容器，容器中通常装有少量的砂石或泥土，偶尔可见装有少量浑浊液体的实例。目前确认到的形态有：用软木塞密封的漂流瓶，啤酒瓶，带有杯盖的玻璃杯（杯盖与杯体被粘合在一起），玻璃雪景球，空心玻璃塑像。
//
//便携式glitch的瓶身上总是会黏贴有淡黄色的标签，其上印有醒目的花体文字“便携式glitch！后室旅行的好伴侣！”，其右下角印有“疯狂王国的遗产™”和“爱来自Level C-284”字样。目前尚不知该物品和以上组织有何关系，但有传言称该物品的原材料及异常效应均来自Level C-284，其内容物即为该层级非安全区的积水和砂石。
//
//除了以上文字，大多数便携式glitch的标签上还会以“阿拉伯数字X阿拉伯数字”的格式标注它的“规格”，其中以“2X2”、“4X4”这两种规格最为常见。其规格与其体积似乎成正比关系，规格越大，体积越大。目前M.E.G.记录在案的最大体积便携式glitch为一座1:1复制的玻璃制自由女神像，其规格被标注为“NewYorkCity X Washington D.C.”1。
//
//性质：
//当一个智慧生命体以任何形式打开或破坏便携式glitch时，其异常效应将开始显现。以被触发的便携式glitch为圆心，其周围的一定区域内将发生各种随机的危险事件。它们包括但不限于：反复多次的爆炸，温度快速升高或降低，生成危险实体，切碎区域内所有物体，等等。这种效应常被流浪者形容为“仿佛在现实中创造出漏洞glitch一样”。这些随机危险事件会被局限于区域内部，区域外的空间不受影响，危险事件将在持续一段时间后自行消失，尚不知除此之外终止危险事件的方法。
//
//通常而言，故障的作用范围和持续时间总是取决于其标签上标注的规格。例如，一个规格为2x2的Object C-33将会影响其周围半径2m的球形区域，持续时间为20分钟，以此类推。但请注意，规格并非“阿拉伯数字X阿拉伯数字”格式的便携式glitch并不遵循此规律2，它们的作用范围和持续时间与其规格的关系尚在探究中。强烈建议流浪者不要使用此种便携式glitch，以免被其异常效应误伤。
//
//该物品的携带方式也是需要注意的。一般而言，被建议的最大携带数量与携带个体的精神健康水平挂钩，一位健康的成年人类最多可随身携带10瓶便携式glitch。携带过多的便携式glitch可能会导致一些不良的精神影响，包括但不限于无理由的焦虑和/或抑郁、特定的幻觉3、强迫性思维4、现实解离症状等。建议流浪者们不要贪多，量力而行。
//
//在最近的研究中我们观察到，便携式glitch的影响会避开范围内的“墙壁”和“地板”，而对“墙壁”、“地板”的定义则取决于使用它的智慧生命体。研究员林娜称这个发现意义重大，它可以帮助我们更加安全地使用该物品，对于该发现的更多应用尚在研究中。
//
//用途：
//杀伤性兵器
//由于其体积小，质量轻，使用方便且威力惊人，便携式glitch已成为被部分流浪者青睐的杀伤性兵器。但由于获取困难，其市场价格一直居高不下，稍有磕碰就有可能误触发的缺点也让许多流浪者望而却步，使用时的高随机性更是令人难以捉摸，因此，将该物品作为兵器使用的流浪者并不多。
//
//研究对象
//有研究者认为，便携式glitch的性质与后室的性质非常接近，研究它将有助于我们理解我们所处的这个世界，甚至帮助我们找到回家的方法。目前针对该物品的研究主要集中于其构造、成分、运作规律及模式，且已取得了可观的成果。
//
//记录：
//为了帮助流浪者更加直观地理解便携式glitch的性质，我们将一些便携式glitch的使用记录罗列在此。请流浪者们在仔细阅读后谨慎考虑是否使用该物品。
//
//使用者：林娜，女，隶属于M.E.G.的研究员。
//
//使用物品：一个规格为2X2的便携式glitch，外形为一个被软木塞密封的漂流瓶。
//
//使用场景：Level 11，M.E.G.Beta基地内的实验室中。
//
//使用过程：用弹弓将便携式glitch破坏后异常效应立即出现，其周围出现一个半径约两米的半透明圆球，圆球内的所有物体（包括：木椅，弹弓弹丸，废弃钢材）均在一瞬间被未知力量切成厚度约2mm的薄片，之后被投入圆球的物体也经历了同样的遭遇。约20分钟后，圆球消失，异常效应停止。
//
//备注：“切面非常光滑，而且光滑得很……奇怪？就好像它们不是被切成那副模样的，它们生来就是这个样子……我知道这听上去很不客观，但我想我有必要把它记录下来。”——研究员林娜。
//
//使用者：林娜，女，隶属于M.E.G.的研究员。
//
//使用物品：一个规格为2X2的便携式glitch，外形为一个微缩版的啤酒瓶。
//
//使用场景：同上
//
//使用过程：破坏后便携式glitch立即生效，位于其产生的球状区域中的所有物体（包括：木椅，A4纸，塑料球，不锈钢水管）均开始缓慢褪色。在褪色过程中，可观测到一种彩色的烟气从物体中飘出，烟气似乎不会被任何物质阻挡，所有尝试取得烟气的行动都失败了。约5分钟后，所有物品均变为均匀的灰色，质地变得松散易碎。
//
//备注：“如果让我形容当时的景象，我会说‘就好像那些东西的灵魂——或者说，让它们成为它们自身的某种东西，被抽走了’。嗯，和上面一样，这只是我的主观看法。”——研究员林娜。
//
//使用者：林娜，女，隶属于M.E.G.的研究员。
//
//使用物品：一个规格为2X2的便携式glitch，外形为一个巨大的玻璃弹珠。
//
//使用场景：同上
//
//使用过程：便携式glitch破碎后产生了一个半径两米的球形区域，球形区域中的事物被模糊不清的方块覆盖，其效果类似于被打了马赛克的图像。将物品（包括：圆珠笔，一团废纸，文件夹，扫帚）扔进区域后，可听见区域发出巨大的电子噪音、电脑警告声和报错声，并在数秒后归于寂静。区域消失后，发现投入其中的物品变成了若干巨大立方体的组合体，其外表类似于被覆盖了马赛克的图像。对这些物体的破坏尝试都失败了，它们似乎是坚不可摧的。
//
//备注：“哦，太可惜了，早知道我就多扔些东西进去，有棱有角又非常坚固，多完美的武器啊。”——研究员林娜。
//“你还想扔什么进去啊，你把研究室的地板都变成马赛克了！”——研究主管Dr. Jones。
//
//使用者：【应本人要求只公开部分信息】崔██，男，一位流浪者。
//
//使用物品：一个规格为4X4的便携式glitch，外形为一个金色的雪景球。
//
//使用场景：Level 9，彼时他正在被一只邻里守望追杀。
//
//使用过程：崔██将便携式glitch扔向邻里守望的虹膜。据本人描述，几乎在雪景球破碎的同时，实体的眼球“变成了一种金光闪闪的东西”，这导致该实体立即死亡。实体倒地后，其眼球附近的草坪和水塘也被异常效应影响，变为了同种物质。
//
//备注：“当时我跑得急没注意，但现在想起来，那玩意是不是金子啊？我是不是该敲几块回来？”——流浪者崔██。
//“不，亲爱的，金子在后室没用。你该期待的是那玩意变成了一堆罐装杏仁水。”——研究员林娜。
//
//使用者：【应本人要求只公开部分信息】Elizabeth·██，女，隶属于M.E.G.罗经点兵团。
//
//使用物品：一个规格为2X2的便携式glitch，外形为一个玻璃制天使塑像。
//
//使用场景：Level 3的一条走廊内，其在搜集物资时遭遇了一群猎犬。
//
//使用过程：在Elizabeth·██扔出天使塑像后，一只猎犬将其叼住并咬碎，随后一个电脑对话框从塑像中弹出，将猎犬的头颅截为两半。据本人回忆，该对话框的视觉风格与WindowsXP系统相符，其标题为“H@lLow w0rLD”，其内容为一行文字“i Lθve YoU”和一个低像素的粉色爱心图案，且没有最小化、全屏、关闭等按钮。该对话框似乎是不可摧毁的，且厚度无限接近于零，这导致其边缘极其锋利，试图爬过对话框的猎犬均被边缘切为两段。
//
//备注：“呃，老实说，我当时被吓得不轻。那个弹窗上的字太诡异了，我还以为我会被它拉进天堂，或者诸如此类的层级。还好它只是立在那儿而已。”——Elizabeth。
//
//使用者：雷励，男，隶属于M.E.G.狂野战士兵团。
//
//使用物品：一个规格为2X2的便携式glitch，外形为一个玻璃制人像。
//
//使用场景：Level 77的米色车厢中，其在执行任务时意外切出至该层级危险区，并被大量肢团包围。
//
//使用过程：据雷励描述，在便携式glitch破碎的瞬间，一个“白色的罩子”立刻展开，被笼罩其中的所有肢团全部灰飞烟灭，雷励左手腕外侧的皮肤也被卷入其中。在肢团全部消失后，可观测到白色区域正中央存在一赤裸的人形实体。实体身高1.80m左右，外表呈灰色，其身材和面容均类似于成年男性人类，但其身体轮廓被形容为“粗糙模糊，缺乏细节，充满了僵硬的棱角”“就像上个世纪的3D模型一样”。值得注意的是，该实体头顶悬浮着一个WindowsXP风格的窗口，上书“ђUmαn.exe”字样，且存在最小化、窗口化、关闭等按钮。
//在生成后，“ђUmαn.exe”开始以约2m/s的速度向前行进，进入其身旁白色区域的所有物体均被消灭，墙壁和地板则被转化为灰白相间的方格图案，类似于Photoshop软件中的“透明”画布。雷励立即后撤并拔枪向实体射击，然而子弹在进入区域的瞬间便遭到消灭，无法对实体造成伤害。混乱中，雷励的子弹击中了“ђUmαn.exe”头顶窗口的“关闭”按钮，随后伴随着WindowsXP的关机音乐，“ђUmαn.exe”缓缓隐去并消失。
//事后，雷励对被“ђUmαn.exe”转化的表面进行了检查，发现它们变得极度光滑，且无法以任何方法破坏或变形，“就像初高中物理题里那些‘光滑平面’一样”。
//
//备注：“还好它不会消灭射向‘关机’按钮的子弹，还挺人性化的。”——雷励。
//“很明显，这些玻璃小玩意有创造实体的能力，而且这些实体的破坏力只会强不会弱。看来我们需要重新审视这些东西了。”——研究员林娜。
//
//警 告
//
//以下内容为机密档案，仅供内部研究和管理人员查阅。
//
//若需查看事件C-██，请输入密钥：
//
//***********
//获取
//便携式glitch可能在任何生存难度≥3的城市类、房间类层级中刷新，但其刷新概率较低，且其刷新位置常常是十分危险的（如实体群中，危险的地形上），若想要获取必须做好万全的准备。也有在Level C-284的非安全区中寻得便携式glitch的报告，但鉴于该层级的非安全区充满了不可知的危险和故障glitch，不建议流浪者通过该渠道获得便携式glitch。
//
//目前较为可靠的获取方式为在市场上购买——B.N.T.G.拥有售卖该物品的相关业务，M.E.G.也可为流浪者提供便携式glitch，只要流浪者能够给出相应的价钱。但由于该物品获取困难且库存较少，便携式glitch的价格居高不下，请想要购买的流浪者做好心理准备。
//
//_
//+ 该文档包含一封加密邮件，点击查看邮件。- 欢迎您，浏览者
//发件人:	overseers-cn-5@backmail.com
//收件人:	overseers-cn-4@backmail.com
//主题：	欢乐女神的安置事宜
//状态：	普通
//嘿，卯兔，最近还好吗？我要告诉你一个好消息。
//
//继基地【女神圣殿】后，我们的特殊部队【女神狂信徒】的模因训练也已经顺利完成。现在的他们是M.E.G.最忠诚的战士——我们把“背叛M.E.G.”这个选项永久性地从他们脑海中抹除了，他们可以做任何事，除了背叛我们。模因训练的花费着实惊人，酉鸡成天在念叨这玩意是个吸金怪兽，还说M.E.G.的财政都快被它搞出危机来了。但能够保证我们的最终兵器平安稳定，这钱也算是花得物有所值了。
//
//我明白你的顾虑，你在担心这是否人道，是否会损害兵团成员的利益。我可以用自己的监督者资格保证，加入【女神狂信徒】的士兵都是完全自愿的，他们知道自己在做什么，也知道自己会经历什么。而且说实话，让他们接受我们的模因训练反而可以在最大程度上保护他们的安全。那可是欢乐女神，规格为NewYorkCity X Washinton D.C.的大故障。如果林娜的推测正确的话，她一旦降临，数千万平方公里的土地都将立即陷入狂喜，而这样的乐园将持续至少数百年时间，不止存放自由女神像的Level C-【已编辑】，整个后室C层群都会为之动摇。让我们的士兵睡个安稳觉，不用因担心背叛者而惶惶不可终日，这是我们唯一能为他们做到的。
//
//——还记得吗？寅虎在午马被那帮影子混蛋夺舍时曾说过一句话。
//
//【龙血族有υ（宇普西龙），暗影们有夺舍能力，那我们呢？我们有什么？】
//
//当时我不知道该怎么回答他，但现在，我想我可以给出自己的答案了。
//
//——我们有【女神圣殿】，那里存放着我们最后的咆哮。无论是【欢乐女神】，抑或是【东京巨蛋】，甚至是【地上天眼】……当那些玻璃塑像在他们头顶破碎时，他们会知晓何为欢乐。
//
//哦，抱歉，年纪大了，说话老是罗里吧嗦的。你就当是我返老还童中二病发作了吧，哈哈。
//
//愿希望永存。
//
//_
//+ 我知道你在好奇，为什么我要给你看这封邮件？- 告诉你也无妨
//其实也没什么特殊的，只是因为好玩罢了。
//
//我是焦月，是便携式glitch的设计者。疯狂王国的遗产™是一群自诩艺术家的家伙组建起来的俱乐部，但很明显，其中只有我才能担得起艺术家这个名号。
//
//为什么？因为他们不过是在生产艺术，而我，在让艺术生产自己。C层群实在太无聊了，它需要一些疯狂，一些故障glitch，来恢复活力。
//
//你难道不期待吗？若是这种威力无穷的武器在后室各处流通，究竟会引发怎样的化学反应？强者会因此变得更强，弱者也有了反咬一口的底气，各个势力之间的平衡被打破，权力的齿轮再次开始转动。昨日的兄弟为了名贵的交易品反目成仇，这难道不是花见月最爱的讽刺剧？以为自己获得了力量最后却竹篮打水一场空，这就是鬼月所痴迷的悲剧。还有那个勇敢的女兵，为了保护同伴不惜用巨型glitch与敌人同归于尽……啊，若是没有便携式glitch，我一定无法看到这么美丽的场景。
//
//至于龙血族，那帮恶心的爬行类畜生，他们害死了我的朋友，毁了我的家，我可不希望自己的作品被这些杂种使用，所以我不得不在我的设计里对他们稍微，稍微特别照顾了一下。天璇死得可真是精彩至极啊，你知道当那条泥鳅惨死足球场的时候，欧米伽的脸色有多难看吗？真是太棒了，我可以就着它下三大碗白米饭。
//
//当然了，作为一位疯狂王国的遗产™的艺术家，我的创作怎么可能会停留在如此肤浅的层面呢？实际上，能看到这封邮件的不只是你，这封秘密邮件将对每一个能上网的流浪者敞开自己的怀抱。你不是想知道我为什么要给你看这封邮件吗？这就是原因了，原本应该保密的信息现在分享给了所有人，你好不好奇接下来会发生什么？
//
//啊，不行了，光是想想这之后C层群会变得多么精彩，我就激动得浑身发抖，这简直是我最棒的杰作！
//
//……
//
//我知道你在想什么，你觉得我一定是疯了，对吗？你想问我设计出这么可怕的武器，难道就不怕自己也跟着遭殃？哈哈，怎么可能呢，设计武器是一门古老的行当，要是每个武器匠人、每个枪械设计师都害怕自己跟着遭殃，那这个世界恐怕早就没有武器这一说了。
//
//更何况，玩游戏当然要全力以赴，连性命都豁不出去的懦夫不配进入我的游戏场。不敢以身涉险的家伙，怎么好意思腆着脸称自己为“玩家”呢？
//
//当艺术家啊，最重要的感情就是疯狂。我讨厌眩病月建造的泪之城，成天哭哭戚戚的像个无家可归的小屁孩儿，我也不喜欢花见月制作的光之城，那就是个为讽刺而讽刺的劣等货。我喜欢的是疯狂，最纯粹、最原始的感情。所谓文明理性的历史不过万载，在此之前野生的疯狂早已绵延了数亿年，疯狂才是世界上最上等的感情，不是吗？
//
//你可以骂我是疯子，我不会在意，因为从以前到现在，他们都是这么称呼我的。我是焦月，我只为最极致的疯狂折腰。
//
//脚注
//1. 尚不知该“规格”意味着多大的区域和多长的持续时间。鉴于该物品的稀缺性和危险性，该便携式glitch已被永久封存于Level C-【已编辑】，针对此物的实验已被无限期延后。
//2. 包括但不限于“一乘以一”“one x two”“NewYorkCity X Washington D.C.”“Y嬪]锰烫烫蘒嬱Q塎黬,婨P婱鼖婱鼖B”等式样
//3. 以幻视和幻嗅为主，内容常与污物和尸体有关，偶尔可见幻听，内容为命令个体自伤和/或自杀
//4. 以“被秽物污染、吞食秽物”的想法或冲动为主，亦可见与性有关的想法或冲动。
package wupin;
public class bianxieshiguzhang1033{
}