//Object 96 - Blanche的礼物
//Object 96用于指代Blanche女士送给她访客的各类物品。尽管这些礼物的特性因种类和对象而异，但由于这些礼物都是为接受礼物者量身打造的，它们都具有一些共同的特征。在肉眼看来，它们就像是普通的物品，但实际上它们都具有异常性质，这将在下文详细说明。此外，如上文所述，所有这些东西都是Blanche送给她认为值得注意的访客的礼物。到目前为止，总共记录了六种此类物品，分别称为Object 96.1、96.2、96.3、96.4、96.5和96.6。
//
//Object 96.1 - Blanche的书
//34894100620_2b4394034d_b.jpg
//一本Blanche的书，发现于Level 5的桌子上。
//
//Object 96.1是Blanche的礼物中最为常见的一种，也是唯一可以在Level 906以外获得的种类。许多本Blanche的书散落在后室各处，尤其是书架或其他存放书籍的地方。这些书通常具有华丽的皮革封面，看起来很旧，但保存良好。一眼望去，最简单的辨认标准是，Blanche的书的封面和书页完全没有灰尘。这些书的内容在主题和写作语言上可能差别很大。用人类未知的语言写就的书也很常见。
//
//Blanche赠送给访客的书总是使用他们最精通的语言写就。众所周知的，Blanche会为她的访客写各种各样的东西，包括传记、烹饪书籍或关于后室及其居民的指南。为了获得这样一件礼物，来访者必须给Blanche留下一个好印象。表现的无礼或敌意的来访者不会收到Object 96.1或Object 96的任何其他种类。
//
//在异常性质方面，物品的特征中最值得注意的便是Blanche的签名。签名会出现在她的每一本书中。与签名进行身体接触是已知唯一的进入天鹅座档案馆的方式。为获得最佳效果，应用手指从左至右划过签名，这样做可以将个人以及任何与之接触的其他人送入Level 906。那些经历过这一过程的人提供了各种各样，且往往相互矛盾的报告。绝大多数人将进入天鹅座档案馆描述为快速、且几乎是瞬间的切换，在切换进Blanche的办公室之前，他们所在的层级会逐渐变白；而另一些人则报告称这一过程更类似于切出。当被问及关于这种不一致时，Blanche表示：“这些书的功能与我的客人的期望相符。”
//
//此外，这些书还可以用于与Blanche女士进行书面交流。在写完一封信并将其装入信封后，将信封夹在书页中，合上书，这封信就会被送到Blanche女士的办公室。
//
//Object 96.2 - 月光吊坠
//4739140209_d05a214822_b.jpg
//唯一的月光吊坠照片。
//
//月光吊坠是一种与Blanche女士一直佩戴的吊饰类似的首饰，但其大小与形状各不相同。它们由银制成，中间镶嵌着一颗蓝色宝石。月光吊坠极其稀有，仅会被赠与Blanche最信任的朋友。目前仅有三人获得了月光吊坠，分别为Blanche的弟子Dolly Von Haderach和Tom Von Haderach，以及M.E.G.“新地平线”团队的领导者和特工，Dawn Marchesa。Berry的项圈也包含一个较小的该物品，Blanche还声称已将其中一个吊坠赠与E. Isle，但这个礼物的赠送方式仍笼罩着神秘的色彩。
//
//这些吊坠的性质仍然十分神秘。人们仅知道它会发出微弱的蓝色光芒，且非常坚固，甚至可能是坚不可摧的。值得注意的是，吊坠的所有者似乎总是能知晓该物品的下落。据Blanche所说，这些吊坠会为其所有者追随自己的梦想提供帮助。由于它们的稀有性和其所有者的难以找寻，对这些物品的进一步研究被确认是困难的。
//
//Object 96.3 - 星光香水
//Image_200027.png
//一瓶星光香水，图片拍摄于Level 11。
//
//Object 96.3是一个与Blanche女士通常佩戴的相同的香水瓶。瓶子由水晶玻璃制成，饰有银掐丝和蓝色宝石。它通常会被赠与询问香水，或称赞她选择的香水的人。据了解，它有着薰衣草、干木和佛手柑的气味。它的名字来源于香水中可见的漂浮的类似荧光的小颗粒。奇怪的是，这些荧光在香水被使用时就会消失——这是该物品的众多异常性质之一。星光香水的瓶中有着无限量的这种物质，使其散发着微弱的彩色光芒，据称这种光芒会随着所有者的情绪状态而变化。香水瓶还具有异常的抗损坏能力，可以承受从10m高空坠落的冲击而不碎裂。
//
//至于香水本身，它也有一些奇怪的特性。最容易被注意到的，是香水的镇静特性。使用过的流浪者一致报告称，感到平静和更加专注，有的人甚至声称他们似乎感受到了Blanche的存在。已观察到这种效果可以延伸到附近的人，甚至于某些实体，尽管程度较小。另外，根据M.E.G.特工Faith Silversong称，这种香水“对护肤有奇效”。
//
//Object 96.4 - 小Blanche
//BlancheFumoColor.png
//一张小Blanche的画，由Dolly Von Haderach绘制。
//
//顾名思义，小Blanche，或更正式的称呼，布兰奇的毛绒玩具，是由Blanche女士制作的毛绒玩具。这些毛绒玩具包括各种形状和大小，从动物，到Blanche女士和他的客人的Q版，它们经常被赠予来访天鹅座档案馆的儿童。有时可以看见Blanche亲手编织这些毛绒玩具。
//
//鉴于拥有小Blanche的人大多数都是儿童，对此类物品的研究实际上要比平常更困难一些。在异常效应方面，那些被赠予小Blanche的人报告称有它们在附近时“总是会做美梦”，而且它们在许多情况下“让可怕的东西消失”。与Object 96.2的情况类似，需要进一步调查以确认小Blanche的全部效应。
//
//Object 96.5 - Blanche的毛毯
//unknown.png
//Blanche亲手编织的众多毯子之一。
//
//Object 96.5用来指代Blanche亲手编织的大量毛毯。这些毛毯均由中等厚度的羊毛制成，但颜色和图案因人而异。Blanche会在冬天将这些毛毯分发给来访者，或分发给来自寒冷层级或抱怨自己居住的地方寒冷的来访者。
//
//这些毛毯具有一些异常的性质。首先，它们永远不会脏污或损坏。毛毯上的任何灰尘、液体或污垢都可以轻易去除，所受的任何损坏也会在隔夜后消失。因此，这些毛毯可以在有效保护中起到一定作用，但并不能取代合适的设备。其次，无论外界温度如何，它们可以保证任何处于毛毯之下的人处于自己的舒适温度中。值得注意的是，毛毯在较温暖的层级中则可以使流浪者保持清爽。第三，它们可以增大或减小尺寸，以便完美覆盖在给定时间使用它们的任何人。最后，这些毛毯难以置信的蓬松。
//
//Object 96.6 - Blanche的特别便当盒
//5826630090_32fed84a29_b.jpg
//一份Blanche的特别便当盒，属于一名叫Mell Corvin的流浪者。
//
//Object 96.6是Object 96所有种类中最常被赠送的物品，几乎所有没有对Blanche或她的客人无礼的访客都会被赠予。它包括一个木质便当盒，和装满其中的Blanche女士亲手制作的全套餐点，其中包括一个放前菜的格子和一个放甜点的盒子。盒子的形状、大小、颜色，以及里面的食物，都会根据客人的喜好和要求有所不同，但它始终由健康、有营养的食物组成，保证令你满意。
//
//乍看之下，食物似乎没有任何异常特征，和普通的食物一样。尽管如此，流浪者形容称，Blanche的饭菜有着非同寻常的味道。Blanche声称自己在制作食物时并未使用任何异常成分，并将这种非同寻常的味道归结于“永恒中的无数实践”，这一点已经通过对这些便当盒的成分和制作方法进行广泛分析后得到证实。然而，除了异常的轻之外，这个盒子还有一个值得注意的性质。无论外部条件如何或过去了多少时间，它都能保证其中的食物完美保存且保持温暖。因此，许多人会将空盒子保留用来在以后装食物，无论这些食物是否由Blanche制作。package wupin;
//
//public class blanchedeliwu96 {
//
//}
package wupin;
public class blanchedeliwu96{
}