//package wupin;
//
//public class bohelu1104 {
//
//}
//Object C-104 - “薄荷露”
//评分: +5+–x
//物品编号：C-104
//
//279617F9-D232-47C6-B555-F0869D1CAC87.jpeg
//两罐未被贴上标签的薄荷露。
//
//描述：
//薄荷露是一种类似杏仁水的的透明液体，被应用于烹饪、饮用等。
//
//B.N.T.G.所售卖的薄荷露上贴着的标签：
//
//薄荷露
//清凉口感，冰爽解渴，自然健康！
//B.N.T.G.独家代理！！！！！
//喝一口吧～
//净含量：250毫升
//
//警告：大量饮用有薄荷过载风险
//据悉，薄荷露并非后室原产物，而是由B.C.A.研发及小规模生产1，且被B.N.T.G.大量采购作为饮品售卖。其水体呈青绿色，通常被装在一个容积约为250mL的银色铝制易拉罐中。有时罐中会出现两片薄荷叶。基础的化学检测显示其中含有少量的咖啡因和海藻糖成分。
//
//性质：
//B2F095E8-2494-4AED-9769-9CB24F0AA92F.jpeg
//被倒进玻璃杯中的薄荷露。图片经过PS处理。
//
//薄荷露口感十分清爽，且有着一股浓郁的薄荷香味。少量饮用可使流浪者感到放松。但过量饮用2会导致流浪者暂时双目失明，双手抽搐，且感到寒冷，但会大幅度提升肺活量。这一状态被称为“薄荷过载”，约持续10分钟。目前未发现能对“薄荷过载”进行有效治疗的手段，唯一消除该症状的方法就是停止饮用薄荷露并进行休息。
//
//附件：
//《马天尼博士的130种鸡尾酒》——薄荷果香马天尼
//用料：
//
//金酒45ml	君度力娇酒15ml
//薄荷露20ml	柠檬糖浆适量
//柠檬
//制作方法：
//
//柠檬切片，放在一旁备用。
//按照以下顺序将用料倒入摇壶中：金酒、君度力娇酒、薄荷露，柠檬糖浆3
//摇匀，随后倒入杯中，点缀上一片柠檬片。
//马天尼博士评语：
//制作非常简单的一款马天尼类鸡尾酒。我知道君度力娇酒有点难搞，但想调好一杯果香浓郁的马天尼的话，没有它是万万不行的。这款酒和我之前调制过的各种果味马天尼差不多，诀窍就是把果汁替换成富有浓郁薄荷香气的薄荷露——为什么不用龙坠草汁？因为薄荷露没有成瘾性，还比那东西好搞多了，只需要上B.N.T.G.那遍布全后室的销售网点里交上两瓶杏仁水就能换上一罐，还不用担心什么交易限制。
//此酒香气扑鼻，清香四溢，整体感觉像是闯入一个薄荷园，微苦中带着一丝回甘，非常适合住在较热层级中的流浪者们解暑。
//小提示：薄荷露的确很好喝，但千万不要贪杯哦！
//
//作者信息
//« Object C-103 | Object C-104 | Object C-105 »
//
//Footnotes
//1. 其配方处于保密状态
//2. 饮用超过1000mL
//3. 可根据个人口味来增减糖浆
package wupin;
public class bohelu1104{
}