//Object C-94 -“博罗利亚虹石”
//评分: +36+–x
//统合物品分类系统
//物品编号 #：C-94
//位置：弱光照条件层级
//安全性：无害
//用途：
//原材料
//状态：
//可获取
//描述:
//博罗利亚虹石，或简称“虹石”，是后室中一种带有较黯淡光泽且颜色随状态变化而改变的天然矿石，其主要的化学组成成分被认为是一类特殊的硫铁化合物。一般而言，博罗利亚虹石矿可在层群I及层群C中较多层级的自然地下结构内或阴暗处被发现，一个典型的例子是Level 61、Level 8等以黑暗潮湿的洞穴系统作为主体的层级之中。此外，在Level 412这类弱光照条件的层级内也有一定概率发现博罗利亚虹石。
//
//x3cTS0.jpg
//一张正在被开采的暗基态博罗利亚虹石的照片。此照片摄于Level 8，已经过高光处理。
//
//性质:
//总体而言，由于博罗利亚虹石的多变性，尝试着在较短篇幅内对虹石进行统一的描述会导致极其影响流浪者阅读体验及阅读速度的杂糅，且这样做是毫无必要的。因此，本条目下将对处于不同状态的博罗利亚虹石进行分门别类的论述。
//
//微观成分：
//经多次实验检测，构成博罗利亚虹石的硫铁化合物难溶于水及除二硫化碳外的绝大多数有机溶剂。但，组成该化合物的两种元素的化合价均不合乎常理。受制于简陋的设备条件，目前对此类化合物在微观层面的研究尚未充分进行，故其分子构型仍然未知。
//
//暗基态博罗利亚虹石：
//暗基态 ： 通常情况下，当博罗利亚虹石从其原先所在的土壤结构之中被挖掘出时，该矿石会立即展现出极其惊人的吸光性，以至于其表面亮度急剧下降至呈现出难以分辨其轮廓的黑色。能够进行此过程的博罗利亚虹石即可被认定为处于“暗基态”。
//在吸光过程中，由于暗基态博罗利亚虹石对光能的吸收与储存现象，周围环境的光照强度将因此而略微下降。3通常地，这种吸收现象将在该矿石能够释放出约1.5E+5cd4的发光强度时停止，同时博罗利亚虹石将发生状态变化。多次相关实验表明此现象对环境的影响会随检测点位置与博罗利亚虹石距离的升高而衰减，在约7m处微弱至难以测定的程度。考虑到矿洞内一般较为昏暗的光照条件，建议流浪者将收集到的暗基态博罗利亚虹石立即储存于不透明材质5容器中或以不透明材质物品包裹覆盖，以免造成不必要的负面影响。
//
//光激态博罗利亚虹石：
//光激态与光激化：在遭受猛烈撞击或突然承受巨大外力时，吸收过光能的博罗利亚虹石将由较稳定的暗基态迅速突变6至被称之为“光激态”的活跃状态，此过程的正式名称是“光激化”；光激态博罗利亚虹石往往呈现黄绿色。当暗基态博罗利亚虹石被施加强热时，其同样能够发生光激化。
//实验表明，在直接加热的条件下，暗基态博罗利亚虹石向光激态转变的临界温度约为1680K。鉴于该矿石的熔点仅为1520K，对于在外作业的流浪者而言这一性质实际上并无多少实用性。然而，当其与固态氟化钙及铁氰化钾共同加热时7，这个数字会骤降至690K左右。随额外所加各成分的配比不同，博罗利亚虹石的熔点可能在一定范围内发生变化。借助这一性质，可尝试将火盐与上述混合物共同制造成具备延时引信的震爆弹。由于铁氰化钾在高温下将分解产生对人体具有极强毒性的氰化氢，建议在密闭空间内仍然选用更简易但也更安全的光激态博罗利亚虹石矿作为震爆弹来使用。8
//
//将光激态博罗利亚虹石置于充氮容器9中能极大地弱化虹石的活泼性质。在这种情况下，虹石的导电性会大大增强，使得其能够缓慢地转化所接收的电能，并同样以光能形式放出，转化速率主要由氮气浓度决定。通过这种方式产生的可见光颜色易受作为真空容器电光转化元件的博罗利亚虹石内所含金属及其化合物杂质的影响而变化，光线最终的颜色与杂质金属元素的光谱有直接相关。这一现象被认为是焰色反应受后室干扰而产生的变种实验，在各金属作用下发生的光线颜色改变也与其在焰色反应中呈现出的颜色保持基本一致，故此反应的正式名称最终被选定为“光色反应”。例如，含有少量硫酸钙杂质的博罗利亚虹石将在光色反应中呈现出砖红色。
//
//光色反应为在不具备进行焰色反应实验的常温条件下进行快速的化合物鉴定提供了可能。同时，可使用经调配过氮气浓度的充氮容器与光激态博罗利亚虹石共同制作出稳定、持续的光源，此类光源被命名为“网灯塔”。作为参考，使用两节标准五号电池供电、氮气体积分数为99.5%的网灯塔能够以5000cd10的发光强度连续工作62小时以上。此外，光色反应也是虹石制品海蓝网灯塔的工作原理之一。更多海蓝网灯塔的相关信息详见此处。
//
//复态博罗利亚虹石：
//跌落化：若光激态博罗利亚虹石接触到水或氧气11，该虹石将以极快的速度急剧释放出其内所存储的光能。与“光激化”相对应地，这一过程被称之为“跌落化”,且每块光激态博罗利亚虹石仅能发生一次跌落化过程，过程持续时长至多不超过五秒。据简单估测，光激态下博罗利亚虹石所释放的光能与其先前在暗基态下吸收的光能大致相当。
//复态与攀升化：跌落化过程结束后，原先的光激态博罗利亚虹石将失去其在暗基态和光激态下所具备的任何有关光的特殊性质而进入“复态”。处于复态的博罗利亚虹石不再具备特殊的光学性质，在这种状态下，此矿石会呈现出暗金色的外观，这种颜色被推断为构成博罗利亚虹石的硫铁化合物的原本颜色；与此同时，复态博罗利亚虹石的理化性质也将发生不同程度的改变，详见下文具体说明。复态博罗利亚虹石可通过在高温高压条件下与某些还原剂进行氧化还原反应来重新回到暗基态，该过程被命名为“攀升化”。
//将复态博罗利亚虹石与硫代硫酸钠及蓝砂在3.5MPa12加压条件下共同加热13以经历攀升化过程可以令其恢复到暗基态。由于这一反应产物暗基态博罗利亚虹石的吸光性，建议在尝试进行这一反应时如同采集博罗利亚虹石一样控制光照强度，一个行之有效的方法是选用不透明实验装置来完成该反应，或索性在暗室中进行。同时鉴于该反应对压强条件和温度条件的苛刻要求14，个人或小型组织在任何情况下都不应自行尝试进行攀升化实验。若流浪者的确有无法避免的相关需求，请就近向具备一定化工生产能力的各大M.E.G.基地或E.P.B.实验室请求协助。
//
//需要补充说明的是，由于蓝砂对生物体有剧毒，攀升化反应往往需要同时投入适量的治愈水晶以中和弱化蓝砂的毒性。根据多次实验总结得出的规律，治愈水晶的用量与正常状态下其与蓝砂的配比基本无二，而和博罗利亚虹石及海波的用量无关。根据蓝砂的相关条目，这一比值需大于等于5:1。鉴于蓝砂和治愈水晶在攀升化过程中都不会被消耗，在尝试进行该反应时请不必吝惜治愈水晶，以免造成不必要的意外中毒事件。又及，对于蓝砂的反常熔点和治愈水晶的低沸点，充入保护性的稀有气体15以抑制气化等过程在这一反应中将显得尤为重要。这也使得攀升化实验对个人而言更加不具备可操作性，在此再次警告流浪者不要贸然做出不明智的举措。
//
//据推测，在强光下发生攀升化的复态博罗利亚虹石会在三态间反复转化，并不断吸收和释放光能。16博罗利亚虹石在经历这种转化过程后所能吸收的光能会降低至先前的百分之八十（80%）左右。进行过多次三态转化的博罗利亚虹石的最大光能吸收量不会继续降低，而会固定在天然值的百分之八十（80%）。这一性质为回收并循环利用已经使用的博罗利亚虹石提供了成本层面的可能性，但请注意，已经被制造为具备特殊性质的制品17的复态博罗利亚虹石并不能进行攀升化过程，除非该制品受外界作用发生程度较大的塑性形变而导致其失去特殊形状，进而无效化。
//
//复态相较于暗基态和光激态而言稳定得多，难以发生剧烈变化。复态博罗利亚虹石具有一定的硬度和韧性，因此复态也是三种状态中应用最广泛的一种，在后室的化学工业、建筑业和制造业等多个领域体系均发挥着不可替代的作用。复态博罗利亚虹石是最先被后室中的人类所发现、利用的种类，其颜色在被制成虹石制品后变化多端，这正是“虹石”名称中“虹”字的由来。
//
//虹石制品：
//虹石制品：以复态博罗利亚虹石为材料生产出的部分产品会随形状的改变而具备多种多样的特殊能力18，这些具备独特性质的虹石制造物统称为虹石制品。各组织、团体和一些个人均对这一性质开展了深入探索，并往往各自拥有一些对外保密的锻造技巧。当然，部分较为基础的特定形状虹石制品及它们的特性已被一些较大的组织或慷慨的人士所公开。
//虹石制品的特殊性质与其形状密切相关，已被制造出的制品也可能因弯折或破裂等形状变化而失去作用。因此，判断某种形状的博罗利亚虹石是否能够被称之为虹石制品最直接的标准就是测试其是否具备特殊性质19，且这种特殊性质往往与能量转化过程有关。同样地，这一方法也可用于检验虹石制品的破损度，但建议流浪者在已经观察到制品外表上肉眼可见的损伤时最好应当直接对其进行修复或更换——没有人会希望自己在战斗或探索时使用的装备突然失灵。再者，虹石制品颜色的变化也是较为可信的判断标准之一，尽管在某些情况下该方法仍然有其局限性而在准确度上略逊于前者。
//
//由于不同虹石制品种类与性质的多样化，在本文档（虹石中心页）中不予以展开说明。获取更多关于各类虹石制品的资料请藉由本文档“用途”部分提供的链接跳转至相对应的子页面阅读。
//
//信件资料：虹石制品进入C层群市场的相关内容（其三）
//获取：
//博罗利亚虹石矿的获取并不困难。希望得到这种矿物的流浪者只需前往本文档“描述”部分所提及的几个典型层级，乃至于一切符合光照及地形条件要求的层级，仅花上几个小时稍加探索，就有较大的概率能寻找到他们想要的东西。至于如何制备不同状态的博罗利亚虹石，也可见于本文档“性质”部分，流浪者跟随其指引即可完成一系列的转化操作，故不再重复赘述。
//
//不同于前厅中的常见天然硫铁矿物，一般而言，博罗利亚虹石矿的纯度已经足以使其展现出几乎全部的特性，所以尝试提纯博罗利亚虹石矿是无甚价值的。不过，极高纯度22的博罗利亚虹石会呈现出奇异的、且往往被描述为“赏心悦目”的彩色，具有极高的观赏性，因而可尝试将其制作为机巧精致的摆件。23提纯的方法为将复态博罗利亚虹石粉碎后施加强热，投入耐高温的反应釜，加热直至1900K到2100K的温度区间24，等待杂质化合物气化析出，然后让博罗利亚虹石自然冷却凝固。这一过程成功的标志是在冷却过程中液态博罗利亚虹石开始显现出各种颜色，发出的光线颜色也随之改变。正因为这一过程中流动着的彩色液态虹石极富美感，高纯度的博罗利亚虹石又被称作博罗利亚流彩石。
//
//由于在博罗利亚虹石精炼过程的初筛阶段中重力选矿和磁力选矿无法发挥太大作用25，而电解提纯和化学提纯均不适用或无法实现如此高的纯度要求，这种原始的沸点分离法实际上是目前最高能效的精炼手段。当然，其耗能之高也是可以预见的，因此在条件恶劣的后室中，任何人都不被建议进行这种不具备实际意义的实验；目前M.E.G.正在寻找蒸馏法提纯博罗利亚虹石的高效替代方案。
//
//在某些情况下，流浪者同样可以通过将博罗利亚虹石与空珀以任意比例混合一同加热至823K以上来实现空珀的转化效应，以期获取更多的虹石。通过这种方式获得的博罗利亚虹石状态与作为拷贝模版的虹石物态将保持一致，然而转化而来的博罗利亚虹石纯度仍然与转化前的空珀相同。就目前C层群的交易市场行情而言，空珀的价值要远高于等重的博罗利亚虹石26，因此如非必要，一般情况下鲜少有流浪者会尝试进行此反应。
//
//用途：
//正如上文所言，由于其可超越点燃状态下镁块的强光，便捷的使用方式和易于投掷的形态，处于光激态的博罗利亚虹石矿常被流浪者携带以充当震爆弹应用。已在多次实际行动中证明其用于短暂致盲和制造混乱等战术目的方面的能力十分出色。另外，利用光色反应制造的网灯塔在提供长时间照明及化合物成分测定方面同样具有广泛用途。
//
//此外，处于复态下的博罗利亚虹石还可用于制作物品，很多以其为原材料制作出的物品都具有值得称道的使用价值。目前借助复态博罗利亚虹石独特的性质，许多组织和个人已尝试将其直接锻造或与其他材料混制作为虹石制品。博罗利亚流彩石有足以胜任作为雕刻等艺术领域用料这一用途的色泽和质地。在提炼过程投入能源成本降低到可接受范围后，其更多待开发的用途将被立项探究。
//
//部分实用性较强且受到广泛认可的虹石制品清单如下：
//
//海蓝网灯塔 该制品制造方法由M.E.G.公布27
//愚人金丝 该制品制造方法由M.E.G.公布
//卡兰刀 该制品制造方法由难以考证的不详个人公布28
//杯装暴风 该制品制造方法由U.E.C.公布
package wupin;

public class boluoliyahongshi1094 {

}
