//Object C-68 - “材质贴图”
//评分: +32+–x
//统合物品分类系统
//物品编号 #：C-68
//位置：Level C-240
//安全性：大部分安全
//用途：
//装修、改造
//状态：
//大部分可获得
//描述
//材质贴图是一类外观与墙纸相似的物品，其一面为白色，另一面常呈现某种材料的纹理。其白色面触感光滑，纹理面触感则与其显示的材质相同。材质贴图易被剪刀等刀具切割，其纹理面无法通过任何途径留下痕迹1，而光面则可以使用签字笔等留下笔迹。卷起的材质贴图的上方总是会飘浮着黑色字符，凭此可以判断其纹理面显示的材质2。
//
//IMG_20221017_120557.jpg
//材质贴图光面的照片。
//
//使用特定的粘性物质涂于材质贴图的光面并将材质贴图贴于一物体表面，可使该表层被其覆盖的范围内一定深度的物质发生转化。在转化期间接触该物体及其所处物体的侧面被证明是安全的。
//
//在通常情况下，转化过程会将转化范围内其他物质变为与其纹理面所示纹理相同的材质，例如，将一块纹理面呈现纯铁外观的材质贴图贴于木板表面，转化完成后，材质贴图所覆盖的区域将转变为纯铁。
//
//所有发现的自然生成的材质贴图的作用深度均为1cm，使用原液将一片材质贴图的光面与另一片同样大小、形状相同的纹理面黏在一起可制成一片作用深度为两者之和的材质贴图，其材质由露出纹理面的那片决定。
//
//整个转化过程通常需要消耗与其转化深度呈正相关的时间，转化深度每增加1cm，所需时间便增加10秒，但在Level C-699.reserved中，转化将在材质贴图贴上的一瞬间完成。
//
//注意：材质贴图无法改变物质的“不可摧毁性质”
//
//在极少数情况下，纹理面会呈紫色与黑色正方形交替排列或电视雪花屏的图案。具有这两种图案的材质贴图上方飘浮的黑色字符为乱码3，分别被认为证明与Level C_404_503和Level 404有关，极为危险，请勿接触。
//
//以下是已探明的可用作材质贴图的黏合剂的物质：
//
//前厅存在的常规黏合剂
//原液（使用此种物质粘合将使转化过程较大程度加快）
//O.P柳汁
//细胞之血（使用此种物质粘合将使转化成的材料获得自我修复功能）
//血液（使用此种物质将材质贴图与肉体粘合可在粘合部位保有正常机能的情况下强化粘合部位，如使用其他黏合剂将导致粘合部位失去正常机能。使用自体血液可加快此种转化过程）
//材质贴图原先只被观察到被后室装修公司的员工用于改造层级，自于Level C-240发现后被各大组织用于层级改造，如红星建筑队、M.E.G.、B.F.P.F.、E.P.B.等。
//
//+ 点此查看材质贴图的各类特殊变种 
//来源
//在Level C-240的许多文件夹中都可以找到大量展开的材质贴图，在各层级中类似影印店或建材店的建筑内也可找到少量成卷的材质贴图。
//“盛肉香叶”可以从有识血肉处购买。B.N.T.G.也会售卖材质贴图，其中自定义材质贴图和透明材质贴图定价往往较高。
//
//在发现Level C-240可作为其稳定来源之前，通常仅可通过抢夺后室装修公司员工或在其取材料时跟踪其前往材料补充地获得。
//
//应用
//普通材质贴图可用于改造层级内居住环境
//部分金属或岩石纹理的材质贴图、透明材质贴图及 “盛肉香叶”可用于躯体改造。
//血肉纹理的材质贴图可用于医疗，常用于修复烧伤的皮肤等器官。
//食物纹理的材质贴图可用于制造食物。
//自定义材质贴图可用于复制珍贵材料。
//据部分流浪者称，U.E.C.存在一种将材质贴图贴于人员身上将其皮肤转化为所需材料的行刑方式。
package wupin;

public class caizhitietu1068 {

}
