//package wupin;
//
//public class candaoxiujin1197 {
//
//}
//Object C-197 - “餐刀锈金”
//评分: +21+–x
//
//物品编号：Object C-197
//餐刀锈金是一种可以用于多种工业和材料制造的特殊物质，有独特且重要的工业用途。
//
//描述
//餐刀锈金的物理和化学性质都近似普通金单质。外观呈淡金色，由于过薄可以透光，这使得在有光源时该物品似乎在发出微弱黄光，但实际上是反射。质极硬，性质极其稳定，可以抵抗大部分物理和化学侵蚀1。在最初的实验中认为这是一种金的同位素，但由于缺少相关设备，我们无法进一步对其分子结构进行研究。
//
//餐刀锈金的异常性质表现在餐刀锈金分子有巨大的水平方向连接能力，在单分子级平面上餐刀锈金分子间连接强度能达到常温下普通金单质的数十倍，由于这个力量过强，甚至会调整处于垂直方向的元素缓慢移动至水平方向，但在水平方向上分子间连接强度却与普通金单质完全相同。
//
//值得一提的是根据“后室厨师联盟”2方面的报告，餐刀锈金的异常性质对普通金元素同样生效，但是连接后的普通金元素不会继承此性质，因此在加热后加入少量金元素成为一种可行的锻造策略，能够得到纯度降低、硬度下降但是可供加工的餐刀锈金层。
//
//用途
//餐刀锈金的独特性质让它可以制成单分子层面却有惊人硬度的薄膜，由于连接极其稳固且力量固定，外界力量极难对这些金箔造物进行破坏，单分子结构又能让他们极其轻巧，非常适合用于制作刀刃或外装甲镀层，极少数有识血肉的“颅骨”级战士氏族和一部分后室厨师联盟成员。将刀刃最尖端替换成此材料以获得极其锋利的刀刃，通过内部消息确认U.E.C.中一部分高层的服装内衬也有一定数量的餐刀锈金。
//
//- 关闭
//U.E.C.的网站上看到的是他们说M.E.G.高层的服装内层是用这东西造的，这种小事上都要抹对方一笔吗？
//
//对于该物品，除平面以外的任何造型加工都被证明以目前工业水平无法实现，任何在垂直层面上的分子堆叠都会在一段时间后被拉回平面，因此目前工业仍然将其作为高强度平面材料使用。
//
//获取
//餐刀锈金因为其特殊性质，往往会形成一片面积较大的金色平面，在野外层级的。矿产区或是一部分室内层级的。物品附近会发现，通常来说在室内层级发现时会伴随一个损坏或者缺失关键零部件的物体，推测是因为原本应该在这里生产的黄金生成出错形成餐刀锈金，所以导致物品无法正常生成
//
//目前各组织都以高价收购该物品，截至记录完毕时，物品的价格已经上升到5000份同体积杏仁水，数量较大的餐刀锈金矿藏甚至可能引发小规模冲突，如果有流浪者发现此物建议立刻前往当地M.E.G.基地并交由专人处理。
//
//- 关闭
//这种物质的发现揭示了一种全新的可能，也许后室中生成错误，这一点不仅仅只局限于普通的宏观层面，微观层面上也同样有可能出现这些错误，实际上我们也成功找到了其他类似的存在，包括目前有记录的一种在常温下可以与4个氧原子形成稳定结合的碳，以及我们用于制造咖啡云卷的“亚种氮”
//
//这些特殊物质似乎是由于错误产生：在大多数环境和表现上与原本的普通原则别无二致，某些特定条件下却展现出截然不同的特性，正是这些特性成就独特的物品和实体。我们在一部分实体的解剖中也发现他们可能有类似的元素构成，推测这是赋予这些实体各种的特殊性质的原因之一，进一步的研究工作已经提上日程
//
//作者信息
//« Object C-196 | Object C-197 | Object C-198 »
//
//Footnotes
//1. 但是能够腐蚀金单质的物质仍然能正常腐蚀该物品，按照已有的微观物理理论来说是无法解释的
//2. 考虑到伟大母亲是后室厨师联盟的厨师长之一，这一性质的具体发现者存疑
package wupin;
public class candaoxiujin1197{
}