//package wupin;
//
//public class chaonengxiaodianchi1140 {
//
//}
//Object C-140 - “超能效电池”
//评分: +38+–x
//统合物品分类系统
//物品编号 #：C-140
//位置：具有科技产品的层级
//安全性：安全
//用途：
//改善性能&机能
//状态：
//少量；可获得
//z0aRJI.jpg
//一块未含有任何文字的“超能效电池”
//
//描述
//超能效电池的外观类似前厅中常见的小型蓄电池，一面印有“Property”或“Charge”标志，另一面则印有电路板的图案。
//
//超能效电池的结构除去常见的正极，隔膜，负极，有机电解液，电池外壳外，还包含一块“核心”与各类稀有元件，其中包括：含硅、硒的三极管，含钽的电容，含纯铜的电感类元件。且元件中所有的铝制品，均掺杂着金元素。这也导致其材料利用率高，可以很好地发挥电池的最大效益。
//
//“核心”的外形及结构类似于数条迷你的行星环，与一个发光发热的光球构成，其中光球为主能源，其产生的能量带动着行星环浮空并做功。推测此部件为电池特殊性质的主要来源，尝试将“核心”放置于其他区域将会导致其浮起，且向周围释放高压电流，直至能源消耗殆尽。
//
//用途
//超能效电池的最基本用途是将其当作蓄电池来给电器补充电量，由于有较大的储存电量，将其当做随身能源站或许是个不错的主意。不过需注意的是，由于内部并未安装电池保护板，所以在使用时务必小心，同时也要注意切勿长时间触摸电池的正负极处，否则可能会导致触电反应。
//
//似乎是“核心”所导致，正常的超能效电池会为非智能类物品的各个方面1带来提升；除此之外超能效电池所发出的电波还会使人身体得到增益效果，例如理智上的恢复、力量上的提升。
//
//对于已应用2过的超能效电池，其将无法进行二次应用。仅可作为能量储存设备使用。且此时的电池外观将会与先前有所差异，若电池未应用，其应当包含一层呈深蓝色的PPS3工程塑料外壳；反之，若此外壳未体现出任意颜色或已脱落，则表明该电池已应用。
//
//想要打开带有“增益”的用电模式，使用者需要先将电池正极旁的开关启动，然后将它靠近距离物品大约一厘米处，那么它便会自动吸附至物体表面并使物品与电池形成回路，如果想要为人本体提供增益，将其贴在人体上的任何部位都将起到增益效果，取下时只要稍微用力就可拿下。在粘贴完成后，电池上将会显示电量，以及功率大小。
//
//释放的功率大小分为“LOW”“MID”“HIG”三个阶级，每个阶级代表不同的能耗及提升。
//
//LOW：可为物品提高大约70%的性能并有少概率产生双倍的物质，对人体起微弱的增益，电池耗能低，一般持续约一小时。
//MID：为物品提高大约80%的性能并有少概率产生三倍的物质，对人体起不强的增益，电池耗能中等，一般持续四十分钟。
//HIG：为物品提高大约85%的性能并有少概率产生四倍的物质，对人体起较强的增益，电池耗能高，一般持续十五至二十分钟。
//注意，当转换至最右的“ERR”阶级时，将会提供极高的升力值，但目前此阶级还未研究完全，若非专业人员，切勿随意转换至此阶级。
//
//如果一个物品，其本身的性质已达到阈值——即一种数值或者效果已经到达极端，无法再僭越的情况。例如安全睡袋，其本身已经提供了“安全”之性质，因此不可能存在“更安全”的作用效果，那么在此种情况下，超能效电池将不会在“变得更安全”这一方面对其产生任何作用。
//
//超能效电池在无法将自身所有电力起效在物体上以达成效果时，那么它将从物体最缺乏的性能处开始起效，例如一台老式电机的电力十分微弱，那么超能效电池在起效时将注重“电力”的补充，在电力补充至充足时才会加强电机的性能。
//
//由于超能效电池非同一般的性质，目前，包括E.P.B.在内的一些组织在不断的收购电池及其相关材料，原因不清。不过据相关报告推测可得，他们已研发出人工制造的超能效电池，但效果并不理想。事实上，迫于舆论压力，他们曾在近期的演讲中承认此前合法取得过B.F.P.F.所制造的半成品及蓝图。但真实性仍有待考证。
//
//发现
//最初于Level C-345被B.F.P.F.采集样本时发现。后来我们发现该物品数量并不多，且大多数电池中的电力较少，很少有电池处于满载的状态。
//
//附录
//此篇附录记叙了B.F.P.F.三名留守在Level C-345的成员发现超能效电池的记录，他们在发现它后不久便撤离了。
//
//- 收起发现记录
//记录开始
//
//Egta：规划一下，James去A区，Marry到B区，我则是C区。
//
//James：日复一日，年复一年，好无聊啊。
//
//Marry：组织也真是，留谁不好，偏留咱们仨。
//
//Egta：好啦你们快去采样，组织的作风是不会有错的。
//
//随后，三人陆陆续续的赶往了采样点，并依次完成了采样
//
//Egta：C区勘探并采样完毕，未发现异常，完毕。
//
//Marry：B区同上，完毕。
//
//James：A区同上，完……那是个什么？
//
//Egta：James，你那里出了什么状况吗？
//
//James：嗯，我似乎在一店铺的货架上看到有摆放东西，那是家机械手表店。
//
//Egta：你能看清目标就去拿下，然后返回，我们的时间不多了。
//
//Marry：货架上通常不放东西，小心点James。
//
//James拿走那一堆东西后匆匆赶回
//
//大约十分钟后
//
//Marry：你可算回来了，你到哪浪去了？
//
//James：靠，路上被这破玩意电了几下。这貌似是个电池，还有份说明书。
//
//Marry：我看看…
//
//说明书上的语法很古奥，几人花费好一段时间才翻译过来。最后署名则是失落一族常用的笔名。
//
//Marry：所以说，这是我们新发现的物品咯。
//
//James：注意你的说辞，小姐，你应该说“你”而不是“我们”。
//
//Egta：嘿，嘿，你们不觉得很激动吗，这篇物品可是在数据库没有的。
//
//James：激动归激动，总得先试试吧，搞不好弄个大乌龙也不是没可能。
//
//随后他们便一一测试了说明书上的所有功能
//
//James：呜呼，这个超好用欸。
//
//Egta：你这不比我还要激动？
//
//Marry：少安毋躁，这不是还有个模式没测试吗？
//
//James：我看看，说明书上没写这…等等，好像有一部分被掩盖了。
//
//众人利用特殊手段解读出了那部分
//
//James：最后的模式不就在这嘛，来，终极的谜团，就由我来解开！
//
//Egta：你中二的毛病真是没救了。
//
//Marry：不要贸然行事，我们还没弄明白这个模式。
//
//James不听众人的劝导，毅然决然的找了块空地，开启了那模式……
//
//James：哼哼，易如反….欸？欸欸欸欸欸欸欸欸——
//
//在电池的驱动下，James不自觉的跑了起来，速度高达10m/s
//
//James：救救救救救救救救救我啊———
//
//Marry：我早说过，心急吃不了热豆腐。
//
//Egta：一点也没错。
//
//记录结束
//
//« Object C-139 | Object C-140 | Object C-141 »
//
//Footnotes
//1. 除去大小，外观，原性质的变化。
//2. 即已进行过一次性能或机能提升。
//3. 即聚苯硫醚。
package wupin;
public class chaonengxiaodianchi1140{
}