//package wupin;
//
//public class chaojipaoxie1038 {
//
//}
//Object C-38 - “AirJoke”牌超级跑鞋
//评分: +21+–x
//
//物品编号：C-38
//“AirJoke牌”超级跑鞋是一款对流浪者探索后室十分有用的运动跑鞋。
//photo-1512374382149-233c42b6a83b?ixlib=rb-1.2.1&dl=xavier-teo-SxAXphIPWeg-unsplash.jpg&q=80&fmt=jpg&crop=entropy&cs=tinysrgb
//"AirJoke"牌超级跑鞋。
//
//描述
//“AirJoke牌”超级跑鞋整体表现为一双名为“AirJoke”的运动跑鞋。其最早于一名速切玩家发现。该鞋大部分的配色为白灰色，长度大小由寻找到它的流浪者的尺码长度而变化，可以适应每一个人不同的脚型和步态。重量也出奇的轻盈，整个鞋子不足500g，包括其搭载的智能系统。
//
//另外，由于鞋子的舒适度与实用性超过了世面上任何一款运动跑鞋，目前该物品已成为速切玩家协会的官方指定赛事跑鞋。
//
//首次被发现时，该跑鞋装在了一个写着“AirJoke”牌跑鞋的鞋盒中。有趣的是，该款鞋子的外观与前厅中某知名品牌出奇的相似，似乎是该物品的创造者为了避免侵权，特意的在商标上做了改动。当流浪者打开鞋盒后，会在里面找到跑鞋与一张使用说明书，说明书的内容大致为：
//
//欢迎使用“AirJoke”牌运动跑鞋：
//
//产品介绍：
//
//“AirJoke”牌运动跑鞋是一款性能卓越出色的跑鞋，它采取独特研发科技，能吸收99.9%上地面反作用力避免脊椎、膝盖、脚踝等受当地面反作用力挤压造成运动伤害，同时吸收反作用力转换成下步运动推进力，帮助节省体能，各种运动场合都能发挥优异性能。是流浪者躲避实体与探索后室的好帮手，是流浪者忠实的好伙伴。
//
//以下为使用说明
//
//1.无需担心鞋子不合你的尺码，“AirJoke”牌跑鞋采取了最新智能科技，搭配AI语音系统，只需流浪者将鞋穿上，系统将通过数据预算里使其完美的契合你的双脚。
//
//2.该跑鞋搭载了弹跳辅助功能，分为四个等级：Normal，Rapid，Rabbit以及GodMode。只需旋转跑鞋左侧的旋钮，即可调整到自己想要的功能；但目前“GodMode”还处于测试阶段，具有许多的不稳定性，除非必要时刻禁止使用。
//
//3.本跑鞋采用特殊蓝砂材质，使得鞋底夹层拥有极佳的柔韧性，奔跑起来非常舒适。反应性和缓冲性达到完美的平衡，奔跑中你会感觉自己的脚后跟被轻柔地爱抚。
//
//4.本产品无需流浪者手动清洗，其特殊的鞋面设计会使得跑鞋能够进行自我清理，并将污渍转换为纯净度99.9%的杏仁水。
//
//5.该产品可以逆转重力 还在研发阶段中。
//
//目前为止，还尚未得知是该跑鞋的研发者是谁，有人推测这是B.H.A.A.的实验成果，但是被否认了。
//
//特性
//“AirJoke”牌超级跑鞋也拥有同“超级吸铁石”的磁性性质，同样具有两极的磁场与磁性，根据人体性别产生超自然形质的磁吸现象，且异性和实体也同样受到磁性性质的影响，无明显性别特征的实体会被弹开，此超自然性质暂无法被解释。且当该物品与“超级吸铁石”搭配使用时，会产生强大的冲波力场，可使人与实体被弹开至10米外，而跑鞋使用者则不受任何的影响。具体原因M.E.G.正在研究中。
//
//目前M.E.G.经过研究发现该跑鞋拥有着可逆转重力的隐藏功能，具体表现为使得流浪者周围方圆5米的区域失去重力的影响，流浪者本人也会随之漂浮起来。但由于在开启此功能后会使得周遭环境变得极为不稳定，任何想要开启此功能的行为都是不明智。
//
//即使此物品的特殊功能可使人体弹起并摔落，通常前三个等级的弹跳功能都不会使流浪者在落地后受到任何实质性伤害，但曾有不止一例有关流浪者在使用“GodMode”后消失的报告，于是M.E.G.在此提醒流浪者非特殊情况不要随意使用。
//
//“AirJoke”牌跑鞋无法被破坏，每当有流浪者想要刻意破坏此跑鞋时，跑鞋将会自动开启防御系统，并会释放未知气体且射出激光。这无疑是致命的。但有流浪者在被实体包围时以此特殊功能击退了一群实体，但他也因此吸入了部分气体，之后便转换为了悲尸。
//
//用途
//利用其物品性质，可以使人体实现超高度弹跳等，对于探索相对险要的地形相对实用。但强烈建议流浪者听取跑鞋说明书上的建议，不要轻易开启“GodMode”。
//
//获取
//只有很小的几率该物品会出现在Level C-345的货架上，售价为250瓶杏仁水。
//
//流浪者也可以在Level C-361的护具商店中购买此物品，售价为200瓶杏仁水，无论如何，这都是很大的一笔数目。
//
//有人声称曾在Level C-199的鞋柜上发现了这款跑鞋，但实际情况无法考察。
//
//记录
//报告提交时间：2022年8月19日
//记录物品：Object C-38个体
//记录者：两名流浪者
//记录概要：测评“AirJoke”牌超级跑鞋的性能
//
//记录开始
//
//两名流浪者正在端详着“AirJoke”牌跑鞋
//
//流浪者A：我花大价钱才好不容易搞到的，我早知道该先看物品资料的，那个奸商还额外坑了我30瓶杏仁水！
//
//流浪者B：可不是不，这下我们能参加速切比赛了，看我穿这鞋碾压全场！
//
//流浪者A：小心点！这玩意可贵了！
//
//流浪者B：行行行，让我穿上试试。
//
//流浪者B穿上了跑鞋。
//
//流浪者B：噢，我亲爱的杰瑞之神！这玩意穿起来可真舒服！感觉我的脚被包裹在了一堆云层中！柔柔软软的！
//
//流浪者A：可以给我穿了没！！
//
//流浪者B：等等……让我先试试它的功能。我瞧瞧，Normal…Rapid…Rabbit？还有这个GodMode是什么？
//
//流浪者A：别瞎搞！那玩意我看了资料了，最好别乱搞！
//
//还未说完，流浪者B就旋转按钮到了GodMode位置。
//
//流浪者B：这也没啥啊，来，我给你整个好活！
//
//流浪者B想给流浪者A来个后空翻，结果脚刚准备跳起来，便瞬间飞到了天上。
//
//流浪者A看着流浪者B越飞越高，它的呼叫声也渐渐地消失在了云霄中。
//
//流浪者A：……是个狠活……
//
//记录结束
package wupin;
public class chaojipaoxie1038{
}