//package wupin;
//
//public class chaojixitieshi1041 {
//
//}
//Object C-41 - “超级吸铁石”
//评分: +34+–x
//
//物品编号：C-41
//超级吸铁石是一块神奇的磁铁。
//描述
//超级吸铁石整体配色由红蓝所组成，大小大概宽20厘米，高10厘米，它在重量上相对于同体积的吸铁石会更轻，在外观无任何受磨损痕迹。得益于它的重量轻与其性质，不会因其他用于传送的道具所拦截。
//
//自其被发现以来，已收集十二块左右，目前已有存货全部被B.N.T.G.持有，且B.N.T.G.拒绝向任何组织出售此物品。
//
//特性
//超级吸铁石也拥有磁性性质，同样具有两极的磁场与磁性，根据人体性别产生超自然形质的磁吸现象，且异性和实体也同样受到磁性性质的影响，无明显性别特征的实体会被弹开，此超自然性质暂无法被解释。
//
//经过实验，该物品也无法与其他例如碳粉等物质产生反应，但是可以与铁质物品产生正常的磁吸现象。该物品产生磁性反应的吸附力远远超于普通吸铁石，但却无法持续吸附于人体。
//
//即使根据此物品性质会导致人体弹起并摔落，但根据事故，造成的碰撞对人体无任何伤害和不良影响。值得一提的是，实体反而会遭受碰撞带来的伤害，一些人类聚集地会选择将它放置在聚集地周围，一部分实体将无从下手。
//
//超级吸铁石无法被任何外力所破坏，但是在遇到高温时会立即融化并且转化为无气味的烟雾。据不知名流浪者所说，超级吸铁石在遭遇低温超过72小时，它的磁性性质会产生变化，整体外观从红蓝转变为银色，并拥有磨砂质感，其他与之前大致相同，此状态的吸铁石拥有同性相吸，异性相斥的超自然性质，无明显性别特征的实体会被吸过来，异性及同性实体会被弹开。在未找到此形态的物品善用方法前，暂时禁止人员刻意制造这个状态的超级吸铁石。
//
//用途
//利用物品性质，可以使人体实现超高度弹跳等，探索相对险要的地形相对实用，例如Level 8。当然可以使用此物品性质在特定情况躲避实体，甚至用产生的能量杀死实体。将此物品合理摆放，可以为人类聚集地更好抵御实体的攻击。此外，理论上它还可以用于制造简单机械，但这仍在研究中。
//
//获取
//该物品有较高的概率漂浮在Level 7的海面上。
//Level 5的锅炉房中有较小的概率可以找到此物品。
//
//记录
//报告提交时间：2022年5月12日
//记录物品：Object C-41个体
//记录者：两名B.N.T.G.成员
//记录概要：对于在Level 7发现的超级吸铁石的研究
//
//记录开始
//
//众人对于它的重量感到震惊
//
//B.N.T.G.成员A：看，吸铁石。
//
//B.N.T.G.成员B：在我找到它时，我明显感觉它吸在我得身上去了。
//
//成员B将物品拿起
//
//此物品牢牢吸附在成员B的手上
//
//B.N.T.G.成员A：这怎么会……
//
//还未说完，两人被巨大的力量弹向天花板，重重摔在地上，房间里乱作一团。两人被反复弹开，在房间里“飞来飞去”，直到成员B把超级吸铁石扔出房间，但两人并未受伤。
//
//记录结束
//
//报告提交时间：2022年5月16日
//记录物品：Object C-41
//记录者：不知名流浪者
//记录概要：Object C-41的事故阐述
//记录开始
//
//一位流浪者正设法通过Level 9
//
//流浪者：这是什么鬼地方……
//
//四周寂静得吓人
//
//流浪者总觉得路旁有什么动静，但他还是极力控制住自己
//
//那动静越来越大了
//
//流浪者：谁在那！
//
//一只悲尸冲了出来，对流浪者发起攻击
//流浪者大惊失色，他赶忙掏出自己在Level 7找到的那块东西，向悲尸残缺的脑袋上砸去
//
//流浪者因剧烈的力量弹了起来，重重摔在地上。悲尸貌似昏厥了。
//
//记录结束
//
package wupin;
public class chaojixitieshi1041{
}