//package wupin;
//
//public class chongshengguoshi1043 {
//
//}
//Flesh C-43 - “重生果实”
//
//
//评分: +54+–x
//血肉之缔造者，给予灵魂无限的重生。
//
//
//躯器编号：Flesh C-43
//代价：大
//
//安装位置：体内
//
//介绍
//重生果实有六个种类，其外貌大概为以1:2缩小的人体器官，为大脑，心脏，肾脏，肝脏，胃，肺。根据它们的枝叶以及对果体的研究，重生果实可能属于蔷薇科植物，但是其外貌成因，培育者拒绝透露。
//
//重生果实的整体颜色为红中泛紫，这在梨等蔷薇科植物果实中相对罕见。其种子通体红色，较为透明，直径在1-3厘米，食用后可以为身体快速输血，腐烂后会化为一摊血液。触感较硬，奇怪的是，由食用过重生果实的流浪者所描述，其咀嚼起来像是在吃生肉，味道类似于草的青涩味以及人体器官的血腥味，且没有任何汁水，令人难以下咽。
//
//功能
//吃下不同器官外形的果实，会使人体内生长一个新的器官，如果你吃下外貌为心脏的果实，那么你的体内就会有两个心脏为你的身体工作，但是新生长的心脏功能性要低于人体原先存在的心脏，大小也相对较小。
//
//说明
//如何使用：
//一、你需要详细了解自己的身体状况，是否需要被提供额外能量，要明白，这种物品的效果是需要极大的代价才能够消除的。
//
//二、你需要检查自己身体上的肌肉分部情况，哪里可以填充新的组织。
//
//三、仔细检查果实是否有变成黑色的情况，如果有，那么它可能已经变质，食用会导致你的体内滋生腐肉。
//
//四、完整吃下果实，并在心中默念你希望它生长在何处。
//
//五、生长过程中会使你感到剧烈的眩晕和疼痛，你只需要躺下并且放松，饮用杏仁水可以相对缓解不适。
//
//注意：
//一、值得一提的是，如果没有把果实整个吃掉，会导致器官生长不完整，使人体身内部产生错误或多余的连接或填塞，导致非常严重的后果，只能通过手术补救。
//
//二、在身体中把肌肉撑起，并快速滋生一个新的结构所带来的痛苦非常人所受，一旦本体在这个过程中晕厥，滋生体会变为腐肉，最终导致死亡。
//
//三、如果你的适应能力和身体机能本就较差，在新结构生长完毕后可能会导致你无法适应新的器官工作模式，最终导致晕倒，甚至瘫痪，请务必慎重选择。
//
//四、在生长完毕后，可以回到1种植场向商人拿取重生果实的种子食用，以补充身体在恢复阶段的耗血需求，如果忽视这点导致器官衰竭，最终死亡。
//
//获取
//该物品目前在Anturm C-156拥有一个小型种植场，由躯的成员培育和种植，其种子概不出售，只能面对面提供，可以和管理种植场的流浪商人购买果实。
//
//作者信息
//
//« Object C-42 | Flesh C-43 | Object C-44 »
//
//Footnotes
//1. 指建造于Antrum C-156的种植场。
package wupin;
public class chongshengguoshi1043{
}