//Object C-67 - “重溟精粹”
//评分: +25+–x
//物品编号：C-67
//重溟精粹是一瓶魔药。
//
//描述
//重溟精粹整体外貌为一种相对粘稠，且散发着荧光的液体，其颜色类似于青金石，质地类似于深层石油，散发着海水的咸味和鱼腥味。重溟精粹通常被装在一个底面半径2.5厘米，高4厘米的圆柱形玻璃杯内，玻璃瓶上有用灰白色的珍珠粉末形成的“Blood of Poseidong”（海神之血）字样，瓶嘴塞着一个与海柳相似的木头制成的瓶塞，瓶塞顶端精致地刻制着“Μαζί για πάντα”字样。M.E.G.正在全方面搜寻此物品，并广泛收购。
//
//特性
//重溟精粹饮用口感与杏仁水相似，味道略微发苦，咸味颇重，它的流动性超越于杏仁水等饮品，基本能在一瞬间通过口腔。饮用尽液体后，玻璃瓶会在2小时后化为一摊白色的沙子。当液体滴落在任何地方，都会以极快的速度蒸发。在重溟精粹个体被拾取后，将会在7天后受某种原因而变成散沙。
//
//在人类饮用重溟精粹后，会立即产生强烈的干呕和眩晕感，全身陷入无力，导致意识模糊，无法感知到周围及自身的一切变化。此状态持续十分钟左右，人体嘴唇左右会出现类似鱼鳃的器官，并且人体能够明显感受到自己的呼吸方式产生改变。
//
//十五分钟后，不适感逐渐缓解，人体脚底会长出样似鱿鱼足吸盘的器官，可以自由控制该器官，并牢牢吸附在任何物体上，甚至可以倒立在天花板上稳定行走，奔跑速度会有超自然性质的提升，大概在普通成年人的4倍左右，自身力量也会有提升，可以击碎较为坚硬的物体。人体会感到自己身躯感到无比轻盈，呼吸极为流畅，这可能是自身重力有略微降低，这暂无法解释。
//
//在人体饮用重溟精粹并且完成变化时，在水中的变化尤为明显，在人体进入水中，背部会出现银色的鱼鳍，身躯出现少许绿色的鳞片，游泳速度已经超越了人类的极限，且不会出现任何劳累感。在水中人体会倍感轻松和愉悦，在药水效果结束后，人体原来的所有伤全部会愈合，并且在一段时间内无需氧气也能够呼吸。
//
//药水效果最多可持续一小时左右，在药水生效后吃下少量泥土即可消除药水效果。
//
//用途
//M.E.G.使用此物品广泛探索Level 7，Level 8等区域，且相当实用。用于探索和通过危险区域，避免危险。
//
//获取
//它们漂浮在Level 7任意深度的海水中，较为罕见。
//Level C-302中这种物品相对常见，它们通常散落在地上，这也是M.E.G.收集此物品的主要来源。
package wupin;

public class chongmingjingcui1067 {

}
