//稻草人
//关于田间稻草人的说明
//[著]麦芽镇的Eiliyah Azmera
//
//在穿越Level 10的麦田时，旅者常会看到那些巨大的稻草人，祂们就像是在守护这片土地一样。就如我们家乡里的那样，它们都由各样的衣裳紧裹稻草而成。一开始你可能会感到害怕，矗立在大木桩上，用祂们的麻袋头或南瓜头盯着你，偶尔摇摆于风中，就像祂们还活着一样，但没什么可怕的。稻草人是守护者。祂们守护着这一层的和平。祂们在守护着你。
//徘徊在Level 10的格拉夫常与稻草人保持距离。我认为这不是出于恐惧，而是尊重，我们也应尊重稻草人，同时也要尊重这片土地，如果你不这样做，那么灾厄就会降临于你。稻草人允许我们住在祂们的土地上，但我们必须得先寻得应许，并贡献祭品给祂们。如果你打算住在稻草人占据的土地上，我建议你做一盘美食放在稻草人下。当你这样做后，第二天回来取盘子，你会发现你贡给祂的东西都被吃掉了。你只需要做一次这个仪式，但我建议仍不时地贡祭。你还必须尊重这片土地。你可以在上面耕种，但一定要重新种回你播种过的东西。
//
//根据我多年生活在这儿的经验，我相信每位稻草人都蕴藏着在这层逝去的人们的灵魂。为了向你解释我为何如此想，我会给你讲一个故事。
//
//几年前的一天，我正在穿越麦田，感觉毫无希望。我还在为我妹妹Aasira的死而悲伤，还想着从她的事中走出，就在这时，我看到了她，稻草人的她，穿着她的破牛仔夹克的她，上面贴有我们奶奶买给她的生日礼物——一张涅槃贴。我知道这就是她，不仅仅是破夹克，我能感觉到这就是她，就像是我能透过麻布袋的纽扣眼看到她。看到她，或许那是她的一部分，我感到很欣慰，我们仍在一起，我情不自禁地抱住了她。她没法抱住我，但我能感觉到，她在安慰我。
//
//那晚我在她的注视下睡着了，到了早上，我知道我必须得走了，我告诉她我爱她，并承诺会再来看她。
//
//当我离开时，我听到三个字飘在风中。
//
//“谢谢你。”package wupin;
//
//public class daocaoren10 {
//
//}
package wupin;
public class daocaoren10{
}