//package wupin;
//
//public class daojishishalou1018 {
//
//}
//Object C-18 - “倒计时沙漏”
//评分: 
//+88
//+
//–
//X
//探索Level 3时，你在角落里捡到了一个装满紫色细沙的金属沙漏，在你碰到沙漏的一瞬间，悬浮着的细沙落下。
//
//你感到很惊奇，所以你将它带回家，摆在你的床头上。
//
//折叠
//物品编号：C-18
//
//death.jpg
//倒计时沙漏
//
//描述：
//倒计时沙漏的外形类似于普通沙漏，框架由红铜构成，玻璃部分材质为钢化玻璃，且可被破坏。
//
//目前已知倒计时沙漏仅有一个，且会随机出现在生命仅剩不到14天且对此不知情的流浪者附近。
//
//倒计时沙漏的异常性质体现在于他的计时功能。在流浪者触碰倒计时沙漏后，其中的细沙将开始流动，细沙流尽时，触碰倒计时沙漏的流浪者将会由于各种原因失去生命体征，且死亡方式似乎与沙漏无关。
//
//倒计时沙漏在被触碰后，内部的沙子会改变颜色，且改变后的颜色与触碰者的死亡方式有关。以下为已知的颜色与触碰者死亡方式的对应列表：
//颜色	死亡方式	备注
//红色	失血过多	大部分情况下都由利器导致
//黄色	慢性疾病	无
//黑色	突发疾病	多为心脑血管疾病
//蓝色	溺水	在陆地上呛死也被包括在内
//灰色	猝死	大多为熬夜导致
//白色	毒物致死	包括药物副作用及过量使用
//倒计时沙漏的外壳上粘贴着一张纸条，纸条在流浪者触碰沙漏后将在朝向流浪者的一面浮现出红色字迹，通常写着流浪者的死亡时间。
//
//在触碰倒计时沙漏的流浪者死亡后，倒计时沙漏将会恢复到初始状态。再次触碰时倒计时沙漏将会重新计时。
//
//倒计时沙漏外壳的玻璃部分易被高温融化，在外壳破损后，倒计时沙漏将失去异常性质。在外壳破损后，倒计时沙漏将在5~10分钟内消失，并出现在随机一满足条件的流浪者附近。
//
//目前尚未探明倒计时沙漏进行死亡倒计时的原理是预测还是改变因果使其发生，建议流浪者谨慎触摸。
//
//你在纸条上看到了自己的死期:
//只剩下7天。
//你决定回家
//
//实验记录：
//实验编号 12
//实验：一位年龄22岁的女性流浪者在2022/6/2触碰倒计时沙漏。
//结果：纸条上浮现了红色字迹，内容为“2022/6/9”，沙漏内部细沙为黑色。该流浪者在看到细沙颜色后表现出焦虑、恐惧不安等情绪，尝试破坏倒计时沙漏，破坏被一旁的安保人员阻止。该流浪者死于霍乱导致的严重脱水。
//
//实验编号 13
//实验：一位年龄36岁的男性流浪者在2020/9/3触碰倒计时沙漏。
//结果：纸条上浮现了红色字迹，内容为“2022/9/4”，沙漏内部细沙为红色。该流浪者并未表现出极端行为。该流浪者死于因割腕失血过多。
//
//实验编号 19
//​实验：一位十四岁的女性流浪者在2022/2/15触碰倒计时沙漏
//结果：​纸条上浮现出红色字迹，内容为“2022/2/25”。沙漏内部细沙为蓝色。该流浪者看到字迹后崩溃大哭，在一小时后离开并回到她的父亲身边度过了余下的时间。该流浪者在浴盆中溺死。
//
//​实验编号 37
//​实验：一位27岁的男性流浪者在2022/6/14触碰倒计时沙漏
//结果：​纸条上浮现红色字迹，内容为“2022/6/27”沙漏内部细沙为白色。该流浪者趁研究人员统计数据时使用打火机强行烧灼沙漏，在之后该流浪者去到了Level■■■，度过余生。该流浪者死于同伴在杯中加入的龙葵素。
//
//实验编号 28
//实验：一位年龄■■岁的■性流浪者在2022/7/14触碰倒计时沙漏
//结果：纸条上浮现了红色字迹，内容为“2022/7/20”，沙漏内部细沙为紫色。该流浪者失踪。目前未知沙漏内部细沙为紫色对应的死亡方式。
//
//这是你。
//■■岁。
//你的性别是■。
//你在看到你的死期时夺门而出。
package wupin;
public class daojishishalou1018{
}