//Object C-85 - “倒转怀表”
//评分: +72+–x
//物品编号：C-85
//
//倒转怀表可以在任意C群层级中被发现。
//
//jw9ykV.jpg
//它看起来像一个普通的怀表。
//
//描述
//倒转怀表的外观与老式的翻盖怀表无异，体型较小但系有一条用来佩戴的轻型铁链。
//
//它分为内外两部分。外部的上层是一个由金属制成的盖子，整体表现为古铜色，上面印有“Live”的字样，盖子的形状是凸字形，中间凸起，四周呈斜坡状与下部完全契合，当流浪者触碰金属盖时会感到一种寒意。下部同样是金属外壳，呈银色，与上部不同，它的形状是平底，且有着很强的反光性，印有“Die”的字样。
//
//中部是怀表主体，里面囊括有怀表的主要部件。请注意，倒转怀表与普通怀表不同，指针一般指向十二，这是它的初始状态。
//
//用途
//倒转怀表的最主要作用是判断流浪者所处层级的危险程度。只有当流浪者打开它时，指针才会从12点出发开始进行无规律的转动并在最后稳定在一个数值中，这个数值通常代表层级的危险程度。
//当流浪者看见倒转怀表中出现的数值时。这个数值会给予流浪者一种与层级生存难度对应的带有感觉的神经冲动，这种感觉将会持续两到三分钟，在这第一段感觉过后，流浪者将会陷入“无感”的状态，之后会进入另外一种与先前感觉相反的感觉中，这段神经冲动带来的感觉的持续时间更长，有五到十分钟。例如在高度危险的层级中，流浪者如果打开怀表并看见数值，那么他将感觉到高度的绝望感和恐惧感，在感到这种绝望感后，流浪者会感到空前的平静。
//+ M.E.G.对倒转怀表的实验结果记录
//如果流浪者多次、连续地打开怀表来观看数值，第一感觉的持续时间将不会延长。
//如果流浪者进入生存难度为“等待分级”、“不适用”等层级中，那么倒转怀表只会对流浪者所在的一片区域的危险程度进行评估并起效。
//获取途径
//你可以从任意C层级拾取到它们，但一些层级只会出现一次，不过在另一些层级，它们的刷新通常有一个周期，大概在八到九个月之间，例如就有人在Level C-225中重复见到过它。
package wupin;

public class daozhuanhuaibiao1085 {

}
