//躯器编号：Flesh C-54
//
//代价：小
//
//安装位置：体外
//
//localtick
//定位蜱，该为其绘图。
//
//介绍
//定位蜱为一用于将与您同行之人的位置告知于您的躯器，其为将蜱虫进行改造及定向繁衍而得。当您在与您的同伴探索未知时，定位蜱便是您的最佳之选。
//
//当您将其安装于您的躯体时，其便可将您的血液化为能源，通过您的神经告知于您的大脑，并对您的大脑发出信号，以告知您同伴的位置。经过我们六个月的研究，定位蜱的技术已十分成熟，准确度高达约98%。
//
//说明
//如何使用：
//
//一、收集与您同行之人的一滴血液，将其滴于定位蜱之上，使您与您的同伴绑定。
//
//二、将定位蜱放置于您的躯体上（建议将其放置于腕部），待其口器插入您的体内。当其大小停止膨胀，并且其靠近定位蜱头部的部位发出血红色光亮时，便意味着其已安装成功。
//
//三、当安装成功后其尾部四个部位将会在四秒内依次发出金色光亮，其意味着已充能并加载完毕。若其有部位未发出光亮，检查您所将其放置部位的血液供应是否流畅，若流畅则请进行检查定位蜱的状态，其可能已无法使用。
//
//四、一切无误后，您将会有持续约三秒的头痛及耳鸣，之后其便可正常使用。
//
//五、其上拥有一近似扬声器的部位，您可通过该部位与同行之人输入、输出语音。
//
//六、在使用完毕后，可对其进行拍打，其便会自动脱离，并在五秒内死亡。
//
//注意：
//
//一、仅有在对方也安装定位蜱时其才可正常绑定。
//
//二、不要将定位蜱放置于敏感及重要部位。
//
//三、使用完毕后不要使用拖拽等操作，其可能会导致口器插入处发炎甚至感染。
//
//四、定位蜱仅可在所有人位于同一层级时使用。
//
//五、请将其妥善保管，若其在使用前受到任何损伤非质量问题概不负责。
//
//获取
//目前其仅可通过流浪商人处购买。
package wupin;

public class dingweipi1054 {

}
