//Object C-88 - “短匕”
//评分: +23+–x
//
//物品编号：C-88
//“短匕”只会在特殊情况下满足以下条件出现：
//
//两位流浪者发生肢体冲突；
//两人均无杀伤性武器；
//该层级生存难度在31以下
//该层级在满足以上条件时仅有两人。
//db
//已被KVZ回收的短匕，受影响的流浪者受到有效控制。
//
//描述
//“短匕”外表为一短刃匕首，刀柄材质为黑色塑料，长度约12cm，刀刃处有血迹，目前无法分析出血液中的DNA。
//
//性质
//“短匕”的异常性质在于满足特殊条件后，会出现在发生冲突的两位流浪者中“弱势”的一位，不论其是否处于占理一方。获得“短匕”的流浪者会受到精神影响，以致其产生极大的愤怒情绪，此时，该流浪者会使用“短匕”不惜一切代价攻击另一位流浪者，直至其失去生命体征，此后2，“短匕”便会消失。
//
//发现地点
//KVZ在Level C-32中的雄性盥洗室发现正在使用“短匕”疯狂地向一KVZ特工捅去的流浪者，该特工已多处受伤，目前经过紧急救治，现已无大碍。该名流浪者已受到有效控制，唯一一例尚存的Object C-88被回收。
package wupin;

public class duanbi1088 {

}
