//package wupin;
//
//public class duanshidao1014 {
//
//}
//Object C-14 - “断世刀”
//评分: +15+–x
//物品编号：C-14
//
//位置：M.E.G.武备库
//
//分类：武装 - 特级
//
//photo-1620747918218-0d99c4bf8647?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=987&q=80
//“断世刀”。摄于武备库。
//
//描述：
//断世刀是一把刃长55cm、宽4cm的短剑。回收地点已加密。
//
//在平常情况下，断世刀的性能与普通刀具并无区别；但若高速挥动此刀、也就是给刀刃施加一定的动力势能时，断世刀将呈现出类似于纳米切割的能力。具体而言，挥动断世刀几乎可以切割一切物体（详见下文）。
//
//根据使用者们的描述，使用断世刀切割物体的手感与切豆腐类似，有着一种“爽滑”的快感。此种能力本可作为颇为优良的攻击手段或是开路技巧，但是持续手握断世刀会对使用者造成轻则昏厥、重则发狂的诡异影响，导致断世刀不得不被闲置，仅在特殊情况时经由至少副兵团长级别权限的许可方才允许指定人员取用。
//
//附录：
//持握断世刀的平均清醒时间约11分钟。
//
//另外，包括断世刀在内的多个高价值武装全部具有各种令其无法持续使用的负面效果。该现象被定性为“反常”，这意味着什么当前不得而知。
//
//物品切割实验记录：
//木板 - 成功
//钢筋 - 成功
//钢板 - 成功
//合金块 - 成功
//石柱 - 成功
//砖墙 - 成功
//合金防护墙 - 成功
//一具Entity C-[已编辑]的尸体 - 成功
//Level C-[已编辑]的一面墙壁 - 成功1
//各类矿石的样本2 - 全部成功
//断世刀的配套刀鞘 - 失败
//作者信息
//« Object C-13 | Object C-14 | Object C-15 »
//
//Footnotes
//1. 并因此意外发现一个全新的层级出口。
//2. 基本涵盖7级莫氏硬度以上范围。
package wupin;
public class duanshidao1014{
}