//package wupin;
//
//public class exo1023 {
//
//}
//Object C-23 - “EXO_019”
//评分: +37+–x
//第十九号实验型单兵作战外骨骼装具（EXO_019）
// 
//91c78941449d9e0e.jpg
//E.P.B.™力作
//简介：该型号装具为由E.P.B.™研发并制造的第十九号实验型单兵作战外骨骼装具。适用于多种恶劣作战环境。该型号装具在以往型号的基础上有效增强了对敌对实体抗性（包括但不限于物理与精神抗性），最大程度地保护了使用者的人身安全。同时大幅增强了对敌对实体的杀伤力及可操作性，大大提高了使用者在恶劣作战环境下的生存概率。
//功能介绍：
//本装具由动力系统、维生系统、攻击系统与危险防护系统构成，并由脑机接口与使用者进行神经网络连接，从而使作战效益与可操纵性最大化。
//动力系统
//动力系统的核心为由E.P.B.™原子能源部研发的人造闪电原动机-液压动力装置，其主要由动力元件、执行元件、控制元件、和液压油四个部分组成。
//动力元件：
//动力元件的作用是人造闪电原动机做功产生的机械能转化为液体的压力能，向整个液压系统提供动力。
//执行元件：
//执行元件(液压马达)的作用是将液体的压力能转换为机械能，驱动负载作直线往复运动。
//控制元件：
//控制元件(液压阀)可在液压系统中控制和调节液体的压力、流量和方向。
//液压油：
//液压油是液压系统中传递能量的工作介质。由于人造原液的传导性、润滑性与修复、清洁性能良好，故选择其作为液压油。
//维生系统：
//维生系统以医用级杏仁水作为维持使用者生命体征并强化其身体机能的主要物质。安装于系统内部的微型透析器将在使用者身上建立动静脉内瘘，并刺穿内瘘后的血管，通过弥散、超滤、吸附和对流原理将杏仁水与人体体液进行充分物质交换（医用级杏仁水依靠浓度梯度从系统内向血液转运，同时水分在静水压力梯度或渗透压梯度作用下通过透析器半透膜从血液内向系统运动），清除使用者体内的代谢废物并平衡其体液，同时通过医用级杏仁水的增益效果增强其身体机能。维生系统可供给使用者长达7×24小时的身体机能所需物质并调节使用者体内激素水平，最大程度地保障并强化使用者的身体机能。
//医用级杏仁水
//医用级杏仁水由E.P.B.™生化科学部研制并生产，其生产方法为将纯净的杏仁水（自动售卖机中的罐装杏仁水为最优选择）与治愈水晶混合制成浓度为5%的治愈水晶-杏仁水溶液，并按照5:1的比例将溶液与瀑布酒精混合（该操作需在安全环境下进行），最后使用蒸馏装置将其进行蒸馏。若以上操作均准确无误，最后将会得到一种散发着微弱酒精与香草味的无色透明液体。医用级杏仁水在医疗上应用广泛，常被用于危重症患者的临床治疗（如各类药物或毒物中毒）。
//医用级杏仁水的增益效果包括但不限于：维持生命体征与身体机能、镇痛、镇咳、止泻、短时间内增强感官能力等。
//未按照药代动力学违规大剂量或长时间摄取医用级杏仁水会导致诸多副作用，包括但不限于：颤栗、头晕、恶心、管视效应、急性尿潴留、嗜睡、厌食等。
//为避免上述副作用，系统会将医用级杏仁水进行稀释并严格控制给药量，保证人员在使用期间的人身安全。在一般情况下，使用该装具不会导致任何副作用（有心脑血管、肾脏或精神疾病者严禁使用该装具）。
//5baf2cff73b8b314.jpg
//攻击系统：
//攻击系统分为主动攻击系统与辅助攻击系统。主动攻击系统为模块化系统，有诸多正在研发的攻击组件。目前已研发成功的组件有散射爆破器、扫描仪与光学迷彩。攻击系统可极为显著地增强使用者在恶劣环境遭受攻击时对敌对实体的杀伤力，使得使用者的生还几率大幅度提升。
//主动攻击系统：
//散射爆破器：
//散射爆破器由发射器与蓝砂晶榴弹构成，榴弹内部嵌入了一枚火盐晶体。当弹药被击发时，由于蓝砂的耐高温性质，蓝砂晶外壳并不会被破坏，但内部的火盐晶体会因高温爆燃，将蓝砂晶外壳破坏并一齐散射出去。由于蓝砂的危害性质与火盐晶体的爆炸反应，这一操作通常会对敌对实体及建筑物造成大量伤害。
//战术目镜：
//战术目镜为E.P.B.分子工程部对计算机模拟镜仿制并改进而成。保留了原有的生命体征，生物体受损分析、物种辨析、物体精度值，物质分析、环境（空气、天气、地质、温度）分析、危险物质与物品，生物敌意分析、动作预测分析（包括弹道预测）、动作推荐、方圆50米透视扫描等功能，并消除了原有的负面影响。
//光学迷彩：
//由E.P.B.™分子工程部研发的特殊光学迷彩镀膜被应用在护甲上，每次充能可为使用者提供数秒的隐身效果。
//辅助攻击系统：
//强化冲击：
//将动力系统与攻击系统相结合研发出的强化冲击装置可大幅增强使用者近战/破坏物体时的威力。理论上可将冲击力提升至正常人体极限的3-5倍。
//强化跳跃/冲刺：
//动力系统可为动力护甲充能，并强化下一次跳跃/冲刺的效果。
//危险防护系统：
//危险防护系统是使用者人身安全最有力的保障。该系统可为使用者提供全天候恶劣环境防护，可抵御大部分伤害及负面影响。在使用者生命安全受到威胁的情况下，系统内安装的紧急切出装置（由时空水晶制造）会立刻启动，将使用者切出至安全层级。
//目前，该装具在诸多实战测试中性能表现优异，正在对其进行小规模生产化改进，并配备给有恶劣环境作业需求的高级人员。
//
//
//实验报告A01
//实验报告A02
//实验报告A03
//测试EXO_019在极端恶劣地形下的防护性能
//测试地点：Level C-144
//测试内容：向位于该层级内的基地、前哨站与避难所输送物资
//测试结果：装具完全保护了使用者，其没有受到核辐射及“扭曲”效应的影响并出色地完成了物资输送任务。
package wupin;
public class exo1023{
}