//Object 4 - “反欧几里得装置”
//描述：
//反欧几里得装置，也被称为经纬织线机，是最初被发现于Level 5中小型补给箱内的一种小型机械体。在花费约一年的时间里，B.N.T.G.研究出了一种方案得以对其进行逆向编程工程。
//
//表面上，反欧几里得装置通常是一个长约0.25米的长方体机械体。它没有明显的屏幕接口或端口，但有一个小填料口、两个表盘和一个蓝色按钮。它的手柄处有一大段裸露在外的电线，通常是灰色的。
//
//装置的内部是极为复杂的机械系统，机体的上半部分由几个大小不一的齿轮组成，下半部分由一块电池和大约300根和织布机上的纬线一样的细绳组成，它有足够强的高频震动能力，使反欧装置会有极其诡异的效果表征。它的电池和填料口占据了其内部容量的40%，齿轮和网格架构占据了30%，其余的部分均为织布机纬线。
//
//属性：
//反欧几里得装置有几个被认为十分异常的特性。它可以扭曲空间（或者叫创造“反欧几里得空间”），作用范围通常可达50米。人眼看来，这使周遭环境在没有被缩小的情况下变得相当近。实际上，装置的每条纬线都在以各种原子（可能还要其它类型材料）的振动频率振动，因此无论目标物质本身如何，其都将会产生极大的引力。至于填料口，它已渐成为一个越来越大的谜，特别是于B.N.T.G而言，因为他们似乎越来越热衷于解密机器的有效聚变燃料到底是什么。迄今为止，发现的最有效的燃料是钻石，其次便是铜和橡胶，纸也可充当燃料，不过热效率很低。这一切都非常神秘，因为事实上输入框并没有已知的燃料消耗方法。当接近现实清新剂时，反欧装置将完全失效。
//
//用途：
//反欧几里得装置表面的两个刻度盘用于设置作用强度和作用范围。填料口用以添加任何可被使用的燃料，唯一的按钮用来激活和关闭装置。反欧装置显然对流浪者的旅行十分有利，由于它们能够轻松覆盖极为崎岖的地形，故使得利用装置来逃跑或者战斗成为可能。如果操作得当，反欧几里得装置可以将敌人扭曲至空中或者地下。然而，反欧几里得装置由于具有极强大的属性而在各组织间活动频繁的地区受到严格管控。
//
//目前大约有350个反欧几里得装置存在。其中至少有320个已然是制造完全体了。
//
//注意：常规的反欧几里得装置使用都将引起抑郁情结和恶心反胃感。不建议一天之内使用反欧装置超过20次，也不建议晕船者使用此装置。
//
//- 隐藏95834号事件报告-Keepgate事件
//日志：检索信息 95834.bntg
//世界日期 11/15/2020 14:06:05
//
//日志开始
//0:00:00: 神秘人正在接近一位商人的防御屏障。
//
//0:03:03: 神秘人在其衣袋中制作出了一个反欧几里得装置。
//
//0:03:54: 神秘人试图利用装置通过壁垒。该尝试失败，他试图利用装置来直接逾越壁垒。
//
//0:05:22: 地方值守警卫发出了警报。大致响应时间：11分钟。
//
//0:07:21: 当地平民试图规劝神秘人，与其评理，随即被扭曲至地面。
//
//0:09:45: 神秘人试图将贵重货物从墙后扭曲至地下，从而为其所有。但取而代之的是扭曲回了一堆泥土。
//
//0:13:03: 神秘人试图逃离现场，大门被及时关闭，以防其潜逃。
//
//0:14:55: 神秘人试图逾越大门。失败。
//
//0:16:04: 此人显然放弃逃脱了，他把装置扔在地上，静候着地方警卫的到来。
//
//0:19:33: 地方值守警卫到达现场。两名警卫将该男子扭送至当地的一个单向交通枢纽，等待监控录像检查完好无误后才离开。
//
//0:19:56: 日志结束。
//
//- 隐藏93458号事件报告-交易大厅事件
//日志：已被隐藏
//[内容隐藏]
//
//由于“给公众以信念”，本日志内容已被撤回。
//
//package wupin;
//
//public class fanoujilidezhuangzhi4 {
//
//}
package wupin;
public class fanoujilidezhuangzhi4{
}