//package wupin;
//
//public class fatiaowanjuxiong1012 {
//
//}
//Object C-12 - “发条玩具熊”
//评分: +9+–x
//
//物品编号：C-12
//“发条玩具熊”是后室C层群中的一种机械造物。
//bear
//某层级一黄色房间中发现的发条玩具熊
//
//描述
//“发条玩具熊”外表为棕色、黄色或粉色的毛绒玩具熊，脖子上系有蝴蝶结。它们的外表与普通前厅的毛绒玩具熊唯一的区别就是背后脖子以下的位置有一个外观古典的可拆卸发条而且身体上不存在任何缝合线。
//
//与其外表不同，“发条玩具熊”大概重1-2千克左右，且外部毛绒无法按至凹陷1。
//
//特性
//“发条玩具熊”在未被启动时保持静止且不会移动，在其背后的发条被转动并拔出后“发条玩具熊”会被启动并开始行动。
//
//用途
//对“发条玩具熊”进行不同操作会使其发挥出不同作用，已被记录的几种用法如下
//
//Object C-12说明书
//由M.E.G.整理
//用法1
//
//将发条转动1.5圈左右
//
//将发条拔出后玩具熊会快速2向发条所在方向移动并在接触到发条后立即爆炸3，威力相当于一颗前厅进攻型手雷。
//
//用法2
//
//将发条转动1.5圈，停顿一下再稍微转动一小段4距离5
//
//将发条拔出后玩具熊会开始移动并快速远离被拔下来的发条，随后在碰到其他物体时爆炸，爆炸威力为用法一的二分之一。
//
//用法3
//
//将发条转动0.5圈左右
//
//将发条拔出后玩具熊会以未知方法定位并追寻最近的实体，在找到目标后与之接触并自爆，威力与用法一相同。
//
//用法4
//
//将发条转动5.1圈左右6
//
//玩具熊的发条会无法拔出，但它依然会被启动。以被启动的“发条玩具熊”为圆心，半径3.4米的墙面、地面和天花板上会生成许多与玩具熊颜色相同的卡通小熊图案墙纸，人体与墙纸上的小熊花纹接触时会立即陷入深度睡眠至少24小时。同时玩具熊会从未知部位发出类似用指甲挠墙的刺耳、巨大的声响，吸引附近所有的实体，如果此时正处于危险层级中，这将杀死启动它的流浪者。
//
//发条不论转了多少圈都只有在拔出发条后“发条玩具熊”才会启动7，在未转动发条的情况下无法将发条拔出。
//除了上述用法外，其余用法皆会导致“发条玩具熊”立即爆炸或失控而四处逃窜最终在随机时间后爆炸。
//
//尚不确定是否仍有其他用法未被发现，如果有新用法发现请立即上报。
//
//——于2017-7-14编辑
//
//发现记录
//最早在Level C-[数据缺失]中的黄色房间中发现了一只棕色的“发条玩具熊”，随后在C层群的多个层级都有发现记录，此处不作更多描述。
//
//作者信息
//« Object C-11 | Object C-12 | Object C-13 »
//
//Footnotes
//1. 任何试图拆开“发条玩具熊”的行为都会立即致其自爆
//2. 速度真的很快，建议在拔下发条后立即将发条扔向你的目标
//3. “发条玩具熊”在爆炸后不会有任何残骸或身体部件残留因此无法对其构造进行研究。经过实验表明在爆炸发生的一瞬间玩具熊向周围喷射大量纯氧随后身体内部进行剧烈燃烧，因无法对其进行拆解而不能查明多出的氧气储存于何处。
//4. 尚没有足够的关于用法二的报告能准确推断再次转动多少才会触发
//5. 这个用法最早是一名手抖的论坛用户在对刚找到的“发条玩具熊”使用用法一时手抖而发现，他在汇报了情况后便失联并注销了账户。
//6. 由一位过于好奇的论坛用户被实体围攻时他的同伴所记录
//7. 用法4除外
package wupin;
public class fatiaowanjuxiong1012{
}