//Object C-95 - “阈限之闩”
//评分: +23+–x
//latch.jpg
//在Level C-35发现的Object C-95。生成的此物品全部处于无效状态。
//
//物品编号：Object C-95
//
//物品代称：“阈限之闩”
//
//主要分布：
//
//物品为后室原生，分布极为稀少。Level C-35与Level C-473有绝对的多数分布，但也仅有一百多次发现。其他C层群层级推测为极少量分布，但实际上只有一个发现于Level C-13的孤例。
//
//物品概要：
//
//Object C-95外表呈现为门闩，有异常的空间封闭效应与危险的精神影响效应。
//
//描述
//Object C-95 - 阈限之闩，主要外观呈现为一条门闩，全部木制，少数漆为整体红色。一般较中国传统门闩而较小较细，能够轻易携带。
//
//阈限之闩主要的异常性质是空间封锁。当流浪者将阈限之闩架在一扇门后，这扇门之后的空间将会被封锁，这个被封锁的空间一般被称为安全屋。
//
//性质
//所有已知的安全屋与空间外的连接将被直接切断，包括但不限于使用其他门走出、切出、切入、使用诺克立普贴切出。
//
//这种空间封锁效应甚至能够切断任何实体或人类进入安全屋的一切尝试。钝人将无法切入安全屋，管间肢也将不能通过水管进入。封闭的安全屋并非气密，但对于封闭空间墙壁的破坏却全部失败，空间内外联通的缝隙似乎也被完全封堵住。
//
//有一点需要关注：似乎安全屋的范围与其内流浪者的感知有关。流浪者若感到一处空间确实安全，可以作为庇护，那么安全屋就会延伸到那处空间。简而言之，安全屋的范围就是流浪者能够感到归属感的空间范围。
//
//安全屋确实极为安定。实体与人类无法进入安全屋。但是，对于流浪者的精神效应极为危险，几乎可以将大部分流浪者困毙于安全屋内。
//
//当流浪者在上述分布地层级发现阈限之闩时，产生极微弱的“囤积心理”，也即认为“这个门闩未来肯定会有用”。大多数流浪者选择随身携带该物品。实际上物品对人类的精神影响从此就已经开始，只是较为轻微。
//
//流浪者使用阈限之闩，主要动因是实体侵袭。有一些层级本身就具有较多实体，如Level 3；还有一些层级具有间歇性实体冲击，如Level C-281与Level C-75.1等。进入这些层级的流浪者，因为对生存的迫切需要而使用该物品，寻求封闭空间的保护。
//
//使用阈限之闩并得到庇护之后，流浪者会顺理成章地产生如下几种心理：
//
//安全感。由于物品的防护效果，流浪者得到了一定的安全空间。
//
//庆幸感。流浪者通常对于获得物品表现出极大的庆幸，甚至认为“能够活下来全是因为这个东西”。
//
//安逸感。流浪者甚至可能感到“这是一个能够永久安全的地方”。
//
//归属感。停留大约3~5小时后，流浪者会感到“我很有归属感，就像这里是我的家一样”。此时精神影响开始变得诡异。
//
//流浪者因为此种精神影响，短期内不会产生逃出安全屋的欲望。流浪者一般表示“外面那么危险，谁还想出去啊？”
//
//然而此时几乎已经注定此流浪者的死亡。在安全屋内停留至第二天时，流浪者一般会认识到补给即将耗尽。此时流浪者将产生矛盾心理。
//
//一方面，流浪者急切想要逃出去，回到某个基地。
//
//另一方面，安逸感与归属感，能够让流浪者产生想在安全屋内继续停留的欲望。且流浪者似乎总是认为门外有大量的实体威胁，即使门外是安静的。
//
//在这样的心理推动下，很多流浪者会选择继续停留，直到补给耗尽。
//
//耗尽补给后，似乎流浪者受到了更深层次的精神影响。流浪者将似乎忘记简单的出逃方法：将阈限之闩简单取下来。他们常常开始无用地开凿墙壁或试图从切出，但似乎已经不知道取下物品能够解决问题。
//
//在开凿墙壁的尝试失败之后，流浪者通常会陷入失落中。然而，他们受一种未知的力量推动，变得极其愿意努力尝试，然后继续开凿墙壁。因为开凿墙壁是无用功，所以，流浪者通常就在心理矛盾中渐渐耗费完体力，走向死亡。
//
//安全屋这时因为其完全封闭性，已经不能得到解除。这块空间将永久如此封闭下去，调查空间的流浪者表示“空间内散出一股难以承受的臭味”。若流浪者侥幸在无限空间内发现此种封闭空间，那么很可能是遇见了一个曾经的安全屋。
//
//大量实验却表明，在流浪者阅读档案后，阈限之闩对流浪者的精神影响将会减弱甚至完全消失，更有意志较坚定者对于物品开始表现“厌恶与恐惧”，“敬而远之”。
//
//目前没有任何事例可供研究流浪者在安全屋内长久生存的结果。但是考虑到精神影响，实验被认定为极其危险。关于本物品，所有非由实验者本人向监督者提出的实验，将会被回绝。
//
//数据库人员一致同意本部分挪用实体格式，因为阈限之闩确实有实体的危险性。
//
//行为准则
//应当
//将阈限之闩视为一种精神影响来源。
//在情急之下可以使用该物品，但必须要在危险解除的第一时间，逃出封闭空间。
//熟记本文档内容。
//不应
//过于沉溺于安全屋内。
//忘记本文档的反面案例。
package wupin;

public class faxianzhisuan1095 {

}
