//package wupin;
//
//public class fei1035 {
//
//}
//Object C-35 - “斐”
//评分: +13+–x
//8Pn7oIdyLmWXsGT.jpg
//斐初次被发现时的照片，拍摄于Level C-10。
//
//物品编号：C-35
//
//位置：M.E.G的Level C-11总站点
//
//描述：
//斐（φ）外形为一根镀金的红木龙头拐杖，下端刻有“φ”图样。经德尔塔验证后已证实它曾是龙血族的成员之一，在龙血族当中次序未知，但可知相比德尔塔较为靠前。
//
//斐有一定语言能力与智慧，且乐意与人交流。其本身无法移动，但它可以靠发出带有精神影响的声音引诱他人前去触碰它，然后在一定程度上操控持有者的身体。被斐操控的人会拥有超乎常人的体能以及凭空造物的能力，且他们会表现出极强的攻击性。斐的宿主通常会在几十分钟后死亡，在M.E.G.发现斐之前它似乎已更换了近千名宿主。
//
//采访记录：
//交流对象：探员██，已接受过精神控制训练
//采访对象：Object C-35
//交流地点：Level C-11的M.E.G.总站点的特殊收容间
//
//记录开始
//
//探员：记录已开始，正在靠近Object C-35。
//
//（低沉又苍老的男声从四面八方传来）
//
//斐：靠近我，孩子，将我拾起…
//
//探员：很不幸，我接受过系统化的训练，您控制不了我的。
//
//斐：啊，原来如此。
//
//探员：您跟龙血族的关系是什么？
//
//斐：哈，龙血族？我早就该跟他们撇清关系了。欧米伽因恐惧我夺舍他的身体而将我引诱到了一个偏远的层级，还杀死了我的肉身，可惜他还是低估了我的附身能力，我将灵魂寄托在了我的拐杖之上，渴望力量的人类一个接一个送上门来，我就在他们的手中兜兜转转着，寻找着合适的宿主。
//
//探员：被您控制过的人都死了，不是吗？
//
//斐：人类没一个能承受住我的力量的…说到宿主，我倒是感受到在这附近有一股生命的气息，与我非常契合。
//
//探员：什么？
//
//斐：那是一股属于动物的气息，我能感到我的力量与它有着共鸣…
//
//探员：您是说，谁？
//
//斐：比起龙族骨子里的张狂，它多了一分敏捷。比起人类的脆弱，它多了一份灵活的生命力。比起普通的动物，它多了一份智慧。我能预料到，我与它将有着最完美的融合，我们将会一体——
//
//（斐的声音逐渐变大）
//
//探员：好了，我该离开这——
//
//记录结束
//
//
//附录：调查过后，探员██出现严重的精神问题，斐提到的生命难道是？
//发现记录：
//斐最初在M.E.G.的一次关于Level C-10的探索行动中被发现，一名探员因受到了其的精神影响而拾起了其，随后导致了整支队伍的覆灭。M.E.G.的一支武装部队在赶到后击毙了该探员并在请示上级后回收了斐。
package wupin;
public class fei1035{
}