//Object C-91 - “风险应对测试程序”
//评分: +18+–x
//-692a02738c8a4ff8.jpg
//根据“娅莉”对自己描述所绘。
//
//物品编号：C-91
//
//描述：
//风险应对测试程序为B.F.P.F.的“创立者”所编写的智能程序，此程序主要用途为模拟有可能在层级中出现的风险并生成其对应的应对方案。虽然最初有人对其提出过质疑，但其强大的能力很快将一切谣言粉碎。
//
//风险应对测试程序通过将每层的关键词进行储存，并由程序人格“娅莉”进行学习和记忆，通过输入关键词可以查找符合条件的层级，并根据已知情况对层级内可能出现的威胁进行推测。且随着关键词的增加最终查找出的层级与相应的应对报告也会越发详细。
//
//程序拥有在多种电子设备上进行计算的能力。但考虑到最终结果的储存以及为了计算过程的速度，程序被搭载于一台处在Level-[机密信息]的大型计算机中进行数据处理。并且每一位C层群的幸存者都有权利在电子设备上的“数据库”中进行查看数据，考虑到后室多变的情况可以选择下载离线数据包以便在不稳定的层级使用。
//
//用途：
//风险应对测试程序最主要的功能便是生成一篇已知层级中可能出现威胁与其应对方案，应对方案囊括符合层级状况的任何有较大可能性发生的威胁，或者是在发现新层级后快速地将层级的信息粗略的记录、整合并上传。
//
//可以试图与程序中的人格“娅莉”进行对话，她会安抚流浪者的情绪以及劝解流浪者。“娅莉”同时也可充当流浪者的心理医生，并在层级勘探中评估流浪者的心理状况。
//
//通过输入实体的生物学特征可以快速的查询任何已知的实体，并附上应对它们的方法。目前并不支持对实体信息进行记录上传以及生成报告，这导致了B.F.P.F.对于实体的记录较少。
package wupin;

public class fengxianyingduicheshichengxv1091 {

}
