//package wupin;
//
//public class fenhangdamidisi1151 {
//
//}
//PRS-logo-4.png
//P.R.I.
//创新与开拓，只为见证彼此的未来
//D.E.O.D.
//药品实验与观察部门
//Drug Experiment and Observation Department
// 
//
//PLS-IV-151-2.png
//对象概览
//
//实验药物注册编码： PLS-IV-151
//
//次要分类编码： 000#28171928-C///2919.0001
//
//位置： 帕拉斯12Lab#药品实验与观察部门
//
//主要效用： 精神医疗用途
//
//类别： 液体药剂 注射药物 实验性 精神治疗
//
//对象基准描述
//
//PRS-logo-5.png
//PLS-IV-151。{无效文件}
//标记有「 分行达米蒂斯 」的字样。
//
//实验性药物「 PLS-IV-151 」，研究所内部指代名称「 分行达米蒂斯 」，主要效用目的为治疗患者抑郁症、自闭症、精神分裂症等精神疾病；鉴于部分施用者出现过敏反应，该药物尚处于实验阶段，不对外售出。
//
//PLS-IV-151的实验施用者多为合作团体「 M.E.G. 」成员。帕拉斯12Lab于签署合同中郑重声明，帕拉斯研究所将保障每一位患者的生命安全。相应的，M.E.G.将支付一定的治疗费用，并保证不对外公布PLS-IV-151的存在与效用。
//
//D.E.O.D.全权负责对该药物的管控与实际效用，其成果将在药物筛查部门严格审查后进入量产阶段。当前，除上述两个部门及更高等级的人员外，该药物的成分不对任何无关人员开放；同样，依照合同，M.E.G.无权过问关于该药物的任何非效用信息。
//D.E.O.D..png
//药品实验与观察部门
//D.E.O.D.
//
//
//D.E.O.D. - 全称药品实验与观察部门（Drug Experiment and Observation Department），帕拉斯研究所下属，建立于01Lab、09Lab、12Lab、43Lab等，由纳卡兰·罗瑟·米塔兰（Nakalan·Rother·Mitaran）成立，协同相关医疗部门对患者加以救治。
//该部门所处的科研领域为帕拉斯研究所的主要科研方向之一，保障了帕拉斯研究所在药物方面的进展，并以此作为起点，扩张其在后室的领域。
//
//D.E.O.D.为帕拉斯研究所成立的最早的部门之一，主要职能为研发、观察新型药物，同时记录患者反应，并对实验性药物加以修正。
//
//PLS-IV-151属于注射药物，于帕拉斯研究所中以液体药剂的形式存放入标准玻璃细口瓶内，单瓶容纳20ml，并有明显标注和说明；液体淡黄色，散发有较为刺鼻的血腥味，口服呈铁锈味且无效用：
//
//标准，单次注射＜60mg/kg，连续性静脉滴注，单日3~4次；
//长效施用，适用于普通自闭症患者、抑郁症患者；一般性人体实验采取此类注射方式，安全且无明显后遗症，后期可视患者症状降低注射量与频率。
//应急，单次注射1~1.3mg/kg，短暂性静脉注射；
//突发状况施用，适用于抑郁症/自闭症/焦虑症突发患者；具备一定镇定效果，不建议短时间内多次注射相同剂量，效用迅速但对患者记忆存在不可逆影响。
//特效，单次注射1.3~1.5mg/kg，短暂性肌肉注射。
//后期患者施用，短时间内有效降低患者症状突发频率，不具备即时镇定效果，但能降低患者轻生想法，效用迅速，未见明显后遗症。
//加持，单次注射超过1.5mg/kg，任意类别静脉注射；
//[取消记录，该注射方式被D.E.O.D.分类为机密内容]
//效果详解
//
//以标准滴注方式施用的患者会在治疗过程中无规律地出现幻听、幻视等症状，并伴随有仅被患者观察到的一个模糊人影；据悉，不同患者观测到的人影大小、年龄、性别、性格等性质均不完全相同，且此后患者每次观测到的人影不会再发生改变；
//多次重复实验，确信人影对整体治疗进程具备积极影响；患者与人影的交往程度越频繁，患者本身的精神疾病越加好转；人影将不间断出现于患者感官极限范围内，并直至患者完全康复。
//以应急注射方式施用的患者会在注射后的1~2小时内持续出现上述症状；相比于标准滴注方式造成的结果，此次人影整体轮廓愈加分明，并可观测到除面部表情以外的较为完整的人物形象，且其话语与动作越加清晰；
//多次重复实验，确信患者在出现上述症状后会在短时间内迅速冷静；据患者称，其在观察到人影后出现安心感，且人影主动尝试与患者进行沟通以试图缓解患者的紧张情绪；尚不明确此方式中人影对整体治疗进程的具体影响，目前D.E.O.D.对此保持观望态度。
//以特效注射方式施用的患者会在注射后的7日内频繁出现上述症状；相比于上述两种方式造成的结果，此次人影表现出了明显的自我意识，且患者可有意识地唤出人影并与之沟通。人影整体轮廓更加鲜明，且可观察到面部表情与整体衣着；值得注意的是，相较于一般的精神分裂症，人影的对话内容以及其知识储备并不取决于患者的意识，这意味着人影具备着独立的自我意识。
//多次重复实验，确信患者每次突发疾病后能有效抑制自身轻生想法；这一过程中将伴随着患者自言自语，实验或救治时请通报相关医务人员不必惊慌；尚不明确此方式中人影对整体治疗进程的具体影响，目前D.E.O.D.对此保持观望态度。
//D.E.O.D.拒绝不具备相关权限的人员访问以加持注射方式施用的患者，并表示此类患者将被用于更加机密的任务或实验；部分实验中可明显看出加持注射方式失败率较高，且有多例因过度不适而症状加重的患者。
//
//注意： 上述中人影形象似乎存在唯一性，且会根据不同患者的性格变化为不同的形象。
//
//实验附录
//
//【患者附录】“史密斯·伦萨·奥特里”记录
//我期待着与她的相会。
//
//每当那虚假的太阳从遥远地平线落至视线之下，璀璨星空重新覆盖着深邃天空的每一处角落，她的声音便会从门外响起——那是一道我再熟悉不过的声音，我几乎能想象出她的衣着、她的面孔，甚至是她与我对话中时刻伴随着的会心微笑。
//
//我承认，我迷上了她。她跟我说她在一次流浪途中遭受了实体，毁了容来到这个诊所救治，结束后就成了这里的一位员工。她的坚强让我无地自容，我的自尊警醒着我的脆弱。
//
//M.E.G.的负责人和这里的医生告诉我，我患上了严重的抑郁症，而我却对此漠然——既然来到了后室，自己便必然无法离开这个令人压抑、厌恶的地狱——压力控制着我的求生意志，我不止一次地尝试着轻生，想象着死亡带来解脱。
//
//我第一次向她述说我的想法后，她没有来安慰我，但她的声音依旧回荡在整个病房里，就连酒精与药的气味都变成了香气扑鼻的花香。她问，她说，她感叹：
//
//“你见过海洋里的鸟吗？”
//
//我愣了一下，并不理解她这么问的理由，理智在这一时刻下线，求知欲控制着我的躯体、意识与灵魂——我确实没见过如此异样的场面，哪怕是在后室这个充满着不合理的空间里，我甚至没真的亲眼见过海洋。
//
//“我是在后室出生的，我的母亲告诉我，在这里有一个海洋层级。”她的话语充斥着兴奋与喜悦，激动地就像一个孩子一样，“人们在那里能欣赏到海底的各种飞禽走兽，甚至能看到各类鱼在空中游动，伸手便能触摸！”
//
//随着她的形容，奇特的景象在我的脑海中一一具现，大到海洋的无穷边界，小到一草一木，光透过水痕洒在沙滩上，宁静充斥着我心中的每一处角落。
//
//当我再回过神来时，她已经离开了，似是还有工作——我不会是她唯一的病人，而她却是我唯一的慰藉——走廊的光透过病房的毛玻璃撒在地板上，映射出我那悸动的心。
//
//自此之后，她时常与我隔着病房的门畅谈着彼此对未来的幻想、对风景的感受，我们许下约定，假以时日一起去见证那个奇幻海洋。抑郁症依旧侵蚀着我的内心，但因为她的陪伴，每当自己萌发轻生的念头时，她的声音、鼓励都将我从死神的手中拉回。
//
//她如同荒漠上的绿洲滋润着我干涸的灵魂，如同大海中的灯塔指引着我迷途的意识，如同黑夜中的提灯照亮我混浊的眼睛。她成就了一个全新的人，一个不甘于向悲惨现实屈服的人，一个拥有心灵归宿的流浪者。
//
//“史密斯先生，治疗进程历经1029天，您的抑郁症可以说是痊愈了。”医生顶了顶鼻梁上的眼镜，拿着我的精神评估表微笑着向我陈述着病情，“治愈很成功，您已经可以出院了。”
//
//“谢谢克里斯医生，还有那位……”
//
//她成为了我的提灯、我的归宿、我的一切，而我却对她一无所知——我甚至没有问过她的名字，唯有她的声音。
//
//“您是在说，谁？”
//
//我发了疯地冲到护士站里询问着每一位护士，整个空间中不再回响熟悉的声音，扑鼻花香最终消散，酒精与药的气味让我清楚地意识到这里便是现实。他们迷惑的表情仿佛在告诉我一切都是我的幻觉，而我却找不到任何证据来证明她的真实。
//
//“你见过海洋里的鸟吗？”
//
//她的声音仿佛依旧在我的耳边。
//
//“那位流浪者？”
//
//“哦那个人，最近一直在向人打听一个层级，听说一个人通过了许多危险的层级。”
//
//“啊？为什么？”
//
//“谁知道呢，大家都只知道他每次找错层级回来都会继续向别人打听，不断地试着寻找。对他来说仿佛就不存在失望，啧啧，要我看，他就是吃饱了撑着。啊，他看过来了，小子别去看他。”
//
//我看着面前高瘦的男人，黑眼圈透露着他的疲劳，M.E.G.的制服早已破旧不堪，全身上下没有一处是干净的。不，并不是，我心想，他的眼神是纯粹的，他沐浴在希望之中。出升的太阳照耀他的身躯，而我却能看到他的身上不只有一个影子——他独自一人，却并不孤身一人。
//
//绝望无法令他屈服，疼痛无法令他噤声，黑夜无法令他盲目，而他早已理解最深的苦涩。
//
//“早上好，很抱歉打扰到你们，”他的微笑恒久不变，亦如那个透过紧闭大门，鼓励着他的声音，“请问你们见过海洋里的鸟吗？”
//
// 
//
// 
//
// 
//
// 
//
// 
//
// 
//
// 
//
// 
//
// 
//
// 
//
// 
//
// 
//
// 
//
//患者名单
//患者名称： 史密斯·伦萨·奥特里
//
//症状： 重度抑郁症，并发有严重的轻生想法
//
//施用药物： 帕拉斯实验性药物「 分行达米蒂斯 」
//
//效果： 效用良好，目前患者已痊愈并出院。
//
//评价：
//
//药物作用效用正常，考虑到更多的实验对象，若本次痊愈患者达到总患者的99.8%以上即可通知药物筛查部门进行审查，并将之量产化后正式投入使用。
//
//M.E.G.对此予以赞赏，并表示将加强与帕拉斯研究所的合作关系，详细合同已完成拟定后交付予01Lab。相关监视部门负责监视患者史密斯·伦萨·奥特里出院后的行动，并判断对象是否能够适应加持注射方式。
//
//——克里斯·埃夫特华生
//
//后续评价：
//
//对象行为良好，并充分证明了自身的心理素质，成功通过加持注射，并正式雇佣其为帕拉斯研究所直属小队，实验性探测小队「 达米蒂斯小队 」。
//
//行动过程无明显副作用，「 分行达米蒂斯 」的实验进展进入下一阶段。
//
//——克里斯·埃夫特华生
//
//备注：
//
//对象“史密斯·伦萨·奥特里”及其意识实体“娜米利亚”已收录至帕拉斯信息库。
//
//——帕拉斯 I 号AI-莉莉娅
//
//——★——
//
//
//克里斯·埃夫特华生
//给： 帕拉斯01Lab管理部
//Re:伦理与道德
//
//这是否依然符合伦理道德？
//
//后室并不缺少逝者，在这里，伦理与道德约束不了我们对生存的本能。生者当理解逝者的求生意志，死亡常见却不应当成为常态。
//
//我们为逝者代言，并让逝者陪伴着那些向死之人——他们将不再被苦难打倒，后室无法使他们屈服于祂，坚韧在他们的身上暴露无遗——他们称自己为践行者，践行一切他们所珍视之物。
//
//首先应当提出的是，此处即为后室，我们都是流浪之人，求生在这里大于一切，而伦理道德是富裕者的约束。PLS-IV-151的存在将会为我们对“逝者意识”的研究作出杰出贡献。
//
//「 达米蒂斯小队 」对后室勘测的成果有目共睹——他们不会被后室蛊惑，他们理解此处即为真实，他们不再是孤身一人，灵魂的交合将为他们打开新的眼见——这会成为我们在后室立足的资本，保持绝对的中立将不再是难事。
//
//同时，不仅是我们在享受这一成果，那些贪婪的人从未把他们的眼神从我们的身上挪开，他们在觊觎我们的成品，并试图将之军事化。对此，您应当更理解才是。
//
//
// 
// 
//帕拉斯01Lab管理部
//给： 克里斯·埃夫特华生
//Re:伦理与道德
//
//对灵魂的研究依旧是后室团体的禁忌，收集逝者的灵魂对他们而言无法容忍，M.E.G.和U.E.C.的注视仍在生效。帕拉斯研究所可以不关心你们的药物原料从何而来，又是如何制成的，但是记住一点：
//
//沉默不代表默许。
//
//
// 
// 
//克里斯·埃夫特华生
//给： 帕拉斯01Lab管理部
//Re:伦理与道德
//
//当然，毋庸置疑。
//
package wupin;
public class fenhangdamidisi1151{
}