//Object C-60 - “愤怒胡椒”
//评分: 
//+18
//+
//–
//X
//
//物品编号：C-60
//愤怒胡椒是一种拥有刺激生物情绪作用的胡椒粉。
//
//%E8%83%A1%E6%A4%92
//一碟愤怒胡椒。（碟子左侧为桌面孔洞，并非愤怒胡椒）
//
//描述
//愤怒胡椒为一种外观奇妙的胡椒，它具有和霓虹眼镜以及轻松可乐相似的特性，每粒胡椒的轮廓都会出现紫色的霓虹彩线。（如右图）
//
//愤怒胡椒通常被装进一个塑料的小盒子里，如果将它们取出并磨碎成胡椒粉，再将其泼洒或喷射而出，胡椒粉会在空中发出蓝色荧光并浮现出“后室娱乐”的logo和“博君一笑”的字样。
//
//用途
//愤怒胡椒可以影响流浪者的情绪，在其被磨碎前直接食用超过10克会导致生物的情绪过量，五官喷射蓝色荧光粉尘，随后死亡。
//
//愤怒胡椒磨成的粉被泼洒到流浪者身上的不同部位时会使流浪者产生不同的无法抑制的情绪，被记录的如下：
//
//在将胡椒粉泼洒到生物眼睛时，被泼洒者会不可抑制地出现暴怒的情绪且急需发泄1，大部分生物在此时都会失控。
//在将胡椒粉泼洒到生物鼻腔时，被泼洒者会不可抑制地出现悲伤和抑郁的情绪，大部分生物在此时都会变得患得患失，丧失斗志。
//在将胡椒粉泼洒到生物嘴中时，被泼洒者会不可抑制地出现饥饿的感觉并出现想要食肉的欲望，大部分生物在此时都会变得狂暴，撕咬附近的东西。
//logob.png
//浮现的图像。
//
//获取
//愤怒胡椒通常可以在Level C-70的商店中以及“后室娱乐”的销售员手中获取。
//
//记录
//以下是对一名被泼洒过愤怒胡椒的流浪者的记录。
package wupin;

public class fennuhujiao1060 {

}
