//Object C-76 - “高级盖革计数器”
//评分: 
//+31
//+
//–
//X
//
//物品编号：C-76
//位置：大多位于 Level 11 中。
//
//v9TDTf.png
//一个高级盖革计数器。
//
//描述
//高级盖革计数器为拥有黄色塑料外壳的一类电子器械，有着正常的盖革计数器的外观构造，其面盘上存在一个数码显示屏与两个位于侧面的橙色按钮。已证实高级盖革计数器的外壳具有极高的结构强度与极强的耐热耐腐蚀性，可以保证其在绝大多数情况下能够正常工作。
//
//用途
//高级盖革计数器拥有三个档位，每个档位都具有不同的功能。
//
//测量辐射
//高级盖革计数器的第一个档位功能为测量周遭环境的带电粒子辐射数值。在此档位下，该物品的功能与正常的盖革计数器没有区别。
//
//测量实体生成概率
//高级盖革计数器的第二个档位功能为测量附近环境的实体自然生成概率，测量结果显示为整数，其测量数值越大附近区域实体自然生成概率越小，包括不具备攻击性的实体的生成概率。
//
//以下为统合了一定数据之后得出的结果，注意：该表格内容不一定绝对正确，在一些特殊层级中数值可能出现偏差。
//
//实体情况	无实体或极少量实体	少量实体	中量实体	大量实体	多到难以计数
//数值结果	11800-6500	6500-3900	3900-1400	1400-170	170-1
//考虑到高级盖革计数器测量时蜂鸣器所发出的声音可能会吸引实体，不建议在实体过多的层级中频繁进行测量。
//
//测量自然切出概率
//高级盖革计数器的第三个档位功能为测量其头部所指区域的自然切出概率,其测量结果为与切出概率成正比的一串数值。当该物品指向已经贴在墙上的诺克立普贴时，其数值会显示为“FULL”。
//
//注：该档位下的测量值仅适用于从未使用过诺克立普贴的人。
package wupin;

public class gaojigaigejishuqi1076 {

}
