//Object C-58 - “过桥米线plus”
//评分: +22+–x
//
//物品编号：Object C-58
//过桥米线plus是一种可以快速加热食物的特殊油脂。
//
//描述
//过桥米线plus为呈现黄色的特殊油脂。在其特殊性质未被启用前物理性质近似于普通植物油，通常位于一种直径一厘米高5厘米带有黑色盖子的小型方瓶中。方瓶外标有以汉语简体字写成的“过桥米线plus！！！”字样，外加一行字“使用方式，生产日期及厂家以及过桥米线的传说都请参照主包装盒”。据此推测过桥米线plus应有某一更大容器进行统一存放但目前没有找到这一类容器。
//
//用途
//此物品的特殊效果在被倾倒入一份大于100ML小于2L的水中时生效。水中已经溶解的全部物质会立刻被剔除（并未找到这些物质的去向），过桥米线plus会覆盖在这份水体的表面形成油膜。
//
//此时任何穿过油膜的有机物都会产生变化，包括损失约20%的质量以及状态变为与在90摄氏度以上的鸡汤中浸泡25-30分钟产生的变化一致，但是在这一过程中该物品（相对所处环境重力方向而言）下方水体不会产生任何温度或内容物变化。这一效应最多持续两个小时后结束，结束特殊效应后的过桥米线plus会以大约每分钟1%的速度消失，进行密封环境测试后确认这种消失并不是挥发，目前尚未确定消失后该物品的去向。
//
//获取
//过桥米线plus 通常可以在Level C-70的商店中中获取。
//过桥米线plus 有小概率生成在任何C集群层级找到
//过桥米线plus 会不定期生成在故乡为云南或食用过该物品处理后食物的探索者包中生成，生成规律见下
//培养
//过桥米线plus 可以人工培养，探索者越快使用该物品并且用其处理越高热量或是越多数量的物品，其在该探索者口袋中生成的该物品的数量会越多且生成速度也会越快，通常总是在探索者进入睡眠昏迷或是走神状态恢复时发现这些东西出现在自己包中。
//
//目前已知最快的生成速度已经达到平均48小时一瓶。推测是每一次受到影响的物质损失的质量因为某种目前无法解释的原因转化为新的过桥米线plus。
//
//同时当探索者团体表现出对该物品某一类变体明显偏好时，该类变体生成的可能性会大大增加，当探索者偏好一个未生成过的口味时对应口味的变体也有极大几率会在下一次生成时出现。研究者们认为这是某种适应性进并且正在尝试引导该物品展现出他们希望的口味。
//
//+ 以下是来自有识血肉同胞的书信，在验证活性思维共享神经权限后方可查看。
//变体
//除标准的过桥米线plus外目前已被确认还存在以下变体，变化主要分为性质和口味两个方向。可以确定还有大量新的变体。但是目前这些新的变体没有进行试验和记录，建议谨慎使用这些尚未被确认的变体以防出现危险。
//
//口味
//这一方向的变化主要影响过桥米线plus异常效应在处理过有机物后有机物的口感，但是也会影响该物品的颜色和气味，这一变化方向受到使用者喜好影响严重，口味特殊的探索者总是会在数次使用后得到符合他们口味的变体，目前最常见的变体情况如下。
//
//麻辣：外观转为红色，被异常效应影响过的食物有辛辣口感，除此之外并无特殊变化
//海鲜：黄色液体中有白色不透明悬浊物，被异常效应影响过的食物会出现微弱的海鲜腥味，但是这因特性变化并不会影响海鲜过敏患者。
//清真：外观无明显变化，但是外层包装上增加了清真字样，并未发现对口感有过多影响
//被确认已有目击但是尚未记录的口味：螺蛳粉，胡辣汤，浓郁，冬阴功，豚骨汤
//性质:
//这一方面的主要影响是过桥米线plus的异常效应和容器外观，同样会受到探索者团体的使用偏好和需求影响，但是相比其口味变化的更慢且种类也更少。
//
//纯享：瓶中液体分为两层，上层为和原版过桥米线plus相同的液体，下层则是某种无法解析成分的水溶液。加入水中后除上层产生油膜外下层水也会变成对应口味的汤汁。
//油碟：瓶子直径变为10厘米，在瓶子被打开时该种类的过桥米线plus异常特性会直接生效而不需要倒入水中。这一变体由于其便利性在c层级民众自卫组织中广为流传，伍凌支队长尤其偏好这一变体。
//野营：该物品变为固体，瓶子变为直径两厘米高一厘米的柱状，使用时需要先拿出固体油脂抖入。产生的效果近似于纯享变体但是转化后的汤之中热量更高。
//B.Q.I. Inspection certificate展示区
//
//BmUdsXUz.svg
//经B.Q.I.检验，该物品各项指标均符合要求，为其颁发检验合格证书，
//
//B.Q.I. Inspection certificate编号：B.Q.I. Inspection certificate C-006
//
//检验项目：过桥米线plus	颁发日期：2022年4月1日
//颁发人员：CJZXY_Pin_Yuan	截止日期：2025年3月31日
//Object C-58 - “过桥米线plus”
//评分: +22+–x
//
//物品编号：Object C-58
//过桥米线plus是一种可以快速加热食物的特殊油脂。
//
//描述
//过桥米线plus为呈现黄色的特殊油脂。在其特殊性质未被启用前物理性质近似于普通植物油，通常位于一种直径一厘米高5厘米带有黑色盖子的小型方瓶中。方瓶外标有以汉语简体字写成的“过桥米线plus！！！”字样，外加一行字“使用方式，生产日期及厂家以及过桥米线的传说都请参照主包装盒”。据此推测过桥米线plus应有某一更大容器进行统一存放但目前没有找到这一类容器。
//
//用途
//此物品的特殊效果在被倾倒入一份大于100ML小于2L的水中时生效。水中已经溶解的全部物质会立刻被剔除（并未找到这些物质的去向），过桥米线plus会覆盖在这份水体的表面形成油膜。
//
//此时任何穿过油膜的有机物都会产生变化，包括损失约20%的质量以及状态变为与在90摄氏度以上的鸡汤中浸泡25-30分钟产生的变化一致，但是在这一过程中该物品（相对所处环境重力方向而言）下方水体不会产生任何温度或内容物变化。这一效应最多持续两个小时后结束，结束特殊效应后的过桥米线plus会以大约每分钟1%的速度消失，进行密封环境测试后确认这种消失并不是挥发，目前尚未确定消失后该物品的去向。
//
//获取
//过桥米线plus 通常可以在Level C-70的商店中中获取。
//过桥米线plus 有小概率生成在任何C集群层级找到
//过桥米线plus 会不定期生成在故乡为云南或食用过该物品处理后食物的探索者包中生成，生成规律见下
//培养
//过桥米线plus 可以人工培养，探索者越快使用该物品并且用其处理越高热量或是越多数量的物品，其在该探索者口袋中生成的该物品的数量会越多且生成速度也会越快，通常总是在探索者进入睡眠昏迷或是走神状态恢复时发现这些东西出现在自己包中。
//
//目前已知最快的生成速度已经达到平均48小时一瓶。推测是每一次受到影响的物质损失的质量因为某种目前无法解释的原因转化为新的过桥米线plus。
//
//同时当探索者团体表现出对该物品某一类变体明显偏好时，该类变体生成的可能性会大大增加，当探索者偏好一个未生成过的口味时对应口味的变体也有极大几率会在下一次生成时出现。研究者们认为这是某种适应性进并且正在尝试引导该物品展现出他们希望的口味。
//
//+ 以下是来自有识血肉同胞的书信，在验证活性思维共享神经权限后方可查看。
//变体
//除标准的过桥米线plus外目前已被确认还存在以下变体，变化主要分为性质和口味两个方向。可以确定还有大量新的变体。但是目前这些新的变体没有进行试验和记录，建议谨慎使用这些尚未被确认的变体以防出现危险。
//
//口味
//这一方向的变化主要影响过桥米线plus异常效应在处理过有机物后有机物的口感，但是也会影响该物品的颜色和气味，这一变化方向受到使用者喜好影响严重，口味特殊的探索者总是会在数次使用后得到符合他们口味的变体，目前最常见的变体情况如下。
//
//麻辣：外观转为红色，被异常效应影响过的食物有辛辣口感，除此之外并无特殊变化
//海鲜：黄色液体中有白色不透明悬浊物，被异常效应影响过的食物会出现微弱的海鲜腥味，但是这因特性变化并不会影响海鲜过敏患者。
//清真：外观无明显变化，但是外层包装上增加了清真字样，并未发现对口感有过多影响
//被确认已有目击但是尚未记录的口味：螺蛳粉，胡辣汤，浓郁，冬阴功，豚骨汤
//性质:
//这一方面的主要影响是过桥米线plus的异常效应和容器外观，同样会受到探索者团体的使用偏好和需求影响，但是相比其口味变化的更慢且种类也更少。
//
//纯享：瓶中液体分为两层，上层为和原版过桥米线plus相同的液体，下层则是某种无法解析成分的水溶液。加入水中后除上层产生油膜外下层水也会变成对应口味的汤汁。
//油碟：瓶子直径变为10厘米，在瓶子被打开时该种类的过桥米线plus异常特性会直接生效而不需要倒入水中。这一变体由于其便利性在c层级民众自卫组织中广为流传，伍凌支队长尤其偏好这一变体。
//野营：该物品变为固体，瓶子变为直径两厘米高一厘米的柱状，使用时需要先拿出固体油脂抖入。产生的效果近似于纯享变体但是转化后的汤之中热量更高。
//B.Q.I. Inspection certificate展示区
//
//BmUdsXUz.svg
//经B.Q.I.检验，该物品各项指标均符合要求，为其颁发检验合格证书，
//
//B.Q.I. Inspection certificate编号：B.Q.I. Inspection certificate C-006
//
//检验项目：过桥米线plus	颁发日期：2022年4月1日
//颁发人员：CJZXY_Pin_Yuan	截止日期：2025年3月31日
package wupin;

public class guoqiaomixian1058 {

}
