//Object 216 - “海鲁姆神灯”
//2022物品竞赛 » Object 216 - “海鲁姆神灯”
//“……他最初的破碎，起始的激燃，元始的造物都是如此灿烂夺目……他透亮清晰的神谕贯透每个位面，每个世界，每个灵魂：‘此地应有我威光。我应聚合这些光，去弥合那些暗！我要将每个灵魂中的蚀人之暗驱散！因此所有生灵皆得我引导，不再成迷途羔羊！我应在我爱之繁生之躯与魂内；在万物之中筑起抗衡黑暗的厚障壁……’”
//
//- 《万古雷瑟书》抄本
//源始之光，万物之光的创生。
//
//前言：
//为了进一步了解海鲁姆神光，我们首先得知道海鲁姆神光的实质是什么：海鲁姆神光是源始之光破碎后掉落的碎片；是包容所有产生灯火的物质的起源，海鲁姆神光亦为灯具的源头。海鲁姆神光可以以任一自然发光体的形式呈现，如星体、烛焰，广而言之即非人造的或已存在于此宇宙的自然法则者，乃至超越常规空间者，比如在后室内发现的发光物体等皆可为其载体。海鲁姆神光在此条件下仅仅会在后室中以油灯的外观呈现。如果一个人试图通过人工制造一个油灯以获取海鲁姆神光并产生其光焰的话，其与原始形式的海鲁姆神光的效能将有天壤之别1。这一现象证明了海鲁姆神光总是能在不同特定物体中存在，并诞生于多元宇宙中。
//
//描述：
//hyrum-lantern.jpg
//一盏从Level 9内取来的海鲁姆神灯的照片。
//
//左图个例是一个具有酷似70年代油灯外观的海鲁姆神光：油灯的基座及提把由锈蚀的金属制成，灯罩是包围着灯焰的薄层玻璃片。该灯具被M.E.G.人员Penelope Harveston在对Level 9的一次勘探中于一个起居室内被发现。海鲁姆神光通常能在昏暗的层级中能被发现，它们所具有的反赴火效应特性对于在后室内的生存至关重要，我们之后将会具体探讨此效应。海鲁姆神光油灯2抗粉碎，轻质，而且耐用，能够承受至少2t重的压力3。此外，这些神灯似乎能发出通感效应的灯光，这类灯光温暖，让人冷静，同时带有香气，包括但不限于：薰衣草，香草和甘菊；据估测应仅为点亮海鲁姆神灯后所产生的效应，在熄灭神灯后其不会再散发香气。而在点亮神灯时，其会发出一种类似于白噪音的较为安静的嗡鸣声。这些特性保证了面对压迫感时流浪者能保持精神清醒可控。
//
//尽管海鲁姆神灯常常发出的是一种480-515流明的白黄色的光4，目前仍存在有亮度能达到1000流明的神灯，这些神灯与其他神灯相比拥有更强烈的直接反赴火效应。但是这并不完全意味着在价值上有着极大差别，它们仍然拥有相同的IME5最大值与最小值。目前我们尚未测得海鲁姆神灯在激活状态下能维持多久，似乎只要使用者能对其发起请求其即可一直亮起。在某些情况下在被进一步注视时，此物品也会随机被激活。观察发现海鲁姆神灯在被激活时不存在任何能量增加或损失。
//
//反赴火效应：
//反赴火效应(I.M.E. )是海鲁姆神灯用来抵抗实体的效应6。影响半径为15英尺(圆周长为94.25英尺)，而这些实体最远会与神灯持有者保持30英尺的距离，如果持有者靠近实体它们会退避三舍后撤得更远。 尽管海鲁姆神灯的温度远没有达到能伤害具有攻击性和天生危险的实体，但只要它们停留在海鲁姆神灯的影响范围内便会受到神光的严重伤害，有时则会产生致命烧伤；免疫烧伤的实体并不能抵抗其伤害。
//
//如今我们发现唯一对海鲁姆神灯免疫的有机生命体是人类及永驻一族——后者不仅对一个仅已知其名的神性形象即源始神子极度崇拜，还是源始之光的亲手造物，这与我们已知的一个“碎片”不能混为一谈。无害/被动性实体在神灯影响下一般总是安全的，但也有相反的案例存在。变异为实体的人类和拥有人类智能的实体对反飞蛾效应无法免疫。由此信息我们假定海鲁姆神灯遵循着一套由于其模糊特性无法精确指出的严格先天法则。
//
//基于前置观察，神灯的激活周期(认定为不会闪动且保持常明)只要在持有者对其保持信仰的情况下就都是连续不断的。进一步研究表明相信源始之光存在的信众能将他们的神灯激活周期一直延长；在某些情况下，神灯会在危险出现时自动激活。从一盏海鲁姆神灯被停止激活算起，此区域被灯光驱赶的实体仍会对光源感到恐惧，并自主远离光源，这一情况保持约2至4分钟，之后才能恢复其基本认知能力。拥有再生能力的实体的自愈过程会更慢，但最终可以恢复活动能力。
//
//人工反赴火效应：
//由于海鲁姆神光会在全后室的油灯里存在和产生，非层级产生/非层级已有的油灯也不是此规律的例外。人工反赴火效应(A-I.M.E.)会在制造一个新油灯时发生；海鲁姆神光的确会在新油灯中生成，但这不能完全激发神灯的能力。事实上99.8%人造海鲁姆神光的能力都因人造的缘故被完全限制了。目前尚不清楚为何在此情况下几乎不可能产生有效能的人工反赴火效应7 ，尽管可能性的存在毋庸置疑；然而许多在神秘学研究方面的研究人员和学者的主流假说强烈支持了神灯与神类存在的联系，即所谓的源始神子和海鲁姆神光本身存有的明显神识。
//
//海鲁姆神光之诫：
//尽管大部分规则即使在第一代永驻一族的长老帮助下仍未被解释(其余部分则已阐明)，海鲁姆神光被推测是非自然地具有半自主神识，它遵循着由源始神子（唯一能通过源始之光制造海鲁姆神光者）制定的无法干涉，不可替代的运行规则。海鲁姆神光并非基于多元宇宙，特别是后室内亦存在的定律而产生，它几乎是凭自己意愿凭空出现的。它能发生进化并演变为各式各样的光，海鲁姆神光可能是依源始之光的在各个已知及未知方面需求而发生演化的。 排除其他的可能性，海鲁姆神光会选择油灯为其在后室内的化身，并以此形态仍在传播其影响力(即便是低效的形式) 给后室内存在的所有的油灯。尚不明确其为何会将油灯作为外体的原因，但这则证明了海鲁姆神光自身认知的模棱两可之态。
//
//补充记录：
//如下集合的是探险者总署求真者研究小组研究记录的音频文件，数据和信息，这个研究小组已被监督者议会于2021年6月19日在Tristan Petrovic的正式请求下授权进行对此物品的研究及分析。
//
//研究日志：
//Object 216 - "海鲁姆神灯"
//实验日志 #1
//日期：06/24/2021
//实验领衔：Catelyn Rodriguez
//摘要
//现如今， 我们认为Object 216“海鲁姆神灯”的激活周期(及I.M.E.效能)的设定是完全随机的。本测试意在找到真正在影响激活周期长短的因素及影响原理，并尝试将激活周期的长度设定在一个更加稳定，可靠的时间框架内以确保流浪者能通过如信仰，祈求等特定的方式来保护自身安全。
//
//为了协助接下来进行的实验，历史学家们已先行破译了来自失落时代8的经文，这些经文以直接引申形式包含了最初的有关海鲁姆神灯与神光的传说——这些传说提及了与海鲁姆神灯有关的强烈信仰现象。通过这些手稿记录，实验中我们随机选取了几名受试者，分为两组在不同情况下暴露于海鲁姆神灯光照下进行实验。
//
//实例研究 #1 - 神灯交互
//
// 
//实例研究 #2 - Level 9
// 
//
//Object 216 - "海鲁姆神灯"
//实验日志 #2
//日期： 6/30/2021
//实验领衔： Tristan Petrovic
//摘要
//在2021年6月21日晚8：03，我们首次于求真者研究小组成员Penelope Harveston在一个门厅内发现首个Object 216后在Level 9内记录到I.M.E.事件，Penelope Harveston在那里成功在一个笑魇的威胁逼近下激活了神灯。因其由衷单纯的求生欲望，神灯开始剧烈地发出金黄色爆燃灯光，烧焦了这个笑魇个体。这标志着接下来一系列测试此物品性质试验的起始，这些试验得到了监督者议会的鼎力相助。
//
//实例研究
//实例研究 #1 - 测试对象：笑魇
//
// 
// 
//
//以上信息皆来自：
//
//探险者总署
//"为了臻善的人类"
//
//万光永恒教会
//"于光明中永驻"
//
//秉光巡游，终达长明
//« Object 215 | Object 216 | Object 217 »
//
//Footnotes
//1. 通过人工反赴火效应观测到的效能比率接近100：0.2。
//2. 译注：下称此类灯具为海鲁姆神灯。
//3. 当海鲁姆神灯被摧毁后，它里面的神光便再也无法恢复其原有的效能。
//4. 光通量的国际标准单位，亦作为衡量光亮度的指标。
//5. 反赴火效应。
//6. 据现有的观察，大多数被影响的实体都是充满敌意的，但有时被动型实体也会受到此物品的伤害。
//7. 进一步说就是海鲁姆神光。
//8. 即人类在后室形成的最早的组织失落一族存在及其发展迅猛的黄金时代。
//9. 译注：原文有误，"them"应为"her"。
//10. 请注意，本次进行的实验首次发现了被动型实体也会被神灯伤害。package wupin;
//
//public class hailumushendeng216 {
//
//}
package wupin;
public class hailumushendeng216{
}