//package wupin;
//
//public class haomengguan1002 {
//	
//}
//Object C-2 - “好梦罐”
//评分: 
//+43
//+
//–
//X
//物品编号：C-2
//
//位置：M.E.G.民生部
//
//photo-1622428051717-dcd8412959de?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1160&q=80
//白昼期间的“好梦罐”。
//
//描述：
//好梦罐是一个玻璃罐，其样式在前厅内相当常见。在白昼1期间，好梦罐不表现出任何特殊性质；而在入夜时分，好梦罐将有大约12%的几率进入激活状态。
//
//激活状态下的好梦罐内部将会自发出现颜色与光芒颇似星空的未知物质，并最终充盈整个好梦罐。该物质的质感与尘埃类似，暂定名为“星尘”。
//
//用途：
//若在夜空之下开启正处于激活状态的好梦罐，星尘将会迅速朝外部逸散，并缓慢地在空气中消失。但与此同时，夜空也将迅速变化为星空、变化速度与星尘消散速度呈正比例增加。星尘完全消失时，整片夜空将完全化作星空、偶尔甚至可见一与银河媲美的天象，颇为壮观。
//
//photo-1536893827774-411e1dc7c902?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1064&q=80
//逸散的星尘。该相片由摄影师Javardh精心拍摄。
//
//夜空在受到好梦罐的影响之后，所有于该区域内入睡的人类都必将进入一个沉稳、惬意的梦境。负责守夜而未进入睡眠的卫兵等人员有报告称自己在夜间的心境也不知为何尤为宁静；当前认为这也需归功于好梦罐的积极影响。
package wupin;
public class haomengguan1002{
}