//Object 99 - “赫尔墨斯装置”
//⚠️ 安保通知 ⚠️
//M.E.G.一直在试图公开收集的所有信息，以拯救尽可能多的生命。隐藏信息对我们及我们保护的流浪者来说几乎没有任何益处。尽管如此，此页面是一个例外。如果此页面上存储的信息落入不法之人手中将带来极为严重的灾难。如要浏览此页面，请输入您的管理安保超控凭证。谢谢您的配合。
//
//>凭证已验证。欢迎回来，管理员。
//E13nXgJ.png
//一个早期的赫尔墨斯装置原型
//
//99号物体 - "基于大脑的层级传输器"
//代号 "赫尔墨斯"
//描述:
//赫尔墨斯装置
//Hermes device
// 以古希腊神明赫尔墨斯为名, 赫尔墨斯行走如飞并担任为诸神传令的使者。这是一个极强力的设备，旨在有效快速地进行跨级别传输。当前该设备仅能由U.E.C.生产制造,并且制造过程中使用了可疑的违背了道德标准的技术及元件。为了维护各派别和人们的安全保障，有关设备运行及构建的知识已被隐瞒。
//
//赫尔墨斯装置按如下方式搭建：一个人类大脑（或者动物大脑 - 需要引用更多证据证明）被淹没于一盛满高度浓烈的记忆饮料的缸中。记忆饮料中含有一融化的层级密钥。目前关于赫尔墨斯装置如何起效的研究原理是：装置诱导大脑想象使用者所处位置范围中后室的不同层级。例如，若使用者当前所处层级为56层，赫尔墨斯装置会就6-106层内进行想象。在理论情况下，大脑所想象的范围通常是100层。不同的大脑有不同的范围，这个范围取决于它们对疼痛的反应。在液缸中混入苦痛汁液可依据大脑对疼痛的反应对范围进行扩大或缩小的调节。 当一道电流通过插头作用于缸体时，传输就会开始。每当传输发生时，装置内置的大脑都会产生轻微的退化。最终，大脑会退化至若不更换大脑就无法继续使用赫尔墨斯装置的地步。
//
//单个赫尔墨斯装置在未达到无法运转的状态前至多运输150kg的物体，或者更糟的是，装置仅仅传输了一部分物体。
//
//应用:
//赫尔墨斯装置有极宽领域的使用场景，包括但不限于：例如，以“跳跃”形式展现的有效逃生手段。在面对棘手的情况时，使用小范围的赫尔墨斯装置来传送你自己至一到两层之外躲避风险。
//
//赫尔墨斯装置也可用于大范围的层级穿梭，在短短几天内跨越很多层级。尽管收获人类大脑所产生的伦理问题依然是阻止M.E.G.特工向公众公开赫尔墨斯装置的蓝图或早期原型的重大因素，在后室中赫尔墨斯装置对任何人来说仍然还是一件趁手强效的道具。
//
//得益于这些先进的功能，对任何拥有赫尔墨斯装置的个体进行跟踪都几近于不可能，M.E.G.对确定拥有赫尔墨斯装置的个体的捕获尝试均以失败告终。
//
//值得关注的拥有赫尔墨斯装置的群体如下：
//
//The U.E.C. - 赫尔墨斯装置的创造者；一个利用后室的奇怪特性开发技术，由离群的M.E.G.科学家组成的小而危险的分裂派系。目前正被M.E.G.通缉。
//
//The M.E.G. - M.E.G.在一次对U.E.C.的突袭行动中得到了几张赫尔墨斯装置的未完蓝图及一台早期原型设备，可惜他们带着完整的赫尔墨斯装置和其他违规研究及数种珍贵的资源预先逃离。package wupin;
//
//public class heermosizhuangzhi99 {
//
//}
package wupin;
public class heermosizhuangzhi99{
}