//Object 34 - “盒式录音机”
//描述：
//盒式录音机，也被称为录音机，是一种比较罕见的东西。但是在工作室1里最为常见。“音乐家”如果对某人特别有好感，或者看见某人在后室中苦苦挣扎，那么他就有可能会把这个录音机给他们。
//
//从外观上看，它与能在前厅中找到的Onn.卡带式录音机几乎完全相同，但是耐用性有所提高。除此之外，只有“RECORD”（录音）和“STOP/EJECT”（停止/弹出）按键失效。据推测，这是为了防止里面的盒式磁带的内容被覆盖或者移除。到目前为止，唯一已知的移除磁带的方法是完全摧毁这个录音机。
//
//目前有4种已知的变体音乐会从其中播放而每种音乐都与“音乐家”所演奏的音乐相同。而想要找到这些歌曲的音频记录，请查看本页面的音频记录部分。
//
//发现
//这个物品第一次出现在大众视野里是在2001年的8月6日，一位叫“@yourmomisgay”的后室论坛用户在网站上发帖说（原文如此）“兄弟们，刚刚一些奇奇怪怪的高个子音乐人走到了我面前，给了我一些水，还给了我一些想录音机一样的东西？？？WTF？？？”随后又在论坛上上传了一个单独的帖子（原文如此）“音乐听起来不错，至少是IG LOL。”其中还有一段他们按下“PLAY”（开始）并让音乐播放的视频。
//
//介绍
//想要使用盒式录音机的话，只需要按下“PLAY”即可。2而其余的按钮的作用都是不言而喻的：“REWIND”（倒带）可以快速将磁带到回到已经播放过的某一点上，而“FAST FWD”（快进）可以以更快的速度去播放音频。“PAUSE”（暂停）则会停止音频，直到你再次按下“PLAY”。不同的磁带时长也不同，但是一般在2到5分钟之内。
//
//影响
//当其处于活跃状态时，其播放的音乐会在周围10英尺（3.048米）的范围内产生一种“区域效应”就像“音乐家”所演奏的音乐一样，大多数实体在边界内会变得温顺或者消极，甚至有些实体被发现会尝试完全避开边界。然而，它并不会像“音乐家”所演奏的音乐那样对所有的实体起作用，因此它不是用来对付攻击性实体时用来确保100%可行的方案。
//
//无论这个录音机经历了什么，里面的磁带都不会坏。而如果把磁带取出来，放到另外的一个录音机里，音乐还是可以放，而且还是一样的，但是就没有了影响实体的作用。出于此，建议流浪者和工作人员最好不要取出这个磁带。
//
//理论
//目前正在研究这些音乐为什么会有这些效果，以及这些磁带时如何形成的，还有为啥它们只在原来的录音机里才起作用。截至发稿时，还是没有太多信息。但是已经有了许多的理论。如下所示：
//
//1. 音乐有能力影响大脑中对攻击性或者负面情绪有影响的化学物质，从而使大多数实体“平静”下来。
//这个理论已经被部分证实。实验发现，大多数正处于某种困境或者正在经历某种负面情绪的生物，听这种音乐会比它们自己让自己平静下来更快。然而，这是听到了音乐后带来的自然效果还是它真的能对大脑化学物质造成影响，目前还不得而知。
//
//2. 具有极端攻击性的实体或者特别容易使用暴力的实体不会受到音乐的影响，因为音乐对它们的大脑内的化学物质影响甚微。
//这与第一个理论是相辅相成的。同时许多人也认为这是很有可能的。然而，目前没有任何证据可以佐证这一点，所以目前它还是一个理论。
//
//3. 有些实体会避开这个磁带录音机，因为它们仅仅不喜欢它播放的音乐或者是带给它们的感觉。
//这是一种不太被认可的理论，但是为了研究，许多人仍然把这个作为一种可能性而记在心里。
//
//4. 这种卡带式录音机内部有一个特殊机制，可以激活磁带的相反效果。
//同样的，许多研究人员认同这是有可能的但是没有线索或者证据去支持。因为几乎没有可以完整的打开卡带式录音机的方法。
//
//随着时间的推移，还有几种理论被提出。但是它们要么不够重要而无需被考虑，要么就是可以被一起否定掉。
//
//音频日志
//截至目前，没有收集到任何清晰的音频记录。一旦收集到了清晰的音频记录，本页面将立刻更新。
//
//作者（们）
//« Object 33 | Object 34 | Object 35 »
//
//脚注
//1. 译注：主站截至发布时没有此文章
//2. 如果音频无法播放，那么请先按下“REWIND”再按下“PLAY”即可。package wupin;
//
//public class heshishouyingji34 {
//
//}
package wupin;
public class heshishouyingji34{
}