//Object 38 - “红白光”
//Object 38，更为人所熟知的名字是 Red Light White Light，是一个由后室机器人科技设计和制造的物品。 它唯一的目的便是在于检测食物是否含有任何有害生物污染。它是由G9hS54制成，而这种物质是在RLWL首次开发前被后室机器人科技发现。
//
//地点 & 取得
//强烈鼓励流浪者们取得并且使用RLWL棒 由于后室的不可预测性，食物不仅很难找到，而且往往很不安全，无法食用。正如最近在Level 4爆发的“疫疾”所证明的那样，被污染的食物已经成为了整个后室社区的重大环境威胁。RLWL棒的发明可以让流浪者们放心：他们所吃的东西，没有被有害的微生物污染。RLWL棒可以从许多M.E.G和后室机器人科技的设施中获得，它们经常被免费的发放给流浪者们。
//
//有时，像Level 122的服务员一类的智慧实体会向流浪者们提供类似RLWL棒的物品，但是我们强烈建议不要接受实体给的这种物品，因为这可能是Object 38的最原始，也是最危险的形式。，其被称为材料 G9hS54（材料G9hS54的特性将会在下文讲述）。
//
//而自从RLWL棒被首次开发出来以后，就产生了许多RLWL棒在许多层级中自然出现的报告，但是这些报告无法核实。后室机器人科技并未对此现象做出公开评论。不过还是建议流浪者不要去接触自然出现的RLWL棒，以免它们变成未经过加工的G9hS54棒子，造成不必要的麻烦。
//
//物理形态描述和使用方式
//使用前，RLWL棒的外观仅仅是一根白色的棒子，与G9hS54 类似。上面刻有后室机器人科技的logo。该物体质地粗糙，凹凸不平，拿在手里十分的不舒服。RLWL棒可能有5到20英寸（约13到51厘米）长。但是也就一个手指头一样粗。
//
//如果其被放在有着大量微生物的东西上，RLWL棒会迅速的变为鲜艳的红色。RLWL棒只能检测生物性的危害例如细菌，病菌或是真菌污染。其检测不出化学毒素或者放射性污染（尽管有着其它的方式可以检测出）。一旦RLWL棒变成了红色，那么建议流浪者们处理掉使用过的棒子,并且尽快取得新的棒子。
//
//G9hS54
//G9hS54 是RLWL棒的原始形式，极其危险。未经过加工的G9hS54棒被认为是一种生物危害。在非无菌环境中，G9hS54已经被发现不仅会吸收周围环境中的微生物，而且还会作为它们的滋生地，庇护和促进有害微生物的生长。最糟糕的是，一旦微生物充满了这根棒子，那么微生物就会被释放到周围的环境里，导致严重的生物环境污染。
//
//虽然很多实体对G9hS54吸收及释放的微生物不敏感，但是人们相信具有足够智慧的实体会意识到这些微生物会对它们的栖息地造成生物危害。这可能解释了为什么一些实体会向经过的流浪者提供这些棒子，以便摆脱它们。
//
//尽管G9hS54有对自然的危害性，M.E.G.向流浪者保证这不是需要担心的东西。这种物质不会在流浪者经常出现的层级里出现，也从未在生存等级3及以下的层级中被发现。
//
//后室机器人科技保证RLWL棒对消费者来说是绝对安全的，它经过了严格的开发测试，以确保它只会按照预期的功能运行。
//
//错误：此文件只允许被授权人员访问
//该文件属于后室机器人科技的内部文件，严禁任何公共用户访问。任何被发现访问该内容的人都会受到相应的处理。
//
//[输入授权码]
//以下为M.E.G与后室机器人科技研究主管之间的访谈记录
//
//日期： 7/15/2021
//首席采访者： M.E.G. 研究员Jessica Ryans
//监视员： M.E.G. 研究员 Sarah Jones
//辅助： M.E.G. 研究员 Alexander Azeil
//受访者： 后室机器人科技研究部主任
//
//<记录开始>
//Jessica Ryans：听得见吗？这里是 Jessica 从Omega基地报告。
//
//Alexander Azeil：收到，这里是Gamma基地。
//
//Sarah Jones：收到，来自Gamma基地。
//
//受访者：后室机器人科技总部，来自Level 522。
//
//Jessica Ryans：那么好的！既然我们已经都到齐了，那么为了这次的录制，请问你可以描述一下你们开发的RLWL棒吗？
//
//受访者：当然，根据《康科德总协议》，B.R.和M.E.G. 已经签约来共同开发技术，以促进双方利益，难道不对吗？
//
//Sarah Jones：正确的。
//
//受访者：我们已经开发了一种对于我们两个组织来说都有利的一种物品：这种物品可以直接检测出任何食物或者饮料有没有受到任何有害微生物的感染而无需放到显微镜下再检查了。
//
//Jessica Ryans：这可能很有趣。那么差不多——
//
//Alexander Azeil：好的，稍等…我们都知道这个东西之前是什么：G9hS54，确切来说。我们怎么知道它现在是安全的呢？
//
//Sarah Jones：是啊…说的很好。也许你可以再摄像头下为我们演示一下？
//
//受访者：当然。给我点时间…
//
//(受访者将摄像头转向一个实验设施。上面有一个新鲜的苹果，一个烂掉的苹果和两根RLWL棒。)
//
//受访者：看上去似乎右边的苹果安全且可以食用。那我们来测试一下。
//
//(受访者将RLWL棒在这个苹果表面上反复摩擦，而这个棒子始终是白色的。受访者咬了口苹果，显然没有任何的问题。)
//
//受访者：显然，左边的那个覆盖着霉菌水果是完全没法食用的。现在我去测试一下。
//
//(受访者将另一根RLWL棒放到了那个烂苹果的表面上。很快，这个棒子的顶端就变成了红色，并且蔓延到了整个棒子。受访者最后一次将RLWL棒举到摄像机前，最后兴冲冲的将其放下。)
//
//Jessica Ryans：各位！看到了吗！我就知道这是个好东西！
//
//Alexander Azeil：我猜是的…但是在我接受这个东西之前，我还是想要知道更多的信息。
//
//受访者：嗯哼?
//
//Alexander Azeil：我们听到一些传闻说最近你们的一位员工失踪了。这不会和这个物体有关吧…？
//
//受访者：这和我们的产品没有任何关系，Azeil博士。这位员工从一开始就在不停的制造麻烦，我们只好…将其… 终止我们的雇佣关系。
//
//Alexander Azeil：嗯哼，好吧，那应该很正常。最后一件事，你能概述一下这个产品的生产过程吗？
//
//受访者：我不确定你是什么意思。
//
//Sarah Jones：我猜他想问的是，你们采用了什么方法，来让其变得安全？
//
//受访者：嗯，这是一个相当技术性的问题，并且我不认为这是这次采访。
//
//Alexander Azeil：那好，你看，我也是个研究员。事实上，我们这里所有人都是。而且是我想知道。
//
//受访者：有什么问题吗？Azeil博士？你似乎…相当的不配合啊？我已经向你展示过了这个东西的作用了，而且我没有当场去世。这还不能证明什么吗？
//
//Alexander Azeil：我只想提醒你，上次你再我们这里推销物品时发生的事：小台灯是——
//
//受访者：你是在质疑我们后室机器人科技的诚信吗？
//
//Alexander Azeil：哦，我亲爱的朋友，我当然是在质疑你们的诚信，因为啊，你们在用那个小台灯 监 视 我 们。
//
//受访者：最后说明一次，摄像机是这个小东西导航的必需品！
//
//Alexander Azeil：同样的，我们没 有 理 由 去 相 信——
//
//Jessica Ryans：ALEX! 够了！让我们给她一个说话的机会。
//
//受访者：谢谢你，Ryans女士。还有，Azeil先生，如果你能让我把话说完的话，我会在这次会面结束后把关于RLWL棒的设计以及其是如何运作的文件发给你。
//
//Jessica Ryans：这听起来真不错！如果这真的很困扰Alex，我们可以在私下里见面。这些可以确保一切都按照计划进行！
//
//Interviewee：这很好。但是…既然我已经给你们展示了物体的作用以及效果，那么在我们结束这次会议之前，我们是否可以确认RLWL已经得到了你们的最终批准？我们不希望在我们进行大规模生产时，却收到你们宣布取消了我们的生产计划。
//
//Alexander Azeil：但是我不觉得——
//
//Interviewee：我向你们保证，后室机器人科技是以帮助流浪者为荣的。我们绝对不会提供任何不安全的东西给流浪者们使用。而你们完全没有必要担心。在我们这边，产品发布前已经进行了全面的测试。所以我们向你保证它们的使用是绝对安全的。
//
//Jessica Ryans：好的！对我来说，这些产品显然是安全的，而且我也能看出它十分有用。我可以得到你的允许吗？Alexander？
//
//Alexander Azeil：我不觉得…诶，好吧。
//
//<记录结束>package wupin;
//
//public class hongbaiguang38 {
//
//}
package wupin;
public class hongbaiguang38{
}