//Object 56 - “后室终极食谱”
//Cookbookcover
//原本的一张照片
//
//描述
//关于Object 56，最广为人知的便是一本名为《后室终极食谱》的15页小本，其被复印并分发到了后室的各个层级中。有关这本书的起源暂时未知，但其为目前在后室中被分发最多的书本之一。这本书由B.N.T.G.发现于Level 3的一扇栅栏门后，然后其使用了一根杆子将书移动到了较近的地方，并带回基地放到了仓库中，目前其原始副本仍保管于基地。
//
//这本书的尺寸十分小，长约7英寸（约18厘米），宽约5英寸（约13厘米）。其封面为红色，充满磨损及各种污渍和撕痕，部分地方已经变色，且封面上除了标题之外完全空白。其首页上可能印有引言和作者，但不知为何其被撕除，所以这本书的作者暂时未知。
//
//其每一页都有一个食谱，且其中大量食谱都涉及到仅存在于后室的物品，例如火盐鸡尾酒和皇家口粮奶昔。所有的食谱都完全按照美国饮食习惯撰写，所以这使得M.E.G.更难去寻找这本书的起源。同时这本书也是记忆汁的配方来源，尽管与其相关文档中的配方有所不同。另外，其所有配方都经过了测试，并且在Level 6.1、Level 11、Level 4等层级中获得极大成功。虽然其原本已经非常老旧并且已经褪色，但其副本已经被保存在PDF文件或其他实体副本上，以下便是其书本内容的数字副本：
//
//隐藏副本
//1
//
//
//
//皇家口粮奶昔
// 
//
//材料：
//1整份皇家口粮
//1又3/4杯原味幸运豆奶
//鲜奶油和樱桃（可选，不过十分推荐）
// 
//
//1: 将皇家口粮切成16块，以避免其结块，然后将其和豆奶一起放入搅拌器。
//
//2: 将其搅拌至光滑，豆奶用量取决于个人口感爱好。
//
//3: 在其表面上撒上鲜奶油和樱桃。当然，其他材料例如巧克力糖浆、糖屑、碎饼干等也可增加其风味。
//
// 
//
//评价：
//
//
//这道甜品在派对上绝对是个绝品！如果你或你的好兄弟想找到一个非常易做的甜品，这个仅需5分钟就可以做出来的菜谱一定会十分有用。此外，如果你的孩子渴望放学后吃点零嘴，这便是一个便捷易做的完美零食。当然，皇家口粮或许有点难找，但它可是必不可少的一部分！你也可以尝试放点巧克力或者香草豆荚来添一些风味，我保证，每个尝试过它的人都会上瘾！如果你曾得到过一些皇家口粮，千万不要犹豫，快去做这道美食！
//
//
//2
//
//
//
//火盐鸡尾酒
// 
//
//材料：
//1盎司白兰地
//1盎司薄荷杜松子酒
//1盎司黑刺李金酒
//1盎司黑莓利口酒
//1盎司石榴汁
//1/4盎司高度朗姆酒
//几搓火盐
//1: 将除火盐与朗姆酒外的所有材料倒入玻璃杯并搅拌，其玻璃杯需高身且耐高温。
//
//2: 当以上材料混合后将朗姆酒倒于其上。
//
//3: 将火盐洒在玻璃上，然后立即点燃酒精，让其燃烧约20秒后将其熄灭。
//
//4: 再次搅拌饮料，并溶解余下火盐颗粒。
//
//5: 开始享用吧！
//
// 
//
//评价：
//
//
//受1991年深受喜爱的动画片《辛普森一家》的启发，火盐鸡尾酒便是那完美的兴奋剂，或只是漫长的一天后一道简易的酒精饮料。当然，无论你怎么喝，都需要非常小心如左图那样燃烧的炽焰，并且一定要非常谨慎地使用火盐。为免烧伤自己，请使用个小杯子或容器，并佩戴上一副防火手套来倒入这些材料将是最好的方式，小心玩火烧到了自己，毁掉了本该美好的夜晚。另外这火焰将会烧的很高很烈，注意安全第一。所以快来享受这美妙的混合，美妙的烈酒吧！
//
//
//
//3
//
//
//
//扼杀者意大利饭
// 
//
//材料：
//1磅扼杀者肉，生熟皆可
//1夸脱扼杀者高汤
//1汤匙植物油
//3汤匙无盐黄油，分放
//1颗中号青葱，切碎（约1/2杯）
//1又1/2杯香米
//1/2杯白葡萄酒
//1/4杯磨碎的帕尔玛干酪，一些额外的干酪用于刨花
//盐，调味
//1: 若需要烹饪扼杀者肉，最建议的方式便是水煮。加一些香料，如蒜、生姜和一些葱来添加风味，若生吃请跳过这步。
//
//2: 除扼杀者肉外准备好每一种材料，放到一旁，将扼杀者肉切成小块，备用。
//
//3: 在平底锅中，用中火加热高汤，待高汤温度上升后调至小火，不要让高汤沸腾。
//
//4: 在另一个大锅中，用中火加热植物油和1汤匙黄油，将葱煸炒2-3分钟直到其变成半透明状。
//
//5: 加入香米，继续煸炒1-2分钟，不要停止翻炒，以避免大米变成棕色。此时，香米会散发出坚果的香味。并被植物油完全包裹，另外也可以加入一些杏仁水来调味。
//
//6: 将白葡萄酒慢慢倒入锅中，继续烹饪1分钟，不要停止翻炒，直到白葡萄酒全部吸收到香米中。
//
//7: 用勺子将高汤倒入锅中，不断翻炒，直到香米将高汤吸收，每次加入的量不要超过1勺。这一步非常重要，千万不要停止翻炒，不然米饭会烧焦。
//
//8: 等到米饭几乎烧干后，再加入一勺高汤，重复这个步骤，直到高汤全部倒完。其过程大约需要20-30分钟，可以在过程中品尝，当香米有嚼劲后即可。
//
//9: 当所有高汤倒入后，加入剩余的黄油和帕尔玛干酪，按自己的口味用盐调味。
//
//10: 拌入鸡肉，盛在小碗中，配上额外的帕尔玛干酪即可享用这道美食！
//
// 
//
//评价：
//
//
//意大利饭做起来相当不容易，但绝对值得一试！如果没有更好的方案，扼杀者肉便是鸡肉的美味替代品！烹饪意大利饭的过程将会十分枯燥乏味，而且原料（尤其是扼杀者肉）很难获取，但是当一切都完成后你绝不会后悔！快享受这道美味佳肴吧！
//
//
//4
//
//
//
//记忆汁
// 
//
//材料：
//1磅碾碎的蠕灵, 约4-6只
//4盎司水/杏仁水
//袜子（或其他布料）
//1: 戴好手套，用手挤压蠕灵，直到毒液从它们的咽部溢出，然后继续挤压直到其被压成糊状，或者几乎完全液化。
//
//2: 在你的煮沸安全的容器，加入液体和蠕灵。
//
//3: 用火加热至沸腾，直到其散发烟草气味(在这之前不要关火)，烹饪长短取决于你需要的药品效果。
//
//4: 冷却后，将液体倒置在袜子上，使记忆汁过滤到罐子中，然后扔掉袜子和大块残渣。
//
//5: 装瓶冷藏保存。
//
// 
//
//评价：
//
//
//尽管这本书的其他食谱在任何时候都非常有趣且实用，但这个食谱不应被滥用，这是种应适度使用的药物。还有，千万不要喝生记忆汁，因为你会失去除了基本人类技能之外的所有记忆！当然，每周服用次数不要超过1-2次，以避免对其上瘾。 在服用记忆汁时，一定要记住基本的预防措施，永远不要对其上瘾，快去享受记忆汁吧!
//
//
//5
//
//
//
//幸运豆奶冰淇淋
// 
//
//材料：
//1又3/4杯重奶油
//1又1/4杯幸运豆奶
//3/4杯糖
//1/8茶匙盐
//1条香草豆荚纵向一分为二
//额外的配料，如曲奇饼、巧克力饼等
//1: 向平底锅中倒入一杯奶油，加入糖、盐、香草籽和香草豆荚。
//
//2: 用中火加热混合物，直至糖完全溶解。关火，加入剩下的材料，若有其他需求，可加入其它配料，然后搅拌混合。
//
//3: 将其放入冰箱冷藏直至变稠，需用冰箱保存。
//
// 
//
//评价：
//
//
//谁不喜欢像个小孩子一样颓废地舔着美味的老式冰淇淋呢？只要使用美味的幸运豆奶，你就可以在家中制作属于自己的冰淇淋！我非常推荐原味冰淇淋，当然，你也可以加入可可粉或者草莓来做出不同味道的冰淇凌！这样美味的豆奶将给你带来一场十分美妙的体验，让你回味前厅的感觉！
//
//
//
//
//6
//
//
//
//同心虫大餐
// 
//
//材料：
//鸡肉腌料（可选）
//1汤匙芥末（若条件允许可使用研磨芥末）
//1汤匙白胡椒粉
//1茶匙洋葱粉
//1汤匙辣椒粉
//1汤匙盐
//2杯酪乳
//面粉用料
//2又1/2杯面粉
//2又1/2汤匙盐
//1又1/4汤匙粗盐
//3又1/2汤匙辣椒粉
//3汤匙白胡椒粉
//1汤匙芥末粉
//2茶匙洋葱粉
//1汤匙大蒜粉
//1汤匙黑胡椒
//1汤匙姜粉
//2茶匙干百里香
//2茶匙干牛至
//同心虫土豆
//3磅同心虫肉（磨碎的）
//1/2杯黄油
//1/2杯牛奶
//1/2杯酸奶油
//盐和胡椒调味
//肉汁
//2又1/2杯扼杀者高汤
//5块干蘑菇
//1颗蒜头
//4汤匙黄油
//4汤匙面粉
//2杯浓郁的同心虫或扼杀者高汤
//盐和胡椒调味
//一大撮盐
//棕黄油玉米
//1-2根玉米
//3汤匙无盐黄油
//盐
//1: 首先开始制作腌料，将除了乳酪外所有调料倒入碗中，然后将乳酪慢慢倒入。而制作乳酪替代品时，可使用柠檬或酸橘等柑橘汁代替2汤匙牛奶。
//
//2: 将同心虫放入腌料中，盖上盖子，冷藏1-24小时，该步骤和上一步可选，但十分推荐。
//
//3: 在另一个大碗中混合面粉的所有原料，将腌好的同心虫肉放入直至被其完全覆盖。
//
//4: 在大锅中倒入油，加热到350℉，将同心虫肉煎3-5分钟。
//
//5: 捞出将同心虫肉擦干。
//
//6: 将被磨碎的同心虫肉放入碗中，加热牛奶和黄油直到其完全为液态，然后慢慢搅拌到所需的稠度（粘稠度有要求，并不是任何粘稠度都可以）。
//
//7: 加入酸奶油、盐和胡椒粉，备用。
//
//8: 在另一口汤锅中倒入扼杀者高汤，放入蘑菇，用文火慢炖，当其即将要沸腾的时候降低温度。
//
//9: 将蒜头去皮并切半放入，可以放入几片百里香。
//
//10: 用小火炖10分钟，然后将其中的食物捞出，放入一个临时容器中。
//
//11: 在一个中号炖锅中用中火融化黄油，然后将面粉小心地倒入。
//
//12: 再一边搅拌一边将高汤倒进面糊中，搅拌，直到其变稠，在其变稠后加一撮盐。
//
//13: 将玉米粒全部剃下。
//
//14: 在一个小炖锅将黄油融化，直到其变为棕色。
//
//15: 当其变为棕色后立即关火，加入玉米粒和盐。
//
//16: 小心地将同心虫土豆放在最底端，浇上肉汁与棕黄油玉米。然后将炸鸡放在其顶部，再撒一层肉汁，也可以撒碎乳酪和细香葱少许。
//
// 
//
//评价：
//
//
//谁能抗拒这份肯德基风格的自制晚餐呢？虽然这些配料看起来雄心勃勃，但你会对麦田提供的这些美味感到十分震惊！除了同心虫与扼杀者，所有的材料都隐藏在那麦田的深处。这份同心虫晚餐绝对会让你回味无穷，使这道菜的美味在脑中久久不会散去。
//
//
//
//
//7
//
//
//
//炸蜘蛛
// 
//
//材料：
//1杯中筋面粉
//1颗大雌禽蛋
//1杯杏仁水
//冰块，用来使水冷却
//2杯菜籽油或植物油
//4只大型八层之蛛（约8厘米左右为最佳）
//1茶匙烟熏辣椒粉
//1: 将面粉筛入碗中，备用。
//
//2: 将雌禽蛋打到一个单独的小碗中，将雌禽蛋打散。
//
//3: 将冰水倒入雌禽蛋中（若冰块还未融化，请将冰块过滤），混合。
//
//4: 将面粉与其混合，直到小面团消失，形成面糊。
//
//5: 将油倒入一口深平底锅中，将其加热至350℉。
//
//6: 用刀将八层之蛛腹部切开，用打火机、火把等东西将八层之蛛的毛发全部烧焦。
//
//7: 将每只八层之蛛裹上面糊，确保其没有结块，而是均匀沾在八层之蛛上。
//
//8: 每次油炸一只，一次油炸一分钟，炸至金黄，捞出，放在纸巾上晾干。
//
//9: 将每只蜘蛛纵向切半，撒上辣椒粉，切掉头部末端以防止误食毒牙。
//
// 
//
//评价：
//
//
//哦！是蜘蛛！虽然它们看起来挺残忍，但是应该更馋人！这些来自洞穴的大蜘蛛们可以直接油炸，当做开胃菜食用。当然，一定要非常小心地把毒牙去掉，烧焦掉蜘蛛的毛，以免影响口感。快去享受这道菜吧！
//
//
//8
//
//
//
//炒雌禽蛋
// 
//
//材料：
//4颗大雌禽蛋
//1/4杯混合奶油或牛奶
//1/4茶匙盐
//1汤匙黄油
//摆盘用的黑胡椒
//摆盘用的切碎新鲜香草（可选）
//1: 在中等大小的碗中放入奶油、混合奶油和盐，将其用力搅拌，直至混合。
//
//2: 在不粘锅中融化奶油，然后通过倾斜锅底来使黄油铺满锅底。
//
//3: 将雌禽蛋倒入锅的正中央，调至中火。
//
//4: 让雌禽蛋在过中烹饪几分钟，直至边缘凝固，当其凝固后使用塑料锅铲将边缘拉至中心，重复步骤，直到雌禽蛋炒熟。
//
//5: 一旦雌禽蛋形成云朵的形状，便可将其在锅中折叠，雌禽蛋应是固体状态但不应太干。
//
//6: 将雌禽蛋从热锅上盛入盘中，然后用胡椒调味，插上香草装饰，享受这道美食吧！
//
// 
//
//评价：
//
//
//炒雌禽蛋看起来是道非常简单的菜，但如果方法正确的话，这道菜将会非常美味！跟那些普通老旧的炒鸡蛋说拜拜吧，试试这道用雌禽蛋做出来的完美炒蛋！你也可以试着搭配培根、吐司或是奶酪，这些美味的搭配将有无限可能！
//
//
//9
//
//
//
//大丛林巴西莓早餐
// 
//
//材料：
//1根香蕉，切片
//1/2杯蓝莓
//1/2杯草莓
//3/4杯幸运豆奶（最好为香蕉味或草莓味）
//1/2杯以幸运豆奶制作的酸奶
//7盎司来自大丛林的巴西莓泥
//什锦配料（坚果、即食麦片、其他水果等）
//1: 将香蕉切片，放在盘子或是烤盘上，加入蓝莓和草莓，放入冰箱冷冻。
//
//2: 将未冷冻的巴西莓放入搅拌机，直到其被搅拌为泥状。
//
//3: 水果冷冻后，将豆奶和酸奶放入搅拌机，因为其特性，幸运豆奶和酸奶将是最佳的选择。
//
//4: 放入冷冻水果，在低温下混合，在过程中需要时不时停下来压一压水果，确保其完全混合。
//
//5: 将其完全混合直到其变得光滑，若有需求可以添加更多豆奶。当然，这个浆糊肯定会很稠。
//
//6: 将混合物倒入两个碗中，将你喜欢的配料摆到顶部，便可以开始食用了。
//
// 
//
//评价：
//
//
//巴西莓绝对是你开始美好一天的必需品，这来自大自然的新鲜水果是这世界上无与伦比的美味，其富含营养和抗氧化物质，增强大脑功能，让你提前做好迎接漫长且艰难一天的准备。若你发现自己在大丛林，不妨摘点巴西莓作为第二天的早餐，你绝对不会后悔的！
//
//
//10
//
//
//
//格拉夫堡
// 
//
//材料：
//汉堡胚
//2又1/2茶匙酵母
//1/2杯原味幸运豆奶
//1/2杯水（水更好，但杏仁水也可）
//3又1/2杯面粉
//5汤匙谷朊粉
//1又1/2茶匙盐
//1汤匙糖
//3汤匙植物油
//1颗雌禽蛋
//1颗雌禽蛋黄
//酱料
//1棵甜洋葱，切丁
//植物油
//盐
//1杯蛋黄酱
//1/2杯番茄酱
//1/2杯芥末酱
//1棵莳萝泡菜，切丁
//黑胡椒粉
//肉饼
//1磅格拉夫肉馅
//盐
//切达芝士
//美国芝士
//格外的配料，如西红柿、生菜、洋葱等
//1: 首先我们从做汉堡胚开始，先将豆奶加热至微温，将酵母倒进去，静置3分钟。
//
//2: 倒入3又1/2杯面粉，取出5汤匙，然后倒入来自麦田的5汤匙谷朊粉，将其混合在一起。
//
//3: 在大碗中倒入刚才的混合面粉、糖和盐，若你有搅拌器，可以开始慢速搅拌，直至所有材料混合，然后慢慢倒入植物油、酵母混合物、鸡蛋和蛋黄，继续搅拌直到其成团。
//
//4: 将面团揉成球状，放入一个抹满油的玻璃碗中，盖上盖子，在明亮温暖的地方醒1小时。
//
//5: 将面团压在洒满面粉的案板上，将面团分成6块，然后揉成圆形。
//
//6: 将面团放在托盘上，盖上盖子，再放30分钟，将烤箱预热至375℉。
//
//7: 打开盖子，在面团上刷上蛋液，放入烤箱烘焙15分钟。
//
//8: 从烤箱中取出，刷上黄油。
//
//9: 开始做酱汁，洋葱切丁备用，用中火加热大平底锅，直到油完全覆盖锅底。
//
//10: 将洋葱煸炒几分钟直到透明，加入盐，关火。
//
//11: 将所有材料，包括洋葱，搅拌到单独的碗中，直到其完全混合。
//
//12: 开始做肉饼，取1磅格拉夫肉馅，放入大碗中，分成8份。
//
//13: 用中火加热平底锅，不放油，将1份肉馅放到平底锅上，压成饼状。
//
//14: 调味，煎2分钟。
//
//15: 翻动肉饼，加入奶酪，再煎1分钟。
//
//16: 将肉饼从锅中取出，开始组装汉堡。
//
//17: 在下半部分汉堡胚中加1勺酱料和第一块肉饼。
//
//18: 第二块肉饼重复步骤13-16。
//
//19: 加入第二块肉饼，然后淋点酱汁。
//
//20: 添加任何你想添加的配料，并盖上汉堡胚顶部。
//
// 
//
//评价：
//
//
//鲜嫩、多汁、美味，这个汉堡绝对会是你每天必须的美味！许多食材，例如谷朊粉和格拉夫肉，都可以非常容易地在麦田中获取，而且格拉夫肉是牛肉的最佳替代品。此外，你也可以试试用小麦面包作为面包胚，或是加更多的肉，比如培根！你还在等什么？架上烤架，带着你的兄弟一起去做格拉夫堡吧！
//
//11
//
//
//
//零食室可可味饼干松露
// 
//
//材料：
//36块来自位于零食室中的O’Mio面包房的可可味夹心饼干
//8盎司奶油干酪（未软化）
//1杯白巧克力片
//椰子油
//1: 在料理机或搅拌器中，将O’Mio的饼干混合，直到磨成碎屑，取出一勺，放在一旁。
//
//2: 加入奶油干酪，继续搅拌，直到混合均匀。
//
//3: 在铺有羊皮纸的烤盘上将混合物团成球，盖上盖子冷藏30分钟。
//
//4: 用双层锅炉中火加热白巧克力片，根据需要加入椰子油搅拌，使混合物逐渐软化。
//
//5: 将松露倒入白巧克力中，放回烤盘使其变硬。
//
//6: 将剩下的饼干屑撒在松露上，另外，牛奶巧克力也可融化成酱并将其淋到松露上。
//
//7: 立即食用，或放冰箱中冷藏保存。
//
// 
//
//评价：
//
//
//快快速，简单，这些美味的零嘴肯定是一个人的快乐源泉！椰树岛便是个吃椰子的好地方，由新鲜椰子榨成的椰子油在很大程度上都有助于提升风味！当然，零食室中O’Mio做的可可味夹心饼干也是这些美味小松露的关键原料，她很乐意提供这些！1快去享受吧！
//
//
//
//12
//
//
//
//辣蛋炸面
// 
//
//材料：
//1包来自麻烦小店的Meri’s Chin牌方便面
//1茶匙干蔬菜片
//1汤匙黄油
//1茶匙切碎的橄榄油腌蒜
//非常少许火盐粉
//1汤匙红糖
//1汤匙照烧酱
//1颗鸡蛋，轻轻打匀
//各种百吉饼调料
//1: 按照包装上的说明书将方便面进行烹饪，不放调料包，加入蔬菜片，面料沥干备用。
//
//2: 将黄油放入平底锅，用中火融化，加入蒜煸炒约一分钟后小心地加入火盐。必须小心地撒入，并立即将其混合到黄油中，避免其燃烧。然后加入红糖、照烧酱和调料包搅拌。
//
//3: 形成粘稠酱汁后，加入沥干的面条，将其覆盖在酱汁上，然后将面条移到锅的边上。
//
//4: 将打匀的鸡蛋倒入平底锅的另一边，调中高火。
//
//5: 将鸡蛋放入面条搅拌至鸡蛋凝固，熄火。
//
//6: 在其之上放上百吉饼调味料即可食用。
//
// 
//
//评价：
//
//
//客观来说，这或许是这本书中看起来最难吃的一道菜之一，但它的外表完完全全地欺骗了你！不过其中作为调料的火盐或许让你感到十分困惑，但它便是辣味必不可少的源泉！当其溶于杏仁水时，火盐便会失去它的辣味，但在辣酱中，这辣味添了一丝其妙的味道，信不信由你。另外，这同样也是一道快速且简单的菜，只需要一包简简单单的方便面便可在几分钟内完成一道美味的午餐！
//
//
//13
//
//
//
//水世界卡琼海鲜煲
// 
//
//材料：
//海鲜煲调味料
//1/3杯烟熏辣椒粉
//3/4杯老海湾调味料
//3汤匙辣椒粉
//2汤匙芥末粉
//3又1/2汤匙盐
//2汤匙糖
//3汤匙黑胡椒粉
//1汤匙碎香菜
//2汤匙干百里香
//卡琼辣黄油
//4根黄油
//12瓣蒜，切碎
//3汤匙调味料
//1汤匙烟熏辣椒粉
//2汤匙老月桂调味料
//海鲜煲
//水
//2颗柠檬，切开
//2颗蒜头，切半
//2颗黄色洋葱，切碎
//6穗玉米，去皮，切半
//2磅动物写字楼的烟熏猪肉香肠
//1只大沙克蟹
//2又1/2磅水世界小龙虾
//1又3/4杯+2汤匙鱼汤
//2汤匙酱油（若条件允许尽量用白酱油）
//1汤匙白葡萄酒醋
//5片月桂叶
//剩下的调味料
//盐
//2汤匙任意辣度的辣椒酱
//15颗红土豆
//2磅水世界对虾
//1: 首先我们来做卡琼调味料， 先把所有佐料混合在一起，放在一旁。
//
//2: 当调味料制作完毕后，用中火融化黄油，直到其变成液体。
//
//3: 煸炒去皮大蒜2-3分钟， 加入辣椒粉、老月桂和3汤匙调味料，继续搅拌30秒。
//
//4: 然后就可以开始制作海鲜煲了，首先拿出你手中最大最高的锅，并将你前面为其所制作的调料放进去。然后将其装满水，直到水刚好可以从锅中溢出，然后调大火，让水沸腾。
//
//5: 现在便开始准备蔬菜，把黄色的洋葱切碎，将一半的柠檬、大蒜和去穗的玉米与其也放在一旁。
//
//6: 将提前做好并烟熏过的来自动物写字楼的烟熏猪肉香肠切成段，每段3英寸，备用。
//
//7: 随后便是处理海鲜，先把沙克蟹的腿掰下，每只腿分成两簇肉。然后将小龙虾放入一盆水中，静置8分钟，沥干水分。再次放入水中，轻轻搅拌，再次沥干水分。 继续重复两次，然后放在一旁。
//
//8: 取3/4杯+2汤匙高汤，倒入另一个碗中，与酱油和醋混合。
//
//9: 煮熟后，加入高汤与调味料，并和其他材料放到水中，用一个长木勺轻轻搅拌。
//
//10: 加入煮沸的调味料和辣椒酱，继续彻底搅拌，但不要一次加入所有的调味料，慢慢加入调味料，汤应有辛辣味，且充满了浓郁的卡琼风味。
//
//11: 一旦水沸腾，将土豆放入并煮10-15分钟，直到其煮熟。 当土豆煮好后，加入香肠和海鲜，轻轻搅拌。
//
//12: 然后盖上盖子，将火焰温度由高调至中高，让锅慢煮10分钟。
//
//13: 随后加入玉米，关火，再次轻轻地搅拌，将玉米在锅中放5分钟。
//
//14: 完成后，便可开始摆盘。用报纸将整个桌子顶部覆盖，小心地将液体过滤，将其全部沥干。 然后把海鲜煲倒在桌子上，再把辣黄油倒在上面，就可以通知你的客人煮好了，然后尽情享受吧！
//
// 
//
//评价：
//
//
//海鲜煲是一道无法用语言形容的美味，海鲜香肠的辛辣、玉米的鲜咸以及美味无比的黄油酱汁，构成了这样一道吃了就可以进天堂的美味大餐。你也可以在其中随意放入其他海鲜，比如龙虾和鱼！此外，如果人多的话，你可以将所有材料翻倍，满足每一个人的胃口。这道菜，是你不能错过的美味。
//
//14
//
//
//
//Aussie叔叔2的惊喜河口沙拉
// 
//
//材料：
//松树沙拉酱
//3/4杯来自泥泞水潭的干松针
//过滤完的沼泽水3
//2汤匙柠檬汁
//1/2茶匙盐
//1瓣大蒜
//1茶匙枫糖浆
//沙拉
//3棵切碎的莴苣
//红甜菜
//白软干酪
//树莓酱
//混合橄榄
//细香葱
//鹰嘴豆
//黑森林豆腐
//坚果和种籽
//2汤匙干松针
//1: 先开始做沙拉酱，首先在玻璃瓶中装1/3杯松针，然后加入过滤完的沼泽水。装满沼泽水后将罐子密封，放在阴暗温暖的位置一周。当然，只要按照正确步骤来制作，这道菜将十分安全！
//
//2: 将油过滤到另一个瓶子中，可以根据口味适当加入一些白醋提味。
//
//3: 加入柠檬汁、盐、大蒜和枫糖浆，搅拌至混合，备用。
//
//4: 在两个碗中将所有菜分半数分别放入，而莴苣我推荐用长叶莴苣。
//
//5: 在上面放上配料和沙拉酱，就可以尽情享用啦！
//
// 
//
//评价：
//
//
//松针？！不，你什么都没看见！所有人都知道沙拉是午餐晚餐的必备品，Aussie叔叔的惊喜河口沙拉就是正餐开始前的一道十分美味的开胃菜！松针的味道和长叶莴苣完美地混合在一起，虽然可能会有人对它的味道感到怀疑，但当你尝过便会知道，这道沙拉就是你吃过最好吃的沙拉之一。
//
//15
//
//
//
//TMIG脏脏布丁
// 
//
//材料：
//2包巧克力布丁粉
//1杯糖粉
//8盎司软化奶油芝士
//1/4杯软化黄油
//12盎司Cool Whip鲜奶油
//40块来自O’Mio的面包房的可可味夹心饼干
//20只TMIG毛毛虫
//1: 将布丁粉和牛奶在碗中混合，静置2-3分钟。
//
//2: 在一个碗中，将糖粉、奶油芝士与黄油打至顺滑。
//
//3: 将奶油芝士混合物倒入布丁粉和牛奶中，搅拌，直至其混合，然后将其与鲜奶油轻轻搅拌。
//
//4: 将半数饼干放在一个大袋子中压成碎屑，撒入布丁中与其混合，而另外半数摆在布丁上。
//
//5: 然后小心地将TMIG毛毛虫放入布丁中，当然，你可以挑一些颜色好看的。
//
//6: 盖上，冷藏30分钟即可使用，若想保存需冷藏。
//
// 
//
//评价：
//
//
//这是道十分经典的甜品，其利用了“这肉真黏牙”毛毛虫为这道本就非常美味且诱人的甜品锦上添花。另外这道甜品的名字也很具有欺骗性，因为吃它的时候一点都不脏。只要学会这道甜品，你的客人将对此欲壑难填。
//
//
//
//原本目前正处于B.N.T.G.的保护之下，为该组织拥有的为数不多不出售的物品之一。但需要注意的是，其中似乎有几页被撕掉了，这也证明了为什么书中没有引言、结语、署名、目录或索引等。
//
//粗略估计，此书在后室的各个层级中被印刷及发放了约45万次，而其中所有的菜，例如辣蛋炸面或Aussie叔叔的惊喜河口沙拉都被证明只要是在注意安全的情况下烹饪将十分安全。而且这些菜不仅十分安全，还在一些美食评论家及流浪者中好评如潮，书中的所有菜在诸如Level 11和Level 162中都非常著名且流行。
//
//同时书中也提到了一些真实的地点和品牌，比如O’mio的面包房和Meri’s Chin方便面。前者已经在Level 6.1经营了很多年，最初还只是是餐厅外的一个小摊位，但自从这本书大规模出版以来，O 'Mio的面包房已经成为Level 6.1中最受欢迎的地方之一。 这家面包房的老板Minnie O 'Mio说，她并不知道这本书的作者是谁，因为在这本书被发现之前，她这里基本没有常客。 不过，她很乐意接受这新的开始，因为她现在每天都能卖出数百个她的招牌可可味夹心饼干。且自从这本书被发现后不久，Meri’s Chin方便面也在Level 480被发现，在这之前有关该品牌的方便面几乎无人知晓，现在它已经成为该层级中最受欢迎的物品之一，也导致许多流浪者为了获得方便面而却沦为该层级中陷阱商品的刀下亡魂。不过这同时缩小了这本书可能被撰写的时间范围，但Entity 155在最初发现这本书的时候还没有被发现，这又是一个问题。
//
//另外，这本书的作者似乎对更神秘的层级相关知识有着非常难以置信的丰富程度，例如Level 480和Level 66—M.E.G.对这两个层级的所知都十分有限，而书中的这些细节使得寻找作者变得更加困难。且有关该书，我们得到了很多不相关的信息及一些伪装成作者的人，却没有获得任何有用的证据，而部分原因则由于Level 3一些其不可探索的特殊性质。B.N.T.G.已经创建了一个非官方附加文件，以供社区发布属于他们自己的食谱。 若获得了有关该作者或该书的任何相关信息，都应立即向M.E.G.报告。
//
//作者信息
//« Object 55 | Object 56 | Object 57 »
//
//Footnotes
//1. O’Mio面包房为Level 6.1中真实存在的一家餐厅，但对她的采访并未得到任何有关该书作者身份相关信息的重大突破。她声称，在这本书被发现之前，并未记得有任何人打算撰写这样一本烹饪书，或是购买如此之多的夹心饼干，但她肯定因这本书获利。
//2. 有关“Aussie叔叔”的身份完全未知，书中对其也没有任何详细介绍。
//3. 尽管饮用Level 66的沼泽水会造成危险，但该菜谱已经过测试，可以安全食用。有关其原理暂未有明确结论，据推测其与松针发酵过程有关。package wupin;
//
//public class houshizhongjishipu56 {
//
//}
package wupin;
public class houshizhongjishipu56{
}