//package wupin;
//
//public class houshikafeitaozhuang1168 {
//
//}
//PLS-IV-168 - “后室咖啡套装”
//评分: +33+–x
//统合物品分类系统
//物品编号 #：PLS-IV-168
//位置：帕拉斯各大仓储与转运基地和咖啡厅
//安全性：安全，无害
//用途：
//食品食材
//状态：
//正在量产
//描述
//后室咖啡套装外观表现为一个咖啡色手提箱，其中装满了各种咖啡。
//后室咖啡套装为完全人造产品，最先由后室厨师联盟研究并调试，后被帕拉斯研究所工贸部引进，进行量产，运输与销售。
//据箱内咖啡外包装显示，后室咖啡套装内的咖啡均采用Level C-offee同款咖啡豆，由咖啡豆先生拼配，联合帕拉斯研究所，采取多种加工方式，呈现同种咖啡的挂耳，胶囊，手磨以及速溶款式。 后室咖啡套装不仅包含了“热带风味花魁美式”，“摩卡咖啡”，“拿铁观音”等经典款式，也包含来自海外的“编3码咖8啡”，“’它是活的！’星冰乐”，“嘉年华卡布奇诺”等其他咖啡。
//
//获得方式
//在Level C-offee中与咖啡豆先生讨论有关咖啡的问题有机会获得其赠送的后室咖啡套装。
//在帕拉斯研究所设立的售卖点可以使用12L杏仁水购买。
//在帕拉斯官网上可以使用5L杏仁水购买，并由其送至你所在位置。
//在帕拉斯研究所各大仓储与转运基地进行抢劫。（也许军事部的同志们会将你抓走，但是这不妨是个方法）
//实验报告
//后室咖啡套装内容物为黑色至咖啡色的粉末状固体，其每份质量约为10克，具有咖啡香气。
//其提取物（咖啡因）1具有刺激心脏、兴奋大脑神经和利尿等作用，因此可以用作中枢神经兴奋药。它是阿司匹林等药物的组分之一。易溶于氯仿、水及乙醇等。含结晶水的咖啡因为无色针状晶体，在100℃时即失去结晶水，并开始升华，在120℃升华显著，178℃升华很快。
//在规定量内2对人体无害。
//
//附录
//帕拉斯研究所某军事部成员与某商贸部成员的非正式讨论记录
//
//军事部：我觉得我们有必要讨论一下你们引进并生产这玩意的原因。
//
//工贸部：它很好喝，不是吗？
//
//军事部：好吧，那确实。可你们为什么不能去咖啡厅？
//
//工贸部：懒
//
//军事部：真服了你了，这玩意对我们研究所没有任何作用啊！
//
//工贸部：你的观点我不敢苟同，没准这玩意能卖个好价钱呢。
//
//军事部：不是我说，谁要这玩意啊？
//
//工贸部：别瞎说，你等着，过两天上架了保证打你脸
//
//帕拉斯研究所商贸部某成员的日记
//
//今天我们又开了一次直播，可真他妈的累
//不过头头说我们今天晚上的销售额突破了3万升杏仁水，估计大家能涨薪，这么累也值了
//话说军事部内家伙明天估计没话说了
//
//话说这咖啡真的那么好喝吗？
//我明天得去顺一，哦不不，买一份走
//好像今天除此之外也没什么发生的了
//那就言尽于此吧。
//
//2022年10月27日夜
//
//
//
//喜报
//
//在昨天晚上开展的直播中，工贸部奋勇拼搏，不断挖掘后室良品，成功的创下了单次直播销售额破3万升杏仁水的好成绩！希望他们在接下来的“双十一”大促中再接再厉，争取早日突破5万升杏仁水的大关！
//
//特此通报，以示鼓励
//
//
//
//帕拉斯研究所管理部
//2022年10月28日
//
//脚注
//1. 又名咖啡碱、茶素
//2. 400mg/天或3杯/天
//+关注 后室厨师联盟&帕拉斯研究所
//
//x1193
//   2022-10-27 22:30 发表于Level C-offee
//
//还在为无法随时随地品尝到Level C-offee的咖啡而发愁吗？
//还在为无法在课堂上集中精神而苦恼吗？
//还在为无趣的生活或是工作而惆怅吗？
//找我们就对啦！
//
//帕拉斯研究所联合后室厨师联盟强强联手推出
//
//后室咖啡套装
//
//即日起，至12月1日，仅需5L杏仁水，您就可以将我们原价12L杏仁水的后室咖啡套装带回家！
//我们的 后室咖啡套装采用Level C-offee同款咖啡豆，由咖啡豆先生精心拼配，并采取多种加工方式，为您呈现同种咖啡的挂耳，胶囊，手磨以及速溶款式！您仅需5L杏仁水，就可以品尝多达80余种咖啡！
//
//我们的 后室咖啡套装不仅包含了“热带风味花魁美式”，“摩卡咖啡”，“拿铁观音”等经典款式，您同时可以品尝到来自海外的“编3码咖8啡”，““它是活的！”星冰乐”，“嘉年华卡布奇诺”等新奇口味，真的是难得一遇的好物！
//
//现在购买后室咖啡套装，还将赠送价值3L杏仁水的咖啡豆先生同款手冲壶，同款咖啡杯，同款胶囊机各一件!
//
//数量有限，欲购从速！
//
//本产品由后室厨师联盟研发，由帕拉斯研究所进行量产与配送，保证到您手上的每一份都是最好的一份！我们承诺，不拿咖啡香精当浓缩咖啡骗人！我们还保证，如果到您手上的任何一份产品出现问题，我们将为您直接换上一份新的！
//
//你还在等什么？
//
//点击文末阅读原文，转到物品页，立刻下单吧！
//
//阅读 11.4万	
//评分: 
//+33
//+
//–
//X
//阅读原文
//
//精选留言	写留言
//vCbTiV.png
//Herman Maye 来自 Level C-113
//非常实惠的咖啡套装！孩子已经喝了之后很高兴！
//
//vCbII0.png
//X1193（作者） 来自 Level C-offee
//谢谢您的支持！
//
//vCcWz6.jpg
//Liurd 来自 Level C-11
//活动有效期到几号呢？
//
//vCbII0.png
//X1193（作者） 来自 Level C-offee
//12月1日呢亲！
//
//vCb4Zn.png
//Null0 来自 Level C-45
//可以用其它方法支付吗？
//
//vCbII0.png
//X1193（作者） 来自 Level C-offee
//可以的！不论是火盐还是寂静汁液都可以！详情信息请点击阅读原文
//
//vCbWrj.png
//TaRtaR0S 来自 Level C-11
//咋下单？
//
//vCbII0.png
//X1193（作者） 来自 Level C-offee
//点击阅读原文即可！
//
package wupin;
public class houshikafeitaozhuang1168{
}