//Object C-63 - “后室轮盘赌”
//评分: +43+–x
//
//物品编号：C-63
//“后室轮盘赌”是一种外观类似左轮手枪的枪械。
//
//描述
//%E4%B8%80%E6%9D%86%E5%AF%B9%E7%9D%80%E4%BD%A0%E7%9A%84%E7%A0%B4%E6%9E%AA%E3%80%82%E7%AD%89%E4%BC%9A%E5%84%BF%E5%88%AB%E6%89%A3%E5%8A%A8%E6%89%B3%E6%9C%BA......
//一张“后室轮盘赌”的照片。
//
//“后室轮盘赌”外观与前厅的六弹巢双动式左轮手枪无异，其型号大多为前厅常见的型号。
//
//然而“后室轮盘赌”的枪身无法以任何已知方式损坏，还会散发出无法去除且异常浓郁的酒精味或烟草味。其枪管左侧有一行英文铭文：
//
//"Roll the Dice On."“孤注一掷。”
//“后室轮盘赌”的转轮可以取出，其中6个弹巢均未填装子弹，但任何填入弹巢的事物都会因不明原因弹出弹巢。在按照“俄罗斯轮盘赌”的方式1操作转轮后，转轮内会以未知方式填入1~6发子弹。转轮重装后在首次扣动扳机前将无法取出。此时“后室轮盘赌”的枪管右侧会出现另一行铭文，铭文的内容与填入子弹的数量有关，以下文字可供参考：
//
//"To hell."“下地狱。”——1发
//"To world."“回人间。”——2发
//"To goodland."“好去处。”——3发
//"To home."“归家路。”——4发
//"To heaven."“上天堂。”——5发
//"To hometown."“还乡道。”——6发
//“后室轮盘赌”在首次重装转轮，扣动扳机后将和普通的左轮手枪无异2——失去其特殊功能，可将对应型号的子弹装入弹巢，可将弹壳和未发射的子弹3取出，以及，可以损坏枪身4。
//
//用途
//就像俄罗斯轮盘赌一样，使用“后室轮盘赌”也是极度危险的——持枪者将一把操作过转轮的“后室轮盘赌”对准自己的要害5，扣动扳机6，如果持枪者得以幸存，就会切入任意一个层级；反之，则会直接留下一具尸体，进入坟墓7。根据大量报告得知，切入的层级的生存难度与“装填”的子弹数有关：
//
//1发——不易生存但仍有机会逃离的层级（生存难度4、生存难度5）
//2发——生存有一定难度且有稳定出入口的层级（生存难度2、生存难度3）
//3发——容易生存且可以安全切入或切出的层级（生存难度0、生存难度1）
//4发——必定会带你回家
//5发——没有生存压力且环境宜人的宜居层级（宜居 ）
//6发——未知8
//“后室轮盘赌”的扳机只有在持枪者对准自己要害时才能扣动，且持枪者必须为人类。
//
//在此M.E.G.建议，当你的处境十分危险时，可以考虑使用填装了2~5发的“后室轮盘赌”9碰碰运气。以及，将已经使用过的“后室轮盘赌”作为正常的左轮手枪使用。
package wupin;

public class houshilunpandu1063 {

}
