//Object C-99 - “后室白鼠”
//评分: +20+–x
//物品编号：C-99
//
//位置：[机密]
//
//分类：工具 - 重要
//
//photo-1558494949-ef010cbdcc31?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1034&q=80
//“后室白鼠”的运算引擎一角。
//
//描述：
//“后室白鼠”乃一代号，其本身是由克莱尔博士主导改造的一台巨型机（但其固有性能完全无法再称“巨型机”）。帕尔特博士和安瑟博士也在后室白鼠的程序开发工作之中作出了极大贡献。
//
//后室白鼠的原机与改装材料等并非由M.E.G.持有与提供，而是直接取自被“龙血族”毁灭的Level C-[数据隐藏]废墟；此层级的原生环境原本拥有着现阶段M.E.G.尚且不及的发达科技水平。然而，该层级遗留了大量可供回收的机械设备，甚至还发现了一台尚存修复希望的巨型机。M.E.G.仰仗多位人员的学识与不懈努力后，终于在[机密日期]得以将其改造为如今的后室白鼠。
//
//但是，碍于后室环境、WiFi强度以及多种不稳定的现实层面之制约，后室白鼠的运作极其困难、也根本无法承载多个程序。在经由讨论决定后，M.E.G.最终决定仅将后室白鼠用于一个用途：运行“白鼠”程序。后室白鼠遂因此得名。
//
//用途：
//后室白鼠仅仅负责运行“白鼠”程序。该程序在运算系统内通过搭建理想模型而打造出了一个名为“A”的虚拟人格，操作员们可以通过输入与调节各项“环境”参数、“事件”参数等等，从而模拟“A”在各种后室环境下的遭遇，进而帮助整个M.E.G.进行危机预判或是战略预演。
//
//可惜，由于M.E.G.本身尚对后室信息知之甚少，且巨型机本身的运作功耗极大，以及“预演”行为本身存在的混沌性较高，后室白鼠当前仅被用于预演一些情况单纯但结果较为重要的情景，并往往能够成功。为了对需要预演的情况进行牢牢的掌握，一次预演往往需要重复数百次，甚至更多。
package wupin;

public class houshibaishu1099 {

}
