//package wupin;
//
//public class houshilvyouzhinan1006 {
//
//}
//Object C-6 - “后室旅游指南”
//评分: +18+–x
//
//物品编号：C-6
//后室旅游指南在层群C中许多层级的角落都可以被找到。
//
//ATtlJrCm52W1IVn.png
//后室旅游指南的封面图案。
//
//描述：
//后室旅游指南通常以橙白配色的四折小册子的形式出现，出版社一栏印有“后室旅游集团”的字样1。它们上面印有对当前层级情况的描述，这些描述会随着持有者身处的位置自动改变2。不过后室旅游指南上的文字通常与实际情况不符，并无多大参考意义，以下是对后室旅游指南内容的一些摘抄：
//
//以下内容摘录自Level C-35：
//沉浸在大自然中总是放松身心的好方法，在本层，您简直能看到自然在向你招手！
//找个湖划两下船，您就能看到本层的著名景点——耀尘潭3？
//那些长着很多眼睛的家伙其实比看起来的温柔许多，不用害怕它们，享受您的旅途吧！
//以下内容摘录自Level C-32：
//厕所？为什么您会想到来这度过您的假期呢？不过我们尊重您的选择！祝您旅途愉快！
//不推荐使用本层的化妆品，如果您想要化妆品，本集团会提供更好的，详情请咨询锟斤拷烫烫烫烫烫烫烫烫烫。
//以下内容摘录自Level C-111
//游客若在此层遭受人身损害，本集团概不负责。
//本层有着许多的树，还有些东西，没了，我说没了，就这些了，真的就这些了，我记录完了，喂？说真的我要死了，喂？这么久过去了还有人吗？4
//本层有着后室中罕见的自然风光，实乃居家旅行的不二之选，可惜此地不宜久居，拍下两张照片，让它成为你永恒的回忆吧。
//以下内容摘录自Level C-5：
//这里没有色彩，实际上，这里是彩色的
//白光是所有色彩的结合。不必在意那些污渍
//这里因为你的到来而缤纷多彩，你不应该离开这里
//来源：
//你需要找到一个穿着橙色衬衫，戴着白色棒球帽，头部为一颗黑色几何球体的人形实体。当你向它询问本层情况时它便会塞给你一份后室旅游指南。
//
//这一页面等待着更多人的记录。
//在为层群C的任意层级写上2到3句古怪的介绍后，请在作者展示里用“作者[[*user 你的用户名]]”的格式加上你的大名。
//
//
//作者信息
//« Object C-5 | Object C-6 | Object C-7 »
//
//脚注
//1. 关于该组织的情况仍在调查中。
//2. 本物品只在层群C有效，它在其他层群中不会显示任何文字。
//3. 实际应为“濯尘潭”
//4. 本段文字在3天之后被替换成了如下一段文字。
package wupin;
public class houshilvyouzhinan1006{
}