//Object 16 - “皇家口粮”
//jelly.jpg
//一张皇家口粮的照片，摄于暴动之前。
//
//皇家口粮为一种仅会在后室中发现的珍贵食物。因其往往被迅速消耗殆尽，尚未知亦不可能确切知晓它是否会变质。
//
//描述
//皇家口粮为一种可食用的白色明胶。吃下它的人普遍同意其为“我所吃过的最好吃的东西”。 然而，当具体描述其风味时，人们的说法却大相径庭——范围从“一种微甜而宜人的味道”乃至于到“与神明相衬的飨宴”。
//
//摄入任意分量的皇家口粮都将提供相当于3份正餐的营养价值。理论上说，这一性质本可用于解决后室的饥饿问题。但，由于任何吃下了多于1茶匙“皇家口粮”的人都将狂热地冀求摄入更多的量，上述设想难以落实。
//
//基础的化学检测1已彻底排除该物品中含有成瘾性药物的可能。进一步的化学检测因食品样本频频丢失，在后勤意味上已是不可能的，据推测，其症结在于持有者的监守自盗。
//
//来源
//目前尚未有已知手段生产该物品。皇家口粮常常是从那些与秘密组织有所联系的人手中流出的。
//
//历史
//皇家口粮最初在Level 4 事件爆发后数日，于Level 23中被一探索者小组发现。
//
//当时，因该小组急需食物，他们选择食用皇家口粮，并依赖着极薄的口粮切片维生，最终成功逃离了该层级。随后，有赖于小组内部较高的道德水准，该小组迅速成为了一个举足轻重的团队。
//
//这只团队在来得及留下名号之前就解散了，最可能的推想是皇家口粮的耗尽。据报告，当时的Level 23内仍存在4份皇家口粮，鉴于其固有性质，我们对其所知甚少。
//
//该物品之后曾在Level 56的297个包装完好的盒子中被发现。盒子平平无奇，仅有其中一个被用马克笔写上了《出埃及记 3:8》。在被多个小型团队仅两日的围攻之后，我们再未能发现上述提及的任何一个盒子。
//
//"我下来是要救他们脱离埃及人的手，领他们出了那地，到美好宽阔流奶与蜜之地，就是到迦南人、赫人、亚摩利人、比利洗人、希未人、耶布斯人之地。"
//
//《出埃及记 3:8》
//
//Footnotes
//1. 于次优环境下施行package wupin;
//
//public class huangjiakouliang16 {
//
//}
package wupin;
public class huangjiakouliang16{
}