//Object 22 - “回溯机器”
//object221.jpg
//一台原始的回溯机器。
//
//object222.jpg
//为方便使用而制造的扩展硬件。
//
//回溯机器可用来查看物品的历史状态。
//
//描述
//回溯机器表现为相对稀有的老式计算机。由于它们较为老旧，许多可能已经因被破坏而无法使用。其内部表现为一个由未知材料制成的大型黑色盒子，触感光滑，可以安全地触摸和保存，其本身无用途，只有在与回溯机器的其他硬件和软件配套时才能使用。
//
//性质
//回溯机器能够用于查看并恢复到物品的历史状态。将需要恢复的物品放置在距离回溯机器30厘米及以下的范围内时，可以使用键盘描述该物品外形，这会将数据输入黑色盒子中并使其尝试找到附近的物品。该系统易发生故障，已经制造了扩展硬件以方便使用。
//
//其中一个此类扩展硬件是在外观上类似3D打印机的设备。将想要恢复的物品放入该扩展设备的平台上，机器只要连接到回溯机器，就会扫描该物品并将其恢复到屏幕上指定的任何历史时间点的状态。  
//
//使用回溯机器时，有三个选项可供使用,包括“查看”、“还原”和“恢复”。单击查看将显示指定物品的基本几何图，使用滚轮能显示该物品的历史状态，最早到原材料，回溯机器无法将对象还原到更早的状态。单击还原将使指定物品回溯到屏幕上显示的状态。单击恢复将使指定物品恢复使用回溯机器之前的状态。
//
//发现地点
//回溯机器被发现于办公区EL3A，Level 4 的多个房间中及Level 13的某些高层房间中。package wupin;
//
//public class huishuojiqi22 {
//
//}
package wupin;
public class huishuojiqi22{
}