//package wupin;
//
//public class huiyibei1037 {
//
//}
//Object C-37 - “回忆杯”
//评分: +13+–x
//jL9HZ6.png
//橙色回忆杯
//
//物品编号：C-37
//
//位置：后室内的绝大多数层级
//
//描述
//回忆杯是一种在后室绝大多数层级都能被找到的物品。其拥有与前厅杯子相同的外观。其材质与款式是完全随机的。
//
//回忆杯内通常盛有不同量的纯净水，这些纯净水完全可以饮用。当流浪者饮用回忆杯内的纯净水后，其总是会不可避免地回忆起一些事，并且之后记忆会受到不同程度的影响。
//
//_
//+ 查看更多- 关闭
//jLYVVP.jpg
//透明回忆杯
//
//在经过多次研究后发现，回忆杯对回忆内容和记忆的影响往往与其颜色有关。不同颜色的回忆杯对流浪者记忆的影响程度不同。以下记录了不同颜色回忆杯的特点以及其所会引发的回忆中的一部分。值得注意的是，这些回忆随机产生自该颜色回忆杯对应的一系列回忆中。
//
//白色回忆杯
//白色回忆杯是最常见的一种回忆杯，在后室绝大多数层级都有可能出现。饮用其杯内的纯净水后，流浪者回忆起的事情往往是一些无关紧要的小事
//
//散步
//人生千百次散步中毫无特殊的一次
//冥想
//通常是一次无意义的冥想，类似于上课发呆
//陌生人
//人生中所遇到过的万千陌生人中的一个
//
//根据报告，白色回忆杯似乎并不会对记忆产生影响，这也使它成为唯一一种不会对记忆造成影响的回忆杯。
//
//绿色回忆杯
//绿色回忆杯常出现于一些宜居层级，例如Level 48。饮用其杯内的纯净水后，流浪者往往会回忆起一件令他们感到快乐的事情
//
//中奖
//一次令人感到惊喜的中奖
//高分
//一次意外的高分
//胜利
//一次比赛的胜利
//
//在流浪者饮用绿色回忆杯中的纯净水后，所有悲伤或令人懊恼的回忆都会变成令人快乐的回忆。这会使流浪者变得乐观而对未来充满信心。
//
//蓝色回忆杯
//蓝色回忆杯常出现于一些生存难度为0的层级，例如Level 20。饮用其杯内的纯净水后，流浪者往往会回忆起一件让他们感到悲伤的事情
//
//失败
//一次比赛的失败
//离去
//挚友或亲人的离去
//分手
//与曾经深爱的那个人的分手
//
//在流浪者饮用蓝色回忆杯中的纯净水后，所有悲伤或令人懊恼的回忆都会加深，这也使流浪者脑中悲伤的回忆不再能被绿色回忆杯修改。这会使流浪者变得悲观而对未来失去信心。但是流浪者若能够从悲伤中脱离，那么他将会得到更强的意志力。
//
//紫色回忆杯
//紫色回忆杯常出现于一些生存难度为1的层级，例如Level 1。饮用其杯内的纯净水后，流浪者往往会回忆起一件令他们感到恐惧的事情
//
//追杀
//来自实体或人的追杀
//鬼怪
//往往是流浪者自己脑中所构想的，最令他害怕的鬼怪
//暴力
//流浪者在童年或其他时期遭受的来自集体的暴力
//
//在流浪者饮用紫色回忆杯中的纯净水后，所有回忆都会令流浪者感到未知的恐惧。流浪者会因此变得敏感，易怒。最终他们会因此而患上精神疾病。
//
//黄色回忆杯
//黄色回忆杯常出现于一些生存难度为2的层级，例如Level 2。饮用其杯内的纯净水后，流浪者往往会回忆起一件深埋于其心中的往事
//
//童年玩伴
//因一些原因而再未见过直至淡忘的童年玩伴
//书籍
//曾经最喜欢的书籍，不过后来就再也没拿起过
//羞辱
//流浪者在童年时期所经历的，不愿再提及的往事
//
//在流浪者饮用黄色回忆杯中的纯净水后，他可以自行选择是否删除这件被回忆起的往事。
//
//红色回忆杯
//红色回忆杯常出现于一些生存难度为3的层级，例如Level 37。饮用其杯内的纯净水后，流浪者往往会“回忆”起一段未曾发生过的“往事”，且这些事通常会带来负面情绪。
//
//辱骂
//被自己的好友或亲人辱骂
//嘲笑
//在大众面前出糗并被嘲笑
//欺骗
//被自己最信任的人欺骗
//
//流浪者饮用红色回忆杯中的纯净水后所产生的“回忆”通常会随机取代流浪者原本的一段记忆，并且流浪者不会对此记忆的存在感到疑惑。在极少数情况下，流浪者会失去所有其他记忆而只留下饮用红色回忆杯中的纯净水后所产生的“回忆”。
//
//黑色回忆杯
//黑色回忆杯常出现于一些生存难度为4的层级，例如Level 3。饮用其杯内的纯净水后，流浪者一生中最深刻的记忆会一幕幕在眼前浮现
//
//录取
//大学或工作的录取
//婚礼
//和那个ta一起
//灾祸
//有些人失去了自己的一部分，变成了残疾人
//
//在流浪者饮用黑色回忆杯中的纯净水后，他一生中最深刻的记忆之一会被完全的黑色画面所取代。流浪者可以自行选择被取代的画面。在取代成功后，被取代的记忆会被埋到流浪者的内心最深处。在这之后，流浪者可能会因为某种契机而回忆起此记忆。
//
//透明回忆杯
//透明回忆杯常出现于一些生存难度为5的层级，例如Level 8。饮用其杯内的纯净水后，流浪者所回忆起的仅仅是一副画面。画面的内容可以确定来自于该流浪者的记忆，但其完全是随机的
//
//模糊不清
//或许是来自于一次走神
//黑暗
//或许是来自于一次眨眼
//景色
//或许是来自于一次出游
//
//在流浪者饮用透明回忆杯中的纯净水后，他的记忆会消失一部分。消失的内容，长度完全随机，所以有时候也会出现记忆被清空的情况。
//
//橙色回忆杯
//橙色回忆杯是最稀有的一种回忆杯，在后室的绝大多数层级都有极小的概率出现。同时，橙色回忆杯也是唯一一种不会引发回忆的回忆杯。饮用其杯内的纯净水后，流浪者能够自由地对自己的记忆进行增加，删除或修改直到满意。并且在增加，删除或修改记忆完成后，流浪者将不会意识到自己的记忆被编辑过，这为一些人提供了治疗心理创伤的办法。
//
//发现记录
//白色回忆杯首次在Level 11被一名流浪者发现。此后，各种颜色的回忆杯陆续被各层级的流浪者们发现。目前，最后被发现的回忆杯为橙色回忆杯。此外，有关于常出现于生存难度为死区的层级的回忆杯的记录在流浪者之间流传，目前暂不知其真伪。
package wupin;
public class huiyibei1037{
}