//package wupin;
//
//public class huobaopi1123 {
//
//}
//Object C-123 - “活胞皮”
//评分: +11+–x
//
//物品编号：C-123
//名称：活胞皮
//
//描述
//活胞皮是一类外观近似肉色套头胶衣的物品。该物品由赐皮博士在躯的支持下研发而成。
//
//活胞皮外侧的触感与真正人类皮肤一致，且极为细腻。背部设有开口1，供使用者穿入，面部五官对应位置存在相应且仿真度极高的器官。活胞皮内侧触感略为黏滑，其中覆盖头部部分内侧额外长有网状组织，据赐皮博士本人所说，该结构用于将穿戴者的头发固定与读取穿戴者脑电波。
//
//活胞皮由多种细胞组成2，经取样检测，这些细胞皆具有人类的遗传物质3。
//
//活胞皮分为“皮套款”和“换身款”4，其中只有前者可以脱下且可购买。后者只有生物粘合款，其使用被严格限制，仅被允许用于躯为流浪者提供的换体手术中。
//
//穿戴活胞皮与穿戴常规胶衣方法基本一致，但因其内侧自带润滑功能，无需额外添加润滑剂或润滑粉。按穿戴常规胶衣方法穿戴完成活胞皮后，拉上拉链/将粘合带贴合后活胞皮将发生以下变化：
//
//更多由神经细胞等组成的网状组织将从包裹头部的内表面长出，将穿戴者的头发包裹收拢，固定于头顶，同时开始接收穿戴者的脑电波
//活胞皮内侧细胞分泌黏液，分解大部分体毛5，抑制体毛的生长，同时使内侧细胞与使用者表皮细胞贴紧
//生物粘合带颜色改变，直至比相邻皮层颜色略深
//裆部细胞开始移位，使使用者排尿口与肛门露出6
//组成五官部位皮层细胞开始移位，露出口部，同时遮盖眼部的细胞将具有单向透光性，在外观未产生改变的同时允许穿戴者拥有正常视野。
//通过调节皮下细胞对外观体态进行调 整，会因活胞皮自身预设的性别而不同
//脱下时，以上过程会反向进行。
//
//欲脱下生物粘合皮套款活胞皮，只需思考此事，生物粘合条便会解开，同时，为保障使用者的安全，当使用者失去意识7时，生物粘合条会自动解开。
//
//在整个过程中，组成换身款活胞皮的细胞的遗传物质会趋同于使用者的细胞。
//
//穿着活胞皮时，穿戴者不会感受到任何额外的不适感8，可正常进行皮肤散热、呼吸、敷药、等活动，但穿着皮套款活胞皮时，表现出的面部表情幅度会偏小。
//
//活胞皮具有自我修复功能，在穿着时，其修复速度与穿戴者自身伤口愈合速度有关，未穿着时修复速度较快，其修复一个半径为1cm的圆形洞约需要5分钟。
//
//为保障穿戴者的舒适，活胞皮会在一点程度上减弱肌肉与皮肤等组织产生的痛觉与劳累感等，但正常的触觉不会受到影响。
//
//经证实，穿着皮套款活胞皮的流浪者不会受到赐皮者的影响，据赐皮博士称，此特性与生产工艺有关，但具体细节暂时无法透露。
//
//可定制项目
//- 收起
//鱼尾（可选择将活胞皮下身更换为鱼尾，造型可定制，注意仅使用此物品并不能增加使用者于水中活动的灵活性，欲进行适应水中生活的改造请前往躯组织所设的前哨咨询）
//眼部（可定制颜色以及对近视、远视与散光的矫正功能
//体态永久改造功能
//面部其他器官造型及布局（如尖耳）
//乳房尺寸
//读取脑电波以在穿戴完毕后自定义全身造型功能9（此项价格较为高昂，仅限皮套款）
//其他项目正在开发中。
//
//配件
//配套假发
//与常规假发外观相近，但其基部由与活胞皮相同的皮层构成。基部与发丝皆具有强抗拉能力，使其不易因拉扯自活胞皮表面脱落。
//
//佩戴活胞皮配套假发仅需将其贴于活胞皮头顶部位，其具有自动修正位置与自动修复功能。欲摘下轻轻揭下即可
//
//购买活胞皮时会附赠一顶随机样式的配套假发。
//
//配套变声器
//贴于活胞皮紧贴喉部部分内侧即可使用
//
//来源
//可于各处躯组织所开店铺购买生物粘合皮套款的活胞皮及其配件
//可于B.N.T.G.处购买生物粘合款与拉链款皮套款活胞皮及其配件
//可前往赐皮博士处或躯开设的相关站点进行定制。
//
//用途
//供拥有特殊癖好的流浪者进行变装。
//用于伪装。M.E.G.内部曾有人提出使用活胞皮伪装为其他组织内部人员潜入以进行获取情报等活动的方案，并秘密为此以个人名义向赐皮博士发起过定制请求，被赐皮博士告知因技术原因无法对特定人员进行相似度较高的模仿，最终不了了之。
//我想给那些不敢去有识血肉处改变外表但又渴望改变的流浪者更多的路——赐皮博士
//
//作者信息
//« Object C-122 | Object C-123 | Object C-124 »
//
//Footnotes
//1. 可以选择生物粘合款或塑料拉链款，但是躯他们不愿意做塑料拉链的，所以你要塑料拉链款的只能来我这或去B.N.T.G.的店里找——赐皮博士
//2. 这也是其名称的由来
//3. 为了避免误会，我要声明一点，活胞皮是我们使用基因技术生产的，并未用什么不人道的方法——赐皮博士
//4. 其实就是临时款和永久款，我觉得这两个名字很劲爆而已——赐皮博士
//5. 头发、睫毛等必要毛发会保留
//6. 活胞皮会调控相关激素，让女性穿戴者无需担心例假的干扰，所以那个地方不会留出来，至于换身款，躯的相关人员会解决问题的——赐皮博士
//7. 如陷入昏厥、睡眠等
//8. 感觉仿佛你的身体本来就是那个外观一样——赐皮博士
//9. 拥有此功能的活胞皮会在你穿上后尽量根据你所想形象改变头发、五官、体型等，但改变完成后必须脱下来重穿才能变成另一个形象，注意，对身高的改变非常有限——赐皮博士
//原创奇异物品躯
package wupin;
public class huobaopi1123{
}