//Object 15 - “火盐”
//火盐是一种具有爆炸性的小型晶体，通常在后室中被作为武器使用。
//
//描述
//火盐是在后室中发现的一种具有挥发性的晶体。它们被发现时通常呈现为形状不规则，大小在1～5cm之间，橙色，略透明的碎片。人造大型火盐锭则透明度更高，颜色呈现为暗红色。
//
//液态火盐，外号“火油”，是一种无色的易燃液体，具有一种类似于熏香的气味。
//
//性质
//火盐晶体相对较硬，莫氏硬度为7，但非常脆，因此易受到冲击而损坏。火盐还溶于水和杏仁水，在溶解于这两种液体时会产生热量。
//
//此外，火盐具有约为47℃的低熔点，一旦达到上述阈值，晶体就会融化成透明的火油，这种火盐即使在低氧环境下也能有效地燃烧。火油可以冷却以制造人造大型火盐锭。
//
//火盐最吸引人的特性在于它对冲击破坏的反应，被投出时，火盐晶体很容易破碎并产生一定的热量和以燃烧的火花形式呈现的强烈光线，足以使被直接击中的人受到一级至二级烧伤。质量大于50g的较大人造火盐锭或晶体可以以类似TNT的形式爆炸，每100g火盐锭爆炸产生的能量相当于同质量炸药管的一半。需要注意的是，上述爆炸似乎并不会损害后室本身的整体完整。
//
//用途
//小型火盐晶体由于易于引爆被后室探险者们用作自卫武器，其产生的小型爆炸可用于突袭、攻击或恐吓敌对实体或人类。它的整体普遍性使得火盐成为许多探险者的首选武器，经常被制成便于携带的炸药。由于其破坏力可以轻易地消灭敌人的队伍或成群的实体，大型火盐锭被用作战争工具。但制造大量此类火盐锭所需的基础设施使得只有大型或准备充分的组织或派系才能生产它们。
//
//此外，也有人利用火盐溶于水或杏仁水时释放的热量来加热食品或液体，这使得几颗火盐晶体替代了具有潜在危险的明火，成为对获得的杏仁水进行消毒以避免疫疾或其他不良后果的简单方法。
//
//另一方面，火油已被用作汽油的替代品，为后室内各类小型车辆提供动力或在没有电源插座的情况下作为发电机的燃料。
//
//获取
//小型火盐晶体可以在后室前五个层级的角落产生并获取，在类似于Level 0的层级中也可以获得，但更少，且更稀有。较大的可爆炸性火盐晶体则无法自然发现，仅能通过将多个晶体熔化到一起制成。火油也仅能通过熔化火盐晶体制成。
//
//package wupin;
//
//public class huoyan15 {
//
//}
package wupin;
public class huoyan15{
}