//package wupin;
//
//public class jiaorounizhou1196 {
//
//}
//Object C-196 - “绞肉泥粥”
//评分: +26+–x
//
//物品编号：Object C-196
//绞肉泥粥是一种特殊的食肉菌，通常作为调味料在煮汤或是煮粥时加入其中。以便对于汤中的蛋白质和油脂进行进一步处理以改善口感且更有助于吸收。
//
//描述
//通常绞肉泥粥呈白色粉末状，颗粒极细并且容易飘起1，无特殊气味及味觉感受。
//
//通常以100克为一个单位的形式放置于一种骨骼和干枯肉膜制成的特殊容器中2，容器外层刻有使用说明、保质期等一系列内容以及“后室厨师联盟”的商标。每一单位的绞肉泥粥可以处理大约5公斤左右的普通肉类3或是在分解不完全的情况下处理15公斤左右的肉类，不完全分解会使肉类从普通的块状变成絮状物。
//
//绞肉泥粥在生物学概念上是一系列处于休眠状态的水生耐高温菌荚膜，在温度和湿度适宜的区域4时荚膜会脱离休眠状态并释放出其中的细菌。
//
//目前化验显示：绞肉泥粥的基因应该属于某种肉食菌变体，能够将肉类分解成更容易消化的小蛋白分子和脂肪酸，这一过程会产生足以让绞肉泥粥生存下去的能量并生成一种略带芳香性气味因子。同时小蛋白分子和磷脂会让汤的口感明显变得柔和肥美，总体而言加入绞肉泥粥的肉汤口感有明显提升，并且不需要厨师有火候控制等技术，只要保证水处于沸腾状态且不断火就能实现。
//
//值得一提的是绞肉泥粥菌体基因序列严重缺失，部分基因原本位置是一系列蛋白质和无机盐组成的类基因框架状结构用以保持菌体内的正常运作，但通常来说在解除休眠的3~5小时后这些无机盐框架就会溶解崩溃并导致菌体死亡，同时由于关键序列的缺失，绞肉泥粥缺少繁殖能力，试图复原缺失部分基因序列的尝试也失败了。
//
//用途
//由于绞肉泥粥的特殊性质使其成为一种极其出色的食品添加剂，在大多数汤中加入可以分解掉其中的肉质。显著提高食物口感的同时增加食物的易消化性，由于肉质均已被分解无明显团块状物质，其产出非常适合种伤员、婴幼儿或是老年人食用。添加的菌体在冷却死亡后可以正常被消化，不会留下任何毒性或残留物，因此对人体的危害也很小。
//
//确认火烧后可将绞肉泥粥倒入沸水中，注意过程中温度应保持在85度以上否则绞肉泥粥菌体会失活，保持现有温度一段时间后汤中肉质表层逐渐出现絮状物，这代表绞肉泥粥已经开始分解肉质，接下来要做的就是静候3~5个小时确认汤中的肉质已经完全消失，通常这时的汤是白色浑浊物，搅动确认汤中没有絮状物后便可出锅装碗。
//
//理论上残留绞肉泥粥活体菌体会对身体造成一定伤害，但实际已经确认温度降到85度以下时绞肉泥粥中的残留个体便会全部失活，降到人体可以正常饮用的标准时绞肉泥粥中不可能残有还保持活性的绞肉泥粥菌体，因此可以放心食用。
//
//获取
//已确认绞肉泥粥无法通过人工培养和制造手段生成，同时由于其适宜生存温度是85~120摄氏度条件过于苛刻，目前野外也没有找到纯有活性的绞肉泥粥菌体。
//
//但绞肉泥粥可以在绝大多数有识血肉巢穴买到，并且是有识血肉的主要出口贸易物品之一，零售和批发形式都存在，由于其产量高，实用性强，效果好，目前大多数聚集地的商店也从有识血肉处进货售卖。有识血肉通常喜欢用金属物质或是含金属量较高的矿物交换，通常100克铁可以兑换三瓶左右的绞肉泥粥，在“炖锅”、“电磁炉”和“城市”这种大型巢穴中售价更为便宜。
//
//同时由于伟大母亲在“后室厨师联盟”快餐和便携旅行装食物研发部的厨师长地位，该部门的成员也经常使用该物品开发新菜品。
//
//变体
//除了目前在市面上流通的普通绞肉泥粥外我们也确认了绞肉泥粥还存在一些其他特化种类的变体与普通绞肉泥粥有相似的基因序列，但是有大约3~5个染色体的细节存在差异。
//
//高温生态系统
//目前可以直接购入的绞肉泥粥只是普通版的，但是实际上根据一些在“炖锅”科研巢进行合作研究的研究者的。透露的一部分信息中表明有识血肉已经开发出休眠的喜热藻类生物，藻类对于有机物的分解能力更强并且可以合成一些使汤更加鲜美的物质，但是具体制作方式被有识血肉称为商业机密。
//
//军用食肉菌
//目前已确认有识血肉也使用未进行人造基因缺陷和适宜生存环境修改的肉食菌作为反步兵武器使用，对于无抗体个体这种肉食菌会造成极其严重的溃烂和肌肉溶解进而引发炎症，同时这一过程中留下的含有机物组织液仍然可以被体内含有针对性抗体的有识血肉回收利用。
//
//作者信息
//« Object C-195 | Object C-196 | Object C-197 »
//
//Footnotes
//1. 所以使用时请尽量处于空气流通较弱的区域直接向下洒入，以免飘散
//2. 有识血肉的标准容器
//3. 不包括实体肉，每种实体的肉质处理时间都不同
//4. 通常来说是在沸水中
package wupin;
public class jiaorounizhou1196{
}