//package wupin;
//
//public class jiaolei1016 {
//
//}
//Object C-16 - “胶雷”
//评分: +18+–x
//
//物品编号:C-16
//获得途径:通过电邮epbparticletech@backmail.com并说明购买意愿，在三个协调后室时工作日内会有E.P.B公司的工作人员上门面议价格。
//描述
//Object C-16,又称胶雷，是一种尚未被大规模配备的武器，由黑星掌握关键技术并制造。目前，仅有E.P.B.公司正在将其小规模售卖。
//
//XXKuJU.jpg
//黑星提供的胶雷照片
//
//胶雷的结构与外观类似前厅常见的战术手榴弹，在被拔掉保险销并扔出后，其内部会释放一定量无色无味的气体，一定要避免吸入此类气体！
//
//+ 点击展开黑星方面提供的使用方法
//性质
//在胶雷内部气体被释放后，接触到该气体的气体与液体会迅速凝胶化，该特性也会使得生物的体液凝胶化1，该性质与实体凝胶井内部的性质类似，黑星方面也表示该物品的制造方法与该实体相关。
//
//用途
//目前，胶雷被用于处理大规模实体群，制造障碍等战术用途，此外，由于其可以大规模杀灭病菌，E.P.B.正在研究如何将其用于医学方面。2
//
//以下为E.P.B.方面节选的一些客户回复，有助于流浪者们了解胶雷的优劣势
//
//发信人:walientingmeg@backmail.com
//收信人:epbparticletech@backmail.com
//主题:关于物品C-16“胶雷”的售后反馈
//这玩意太tm逆天了，上回在lv8被一堆实体追着的时候丢一颗胶雷，这些家伙竟然全都困死在凝胶里了，太离谱了，但凡便宜点我一定买一堆。
//——[应E.P.B.要求保密]
//
//发信人:tiansuor@backmail.com
//收信人:epbparticletech@backmail.com
//主题:关于物品C-16“胶雷”的售后反馈
//强是强，但是并不万能。
//在level c 30的时候遇到一只银骨，用了这玩意把它困住后，它直接把凝胶撕烂了，还好我跑得快。
//我估计车兽这类的实体大概也是这样，总之以后我考虑考虑再买吧。
//——[应E.P.B.要求保密]
//
//- 已确认，欢迎回来，Dr.许巍
//发信人:[数据删除]
//收信人:docterxuw@backmail.com
//主题：关于实体C-19的研究
//致亲爱的许博士:
//如你所见，对于凝胶体生物们的研究已经有了进展，想必你已经猜到了，物品C-16内部气体中含有它们的“武器”。
//它们是什么呢，以目前后室的科技水平，我们无从得知，但是当我们用一种特殊的气体“包裹”它们时，它们失效了。
//你可能会好奇，这种气体是何物，我必须保密，我只能告诉你它能抑制实体的生长。
//也就是说，这些“武器”其实是实体，凝胶化的过程也许是它们生长的过程，也许呢？
//合作协议和贸易协定仍然在生效，所以我们会立即共享这一发现，但请你和你们放心，它们永远不会被公之于众。
//至于物品C-16的价格问题，这点我们无法改变，因为它的加工程序异常复杂，那种抑制实体生长的气体也不易制备，所以短时间内，它还不能被量产，说不定永远都不可以。
//最后，祝愿实体C-19的研究工作顺利，也希望我们与你们有更长远的合作。
//——███
//
//第一篇物品，希望可以活着
//« Object C-15 | Object C-16 | Object C-17 »
//
//Footnotes
//1. 大部分微生物会在此过程中大量脱水而死
//2. 尚未成功
package wupin;
public class jiaolei1016{
}