//package wupin;
//
//public class jiaxiang1027 {
//
//}
//Object C-27 - “家香”
//评分: +24+–x
//物品编号：C-27
//发现地点：从B.F.P.F.的商人处获得
//描述：
//Object C-27是一种颜色泛蓝、常见，由B.F.P.F.售卖的香水，因为它独特的性质而在后室中大受欢迎，以至于根据这种液体出现了一条小型的产业链。根据上报，采集点可能是一个被植被覆盖的层级。这种液体通常被瓶装售卖，那些液体在包装上于前厅中yari公司生产的产品类似。在使用这种液体后，人们通常可以持续数分钟获得一种归宿感。这种液体易燃，需要小心存放，避免接触高压、明火，并且不得直接饮用或是大量使用。
//
//这种液体的气味会在一定程度上因人而异，即使是在同一瓶内喷出的被两名使用者闻到都反馈出了不同的味道，因此没有对该气味的详细记载。但是可以粗略的把这种香水的味道归类于“家的味道”。但是这种味道通常会给使用者提供归属感、安全感，并且随着使用次数增加会逐渐出现依赖性。
//
//对一名使用者采访，以下为视频记录；
//
//关闭录像
//记录员Holiday ： 先生，你有时间吗？我们正在进行一个采访。
//
//受访者Calrk： 当然，我有很多时间用来应对社交。
//
//记录员Holiday ： 您的名字是？
//
//受访者Calrk： Calrk.
//
//记录员Holiday ： 好的，Calrk。我想询问一下刚刚您使用的液体是？（眼睛向那瓶液体看去）
//
//受访者Calrk： 是家香，我刚刚买到的，如果你想征用，我拒绝。（把家香藏到背后）
//
//记录员Holiday ： 不不不，我仅仅是来采访您的，我代表M.E.G.的成员来采访你使用了这种香水的效果如何？
//
//摄像机对准了Calrk并且将麦克风递给了他
//
//受访者Calrk： 哦！这个香水好极了，这用起来甚至比让人喝杏仁水还能振奋人心。而且这玩意点燃了之后还能做成武器用并且——
//
//不明人士：Calrk！！我说多少次了不要在外面使用那玩意，快点走！
//
//记录员Holiday ： 先生，等一下你能否——
//
//受访者Calrk： 停停停。（用手遮住摄像机）
//
//*录像被关闭*
package wupin;
public class jiaxiang1027{
}