//躯器编号：Flesh C-97
//
//代价：小
//
//安装类型：体外
//
//amputation
//截肢器，该为其绘图。
//
//介绍
//当您购买到义肢而不知道应在何处嫁接时，截肢器便是可帮助您的最佳躯器。
//
//其使用骨骼与部分血肉制成，将其安装在您需要嫁接义肢的部位其便可将肢体截断。在截断的过程中，该躯器会尽量保持其过程无痛并进行止血与维持血液循环。
//
//说明
//如何使用：
//
//一、将截肢器下方带有倒刺的骨针在您需要截断的位置贴紧皮肤向近心端插入，当其插入后其便会将神经系统阻断并使截断部位麻痹。
//
//此时截肢器会开始从动脉向储血囊输入血液，储血囊为后续维持血液循环的枢纽。
//
//二、在截肢器侧边有两截由结缔组织构成的绳子，使用绳子将您所需要截断的位置勒紧并将两截绳子绑在另一侧的系绳环上。
//
//三、当绳子系在系绳环上后远心端的绳子便会自动缩紧，此后骨针上的倒刺便会保持展开状态，并以最快的速度将需要截断的肢体勒断。而近心端的绳子负责对该部位止血。
//
//若您是第一次使用截肢器，您被截断的肢体可进行妥善保管，在一定时间内可在我们这里将其改造为可嫁接的义肢。
//
//若其为您后续嫁接的义肢，请注意在这一步接好义肢，避免其受到不必要的损害。
//
//四、而骨针在此时已将静脉与动脉做好连接，且储血囊会开始向静脉输血。
//
//五、现在您便可将义肢进行嫁接，当您将义肢嫁接后骨针上的倒刺将会收起且截肢器会自动脱落。
//
//注意：
//
//一、请注意检查在第一步时储血囊是否储血，若一直没有向储血囊输送血液请将其拔下，以免造成危险。
//
//二、在您嫁接义肢前不要试图将截肢器拆下或破坏。
//
//三、该躯器可重复利用，在收纳时请注意消毒，以防其感染或发炎。
//
//获取
//目前其仅可通过流浪商人处购买。
package wupin;

public class jiezhiqi1097 {

}
