//Object 17 - “寂静汁液”
//first.jpg
//刚从冰箱中取出的用于制造消音橡胶的一小瓶寂静汁液。它已经开始凝固了。
//
//简介
//寂静汁液是一种黑色的、粘稠的液体，由“尖噬者”的残骸组成；这些虚无缥缈的敌对实体只在Level 93发现。大量的这种液体可以引起以它为中心半径为30米的范围内的实体和流浪者自发的极端恐惧。寂静汁液是一种令人难以置信的独特物质，因为它能够吸收和储存声音。正因为如此，寂静汁液在多种用途中都能起到很大的作用。
//
//性质
//寂静汁液的每一个粒子都包含一个口袋空间，这些口袋空间可以容纳相对于寂静汁液粒子数量的声音。一升寂静汁液可容纳191分贝的声音，这大致相当于一枚手榴弹爆炸能够产生的音量。一旦一滴寂静汁液容纳的声音大小达到容纳上限，它就将完全失去其吸音特性。对寂静汁液施加1伏或更多的电流，会导致其口袋空间的自发性临时塌陷。在塌陷的过程中，口袋空间所储存的声音会在很短的时间内被全部释放出来，时间以微秒计。断开电流可使口袋空间立刻恢复。
//
//晶体振荡器可以产生快速的脉冲性电流，使寂静汁液中的口袋空间反复塌陷并恢复，由于每次通电都会有少量声音被释放出来，所以利用晶体振荡器可以缓慢释放寂静汁液中储存的声音。
//
//将寂静汁液加温到0℃以上时，它就会凝固并变成一种黑色粉末状的物质。这种状态下的寂静汁液与木炭粉相似，但它更有颗粒感，并倾向于形成团块。寂静汁液的粉末形式保留了其吸音特性。
//
//second.jpg
//寂静汁液的粉末形式。与木炭粉类似，但性质上更大块。
//
//寂静汁液的一个奇怪的、似乎是随机的特性是它能够诱发距离它较近的实体和流浪者的自发恐惧——这个距离大约在20到30米内之间。如果一个人发现自己距离大量的寂静汁液只有一米以内的距离，这些汁液将导致其极端歇斯底里。即使是少量的寂静汁液，在靠近它时也会产生一种不安感。然而，可能是由于稀释和其他未知过程，使用寂静汁液制造的产品几乎没有这种效果。“尖噬者”似乎利用这种恐惧机制来“捕食”它们的猎物。
//
//用途
//在制造过程中，寂静汁液可以与金属或其他材料相结合，创造出“消音”的版本。消音橡胶经常被用来制造鞋子和手套，这些产品在如类似于行走在树叶上或拖动大的物体的情况时不会产生任何声音。这些鞋子和手套对流浪者来说是非常珍贵的，并会在交易时出高价以求能够获得它。
//
//消音金属通常含有黑色的色调，用于近战武器或实用工具。消音撬棍非常有用，因为这种撬棍在使用时不会发出巨大的噪音，比如强行打开隔间或击打敌对实体时。消音金属在枪械中也有用途，如果将其内置到武器的枪管和底盘中，可以消除枪声。
//
//寂静汁液也是一种非常强大的爆炸性武器。改造后的驱笑剂可以装载寂静汁液，最多可达89升。在最大的声音容量下，89升寂静汁液相当于一吨TNT。因为可以装在驱笑剂里，这种巨大的爆炸力是相当便携的，并会带来严重的危险。
//
//稀有性
//寂静汁液是一种极其难以获得的物质。它只能从被杀死的“尖噬者”身上获取，而仅仅是杀死它这件事本身就是一项困难的任务。“尖噬者”本身也是罕见的实体，且一个“尖噬者”只能提取出40-50升的寂静汁液。再加上其与天生的独特并有用的特性，使得寂静汁液成为一种几乎不会在小团体或人之间以液体形式进行交易的昂贵的物品。只有大型团体或具有深远影响的团体才能获得纯正的寂静汁液，并经常利用它来制造产品，然后将其交易给整个后室里的普通民众。
//
//package wupin;
//
//public class jijingzhiye17 {
//
//}
package wupin;
public class jijingzhiye17{
}