//package wupin;
//
//public class jingcaisishua1192 {
//
//}
//Object C-192 - “净菜丝刷”
//评分: +16+–x
//
//物品编号：Object C-192
//净菜丝刷为有识血肉所制造有机构成体之一，用于制造覆盖有机建筑表层的伪装网或作为有识血肉个体的衣物寄生于身表，目前该物品也向流浪者出售，但穿戴过程较困难。
//描述
//净菜丝刷是一种经过大量改造的合成生物，样本提取基因组显示绝大部分基因来自植物，主要部分基因分别来自丝藻和菟丝子，少数基因来自大叶榕和一部分动物混合组。
//
//明显混杂的基因组也展现在外观上，净菜丝刷外观是由粗壮藤蔓缠绕成的藤条衣物，藤蔓近似菟丝子但表皮呈现紫黑色，推测是因为其中含有的大量视黄醛并且因纤维质含量过高而看上去明显不透明。
//
//单条藤蔓直径约10毫米呈紧密横向螺旋状，彼此间以及面向穿戴者方向长有大量细密尖锐的气生根系统连接，此类结构可在不增加纵层时保证藤蔓在垂直方向的结构稳定性，由于是单层无纺织结构也让整个物品外观看上去较为轻薄实用。
//
//关节处因为经常活动，由类似丝藻枝干交叉织成的活性多层织布进行连接，保证活动性和轻便性，外表面上观测到类似荷叶表层的微型绒毛状结构，可以产生极其可靠的防水防尘效果：多数落在表面的杂质会迅速掉落。
//
//尽管净菜丝刷看上去只是普通藤蔓和丝线构成，但是由于上述材料都处于水分充足的活体状态，纤维没有干燥断裂，因此韧性其实比起大多数化工纺织材料也不落下风。出色的防水性和防尘性以及受损后能自我修复的能力使其成为许多远离据点的流浪者的首选。
//
//持有者长期处于室内条件等比较温和的环境时，净菜丝刷会在积累足够养分后开花。开放的种类在购买时决定，目前可选的花香有桂花、玫瑰和槐花。花和结出的果实相比自然环境下的生物模板要小得多但香气更浓，新版产品中加入对花粉过敏症患者特制的无花果版本。净菜丝刷开放的花朵可以直接依靠人体行走时的抖动完成自体授粉，因此穿戴者无需专门找到蜜蜂或是其他生物完成这一行为。
//
//使用方式
//由于净菜丝刷穿戴时要与身体对接，过程可能会带来强烈不适感，因此穿戴时建议购买配套的感觉抑制剂服用。完毕后将净菜丝刷置于自己正上方缓缓套入，确定调整到合适位置后捏住胸口处作为保险装置的肉团使之缺氧坏死。
//
//随后穿戴者皮肤表情会感觉剧烈的瘙痒并且肩部和背部传来刺痛，此时气生根会生出尖锐末端刺入毛孔吸取其中分泌的汗液和油脂作为营养，脊柱两侧和肩部用于辅助共生的多孔刺会直接植入身体。
//
//和水煮骨髓所用技术类似：多孔刺会在刺入穿戴者体内后快速展开，依靠激素和溶解酶将刺入区域周边的血管溶解重排，分离出对应的血管并在末端生长透膜保证仅有水分、糖分和无机盐可以正常渗入。
//
//此时共生系统基本完成，植入者体内的大量无机盐和体表的渗出物都会被净菜丝刷作为养体吸收，身体表层的气味显著减少，加之体表植物可降低体温并降低周围的二氧化碳浓度，多数情况下穿戴者将不会被蚊虫识别为目标。
//
//变体
//纹饰
//在最初始版本基础上额外支付资源，可以购买附带一套紫色的活体织物罩袍的高级版本，罩袍颜色可从浅紫色到深黑色自由选择，颜色越深则光合作用效率越强，可减少穿带该物品带来的额外消耗。
//
//值得一提的是由于技师氏族通常有极其灵敏的触觉而显著偏好光滑织物，因此穿戴罩袍在技师氏族中被认为是懂礼节的表现。
//
//通过有机染色剂可对罩袍进行涂色形成特色花纹，目前最受欢迎的花纹款式如下：
//
//银色蜂巢状花纹——推测为伟大母亲个人标记
//仿宋体“识”字——有识血肉通用记号之一
//后室厨师联盟logo——已确定不代表食材
//动漫风格的成熟女性半身像——推测为伟大母亲衍生艺术作品。
//放大后的骨骼特写——推测为战士氏族军衔
//孔洞款
//悬骨细米由于其身体结构的特殊性往往会穿戴特制的净菜丝刷，相比普通版本更柔软且具有较大缝隙，在保证子个体可以自由出入的同时也能遮挡住由于子个体离去而导致外形出现明显变化的母巢，防止外来者看到母巢的身体构成受到惊吓。
//
//礼仪餐巾配套版
//改版本的净菜丝刷和礼仪餐巾适配，更加宽大的罩袍可以阻挡住战术背心的外露从而不暴露穿戴者穿戴此装备的事实，同时能够形成更完整的体外循环系统，几乎完全做到使用者废物不外排，减少使用者的物资消耗和废物产出。
//
//后室厨师联盟特供版
//由于净菜丝刷可以有效吸收使用者汗味，在炎热的厨房中非常舒适且可以防止汗味沾染食物。因此有相当数量的厨师选择用净菜丝刷制作厨师套装，后伟大母亲直接推出针对厨师专用的套装版，加强吸汗的能力并取消开花功能以防花香破坏食物本身的味道。
//
//绽放协议
//这是一个免费可选的特殊协议，在此协议开放状态下净菜丝刷持有者死亡或受到特殊影响开始转变为悲尸等实体时，净菜丝刷会放开基因限制以尸体为养料开始像正常榕树一样进行生长，最终使穿戴者埋葬于树木中，不会被玷污。
//
//发现
//有识血肉与人类建立社交关系1~2年后，一部分个体逐渐学习更多文化，开始尝试在外骨骼上添加装饰，后来添加此类装饰的有识血肉越来越多，于是学者氏族向伟大母亲上报此事。
//
//后伟大母亲主导开始研发“具有有机特色的服饰”，并于消息放出七年后成功研发出可量产使用叶绿素的净菜丝刷，后来经过一系列工艺和生长资源优化最终形成现有净菜丝刷，在迭代过程中进行光合作用的化学物质也转为视黄酫。
//
//获取
//净菜丝刷确实可以开花并产生种子进行繁衍，但目前认为其繁衍过程需要像菟丝子一样寄生于植物上，但寄主要属于某种水生植物。过程繁琐复杂，即使成功培育成本也远高于直接从有识血肉处进行购买，因此目前没有组织尝试对净菜丝刷进行培育，确有需要的探索者可以直接前往有识血肉贸易巢购买均码普通图案版，或是花费1~2个月时间等待专属的定做特殊尺码及图案版。
package wupin;
public class jingcaisishua1192{
}