//Object 36 - 精神纽带
//物品编号：36
//描述：
//49e87ad7ab0955f53e0b700d574c9d2c.jpg
//一张未被使用的精神纽带的相片，目前正被M.E.G.保管用以研究。
//
//精神纽带是一些能在石英象限内找到的小帽子，后者为蓝色通道一片神秘的区域，也是Entity 600的栖息地。这些帽子十分迷你，大概只有普通人的手掌大小，它们的帽身中心总镶嵌着一颗被赋予了强大力量的宝石，这是帽子力量的来源，失去宝石的帽子是没有特殊效果的。这些宝石尺寸秀珍，内里闪烁着银河系色彩的星云，它们采用了类似分形艺术的设计，放大后其形状的细化变换如同移动的龙卷风(1)。这些宝石不该与它们镶嵌的帽子分离，因为一旦分离后，它们便无法再被重新组合。如果宝石与帽子分离，这两件物品都会变得无用，宝石会变作一块黑色的石头。
//
//精神纽带一般外形为各色种类的帽子，样式从高帽、贝雷帽到棒球帽皆有存在。它上面镶嵌的宝石本身的触感与重量同尺寸相同的普通宝石无异，稍显沉重，但整体的质量相对平衡。宝石与帽子似乎是坚不可摧的，无法借助外力对其破坏，但当宝石与帽子分离后，它们便会失去能力，变得易于摧毁。此外，试图将宝石从精神纽带中分离是十分困难的，需要借助高强度的重型机械加以实行。这种宝石的单独性质未知，因为它们总是与帽子成对出现。
//
//这些帽子出现的位置十分随机，它们能在每一个层级被找到，从Level 3到地铁，甚至是黯洃銫都有它们的身影。这些帽子是如何流落至此现已不得而知，但可以推测其原因在某种程度上与蓝色通道有关，鉴于上述层级是刺剑水母的栖息地。M.E.G.对这种帽子的本质作用产生过一些道德上的考量，许多高层认为它们实际上是某种精神控制装置，且在当时几乎禁止了该物品在诸如Level 11的宜居层级被使用。随着对该实体的进一步研究，我们发现精神纽带并不会对该实体的精神状态产生影响，它仅仅充当着近似于心情项链(2)的作用，它能够表达该实体的情绪且让它们拥有通过心灵感应与人交流的能力。许多人把该实体的声音描述为一种可爱的，像婴儿般的嗓音，不过具体的描述却各不相同。
//
//7f5a34d41ef3ab9ec493507a86fc306a.jpg
//一件据推测为描绘远古时代的刺剑水母的陶器。
//
//除去与Entity 600明显的联系之外，该物品还在失落一族被回收的文件与文物上被发现有存在痕迹，右图呈现的文物是一件古老的陶器，据推测，它表面绘制的图画便是与精神纽带分离的刺剑水母的模样，也有推测说这是它们族群中孕母的古画。值得注意的是，这幅画中宝石被镶在了水母的额头，而非帽子上，不清楚这是作画上的失误还是出于艺术的自由表达，亦或者，这是该神秘物品起源的一个线索。此外还有一些古怪的信件与手记，上面描述着深不可测的海底生物们与它们神奇的力量，许多文件在细节上把这些生物描绘作天使或是神祇，失落一族一些存活的成员们可以背诵这些描绘他们水神伟业的史诗神话，但这些传说与刺剑水母的联系——如果两者确有关联——却已随时间消却。该组织的很多成员都十分乐于帮助M.E.G.拼凑推理这些零散的信息。
//
//
//
//
//
//属性：
//精神纽带拥有一项神奇的属性，它们能够改变颜色。在未使用的状态下，它们是灰暗且无色的，长时间的待机甚至能让它们周遭的区域也变成灰色。精神纽带在佩戴到野生的刺剑水母头上后便会被激活，帽子会以类似心情项链的效果发挥作用，随该实体的心情改变颜色。如下是失落一族一位名叫Caedmal Tun的成员提供的，对该实体性质广泛研究的调查结果。
//
//许多个月来，我一直在这片险境中如履薄冰，生命岌岌可危、那些我目及的玷污邪兽与我置身其中、如同噩梦般的恶劣环境让我夜夜难眠。不过，尽管这一切都糟糕至此，这片无尽的黑暗里边倒也仍有些宽慰我心的永耀光芒存在，你们称之为“刺剑水母”的可爱生物们给予了我一种久未体会到的愉快心情。尽管你们以这个名字称呼它们，但它们在很久之前便已被先人所发掘，并以他们自己的系统命名着这些生物，他们大部分把这一生物称作“Narcomeba”与“Cartavela”。我第一次与这些迷人的生物相遇发生在几年以前，我在探索阿拉伯沙漠时注意到了一件奇特的状况：一只水母正躺在一块石头上，因为脱水濒临死亡。我立即把我最后仅剩的水源给予了这个生物，并带上它走了很远的路，直到我们抵达了避难所。我在这片区域中心发现了一顶嵌着宝石的草帽，水母见到它后，开始尝试挣脱我的手去戴上那顶帽子，我帮助它完成了这一行为。水母在戴上帽子后突然获得了沟通的能力，并且协助我找到了通往安全地的路。自这趟旅途后它便一直陪在我身边，至今，我已经找到了有关这些动物的许多实例，并开始研究它们的外观、习性以及其他宽泛的领域方向。我希望我的研究对你们组织能有所帮助，也许有一天，我们将最终解明这些无辜造物所遭受的悲剧，并让它们与自己应得的宝物重新团聚。
//
//
//
//
//
//
//- 祝福来自Caedmal Tun.
//
//
//颜色	情绪	描述
//红色	愤怒	Caedmal的研究表明，帽子上出现红色代表着刺剑水母正处于愤怒的情绪，这对它们来说实属是一种很罕见的心情，鉴于该实体以其欢乐的性格闻名。在记录观测到一只刺剑水母用触手蜇伤它的同伴时，被蜇伤的那只个体变得愤怒恼火，它的帽子变成了红色，并在Caedmal介入阻止冲突前叱骂了刺伤它的同伴。
//粉色	快乐	粉色被档案记录为代表快乐的情绪，精神纽带在有刺剑水母在附近的情况下总会显露出粉色。Caedmal叙述说，每当他前往刺剑水母们那里为它们检查状况时，它们精神纽带上的粉色总会变得异常鲜艳。他还记录道，在帽子处于粉色时，刺剑水母的声音会变得开心而欢快跳脱。
//蓝色	悲伤	蓝色同样也是一种罕见、不常显露在精神纽带上的颜色，Caedmal记录了一场他与刺剑水母的互动：一只刺剑水母在不了解该层级实质性质的情况下要求前往Level Fun玩耍，在Caedmal拒绝了水母的请求后，它的帽子变作了品蓝色，显露出了极度的悲伤，坚持想要加入这场所谓的派对，并在最终悻悻游开去往了天鹅座档案馆。
//黄色	恐惧	这种颜色稍微比红色与蓝色常见一些，但也不算是频繁出现。Caedmal记叙说：在Leo带领一名流浪者游览Level 222时，一只刺剑水母刚好漂浮路过，不小心刺伤了他们。这引起了流浪者对该生物的愤怒，水母开始表现得畏畏缩缩，十分害怕，在Caedmal安抚了流浪者的情绪后，他把这件轶事记录进了他的书中。
//紫色	激动	紫色是又一种高频出现的颜色，且通常是水母在不露怯的情况下帽子显现的颜色。Caedmal记录，每当他用饼干奖励水母们的时候，精神纽带便会变为紫色，水母在帽子为紫色时会表现得有些晕乎乎的，这更证明了紫色代表着水母们兴奋的心情。
//绿色	恶心	绿色远没有蓝色和红色罕见，但也不算是个时常显露的颜色，这种颜色被发现时，Caedmal正在给刺剑水母们讲述一个在Level 3发现死尸的故事，这个故事让所有水母惊得叫出声来，它们大多数的帽子开始闪烁出绿色的光芒，Caedmal把这种情绪归类为了恶心。
//至此是所有记录在案的颜色，但据推测还有更多代表情绪的颜色待被发掘。
//
//此外，精神纽带还拥有着给予刺剑水母通过心灵感应进行交流的能力，野生的刺剑水母与普通的水母类似，不会说话，然而，一旦帽子被戴到它们的头上，它们便即刻能够通过心灵感应给任何附近的流浪者们发送信息借以交流。据推测是帽子上的宝石赋予了它们心灵感应的能力，但由于宝石很难从精神纽带中被分离出来，且在取下后便无法复原——这点在目前还不得而知。
//
//罕见性
//如前所述，精神纽带没有固定的出现地点，尽管该物品没有层级秘钥般稀有，但它们也不是一件易于找到的物品。值得注意的是，它们最常于Level 3被发现，据推测是因为该层级广负盛名的包括稀有物品的物资丰富性，如果你十分迫切地想要寻找一顶精神纽带，推荐在非无尽面积的安全层级内进行寻找，有限空间为寻找提供的便利性，外加上没有外部因素阻挠，这两点将最大程度地保障你能够成功寻得目标。
//
//补记
//Caedmal Tun发布了一则10块皇家口粮的悬赏，给那些发现/提供有关导致刺剑水母与精神纽带分离原因信息的人们，他以个人名义请求将这则补记附加在该页面上。M.E.G.同样已援助Caedmal开始探寻这些线索，试图发掘出这些似乎已被历史长河埋没、有关这些生物们起源的久远真相，也许在未来的某天，我们能复原它们昔日的繁荣昌盛。
//
//作者
//« Object 35 | Object 36 | Object 37 »
//
//Footnotes
//1. 译注：“分形”，为一种存在于理念上的，维度并非整数，而是在越来越细微的尺度上不断自我重复的图形，简而言之诠释这种图案的性质：在你对图形无限放大的过程中，可以看见图案的不断细化与迭代。
//2. 译注：一种会根据你的心情改变宝石颜色的项链XDpackage wupin;
//
//public class jingshenniudai36 {
//
//}
package wupin;
public class jingshenniudai36{
}