//躯器编号：Flesh C-82
//
//代价：大
//
//安装位置：体内/体外
//
//介绍
//“金龟子”防护装置是一种针对于实体与敌对人类攻击的防御性装置。
//
//“金龟子”防护装置总体分为三个部分：
//第一部分为由多量人类胚胎头骨所制成的神经接收器；
//第二部分为向音速金龟子充能用的能量接收口袋；
//第三部分为由最多五百个音速金龟子所组成的移动防护装置，其可以使用口袋进行装载。
//
//音速金龟子需要食用使用者的思想进行充能，一次充能完毕可以待机三天。
//
//功能
//“金龟子”防护装置依靠您的脑电波进行行动，只需您在脑内要求金龟子在前方部署，音速金龟子便会迅速排列在您的前方对其进行保护，如果您被威胁，该防护装置也会迅速判断现状以考虑是否进行防护。
//
//“口袋”四周有圆形的孔，可以在您需要防护的时候超速释放音速金龟子，“音速金龟子”是一种特质金龟子，每只体长十厘米，体宽三厘米，背部护甲十分坚硬，同时其拥有抗水，抗火，抗生化的特性，甚至可以使子弹跳弹，唯一的缺点便是其无法承担大范围的信号屏蔽和电击过载。
//
//说明
//使用方法：
//
//一、将神经接收器放置在头顶。
//
//二、盘腿坐下，进行冥想，在这期间头顶发生瘙痒为正常情况。
//
//三、十至十五分钟后，待头顶的神经接收器已经无法触摸，便说明其已安装成功。
//
//四、当您感到疲倦的时候，您可将灰色甲背的音速金龟子放入“口袋”，它将会在您晚上休息的时候进行绑定和充能。
//
//五、待金龟子甲背转化为金绿相间，说明充能已完成。
//
//六、如需使用，在脑中幻想金龟子的布置方位，金龟子即可自动移动到该位置。
//
//注意：
//
//一、装备金龟子后不要让敌人接触到您的头顶，您的头顶因安装了神经接收器而十分脆弱。
//
//二、音速金龟子为一次性的，死亡后无法再生，需要重新购买。
//
//三、此装备一旦安装，便无法拆卸，请谨慎考虑。
//
//四、不要尝试使用音速金龟子进行不当行为，无论是对自己还是对别人。
//
//获取
//目前其仅可通过流浪商人处购买。
package wupin;

public class jinguizifangyvzhuangzhi1082 {

}
