//package wupin;
//
//public class jinianbei1134 {
//
//}
//Object C-134 - “纪念碑”
//评分: +41+–x
//物品编号：C-134
//
//位置：不定
//
//grave-674443_960_720.jpg
//一张纪念碑的照片，摄于Level 10，由匿名流浪者拍摄
//
//描述
//Object C-134，即“纪念碑”，被认为是一系列行踪不定的物体的统称，它们往往可以在户外层级被找到，例如Level 10、Level 11“郊野”1与Level 48等。其通常表现为形式不一的石质纪念碑，另有极少数明显由其他材料铸造的个体，它们皆无法以任何方式被损坏。M.E.G.推测，源自纪念碑的异常现象确切影响范围实则包含了碑体本身与其半径3～4米内的地表区域。
//
//纪念碑一般在停留1~4天后迁移至别处，此过程似乎完全随机，但其似乎会刻意地避开人口过分稠密或稀疏的区域。数个纪念碑常常生成于邻近处（直线距离不超过4米），形成“团簇”，形成团簇的各个体不会在迁移中被拆散。目前已知的最大团簇位于Level 11内的巴尔费茨（Balfetz）神父公墓，该团簇容纳着68块纪念碑个体，这个数字仍在缓慢增长。
//
//纪念碑表面往往镌刻有意义不明的姓名、生卒年月、生平事迹2所构成的「墓志铭」，无论目击者使用何种语言，「墓志铭」皆被描述为使用其母语撰写。经过有关人员对于其中数十份「墓志铭」的指认，纪念碑所记载的信息已被证实来自于确切存在且已经逝世的流浪者——除此之外，已知的数百份「墓志铭」的归属者似乎没有其他显著共性。据此，或有推测纪念碑的异常性质没有针对人群，实则囊括每一位于后室离世的人类，即可解释为，崭新的纪念碑个体将会伴随着后室中人员的死亡而诞生。此说法尚未得到证实，但已逐渐成为当前对于纪念碑成因的主流观点。
//
//“繁茂”效应
//cemetery-4653166_960_720.jpg
//中等大小的纪念碑团簇，由[[[the-m-e-g
//
//纪念碑影响范围内已被证实皆存在“繁茂”效应。在“繁茂”效应的作用下，被栽种于纪念碑邻近土壤的植物往往由死复生，并以近乎异常的高速生长。此过程在植物的生长达到某种阈值，转化为纪念碑的一部分时终止。所栽种的植物可以在除腐烂至面目全非之外的任何情况下受到繁茂效应的影响。在融入纪念碑后，对象仍保持原先外观，但新陈代谢完全停止，不再进行光合作用，且难以被已知的任何手段杀死——对象寿命将被无限延长，并在受到伤害后迅速恢复如初。
//
//当纪念碑影响范围内已难以再容纳更多植物，该个体的随机迁移便会终止，M.E.G.将此现象命名为“固化”，并定义已接受固化的个体进入“安定”状态，与处于“迁移”状态的个体截然相反。
//
//M.E.G.归档设施_Object C-134已收录个体信息一览（部分）
//姓名	生卒年月	状态	简介
//Kars William	1974年2月—2017年6月	迁移	M.E.G. “罗经点”成员，工龄4年，生前作为M.E.G.早期成员之一，为M.E.G.提供了二十余份宝贵的层级、实体信息资料，因受逐尸鸟锁定而死
//Padley Elena	1953年9月—2025年11月	迁移	“维洛卡农社”成员，于2011年由前厅美国南卡罗来纳州切入Level 1，辗转至Level 48后定居并自愿加入维洛卡农社。据社区成员称，其“平日善于交际，工作中任劳任怨，在当地口碑优良且拥有极高的声望”。72岁病故。
//[已编辑]3	[已编辑]	安定	流浪者，据传其生前为后室与前厅关系淡化后最后一名存活的“经典人类”，在其离世后，流浪者纷纷闻讯前往吊唁。同时，这名流浪者的逝世作为具有里程碑意义的历史事件，引起了后室各界的哗然。
//- Welcome, Overseer
//Kat	1996年11月—	由M.E.G.强制性固化，收容于[已编辑]前哨	监督者-B，M.E.G.“监督者”议会成员之一，M.E.G.的第二领导人，负责任免职员，维持M.E.G.各部门、派系的秩序。Kat于本档案撰写时尚存活，其纪念碑为唯一已知的错误生成个体，原因尚不明确。
//人文影响
//为其他流浪者的纪念碑献花已然演化为不成文的习俗。若流浪者偶然遇见一块纪念碑，往往会毫不犹豫地在其近旁的土壤中将随身携带的绿植或鲜花安置妥当，待其在“繁茂”效应的作用下快速生长，直至彻底与纪念碑融合后离去。那些生前颇受他人敬重与爱戴者的纪念碑往往得以在更短的时间内安定，永久停留于固定位置，便于有意者前来吊唁。
//
//巴尔费茨（Balfetz）神父公墓
//由于“团簇”效应的存在，当一块活跃的纪念碑与已终止迁移的个体形成团簇时，前者将跳过其余步骤而直接进入安定状态。由此，后室中各个体之间逐渐呈现出聚集倾向，而个体数量愈多的安定团簇往往得以固化更多的新个体。此说法最显著的实际案例即为位于Level 11内编号KR3-17（圣保罗大街街区）绿地的巴尔费茨神父公墓——该称呼源自于其大门门框表面所浇铸的文字，意义尚不明确。巴尔费茨神父公墓实为包含68块纪念碑的大型安定团簇，亦为数量增长最明显的安定团簇，由于地处人口较密集处，公墓关注度相对更高，某种意义上已成为后室中最为触手可及的公共墓区，近期，逐渐出现流浪者自发将死者安葬于此的迹象。
//
//- 隐藏
//我们都是坠入这个无尽牢笼的不幸者，也许，我们早已被前厅所忘却。每天，我麻木不仁地工作着，总觉得眼中只有一具、一具、又一具冰冷而无助的尸体，一个、一个、又一个在悲寥与绝望中悄然离去的同胞。
//
//直到我来到Level 48，在那里，我偶然遇见了一个纪念碑团簇，正好是10块，不大不小。成片的番红花轻柔地倚着在暮光中毅然矗立的石碑，静静地摆动窈窕的身躯。风微微吹拂过清香的花瓣，拂起稍掩石碑的茂密的常青藤，露出碑面上素不相识的姓名。在离开前，我留下了一朵卡萨布兰卡，沉凝着洁白如玉的花苞从茎叶中源源不断地生出，又开放，让它承载着我的敬意与万般思绪永远留在此处，哪怕这位素未谋面的他在生前对我全然不知，但我知道，他生前同我们一样，也曾不屈服地活在这世间。
//
//他和我们同在，就像那些未曾离去的同胞们。你看，他们在不朽的纪念碑旁，绽放得如此绚烂。
//
//
//——Gani，带着爱
//
//
//
//flower
//死当长相思
//
//
//« Object C-133 | Object C-134 | Object C-135 »
//
//« 地毯霉菌 | 后室角落探访不为人所关注的秘密 | 待续 »
//
//脚注
//1. 在后期探索中发现，被广泛称作“无垠城市”的Level 11同样存在类似于郊野公园的大型半开发绿地，即除道路、公园长椅、路灯等基础设施外不存在其余人为开发痕迹，但相比于前厅，这些“郊野”更适合被形容为被城镇化区域所环绕的生态绿地。
//2. 若死者缺乏相关信息（如无姓名者、早夭的婴儿等），则「墓志铭」对应栏空置
//3. 应家属要求，我方于网络平台中不予公开逝者姓名与生卒年月
package wupin;
public class jinianbei1134{
}