//Object C-66 - “计算机模拟镜”
//评分: +10+–x
//物品编号：C-66
//
//位置：M.E.G仓库
//
//分类：仪器-特级
//
//发现位置：不予以公开
//
//描述
//e7d60ee267760759.jpg
//“计算机模拟镜”
//
//计算机模拟镜外观为灰色头戴式护目镜，其左侧面有一用芬兰语标识着“执行”的按键，和一个USB接口。
//
//通过电脑、手机等电子设备连接USB接口输入执行指令，佩戴已保存指令的计算机模拟镜，并按下“执行”，计算机模拟镜即可运作。
//
//计算机模拟镜开始运作后，使用者视野中将出现一系列简易外界分析图像（不包括使用者），具体为：
//
//生命体征，生物体受损分析，物种辨析。
//物体精度值，物质分析。
//环境（空气、天气、地质、温度）分析。
//危险物质与物品、生物敌意分析。
//动作预测分析（包括弹道预测），动作推荐，方圆50米透视扫描。
//计算机模拟镜被运用于医疗、精确测量、探索等领域。运作所需基础指令包含三大类：任务类别，保护对象（物种），任务内容。
//
//在非必要情况下，不建议使用计算机模拟镜超过2小时。使用时长超过2小时，计算机模拟镜自主程序激活，并操控使用者完成指令任务，且会向方圆50米内的非指令保护对象发起猛烈的攻击。
//
//使用时长小于2小时，使用者会出现短暂失明，时长为2~5小时；使用时长大于2小时，使用者会受到短暂失明与失聪，晕眩等负面影响。
//
//在使用者完成指令任务后，计算机模拟镜会控制使用者将其强行取下，未完成指令任务将其取下，其保存指令销毁。
//
//附录
//2022年2月17日，M.E.G测试小队使用计算机模拟镜在Level 2进行物品功能实战测试时发生了严重事故，幸存者仅小队队长██一人，也是测试的物品使用者。
package wupin;

public class jisuanjimonijing1066 {

}
