//package wupin;
//
//public class jiutiqin1047 {
//
//}
//Object C-47 - “旧提琴”
//评分: +10+–x
//物品编号：C-47
//物品分布：唯一
//
//描述
//PSl5v8gopHrUJq2.jpg
//经过清洗与维护的Object C-47，更换了新的腮托。
//
//Object C-47是一把破旧的小提琴，并附带相应的琴弓。
//
//Object C-47诞生的年代难以考证，据估计已有20-30年历史。其琴身轻微向外弯折、表面坑洼，且四弦中有一弦断开；琴弓同样有多根弓毛断裂，无法承受大幅度的动作。此外，琴身上下存在多处细小开裂，腮托也早已丢失。
//
//Object C-47由一种未知的坚固木料构成，使其在数十年间未发生太大形变。在发现该物品时，琴身已经接近崩溃。经过M.E.G.后勤部的小心维修后，又回到了可以演奏的水准。但是琴弦的松动导致Object C-47音准上下浮动较大，且缺少的E弦也使得演奏尤其吃力。
//
//Object C-47的琴音可以一定程度上抵御实体。经测试，钝人、猎犬等常见实体在听到Object C-47的琴音后皆会感到不同程度的烦躁与恐慌，并在演奏者身边徘徊不前。这被推测与制成琴身的独特木料有关，相关研究已提上日程。然而，该物品并不足以让实体退避，仅能拖缓它们进攻的脚步。
//
//2021年3月6日更新：
//目前推测该物品与近期发现的Entity C-onductor及其背后的组织“后室交响乐团”有关。
//
//相关调查正在逐步推进中。
//
//发现
//2018年9月17日，M.E.G.小队“穴居人”在经Level 3返回Level 5时发现了一条未探索过的走廊。走廊尽头是一条死路，有着人类扎营的痕迹。地面上遗留着大量帐篷的碎片、一些已经碾碎腐烂的食物，以及其他损毁的生活用品。在营帐附近，可以看到数具难以分辨的尸骸，大多已四分五裂，仅有少量骨肉残留。据“穴居人”小队现场推测，这些尸骨皆为猎犬啃食导致。
//
//在众多死尸的中央，停放着一架由零散材料拼绑而成、已被彻底挤扁的轮椅，轮椅旁则有一副被啃食殆尽的骨架；骨架的附近静静地躺着一把小提琴与完好的琴弓。在众多损毁物件之中，这把小提琴反常的完整吸引了小队成员的注意，他们将其一同带回了M.E.G.“家政服务”哨所。
//
//经检测，该小提琴的琴弦磨损严重，疑为过度使用所致。同时，弓把与与琴弦上皆侵染有大量血渍，应为演奏者所留下。经过维护与测试后，M.E.G.正式将其编号为Object C-47。
//
package wupin;
public class jiutiqin1047{
}