//package wupin;
//
//public class jiweixuejiu1198 {
//
//}
//Flesh C-198 - “鸡尾血酒”
//
//
//评分: +10+–x
//躯器编号：Flesh C-198
//
//代价：较大
//警告： 该项改造涉及大规模的组织替换，尽管影响已尽可能减少但仍带来一系列外观和生理上改变，“躯”不对该项改变所造成的任何负面心理反应负责。
//
//安装位置：全身循环系统
//
//生产商：鸡尾血酒是由有识血肉学者氏族主导研发的大型改造决议，相关设备均进口自有识血肉，安装方式也保证严格按技术手册操作。因此“躯”仅保证安装过程安全、公正、公开，对产品性能有任何疑问或建议请直接与有识血肉对接。
//
//介绍
//鸡尾血酒是一系列针对循环系统尤其是血液的改造，通过优化血液传输功能以提高身体素质，同时这会使您的血液呈现出不一样的颜色。当然，也会改造您的造血功能系统和一部分器官以完成整体适应，让您拥有过人体格和与众不同的独自外观。
//
//具体颜色及对应效果如下，您可自由选择搭配出希望的颜色效果。若需要某一效果无法单纯通过调节血液颜色来达到，也提供环保无毒染料供您进行血液染色。
//
//红
//该颜色的血液是作为普通人类1常见颜色，若您没有进行过改造手术或有极其罕见的少数遗传特性则血液应该也同为红色，若需要改回红色仍然需支付改造价格。
//标准血红蛋白提供中肯的流动速度和输氧能力，没有什么特点也没有什么弊端，因为这是无机物文明原本就有的血液所以对身体的适配度也是最高的，上述改造仍然会保留少量红色血液作为基本调配。
//
//浅黄
//该颜色的血液含有更多的无机盐及高含量激素，大大增强使用者的爆发力，配合白色血液使用时可以有效提高使用者的综合运动素养，但如果单独使用耐力会明显下降。同时身体中的环境能让大多数细菌类生物迅速死于脱水因此对于常见的寄生虫和病菌有较强的预防能力，甚至可以抵抗一部分特殊病菌。
//
//黄色的另一种可能：前厅记录中提到少数人生因为血液中缺少抗原天生存在金黄色血液，可以自由供给他人输血，但也可能造成一些身体不便。由于这种基因极其稀少，目前尚未记录到此基因，我们也正在向人类征集拥有这种基因的蓝本。
//
//白
//该颜色的血液中更高的血脂含量，赋予血液更强的粘稠性和养分供应能力，安装此类血液还会附加一系列脏器改造保证血脂仅存在于血液中溶解而不形成其他问题。这使得受改造者能更好的控制自己体型，同时由于血脂含量增加神经系统可以更方便的获取养分，神经生长速度会略微增加， 这会让神经有更强的传达能力，也能在一定程度上促进大脑发育。
//
//绿
//该颜色的血液中有更高的胆汁素含量，同样需要为内脏覆盖少量保护器官，以保证身体正常运转，相比起正常颜色的血液，这一颜色的血液明显粘稠的多止血速度更快，但输氧能力略有下降需要配有更强输氧能力的血液共同调配。
//警告：该血液对未经过相关改造的人员有一定毒性，可能会造成器官衰竭等副作用，若是经常涉及战斗的人员使用请在身上进行相关标准。
//
//- 关闭
//是的，学者兄弟们确实尝试过使用叶绿素而非胆汁素来完成绿色效果，但是实践证明那一丁点穿透皮肤射进血液的光量吸收以后再转化成能量，对于整个躯体的能量需求就是九牛一毛，反而会增加一系列技术上的问题所以最终这一计划被废止了
//
//蓝
//该血液中的铁元素被替换成了铜元素，在常温环境下供氧能力比红色血液要弱，但是对低温高寒和缺氧的恶劣环境如level-c-271、level-c-272、level-c-273、level-c-274有明显更强的抵抗能力。由于更换内容较少对于身体的适配性也非常高，可以在身体中适当加入该类血液来提高环境抵抗能力。
//
//黑
//在与被称为龙血族的特殊实体组织进行大规模敌意接触后，有识血肉成功采取其中的一部分基因组，加上近期被发现的被称为特斯共生体的特殊类真菌生物高度自我活动的基因组共同形成的奇迹技术，相比起普通血液有匪夷所思的二氧化碳吸附能力：根据检测黑色血液可以运载数倍于红色血液的氧气，这也使得更粘稠的血液成为可能。
//
//透明
//已停产
//该产品早期投产提及过一种透明血液，从当时的测试数据来看透明血液有等同甚至超越黑色血液的供应力，但仅登录后短短数日便因不明原因迅速停产。有识血肉未对此事进行任何解释并拒绝公开接受过该类改造的人员名称，研究者在一部分截获的无限意识通信中发现该类型血液似乎跟有识血肉的超自然理论“灵魂虫”有很大关系。
//
//荧光
//该类型的血液只是单纯的在血桨中加入不会被吸收，可以吸收光量并释放的荧光酶，不会给使用者带来任何额外的特殊效果，但是能够让皮肤下层和毛细血管表层表现出轻微的荧光。近期更替过的产品中这些微光可以以一定频率变化，在保证美观的同时能起到一定程度上驱散蚊虫的功效，对于居住在热带或是潮湿区域的探索者很有作用。
//
//说明
//如何使用：
//
//一、 在您确定需要安装并付清所有款项后请向有识血肉或“躯”组织的工作人员预约时间，至少需要抽出一个月以上的时间来完成这项工作，同时在预约时请留下一部分血液或其他带有遗传物质的活性体细胞以供培养。培养不同颜色血细胞时仍然选用您的基因以减少反应，当然也可以不提供，我们将选用模板高适配型基因对您进行改造。
//
//二、 在完成预约项目后将安排一名流浪商人带您前往“母亲的城市”、躯之栖所或科研巢“电磁炉”。为保证双方的安全，您在进入时会出现意识丧失状况请不要担心，接下来的内容可完全交由我们处理。但出于公开考虑仍然会向您描述接下来工作的全过程。
//
//三、 您会被安全地放置在活体生物培养茧中，有专业的技工氏族或躯体工匠会为您划开表层组织结构并向其中注入一种经过定向基因编辑的逆转录病毒使您的骨髓组织发生改变2保证骨髓能够制造改良版的血液并略微加强造血功能。
//
//三点五、 对于一部分改动与原有生理习性差异较大的客户3也会提供专有的额外改造，包括在躯干中相对空余的部分植入额外器官来保持您身体不会因为过量改造而出现后遗症，若您不介意也可以直接进行全身体细胞改造来达到与血液的完美切合效果。
//
//四、
//到此主体已经完成，接下来的步骤只需要将原有身体中的全部血液抽离并注入经过改造后的新血液即可，在此过程中培养液会保证您的生命安全，默认套餐会收取剩余血液，若您需要取回抽出血液则需额外增加经费。
//
//五、
//您现在可以享受与原本完全不同的血液带来的独特能力，如果您希望的话还能免费附赠一个特殊服务：去除您眼睛瞳孔中的全部色素使毛细血管中的颜色展现出来，这能给你独特的瞳色。
//
//注意：
//
//一、实际上血细胞中的抗原并未做出太多修改，因此只要血型相同就算改造之后输血也不会产生太大负面反应，但是改造后的血液输入正常人类的身体就会产生极其严重的危害效果。
//
//二、 尽管原则上。该项改造不会遗传到后代，但是由于细胞中的RNA系统可能会监测到与当前所属环境存在的一定差异，所以您的下一代可能会根据您选择的血液产生一定程度的变异4。
//
//三、 我们不对除安装本身以外造成的危害，包括但不限于队友伤害，医疗者受到的伤害以及任何类似问题负任何责任，请自行与医疗兵协商相关赔偿事宜。
//
//获取
//目前其标准版仅可前往上述提到的三个区域进行专业安装，由于该项技术本身涉及身体部分较广，内容较多，改造效果独特，特殊的实验版装置目前暂时不对各位开放还请大家给予理解和支持。
//
//作者信息
//
//« Object C-197 | Flesh C-198| Object C-199 »
//
//Footnotes
//1. 有识血肉仍称为“无机物者”
//2. 若您在“电磁炉”科研巢进行此项改造则会采用与E.P.B.协同研发的定向辐射诱变技术完成，副作用更小且速度更快
//3. 例如绿色或黑色
//4. 通常是针对血液中的某种物质的更强分解能力
package wupin;
public class jiweixuejiu1198{
}