//Object 7 - “记忆罐”
//fantado-wide-mouth-fuchsia-hot-pink-mason-jar-light-w-hanging-cool-white-fairy-led-kit-27_large.jpg
//一粉色记忆罐被发现在回忆里，已带至 M.E.G. 仓库
//
//描述
//记忆罐是一种玻璃罐，会规律性变中空，中空时为其休眠状态。不可将任何事物置入罐中，置入物只会消失不见。若一个流浪者拥有记忆罐，在其死后其记忆则会以小球的形态显现在罐内，罐子随即进入激活状态。
//
//这些球体的颜色取决于其前持有者的个性。
//
//粉色记忆罐
//其会受持于无忧无虑且充满活力之人。
//
//蓝色记忆罐
//其会受持于被悲观主义者，或终身总在悲伤之人。
//
//红色记忆罐
//其会受持于愤怒或暴戾者，或不可翻案之罪人。
//
//绿色记忆罐
//其会受持于平静或悠闲之人。
//
//紫色记忆罐
//其会受持于害羞或易惊之人。
//
//黄色记忆罐
//其会受持于外向或勇敢之人。
//
//黑色记忆罐
//其会受持于实体。
//
//M.E.G. 推测记忆罐还有更多颜色，但未证实。
//
//打开记忆罐
//任何打开已激活的记忆罐之人，都可查看已故持有者的记忆。记忆将作为全息影像播放。如将记忆插入计算机系统，其将以视频的形式保存在一个新文件夹中，该文件夹名为“已故者的记忆：
//
//
//
//[前个持有人的姓名]"。
//
//售卖与交易记忆罐
//休眠的记忆罐可当纪念品出售。其会在回忆里被随机发现。B.N.T.G. 会向流浪者们售卖与交易其。package wupin;
//
//public class jiyiguan7 {
//
//}
package wupin;
public class jiyiguan7{
}