//Object 11 - “记忆汁”
//2232661901_1b3d9fb1b6_b.jpg
//一罐纯净、高品质的记忆汁，这些量的该物品可以从一些贸易商那里换取20瓶杏仁水。
//
//描述：
//记忆汁是在后室中通常在私密交易中以高价交易的药品。它是通过在水或杏仁水中加热煮沸碾碎的蠕灵制成的。摄入该物品能减轻精神压力并给饮用者带来安定的感觉。该物品有高度上瘾性，如制造不当将具有危险性。
//
//配方：
//蠕灵可以在后室中的多个地点获取，但在潮湿腐烂的地区最为常见。收集蠕灵时要小心，大咬几口就会导致完全失忆。
//
//每份需要：
//
//1磅(16 盎司)1碾碎的蠕灵, 大约4-6只个体
//4盎司2水/杏仁水
//加热容器
//火源
//一块布(用于过滤)
//1. （戴好手套3）挤压蠕灵直到毒液从其咽部溢出，继续挤压直到其几乎全部液化为止。
//
//2. 将所得液体与蠕灵残余一起加入加热容器。（比例约为一份水/杏仁水对三分蠕灵汁）
//
//3. 加热至沸腾，且液体散发烟草气味为止。如需制得药效更强的记忆汁，减少加热时间。过度加热会减少药品效果，但加热不足会导致使用者记忆丢失。
//
//4. 冷却后，立刻将液体倒入过滤装置，将记忆汁从蠕灵残余中全部挤压出来，并丢弃蠕灵残余。
//
//5. 将记忆汁装瓶。
//
//功效：
//如制作得当，记忆汁能对使用者产生镇静的效果，其副作用类似于大麻与酒精。记忆汁的作用包括头晕、心情平静、对当前情况的接受、压力的缓解和心率的减缓。 然而，该物品非常容易上瘾，通常在使用过记忆汁1-2 次且不再使用时会出现戒断效果，表现为浑身乏力、精神压力大、易怒、血压升高及昏厥。
//
//大多数由记忆汁成瘾引起的死亡是由更致命的药物剂量导致的4，包括不断减少其加热时间。 饮用未煮沸的记忆汁将导致所有记忆完全消失，使用者只能行走、呼吸和进食，并会在几个小时内变成悲尸。一些上瘾者会生吞活蠕虫，这会导致相同的结果。
//
//B.N.T.G.正在考虑为记忆汁上瘾者建造一个康复中心。
//
//作者
//« Object 10 | Object 11 | Object 12 »
//
//Footnotes
//1. 译注：约为453.59克。
//2. 译注：约为113.40克。
//3. 译注：原文为WEARING GLOVES。
//4. 译注：原文为Most deaths that are caused by Memory Juice addiction result in more deadly doses of the drug, including boiling it for less and less time.疑为原作者笔误。package wupin;
//
//public class jiyizhi11 {
//
//}
package wupin;
public class jiyizhi11{
}