//package wupin;
//
//public class kasabulanka1034 {
//
//}
//Object C-34 - “卡萨布兰卡”
//评分: +13+–x
//物品编号：C-34
//描述
//Casa_Blanca_lily_04.jpeg
//卡萨布兰卡，敬已逝之人，愿死者安息。
//
//属类：生物|植物|灵类|迷幻
//Object C-34是协会发现的一种仅在后室中生者死亡时，以及半死者转化时身旁生长的花朵。其外观洁白，此名取前厅中死亡与幸福之花之名。
//
//Object C-34现被协会广泛的用于葬礼，以及拯救那些即将堕落之人。
//
//用途
//e1ihrp.png
//还记得你的过去吗？醒来。
//
//Object C-34具有多种效果，其最普遍的用途，是点燃后吸入烟雾会让人陷入关于一些特定记忆的幻觉，且效果强烈，戒断反应不明显，因此，“卡萨布兰卡”被许多瘾君子所追捧。
//
//此外，若捣碎卡萨布兰卡，并将其泡水服用，可略微修复小部分身体损伤，并治疗大部分精神创伤，和振奋精神状态（且不存在抗药性）。据最新的资料表明，若一次性使用四朵Object C-34，可中断堕落进程（部分组织称为“悲尸循环”），或让半死者略微恢复清醒2-3分钟。
//
//卡萨布兰卡同时具有通灵的作用，手握特定数量的卡萨布兰卡，回忆特定记忆（此时会对其要求有感应，取决于自身意识清醒程度），且周围环境达到要求即可。
//
//通灵
//通灵要求与结果
//回忆	要求	结果	备注
//在前厅时和新女友去餐厅约会	手握四支卡萨布兰卡，准备一个烛台，上放香薰蜡烛，面前放置食物，另一手握层级密钥	通灵出了其在前厅时的女友。	[已编辑]我[不雅语言编辑]你[不雅语言编辑]的！
//被突然窜出的未亡者吓了一跳	咀嚼卡萨布兰卡拌杏仁水	通灵出了一名未亡者	无
//第一次进入Level 0	手握两支卡萨布兰卡，另一手握层级密钥	通灵者消失，最后发现其回到了Level 0，但通灵者大脑功能严重受损，已不能生活自理	逆向通灵？
//第一次犯下罪孽	手握三支卡萨布兰卡，穿上一件棕色斗篷	通灵出了审判长。	该通灵者并非来自协会，其已被Argos审判。
//一场葬礼	手握八支卡萨布兰卡，吊唁死者	通灵者感到了精神空虚且头部剧烈刺痛，未通灵出任何存在	无
//一场葬礼	手握八支卡萨布兰卡，吊唁死者	空气变得寒冷，依旧未通灵出任何存在	无
//一场葬礼	手握八支卡萨布兰卡，吊唁死者我将亲自前往。	通灵者下落不明	当天是清明节
//绝望	手握五支卡萨布兰卡，回忆你的过去	通灵者静坐了很久。	无
//发现地点
//自失落的时代起，人们便发现了卡萨布兰卡。那时他们只把它用于吸食。
//
//卡萨布兰卡只会在死于土地上的死者身旁生长，七天方得开花。
//
//如果有生者堕落（化为悲尸），在他脚下也会生出一朵卡萨布兰卡，十四天方得开花。
package wupin;
public class kasabulanka1034{
}