//package wupin;
//
//public class kongjianyibiaopan1036 {
//
//}
//Object C-36 - 空间仪表盘
//物品编号：C-36
//
//空间仪表盘是由第一钢铁集团（F.I.G.）发明生产的一种空间学仪器。
//
//jIzCBd.jpg
//“空间仪表盘”在生产线上的样子
//
//描述
//空间仪表盘是一个由天线、旋钮、电路系统、电路仪表和一组三位整数+三位小数辉光管组成的用于测量空间非欧几里得曲率的仪器。其外壳由钢板通过螺丝和卡扣固定而成。外型是一个50*20*30（厘米）的长方体，其上有一只天线，前面包含一组辉光管和一个旋钮开关。
//
//“空间仪表盘”在后方有一块透明塑料盖板，通过卡扣和铰链连接在外壳上，如果您需要检查内部，请打开卡扣并打开盖板。若您不是专业工作人员，请不要随意拧开螺丝，因为这有可能导致内部导线断裂和短路。
//
//在“空间仪表盘”的侧面有数个指针仪表盘。分别是电磁波电压、电流、频率和测量范围。他们分别最大是5A，6000V，300KHz和10km。如您发现仪表盘异常，可以到附录内的“常见问题维修表”进行查阅，如不能修复，您可以到F.I.G.的维修站进行维修。
//
//在“空间仪表盘”的上方，有一只天线。它用于接收和发射脉冲。我们强烈不建议在仪器大功率大量程运行时让您的肢体触碰或接近天线，否则可能会导致致命电压击穿空气导致您有生命危险。
//
//辉光管显示器由三个整数管和三个小数管组成。若您的空间仪表盘并未损坏，那么您只会在显示器上看到000.000～100.000之间的数字，若您看到其他数字，请在附录内的“常见问题维修表”内查阅，如不能解决，您可以到F.I.G.的维修站进行维修。辉光管会显示您在旋钮上设定的检测范围内的空间曲率值。
//
//旋钮上标注了off和100m～10km的量程，通常来说，量程越大，侧面仪表上的电流和电压等参数越大。电池盒位于外壳后方，使用一块F.I.G.生产的BK-001 充电电池。
//
//显示在辉光管上的数字代表了这个空间的“欧几里得”值。欧几里得值每增加0.001，则代表了某一物体在检测范围内每移动一米被折返的可能性增加0.001%。
//
//注意事项
//避免仪器接触-15摄氏度以下的低温与80摄氏度以上的高温
//禁止接触强磁场
//保持内部清洁
//避免冲击以防止辉光管破碎
//如果仪器的损坏是人为违反以上事项，恕不退换。
//
//原理
//众所周知，在一个常见的非欧几里得空间（例如Level 0）内，一个物体向前走直线运动足够的距离后会回到起点。F.I.G.的“空间仪表盘”利用了这一点，通过发射端发射一束电磁波脉冲，由于非欧空间的性质，这束电磁脉冲最终会回到起点，并重新被天线所接收。通过检测接收到的脉冲的波形、波长、频率等数据的衰减，可以得知电磁波走过了多少距离被非欧空间所“折返”。具体数学模型不做过多赘述。
//
//防伪标识
//您可以在“空间仪表盘”的侧面找到一块金属铭牌，上面应刻有以下信息：
//
//品名
//生产日期
//使用年限
//生产批号
//防伪码
//质检员
//您可以在F.I.G.数据库中找到防伪组件，输入防伪码后即刻检查真伪。
//
//附录 常见问题维修指南
//注：我们不建议流浪者自行维修，因为这很容易导致更难解决的问题，我们依然建议到维修站寻求专业人员的帮助。本指南是写给有相应技能且十分熟练的流浪者使用的，若您没有相关技能，请不要自行维修。
//
//显示数字异常
//电磁波参数同步异常
//显示器和仪表无反应或乱码
//通常这类情况有以下几种损坏可能：
//
//电路接触不良
//天线破损
//附近有电磁干扰源
//第一种情况，检查辉光管电极接触。
//第二种情况，请到F.I.G.维修站更换新的天线。
//第三种情况，请清除干扰源。
//
//B.Q.I. Inspection certificate展示区
//
//BmUdsXUz.svg
//经B.Q.I.检验，该物品各项指标均符合要求，为其颁发检验合格证书，
//
//B.Q.I. Inspection certificate编号：B.Q.I. Inspection certificate C-004
//
//检验项目：空间仪表盘	颁发日期：2022年7月18日
//颁发人员：General thunder	截止日期：2025年7月17日
package wupin;
public class kongjianyibiaopan1036{
}