//package wupin;
//
//public class kongbo1003 {
//
//}
//Object C-3 - “空珀”
//评分: +27+–x
//物品编号：C-3
//
//位置：C层群的诸多层级
//
//photo-1645201233154-80125533a32c?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1170&q=80
//一块经由人工雕琢并准备制为饰品的Object C-3。
//
//描述：
//Object C-3，官方名称“空珀”。失落一族的成员亦称其为“婴矿”。
//
//空珀是一种质地相当坚硬1的罕见矿石，偶尔可在洞穴或是岩壁一类的地点发现。辨识其构成元素的实验项目至今无果，相关人员不得不合理怀疑构成空珀的化学成分乃一全新元素。又或者，在后室这种超出常规的异常之地展开此类实验在一开始就缺乏意义。
//
//一般而言，矿物的颜色会受多种因素影响，如纯净度、金属离子的电子跃迁、色心致色等等。但目前发现的所有空珀全部呈现着完全透明的无色状态，无一例外。目前猜想普遍认为这是由于空珀的成分极为惰性，并也因此保证了自身的绝对纯净。
//
//辨认空珀有多种方式，而最常用与最简便的一种是：空珀会持续保持着反常的温热2。单块个体乃至整条矿脉都具有这种特性。
//
//用途：
//在初期，空珀仅仅因为其罕见、外观、以及特殊的温度而得到青睐，并由此被列为一种珠宝。流浪者们将空珀视作普通饰品的原材料，且短暂引领过一段时期的时尚潮流。为此，部分大型团体在那段时期内对处于自己控制中的数条空珀矿脉较为重视。
//
//但随着时间推移，人们逐渐发现了空珀最为重要的另一性质。记录在案的最早一起案例发生于一次博罗利亚虹石冶炼活动中：一名操作员佩戴的空珀饰品因故掉落，并接触高温。在进行善后处理时，该操作员吃惊地发现镶嵌在饰品上的空珀已经完全变成了一小块博罗利亚虹石。
//
//简洁起见，其余事例与研究过程不于本档案展示，此处仅列结果：空珀若在高温3环境下与任意一种矿石直接接触，将导致自身完全转化为后者。此种转变的速率极快，且不可逆，并无视质量上的差距或是任意其他因素之影响。
//
//这意味着，一块矿物就能够驱使无限量的空珀发生异常转变，完全化作自身。也就是说，空珀完全等位于所有矿物类资源。在可预见的未来，争取空珀矿脉掌控权的战略性活动或许会增多。
//
//作者信息
//« Object C-2 | Object C-3 | Object C-4 »
//
//Footnotes
//1. 莫氏硬度约为9.5。
//2. 当前研究表示此性质并不具备危险。
//3. 最低温度要求约为823K（约550℃）。确切温度仍在研究。
package wupin;
public class kongbo1003{
}