//Object C-62 - “狂野秋裤”
//评分: 
//+29
//+
//–
//X
//660e3c24c0fcb63e.png
//狂野秋裤的图片
//
//物品编号：C-62
//
//描述
//狂野秋裤为一种后室中独有的物品，其外观与前厅中的秋裤基本一致。不过狂野秋裤的颜色与款式完全随机，且其轮廓总是会出现红紫色的霓虹彩线。
//
//当一名流浪者穿上了狂野秋裤之后，其往往会感觉到一种“来自内心的温暖”。不过这种温暖很快就会消失。在流浪者穿上狂野秋裤大约10分钟后，其腿部会产生“刺挠儿感”。当“刺挠儿感”出现，狂野秋裤将无法被脱下直至“刺挠儿感”消失。在“刺挠儿感”出现后的大约2小时内，这种感觉会随时间的推移而增强，流浪者的行为也会受其影响。具体分为以下几个阶段:
//
//668a31f81be20054.png
//被“刺挠儿感”折磨的流浪者。
//
//穿上后的约10~30分钟。此阶段内，流浪者会开始不停地抓挠腿部并拉扯狂野秋裤。同时，流浪者的腿也会因“刺挠儿感”而开始不自觉地摆动。动作类似于前厅中的“踢踏舞”或“鬼步舞”。
//穿上后的约30~60分钟。此阶段“刺挠儿感”增强，流浪者抓挠腿部的动作会开始加快并更加用力，腿部的摆动频率也会增加。
//穿上后的约60~90分钟。此阶段“刺挠儿感”进一步增强，流浪者摆腿的频率与幅度皆会因此而增大。同时，流浪者也会因此做出一系列高难度、技巧性的力量动作。类似于前厅中的“街舞”
//穿上后的约90~120分钟。此阶段“刺挠儿感”达到最强，流浪者会因此完成一些他们平时无法完成的动作。例如：风车，托马斯等。不过若流浪者体力已经耗尽，他将无力去完成这些动作，取而代之的是在地面上不停“打滚”并更加用力地抓挠腿部。无一例外的是，无论流浪者平时性格如何，进入此阶段后其动作皆会变得十分“狂野”。因此，Object C-62被命名为狂野秋裤。
//a511fbdecab171d7.png
//完成“街舞”动作的流浪者。
//
//穿上后的约120分钟之后。此阶段“刺挠儿感”会逐步减弱直至消失。在“刺挠儿感”彻底消失后，流浪者即可脱下“狂野秋裤”。在脱下狂野秋裤后，大部分流浪者腿部都会因为抓挠而留下伤痕，这些伤痕在未愈合时会发出微弱的蓝紫色荧光。
//狂野秋裤除了轮廓总是会出现红紫色的霓虹彩线外，在视觉和触感中与前厅的秋裤别无二致。不过其十分坚固，几乎无法毁坏。这也使得穿上狂野秋裤并出现“刺挠儿感”的流浪者必须经过两个多小时的折磨后才能脱下狂野秋裤。所以建议流浪者在穿上狂野秋裤后的10分钟以内脱下。
//
//若往狂野秋裤上喷洒杏仁水或纯净水，则会浮现出“后室娱乐”的logo和“博君一笑”的字样。
//
//logob.png
//浮现的图像。
//
//用途
//狂野秋裤在应急时可以当做普通裤子来使用，不过穿着时间尽量不要超过10分钟
//
//获取
//在Level C-70的商店中以及新品推荐员处购买。
package wupin;

public class kuangyeqiuku1062 {

}
