//package wupin;
//
//public class lansha1030 {
//
//}
//Object C-30 - “蓝砂”
//评分: +53+–x
//%E8%93%9D%E7%A0%82
//一片蓝砂地的照片。
//
//物品编号：C-30
//获取：主要为Level C-30.k
//
//描述
//蓝砂是一种深蓝色的天然合金，其中包含锇与2种构成其特殊性质的未知金属，任何存在沙砾的层级中都有极少量的发现，在Level C-30.k中最为常见。通常情况下蓝砂都为粉末状，且含有剧毒。将其吸入会对肺部造成极大伤害。因此在收集时需要进行严格防护，但蓝砂同样会对装备造成损坏；如对装备造成侵蚀，出现类似于火烧的痕迹，甚至是砸在装备上就有可能导致其严重损坏，因此在严格防护下也不应长时间接触。蓝砂本身不会被自己破坏或侵蚀，长期浸泡于水中的蓝砂可能会生锈。
//
//若流浪者直接与蓝砂接触，其接触的部位将会在29小时内出现霉斑、溃烂等症状。症状的出现速度取决于与蓝砂接触的时间，这种症状无法被任何后室中已知的治疗物品所治愈。
//
//性质
//蓝砂在固态时表现出耐高温、导热性强、导电性强的性质，在其表面通常会出现一些形如淬火、扭曲的条纹，或者是呈现出锈迹斑斑的样子，少数情况下蓝砂能呈现出如同海洋的画面。蓝砂与同种或不同物体进行碰撞会产生极大的噪音，这会导致听觉明锐的实体被吸引、或是流浪者鼓膜受损。使用蓝砂制作的武器十分坚硬且具有韧性，可以较为容易的破坏其他金属，且其自身不易被破坏。已被证明的是，将悲伤之水浇在蓝砂上可暂时降低其危害程度，但鉴于悲伤之水的性质这种方法不常用也不推荐使用；如果悲伤之水被蓝砂吸收，其毒素在短时间内将降到最低、且蓝砂在碰撞时发出的噪音也会大幅度减少。
//
//一段时间后悲伤之水的功效可能会停止，此时能够通过使蓝砂碰撞后引发的噪音来确定是否有效，失效后重复浇灌悲伤之水将不会再次起效，因此以上办法只适用于紧急状态下减小蓝砂对人体的危害的措施。
//
//液态的蓝砂会像投影仪一样映射出Level 7的影像。当在温度在0℃以下时，蓝砂将开始融化，其融化的速度比同体积的冰块在0℃以上时的融化速度略快。蓝砂存在一种独特的性质，当它一部分发生融化，与其接触的周遭的蓝砂也会开始融化，这种现象被称为“坍塌效应”。此时，蓝砂会出现巨大的吸引力，会将流浪者拉入其中。当被拉入时，这会导致切入Level 7、或是在其凝固后在内部窒息。如果侥幸逃脱，那些与液体状态下蓝砂接触的部位将会在2小时以内腐烂，腐烂过程极快，会使流浪者产生剧烈疼痛。
//
//曾有流浪者上报，在其他层级中发现里疑似由蓝砂组成实体；如常见的银骨、车兽，或是更多身上拥有金属零件的实体。木灵、墙手、间生等需要寄居在墙壁上的实体，它们同样能够出现在蓝砂材质的平面上。当此类实体出现在蓝砂上时会表现出异常的狂躁，并且尝试将流浪者一同拉入蓝砂内部。
//
//新增信息
//蓝砂在不同层级中可能出现其他颜色的种类，为保留标识性，经管理层讨论不同种类颜色仍命名为蓝砂：不同颜色的蓝砂保留了低温融化、高温凝固的性质外，噪音与对人体的损害大幅度降低，这使得它们很难在常规情况下被发现。它们几乎丧失了将流浪者转移到融化时景象中1层级的能力，但其含有的引力被大大增强，因此被用于制造陷阱、武器等。
//
//用途
//常规情况下使用蓝砂制造物品或设备是受管制的，因为其不稳定并且会对人体造成严重伤害，目前仅发现一种能将蓝砂无害化的方法：在液态蓝砂中添加治愈药剂来合成蓝砂锭后毒素会降低到无法对人体直接造成影响，且更加稳定。此时蓝砂才被允许用作材料，根据治愈药剂添加量不同，蓝砂锭也会受到影响，下列表格以供参考：
//
//比例	变化
//添加约1:1的比例	这种情况下蓝砂的融点降低到约-20℃，其造成的伤害与产生的噪音无明显变化。
//添加约1:2的比例	这种情况下蓝砂产生的噪音被大幅度减小，但仍会对人体或装备产生损害。
//添加约1:3的比例	这种情况下蓝砂被证实很难因为低温而融化，但对未保护者仍可造成直接的伤害。
//添加约1:5的比例	这种情况下蓝砂被证实无法对人体造成伤害，但长期的接触仍有瘙痒感出现。
//蓝砂锭中所添加的治愈药剂比例不同，它的用途也有不同。即使蓝砂在Level C-30.k有大量储备，但其因加工所需要的原料治愈药剂稀缺，使得蓝砂锭无法大量生产，目前我们正在寻找一种更为低廉的材料来代替治愈药剂。
//
//已展开剩余信息
//折叠信息（1）
//曾有流浪者同时向多个组织上报在Level C-30中进入了一片特殊的区域，整个区域的沙砾都被替换成了某种深蓝色的金属碎屑，但因附件中的照片疑似为海洋，这篇报告被当成了流浪者的错误报告而不予理睬。但消息被B.F.P.F.得知后，他们在Level C-30中发现了一片完美符合描述的区域，也就是Level C-30的子层级，Level C-30.k。最先进入此层级的一批人员因实体袭击，在完成上报后便断开联系。在此次考察消息传出后，更多组织为层级中的大量蓝砂储备而开始寻找Level C-30.k。
//
//折叠信息（2）
//有很多人尝试进入Level C-30中收集蓝砂，但那群在夜晚出去试图收集蓝砂的人都失败了，并且手上出现了类似霉斑的东西，更有严重者的手开始了腐烂。最后蓝砂收集在7月11号凌晨告终，大部分被流浪者收集的蓝砂都因途中实体袭击或各种原因而丢失，能被用来研究的蓝砂寥寥无几。但很快M.E.G.开始了第二轮的收集，他们清理出一片区域并且声称Level C-30.k中的任何威胁都在可控范围内，以丰厚的报酬鼓励人们前往Level C-30.k自杀般的收集蓝砂。最后这次收集活动导致了很多流浪者的死亡，活下来的流浪者并没有第一时间收到M.E.G.的任何声明与补偿，最后暴乱的流浪者煽动群众引发了112事件。流浪者愤怒地攻击了所有M.E.G.人员与他们的设施，最终他们的怒火终结于M.E.G.在C层群一个大型主要基地的沦陷，有关传言称这个基地的大半物资在数月前已被转移，但这一点尚未得到证实。
//
//作者信息
//« Object C-29 | Object C-30 | Object C-31 »
//
//Footnotes
//1. 不同颜色的蓝砂会映射出不同层级，如紫色映射出存在星空的层级、绿色映射出森林层级、白色映射出存在建筑的层级
package wupin;
public class lansha1030{
}