//package wupin;
//
//public class leishenchuidonglitujihujia1117 {
//
//}
//Object C-117 - 雷神锤动力突击护甲
//
//评分: +25+–X
//the Jotaro (内含BGM)
//作者页
//
//背景音乐：
//
//
//图片来自https://commons.m.wikimedia.org/wiki/File:Eridanus_galaxy_cluster.gif
//https://commons.m.wikimedia.org/wiki/File:Concept_art_of_military_exoskeleton.png
//https://commons.m.wikimedia.org/wiki/File:Hardiman_I.png
//其余图片均通过https://6pen.art/制作
//
//本页的问题
//
//
//
//
//
//
//
//
//
//
//The ListPages module does not work recursively.
//条目讨论
//
//language.png
//其他语言
//icon-history.png
//历史
//edit.png
//编辑
//page-action.png
//其他
//Object C-117 - 雷神锤动力突击护甲通常指由 探险者总署
//The Major Explorer Group (M.E.G.)
// 发现、记录、归档并命名的一套已损毁的外骨骼动力护甲。在The M.E.G.对外公开的档案资料库中，该条目相关内容被分类至Object，编号为C-117 [1]，其检索路径为"/Object-C-117"。
//
//Object C-117被宣称保存在一个名为 泽塔
//Zeta
// 基地的M.E.G.未公开驻地内，其附属项目MJOLNIR B也在该基地内进行并完成。
//
//注意：本条目内容主要由The.M.E.G.档案资料库提供并维护。
//
//危险性操控性稀有性神秘性适用性技术性
//折叠
//目录
//来源
//描述
//相关人物
//凯瑟琳 · 伊丽莎白 · 哈尔西
//科特 · 埃克森
//相关争议
//参考资料
//脚注
//来源
//来源
//关于Object C-177可追溯的最早的已公开发现记录是The M.E.G.层级机理研究员哈尔西博士在Level C-175驻扎研究期间进行例行健康检查后报告的一种异常清醒梦。在报告中，哈尔西博士描述了一些关于行星、宇宙的场景，但在当时被认为是过度研究引发心理暗示和精神疲劳而未得到充分注视。
//
//在报告存档的一周后的23时45分，驻扎在Level C-175泰拉基地的总署警卫接到了来自哈尔西博士住所的紧急呼叫，待警卫赶到其住所外部时，便发现Object C-117以坐立的姿势靠在住所墙壁旁边。在现场初步确认无威胁后，Object C-117与哈尔西博士被一同带去泰拉基地的实验室进行事件询问与调查。
//
//事后，Object C-117经多次转运和临时存储，最终在所有调查与研究项目结束后被决定放置在总署位于C层群的ZETA基地大厅处公开展览，The M.E.G.声称此举是为了将该物品作为象征性物品用以表彰和纪念所有在后室牺牲的总署成员与他们留下的勇气。
//
//描述
//描述
//Object C-117 -  雷神锤动力突击护甲 GEN1 MarkⅤ[B]型
//MJOLNIR Powered Assault Armor System GEN1 Type MarkⅤ[B]
//  是一套未知来源的全覆盖外骨骼动力装甲，通体呈黑灰色，有部分银色点缀，高2.3米，净重453.6公斤。该装甲左大腿外侧和背部各有一处磁吸枪套，分别装配了一把未知型号的手枪与无托式步枪，检查后发现已无子弹残余，右肩处绑有一短刀鞘，内置的一把反曲刀已经折断，头盔后脑处还有一个可插拔的芯片，经调查后可知该芯片应当被用于搭载高智能AI。除此之外，护甲的头盔面甲正面大规模破碎，躯干部分有相当密集的弹孔/痕与全身大面积的无法消除的高温灼烧痕迹，腹部有一条约0.5cm宽的被高温固体贯穿的痕迹，后颈处有一弹孔和不明显的爆炸残留痕迹。左胸口有一处疑似归属标识的图案，但并不完整，可以辨认出的部分是一只向上展翅的鹰，双爪分别握着箭矢和闪电，具体细节和意义不明。
//
//Object C-117的外部由一种未知成分配比的钛合金组成，合金表面覆盖有一种利于散热的材料涂层，目前尚未知其具体作用。这种合金的强度高出了目前总署所有已投入实用的工程材料，就防护能力而言，护甲的合金部分能够在能量护盾失效的情况下完全阻挡住12.7mm口径的钨芯穿甲弹并只留下约1 - 2cm的凹陷。
//
//在装甲板下的部分则是一套覆盖全身的黑色内衬，材料未知，但表面也覆盖有一种耐热涂层。内衬有多出损坏，从表面破损处能够看到内部的凝胶层，由拥有类似非牛顿流体性质的凝胶构成，能够在受到冲击时迅速凝固硬化。而更加深入的破损则显露出了内部的一层由 聚合态铌酸锂
//polymerized lithium niobocene
// 构成的金属液晶织物填充层，具体功能未知，但为了防止泄露，研究团队在后期人工填补了这些较为严重的破损洞口。
//
//头盔部分含有一块单向透光的强化玻璃面罩、位于后脑的人工智能储存芯片、两个强光灯和一套空气过滤系统，在接通能源系统后其内部面罩内显示有一套 HUD（平视显示器）
//Head Up Display
// 成像系统，包含了小型雷达显示、强AI交互区域与数字化装备显示模块和多种传感器终端显示模块。其中雷达系统因不明原因无法生效，AI交互模块因AI缺失与总署本身所拥有的AI智能程度过低而无法使用。另外的，该头盔HUD系统似乎还和装甲手部护具相连通，通过手指部位装甲板上内置的感应装置，能够与拥有特定/相同设备接口的设备/武器相互连接，从而在HUD上显示相关信息。
//
//该护甲的外部留有一些数据接口、可拆卸连接模块和预留硬件扩展接口，理论上只要有足够时间，该护甲便是可以被完全拆卸的。但实际上，总署研究人员完全无法拆除护甲的任何一个零件，仅可以将头盔与躯体部分进行分离。故难以进行对装甲本身结构的研究，具体原因未知，推测是物品自带的异常效应。
//
//在该护甲系统被发现后，The M.E.G.研究团队经讨论后将其转移至了总署ZETA基地研究站，并将后续阶段的分析与研究工作交给了由哈尔西博士领导的ZETA基地研究团队与泰拉基地初期研究团队共同组成的研究组负责。
//
//在研究初期，研究人员便利用短时间输入大量电力的方式成功启动了护甲的能源系统，但遗憾的是只能保证最低程度的活动，即支持内部部分系统和BIOS界面启动并通过线缆传输转接到外部计算机显示与交互，所幸的是数据存储较为完好，且护甲系统在无总署研究员介入的情况下主动解除了部分内容的加密。“雷神锤动力突击护甲 GEN1 MarkⅤ[B]”便是从其数据系统中提取出的代号/型号，那么据此推测，这套护甲应当至少还有Ⅰ至Ⅳ四个前期型号，但由于缺少证据，也只得停留在推测阶段。
//
//而对该护甲的硬件设施进行的逆向工程计划也在同步实施。工程起初由于Object C-117无法拆解的特性而举步维艰，但在研究人员的努力和相关合作组织E.P.B.的帮助下，成功利用非前厅科学技术对Object C-117开展进行了逆向工程，这一工程项目的被命名为MJOLNIR B，并在后续阶段贡献了许多了新型技术。
//
//Eridanus_galaxy_cluster.gif
//波江座示意图
//
//值得一提的是，在Object C-117的内部系统内，关于时间的记录程序一直定格在2552年9月1日的22时34分52秒，而定位系统显示的位置经过解码则是令人难以置信的 波江座
//Eridanusì
//  -  天苑四
//ε Eridani
//  - [其余数据损毁]。研究人员曾尝试对这些数据进行追踪分析，但更具体的细节数据均受到高度加密，无法破解。
//
//在末期研究完成后，由于一场意外事故，Object C-117进入了“ 护甲锁定
//Armor Locked
// ”状态并主动关闭了所有能量供给通路和相关系统，无法通过外力介入改变其形态姿势。在The M.E.G.内部商讨后，Object C-117最终被放置在ZETA基地的大厅处，并用高强度防弹玻璃制作了一个专用的展览台。
//
//相关人物
//相关人物
//凯瑟琳 · 伊丽莎白 · 哈尔西
//凯瑟琳 · 伊丽莎白 · 哈尔西
//Catherine Elizabeth Halsey
// ，隶属于The M.E.G.测验者团队的后室研究员，通常被称为“哈尔西博士”。在多个异常/非异常科学领域均有研究涉猎和成果。哈尔西曾任层级研究员，主导并进行了多个层级的研究项目，包括Level C-175等著名层级。
//
//在遭遇Object C-117后，哈尔西便与The M.E.G.研究团队一起开始了对其的研究工作，并在多次人事调动中坚守研究主管职务。她一手带领了关于Object C-117的研究团队，发表了多篇论文，揭示了Object C-117的机械结构和内在机密。并在后续工作中主导了MJOLNIR B项目的开发与实验。
//
//科特 · 埃克森
//科特 · 埃克森
//Kurt Exxon
// ，在关于Object C-117与MJOLNIR B项目的研究中担任凯瑟琳 · 哈尔西的研究副手。职位为研究员，主要从事计算机程序等方面的研究，在对Object C-117的修复工程与控制实验中取得了重大成果。
//
//相关争议
//相关争议
//有传闻声称该物品并非仅是一套护甲这么简单。根据近期解密的M.E.G.机密研究资料显示，除了此前备受关注的MJOLNIR B军备项目外，还有一份关于“雷神锤护甲内部的复数人类灵魂（疑似）残余”的实验报告和相关记录公开，并且在这份文件中，明确提出了雷神锤动力突击护甲来自前厅的观念。这份被隐秘了近8年的报告一经公布便在各团体和独立流浪者之间引发了轰动，以至于更有甚者怀疑当初The M.E.G.与E.P.B.在此物品的相关合作研究项目上隐藏了某些秘密，但该传闻很快遭到了The M.E.G.官方的否认。[2]
//
//而根据The M.E.G.公布的实验报告记录显示，在对雷神锤护甲的研究初期，凯瑟琳 · 哈尔西博士与雷神锤护甲展开了多次交谈，这一情报直接否决了其他组织曾经对雷神锤动力突击护甲为无价值无意识物品的判断报告。并且，在哈尔西博士与其展开交谈的期间，Object C-117曾经多次提到了有关“战争与苦难的未来”，并在哈尔西博士面前说出了“这会是一个不错的‘庇护所’”的言论。而雷神锤护甲中所残余的“灵魂”究竟在暗示着什么样的未来，前厅世界究竟会发生什么，为何护甲系统的时间戳与三角定位如此非同寻常，这个“灵魂”究竟是否还存在，这些情报至今仍在M.E.G.的保密中，我们不得而知。
//
//不过，值得一提的是，最近在M.E.G.论坛上，凯瑟琳 · 哈尔西博士公开了一份多年前的博客，其上记录的正是她曾经那些与Object C-117高度相关的异常梦境。
//
//……接连三四个晚上，我都做着一个完全相同的、让我感到煎熬的梦。我能感觉到自己仍清醒着，我能够在梦中清楚的认识我自己，并且看到梦中的画面——就像是我变成了一个孤独的魂灵。
//
//我试过安眠药，也试过医生建议的调理法，但仅仅只是让我安睡了几日。直到昨晚，我发现那个梦境变得更加清晰，仿佛原本眺望的高山突然拉进到眼前。
//
//哦，我好像偏题了。那是一个像极了前厅，又或者说地球的地方——就和我现在所在的这个层级里的那些行星们一样。我遇见它时，那颗陷入暗红色火焰的行星四周遍布环绕着的残钢废铁、卫星碎片、断成两节的战斗机、太空港（如果真的这么称呼的话）以及柱状的巨型飞行器的残骸（像极了科幻片里的场景，如果按我曾看过的那些影片来说，也许应该叫它们太空母舰或者驱逐舰之类的？就像是海军军舰一样）。
//
//我看到它的身上燃着连绵不绝火焰，流动着岩浆，我看到险峻的高山被劈成两半，钢铁的残骸躺在它的身上燃烧。
//
//我感到它和它身上生存着的生命在哭泣、在嘶吼、在呼唤我，想要把我束缚在那里。我感到一股似是而非的力量在托举着、包裹着我，却又像是要让我离开。
//
//我的心里涌出一股无言而熟悉的思绪，我知道那是面对死亡的绝望，还有死后的希望。
//
//而在那个梦境结束的瞬间，我的视野总是闪过一张合影——那是一队身着装甲的军人。我看不到他们的脸，却感觉莫名的熟悉。
//
//每次醒来，这些画面便在我的脑海里挥之不去，回忆它时，却又引出一股难以言喻的感情萦绕着我。……[3]
//
//参考资料
//参考资料
//[1] M.E.G.档案库 《关于对新Object的文档审核公开通告》（The M.E.G.档案资料库，2030.06）
//[2] M.E.G.档案库 《可公开情报白皮书（2038）》 （The M.E.G.档案资料库，2038.12）
//[3] 凯瑟琳 · 哈尔西 《回忆录》 （2039.02）
package wupin;
public class leishenchuidonglitujihujia1117{
}