//package wupin;
//
//public class leitanbu1102 {
//
//}
//Object C-102 - “类碳布”
//评分: +5+–x
//- 退出系统
//身份确认…
//欢迎您，研究员
//
//物品编号：C-102
//
//位置：C层群内的绝大多数层级，只可能以不同规格出现在小型封闭空间中，例如柜子抽屉等，整卷的类碳布目前尚未发现。
//
//ygE74LoxfI9qsUW.jpg
//实验室中的一块类碳布。
//
//发现：
//初次发现是由公司员工在层级的某一抽屉中寻找可供饮用的杏仁水时偶然发现，将其带回Level C-340。有流浪者声称在此之前见过此类物质。有关类碳布在不同层级发现的消息偶尔出现。
//
//描述：
//类碳布是这一类材质的总称，每一块类碳布都由及其纤细的黑色丝束通过某种方式交联1形成的宽约0.5mm的布条斜织而成。类碳布的结构相当松散，可以将其中布条抽出并重新进行再编织。
//
//性质：
//通过一系列实验无法确定类碳布的元素构成，可能是由于丝束的交联方式未知，无法将其分解至丝束及以下的更小单位。类碳布有丝绸的质地与触感，但相当耐磨且无法破坏及裁剪。类碳布几乎没有弹性，任何程度的拉伸都无法使其产生形变。目前猜测其并不紧实的结构使其具有比较松滑的特性。目前未发现直接接触类碳布会对人类产生负面影响，也没有任何有关误食影响的记录。当对其上某处进行高压强穿透时，施力对象可能会突然消失，同时该物品的性状不会发生改变。对实体的影响未知，没有任何数据及记录显示该物品对目前已知的实体有吸引或排斥效应。
//最近一次的实验报告如下
//
//类碳布力学性能报告 许可编号No.793256
//实验开始时间：[数据删除]
//实验员：Dr.Berlink
//实验样品：类碳布
//样本编号：EPB.031（已经抽出样本束）
//尺寸数据：11.32cmX9.71cm
//
//强度实验测试
//抽出单条类碳布束，进行压痕法测试，将样本束竖置，水平进行施压，当载荷达到测试上限时，放大至3000倍未发现样本束物理性状改变
//断裂载荷：不小于10000N
//
//冲击实验测试
//使用针状冲头对单条样本进行单次破坏性冲击测试，同时对样本束进行温度观测，实时显示冲击功
//当第一次冲击开始，冲头接触样本时冲头即消失，理论冲击功为168.3J（焦耳），更换冲击头，将理论冲击达到第一次冲击的2倍，5倍，冲头均消失，最大冲击载荷无法确定，测试失败
//最大冲击载荷：[数据删除]
//
//燃点试探性测试
//使用丁烷喷枪预热至1300摄氏度后，在极限温度不高于2000摄氏度情况下对样品进行燃点预测试，未发现样本性状改变，需要进行后期测试。
//燃点：未知，不小于1300摄氏度
//
//Berlink
//
//用途：
//目前对该类物品的探索与实验仍在进行，使用领域尚不明确。由于无法裁剪，只有少数S.A.F2组织成员会将类碳布重新编织并贴附在衣料外层以抵挡瞬间的不明冲击。没有收到其他组织及个人对使用类碳布的反馈。
//
//- 退出前请确保您未与外界网络连接
//未来的尝试：
//软质防穿刺外衬
//与常见防弹衣尺寸相同，使用类碳布贴合粘连进行外层覆盖，以达到保护躯干受到高强度穿刺的目的。目前实体尖锐性攻击对类碳布的的效果未知，需要后期实验。
//
//类碳布实用化计划
//样品：类碳布（大量，需求尺寸较大）、有效粘连剂（待开发）、其他实验用品
//仪器及设备：空气洁净度N1级（或ISO Class1）无菌室、光学显微镜、黏连待用工作台及相关徒手操作设备
//实验步骤（暂定）
//1. 类碳布尺寸挑选
//2.黏连剂的制备与实验（此步骤需完成配比的确定）
//3.软质防穿刺外壳的制作
//4.性能测试（黏连剂的加入需进行新的力学性能测试）
//5.小规模实体接触测试（功能确定及效果反馈收集）
//6.申请销售
//7.客户评价收集
//
//作者信息
//« Object C-101 | Object C-102 | Object C-103 »
//
//Footnotes
//1. 目前普遍猜想是化学交联的加聚反应的产物
//2. 特别行动，由激进的探索狂热分子组成，志在发现和利用后室中的一切新鲜事物
package wupin;
public class leitanbu1102{
}