//Object C-73 - “流浪者发信信标” 简体版
//Object C-73 - “流浪者發信信標” » Object C-73 - “流浪者发信信标” 简体版
//简繁
//
//此文章是为了进行繁简转换页面而建。此文繁体版本最早于2022/07/15发布，你可以藉由右下角的繁简转换按键前往繁体页面投票，由于繁体页面早于简体页面之建立，请至繁体页面投票，避免计分困难。
//物品编号：C-73
//
//位置：部分探勘完全的层群1层级，与C、A、PT、VN、ES、PL等层群内的层级，通常会部署在生存难度二级以上的层级内。
//
//描述：
//流浪者发信信标是自2003年M.E.G.监督者D Donald Claud1开始主导开发的公用流浪者导航发信信标系列的总称呼。其目的是为了让持有电子设备之流浪者快速在层级内导航、得知注意事项。当前在与B.F.P.F.重新合作中，完成了第五代的开发。
//
//第五代的开发重点在于被部属后，如果被移动的话，将自动自毁发信组件，由于第四代时期发生大量信标被恶意移动、内部芯片被重写，被窃取者用以发出错误信息，导致流浪者陷入危机。为避免此种情况，故加上自毁装置。
//
//其外观通常为橙色的盒子，外部绘有M.E.G.标志与警告并连接供电用的电线，通常连接太阳能板或是该层级自有的电力系统。通常外层的壳子为钛合金或不锈钢合金，长50公分、宽20公分，高30公分，并采用与前厅的黑匣子相同的测试2，具体如下：
//
//1.能够承受相当于100G重力之撞击达11秒3
//
//2.必须能承受在至少800°C的火焰中燃烧30分钟
//
//3.深达五公里之水压不损毁
//
//用途：
//该系列无线电装置是为让流浪者得知自身所处层级、层级信息、该位置是否威胁等问题而被设置的。流浪者可以藉由后室的网络系统下载"M.E.G.后室层级信息通知程序"，该程序安装完成后，会主动要求WIFI、流量等通讯权限，以在该设备到达信标辐射范围时，对使用者弹出提示与危险预警。而最大的信号辐射范围可达半径4公里4。
//
//历史：
//当初的开发目的是Aliza希望能够创造在已经完成调查的层级内，部署不断发送该层级文件，与标注危险区域的自动发信装置。该构想由Donald Claud完成了第一个原型机后，被提交到联合会议上。最终联合会议通过该项提案，并由B.N.T.G.出资大部分资金，U.E.C.部署、后室机器人公司、M.E.G.、B.F.P.F.制作。
//
//然而因为第一代开发的时间，大多数流浪者并没有能够接收信号的设备，导致只有M.E.G.联盟5成员的小队会使用。第二代于2005年开始开发并免费发放简易的接受器，广受后室流浪者们的好评。第三代完成于Donald Claud离开MEG加入BFPF前。该时期因为前厅智能型手机开始流行，也开发了MEG后室层级信息通知程序，专用的接收器开始被弃用。
//
//第四代信标因为后室机器人公司的数据安全嫌疑，改由M.E.G.开始自行制造，B.F.P.F.也开始制造自己的信标并部属在层群C中，但两者结构相差不大，且共享信号。不论安装B.F.P.F.还是M.E.G.的通知程序，都能接收到两者的信号与信息。
//
//附录：
//会议时间：2003年5月24号
//
//参加会议者：
//
//B.N.T.G.：Stretchster
//
//M.E.G.：Stretch、Kat、Andrew、Donald Claud
//
//U.E.C.：Diana Stewards
//
//B.F.P.F.：Aliza
//
//纪录开始
//
//Aliza：Donald！快把那东西抬上来！
//
//Stretchster：所以？是赚钱的东西吗？不是能赚钱的东西话，我要离开了。
//
//Diana：这个守财奴……
//
//Stretch：我非常期待你们两人又瞒着我们做什么东西出来。
//
//Andrew：我希望倒不是需要大量材料的事情。光建设阿尔法基地就已经让我们的库存耗光了。
//
//Donald：就是这一个。
//
//Kat：一块……电路板？
//
//Aliza：某种意义上没错。但重要的是它的功能，有了它流浪者们永远不会在后室里面临危险而毫无准备了。
//
//Diana：这里面……发信器组件？记忆芯片？你们该不会是想？
//
//Donald：我大概制作出来非常简单的原型机，它的功用就是不断发送我写在芯片里的数据。
//
//Andrew：原来如此，你们想要是给流浪者们一个在每个层级都有信息源是吗？
//
//Aliza：虽然我想"现在"能够实际用到的人很少，但未来拥有类似装置的人，应该会越来越多。
//
//Stretchster：着眼未来吗？但这些组件可不算便宜？不如说难以取得。我觉得不行，至少不是现在。
//
//Diana：我认为可以试试看，例如在L84设置？
//
//Stretchster：我的想法是，现在设立这种装置毫无意义可言。需要的时间太多、材料太多。这些时间我们能做更多事情。
//
//Diana：Stretchster？！这并不是单纯的所谓材料与时间，是更远大的未来！
//
//Stretch：两位，还请注意。我想在场的每个人都有自己的答案。但我作为这场会议的主席，我想进行一次投票。如果过了，那就进行"一次测试"。在依照测试结果出来后，再决定是否进行"正式的投产"。
//
//Stretchster、Kat、Andrew：同意。
//
//Donald 、Diana、Aliza：无异议。
//
//最终投票结果：两票反对，一票弃权，四票同意。信标进行第一次投产。
package wupin;

public class liulangzhefaxinxinbiao1073 {

}
