//Object 66
//物品编号 - 66
//
//存放位置 - 交易保险库
//
//object_66.jpg
//唯一存留的 Object 66，由 B.N.T.G. 保管。
//
//描述
//利维坦的牙齿原先是一块大小约为 75 x 75 x 15 厘米（29 x 29 x 6 英寸）的硬质黏土板。据报告，该物品于 2003 年 6 月在 Level 105 内的圣餐台上被发现。不过，它似乎早先已经被使用过，因为它的表面在当时已被刻上不少文字，能在其中找到闪语族的各种语言以及一些无法辨认的语言。虽然对该物品取样检验的结果很正常，但它却会表现出一项异常特性。触碰该物品的人会立即知晓它的作用和使用方法，并且对其能力深信不疑。我们不能证实它的作用是否真实，这一认知变化应被视作潜在的精神危害。目前，该物品已损毁至仅剩余一小块，它原有的作用也已经失效，但触摸它的人仍会知晓石板本应具备的能力。
//
//利维坦的牙齿的主要作用是发起传送，使人在后室和前厅间移动。据触摸该物品获得的信息，它的运作方式遵循等价交换。要发动传送，使用者必须在石板上书写自己和另一人的名字，之后，石板就会以一种未知的方式“判定”书写者对另一人的“爱”。如果判定出的“爱”足够，书写者就会离开后室，而“被爱”的一方则会被从前厅送往后室的任一层级。如果判定出的“爱”不足以完成交换，石板就会根据“爱”的程度传送书写者身体的某些部位，而另一人不会受到影响。传送时，书写者的身体不会出现任何伤口，但如果重要脏器或身体结构被传送，书写者仍有可能死亡。
//
//每人都只有一次书写的机会，这正如石板上的铭文：“真名的价值只能被使用一次”。这条规定引发了一个猜想：可以获得多个“真名”以得到多次使用机会，但具体的操作方法至今还未探明。写下昵称或化名都不能启动传送，但不会使人丢失使用机会。此外，使用逝者的名字、使用已经在后室中的人或实体的名字、写出错别字或无法辨认的文字都不能使传送生效。如果使用者改过名，则无论过去还是现在的名字都会有效，都会被看作“真名”。至于已经抛弃了姓名的人和没有一般意义上的名字的人，还不清楚利维坦的牙齿会如何影响他们。
//
//利维坦的牙齿所谓的“爱”的含义现今仍不明确，并未发现各种不同的爱与使用结果的联系——无论是家庭的爱、浪漫的爱还是柏拉图式的爱。石板原先的持有者是一匿名隐居人士，因此在 B.N.T.G. 获得石板前，并没有人分类整理过石板的使用历史。B.N.T.G. 接管该物品后，派人严加保管，只允许重要的成员和客户使用。以下是现存的一些使用记录：
//
//
//书写者姓名	另一人的姓名	结果
//Célestine LeBlanc	Amélie Favreau	未知
//前田真奈美	北村玲	未知1
//Ron Jackson, Jr.	Ron Jackson	右腿消失
//Dimitrius Lautner	Elvis Presley2	失败
//Dimitrius Lautner	Sir James Paul McCartney3	部分声带消失
//Viktor Brunhelm	Sasha Brunhelm	肝脏及十二指肠消失
//Cara Alis	Ava Alis	成功
//Kaya Nkosi	Sekani Nkosi	全身血液消失
//Christoph Richter	Blanche4	失败
//Christoph Richter	Azel 'kyra5	失败
//Christoph Richter	上帝	失败
//Christoph Richter	耶和华	脑、脑干、心脏存留，其余部位消失
//Marc Ballester	Antoni Russo6	身体部位完好，但失去了听觉和视觉
//Angelo Teresi	Rhea Teresi	成功
//[无法辨认]	[无法辨认]	成功7
//
//
//有关利维坦的牙齿的信息泄露后，B.N.T.G. 主动提供了这些记录。他们公开了用于撰写本文的大部分信息，并且高价悬赏有关其他石板碎片的消息。不过，B.N.T.G. 可能还保有一些不愿公开的记录。
//
//作者/授权/翻译
//« Object 65 | Object 66 | Object 67 »
//
//Footnotes
//1. 在 B.N.T.G. 接管前，还有很多使用不同语言的人写下了名字。但因为多数人的使用结果不明确，所以除非发现这些记录的其他作用，暂时不会进行罗列。
//2. 译注：即“猫王”，美国著名摇滚明星。
//3. 译注：“披头士”乐队成员。
//4. 译注：即 Entity 140。
//5. 译注：即 Entity 140 的“别名”。
//6. 译注：一美国导演。
//7. 据几名 B.N.T.G. 成员所说，他们亲眼目睹了这次成功使用事件，但却记不清使用者究竟是谁。这一现象的原因可能是该物品还有其他异常属性，也可能是有某个实体的干预。package wupin;
//
//public class liweitandeyachi66 {
//
//}
package wupin;
public class liweitandeyachi66{
}