//躯器编号：Flesh C-83
//
//代价：小
//
//安装位置：骨骼
//
//生产商：礼仪餐巾由有识血肉学者氏族主导研发并在各有识血肉贸易巢进行批量生产后交由“躯”售卖，因此对产品性能有任何疑问或建议请直接与有识血肉对接。
//
//介绍
//礼仪餐巾是一种专门为人型个体提供的外骨骼防护装置，在尽量不影响美观和日常生活的前提下最大限度实现对使用者脏器和肢体的保护。
//
//其具体结构由以下几部分组成。
//
//动力肌肉组织“布料 ”
//这是礼仪餐巾动力系统，外观为数片连接着“防水层”的肌肉，配套有皮肤和神经血管等组织保证正常使用，和普通肌肉组织不同的是这些肌肉纤维呈星型而不是条状，主体结构较为松软。平时处于收缩状态占据面积较小，但在舒张状态时会快速向周围扩张，由于结构松软可以很快占据巨大面积，从“系绳”开始快速覆盖需防护部位。
//
//缓冲速生肉层“填充物”
//一层更松软的组织和大量无规则结晶、板结金属盐等使用者体内遗留重金属和无法代谢的过量金属盐板结成的带䋈块状物，附着在“布料”和“防水层”之间，起到填充作用。
//外层为金属盐板结，有高硬度但很脆，在礼仪餐巾受到巨大力量撞击后会快速朝周围碎裂以吸收动能。内层是能迅速生长的松软肌肉组织。海绵状构造可以有效吸收力量并防止碎裂的外层碎片刺入皮肤造成伤害。同时由于这一结构会主动吸收使用者体内过量重金属，也可以起到净化血液作用。
//
//表层骨骼装甲“防水层”
//这是礼仪餐巾的主要防护区域，由大量厚重坚硬并经过水煮骨髓技术强化的骨骼装甲板极成。
//装甲分为两部分：正面装甲和侧翼装甲
//正面装甲是数十块坚硬厚重的大型骨骼板，呈弧形利用类似鸡蛋的分解压力构造减少正面冲击。边缘部分有磁性组织和咬合接口，一方面有效提高边缘衔接度，另一方面可增加展开到达正确位置的速度和准确性，在受到伤害后磁性组织分离削去部分冲击力，本身坚硬构造削去部分冲击力，剩余力量则转入“填充物”层直到完全消除为止，收起时磁性组织会快速消磁。“布料”收缩使滑板彼此折叠重合成褶皱状，比起同等性能的金属装甲要轻便得多，收起状态也只占据很少一部分空间。
//侧翼装甲是大量细小鳞片构成的软甲，下方无填充物层。鳞片细小密集，呈菱形对角线排列，在展开后前端直接插入“布料”，后端保持游离。中心处略微向上凸起，边缘粗糙且有倒钩可与邻近鳞片咬合，保证活动能力的同时最大限度提高防御力，骨质鳞片中同样有金属细丝以提高强度，这些装甲主要负责针对正面护甲无法完全顾及的身体侧边和需要活动的关节部位，其边缘有磁性层和附着处用于贴合“系绳”。
//
//收纳甲“系绳”
//这是装载在重要部位的主装甲，在平时作为收纳装置收纳整个礼仪餐巾，战斗实则是防御力量最强的正面装甲之一。经过大量结构优化和金属植入的弧形条状骨骼板已达到6级防弹插板标准1，内壁上有用于保养骨板的活性成骨细胞生产囊和分泌防止肌肉萎缩的“冬眠”异种蛋白的特殊腺体，在非战斗状态下其他部件会统一聚集在这些位置进行保养和补充。
//除了主体细绳外，一个完整的物品还会包括两个在身体侧方的固定点，这些仅是长条状骨骼，用于给展开后侧翼防御的防水层作为攀附抓点。
//
//配件“花纹”
//礼仪餐巾在原有护甲基础上的小型配件，包括但不限于能够产生一定攻击力的小型刀刃和生物液囊泡2，能够保养武器的便携式金属生产囊，作用类似战术背心的小型收纳袋等。
//
//目前该物品分为各部分共同售卖，单个部件只对应部分防护，分别是装在双腿内侧的腿部防御，小臂末端的手臂防御，胸口和脊椎处的前后躯干防御。由于头部的特殊性暂时缺少防御装置，请自行佩戴头盔解决。
//
//说明
//如何使用：
//
//一、 首先需要保证身体表层皮肤洁净，将购买到的礼仪餐巾根据说明书按放在对应位置，确定找到安装位置后将“系绳”两侧尖刺扎入身体作为启动标志。
//
//二、 “系绳”两侧的工具肢在感受到血液后会快速活动起来执行预定命令，将礼仪餐巾两侧尖刺中间的皮肤划开，剥离后接入“系绳”上方平面，这一过程中下方会持续分泌油脂覆盖创口保证不会发生感染问题，同时分泌的油脂也有麻醉作用所以该过程是无痛的3。
//
//三、皮肤移植完成后工具肢会开始沿预定轨道解剖，剥离表层和中层血管及神经将其接入礼仪餐巾以提供感知和营养补给。
//
//四、在以上步骤都结束并确认无误后，工具肢会快速死去脱落，伴随血管中的血液流入逐渐溶解原本存放于礼仪餐巾血管壁表层的神经生长因子，神经节苷酯，能三磷酸腺苷二钠等加速神经生长化学物，同时激活存放于此区域的大量类病毒施工单元。
//
//+ 关于类病毒施工单元的具体信息
//
//最终完成表层神经和深层控制神经的交互，此时您会感觉到身上多出额外肢体，此肢体控制感觉可能近似于手掌，平时是张开的状态，握拳状态就是开启礼仪餐巾。
//五、尝试活动礼仪餐巾进行几次展开和收缩，确定过程自然流畅没有问题则安装完成，现在您可以享受礼仪餐巾为您带来的防御能力和装备挂载能力，但仍然不建议涉足危险尽管确实拥有较为良好的护甲系统。
//
//六、 礼仪餐巾的骨骼还会进一步生长，直到与对应区域的骨骼完全贴合以减轻附着区域肌肉受到的重量，完全停止生长大约需要一个月左右。
//
//注意：
//
//一、 由于礼仪餐巾和无机物文明的战术背心定位类似且防御位置也类似，同时穿着两层对于防御力的提高有限，但是极有可能因散热效率降低导致中暑晕厥。
//
//二、 请适当修正饮食，己确定部分代谢类慢性病人群若是在装载此物品后仍持续摄入会加重病情的食物，有可能导致礼仪餐巾病变生长而降低防护效率，若出现因为错误安装、受到极严重伤害、病变等原因导致装置严重畸形失去防御能力，请及时到有识血肉巢穴进行修理。
//
//三、 礼仪餐巾大部分区域对于枪械的防御能力有限，仅能防御5.56毫米步枪弹的偏斜射击和大部分普通手枪弹的正面射击，且由于填充物和防水层会持续破碎以吸收子弹动能，面对长时间射击或是针对某一固定位置的持续射击时防护能力会显著下降，侧翼防护装甲只能防护小口径手枪射击和冷兵器打击4。
//
//获取
//目前其标准版可通过流浪商人处购买，若是希望购买实验版的探索者可以前往有识血肉城市购买，实验板的价格仅为标准版的1/10且功能更强5。
//
//以上出售的物品都为适合正常人类的标准体型，若您身高超过1米9或是体重超过100公斤，又或者患有严重驼背等会明显影响体型问题的疾病则需要前往有识血肉科研巢或是城市中进行专门定做，定做功能也适用于对护甲外观、颜色、功能等方面有其他要求的客户6。
package wupin;

public class liyichanjin1083 {

}
