//package wupin;
//
//public class longyuzhe1010 {
//
//}
//Object C-10 - “《龙语者》”
//评分: +9+–x
//物品编号：C-10
//
//位置：M.E.G.图书馆
//
//分类：故事模因 – 乙级
//
//O10A.jpg
//《龙语者》其中一本复制品的外貌。
//
//描述：
//《龙语者》是由克莱尔博士以真实事件改编的有关龙族的小说。全文共101101字，讲述了一位年轻人从龙族大陆上苏醒，跟随着一条红龙探索自己前世在龙族大陆上的传奇经历，并再造传奇的故事。
// 
// 
// 
// 
// 
// 
//《龙语者》不代表某一本书籍，而是用文字记载的一段故事。任何印有《龙语者》小说至少三分之二内容的空白本、书籍等纸质载体，都会在印制完成后的24小时内自燃，待冷却以后，转换成同一本样式的书（包括外观、内部排版），且内部的空余部分会自动补齐。在此之后，阅读这本书籍便不会再产生其他异常情况。
// 
// 
//
//O10B.jpg
//正在因转化成《龙语者》而自燃的书。
//
// 
// 
//经过检查，这本书使用不属于任何动物的皮革作为外皮，内部使用不会损坏的羊皮纸和不褪色的碳素墨水编撰而成。不会被涂改、撕破，不会因为浸水而潮湿，在700摄氏度的高温下依然能保持原状。唯一能毁坏它的办法目前只有使用液氮将其迅速冷冻，并用液压机在其未解冻之前将其压毁。在其自燃途中用任何方式提前熄灭火焰都将导致熄灭后只剩一堆残渣。
// 
// 
// 
//
//附录：
//我是克莱尔博士！很高兴能有人来为我的小说专门写一篇档案！其实这个小说嘛……我也不知道为什么会变成这样。不过我向你保证，《龙语者》绝对绝对是我自己原创的剧情！没有抄袭！就是这个剧情吧，说实话，可能参考的真实事件有点“多”了，哈哈，所以那群龙就真的“顺着网线”找上门了，谁也说不准呢是吧？
//
//不过不过，这本小说是真的好看！可能是我有史以来写过最让我满意的小说了！如果你有时间一定要去看看！
//
//实验记录：
//在一本A4打印纸上打印7500字《龙语者》小说内容 - 其在14小时23分钟后自燃并变为Object C-10的复制品。
//在一本《莎士比亚歌剧精选》上打印9000字《龙语者》小说内容 - 其在2小时11分钟后自燃并变为Object C-10的复制品。
//在一本纯黑的书上打印10000字《龙语者》小说内容 - 其在23小时58分钟后自燃并变为Object C-10的复制品。
//在一本漫画上打印8200字《龙语者》小说内容，然后将这些漫画的书页分散到相隔500米远的位置 - 所有书页在34分钟后自燃，其中一张纸在冷却后变为Object C-10的复制品。
//在一本词典上打印6000字《龙语者》小说内容- 无变化。
//在一叠纸上用笔写下4500字《龙语者》小说内容 - 无变化。
//在一个电子平板上记录101101字《龙语者》小说内容 - 无变化。
package wupin;
public class longyuzhe1010{
}