//Object C-74 - “龙坠草”
//评分: +19+–x
//物品编号：C-74
//
//位置：Level C-372
//
//龙坠草是一种仅生长在Level C-372的草本植物，外形与前厅的薄荷相似，它的出现与前龙血族成员森有着某种联系。
//
//描述
//peppermint-2368677_1280.jpg
//由“太阳之子”成员种植的龙坠草
//
//龙坠草拥有与薄荷相似的外观，散发着一种特殊的芳香气息，被描述为“薄荷的清爽与迎春花的香甜交织成为一体的味道，令人心情愉悦”。这种气味来源于一种首次被发现的活性化合物，它被M.E.G.的研究人员称为“龙坠草素”。事实上，龙坠草素对人体有着微弱的成瘾性，长时间吸入高浓度的龙坠草素会像吸食毒品那样上瘾。幸运的是，只要使用杏仁水进行稀释，这种成瘾性便可以降低至忽略不计而香味不减。
//
//龙坠草最初被发现于Level C-372中，当地的原住民“太阳之子”是最早一批种植龙坠草的人。他们采摘成熟的龙坠草，放置在炙热的阳光下晒干并磨成粉末状，作为香料使用。这种“龙坠香”在当地颇受欢迎，然而，他们似乎并不会因此而产生上瘾的症状。
//
//生物学特征
//龙坠草属于草本植物，平均寿命为1年，在10个月左右达到成熟期。龙坠草拥有与前厅的薄荷类似的外观。茎部直立，长30～50厘米，比薄荷稍矮。叶片呈椭圆形而边缘带有牙齿状的锯齿，幼年时期为嫩绿色，成熟期则转变为亮绿色，老年时期则会因类胡萝卜素大量沉积而呈现出褐黄色。
//
//栽培特点
//龙坠草适应能力强，但更喜阳光充足、空气潮湿的层级——典型的如龙坠草的原产地Level C-372、Level C-194的农业区和Level 10。
//
//如果一直使用杏仁水浇灌幼年期的龙坠草，它将在5～6个月大时很快达到成熟期：成熟期的龙坠草含有的龙坠草素最为丰富，香气也最为浓烈，是采集龙坠草的最佳时刻。实体的尸体对龙坠草来说是最好的肥料，佐以少量的腐烂有机物可以使龙坠草的产量更高。
//
//
//
//perfume-2887560_1280.jpg
//以“龙坠香”为原料制作的香水
//
//龙坠草生命力顽强，有着易存活、种植成本低、加工简便等优点。目前，M.E.G.和B.N.T.G.都已经开始了培育龙坠草的实验。以龙坠香为原料的香水和空气清新剂也启动了生产和发售，目前销量可观。
//
//龙坠草贸易促进了M.E.G.与“太阳之子”的合作与沟通，也为两方带来了财富。
package wupin;

public class longzhuicao1074 {

}
