//package wupin;
//
//public class luozhouwandewenjiangui1124 {
//
//}
//Object C-124 - “落舟湾的文件柜”
//评分: +18+–x
//物品编号：Object C-124
//
//描述
//Object C-124，即落舟湾的文件柜，是一种和层级沟通，以此获得一个位于该层级内、可远程存取的储物空间的仪式。出于发明方资料库#000000要求，也为了防止该仪式被用于某些不当用途，本文档不对其细节做详细描述。
//
//仪式内容
//开始之前
//1.至少需要以下几个物品：
//
//一个完整的，对应你想要建立储物空间的层级的层级密钥。
//至少50毫升原液。
//足量糖晶锭，取决于目标层级的大小。在一个大到被认为是“无限”的层级中完成仪式至少需要200克糖晶锭。
//从目标层级中获取的物质，体积应不小于以上数项的体积之和。
//一个足够大的玻璃容器，用于在仪式中盛装以上物品。
//2.以下是能够辅助仪式进行的物品：
//
//如果你确认这个层级有意识，准备对方喜欢的任何物品都有帮助。
//从枢纽的对应门上自然脱落的物质。如果它是你自行刮取的，这将会起到反效果。
//一张用木炭粉描绘特定符号的纸。若方式正确，这张纸会在展开并受热后自行震动。
//引起注意
//1.将磨碎的糖晶锭与原液在玻璃容器中均匀混合。
//2.顺时针搅拌混合物，边搅拌边加入准备好的层级内物质，直到恰好搅拌60圈。
//3.逆时针搅拌至混合物略微发烫。
//4.向混合物中加入层级密钥。如果你准备了辅助物品，则将其放在容器附近。
//5.等待，直到你感觉自己被注视。
//
//正式沟通
//1.若之前的步骤完全顺利，你应当已经引起了层级的注意。
//2.尝试说话。你会发现自己无法正常说出任何一种语言。相反，你的整个身体都会发出巨大的声音，类似Level 0中的荧光灯噪音。
//3.保持冷静，尽量清晰地表述你对储物空间的要求，包括大小、形状、环境和具体位置。层级的应答将直接注入你的思维。
//4.当你开始感觉头晕目眩时，闭上双眼。
//
//影响
//如果你成功完成了这个仪式，你将在仪式结束时昏迷。再度醒来时，所有仪式用品都会消失，仅在体表留下一个符号。该符号与枢纽对应门上的符号完全相同。此后，你可以像使用一些口袋那样使用这个有限的空间。
//
//但是，失败的仪式常常引发恶性事件。如果你没有引发层级注意，那么这个层级将不再于该仪式中回应你。沟通失败的常见后果则包括施术者当场死亡，陷入疯狂，或身体部分转变成原液。更罕见的意外事件是施术者看似正常而清醒，但逐渐表现出反社会倾向，并尝试在某些层级中发动无差别袭击。
//
//相关事项
//以下是提高仪式成功率的因素。
//
//在无人打扰的时刻进行仪式。
//层级相对安全。
//层级具有稳定环境、自身为线性空间且真实面积较大。
//层级本身的层级意识主动配合。
//提出适度的储物空间要求。
//在正式沟通时，额外交待自己的合理目的。
//发现
//Object C-124由资料库#000000的某位成员1发明，并广泛被该组织成员使用。其原始目的为在Level C-524创造一种可以远程存取的文件柜空间，因此被命名为落舟湾的文件柜。
//
//作者信息
//« Object C-123 | Object C-124| Object C-125 »
//
//Footnotes
//1. 有迹象表明，这名成员很可能就是“落舟湾”。
package wupin;
public class luozhouwandewenjiangui1124{
}