//Object 65 - “麦迪逊大道的人体模型”
//2a57acb2bb285940547e6248638be681.md.jpg
//麦迪逊大道的人体模型，透过守护者商店的橱窗被拍摄。
//
//麦迪逊大道的人体模型是一具在Level 11被发现的人体模型，它能在一间被标记为“守护者”的商店内的橱窗里被人找到。
//
//描述：
//麦迪逊大道的人体模型是一具外观破旧的人体模型，它由塑料材质被制造，拥有着古铜色的皮肤和仿真类型的脸部风格。模型穿着一件破烂的西服，西服的表面覆盖着钙与硅质的金属垢，呈现出似乎是在水下浸泡许久的模样。
//
//当有流浪者目击到人体模型时会产生轻微的幻觉。看到它的流浪者们描述说，人体模型的身影会一直在他们的视野中挥之不去，这种影响会持续几天到若干年。流浪者们在这段时间里受到的精神影响被认为是负面的，不知道这种影响是出自该物品的异常性质，还是只是一种对幻觉的自然反应。
//
//补充文件：
//霍华德·邓恩的日记：
//人体模型的异常影响于2020年12月5日、被一位隶属于M.E.G.Beta基地的居民霍华德·邓恩发现。邓恩日记的部分摘录已记录如下，为保证简洁，我们已把日记中多余的部分删除。
//
//20/12/5
//
//我觉得后室终于影响到我了，说实话，我还挺惊讶我能在真的被影响之前撑这么久的，但我想还是跑得了和尚跑不了庙吧。简而言之，我在探索Level 11的街道时看到了这个诡异的人体模型，而现在，我能一直在眼角的余光里看到它的身影就好像它在盯着我一样不过我很确定，只要喝上点儿杏仁水再睡个好觉，这玩意就能走开了，不过这件事儿总体来说依然还是挺吓人的。
//
//20/12/6
//
//他还在这里。 我醒来的时候还能在房间里看到它，我一直试着告诉我自己那不是真的，但我知道它发生了——当我真的想要直视他它时，它就那样消失了，这真的把我吓坏了，天哪，我希望这能快点结束。
//
//20/12/13
//经过这几天的苦思，我想明白一件事，一个人能遭遇的最可怕的事情就是陷入疯狂，这就像是在挤压着你每一点残留的理智一样，感觉真是太坏了。我你都无法确定什么是真的，或者谁是真的，最糟的部分是你没办法让它停下，不管你做再多努力也是如此。我已经经历过这样的情况了，（谢天谢地）它没有发生在我身边重要的人身上。我喝光了所有我能喝掉的杏仁水，但我依然害怕着，害怕过不了多久，我就会变成被恐惧驱使的野兽，甚至更糟。这是最坏的想法了，我相信我应该不会沦落到那种地步的。
//
//20/12/18
//我没办法再集中注意力了，他一直在窥视着我，这感觉就像我的大脑被烈火燃烧一样，而那片熊熊燃烧的火焰里唯一清晰的影像就是他。我感觉每况愈下，我真的受不了了，天呐，我只想逃走，我今早就要离开了，请不要试着去找我，真的很抱歉。
//
//20/12/19
//他离开了。我不敢相信我终于恢复正常了，说实话我昨天都不知道我的脑子里在想什么，我想我可能断片了，我逃到了毁灭之地，准备躺下休息一会，当时的一切都有些模糊不清，我觉得我当时好像看到了什么，长得和龙一样的生物正在朝我走来，但我却没有为它让路，我感觉这家伙应该要杀死我了。当我看到火焰从它的口腔溢出，正要将我吞没之时，我的心里忽地浮现出一种感觉，我清醒过来，走出了之前所困的阴霾，不过我觉得，我振作过来得时机有些太晚了。但转机出现了，人体模型突然出现，挡在了我与巨龙中间，它是，真的出现了，而不是之前围绕我的诡异幻觉，我能确定它是真的，因为它在那时以某种方式吸收了巨龙吐出的火焰，给予了我足够的时间逃跑。老实说，我真的不是很确定到底发生了什么，甚至不知道这一切是不是真的，但我的确感觉好多了。
//
//现在我能够清晰思考啦，我很确定是那个Level 11的人体模型导致了我这几天的处境，我知道你会在后室里因为一些异常发疯，但我却不知道，它能对人产生如此大的打击，不论以后有什么契机，我也不会再冒任何险了，我明天就离开Beta基地，说实话，我都不确定我会不会再回到这个层级，我在这经历的已经够多了。我相信我能在玫瑰沙漠获得更多的帮助，他们说不定也需要帮手呢。我准备把这些纸页交给M.E.G.，希望他们能把这个人体模型摧毁，我不想再让任何人经历那种糟糕的狗屎情况了。其实我也不是很在意他们到底会怎么处理它，只要别让我再看到那个人东西就行了。
//
//物体衣服口袋内的一张纸条：
//亲爱的迈克尔，
//你是我的北极星，我唯一的挚爱，那在无人回应之时，伴我身旁的你。我知道对你来说，放下很难，但我希望你在我走后，另寻一位爱人，我真的很希望你能用你的光芒，去再点亮他人的生活，我不知道在离开你后我将身处何方，但尽管我将不在于世，你也依然是我永远的守护天使。
//深爱你的，
//雅各布package wupin;
//
//public class maidixundadaoderentimoxing65 {
//
//}
package wupin;
public class maidixundadaoderentimoxing65{
}