//package wupin;
//
//public class moniemoxuniehuishuoyi1112 {
//
//}
//PLS-IV-112 - “谟涅摩叙涅回溯仪”
//评分: +22+–x
//统合物品分类系统
//物品编号 #：PLS-IV-112
//位置：帕拉斯科研前哨
//安全性：安全，无害
//用途：
//回溯重要信息
//状态：
//小规模生产，可回收
//物品编号：PLS-IV-112
//位置：帕拉斯研究所和部分科研前哨
//描述：
//谟涅摩叙涅回溯仪是一种拥有回溯有机生命体一段时间内记忆能力的中型设备，长4.58米，宽2.12米，高2.54米。本品的外接端口包含：2个可调节实体回溯模块，2个液体基组织接收器，1个组织回溯缸；输出端口则为一套多维感官示效屏幕。
//
//6351edf116f2c2beb17b3edb.jpg
//谟涅摩叙涅回溯仪的局部外观。
//
//值得注意的是为了完整地且对对象尽可能不造成伤害地复制提取记忆，谟涅摩叙涅回溯仪使用了非传统的工作原理，用量子探针对活体对象进行记忆的回溯和整理，最终经解码生成了多维可感的记忆文档（.myf型文件)。美中不足之处在于一旦一个生命体已被谟涅摩叙涅回溯仪进行回溯提取，那么固定的读取回路将会形成，之后无论多少次提取到的回溯记忆都与第一次随机回溯到的记忆片段相同，这让研究所无法对记忆片段进行穷举拼接得到完整的所有记忆片段，也无从形成一个强大的记忆组文库。
//
//通过启用谟涅摩叙涅回溯仪，可以做到两种形式的记忆回溯，其一为回溯人类或实体最近2个小时的记忆，其二为随机自回溯对象从现时计一个月以前的长期记忆中获取一段长度约为1.5~4h的记忆片段。借由此手段谟涅摩叙涅回溯仪能够获取到两种宝贵的乃至是独家的信息和知识：从其他人员身上得到活动细节甚至是机密信息，从而在信息上占据巨大优势；从其余实体身上回溯其生活细节的记忆，这样研究所可以更加便利地研究实体行为，为流浪者提供更为详尽有效的提示，而得到实体行为的珍贵数据对研究所其他产品的开发也大有裨益。
//
//为了了解谟涅摩叙涅回溯仪的具体性能，帕拉斯研究所首先进行了多次实体实验，研究所在此阶段与其他组织进行了多次合作，共享了实体记忆片段的研究成果。
//
//- 收起记录
//实验记录-α-001
//实验日期：2021年3月21日
//实验对象：两个已转化为悲尸的B.A.G.前救援队员大脑
//实验目的：据B.A.G.所述二人在穿行Level 266时遭到了U.E.C.游击队员的袭击而转化为悲尸，他们收集的重要音频日志失踪，此实验意在复原记录时段所发生事件的内容。
//复原用时：4h
//实验结果：回溯仪屏幕显示的是二人在等待出发命令时的闲聊画面，被认定与任务内容无关，相关视频已移交B.A.G.。
//实验结论：回溯仪的原型机显然还有极大的改进空间，但目前的回溯仪原型机只能凭借收集到的脑组织耗费较长时间进行随机回溯，结果只能获取到一小段价值参差不齐的记忆片段。
//
//- 收起记录
//实验记录-β-001
//实验日期：2021年4月30日
//实验对象：一个在Level 11内游荡的孤单老年无面灵
//实验目的：测试配备了实体回溯模块的回溯器是否能回溯后室内原生非转化实体的记忆。
//复原用时：2h48min
//实验结果：
//视频记录vid-2021430114523o：
//[记录开始]
//
//画面渐渐亮起，视野内出现了一个娇小的幼年无面灵，它正在拾取地上的杏仁水和幸运豆奶的空瓶，将它们堆成塔状，又推倒它们，据推测是其娱乐活动一种。
//
//老年无面灵的视角开始晃动，从画面抖动可以推测这个老年无面灵个体正蹒跚费劲地走向幼年无面灵，他向那个幼年无面灵招手，似乎是在招唤她。
//
//幼年无面灵对着他摇了摇头，表示拒绝。老年无面灵轻轻跺脚，可能有些许不满。
//
//幼年无面灵顺势推倒了一座小型的金字塔状瓶堆。
//
//老年无面灵双手叉腰，抬头望向窗外，来回焦虑地踱步，据推测是察觉到了危险。
//
//约15min后，画面的响度明显增加，两个不明武装人员从画面暗处出现，后经识别为U.E.C.刃岭游击队队员。
//
//队员α：“博士的实验还差最后一个无面灵，这次成功后我们就可以进一步开展人体实验了。”
//
//队员β：“我们还能再携带最后一个实体对象，抓老的还是抓小的。”
//
//队员α：“抓小的，它对记忆汁相对更敏感。”
//
//队员β：“苍鹰明白。”
//
//两位队员消失在画面中，随后画面外突然传来一声尖叫，画面剧烈晃动。幼年无面灵倒地，确定尚有意识。
//
//幼年无面灵在数秒后开始极力挣扎，但没有效果，最后放慢了挣扎速度。
//
//老年无面灵试图起身冲向两位队员，但被枪托击倒。
//
//老年无面灵瘫坐在地，想要再次起身追赶，殿后的队员再次用枪托猛击了他。
//
//老年无面灵昏厥。画面中断。
//
//队员α：赛列妮基地，这里是雪崩，目标已捕获，正在返回基地。
//
//队员β：本着我们的宗旨，不应该消灭所有见到的实体么。
//
//队员α：一个老头子没什么威胁，我们不能再耽搁了，况且会有碍事鬼察觉到我们行动的。
//
//队员β：我们走。
//
//二人离开，有另一个脚步声接近，记录自此中断。
//
//[记录终止]
//
//
//实验结果：成功获取了活体实体的记忆片段，此外我们在继续走访Level 11时有流浪者主动展示了一张据称是由实验对象写就的笔记，大致内容如下：
//为了躲避那帮自诩为了人类消灭实体的混账，我东躲西藏不知辗转了多少个层级定居在了这里，他们简直是人面兽心。先前我的儿子已经被他们残忍杀害了，之后我和孙女在此安居，逐渐释怀之时，这些混账又找上门来，掳走了不少我的同类去做所谓实验，我年事已高，竟又不得不亲眼目睹自己的孙女被抓去做惨无人道的“实验”。现在换个说法，究竟是无面的我们更加残酷邪恶，还是这些披着人皮笑里藏刀的家伙的罪行更加罄竹难书呢？总之谢谢你救了我，年轻人。——2014年5月27日
//
//
//实验结论：试验机β被证明是较为成功的改进型，同时我们也初步明白了为何老年无面灵会有着强烈触摸年轻流浪者的倾向，或许是睹此思彼的效应，但该无面灵仅为个例，尚不明确是否所有老年无面灵都经历过丧亲之痛。
//- 收起记录
//实验记录-ε-001
//实验日期：2021年10月27日
//实验对象：B.A.G.小队队长，代号：γ
//实验目的：一支B.A.G.救援小队在深入Level C-229营救研究所重要目标时任务失败，但目标交给了队长一份重要的技术资料并告知其解密方式，在从秘密出口撤离此层级时遭到袭击，小队成功撤出至研究所驻守的研究站点，但感知不到撤出前4h内的记忆，因此研究所将使用正式机型ε获取记忆片段。
//复原用时：2h12min
//实验结果：幸运的是，撤出后浪费的时间并不多，研究助理快速固定并回溯了队长的记忆，最终成功完成委托，取得重要技术资料。
//实验结论：自此回溯仪的基本功能已经齐备，并具备了理论上回溯最近2h内记忆的拓展功能，可以小批量投入使用，目前研究所尚未有将其推广的打算。
//
//附录
//收起档案
//实体回溯模块简明原理：
//在较不稳定的层级内，生物储存长期记忆的海马体内的量子行为本应如外部环境一样发生无规律的量子涨落，但长期观察发现在海马体内活跃的量子可以凭借一种特定的程式进行正交和线性自律组合，长期脱离叠加态。这种特定的程式因层级而异，但通常来说都能在较短周期内被破解并应用于谟涅摩叙涅回溯器中。
//
//液体基组织接收器简明原理：
//基于对大量实体的研究，帕拉斯研究所发现在有机生命体生成长期记忆时所产生的突触在物质水平上可以留下有关“痕迹”，而这些痕迹起源于记忆储存之初，其可靠性和真实性甚至比输出体本体更高。这些痕迹通过两味夸克进行排列存储，被放置于一个细胞内全新的超显微结构1内，编码方式为二进制，夸克的味不同时，其存储性能亦存在差异。使用此类夸克回溯技术我们可以回避极其复杂且误差更大的蛋白质解码过程，并大大缩短解码时间。理论上这些夸克链串可以算作一种物质，但与任何已知的其他基本粒子的性质完全不同。以下是已进行的实验取得的大致数据和评估结果：（夸克种类：u、d、s、c、b、t2）
//夸克味	存储性能3	出现频率4（均值）
//u、d	1	12%
//u、s	5	4%
//u、c	4	6%
//u、b	3	7%
//u、t	2	2%
//d、s	1	7%
//d、c	4	10%
//d、b	5	4%
//d、t	2	2%
//s、c	1	6%
//s、b	3	9%
//s、t	5	8%
//c、b	1	5%
//c、t	4	15%
//b、t	1	3%
//注意：列表左侧夸克味为0，右侧为1，并不会发生倒置。
//
//
//撕毁家书
//
//亲爱的爸爸：
//许久不见，不知不觉，自最终型号ε开始研发，我就再也无暇顾及您的健康，我自己的私生活也是一地鸡毛，不知道您看到孩子这样会不会指着我的鼻子斥责我没有点严谨学术人的样子。在回溯仪项目伊始，我便发现您的记忆开始有了些许的差错，但我没意识到它在后室这里会发展得如此之快。孩子记得您在我儿时便和我讲过“大脑的渐冻症”，我现在终于领会到这种慢性又残酷的遗忘是多么令人绝望。我从此开始立志要研发一种能击败这种病魔的药物，怎奈事与愿违，我没有生物制剂的研究天赋，我走上了另一条道路：回溯那些您说的“吉光片羽”。孩子成功了！但您却永远忘记我了……或许也永远没忘记，虽然我们无法再一起创造新的回忆，但一起品味过去也别有风味。事与愿违，您坚强自立的人格让您意识到了与其在遗忘的折磨中“被空气活埋”，不如壮烈地在自己最爱的地方离开，最后，您去了蓝色沙漠，那里的流星最美，您是在那里和大家永别的……谢谢您，父亲，您给我最好的礼物，是您人格传授我的一课又一课，希望其他平行世界里也会有您求真为人的身影。
//
//
//○显示注释◎隐藏注释
//脚注
//1. 我们无法得知这种超显微结构是否是后室人类及其他实体所独有的。
//2. 分别代表上、下、奇、桀、底、顶。
//3. 我们使用了降序数字标识标记其稳定性，最高为1，最低为5。
//4. 出现频率似乎与夸克的味没有直接联系。
package wupin;
public class moniemoxuniehuishuoyi1112{
}