//Object 87 - “磨损的布袋”
//Knappysacky
//一个由可可制作的磨损的布袋
//
//磨损的布袋是一种罕见的大容量储物工具。
//
//描述：
//一件磨损的布袋可以用 便携式真空清洁机（下文称为MVCs）的残骸收集器部分制成。 为了制作一个磨损的布袋，你必须首先拥有一个已经使用到了“磨损状态”的包。“磨损的状态”往往指一个包被用到和其刚制成时的状态看起来不一样的时候所处的状态。磨损的状态往往需要达成以下条件：
//
//褪色
//多处划痕
//被缝补好，或打了补丁的裂口
//污渍
//尽管背包必须处于磨损的状态，但包的磨损状况似乎是有下限的。以下情况可视为“磨损过度”。
//
//灼烧的痕迹
//不可修复的撕裂口
//许多穿孔
//腰果水留下的污渍
//当你有了一个符合条件的包后，你必须之后找到一个被MVCs用来收集残骸的容器。若想找到它，只需放下一个MVC，之后进行拆解，便可以得到该部件了。制作磨损的布袋有非常复杂的制作工序，已知有多个团体知晓如何制作磨损的布袋，但对制作工序保密，且据知在执意尝试去学习制作工序时他们会诉诸暴力。
//
//磨损的布袋在后室里是广受好评的一种容器，这是由于磨损的布袋内拥有很大的储存空间。磨损的布袋内部的存储空间大概在700立方米左右，且重量会一直保持在0.5磅，不论在包里存了多少东西。磨损的布袋已知在制作时有用到特殊的冷热对流，使得其可以以呼吸相当的频率来进行空气流通。因此，你可以在缺氧之前在磨损的布袋里呆上约莫一小时。磨损的布袋内部的墙面和地面的材质和磨损的布袋自身的材质一样。这意味着如果一个磨损的布袋是由织布做成的，那么整个磨损的布袋的内部也是由布制成的。要从里面出去时，只需要在脑海中想象一个出口，然后离开即可。你会出现在你之前放下磨损的布袋的地点的旁边，且磨损的布袋正背在你的肩上。
//
//已知可以制作磨损的布袋的团体：
//神秘客（The Occult）：
//这个团体是一个非常神秘的团体，他们被证实曾经是不结盟贸易集团的一部分。他们保守着很多的机密，且他们似乎没有任何形式的基地。他们可以在相对来说较为安全的层级中被发现，且他们有武器来保护自己。通常可以依据手上形如一把斧子和一颗心的标志来辨别出他们的成员。因为这个印记的缘故，他们时常被看到戴着管家所戴的那种类型的白手套。如果被识破，他们会保持克制，除非被激怒。如果他们遇见了一单不错的交易，他们会愿意用磨损的布袋来进行交换。他们开出的价钱往往较低，大多情况下他们要换的只是基本的生存物资，像食物和水。
//
//失落一族 (The Lost)：
//失落一族的许多成员有制作磨损的布袋的能力。但是他们不接受贸易，这意味着从这个团体里得到磨损的布袋是十分困难的。如果你设法取得了其中一位懂得如何制作磨损的布袋的该团体成员的信任，他们说不定就愿意给你一个了。还有另一种远远更冒险的方法：如果你对他们进行威胁，有一些失落一族的成员会甘愿给你制作一个磨损的布袋。但是， 你没有办法威胁他们向你展示如何制作磨损的布袋，这样的做法被证明是收效甚微的。
//
//已知可以制作磨损的布袋的个人
//月球人伊拉万（Iravan, the moonman）
//这位老兄可以在任何与亚洲文化有关的层级里，或者在夜晚时被遇见，且对人友好。然而，他可能会在被激怒后怀有敌意，且似乎擅长于多种格斗技法。他愿意制作磨损的布袋，且很少向你索要费用。
//
//赛芙丽丝（Siphylis）1
//一位很老的老太太。她在Level 98通过织东西来消磨时间。如果你拿着制作磨损的布袋所需的原材料来找到她，她就会邀请你坐下。在向你说了些像是天气如何这样的简短话题后，她会开始随兴唱一首催眠曲。在你不可避免的进入梦乡后，再醒来时会发现你已获得了一个磨损的布袋和一把小折刀。赛芙丽丝会在另一个摊位坐下，又开始编织起东西来。她似乎懂得很少，然而她似乎和厨房有关联。
//
//莫蒂默（Mortimer）
//我们对莫蒂默其人、他的行为动机抑或是他的来历都知之甚少。他有时可以在任意一个Level 4的房间里被碰见。他也有时可以在反现实保龄球厅里被找到。由于从来没人看见他从Level 4或者是Level 178前往此处，因此他是怎么到这的现在还是一个未解之谜。如果你可以解决一些他随机给出的问题的话，他还是乐意去给你做一个磨损的布袋的。他问的通常是关于沃洛诺伊图（Voronoi Diagram）的问题。如果你没有办法给出答案，他会简单的回一句：“也许下一次吧。”在说完这句话后，你会昏迷3小时，并在同一地点醒来。如果成功解决了他提出的问题，你还是会昏迷3小时，但是，你会带着磨损的布袋，在Level 6.1醒来。
//
//"巫师"（"A Wizard"）
//一位来历不明的人。有些时候以男性面貌出现，有一些时候则是以女性的面貌。有少数时候会是雌雄同体。他的年龄看上去是在六到八岁，但是，估算其年龄为56岁。他最常在Level 178.1里面被找到，但也可能在几乎任何适合人类的层级里面找到。一次罕见的目击表明他有能力进入隐秘层级，比如说享乐层=）， 死亡层，甚至 Level i。当你要求他做一个磨损的布袋时，他会用其他人所需的70%的时间就做好一个。当他不想做的时候，他会简单地表明现在自己还没有做好准备。当他们要走的时候，你的眼睛会突然眨一下，不论你多努力的尝试让你的眼睛保持睁开。如果你没有眼皮的话，你会看到一会儿的静态画面。当你睁开眼睛时，一个磨损的布袋会在你前方出现。
//
//可可（Coco）
//一只雌性德国牧羊犬，可在Level 241里面找到她，尽管她生活在可可的卧室里。无论什么时候带着制作磨损的布袋的所需材料来找她，她都会恳求你把材料给她。如果你给了她，她就会把它们都捡起来并走出你的视野。如果你试着跟着她，她会开始奔跑，然后逐渐加速，直到消失在你的视野里。一旦离开了你的视野，她就会消失不见，然后在26小时候带着一个磨损的布袋走回来。如果你处在一个没有门且有监控摄像的房间里，那么摄像机会有信号被切断，随后她会出现在你后面。
//
//超棒男孩扎连（Zarien the Awesome Kid）
//一个约莫17岁的男孩，只在人们叫他”超棒男孩扎连”的时候回应人们。如果你给他所需的材料和食物时，或者在他害怕你情况下，他就会给你做一份磨损的布袋。建议你给予他相关的原材料，除非你没法给他。它通常可以在枢纽中被找到，但有时他会去level 4。他宣称他自己有能力回到前厅，是一个“可以扭曲现实的神童”。对此宣称展开调查是不可能的，但是相关测谎专家已经确证他在说谎。
//
//无人（No-one）
//这里没有人。他不会给你做磨损的布袋。磨损的布袋会直接在你前方凭空出现。你对不存在的神秘事物谈不上一无所知2。
//
//多变人米利安（Milian the Multiman）
//米利安是一位似乎毫不在乎他人对其的看法的人。他一般可在Level 6.1被碰到，尽管有些时候他也会去Level 11。当遇见他时，他会漫谈他感兴趣的随机话题，且他遣词造句以非常直言不讳的特点而广为人知。他会主动地对他人说人身攻击的话，的确也惹到过许多人。然而，他十分擅长格斗，且在有必要时可以轻而易举地让任何对手丧失作战能力。当有些话直接向他说出来时，他会进入一种“激活状态“。这类话中有一句是当着他的面说 “磨损的布袋”。当说出这句话的时候，所有在他附近的人都会立马陷入昏迷正好1小时，他视线内的人同样也会受此影响。当且仅当相关材料准备齐全时，几乎一瞬间的功夫，米利安就会做好一个磨损的布袋。之后米利安会消失，然后再出现在同一层级的一个任意位置。这是少数几个少数几个可以直接用MVC做出磨损的布袋，而不是用其拆下的一部分来制作的方法。
//
//马克（marker）
//马克总是在Level 2.2里等候着人们光临，常常离蜂巢较远。他似乎和蜜蜂王国有友好协议，且知道如何躲避幻影蜂。当被要求制作一个磨损的布袋时，他会直接回答：“要有女皇陛下的垂恩才行。”如果你在此之后成功得到了任何一个蜂后的足够信任，那么蜂后会准许你拥有一个磨损的布袋。在此之后，马克似乎已经知晓了你与蜂后的互动，并将会给你做一个磨损的布袋。
//
//纤条（Willow Wisp）
//纤条是一种未知的实体，尽管看起来像是幽灵。柳条可在Level 6中游荡，这也就使找到他们是十分困难的一件事。它们倾向于被新来的人所吸引，且会主动的去找到他们。杏仁水对它们无效，他们无法被任何形式的攻击所伤害。他们没有敌意，且会在你材料齐全时给你做一个磨损的布袋，在此之后，它们会短暂的实体化片刻，推搡你一下，让你进入Level6.1。
//
//月球小子（Moon Dude）
//别和月球人伊拉万搞混了，这个人名字未知，会对任何对他的声音和触碰提示（cue）做出相应。他可以在Level 24的核心里面被找到，他被常常发现正在从月球表面中扯出塑料。当你要他做一个磨损的布袋时，他会向你索要原材料，然后把它们埋在塑料里。他会之后走开。待到再一次挖开塑料时，一个磨损的布袋会在坑里被找到。他出现的概率很小，而且一次只能被一个人看见。任何尝试惹他的人都消失了，不知道为什么。
//
//Level 57的艺术家（The Artist of Level 57）
//由于未知的原因，这个艺术家有能力画出来一个磨损的布袋，但她只能在你给她所有制作所需的原材料的时候才能画出来。一旦画被画好挂起来后，你可以切入/切出画作，随后你会再次出现在Level 57的入口，背着一个磨损的布袋。
//
//派对客=）
//我们可以给你做一个超棒的磨损的布袋=）。过来享乐层=）来找我们就行哦=)
//
//M.E.G.报告日志
//是的，的确可以在享乐层=）找到磨损的布袋，它们在地上放着，没有被使用的痕迹。但更重要的是，去享乐层无异于自寻死路。别相信这则消息。
//
//莫干那委员会（The Morgana Council）
//当你拜访Level 777，且得到了任何一个委员会成员的信任后，他们就似乎有能力给你做一个磨损的布袋。能够制作此包的能力伴随着可以把此层级弯折、或总的来说，创生给他们带来好处的事物的力量。如果你有足够的原材料，赌注会比较廉价，通常是赌要么得到一个磨损的布袋，要么一个疯子的躯体。然而若你没有原材料的话，赌注会急剧增高。大多情况下赌注会是你最宝贵的记忆。然而，他们也接受以其他的东西作押，像是你的双腿。如果你赢了，一个磨损的布袋会在你的面前实体化，且之后会把它给你。有一些特定的赌场也有能力制作磨损的布袋，但是委员会成员们似乎在提供所需原材料方面最可靠。如果可以的话，（交易到原材料后）换一家赌场，委员会成员们不会阻拦你。
//
//八合的狗
//八合可以在Level 7被找到，更通常的情况下，是在卡利马里厅。八合的狗似乎有能力制作一个磨损的布袋，但仅在八合允许他这么做时进行制作。要想得到八合的许可，仅需一直赞美她，直到她开始喜欢你为止。之后她会让她的狗为你制作。她的狗会离开此房间，而八合会在此静待佳音。
//
//有其他可以制作磨损的布袋的人的报告，但是，以上的在列的人员被证明是最可靠的制作磨损的布袋的人。
//
//作者和译者
//« Object 86 | Object 87 | Object 88 »
//
//Footnotes
//1. 原文名：Siphylis与梅毒（Siphilis）有一字之差，故译为梅毒是不妥的，特告知——译者注
//2. 原文：You do not know nothing about nothing mysterious。——译者注package wupin;
//
//public class mosundebudai87 {
//
//}
package wupin;
public class mosundebudai87{
}