//躯器编号：Flesh C-79
//
//代价：大
//
//安装位置：大脑皮层
//
//生产商：脑花炖菌由有识血肉学者氏族主导研发并在各有识血肉贸易巢进行批量生产后交由“躯”售卖，因此仅保证安装过程无危险，对产品本身性能有任何疑问或建议请直接与有识血肉对接。
//
//介绍
//脑花炖菌是一种与宿主大脑达成共生关系的类真菌生物集群，种植时仅聚集于大脑皮层，随生长逐渐与大脑达成共生，通过向脑灰质中持续释放微量活性色胺来引发轻微致幻反应。
//
//经过精心调制的活性色胺成分能保证仅引发微量且正向的幻觉，不影响正常生活的同时使宿主能够持续保持心情舒畅放松以应对后室繁重的生存和精神压力。
//
//附加作用
//多次实验结果已证明脑花炖菌进入大脑后分泌用于命令身体免疫系统忽视自身的信息素对其他大多数微生物及实体都产生作用。因此针对脑部的精神效应大多都会导向至没有自我意识的脑花炖菌导致削弱，从而变相提高宿主的精神抗性。
//
//脑花炖菌在发现有其他试图感染头部的细菌出现时会启动自我防御机制：快速分泌大量针对性生物酶拆破对方蛋白质结构使其失活，因此使用此物品后宿主的脑部染病概率会明显下降。
//
//说明
//如何使用：
//
//一、脑花炖菌仅可在有识血肉或“躯”成员主导下进行安装，通常需要进行一次简单的微创手术保证菌落孢子从头骨裂缝准确散布至需要位置，余下步骤将由孢子自行生长完成，不过出于流程透明目的仍向您介绍生长流程。
//
//二、正常情况下脑花炖菌会在大脑中板位置驻扎，通过将菌丝伸入脑血管中汲取营养的方式保证自身生长繁衍并逐渐将种群扩张至两个大脑半球直到完全覆盖脑灰质层，此过程需要15~20天。
//
//三、脑花炖菌在步骤二完成后会生长一定数量的感应触手至大脑前额叶区域与宿主神经进行连接，通过感应神经电信号和激素分泌水平来判断宿主当前情绪状况，并根据当前情绪状况对活性色胺的分泌进行适当调节，总体来说会使宿主保持在和平冷静的状态，不会因为恐惧或愤怒失去判断力和行动能力，这一过程需要1个月左右。
//
//四、此阶段脑花炖菌会进一步完善共生体系，包括调节内分泌体系减少抗药性确保色胺用量稳定，修改部分免疫系统敏感度以保证不产生排异反应等。期间宿主会逐渐感觉到心情愉悦，周围的色调逐渐偏向暖色调且光线也变得更明亮，这一过程需要2~3个月。
//
//五、一切无误后，您就可以享受新的生活了。
//
//注意：
//
//一、在脑花炖菌接种1~5日内因躯体正常免疫反应而出现低烧之类情况是正常的，若反应过于强烈可适当补充免疫系统抑制剂1。
//
//二、由于原理仅是依靠分泌致幻剂来让探索者看到相对明快的幻觉，因此该效应并不会对本身以及产生心理疾病的探索者起到治疗效果。
//
//三、与Flesh C-82 - “金龟子”防护装置能够形成互补关系，植入了此物质的探索者能够更好的运用Flesh C-82 - “金龟子”防护装置2
//
//以下是来自有识血肉同胞的书信，在验证活性思维共享神经权限后方可查看。
//获取
//目前其标准版可通过流浪商人处购买，若是希望购买实验板的探索者可以前往有识血肉城市购买，实验板的价格仅为标准版的1/10且拥有更多样化的功能3。
package wupin;

public class naohuadunjun1079 {

}
