//package wupin;
//
//public class nihongjibianxiangji1128 {
//
//}
//Object C-128 - “霓虹畸变相机”
//评分: +21+–x
//统合物品分类系统
//物品编号 #：C-128
//位置：M.E.G.仓库
//安全性：中性
//用途：
//破坏物体
//状态：
//被M.E.G.回收
//OC128-1.jpg
//正在飞行中的Object C-128。
//
//Object C-128，又称霓虹畸变相机，是一种搭载于小型无人机上的远程操控相机。
//
//描述
//霓虹畸变相机最初是由M.E.G.与后室娱乐组织交易所获得的，因为该产品当时仍处于调试阶段，M.E.G.暂时只购进一台样品，现保存于基地仓库当中。但由于种种原因，后室娱乐在研发完本产品之后改变了其销售策略，故取消了二者之间的购买预定，其完成品目前仍处于未知状态。
//
//出于安全性考虑，霓虹畸变相机必须要搭载在可远程操控的无人机上，并在严格的监督下进行使用，以免造成任何不必要的损失。其说明书与使用流程见下：
//
//使用须知
//让霓虹畸变相机带给您不一样的视觉体验！拍一张精美的照片，自动将它转换为梦幻的霓虹蒸汽风格，将您的生活变得丰富多彩！无需胶片，无需冲洗，只要将信息输入任何一台打印机，就可以输出高保真相片，定格您和您家人的美好瞬间。
//
//免责声明：在使用霓虹畸变相机前，请务必遵守以下使用方法，否则由违反方法所带来的一切后果，后室娱乐公司概不负责！
//
//第一步
//将相机安装在我们附赠的无人机机身上
//由于相机会产生小范围巨量辐射，直接用手按下快门键是极其危险的行为，因此本相机配备了远程操控功能。您只需要在信号可接受范围500米以内操作，即可在任意角度拍摄照片！
//
//第二步
//将相机调整至您喜欢的模式
//我们在相机里预设了三个模式，它们分别是：
//
//暖色天空模式 - 让拍摄的照片自带暖洋洋的滤镜，如同晚霞下柔软的棉花云彩，让人沉溺在玫瑰色的合成器天堂之中！
//亮色模式 - 即使是在黑夜当中，仍然拍出清晰可见的照片！（注意在使用本模式时佩戴上随产品赠送的护目镜）
//色调分离模式 – 使照片产生怀旧失真感，带来沉浸式的复古体验！使用该模式会导致相机短暂过热，请在拍摄完成1分钟后再次拍摄，以免产生不必要的事故！
//第三步
//等待相机输入色彩信息并转换成光学数据
//这个过程大概需要30秒，其中相机会自动暂停拍摄，请在此时间内保持无人机稳定，切勿偏移过大角度，以免使成品产生过曝、模糊、噪点等不利于观看的缺陷。
//
//第四步
//接收由无人机传回的数据
//这些数据会备份在相机中一份，再拷贝一份发送至事先准备好的接收器，这个过程由您所设置的照片品质决定，使用高保真拍摄可能会使数据等待时间超过10分钟。接受成功后，相机会自动删除多余的数据以拍摄更多的照片。
//
//如果您没有安装接收器。那么在相机的内存告罄后，将无法继续拍摄。
//
//第五步
//关闭拍摄部分功能，等待辐射散失
//由于拍摄部分产生的热量和辐射会导致污染，为保证您和您家人的健康，请您在回收无人机之前等待拍摄部分冗余的辐射全部排出，并尽可能佩戴防护用具接触尚在发热的相机。
//
//第六步
//将数据导入打印机并打印照片
//为保证照片的高质量性，我们已将这些图像数据全部设置为只读模式，您无法修改图片数据。但等待照片打印出来后，您可以任意涂抹或进行再扫描处理，为您带来的不便敬请谅解！
//
//OC128-2.jpg
//打印完成的图片，受试者的图像出现在画面中央。
//
//用途
//将霓虹畸变相机所拍摄的照片洗出后约24小时之内，照片内拍摄的空间在现实世界会逐渐转变为与照片滤镜相同的样式，转变完成的空间极其不稳定，一旦有触动，则会立即崩塌1，之后留下一个盛有各式各样颜色液体的球形截面坑。
//
//经过大量测试，只有以泥土、砂土、水泥为主要材质的物体才会受到此现象的影响。根据这一特性，该物品可以用于破除某些区域的墙壁或探索部分层级内的死路。
//
//以下为部分拍摄实验记录：
//
//实验一
//模式：高保真、强曝光
//时间：145分钟
//
//拍摄区域为3立方米的混凝土灰色房间，其中未放置任何物体。
//
//在照片印刷完成12分钟后，房间逐渐变为粉色，其材质逐渐光滑平整，直至犹如凝胶状。在使用风枪进行吹气实验时，颜色脱落并露出后半部分的墙壁外壳，厚度达到2.5米深。
//
//实验二
//模式：背光拍摄、颜色偏移
//时间：270分钟
//
//拍摄区域为一处涂鸦墙，其光源来自无人机正前方氙气灯。
//
//照片印刷完成后5小时后，涂鸦墙开始发生形变。具体表现为某些画作的色彩细节发生蓝移2，色彩饱和度正区域性的不均匀升高或降低。
//
//在经历27小时变化后，墙壁画作如同混乱的彩色色块，完全无法辨认其原本样貌，而墙体本身也变为果冻状，最终在风吹后坍塌为一滩浑浊不堪的液体。
//
//实验三
//模式：暖色天空、低质量渲染
//时间：42分钟
//
//由实验人员穿着防护服漂浮在云层之上拍摄（见上图），背景为完全的天空。
//
//照片打印24小时后未出现任何异常现象，包括防护服、受试者本体、拍摄区域的天空等。
//
//作者信息
//« Object C-127 | Object C-128 | Object C-129 »
//
//Footnotes
//1. 其表现为颜色迅速融化，然后坍缩进与重力相同的空洞当中。
//2. 指一个移动的发射源在向观测者接近时，所发射的电磁波频率会向电磁频谱的蓝色端移动的现象。
package wupin;
public class nihongjibianxiangji1128{
}