//package wupin;
//
//public class nihongyanjing1050 {
//
//}
//Object C-50 - “霓虹眼镜”
//评分: 
//+18
//+
//–
//X
//物品编号： C-50
//
//霓虹眼镜是“后室娱乐“组织的员工所佩戴的用作通讯和伪装功能的眼镜。
//
//photo-1634203829671-1afa78dbd7b0?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1618&q=80
//即将戴上霓虹眼镜的人。
//
//描述
//霓虹眼镜为一副会发出彩色光芒的网格眼镜，镜片为某种霓虹灯带而不是玻璃镜片，其大小通常不定形，但当流浪者或实体佩戴霓虹眼镜时，其将变为符合流浪者或实体脸型的大小。彩色光芒的颜色会根据流浪者或实体的不同而变化，这似乎是他们辨认彼此的方法。暂不清楚该种光线是否需要电力供应以及可持续时间。
//
//据佩戴人员所说，在他们带上该眼镜后，其视线内的景色变成了类似与于20世纪初期的合成器风格（合成器风格是一种艺术派系，紫红色调下的异形车、激光网格、霓虹落日是合成器风格的典型符号特征。）
//
//根据实验分析，霓虹眼镜在暗处放置时，可以产生一种名为霓虹胶体的固体，其质地很硬，韧性较高，并且会发出和霓虹眼镜一致的彩色光芒，以及绿色和粉色的激光网格。当这种固体进入水中时，会在水面上浮现出“后室娱乐“的logo和“博君一笑“的字样
//
//logob.png
//浮现的图像。
//
//当流浪者或实体戴上霓虹眼镜后，霓虹眼镜的霓虹灯光会瞬间布满流浪者或实体。与此同时，流浪者或实体所露出的身体部位会在霓虹灯光的照射下变得黑暗，以至于无法看清流浪者或实体的长相和肤色。与此同时，其身体轮廓会出现霓虹彩线以及一些装饰性的光条（如下图）。
//
//adult-boy-da.jpg
//带上眼镜的人。
//
//特定实体戴上霓虹眼镜后，将具备与流浪者进行基本谈话的能力；同时，当流浪者戴上霓虹眼镜后，也将会具备与实体交谈的能力。摘下眼镜后，此能力将无眼镜的加持下持续12个小时。
//
//霓虹眼镜的效果只会作用于被后室娱乐招募的员工身上，且每一幅眼镜都有其专属编号，该组织以外的人员佩戴霓虹眼镜将不会产生任何效果。当霓虹眼镜离开其专属佩戴者十米后，其发出的光芒将持续减弱，直到变成一副普通的眼镜。
//
//用途
//后室娱乐的员工通常用其向外界隐藏自身身份，同时辨认组织同伴，更多时间用于和其他语言不通的实体交流。（包括该组织内被聘用的实体成员）。
//
//特性
//后室娱乐的员工乐于向其他流浪者炫耀他们的霓虹眼镜。流浪者可以提出查看的要求，大部分员工都会将其拿出供流浪者观看。但所有霓虹眼镜均会在离开其主人的20米外自动传送至其主人旁边。若霓虹眼镜被除其主人以外的任何人或实体采取暴力手段进行损坏，其将产生强烈的电波并击晕半径3米以内的一切生物体。
//
//记录
//由于该眼镜的特征不易识别，因此“后室娱乐“成员经常会仿造这种眼镜进行销售，请流浪者擦亮眼睛，防止被骗。以下为真实案例。
//
//- 隐藏
//发现时间：201X年10月20日
//发现物品：Object C-50
//发现者：流浪者方瀚泽
//发现概要：该流浪者在对Level C-114探索时遇到了后室娱乐的推销员。
//
//记录开始
//
//方瀚泽步行走向层级出口时，后室娱乐的推销员突然出现在方瀚泽的前方约五米的位置。随即，方瀚泽拿起了自己防身用的火盐。
//
//销售员：哦哦哦，冷静点，朋友，把你手上的玩意先放下来。
//
//方瀚泽：把你的眼镜摘下来，让我看清你是谁。
//
//销售员：哦，你这么想看吗？
//
//方瀚泽：废话，你都不知道从哪儿冒出来的，我得确认你是不是真的人类，快点！
//
//销售员：别紧张小伙子，摘下来便是了。（销售员摘下了眼镜，随即荧光线条消失）
//
//方瀚泽：行吧，你看起来不像是个伪装的人。你这眼镜是干什么用的？
//
//销售员：这是我们用来掩盖自己身份的东西，还可以让我们和其他实体说话，你现在看到我身上的这些光柱都是它的效果。
//
//方瀚泽：和实体说话？你怕不是个骗子。
//
//销售员：我是后室娱乐的销售人员，这副眼镜的能力，我保证绝对属实，你买不了吃亏，买不了上当！
//
//随后，这名销售员报出了购买的价格。
//
//方瀚泽：这价格有点贵了，不过既然你这么说，我还是愿意尝试一下的。
//
//销售员：成交！
//
//两人交换了物资。
//
//方瀚泽：（戴上眼镜）哇，真的能发出光哎，我得赶快找个安全的实体试试。
//
//销售员：那当然，赶快去验证一下吧。（随后，该销售员趁其不注意离开了现场）。
//
//方瀚泽：实体……实体……你在哪里~
//
//20分钟后，该伪造的霓虹眼镜失去效果，变回了一副普通眼镜。方瀚泽将这一情况上报了M.E.G.数据库，并在之后获得了M.E.G.的人道补偿。
//
//记录结束
//
package wupin;
public class nihongyanjing1050{
}