//Object C-80 - “霓虹发射器”
//评分: 
//+22
//+
//–
//X
//
//物品编号：C-80
//霓虹发射器为后室娱乐的员工及其各个小队所装备的制式武器。
//
//ak47
//一把红色的霓虹发射器
//
//描述
//霓虹发射器外观与前厅枪械类似，它具有和后室娱乐其他产品相似的特性，每把霓虹发射器的轮廓都会出现各色的霓虹光带，光带颜色不同枪械种类也随之不同，被记录的如下：
//
//红色霓虹发射器，其外观为前厅AK系列步枪，射击方式为全自动。
//绿色霓虹发射器，其外观为各式前厅手枪，包含单动式、双动式左轮以及自动手枪。
//蓝色霓虹发射器，其外观为前厅雷明顿M870霰弹枪，为泵动式。
//紫色霓虹发射器，其外观为前厅M91-30狙击步枪1，可进行远距离高精度射击。
//霓虹发射器的外壳疑似十分坚硬，曾有流浪者目击过后室娱乐员工使用霓虹发射器成功抵挡银骨的攻击且其自身并未出现明显损伤。
//
//每把霓虹发射器在后室娱乐内部都有编号和分发管制且后室娱乐有未知方法可以对其进行定位，若未接受分发或发送任何申请，无理由地持有霓虹发射器将会被隶属于后室娱乐的“娱乐清扫者”实体小队定位，并进行多次切出快速到达目标身边对其发动攻击，直至目标死亡并回收失窃的霓虹发射器，由此，非法手段获取被证明为不可行。
//
//后室娱乐并不售卖霓虹发射器，因此未能获取到哪怕一把霓虹发射器，无法对其进行研究，其内部结构尚不得而知，唯一已知部分为其弹匣构造。
//
//用途
//霓虹发射器的破坏力十分强悍，其发射出的子弹并非普通枪械所使用的任何口径的传统子弹，而是一种高热量的光束，光束颜色与霓虹发射器的轮廓彩线颜色相符。
//
//霓虹发射器发射的光束可破坏多种金属以及轻易地击穿墙壁，多数防御在其面前都可视为无用，后室娱乐依靠这种武器使其在与实体或其他团体的战斗中不落下风，且M.E.G.无法对其推销有害产品的行为进行有效制约，不过后室娱乐似乎并未对其他流浪者或团体抱有敌意。
//
//目前已被证实霓虹发射器发射的光束可被纯净水沾湿的衣物或物件所阻挡，并失去高温，但若被其击中依然会被强大的冲击力掀翻。
//
//霓虹发射器比普通枪械可以更好地保护全体流浪者的安全，因此我们需要这种武器的生产技术，且正在急切地与后室娱乐寻求交流的机会。
//
//获取
//目前没有霓虹发射器的可靠获取途径，大部分霓虹发射器都装备于后室娱乐的员工手中。
package wupin;

public class nihongfasheqi1080 {

}
