//Object C-59 - “扭曲哈哈镜”
//把你的面容变得更加欢乐吧
//
//统合物品分类系统
//物品编号 #：Obejct C-59
//位置：“后室娱乐”控制地区
//安全性：较危险
//用途：
//改变外貌、击杀实体
//状态：
//被特定组织售卖
//评分: 
//+24
//+
//–
//X
//描述
//扭曲哈哈镜是由后室娱乐制造并售卖的一种镜子外观的物品，其存在多种造型及尺寸，其中，最大型的扭曲哈哈镜高达2.1m。和普通的哈哈镜不同的是，扭曲哈哈镜的镜面为平面镜。
//
//扭曲哈哈镜的镜框会发出淡淡的彩色荧光1，镜框最顶端总是会存在一颗触感近似于珍珠、略有粉紫色荧光的白色凸出按钮，按下该按钮后其颜色将变为桃红色。此时，扭曲哈哈镜将由关闭状态转为开启状态，再次按下按钮可以将其关闭。
//
//处于开启状态时，流浪者可以通过意念让自己映在镜面内的躯体部位发生扭曲，新品推销员对此过程的描述是：“你首先需要用眼睛注视着它，然后，就像使用部分作图软件的液化工具一样，用你的意念操纵那个隐形的鼠标，点在一个地方一推，你的身体就会非常好玩地扭曲啦。”
//
//事实上，这是一种较为危险的行为，这不仅会使流浪者映在镜中的像扭曲，还会使流浪者躯体对应部位发生同样的扭曲，过度的躯体扭曲将导致流浪者因器官受压与结构异常而死亡。
//
//只要扭曲哈哈镜处于开启状态，任何一位盯着镜面的流浪者2都可以通过意念扭曲映在镜中的肉体的任何一部分，这包括了一部分实体的躯体3。
//
//后室娱乐的新品推销员往往会告诉流浪者他们可以使用意念将自己扭曲的部位扭至正常形态，但由于流浪者们通常并不能熟练使用扭曲哈哈镜，他们复原的尝试往往会导致更严重的后果。
//
//需要特别注意的一点是，如果扭曲哈哈镜在开启状态下被破坏，所有映在碎裂部位中的躯体部位都将与镜子一同变为碎块，此特性可用于在紧急情况下击杀实体，但也易被不怀好意者所利用。
//
//综于上述原因，M.E.G.强烈不建议流浪者将从后室娱乐处获得的扭曲哈哈镜用于击杀实体以外的用途，并鼓励流浪者将获得的扭曲哈哈镜上交以获取补贴
//
//+ 以下是来自有识血肉同胞的书信，在验证活性思维共享神经权限后方可查看。
//经M.E.G.试验，扭曲哈哈镜似乎不会对无生命的血肉生效，但可以对存活的植物与真菌类生效。
//
//获取途径
//扭曲哈哈镜可于各地的后室娱乐店铺购买。
//
//用途
//改变外观
//紧急情况下消灭实体。
package wupin;

public class niuqvhahajing1059 {

}
