//package wupin;
//
//public class nuokeliputie1028 {
//
//}
//Object C-28 - “诺克立普贴”
//评分: +51+–x
//编号：C-28
//诺克立普贴是一种可用于创造临时切出点的贴片，其有多种型号。诺克立普贴通常处于层级内昏暗或是难以触及的地方，几乎所有自然发现的诺克立普贴均固定在被发现平面上，尝试回收将使其失效。以黑星为首的极少数组织已拥有制造诺克立普贴的技术，尽管使用人造的诺克立普贴会引发例如呕吐、腹泻、高烧等副作用。
//
//原理
//黑星声称此物品的工作原理是通过干扰黏贴平面的量子不稳定性从而增加切出概率，但尚缺乏实验证明这种说法是否准确。根据B.F.P.F.基于量子测不准原理对于此物品在黏贴时的构成系统的度量张量函数分散性的测定结果证明了黑星的理论：
//
//揭开防粘纸10秒内进行有效黏贴将大幅度扰动物品半径2米内空间
//揭开防粘纸10秒后，物品趋于稳定
//正确黏贴诺克立普贴1会小幅度扰动空间不稳定性从而增加切出概率
//保持30秒不与任何物体有效接触后物品的不稳定性急剧上升
//描述
//noclip%282%29.png
//诺克立普贴上的图案
//
//诺克立普贴形似前厅的贴纸，一般长约80cm，宽约70cm。正面印有蓝色小人进行切出行为的图案2，背面为防黏纸。若流浪者与其黏性物质接触，被接触部分会出现霉斑并带有强烈的刺痛感，且由于诺克立普贴的黏性是普通贴纸的数倍，强行撕除将会导致皮肤剥落。诺克立普贴的性质不会受皱褶影响，这意味着可以通过折叠来节省空间。
//
//将人造诺克立普贴背后的防粘纸沿着虚线撕下，黏贴在较为规则的平面3上后即可使用。若防黏纸撕下后30秒内未进行黏贴，其黏性物质会凝固，从而导致诺克立普贴失效，并在一段时间后溶解成原液。尝试回收已黏贴的诺克立普贴4也会导致此类事件的发生。
//
//当其中一片诺克立普贴黏贴成功后，使用者半径2米内的其余诺克立普贴均会溶解，因此不建议携带过多的诺克立普贴或在其存储点周围使用。黏贴超过24小时，或使用超过两次后，同样会导致诺克立普贴溶解：它会缓缓地将自己折叠并慢慢融入墙壁，随后使用者正常切出的可能性将减小，目前已有部分速切玩家因滥用诺克立普贴丧失自然切出的能力。未成功溶解的诺克立普贴会有极低的概率转变为灰色。
//
//诺克立普贴仅可供生命体使用，所有非生命体在切入的一瞬间均会失去联络，并且不会消耗使用次数。目前尚未发现任何非生命体成功切出至已知层级的案例，但不排除其切入了未知层级，乃至前厅。
//
//以下展示了部分B.F.P.F.对此物品进行或收集到的实验记录，除蓝色和灰色外，其余颜色的诺克立普贴均为自然发现：
//
//编号	实验内容	颜色	实验地点	实验结果
//#1	常规切入	蓝色	Level C-45	实验者切入Level C-184
//#2	两次切入同一个诺克立普贴	蓝色	Level C-45	实验者切入Level C-27，同时诺克立普贴失效，并在一段时间后溶解成原液
//#7	强制切入	蓝色	Level C-126	实验者连同半径2米内的生物切入Level C-7
//#16	常规切入	红色	Level C-11	实验者切入Level 7
//#17	常规切入	灰色	Level C-270	实验者切入Level C-270的另一片区域
//#18	实验者反复切入同一个诺克立普贴	灰色	Level C-270	实验者每一次切入均会从Level C-270的随机区域切出，诺克立普贴不失效
//#24	常规切入	绿色，标注有“C-71”字样	Level C-45	实验者切入Level C-71
//#30	撕下一半防黏纸，30秒内黏贴在规则平面上	蓝色	Level C-45	诺克立普贴失效，并在一段时间后溶解成原液
//#47	随身携带相机的无足鸟常规切入	红色	Level C-45	无足鸟切入未知层级，相机滞留在原地
//#79	叠加黏贴诺克立普贴	蓝色	Level C-45	仅有最外层诺克立普贴可正常使用
//#105	实验者保持睁眼，背身切入	绿色，标注有“C-11”字样	Level C-45	实验者切入Level C-11，据其口述，在切入的一瞬间“有一股巨大的力量迫使其闭眼。”
//#500	实验者不使用诺克立普贴切出	N/A	Level C-360	实验者无法切出，推测其已失去正常切出能力
//#554	推测实验者常规切入	灰色	Level C-147	实验者的【数据删除】分裂在不同的管道中
//#1796	常规切入	绿色，标注有“前厅”字样	Level C-已编辑	【数据删除】
//用途
//诺克立普贴可用作紧急逃生：当流浪者进入某个难以离开的层级或受到实体追击时，在10秒内使用会将流浪者连同半径2米内的生物强制切出至同一层级，同一位置的随机高度，通常为18米以下，平面以上。
//
//常规切入时，不可对诺克立普贴进行视线接触5，随身携带的物品将会滞留在原层级，并整齐的排列在原地。切出时尝试睁眼会导致身体卡入墙壁或是分裂在不同层级中6。
//
//使用诺克立普贴强制切出时将通往一完全随机的层级，再次常规切入时，该切入点不会变更7。常规使用时则相反，但切出点会更加安全。
//
//彻底销毁非生命体。由于大部分组织尚未完全掌握诺克立普贴的工作原理，故不推荐将诺克立普贴作为此用。
//
//附录
//收起
//如何使用诺克立普贴
//by 速切玩家协会
//
//
//
//1.揭开诺克立普贴背后的防黏纸。
//
//
//nocliptie1
//
//
//2.将其黏贴在合适的位置上。
//
//
//step2.png
//
//
//3.避免视线接触，切入即可。
//
//注意事项：
//1.请勿在揭开防黏纸10秒内黏贴诺克立普贴，否则将导致使用者直接切出。
//
//2.请在30秒内完成黏贴，否则诺克立普贴将会失效。
//
//3.请勿黏贴在自己身上。
//
//4.请勿同时携带一个以上的诺克立普贴。
//
//5.请勿在自身半径2米内存在其它诺克立普贴时使用。
//
//6.诺克立普贴的有效时间仅有24小时，请合理使用。
//
//7.不得在速切过程中使用诺克立普贴，否则您的速切成绩将作废。
//
//8.请一定要记住：除非迫不得已，否则不要使用诺克立普贴。我们已有许多惨痛的先例。
//
//收起
//2022年7月25日
//今天进行了第47次实验，唉，虽然知道无足鸟会飞，放进去的时候还是有点舍不得。毕竟上一位切入红色诺贴的实验者可是进了Level 7，九死一生才逃出来的。
//不多愁善感了，说下今天的收获吧：诺贴似乎会自动识别物品是否与生物体绑定，单独切入的物品在接触到诺贴的一瞬间全部消失了，并且不会消耗诺贴的使用次数。又也许它们根本就没有切入，只是这样的凭空蒸发了。
//这么说……诺贴或许可以用来销毁某些东西？
//
//2023年1月30日
//我越来越确信诺贴是后室意志的产物了，今天又在其他层级发现了绿色的诺贴，而它确实能指定切入的层级！
//我在这里提出大胆的猜想：
//
//红色：出现在阴暗处，固定前往某个生存难度大于4的层级
//绿色：随机出现，上面写好了前往哪个层级，使用后将会刷新位置（前往的层级不变）
//灰色：在同层级内折跃无效切出导致在同层级内随机折跃。
//
//2023年12月31日
//后室协调时新年快乐！
//今天进行了第500次实验，诺贴的弊端逐渐显露。自愿参与的实验者变成了所谓的“速切玩家”，听说他们很早以前就和“黑星”私下勾结换取诺贴了，这帮家伙真是不要命！
//
//【无关内容已编辑】
//
//20??年?月?日
//发生了这种事，几乎所有人都对实验失去了希望。上级已下令解散团队，有缘再见。
//同事疯了一般地往Level C-45的诺克立普贴里扔资料，哈，本来只是把它当作大家的垃圾桶，我早该想过有这一天的。
//很抱歉，B.F.P.F.没能找到通往前厅的路。我不会销毁自己的笔记，是，我是没骨气，但我想让后来者知道我们曾经尽力过。毕竟后室不仅仅只有我们，合理的使用诺贴拯救了不知多少人的性命，单冲着这一点，我们的实验就不是毫无意义。
//我只是不明白，后室意志究竟为何要这样做？也许它只是在折磨我们的基础上添了点新花样……
//
//
//作者信息
//« Object C-27 | Object C-28 | Object C-29 »
//
//脚注
//1. 即揭开防粘纸10秒后，30秒内黏贴在有效平面上。
//2. 同时存在不同颜色的衍生物品，详见下文。
//3. 不包括防黏纸。
//4. 即诺克立普贴的背面接触到除防黏纸以外的事物。
//5. 如背过身或闭眼切入。
//6. 该限制对视觉障碍者无效。
//7. 例如使用一个诺克立普贴后切入了Level 11，下一次通过这个诺克立普贴同样会切入Level 11。
package wupin;
public class nuokeliputie1028{
}