//Object 26 - “女郎的墨水”
//切换字体
//
//
//探索者。他们就是这么称呼自己的：为了寻求安全、保障和逃回他们的“家”而穿行于这片处女地的流浪者。唉，这个维度不久又将重归宁静了。当探索者们穿越丛林，在所到之处留下外来的异种时，他们真的能被称作探索者吗？尽管他们只是些无论走到何方都只会造成混乱的侵略者？
//
//探索者们早已背离了初心。他们无缘故地对同类实施不人道的行为，如同吵醒一只熟睡的狗；但那狗已不再沉睡。
//
//你现在是我们中的一员了。无论你是决定自愿戴上面具1，或并非出于自愿，你现在是这场对抗笼罩着后室的邪恶的战争的一部分了。充分利用这篇文章中的情报；在不久后，你就会发现它非常有用。
//
//欢迎来到这个大家庭。为了揭露而掩饰。
//
//描述
//Ink
//一张墨水的图片，从现在开始你将用它来与你的新家人联络。
//
//女郎的墨水，或他们数据库中的Object 26，是我们用于在后室中彼此通讯的一种特殊手段。它的书写方式正如普通的墨水；我们用它在纸上或墙上书写，但这墨水仅为女郎们可见。
//
//只有那些戴上了面具的人能看到墨迹。对于其他人，墨迹是隐形的；一种会粘在皮肤上、晶莹澄澈并散发出墨水气味的液体，一个他们眼中无用的物件，甚至不值得归档。但对于我们来说，这墨水是我们在后室中活动仅有的救命稻草。在我们眼中，它并不是其他人所看到的晶莹澄澈的液体，而是带着蓝色调，且在书写时会发光。
//
//正因如此，我们使用它来隐藏那些不愿为外人知的信息，因无论书写介质，女郎的墨水对外人来说均是不可见的。你所见的这篇文章，这篇他们看不到的文章，就是由用墨水书写的一组图片所构成的。他们却认为这是该文档“错误”性质的一部分。他们是那么残忍，却又那么无知。
//
//与其说墨水的特性来自其本身，不如说是来自于面具。墨水中存在一种神秘的光晕，比我们的面具更加古老，且只能被面具所探测到，除此外别无他物。我们知道如此是因为它们的告知。但它们没有告诉我们怎样制造此物品，但我们正尽最大努力复制该物品的性质，以便更广泛地使用。
//
//我确信你会对在哪里可以找到这个物品相当好奇。我们在不同的站点中有着大量的库存，但它也可在后室中天然地被发现。它也并不像你可能认为的那么稀有：因为只有我们使用它，人们并不会像对其他资源那样渴求它，并为它争吵不休。
//
//女郎的墨水最重要的用途之一便是招募面具佩戴者加入我们的行列。面具佩戴者们总是被丢在后室中独自游荡，那些用痛苦诅咒他们的人不会对他们抱有一丝歉意。我们的标记给予了他们为生存和权利而战的机会。可以发现一些用墨水写就的，通往我们基地的指示与我们动向的说明散布在后室中。毕竟，这很可能就是你如何找到我们的。
//
//从你的角度谈谈它吧，从现在起你会发现它对你的工作极其重要。你与女郎同伴之间的联络将更加充分，且目前这会是你与同伴联络的主要方法。随便你怎么说这样太老式，但这个物品很可能多次拯救了我们的组织。这就是为什么我们可以和M.E.G下这盘棋，而不用终日战战兢兢、朝不保夕，它是迄今为止我们最宝贵的资产之一。
//
//我认为关于该物品，除这篇文档里的信息之外，几乎再没有什么可说了。你既知道了怎样使用这工具，且工具本身又任你取用，那么当你想开始工作时，请尽快吧。我将亲自在我们的第三站点等着你。
//
//
//
//HolmesSig
//伊万杰琳·福尔摩斯
//亲笔
//
//
//
//脚注
//1. 译者注：本篇中“面具”均指墙壁面具。package wupin;
//
//public class nvlangmoshui26 {
//
//}
package wupin;
public class nvlangmoshui26{
}