//OPject C-84
//评分: +9+–x
//
//编号：C-84
//获取途径：Level C-95获取或从D.P.P.O团体中购买。
//
//0.jpg
//装在盘子中的固态“O.P柳汁”
//
//描述：
//“O.P柳汁”通常呈现出一种极为粘稠的液体状态，沸点于91°C~102°C左右，在少部分干燥的情况下会凝结为固体状态。其无论在液体状态还是固体状态的整体颜色都为淡绿色，气味类似杨柳科植物的汁液，但味道偏苦，且“O.P柳汁”拥有少量的毒性，如果在一小时之内饮用超过1.5L~2L左右的“O.P柳汁”，可能会引起便秘，胃炎，胃出血等消化道疾病，因此不建议一次性饮用过多。
//
//“O.P柳汁”的营养价值极高，100ml的“O.P柳汁”就拥有约105千卡的能量。在饮用后1小时~2.5小时左右，会从饮用者的毛孔中排出一种类似于杨柳科植物汁液的气味，据研究报告描述，这种气味会使得后室中小体型的实体对饮用者产生厌恶的感觉，少量液体“O.P柳汁”还可以驱赶实体。但是猎犬与后室犬会被这种气味所吸引，初步推测与D.P.P.O团体的制作工序有关。
//
//“O.P柳汁”的固体状态俗称“柳块”，大部分特征都与“O.P柳汁”相差不大。但“柳块”不可食用，食用柳块会出现“癫痫”，“内出血”的症状。一般情况下“柳块”都被作为燃烧材料所用1，使用方法是直接点燃“柳块”。10克“柳块”可持续提供照明约1小时到2小时左右。当燃烧量在150克~200克左右时，“柳块”会发生剧烈爆炸。
//
//副作用处理方法：
//当流浪者误食了“柳块”或者一次性饮用了过量“O.P柳汁”时，请务必在第一时间进行催吐，不可以使其继续存留于流浪者体内。催吐后流浪者可以服用少量治愈水晶来缓解所造成的消化道伤害。在催吐后的1小时~2小时之内，流浪者需要每30分钟饮用约100ml的杏仁水来治疗。在此期间不建议食用固体或者难以消化的食物，否则会对消化道进行二次伤害。
//
//获取方法：
//目前，获取“O.P柳汁”主要有两种方法：前往Level C-95向实体“大厨”索要或从当地D.P.P.O前哨处购买；也可以向各层级的D.P.P.O前哨处购买，一般情况下它们都会对流浪者表示友好并对其贩卖“O.P柳汁”，但请不要展现出讨价还价的行为，否则它们会对流浪者产生反感以及拒绝向其贩卖“O.P柳汁”，流浪者也可以通过询问D.P.PO前哨处成员来得知其开展的“贸易集会”来购买“O.P柳汁”。但请尽量不要从不明人士中购买“O.P柳汁”，以防出现劣质产品所导致的身体问题。
package wupin;

public class opliuzhi1084 {

}
