//package wupin;
//
//public class paladin1152 {
//
//}
//PLS-IV-152 - “帕拉丁”
//评分: +5+–x
//统合物品分类系统
//物品编号 #：PLS-IV-152
//位置：帕拉斯研究所
//安全性：安全，不稳定
//用途：
//医疗用途
//状态：
//可量产
//物品编号：PLS-IV-152
//位置：帕拉斯研究所/大范围流通
//描述：
//PLS-IV-152是M.E.G.委托帕拉斯研究所生产的一类特殊复合化学品，在M.E.G.牵头的旨在改善流浪者健康状况的卫生行动中起到重要作用。
//
//PLS-IV-152一般作药用，药用PLS-IV-152被帕拉斯研究所命名为“帕拉丁”。
//
//帕拉斯研究所的销售部门主要将“帕拉丁”销售给各类有需要的团体或专职代理商。目前最主要的客户为M.E.G.与B.N.T.G.等需要广泛使用该物品的大组织。
//
//PLS-IV-152属于帕拉斯研究所的壹类常规化学品，与其他同样的常规药品一起，作为帕拉斯研究所重要的经济来源和口碑支撑。因此，帕拉斯研究所没有对“帕拉丁”及其他壹类常规化学品的生产销售设限。
//
//PLS-IV-152的产量非常大，多年来在大量流浪者之间广泛流通和使用。帕拉斯研究所的多次市场调研均显示“帕拉丁”具有理想疗效，因其接受度高，泛用性广等优点，被流浪者誉为“万能药”。
//
//性状
//根据有效成分的含量不同和性状不同，“帕拉丁”可分为甲型(粉末状)，乙型(胶囊型)，丙型(颗粒冲剂)，丁型(注射用药液)。
//其中
//
//甲型“帕拉丁”为白色或类白色粉末状固体，产量最大且流通广泛，出现在市场的散装帕拉丁粉末也通常为甲型。
//乙型“帕拉丁”为胶囊，内容物为白色或淡黄色的粉末。使用塑料铝膜复合材料包装，通常可在定点医疗机构处获取。
//丙型“帕拉丁”为袋装冲剂，与乙型一起成为处理卫生问题时的常用药品。
//丁型“帕拉丁”为调配而成的注射制剂，几乎只出现在某些组织的医疗部门做内部使用。
//主要成分
//BLG-11，阿司匹林2，SL-063，SL-074，蒙脱石5，CL-156，SL-117，SCA-38，SDA-119，阿莫西林10，SERT-0711，明胶，OTS-0012。部分材料依据帕拉斯研究所保密协定隐去。
//
//甲型“帕拉丁”为外用型，增加了特殊成分用于处理外伤，可作止血粉与消毒剂，但有一定的刺激性。
//乙型“帕拉丁”一般作为内服消炎药使用，与其他类型相比，乙型的抗生素成分占比最高。
//丙型“帕拉丁”可作为一般解热镇痛感冒药使用，调和了抗生素与其它成分的比例，提高了中成药成分占比，并制成冲剂，降低了药理毒性，使其药性更温和。
//丁型“帕拉丁”通常被用来调配注射液，因此完全去除了部分其他成分，混用了更多的帕拉斯内部使用的化合物，消炎效果最为显著。
//一般不建议不同类型的“帕拉丁”混用，因其可能产生不可预知的不良反应。如遇紧急情况，可适当适量使用其他类型的“帕拉丁”，但疗效可能会大打折扣。
//
//用途
//用于缓解感冒，咳嗽，发烧，腹泻，上火，心慌，头痛，呕吐，呕吐泄泻，胸膈痞闷，心烦苦满，食欲不振等常见症状。
//
//以及用于治疗多种细菌或真菌感染所引起的炎症。
//
//用法
//甲型“帕拉丁”适用于外伤，取适量覆盖在已清洁过的伤口表面，或是作止血粉直接按压在伤口处。也可溶于水作杀菌消毒剂使用。用毕请洗手。
//乙型“帕拉丁”与丙型“帕拉丁”请参考包装袋上的说明书。如有疑问请询问经验丰富的医生或药师。
//丁型“帕拉丁”仅在临床上用作消炎药，配制注射液使用。
//使用时应参考通用化抗菌药物临床应用指导原则。
//(本部分摘录自M.E.G.特供版说明书)
//
//不良反应
//就个例来说，“帕拉丁”的不良反应较小，但对整体而言，“帕拉丁”的其它成分会不可避免地带来副作用。
//如：
//
//部分草药成分至今未完全解明，可能引起头晕，恶心，呕吐等。
//部分抗生素可以引发一定的过敏反应，如荨麻疹，过敏性休克等
//由于其中成分复杂，“帕拉丁”具有一定的阿片成瘾性，禁止长期大量使用。
//由于其中含有的蒙脱石成分，可能导致正常人轻度便秘，大便干燥。
//其他。
//如有不良反应请及时就医。
//使用禁忌
//“帕拉丁”含有多种抗生素成分，青霉素过敏及青霉素皮肤试验阳性患者禁用，肝肾功能不全者慎用，孕妇及哺乳期妇女，一周岁以下幼儿慎用。
//
//因其某些成分会抑制中枢神经的正常活动，服药期间应避免从事精密作业，驾驶交通工具等活动。
//
//“帕拉丁”的肝肾毒性小，吸收不受进食影响，但同时应用其他药物时，可能会发生一定的药物相互作用，详情请咨询开具处方的医师或药师。
//
//详情请咨询药师或临床医师。
//
//你知道的，考虑到后室环境复杂，帕拉斯研究所正在寻找青霉素的替代品，但很难找到同样优秀的抗生素了。实验型换用了链霉素，但临床表现并不好。我们合成的新型抗生素还缺乏临床测试，所以PLS-IV-152的改进型还遥遥无期。
//节选自P.R.I.职员Mashy致M.E.G.医疗部门的邮件
//
//贮藏
//30℃以下避光保存。考虑到其中的活性成分复杂且可能发生变性，若“帕拉丁”长期处于35℃及以上高温，药物性状将发生不可知的改变。
//
//建议保存在干燥密闭容器内，不建议使用市面上流通的散装“帕拉丁”，因其成分可能已经改变。
//
//“帕拉丁”性状发生改变时禁止使用。
//
//附录
//经由人体吸收后，在腹部组织，皮肤，脂肪，肌肉组织，滑膜和腹膜夜，胆汁和脓液中均有“帕拉丁”存在，但无法通过血脑屏障进入脑脊液。“帕拉丁”主要通过肾脏清除，12h后绝大部分“帕拉丁”可随尿液排出。
//
//但也因为“帕拉丁”在流浪者中的滥用，某些常见致病菌对抗生素的敏感性问题日益严重。我们不能忽视耐药性的问题，将PLS-I-152看做“万能药”滥用的后果让帕拉斯研究所取消了后续复合药物的研发计划。
//(选自项目负责人Mashy的日记)
//
//帕拉斯研究所化工部目前将主要精力放在了单一用途的特效药上，PLS-IV-152及其衍生品很可能是最后一款泛用化的药品了。虽然“帕拉丁”间接带来了更为复杂的致病因素和急剧上升的敏感菌抗药性，但不可否认的是，作为一款复合抗生素，它深刻影响了流浪者乃至整个后室的健康状况。
//(节选自M.E.G.医疗部主管Carol的日志)
//
//[冗余信息略]
//
//目前在外流通的“帕拉丁”成分复杂，建议流浪者谨慎使用。如有需要，建议直接购买M.E.G.或B.N.T.G.售出的成品。
//
//帕拉斯研究所只对具有原厂完整包装与购买记录的PLS-IV-152提供售后服务并负有相关责任。
//
//作者信息
//« Object C-151 | Object C-152 | Object C-153 »
//
//脚注
//1. 最实用的感冒药，主要成分为板蓝根。
//2. 即乙酰水杨酸，通常用于用于解热镇痛
//3. 取材自流浪者的偏方，清热解毒，主要成分为冰片，人工牛黄，滑石粉等
//4. 同样取材自流浪者的偏方秘方，定心养性，主要成分为茯苓，生半夏，玉米淀粉等
//5. 一种治疗腹泻的特效药
//6. 用于治疗感冒，主要成分有金银花，柴胡，白芷，蔗糖等
//7. 用于止咳平喘，效果显著，主要成分为甘草流浸膏粉，阿片粉，樟脑等
//8. 帕拉斯研究所内部合成的贰类化学药品，总结了前两代失误后的革新，可用于调配抗生素的有效成分
//9. 帕拉斯研究所内部合成的贰类化学药品，为新型大内环酯类抗生素，可用于调配抗生素的有效成分
//10. 一种常用的广谱β-内酰胺类抗生素
//11. 帕拉斯研究所内部合成的叁类化学药品，是一种实验型广谱抗生素，可用于调配抗生素的有效成分
//12. 帕拉斯研究所广泛使用的聚合剂，对多种含羟基有机物均有良好吸附作用
package wupin;
public class paladin1152{
}