//Object 42 - “瓶装闪电”
//物品编号： 42
//稀有等级	7/10
//实用等级	8/10
//需求情况	4/10
//危险等级	8/10
//Object 42，又名瓶装闪电，顾名思义，是一种储存在瓶子或其他容器中的电荷。它可以在后室的大多数层级中找到，但十分稀有。
//
//描述
//瓶装闪电是一种储存在玻璃容器，如烧瓶、酒瓶或其他各种容器中，大约十亿焦耳的电荷，可以在后室的大多数层级中找到。尽管这些容器通常由玻璃制成，但它们可以容纳闪电而不会使容器炸裂成碎片，产生这种情况的原因尚不清楚。
//
//人们可以很容易的通过外观来辨识Object 42个体。闪电以非常高的速度在容器周围移动，并发出极其明亮的光。建议仅在佩戴足够的手部保护措施时触摸这些物品，以避免因高温导致的伤害1。闪电通常由容器顶部的软木塞收纳，但也观察到了其他收纳方法。
//
//以任何方式打开容器都会释放其中的电荷。释放后，电荷会寻找最近的导体。非常不建议通过自行拔掉瓶塞来打开瓶子，因为作为最近的导体，闪电几乎总会首先通过打开瓶子的人。
//
//尽管储存着所有的能量，瓶子本身非常易碎。携带Object 42的人应当谨慎对待处理物品的方式，以防出现任何意外。然而，瓶子的易碎所导致的危险性并未阻止后室中的某些人利用该物品，Object 42已被广泛用作能源和武器。
//
//Object 42存在三个不同的变种，其中两种可以自然找到，另一种则由人工制造。
//
//蓝色闪电
//作为最常见的变种，蓝色闪电会发出明亮的蓝色光晕，其光芒在所有变种中最为明亮。当被释放时，它会像闪电一样，沿着最快路径通往最近的导体。摇晃容器会使其短暂发出明亮的蓝光。这种电荷在击中人类时通常是致命的，但在某些情况下可以存活。
//
//蓝色闪电会通过房间内最好的导体进行传导。因此，它们在释放时可能无法预测。故建议在计划以任何方式使用它们时都保持谨慎。
//
//人造闪电
//人造闪电是由蓝色闪电的人造仿制版本，最初由“锈蚀朋克”Frederick Kaiser在试验了蓝色闪电能量收集数种不同的替代方案后被首次制造，旨在制造一种更安全的瓶装闪电变种。其产物便是人造闪电，与上文提到的其他变种相比，它的亮度、威力和温度都明显较低。因此，由于其相对安全性，人造闪电被广泛地用作能源，但由于其威力较低，人造闪电较少被用作武器。
//
//人造闪电相比生物更倾向于通过金属物体传导。因此，只要附近有金属导体，人们就可以在不受到伤害的情况下打开一瓶人造闪电。
//
//黑色闪电
//最危险的瓶装闪电变种。幸运的是，黑色闪电变种并不像蓝色闪电那样常见。它颜色漆黑，但仍发出微弱的光芒，其威力据估计可达蓝色闪电的十倍。据了解，这些电荷表现出异常的性质，当从容器中释放出来时，它会优先通过生物进行传导，且据说在某些情况下会随机发生爆炸，并杀死可能在附近的任何生物。
//
//到目前为止，由于黑色闪电的危险性和不稳定性，它无法安全且有效的用作能源。如果流浪者发现了它，由于其不可预测的性质，建议流浪者避开并远离。
//
//实验记录
//以下实验由Frederick Kaiser于2018年5月24日至2019年3月8日，首次尝试收集Object 42并制造人工闪电期间进行。
//
//实验编号：1~3
//日期：2018年5月24日
//使用物品：Object 42，蓝色闪电变种
//目标：测试Object 42的传导性。
//实验配置：将闪电通过一个自动机械臂释放到房间内，房间内有一根连接到功率计的铜线。
//结果：每次实验中，闪电在被释放后都会立刻通向导线。当电流通过铜线时，铜线发热并短暂发出蓝光，但每次电流到达功率计时，功率计都会爆炸。
//结论：如果它的威力足以毁坏功率计，我确信我们正面对的是一个很严肃的问题。
//
//实验编号：4
//日期：2018年6月17日
//使用物品：Object 42，蓝色闪电变种
//目标：进一步测试Object 42的传导性。
//实验配置：将闪电通过一个自动机械臂释放到房间内，房间内没有任何可作为导体的物品。
//结果：闪电立刻流向机械臂，导致其发出滋啦声并损坏。
//结论：我大概，呃，忘了那只手也是金属制品。不过这也产生了一个问题，为什么在之前的测试中会流向铜线而非机械臂？
//
//实验编号：5
//日期：2018年6月23日
//使用物品：Object 42，蓝色闪电变种
//目标：进一步测试Object 42的传导性。
//实验配置：瓶子被放在一个空房间的中间。将一块砖用蜡粘在天花板上，并静置直到蜡融化。
//结果：当蜡融化时，砖块掉下来将瓶子砸成碎片并释放出了闪电。由于没有任何东西可供传导，闪电反而击中了一面墙，留下了烧焦的痕迹并导致产生臭氧。
//结论：所以，当没有任何东西可供它传导时，它就是普通的闪电，不错。
//
//实验编号：6~8
//日期：2018年7月07日
//使用物品：Object 42，蓝色闪电变种
//目标：测试Object 42的传导偏好。
//实验配置：在这三次实验中，Object 42被放在一个有两根金属棒的房间内，一根为铝制，另一根为铜制。在第一次实验中，瓶子与铜棒的距离和与铝棒的距离相同；但在第二次和第三次实验中，瓶子被放在离铝棒更近，离铜棒更远的地方。
//结果：在每次实验中，闪电都通过铜来传导。
//结论：所以这就能解释为什么会出现前几次实验的结果了。
//
//实验编号：9
//日期：2018年7月21日
//使用物品：Object 42，蓝色闪电变种
//目标：尝试将Object 42作为能量来源进行采集。
//实验配置：将闪电通过一个自动机械臂释放到房间内，房间内有一根铜导线棒，连接到一个理论上能承受闪电所施加的能量的特殊电池。
//结果：电池炸毁。
//结论：哦操，我还以为捡到金子了呢……
//
//实验编号：14
//日期：2018年9月28日
//使用物品：Object 42，黑色闪电变种
//目标：测试一个最近在后室中被报道的Object 42新变种的性质。
//实验配置：与实验1配置相同
//结果：在自动机械臂打开瓶子前，瓶子炸裂开来，烧毁了铜棒并导致功率计和机械臂爆炸。
//结论：哇，这可真是一股不可忽视的力量。
//
//实验编号：22
//日期：2018年10月10日
//使用物品：Object 42，黑色闪电变种
//目标：测试一个最近在后室中被报道的Object 42新变种的性质。
//实验配置：与实验1配置相同，但用银棒替代了铜棒。
//结果：与实验14结果相同。
//结论：所以即使是最耐用的导体也没法承受这玩意的电荷？这他妈到底什么情况？另外，在对黑色变种进行实验时，资源管控应当是优先事项，因为就我目前所知，它们比蓝色变种还要稀有，但蓝色变种本身就够稀有了。
//
//实验编号：25
//日期：2018年11月2日
//使用物品：不适用
//目标：尝试人为制造Object 42实例。
//实验配置：在Level 817发生雷暴期间安装了一个避雷针，并将收集到的闪电转移到电池中。
//结果：能量被成功收集到电池中
//结论：我想说的是，尽管我们得到了能量，但这并不是我想要的。我只是希望像那些瓶子一样收集闪电。
//
//实验编号：26
//日期：2018年11月27日
//使用物品：不适用
//目标：尝试人为制造Object 42实例。
//实验配置：与之前的测试相同，但避雷针连接到与天然的瓶子类似的玻璃烧瓶而非电池。作为预防措施，房间内有一根连接到电池的铜棒。
//结果：瓶子被击碎，闪电和之前的实验一样进入了铜棒。
//结论：或许我应该找一个特别的瓶子来试试？自然产生的瓶子似乎和普通的玻璃瓶没什么不同。
//
//实验编号：27
//日期：2018年12月15日
//使用物品：不适用
//目标：尝试人为制造Object 42实例。
//实验配置：与之前的实验相同，但避雷针连接到强化玻璃烧瓶。作为预防措施，房间内有一根连接到电池的铜棒。
//结果：与之前的实验相同。
//结论：我不明白，那些操蛋的瓶子到底有什么特别之处，能让它们担此重任？或许使用它们是种解决办法？
//
//实验编号：28
//日期：2018年12月15日
//使用物品：不适用
//目标：尝试人为制造Object 42实例。
//实验配置：与之前的实验相同，但避雷针连接到一个废弃的自然闪电瓶。
//结果：闪电被成功收集，产生了现在被称为“人造变种”的东西。
//结论：我很惊讶它有效了，但这简直是在否定我的常识。无论如何，EUREKA2！
//
//实验编号：29
//日期：2019年1月4日
//使用物品：Object 42，人造闪电变种
//目标：测试Object 42的传导性。
//实验配置：与实验1~3相同。
//结果：闪电被释放并立即流向导线。能量测定为100000J。
//结论：毫无疑问它没有蓝色闪电那么强，但它仍然是个好东西！
//
//实验编号：30
//日期：2019年1月15日
//使用物品：Object 42，人造闪电变种
//目标：进一步测试Object 42的传导性。
//实验配置：与实验5相同。
//结果：当蜡融化时，砖块掉下来将瓶子砸成碎片并释放出了闪电。由于没有任何东西可供传导，闪电反而击中了一面墙，留下了烧焦的痕迹并导致产生臭氧。
//结论：大体上与实验5相同，这方面没什么变化
//
//实验编号：31~33
//日期：2019年2月6日
//使用物品：Object 42，人造闪电变种
//目标：测试Object 42的传导偏好。
//实验配置：与实验6~8相同。
//结果：在每次实验中，闪电都通过铜来传导。
//结论：这方面也没什么变化。
//
//实验编号：34
//日期：2019年2月18日
//使用物品：Object 42，人造闪电变种
//目标：尝试将Object 42作为能量来源进行采集。
//实验配置：与实验9相同。
//结果：能量成功地被全部收集。
//结论：成功了！这会省去我许多以物易物来获得电池的时间！
//
//实验编号：42
//日期：2019年3月8日
//使用物品：Object 42，黑色闪电变种
//目标：本次实验是由于有人在不知道黑色闪电的不稳定特性而将其带入房间而意外进行的。
//实验配置：不适用
//结果：能量爆裂开来，向房间内释放出一股致命的电流。然而，电流并没有杀死房间内的人，而是立刻流向一个事发时在同一房间内的一个坏掉的钟。这座钟被瞬间修复，而且似乎比以前运行的更精准了。
//结论：这什么鬼？
//
//著作信息
//« Object 41 | Object 42 | Object 43 »
//
//Footnotes
//1. 据了解，这些容器可以达到73°C的高温。
//2. 译注：希腊语εὕρηκα的拉丁转写，意为“我发现了”或“我找到了”。package wupin;
//
//public class pingzhongshandian42 {
//
//}
package wupin;
public class pingzhongshandian42{
}