//package wupin;
//
//public class pipaguo1032 {
//
//}
//Object C-32- “枇杷果”
//评分: +16+–x
//Fold
//Table of Contents
//来源：
//描述：
//特性及用途：
//相关记录：
//物品编号：C-32
//
//来源：
//枇杷果在各层级有少量流通。其对应的枇杷树生长在某个暂未证实1的层级。
//
//描述：
//pipashu.jpg
//枇杷果树的唯一图片资料，由蓝墨所摄。与其他同类树木不同，这棵枇杷树呈半透明态，边缘模糊，似乎漫漶在空间之中。
//
//枇杷果与前厅的枇杷果实相似，但具有边缘模糊，半透明状的外表。该果实不能食用，无法真正萌发，也不会腐烂。
//
//特性及用途：
//当枇杷果被埋在土壤里，它将会由半透明态完全褪色。此时土壤上方将释放一段立体影像。
//
//影像结束后，周围会弥漫起枇杷膏2的气味，持续一刻钟左右。所有闻到这种香味的肺部疾病患者都将立刻痊愈。M.E.G.公共卫生委员会正在评估利用这一特性进行大规模治疗的可能性。
//
//- 折叠
//*以下内容摘自流浪者蓝墨的口述
//半透明的东西在那个层级比比皆是，可是这样的枇杷果我还是第一次见到。它圆又大，颜色鲜艳，边缘却很模糊，就像一团发亮的云霞。
//我试着吃它，但是就像吃一个铁球，完全咬不动。可是它的母体真的是很漂亮很漂亮的一棵树。所以我把它埋在土里，希望能再长出一棵。
//就在那个时候，果子突然开始褪色。
//我起初被吓了一跳，然后惊异地看见一棵枇杷树幼苗破土而出。它长得非常快，每根枝条每片叶子都不断的抖动、伸展，在半空中盘虬起来。
//（叹息）
//那真是一棵很美的树。
//我试着伸手去触摸，但手穿过了它。原来这只是一段影像。当我了解这一点的时候，一位女子忽然从树后转出。
//她穿着绯色的古装，眉目忧郁，慈爱。她就那样抚摸着那颗枇杷树，上下打量。在她的眼角仿佛有泪，因为她在轻轻呼唤一个人的名字。她的手很白，很柔软，像那棵枇杷树一样透明。
//我一直看着她，感觉骨头里灌进了一些酸软的东西，就像酸酸的枇杷一样。
//我从来没有见过我的母亲。我的父亲在我很小的时候因为意外切出和我分开了。然后我就到了这个未知层级，东西都是半透明的，人也是。这些人养大了我，后来我知道，他们是异人的一支。但我一直没有关于我母亲的任何消息。
//可是当时眼前那个女人，她真的好漂亮，好温柔，我甚至觉得她看到了我，而且在冲我笑。
//但是我摸不到她，就像摸不到那棵树一样。影像渐渐消失了。就在那时候，我闻到一阵寒凉的芬芳，它一下子渗入身体，我不禁打了一个寒颤。说来也怪，我因为患支气管炎从小咳个没完，可自从闻到那种气味，就再也没有咳嗽过了。
//我猜这个效果很有用，所以我就带着剩下的枇杷果离开那个层级，来找你们3，顺便找找我妈妈。
//
//相关记录：
//2022.5.4 流浪者蓝墨向M.E.G.呈递了枇杷果样品。
//5.5 进行第一次演示实验。公共卫生委员会委员长马杰岩亲自到场。
//5.12起 对枇杷果化学成分的分析正在进行之中。
//- 折叠
//2022/5/5
//我去看了蓝墨用剩下的枇杷果做的演示实验，想起一些旧事。蓝墨16岁，如果我女儿还在身边，正好和她一样大。
//当然，还有那棵树，没想到我能在这里见到它，我 [字迹颤抖，无法辨认]无论如何 ……
//今已亭亭如盖矣。
//
//作者信息
//« Object C-31 | Object C-32 | Object C-33 »
//
//Footnotes
//1. 目前只有流浪者蓝墨报告过关于该层级的情况
//2. 一种止咳润肺药物，由枇杷和糖浆制成
//3. 指M.E.G.
package wupin;
public class pipaguo1032{
}