//Object C-70 - “瀑布酒精”
//评分: 
//+18
//+
//–
//X
//物品名称：瀑布酒精
//
//物品编号：C-70
//
//glass%20bottle.jpg
//装在玻璃杯里的瀑布酒精。
//
//描述
//瀑布酒精是由“后室娱乐”组织，在Level C-79中酒瀑布里的酒所提纯的出来的一种烈性“饮品”1。，瀑布酒精低毒，透明度和纯净水一致，但会散发浓烈的白酒味，蒸发速度比常规酒精更快。瀑布酒精具有强吸水性，在其蒸发时，会吸收附近质量为自身五倍的细小水滴并一同转变为气态。饮用瀑布酒精是极其危险的做法，因此，当“后室娱乐”组织的推销员向流浪者售卖这种液体时，请勿在购买后饮用，无论它们吹嘘这种液体有多么的“安全”。
//
//处理方式
//流浪者请将购买得到的瀑布酒精上交M.E.G.资源部并获取补偿。
//密封并在阴凉干燥的地方储存瀑布酒精。在不密封的情况下，请勿让瀑布酒精暴露在高温下，长时间光照会导致瀑布酒精爆炸。
//来源
//瀑布酒精可以在“后室娱乐”推销员处通过交易得到。自行提纯Level C-79中酒瀑布从而获得的酒精并无瀑布酒精的特性。暂不清楚“后室娱乐”组织的提纯方法。
//用途
//在被实体围攻的紧急时刻将瀑布酒精撒在周围，这些实体闻到酒精味就会受到Level C-79特有的“醉翁效应”影响2，之后因脱水而死。没有嗅觉的实体不会产生“醉翁效应”，但仍然会被脱水效应影响。鉴于该酒精的蒸发速度较快，使用后请立即远离现场。
//瀑布酒精可以用来给伤口消毒，其使用时应配备专用的消毒刷以防止过量的脱水。与常规酒精不同的是，瀑布酒精涂抹在伤口上不会有刺痛感。
//瀑布酒精无法被点燃，这种现象可能与其受热后蒸发速度极快有关。
//警告！千万不要饮用瀑布酒精！
package wupin;

public class pubujiujing1070 {

}
