//Object 24 - “墙壁面具”
//墙壁面具是戏剧面具，它可以在后室中不同的层级找到 （更多出现在舞台或剧院）。它们会根据佩戴者隐藏自身真实性格能力的不同而变得危险，所以应尽量避免戴上墙壁面具。
//
//Screenshot-2022-01-10-1-18-23-PM.png
//一副阿莱基诺面具。
//
//描述：
//墙壁面具的外观类似戏剧面具，通常栓在某些层级的墙上，主要出现在 Level 0，Level 68，Level 74，和Level 177中1。墙壁面具的大小不一，但无论从外观上看是否合适，在戴上后，将会变成符合流浪者脸型的样子。
//
//流浪者发现这些面具时，其通常被栓在墙上，并且需要工具来取下它们。有时则可以在其他流浪者的尸体上找到。尽管几率很小，但他们也可能单独出现在某些层级的椅子或地板上。面具的种类各异——流浪者有时可能会同时发现多种面具，但根据流浪者隐藏自身真实性格的能力，他们通常只会被一种面具所吸引。一旦戴上面具，流浪者就会变得富有攻击性，从而无差别的攻击其他流浪者和实体。
//
//流浪者只有饮用杏仁水才能抑制戴上墙壁面具的想法。
//
//面具种类：
//为了迎合流浪者的人格，墙壁面具有不同的种类。因此，以下的面具种类是根据佩戴者隐藏或掩盖他们真实性格的程度而分类的。
//
//全面：2
//哥伦比亚面具：吸引流浪者最多的面具种类，哥伦比亚面具会覆盖佩戴者一半的面部，看起来优雅多彩。该面具的佩戴者和佩戴前并无二异，但他们的行为将更加神秘。在击杀流浪者和实体时，他们会在悄无声息地绕到落单目标的盲区后将其杀害，并且将尸体藏起来。
//
//布塔面具：布塔面具没有遮盖嘴部的部分，外观呈矩形， 整体颜色大致相同且被漩涡花纹覆盖。 这种面具的佩戴者会变得咄咄逼人，并且不喜欢与他人争论。佩戴这种面具的人更倾向于使用钝器杀害目标。
//
//潘塔罗娜面具：这种面具的特点是有一个相当大的，类似于鸟喙的钩鼻，它会覆盖佩戴者的上半面部，并带有一对斜视的眼睛。这种面具的佩戴者的行为看起来十分可疑，他们会尽力的伪装成正常人的样子。潘塔罗娜面具的佩戴者的性格会有明显的变化，他们在和流浪者交谈时会不断地说出有关后室的事情，以此试图让流浪者转移对他们的注意力。当被问及有关个人隐私的问题时，他们会变得偏执并且试图回避谈话。如果他们发现自己被跟踪，他们便会以最快的速度找到并杀死跟踪者。因此，建议远离潘塔罗娜面具的佩戴者。
//
//注：根据M.E.G.的实验结果，全面的佩戴者都是自愿戴上面具的，而并未受到物理或精神上的强迫——尽管他们完全有能力拒绝这么做。
//
//这可真是大错特错。
//实验？由M.E.G.进行的试验？他们在拿无辜流浪者的生命做实验？他们为什么要这么做？我以为我们正在尽量减少人员伤亡……她是这么跟我说的，凯特琳也是这么跟我说的……他们在试图了解这些面具……不，不对……他们在利用面具获取人们的秘密。这不是我工作过的地方。这不可能，对吗？
//
//半面：
//沃尔托面具：沃尔特面具整体为白色，能够覆盖整个面部，上面常有金色的漩涡花纹。这种面具的佩戴者会变得狡诈多疑。但总体而言，他们的行为还是和正常人一样的。沃尔托面具的佩戴者和哥伦比亚面具的佩戴者有着一样的神秘行为，但在杀人后不会隐藏受害者的尸体。
//
//狐妖3面具：狐妖面具是一种有着各种颜色的狐狸面具。通常覆盖佩戴者一半的面部，这种面具的佩戴者会变得鬼鬼祟祟，甚至有点调皮，而且非常轻浮。但他们会对个人隐私闭口不谈。该面具的佩戴者会引诱他的受害者，并且使用一种极为快速的手法杀死他们。
//
//阿莱基诺面具：阿莱基诺（或哈勒奎）面具有着各种颜色，通常有着短鼻和弓眉，偶尔面具会有一个大的头饰或者衣领以搭配铃铛。带上这种面具的流浪者会奇怪地大笑起来，通常情况下不能解释他们的乐趣。阿莱基诺面具的佩戴者会做出鲁莽，不合时宜的决定，不断为自己的行为找借口。他们的杀人方法很奇特——他们会走到受害者面前，然后给他讲一个笑话，如果受害者的反应没有让佩戴者满意，受害者将会被残忍地杀死。
//
//注：以上面具的佩戴者们仍有机会摘下面具，但他们需要极强的意志力来抵抗这些面具对他们的影响。
//
//无面：
//布斯金4 面具: 该面具整体为白色, 有着黑色的酒窝和夸张的皱眉。除了佩戴者的个性会完全暴露外，他们会变得易怒，不耐烦，并且开始不停地抱怨。布斯金面具的佩戴者比哥伦比亚面具的佩戴者和沃尔托面具的佩戴者更加暴力和邪恶。
//
//恶鬼面具：恶鬼面具的原型为前厅中日本的一种因为亦正亦邪而出名的鬼怪。戴上恶鬼面具的流浪者会获得强烈的主观意识（除非他们在戴上面具前就有这种意识），并且热衷于表达他们对某些事情的看法。恶鬼面具的佩戴者更喜欢以那些作恶大于作善的流浪者为目标，当受害者被抓住后，他们会被佩戴者大吼大叫着杀死。
//
//萨科5 面具：萨科面具是墙壁面具中最危险的一种，其外观与布斯金面具的设计相似，但是原本夸张的皱眉颠倒了过来。如果遇到了萨科面具的佩戴者，要不惜一切代价地避开他们。佩戴者会变得极端的野蛮和暴力，并且以虐杀其他流浪者和实体为乐。萨科面具的佩戴者的杀人方式十分混乱，他们会以任何没有露出笑容的流浪者和实体为目标。并且他们在杀死受害者后将会露出歇斯底里的狂笑。
//
//他们怎么会让这种事发生这么多次?
//到底是怎么回事？ 他们告诉我一切都会好起来的，说什么我们有人，有武器， 我们会没事的。 现在他们在使用那些面具……作为一种增员的方法？我们见到了这些佩戴者的行动，这些疯子杀了很多我们的人……难道他们不明白如果越是放任不管，越会有更多的人死去吗？
//
//对墙壁面具佩戴者的防御方法
//有三种已知的方法可以阻止墙壁面具的佩戴者的袭击，但要注意这些方法需要流浪者拥有良好的体能，过人的机敏和足够的警觉。
//
//方法 1：说服佩戴者自己摘下面具。此方法仅适用于全面或半面的佩戴者，注意你的措辞，并留意任何会让佩戴者感到反感的事物。 如果运气好的话，他们会自己把面具摘下来，这样面具的效果就会消失。
//
//别听他们的花言巧语，杀了他们。
//这和他们跟我，跟我妹妹说的一模一样。他们只会说谎。
//
//方法 2：运用暴力手段将他们的面具摘下，这可能十分困难，所以要谨慎地尝试这个方法。此方法仅适用于半面的携带者。
//
//真是个笑话。
//他们告诉我对”无面“的佩戴者也许可以尝试第二种方法……来，告诉我，我的左手怎么了？
//
//方法 3: 击杀佩戴者。这个方法同样也适用于无面的佩戴者。有些时候，佩戴者的脑中将只剩下杀戮，这时和其进行任何交谈都是无效的。在这种情况下请使用任何可能的手段杀掉他们。
//
//你们说过我会没事的。
//我敬爱着你们，相信着你们。你们告诉我只是暂时戴上这玩意而已。但是现在这玩意用可怕的力量控制了我，你们却觉得我永远带着这玩意才好，你们这群骗子。骗子。天 ̶̡́ ̸̛̹̭ ̷̬̹̟̄͆‍̷͔̫̎ ̴̜͇̥̋̄ ̸͍͇̣̉杀 ̷̧̏͌ ̴͓͇̀͛ ̶̓̂ͅ‍̵̝̏ ̶̨̤̇ ̶̳̘̍̽的 ̵̭̥̠̩͚̃͊̚͜͝ ̵̡̛̹͛͗̆͘ͅ ̶̡̠̰̮̲̬̅̒̎̆̚ ̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃ ̴̨͕̯̹͕́́͒̐ ̷̻̰̙̪̦̬̏̓̅́̕骗 ̸̡̫̣̊͛̀̿͜ ̸̗͌͌̓͒ ̵̨̗̻͓̕ ̴͍͑‍̶̼̲͔̦̒̔̇͝ ̶̬̍͜͝ ̷̡͕̅子
//
//package wupin;
//
//public class qiangbimianju24 {
//
//}
package wupin;
public class qiangbimianju24{
}