//package wupin;
//
//public class qianghuayizhi1039 {
//
//}
//Flesh C-39 - “强化义肢”
//
//
//评分: +18+–x
//躯器编号：Flesh C-39
//
//代价：中
//
//安装位置：体外
//
//介绍
//强化义肢是一种针对躯体强化的辅助型装置。
//
//强化义肢总体分为三个部分：
//
//第一部分为由体外组织培养得到的主体，我们会进行适量的基因编辑以强化其机能；
//
//第二部分为改进后的接口，能够迅速使义肢充血并精准地连接神经；
//
//第三部分为用于安装功能性模块的外接插口，我们通常会直接为您提供已装载额外模块的义肢，擅自添加接口或使用具有接口且未装载额外模块的义肢可能导致接口感染。
//
//强化义肢和使用者共生，使用时会消耗使用者的体力；在闲置时则会快速脱水成为“种子”并休眠以减少能量消耗。
//
//功能
//强化义肢可以直接与您的神经连接，并完全由您掌控，安装义肢后，您的体能会得到大幅度加强，包括力量、速度、防御力等多方面的提升。
//
//强化义肢除强化使用者体能外，还能够为您提供通过额外接口装载的其他设备：血肉军火、骨质刀刃甚至是另一条义肢！
//
//但您也应当注意：使用强化义肢会大幅度增加能量消耗，您可能需要大量进食以维持正常活动。
//
//说明
//使用方法：
//
//一、取下您希望更换的肢体，此过程推荐使用我们生产的截肢器（如果您已经失去了该肢体，请省略这一步）；当然，您也可以在其它部位手动制造接口（我们建议由我们的工作人员在我们的处理站进行这一操作）
//
//二、将“种子”嫁接到断口处。
//
//三、几秒钟后“种子”便会充血成为义肢并完成神经对接，此时您便可以安全使用义肢。
//
//四、义肢无需额外训练以掌握使用，您只需要像正常地使用四肢一般使用即可（额外设备请参考其所对应的说明书）。
//
//五、当您不需要使用义肢时，使用截肢器取下即可；没有截肢器的客户可以在我们的处理站拆卸1。
//
//注意：
//
//一、使用义肢前，请确认其没有失去活性，您可以使用少量血液进行测试；
//
//二、义肢可循环使用，但请做好消毒工作并妥善保存以避免其感染或失活；
//
//三、部分义肢的接口可能不够牢固，如果出现义肢松动、接口感染等情况，您可以要求治疗服务或退、换货。
//
//获取
//目前其仅可通过流浪商人处购买。
//
//作者信息
//
//« Object C-38 | Flesh C-39 | Object C-40 »
//
//Footnotes
//1. 如果情况紧急，您也可以尝试直接拔下来，但这么做会提高感染的概率。
package wupin;
public class qianghuayizhi1039{
}