//package wupin;
//
//public class qianshuizhong1041 {
//
//}
//Object C-42 - “潜水钟”
//评分: +9+–x
//物品编号：C-42
//
//diving%20bell-1
//潜水钟操作舱被拆解后的图片。
//
//描述
//潜水钟是存在于Level C-51的一种外观为钟形的深潜装置，最大下潜深度可达9000米，但其在水平方向几乎无法移动。
//
//一台小型潜水钟可容纳1~3人进行下潜，而大型潜水钟可同时容纳30~40人在水下进行长期生存。
//
//diving%20bell-2
//潜水钟操作舱内部的图片。
//
//结构
//潜水钟采用钟形结构设计，此设计以牺牲水平移动的能力换取了极大的抗压能力以及下潜速度。每个潜水钟内部都会配置生活舱与操作舱两种舱室，并拥有小型生态自循环系统以供给乘员生存。另有特殊型号不在此处一一列举。
//
//潜水钟底部装有多台未知原理的发动机，以杏仁水或大量海水为燃料，能够为整艘潜水钟进行能源配给。
//
//用途
//M.E.G.共计从Level C-51回收了三台潜水钟以及一台大型潜水钟，其中两台用于对层级中的深海区域的探索，一台用于原理分析，一台大型潜水钟用于在层级中的深海区域设立前哨站。
package wupin;
public class qianshuizhong1041{
}