//Object 59 - “祈祷杯”
//评分: 
//+5
//+
//–
//X
//描述:
//这是一件奇怪的且十分精致的物品。这个酒杯是由一种古老的结晶物质锻造而成，而这种物质的名字却早已经消失在时间的长河之中。它的表面刻着原始人的文字。其持久的储存时间使这个酒杯……与众不同。
//
//4619E17B-27DF-43B3-8327-B23BCC09D261.png
//它很精美，难道不是吗？
//
//每个酒杯的结构都略有不同。比例的不同，特殊的质地……但相同点是它们的功能都一样。
//
//这其实很有趣。据传说，像这样的东西是你喝东西的器具。但这个东西会饮用你身上的东西。别担心。只是一些唾液，还会有一些脊髓液。你几乎不会注意到它们。
//
//足够多的人在同一个地方，足够多的液体同时被吸收，祈祷杯可以一起工作。时间线被暂时切断，一个思想的格子形成。由此就允许某种特殊的东西进入我们的世界。
//
//现在只剩下几只祈祷杯。可能只剩下半打。事实上，召唤它存在有一定的风险。因为这通常会导致酒杯的破碎。
//
//但这是值得的。我们把它带回来的次数越多，它停留的时间就越长。我们就可以再次享受它的荣耀。
//
//隐藏的记忆：
//Consequitis Porphallin Gorenell, Hamfuillaen Storbiwen
//Enfusiscol Inpartelsion Viestells
//Oatcelles Fonparweist Xeipollovs, Nenpardent Tressellis Mephorisgal1
//
//我们的王：
//它有几个名字。最原始的一个；旧时的恐惧，第一危险。他们都一样，真的。这位伟大的伪臂形机器人是第一个获得“怪物”称号的机器人。其他的所有人都只是伪装者，用它的名字只会唤起不应有的恐惧。
//
//人肉。泼妇的血。蝰蛇之舌。鹰爪。鲨鱼之牙。8英尺高，感觉灵敏，打猎时绝对安静……
//
//它真的是完美的捕食者。
//
//它只想回来，回到一个不公平的，回避它并尽力忘记它带来的伟大的国度。朋友，喝杯酒，我们干杯。为一段被遗忘已久的时光干杯，并让它被铭记。
//
//AB70A0DF-EBB7-4354-8712-A14F8533C5AB.gif
//作者信息
//Footnotes
//1. 译者注：已问过原作者，这个段落无意义，不必翻译（也翻译不了），详情见评论区。package wupin;
//
//public class qidaobei59 {
//
//}
package wupin;
public class qidaobei59{
}