//Object C-56 - “切忆机”
//评分: +13+–x
//编号： Object C-56
//
//photo-1631373581820-9c468b663fa4?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80
//一件 Object C-56。
//
//分布：
//于后室C层群少数层级有分布。列表如下：
//
//Level C-67
//Level C-91
//Level C-148
//Level C-170
//这些层级无一例外具有至少一个非常难以实现的入口或出口。更多分布地在探查中。
//
//描述
//切忆机外观类似前厅的手电筒。
//
//物品末端的一个小形开关可以操控物品的开关。打开物品后，物品会发光，并且在离物品前端距离4.1米的空气中产生一块所有方向都可以看到的光雾。光雾的形状是球面上的矩形，若将它投影到中心的切面上就将成为2.0米高、0.9米宽的矩形。无论怎样旋转物品本身它都会投影出这样的大体竖直的矩形，但它发出的光会被其他物体所阻挡。
//
//物品上有五个可以转动的轮，其中四个所有层群的代码与有3位0~9的数字。从上到下看，组成一个层级的完整编号。第五个轮标注着“换档”。
//
//将切忆机的每一个部分都切出到物品的外部，会发现切忆机的内部组成和手电筒的构造基本一致。
//
//性质
//切忆机的性质较为复杂。
//
//对于每一个流浪者，光雾投影中的景象一般不同。当轮调到流浪者一度经历过的层级时，光雾投影将会呈现出流浪者第一次进入层级时初始所看到的景象，而且完全黑白。这时光雾可以直接切入。
//
//转动“换档”轮，可以根据时间顺序选择切入的时间点。例如，“换档”轮偏移一格，就可以显示流浪者第二次切入层级的景象。
//
//对于未到达过的层级，光雾不会显示出任何图像，也不能进行切入。这种状态的切忆机对照明的意义不大，因为仅能显示一块光雾。
//
//切入有景象的光雾将会让流浪者达到景象所示的层级，切入点也与之前进入层级时的地点相仿。但是此时流浪者似乎不再存在实体，而是只有思考能力和视觉的一个“旁观者”。这个视角不能移动，但是可以以一种奇怪的方式旋转（流浪者们描述为“需要你在脑子里想象自己失重时转体的图景，而且很不好操控。”）
//
//这时一个时间异常会发生。为了便于描述，我们将使用切忆机进行切出的时间点称作切点，而流浪者第一次经历层级的时间称为忆点。切入层级的流浪者意识将会经过从切点逐渐时间回溯至忆点，比如看见层级日月倒转，实体游荡后退，并且在忆点临近时，看见自己的身体向视觉点倒退而来。
//
//这个过程中流浪者不会感到身体不适和任何饥饿感，不会入睡，但是可能会因为过于无聊和孤独而感到厌烦。但是我们提醒您：切忆机一旦使用无法后悔。谨慎选择。1
//
//在忆点被回溯达到后，流浪者将可以自由行动。以并非严谨的描述，流浪者达到了与现实后室完全相同的时间线，但是根据流浪者的行为，它会逐渐从现实时间线中脱离。流浪者将度过一段时间，直到切点。
//
//切点达到前的一小段时间，流浪者面前出现一块光雾，而且产生强大的吸力。流浪者将会吸入光雾并切出至切点。此时流浪者回到了原来的时间线。
//
//若流浪者死亡，在死亡的一瞬间将会突然在切忆机的切点出现。这种状态的流浪者通常表现出巨大的痛苦。
//
//在外界看来，流浪者就似是进入光雾然后立即返回。返回后切忆机将会直接停止发光，开关弹回原位，选择器弹回“I-0-0-0”模式。而且它似乎立即消耗了电量的20%。每一个切忆机仅能使用5次，使用常规手段更换电池和使用切出手段更换电池都没有得到成功。
//
//简略言之，切忆机可以使流浪者进入一个另外时间线，先“倒带”到一个特定切入时间点，再进行到“现在”，并在“现在”退出时间线。
//
//但请注意，本物品回到的时间线内空间形式并不一定于真实时间线一致。
//
//用途
//回到过去练习速切，而且不会影响现实世界中的生存以及时间进行。
//对于不同的流浪者可能会用途不同。
//速切玩家对于物品管制措施
//速切玩家提醒：本物品可以交易，但于速切竞赛中请遵守具体规则，违者按规则处罚。在一个有时间的速切记录中建议提及使用切忆机的练习次数。禁止在速切途中使用该物品。
package wupin;

public class qieyiji1056 {

}
