//package wupin;
//
//public class qingyouzhiju1031 {
//
//}
//Object C-31 - “清幽之菊”
//评分: +17+–x
//物品编号：C-31
//
//“清幽之菊”是后室C层群中特有的物质。
//
//20220509_183839.jpeg
//清幽之菊，由未知流浪者拍摄。
//
//描述
//清幽之菊的平均直径约2.5cm，平均重量为0.64克，植株平均高4厘米，散发出一股“清香”的味道，但闻过的流浪者都表示用“清幽”形容更贴切。
//
//清幽之菊的异常特性表现于它对周围生物的影响：该物品能在10分钟内把半径11.18m内任何受伤/死亡的植物（包括C层群植物类实体）恢复到最佳状态；对于人类等动物（包括C层群已知动物类实体）则须半小时左右以恢复其最佳状态。对病毒/细菌的侵害尚未见到成效。增加菊花数量并不能加快恢复速度。
//
//清幽之菊是一次性物品，每颗菊花的辐射能量只支持使用一次，使用后辐射量将会降低至忽略不计，并丧失明显治疗效果。
//
//据研究，清幽之菊似乎能散发肉眼不可见的射线，由该射线产生上述效果，任何无机物均可阻挡该类射线传递（如：玻璃、金属、布等材料）。
//
//保存方法
//请将清幽之菊密封保存，以免浪费宝贵资源。
//
//清幽之菊应在干燥避光环境下保存，否则可能会失活。
//
//尽量不要将清幽之菊保存在较多实体的层级，否则后果自负。
//
//来源
//已发现的清幽之菊均生长在各个层级富含无机物和腐殖质的土壤中，多生长在干燥阴凉的环境。尚未发现层级对清幽之菊的分布造成太大影响，但无论在哪个层级都极为罕见。
//
//用途
//清幽之菊主要用于自我疗伤，属于救治生物类物资，在情况允许时请优先考虑使用其他治疗物资，以节省该物品资源。使用时请进入射线范围。目前尚未发现其副作用，请放心使用。
//
//- 为何不尝试一下呢？
//使用过的菊花可以用来泡茶，味道还不错。
package wupin;
public class qingyouzhiju1031{
}