//package wupin;
//
//public class qingsongkele1040 {
//
//}
//Object C-40 - “轻松可乐”
//评分: 
//+27
//+
//–
//X
//物品编号：C-40
//
//轻松可乐是一种拥有镇静作用的碳酸饮料。
//
//234b3c431bf69908.jpeg
//三瓶摆放在一起的轻松可乐。
//
//描述
//轻松可乐为一种无色透明的，会发出彩色光芒的碳酸饮料，其光芒的颜色会随着其口味而变化，以下是目前已知的口味以及对应的光芒颜色：
//
//红/蓝光：味道类似于前厅中普通的可乐，并带有苹果香气。
//紫/黄光：相较于红蓝光的可乐，其味道较酸，并带有樱桃香气。
//绿光：相较于红蓝光的可乐，其味道较苦，并带有中药的气味。
//白光：味道类似于前厅中的盐汽水，没有特殊香气。
//橙光：味道较辣，带有浓郁的辣椒香气。
//轻松可乐具有和霓虹眼镜类似的特性，可以使盛放轻松可乐容器的轮廓出现粉色的霓虹彩线以及一些装饰性的光条。（如上图）
//
//轻松可乐一般被灌装在与其发出光芒颜色相同的易拉罐中，其材质未知，且侧面通常会通常会写有“slow soda”字样。这种易拉罐和霓虹胶体类似，若将其放入水中，则会浮现出“后室娱乐”的logo和“博君一笑”的字样。
//
//logob.png
//浮现的图像。
//
//当流浪者饮用轻松可乐后，会感觉到镇静和放松。但饮用者的感官会变得迟钝或者过敏，同时眼前的景物会变成类似于前厅中20世纪初的合成器风格。这种幻觉会在半小时内逐渐减弱直至消失。虽然经过研究，轻松可乐并无任何化学成分会使人上瘾，同时也未发现任何戒断反应，但其似乎有着心理成瘾性，上瘾者会把饮用轻松可乐的体验当成他生存中的重要内容。并开始劝说周围的人一起服用。
//
//当短时间内累计饮用超过五升轻松可乐后，饮用者的身体会开始发出和轻松可乐颜色一致的光芒，同时会产生程度不定的精神分裂，这通常会导致流浪者产生焦虑、紧张、愤怒、沮丧、悲伤、痛苦等负面情绪，若负面情绪过于严重，饮用者可能会开始自残甚至自杀1。故建议不要在短时间内饮用过多轻松可乐。
//
//用途
//轻松可乐也可以作为镇静剂使用，但由于其特殊性质，故建议不要对其产生依赖性。
//
//获取
//轻松可乐通常可以在Level C-70的商店中以及“后室娱乐”的销售员手中获取。
//
//记录
//以下是对一名轻松可乐上瘾者的记录。以此来劝告流浪者不要饮用过多轻松可乐。
//
//- 隐藏
//记录时间：201X年5月4日
//记录物品：Object C-40
//记录者：M.E.G“测验者”部门博士王右
//记录对象：一名对轻松可乐上瘾的流浪者
//记录概要：该流浪者在饮用了约10罐（约为5升）的轻松可乐后，
//由于自身开始发光，故来到了M.E.G“Beta基地”寻求帮助。
//
//记录开始
//
//流浪者被带至了王右博士的办公室中被询问相关事宜。
//
//王右：朋友，你这浑身发光是怎么弄的啊？
//
//流浪者：我，我也不知道…我只是多喝了点这个。
//
//随即，流浪者向王右出示了他喝剩的饮料罐。
//
//王右：这是什么，谁给你的？
//
//流浪者：是…是一个带着发光眼镜的人，自称是什么“后室娱乐”的销售员。
//
//流浪者的瞳孔突然开始变大、面色潮红、肢体开始震颤。
//
//王右：你怎么了？身体不舒服吗？
//
//流浪者：我现在不知道怎么回事……我突然……有点想家了……
//
//随即，流浪者开始哭泣，嘴里不断小声念叨着什么，可以隐约听到是有关于他的家人
//
//王右：这……
//
//王右刚想安慰流浪者，便被其突然的话语打断了
//
//流浪者：我想……我的女儿了……我切到后室的时候……她才3岁……我好想……见她一面……
//
//说罢，流浪者便毫无迟疑的从办公室的窗口跳出，随后落在地上。约半小时后，该流浪者
//在Entity C-99的影响下复活，并在M.E.G的劝导下戒掉了轻松
//可乐
//
//记录结束
//
//作者
//« Object C-39 | Object C-40 | Object C-41 »
//
//Footnotes
//1. 但这种行为被证实并非由负面情绪所引起。
package wupin;
public class qingsongkele1040{
}