//Object 77 - “全自主便携式收音机”
//radio2.jpg
//该收音机的正面图。
//
//描述：
//全自主便携式收音机表现为一款标准便携式收音机，除右侧印有字母Q外似乎没有其他品牌标志。收音机没有改变频道的拨盘1，且只能播放一个频道，即一个看似长时间运行的脱口秀节目，名为“与藜麦聊天”。更多有关该广播的细节将在下面叙述。
//
//该物品似乎出现在随机层级上的人类聚居地中，且只在所有人的视线范围之外时自发实体化。目击者称，该物品出现在他们的背后、拐角处或关着的门后。
//
//在被至少一名人类注意到后，该物品会开始播放上文提到的节目，即“与藜麦聊天”，持续约30至120秒。广播结束后，收音机将保持安静。在离开所有人视线后，它会消失并在 1 到至72 小时内重新出现在其它地方。 目前认为该物品具有唯一性。
//
//主持该节目的“藜麦”似乎具有独特的世界观。他对任何特定主题的知识均有限，而且经常出现错误。“与藜麦聊天”的剧集通常荒谬且脱节，几乎没有重复出现的话题。过去节目涉及的话题包括岩石材料的“脆度”排名、约会建议、降神会以及对食人的好处的讨论。
//
//值得注意的是，“藜麦”从未在广播之外被看到或听到过。截止目前没有任何关于面对面接触该个体的报道被证实。
//
//发现：
//该物品最初由一名匿名流浪者发现于Level 2。当被要求进一步描述这段经历时，该流浪者称：“我真的不太知道是什么情况。我转过身，它就出现在那里。然后节目开始了，大概持续 30 秒，然后我一转身，它就又消失了。我就知道这些了。”
//
//记录到的广播节目：
//以下是一系列节目“与藜麦聊天”的音频文本记录。其他的音频文本可以在这里找到。
//
//音频文本1：
//“大家好，欢迎来到‘与藜麦聊天’第230期！今天，我想谈谈混凝土。 我认为混凝土可能是迄今为止发明出来的最好的东西之一。 我是说，它是一种万能材料！ 用它做一个三明治，把你的朋友包里面——我是指，哎呀，你可以用它盖一座房子！ 我曾经认识一个人，他每周都会寄给我 3 块干脆的混凝土，从不间断。 看到它们从墙上飞过来掉在工作室的角落并发出 咯啦 的声音是我每周的快乐时刻。 多好的伙计！投资混凝土吧！听从你内心的声音！”
//
//音频文本2：
//“大家好，欢迎来到‘与藜麦聊天’第80期！今天，我们来读一点有关塔罗牌的东西。”
//
//[藜麦似乎在某种形式的储存中随意翻找。]
//
//"让我看看……呃，每日一卡，是……战车！哇哦，这些人是全裸的！哇哦，多好的一张卡。另外，我一丁点儿都不知道它是什么意思。我猜就是自己随便解读吧！听从你内心的声音，还有，记住战车！”
//
//音频文本3：
//“大家好，欢迎来到‘与藜麦聊天’第124期！世界上有多少液体呢？水，血，油……还有什么？我想这个已经有一会儿了，我觉得应该至少还有好几个。世界还挺大的，所以我猜，在日本或者别的什么没人知道的地方肯定有人在发明什么新液体，像‘液态灰尘’之类的。等等，我刚刚是不是发明了个新液体？嚯，这挺好的。伙计们，听从你内心的声音！”
//
//音频文本4：
//“大家好，欢迎来到‘与藜麦聊天’第59期！今天的话题是：花椰菜。这他妈是什么东西？是水果吗？还是蔬菜？……是种矿物质吗？这到底是什么玩意儿啊？没人给我解释过这个。这让我毛骨悚然。”
//
//[语无伦次的嘟囔]
//
//“……该死的花椰菜，假冒伪劣的西兰花……噢，该死，节目还在播呢。呃……听从你内心的声音。”
//
//[更多语无伦次的嘟囔]
//
//“……花椰菜。甚至——等等，不，我按过了——”
//
//[节目中断]
//
//音频文本5：
//“大家好，欢迎来到‘与藜麦聊天’第312期！你们找到我害怕什么吗？鲸鱼。是的，它们一般不会伤害你……但它们完全可以。天哪，一想到这个我就胆战心惊。你们知道鲸鱼有毛吗？我知道你们在想什么，这他妈啥玩意儿啊，是吧？鱼不能有毛！你不是人，你个笨鱼！听从你内心的声音，除非你是鲸鱼！”
//附注：此次节目后，该收音机在随后的8个月中均未实体化，远超正常间隔。
//
//音频文本6：
//“大家好，欢迎来到‘与藜麦聊天’第313期！我想了一段时间，想到了一个对付鲸鱼的办法。藜麦建议你：如果在沙滩上看见鲸鱼，快走！奇怪的是没人讲过这个，你们知道吗？人们都害怕鲨鱼，但没人担心鲸鱼。谁来阻止一下鲸鱼！听从你内心的声音！”
//附注：该次节目播出于该物品消失8个月后初次回归时。
//
//音频文本7：
//“大家好，欢迎来到‘与藜麦聊天’第27期！我不觉得全球变暖有什么大不了的。 我的意思是，我不喜欢一直待在冷的地方。 我认为没有人喜欢这样。 考虑到这一点，让地球变暖有什么问题吗？那样真是太好了！我，藜麦，支持全球变暖，你也应该支持！支持全球变暖，融化冰山！听从你内心的声音！”
//
//音频文本8：
//“你好，欢迎来到‘与藜麦聊天’第30期。 让我们看看‘今日塔罗牌’是哪张……看起来是魔术师！在我看来他长得不太像魔术师，更像是一个收破烂的！为什么他有那么多东西？他为什么拿着蜡烛？那又不是魔杖，傻瓜，你会在试图召唤恶魔时把自己点着的。幸运的是，我可以安全地做到这一点。看好了！”
//
//[藜麦开始背诵未知来源的的咒语。远处传来女人的尖叫声，紧接着是锁链的叮当声。]
//
//“嗯，挺成功的!听从你内心的声音！”
//附注：上述咒语是否成功召唤恶魔尚不清楚。然而，该次节目的听众称接下来的两个小时他们可以感受到嘴里有血的味道。
//
//作者信息
//« Object 76 | Object 77 | Object 78 »
//
//Footnotes
//1. 收音机正面的两个拨盘均可调节音量。此外，它们只能调高音量。package wupin;
//
//public class quanzizhubianxieshishouyinji77 {
//
//}
package wupin;
public class quanzizhubianxieshishouyinji77{
}