//物品编号：3
//出现地点：多地 全境
//稀有度：稀有
//用途：危急时使用 无关
//描述
//描述：旧
//描述：旧
//驱笑剂是一种极其稀少的液体，可以用于击退笑魇。其作用机理、成分与出现的原因都尚未知。然而，由于其能够击退后室中最危险的实体之一，我们愿意不计一切代价收集驱笑剂。因为缺乏有效的获取途径，我们的基层人员在此方面付出的巨大精力都收效甚微。为此，我们已与失落一族达成协议，共同收集驱笑剂。
//
//驱笑剂本身是一种几乎透明的液体，其外观与杏仁水基本相同。其成分难已探明，大致上由杏仁水和数种其他不明物质结合而成。目前，我们正在与失落一族合作研究驱笑剂的具体组成成分。
//
//驱笑剂具体的效果取决于其具体的使用量。据统计，一小滴驱笑剂即可驱散半径约20米内的笑魇，并使这些笑魇陷入一段时间的虚弱期。要发挥出驱笑剂最大的效力，需要让其与笑魇直接接触。直接接触到驱笑剂的笑魇将会立刻从流浪者的视线中消失，并永远不再出现在这一流浪者面前。
//
//描述：更新
//在事件A发生后，随着符文A - EPE-500-SRH被破译，所有驱笑剂都丧失了作用，且没有恢复的迹象。出现这一现象的原因未知。在发现了某些文件后，发生这一现象的原因已大致被确认（见附录2）。目前，我们已经知晓了驱笑剂的确切成分与制作方法，其具体内容在下文中（见符文A - EPE-500-SRH)。
//
//附录1：失落的发现
//于2009年7月4日从失落军团寄来的信件：
//
//关闭文件
//你好，Vera。抱歉，我们不能告诉你，我们是怎么知道你的名字的。但，我们现在正在急切地联系你。最近，在Level 500内付出的努力终于有了收获。我们在这里找到了一个全新的区域，是一片水域。这片水域看起来是无限延伸的，上面偶尔浮着一些石头。但，我们还是在这里有所发现。第一次进入这里时，有一块很特别的石头会释放出神秘的符文光辉。
//
//只要不碰到水面，就可以轻松地渡过水域。现在，可以透过水面看到水下潜伏着的许多大型生物，里面有一些可以从很远的地方就看到，而且一眼望不到头。这些东西已经被标记成“超出正常”的范畴，一旦靠近它们，甚至只是从上往下看一眼，都会被它们拖入水下。但是，我们所感兴趣的符文似乎来自于这片水域里水的力量。
//
//你也许会对这里的符文感兴趣的。因为最近我们跟分裂者的冲突，我们不可能告诉你让你感兴趣的到底是什么；但是，我们非常愿意在Level 628和你会面，进一步地讨论这些。如果你想见我们，只需要去沙漠等着就可以。我们会在五分钟以内找到你的。只要是在下一个月以内随时都可以。谢谢。
//
//近期在与失落一族的合作中，发现了一种与驱笑剂直接相关的符文；确切的说，是一种能够制作驱笑剂的符文。在“薇拉”符文修复小队与失落军团建立起信任关系后，于Level 500内发现了这种符文。以下的日志记录了“薇拉”小队的队长Vera Trixie与失落一族中一位匿名者的初次交谈。
//
//关闭文件
//通话日志
//通话日志开始时间：2:34 P.M.。
//
//参与人员：Vera Trixie、失落军团成员（未知）。
//
//通话地点：Level 628（沙漠）内的一处未知地点。
//
//通话日志概要：以下通话发生在失落军团成员通过信件谨慎地联系到Vera之后，描述了他们在探索EPE-500-SRH时可以起到的相互作用。
//
//记录：在失落军团成员出现在沙漠内后，日志开始记录。
//
//<日志开始>
//
//在一段距离以外，可以看到一双脚的主人轻轻地走来。只能听到风声。在他接近后，逐渐可以听到脚步声。这双脚的主人停在了音像记录仪附近。
//
//身份不明者：你好。
//
//Vera：早上好。
//
//身份不明者：现在不是早上。
//
//Vera：我知道。现在请告诉我找我的原因。
//
//身份不明者：你不打算用好一点的态度吗？
//
//Vera：我不想。告诉我，你找我来要做什么。
//
//身份不明者：我知道了。等一下。
//
//风声中混杂着少许沙沙声，身份不明者取出了一张图画。
//
//身份不明者：我肯定你能猜到这是什么。
//
//Vera：毫无疑问，这是一个符文。特征太明显了，而且——
//
//身份不明者：这肯定是一个符文。而且从它周围存在的光圈来看，它具有很高的价值。
//
//Vera：我明白。但是证据呢？
//
//身份不明者：我们已经找到了。简单地说，它的威胁等级太高了，我们难以自行处理。
//
//Vera：细说。
//
//身份不明者：可怕的远古生物。它们就潜藏在周围的水里，保护着那块石头。
//
//Vera：可以用我能理解的话说明一下吗？
//
//身份不明者：在Level 500里有数不清的神秘生物潜伏在水中，我们没办法绕开它们。它们已经杀死我们中两名有力的战士了。我们需要你的帮助来拿到那块石头。只要拿到它的一小部分就行。
//
//Vera：嗯。
//
//身份不明者：我还有要事在身。明天我们在Level 178碰面。什么时候都行。在那儿等着。
//
//Vera：很好。我会和我的小队商量我们去不去的。
//
//身份不明者：最多再带上五个人。下次别再记录我们的交谈了。
//
//Vera：等、等一下，你是怎么——
//
//身份不明者：我知道的比你想象中的要多得多。
//
//Vera：行。
//
//未知的身影离开了。他走得非常迅速，轻松地跨过了附近的障碍物。1
//
//Vera抓起了记录仪，造成了强烈的电流噪音。
//
//<日志结束>
//
//后续：在与我的队员协商过后，我们有点犹豫地选择了信任失落一族。我们将于明天清晨前往Level 178，并带上标准的符文探索装备。由于我们对失落一族的性格并不清楚，也不知道它们实力的全貌，我们最后投票决定不再记录任何与失落一族的交谈。
//
//Level 500探险报告
//以下报告由Vera Trixie撰写，简要概括了Level 500内发生的事件。
//
//关闭文件
//我们先进入了Level 178。最开始，我们尽量地不做任何多余的举动，因为我们不知道这样是否会引发不必要的麻烦。在等了大约45分钟后，我们开始向随机方向移动，直到最后来到了这一层级的厨房里。在我们进入厨房后不久，两道身影出现在了视野中。
//
//在那些身影靠近我们的同时，我命令小队举起了武器。我们小队的武器大部分都是临时制作的，不算锋利；只有我有一把还算像样的刀。随着对方越来越近，我发现他们和我昨天见到的那人看起来简直一模一样。我最终决定还是让全体放下武器。对面似乎也放下了武器。这两个失落一族的成员走过来之后，完全没有开口的意思，甚至没发出一点声音。他们递给我们几块蒙眼布，用手势示意我们系上。
//
//我向他们解释了这是一件让我们都感到不舒服的事。但他们只是向我们展示他们这次根本没带武器来，还说，“我们两个人比你们六个人更脆弱。”他们都这么说来，我们也只能有点犹豫地系上了蒙眼布。这不仅仅是因为我们愿意信任失落一族，更是因为他们的态度看起来还算温和。我们系好蒙眼布后，他们马上就带着我们开始了一次又一次的切出，比我们想象中的次数更多。不过我们的小队依旧保持着镇定。在到达Level 500（应该是）后，他们依旧不让我们摘下蒙眼布。
//
//在搞清楚我们的方向之后，我感觉我们似乎在无目的地乱走，中途时不时还能听到远处有人在聊天。就这么走了大概30分钟，他们终于告诉我们可以解开蒙眼布了。摘下蒙眼布后，我们发现自己就处于失落一族之前提到过的那个水域里。这里看起来有无限大，一边是无穷延伸的“海”，我们则在这边空旷的“岸”上。水域深处可以看到两块岩石，其中靠近我们的那一块正散发出明亮的符文光晕。
//
//这时候低头看看水里，马上就能看到数量惊人的实体。无数看起来仿佛利维坦一般的生物栖息在海中，状似无害。但在我们的团队接近海岸时，一阵风刮过，从岩石上吹下了几颗小石块；三个实体突然从水里跃出，在空中爆发出了耀眼的光芒，变成了巨大的云雾。没有人知道它们是怎么办到的，但是那几个小石块却在烟云中彻底消失了。
//
//在这之后，我们都不太愿意再深入水域了。但是那符文岩石就在那儿，我们只需要凿下来一点点就可以完全解析它们了。很显然，我们唯一要做的就只是爬上那块岩石，然后用凿子把它敲下来一点儿。但最大的问题是该怎么到那儿。海里全是这样的实体，而且我们看不到的地方肯定还有更多，它们都在等着猎物送上门呢。突然间，我脑子里出现了一个主意。
//
//我拿起了我自己的瓶装驱笑剂，用力地把它扔了出去。海里的那些实体似乎停滞了一瞬间，然后在同一时间齐齐跃出。这些实体在空中都发出耀光，变成了成片的云雾。这些云雾无比壮观地飘走之后，水域里终于干净了。
//
//
//clouds
//
//生成的云雾和这张图里的差不多。
//
//我们相信这片水域里很快又会被深处游上来的实体填满，所以我们在清空之后即刻出发了。这里的水散发出一股邪恶的气息，但我们还是不得不一路划船过去。还好，我们不久后就顺利来到了那块岩石旁。Mena用绳索一路攀登了上去，开始用凿子在岩石上凿下一块来，不少碎屑因此从岩石上飘了下来。不过Mena最终还是凿下了一块足够大的样品，并迅速把它扔了过来。几个实体已经从海底游了上来，但它们被最开始飘落的碎屑吸引走了。幸亏这些碎屑飘得够远，足够我们趁机返回了。
//
//失落一族从我们这里要走了那块样品用于研究，就跟一开始说好的一样。不过让我们吃惊的是，他们突然把我们一个一个推倒，并让我们直接掉进了Level 1。这时候，Mena给了我们一个大大的惊喜：她从大衣里掏出了一块小一点的样品石，同样使用凿子凿下的。这块样品看起来就和一块鹅卵石差不多，但它已经够大了！之后，我们前往了Level 1内的符文研究基地，遇到了Fortina，并把样品交给了她。
//
//符文A - EPE-500-SRH
//以下符文条目由符文破解部的负责人Fortina Sorens编写并提交，经由档案保管小组审核。具体条目如下。
//
//关闭文档
//符文研究日志 - Fortina Sorens
//RuneA.png
//EPE-500-SRH的照片，摄于Level 500。
//
//pebblerune
//EPE-500-SRH的碎片。由Mena Alinios取得。
//
//符文数据库条目
//符文ID: EPE-500-SRH KPE-500-SRH
//授权许可级别: 标准，所有成员可见
//描述：
//EPE-500-SRH是一块小型符文，与笑魇与驱笑剂直接相关。符文内部的信息很大程度上包含了驱笑剂的制作。该信息为一首与笑魇和驱笑剂有关的诗作，由Fortina Sorens破译。以下是从符文中解析出的诗句，由于样品大小有限，翻译可能含有少许错误。
//
//仇恨之露，狂热之水，
//二者相融，隐者自为。
//饮恨而退，遁入漆黑，
//自此亡灭，一去不回。
//
//对于符文的解释指向了驱笑剂，确切地说，是驱笑剂的制作方法。其中，“仇恨之露”与“狂热之水”应分别代表杏仁水和腰果水。因此，驱笑剂中的两种成分被判定为杏仁水和腰果水。为检验诗句中的提示是否真实，相关实验已经提上日程。
//
//更新：物品3-事件A
//在试图将腰果水和杏仁水混合后，一场规模巨大的爆炸在极短时间内发生了。尽管如此，没有实验人员受到伤害，虽然他们拥有都在昏迷前有关于爆炸的清晰记忆。实验中用到的腰果水和杏仁水全部都消失了，而此后重复此实验再也无法得到与首次实验相同的结果。
//
//当腰果水与杏仁水混合后，它们变成了纯净的水。这一过程原理未知，而且现在也不重要了。所有现存的驱笑剂都消失了，没有一滴留下，包括监督者A随身携带的那瓶。
//
//附录2：失落一族的修复信件
//我们找到了这封信，用的是失落一族常用的纸张。它似乎非常重要，因此在此备份。
//
//关闭文档
//你们做了什么你们做了什么你们做了什么你们做了什么你们做了什么你们做了什么你们做了什么你们做了什么你们做了什么你们做了什么你们做了什么你们做了什么你们做了什么你们做了什么你们做了什么你们做了什么你们做了什么你们做了什么你们做了什么你们做了什么你们做了什么你们做了什么你们做了什么你们做了什么你们做了什么你们做了什么你们做了什么你们做了什么你们做了什么你们做了什么你们做了什么你们做了什么你们做了什么你们做了什么你们做了什——
//
//你们为什么要把它们混合起来？为什么？为什么？为什么？我们本来可以做到的，我们可以彻底消灭它们的。你们为什么要把它们混合起来？你们认真研究过符文了吗？我们从你们那里取走了符文。你们是怎么做到的？怎么做到的？怎么做到的？怎么做到的？
//
//你们毁了这一切，我们所有人。这不是一件好事。
//
//这将会成为开端。
//
//终结的开端。
//
//我们不知道应如何处理这份文件，因此暂时选择忽视它。但是，我们无法忽视这份文件中隐含的重要信息。他们到底知道多少？package wupin;
//
//public class quxiaoji3 {
//
//}
package wupin;
public class quxiaoji3{
}