//package wupin;
//
//public class rengechongsutaideng1143 {
//
//}
//Object C-143 - “人格重塑台灯”
//评分: 
//+13
//+
//–
//X
//统合物品分类系统
//物品编号 #：C-143
//位置：[已编辑]
//安全性：有害
//用途：
//重塑人格
//状态：
//需要销毁
//JtVE.png
//一盏人格重塑台灯。
//
//描述
//人格重塑台灯的外观通常表现为一盏造型奇特的黄色台灯，偶尔会表现为蓝色或者绿色。其灯体底座上存在有一个USB接口，可以用于为其提供电力。人格重塑台灯没有开关，当其通电时其上方的灯泡会自动开启。值得特别注意的是，任何被发现的人格重塑台灯都应当被销毁或去威胁化。
//
//人格重塑台灯可以在220V,50Hz的交流电供应下正常工作，工作时其灯泡会发出任意一种颜色的光，可以通过扭动灯泡来调节光的颜色。不建议在任何情况下启动并使用人格重塑台灯。
//
//经实验证实，人格重塑台灯的灯泡无法从其灯体上拆下，在灯泡被击碎之后其灯体也会随之报废，无法修复。任何对于灯体的拆解工作均无功而返，对于台灯的X光扫描未得到任何有效信息。如果需要对人格重塑台灯进行去威胁化，仅需破坏灯泡即可，不建议尝试对其灯体进行破坏。介于人格重塑台灯的特性极度特殊且有害，M.E.G.以及其他部门均表示希望流浪者们在发现人格重塑台灯后直接对其进行去威胁化操作。
//
//用途
//当有人员被人格重塑台灯所发出的光线照射时，根据光线的不同颜色，被照射者的性格会朝着不同的方向发生转变。该种转变属于渐进式的不可逆转变，且不受限于被照射者与光线的接触面积。经试验发现，被人格重塑台灯所影响导致性格改变的人不会引起人格刺客的注意。以下为几种颜色的光线的实验记录。
//
//- 收起
//编号：3
//实验对象：杀人犯—唐德
//光线颜色：白色
//记录：实验者被捆绑在椅子上，不停地尝试着挣脱绳索并对其看到的每一个人破口大骂，态度极度恶劣。在接受到光线照射大约三分钟之后，实验者的情绪逐渐变得平和并停止了自己的挣扎行为，目光中表现出了隐约的不安。在接受照射大约十分钟后，实验者突然声泪俱下，表示自己对于自己的杀人行径十分后悔，并挣扎着用头部去撞击地面。试验因实验者的自杀行为被迫中止。
//编号：8
//实验对象：流浪者—莱文（自愿参加）
//光线颜色：紫色
//记录：实验者站立于实验区域正中接受光照。在接受光照大约四分钟之后，实验者开始在原地小幅度晃动，经场外提醒后实验者表示自己无法控制该晃动，并表示“自己感觉有些奇怪”。在接受光照大约七分钟之后，实验者开始轻声地哼唱一些奇怪的歌曲，并且用他自己身体的晃动来打节拍。在接受光照大约十二分钟后，实验者突然开始大声地唱一些奇怪的RAP，伴随有一系列奇形怪状的肢体动作。目前该实验者正处于Level 1的一处夜店中负责打碟工作。
//编号：11
//实验对象：流浪者—德尔库（自愿参加）
//备注：实验者在实验前患有重度抑郁症。
//光线颜色：黄绿色
//记录：实验者趴坐在放置着人格重塑台灯的桌子上接受光照。在接受光照大约二分钟之后，实验者逐渐直起了身子，但依旧保持着趴坐姿势。在接受光照大约六分钟之后，实验者出现了较大幅度的肢体动作，随后端坐在了椅子上，像是正在进行某些思考。在接受光照大约十五分钟之后，实验者露出了一种释怀的笑容，随后起身离开了照射区域。实验结束后该实验者接受了心理医生的测试，测试结果显示该实验者的抑郁症得到了完美的治愈。
//警告：高危
//
//编号：17
//实验对象：流浪者—莫利乌斯（自愿参加）
//光线颜色：血红色
//记录：实验者站立于照射区域正中。在接受光照大约二分钟之后，实验者表现出了些许浮躁，但与其进行的对话均正常进行。在接受光照大约五分钟之后，实验者的神态明显变得更为阴沉，且对其他人员产生了排斥情绪。在接受光照大约八分钟之后，实验者坐在地上，拒绝了一切对其进行的对话，并且开始剧烈地呼吸。在接受光照大约十一分钟之后，实验者突然从地上窜起来并拽下挂在天花板上的人格重塑台灯对其他人员进行无差别砸击。随后该实验者抢走了一个人员手中的自卫匕首并开始对任何被他发现的人进行攻击。在实验失控大约六分钟之后该实验者被击毙。本次实验共造成了3人死亡，4人残疾，7人受伤。
//在经历了编号为17的实验之后，所有关于人格重塑台灯的实验均被强制叫停。在此之后陆续发现有人恶意利用人格重塑台灯的血红色光线来制造富有攻击性的反社会者，并且一度形成了组织来正面攻击M.E.G.基地。就目前而言，人格重塑台灯被列为了一级危险品，任何与人格重塑台灯有关的事件都会引起M.E.G.方面的重视。
//
//
//
//发现
//首次发现于Level 11，由M.E.G.与B.A.G.总结出其功能。
package wupin;
public class rengechongsutaideng1143{
}