//Object C-86 “血馒头”
//评分: -9+–x
//
//物品编号：C-86
//
//描述
//mmexport1668940002153.jpg
//血馒头
//
//血馒头通常情况下是由魔芋和面粉等食材构成的血块混合物，其外观表现几乎与普通馒头别无二致，唯一的特点是血馒头引人注目的血红色，该物品内部类水成分检测结果为未知生物的血液，尚未知晓这些血液是人为包进去的还是天生存在的。
//
//如果你想要寻找这件物品，那我劝你别白费力气了，M.E.G那帮人早就把我的造物藏起来了，不过如果你想了解的话，我现在倒是有闲情逸致跟你分享一下。
//
//
//
//血馒头在视觉方面对人类有极大的吸引力，当一名流浪者与血馒头共处一个封闭空间时，这种奇怪的效应会更加明显。据食用者所描述，血馒头在味觉上并不会让人厌恶，相反无尽的兴奋会在他们进食的过程中充斥着大脑，而这种兴奋的来源是在他们进食时馒头所散发出的诡异的甜腻味。
//“血馒头”,也就是被你们称为Object C-86的东西，本质上是从你们灵魂上拆下的原料加工而成，你应该明白这意味着什么，如果你已经吞噬了它，那么你的灵魂会与罪恶共鸣，以某种未知的方式与我相连进而改变现实。
//
//
//血馒头可以在后室C层群的多个地点获取，但在室内层级最为常见。过度食用血馒头有可能导致上瘾，由于“红祭”事件造成的恶劣影响，M.E.G已于2022年5月17日将血馒头归类为违禁品。人性的贪婪使他们化作了草原的养料，自作自受的孬种可不配成为母亲大人的子嗣。
//用途
//血馒头最吸引人的特点在于其有能力将食用者当前所面临的厄运转嫁给他人，例如当某位流浪者在危险层级遭遇实体追逐，摄入血馒头后流浪者身后的实体将以某种形式放弃对流浪者的追逐，且该名流浪者将会更容易找到层级的出口，与此同时另一名流浪者将在层级1探索途中被实体撕碎。厄运的转嫁目标通常是没有规律的，当一名流浪者吃下血馒头后，后室的每个人类都有可能会变成厄运转移的遭受者。血馒头的效果可以随着食用量叠加，摄入到达一定量后，流浪者将有可能长期不会遭受厄运侵扰。有关食用血馒头可以切出到前厅的传闻皆为谣言，造谣者已被严惩。
//
//任何超出自身能力的奢求都是有代价的，你会为了自己的生命牺牲他人的利益吗？也许你会，但你已经永远无法回头了。你们已经收到了包裹着蜜糖的鱼钩，上去舔一口又未尝不可，看我的心情，也许我永远不会收钩。
//
//发现记录
//血馒头最早发现于Level C-473的菜单上，不久这种物品的分布地区变逐渐蔓延到整个后室C层群。
//
//
//还在呀，我就知道你想了解更多，以下是被M.E.G隐藏的内容，他们想凭这些就能掩盖住那次惨剧的真相，不过纸里终究是包不住火。
//
//隐藏信息
//红祭事件经过
//看看这些人是多么的愚蠢，我仅仅是略施小计，就能轻松的让这帮利己主义者为我卖命。
//
//
//你问我为什么告诉你这些？其实这已经不重要了，我的实验已经结束了，并且我也获得了自己想要的、最满意的结果，跟你讲一讲又无妨。
//
//
//我仅仅是仆从的一员，只不过比那些呆板的废物聪明了一些，是母亲大人最忠实的手下之一。
//
//
//这些事，我预谋了很久，我呕心沥血地去创造一处又一处红色的辉煌，只为壮大我们的族群，奉献出卑微的自我，
//
//
//在母亲大人的爱抚下，我坚信那些实验体会变得更加强大，更加贴合我们的本源，
//
//
//我曾经和你一样痛苦，作为羸弱的人类孤独的流浪，但我很庆幸我来到了母亲大人的怀抱里，她将我的灵魂从这幅恶臭的皮囊里彻底剥离，她用最锋利的现实撕碎了我愚钝的信仰，我迫切的希望人类能了解自己丑恶的本质，以万念俱灰的心境向我们俯首称臣。
//
//
//我寻求指引，我接受洗礼。
//我蓄势待发，我始终如一。
//
//
//加入我们吧，可怜的孩子，你真的不必再受苦了，我可以给予你想要的一切，只需要坚信自己所记忆的那般真实，我会让你铭记永恒的使命。
//
//
//我们与你同在。
package wupin;

public class renxvemantou1086 {

}
