//package wupin;
//
//public class rongmai1115 {
//
//}
//Object C-115: 绒麦
//等级： 安全	分布于几乎任何可供陆生植物生长的非热带层级。	恶劣环境下重要的补充粮食作物和牧草，以及获取安全水源的手段之一。
//↓Object C-114	↑Object C-116
//Object C-115，即绒麦，又称花麦、绒麦草，是一种在后室广泛分布的，全株形似小麦的食用和药用禾本科植物，经处理后可用于净水。由于该物品是B.N.T.G.过去大肆售卖的“净水粉”的主要和唯一有效成分，现将“净水粉”相关资料并入本文档。
//
//描述
//绒麦是禾本科、黑麦属的后室特有一年生植物。秆丛生，高50～120厘米，叶片为长披针形，新生茎叶被白色绒毛，寒冷环境下长成时亦不褪去。穗状花序直立；含2小花，小花近对生均可育，外稃顶具芒，沿背部两侧脉上具细刺毛，内稃与外稃近等长。颖果长圆形，深褐至浅黄色，干燥烤制后有特殊坚果香气，野生型长3～6毫米，粮用栽培品种可长8～10毫米。绒麦果皮颜色易受外界环境影响，同小穗颖果亦常为不同颜色，故别称花麦。
//
//绒麦耐寒、耐旱、耐贫瘠，最适合在15～20℃，长日照条件下种植，-15℃以下和25℃以上时停止生长，恶劣条件下难以绝收，但亩产极限不高。M.E.G.正尝试从Level 10等农田层级中收集更多绒麦及其近亲作物的种子，以便通过杂交改良现有的数个粮用和饲料用栽培品种，在保持优良特性的同时提高产量。
//
//向腰果水和记忆汁中加入磨碎的绒麦茎叶后，迅速产生大量白色沉淀。用以上方式处理并过滤后的腰果水会失去吸引实体的特性，记忆汁则会被染成黄绿色，并散发泥土腥味。此后，在这两种液体中加入体积不少于50%的杏仁水，混合液体会逐渐升温沸腾1。反应完毕并冷却后的液体有和常规绒麦茎叶冲饮相近的气味和提神醒脑、稳定心智的作用，但没有任何味道。
//
//化验表明，绒麦含有数十种同科植物中不存在的特有物质，一部分特有物质构成了独有的香气和味道，另外三种则与絮凝净水有关。绒麦本身并不含有起正面精神作用的物质，其茎叶冲饮的特殊作用可能与在水中溶解时的化学反应产物有关。人类直接食用大量绒麦茎叶会导致剧烈的腹泻，可能也是由于这些反应产物。
//
//用途
//绒麦果实磨粉后与黑麦粉类似，但因为绒麦目前的低下产量2，通常仅于面食中少许添加以增加特殊风味，或在环境恶劣且出入困难的层级中广种薄收，作为该类层级中基地的后备粮食，并抑制杂草、改良土壤。此外，某些组织和个人声称自己出售的面包、甜点和啤酒原料为绒麦。在某些寒冷层级中，和野生型性状更接近的饲料用绒麦被广泛种植，作为牲畜的优良牧草。饲料用绒麦一般粗放种植，少有田间管理。
//
//2020年M.E.G.公开“净水粉”成分后，绒麦的净水功能广为人知。取未开花绒麦的地上部分，捣碎后与重量约为其50倍至100倍的水混合搅拌，可见絮状物沉降。静置，滤去絮状物，将水煮沸后即可获得基本可靠的饮用水。经过以上处理的水带有微弱甜味和绒麦特有的坚果香气，有一定的提神醒脑和稳定心智作用，使用干制品净水效果更佳但特殊气味减弱。这种制品同样可用于分辨和避免实体抢夺腰果水，以及辅助戒除记忆汁成瘾。B.N.T.G.了解到其净水作用后，将烘干的绒麦茎叶磨碎后与数种矿物混合，制成“净水粉”并高价贩售，谎称其原料来自某些危险实体。
//
//发现
//绒麦没有任何明确的发现和驯化记录。某些可能来自失落一族的记载声称，绒麦是不知何时开始出现在大麦和小麦田中，如野草般在田前地头随意生长的农作物。考虑到栽培绒麦如今仍保持着与野生品种近似的外貌和顽强生命力，据此推测，绒麦可能经历了与其前厅近亲黑麦类似的自驯化过程，最初为一种形似大麦和小麦的杂草，伪装成农作物，成熟后部分种子混入同一块麦田产出的麦粒中。由于人类在除草过程中的无意人工筛选，农田中的绒麦性状越来越像大麦和小麦，以至有了作为全新农作物的潜力。此后，绒麦由于耐寒、耐旱、耐贫瘠的特性，在一些较为寒冷的层级中被失落一族大规模种植，栽培绒麦因此随着他们的活动遍布后室各地。
//
//B.N.T.G.成立后不久开始售卖的“净水粉”配方可能源自某支失落一族，主要成分和唯一有效成分为饲料用绒麦的茎叶干粉。由于B.N.T.G.的垄断和保密行为，此事直到2020年才被M.E.G.发现，并通过原料田中的植株和各品种绒麦形态对比，确认了对应的品种。
//
//作者信息
//« Object C-114 | Object C-115| Object C-116 »
//
//Footnotes
//1. 一份200ml处理过的腰果水和100ml杏仁水的混合物沸腾了两小时。这种混合液并未像直接混合时那样爆炸。
//2. 绒麦目前的最高亩产记录来自M.E.G.的一处实验田，为320斤。
package wupin;
public class rongmai1115{
}