//Object 20 - 瑞撒毒气
//red.jpg
//对瑞撒毒气在运动状态下可能形态的数字化再现
//
//描述：
//瑞撒毒气是一种极其危险的生化武器，无羁常在与其他团体的冲突中使用。该气体呈浅红色，与一氧化碳的流动性相当，可在特定介质中以近卷须状向周围相对热源的位置扩散。到目前为止，尚不了解瑞撒毒气的合成方式，但有不可靠传言称这种气体可由混合悲尸的淤泥和一种未知溶剂（据说是腰果水或苦痛汁液）制得。目前尚未在后室发现天然的瑞撒毒气矿藏，但其创造/收获应归因于U.E.C.，因为在已知团体中他们最擅长对其进行利用。
//
//瑞撒毒气的特性将在被吸入后表现出来。吸入其的受害者将立刻陷入悲尸循环，其进行速度显著快于接触悲尸体液，在吸入的50秒内就会发生完全不可逆的转化。已知在该转化期间受害者对毒气的反应包括肌肉组织的快速流失，皮肤组织的剥落（可深达真皮乳头层）及经由人体孔道的大量失血。该气体的所有使用记录都以人类为对象，故瑞撒毒气对实体的影响仍不明。
//
//截至本文档撰写时，仅有一位瑞撒毒气幸存者。下附对其的访谈记录，以供参考。
//
//附加信息：
//对幸存者3和M.E.G.生命线成员Mx. Harper Vivace的采访记录。
//
//[对话开始]
//
//Vivace：好，█████，我得首先说，你之前所受到的折磨太有创伤性了。我想强调的是，不论任何时候，如果你想中止这次采访，你都可以直接告诉我们。对我们而言，如果必须损害某人的身体才能获取信息，我们还是会优先关注人的健康。毕竟，我们也不想让你重温那天发生的事情。
//
//幸存者：啊，不，这——这很好，能被选中做采访，我也很高兴。仅仅靠谈谈这些问题的话，可能就能在——我意思是，在这个过程中，拯救一些人的生命。我告诉过你，我可以的，那……我们就开始吧。
//
//Vivace：好，那请坐吧。
//
//[幸存者和Vivace入座，彼此平行。］
//
//Vivace：那么，开始讲吧。在你说话的时候，我会做好记录。
//
//幸存者：没问题。好吧，我记得那天，我们的小队应该是被被分配了一个小规模的侦察任务。在Level 76。我和队员们刚从Level 7下来，不过，我们很快就得知有一个……问题。我的意思是，关于这个层级。
//
//Vivace：问题？
//
//生存者：悲尸。一大堆。从关于这个地方所有的报告来看，那里应该只有那些奇怪的蜘蛛什么的玩意。但它们可就在那里。
//
//Vivace：你有注意到那些悲尸的什么异常状况吗？
//
//幸存者：哦，绝对有。它们不像大多数人常见的那么聪明，你懂吧？那些东西聚集起来的时候应该变得更聪明才对，但，呃，在这里可不……不是这样的。它们基本上都坐以待毙——甚至没有意识到我们已经在弓上搭了几支箭，等我们往它们的内脏里射了十多支箭的时候它们才反应过来。
//
//Vivace：那确实是……奇特。你感觉——除了存在那些悲尸，显然——通往下水道枢纽的那个层级有什么奇怪的地方吗？
//
//幸存者：没。
//
//[停顿。］
//
//Vivace：好吧，我想接下来就是……比较沉痛的地方了。你还想继续吗，█████？
//
//幸存者：我…是，我愿意。
//
//Vivace：好，请继续吧。
//
//幸存者：好，所以，大约在我们离枢纽……200多米的地方，这些人就出现了。他们戴着防毒面具，全身被防护服包裹的严严实实。可别……别问我他们从哪搞到这些东西的。他们拿着这些罐子，像杀虫剂的。就那种，你知道，那些带管子和喷头的杀虫剂罐子？他们每个人手里都有一个。有……有三个，我想。我记不太清这些细节了。
//
//[受访者停顿了一下。］
//
//Vivace： █████?
//
//幸存者：啊，是，我很好，只是得……好好想想。对，所以，我们停下来，做着打招呼的手势，表示我们很友好，但他们没有任何回应。然后他们就向我们喷了那东西，它……它移动得很快。他们很快就逃离了现场，把我们留在那里，应该是因为他们知道它的作用。我看到其他人一闻到它，就突然开始哀嚎，所以我就捂上嘴，想挡住它。我在队伍后面，我——我才有点时间反应。其他人，他们可没时间——甚至没时间反应就……
//
//Vivace：你说这些物质移动的速度有多快？
//
//幸存者：大概，一秒钟一米。它看起来像是要把我们抓住，它用这些……气态的触手，伸向我们，试图把我们包裹起来。然后，该死的麻木感就开始了。我都没感到任何异样，只有……温暖。温暖又麻木。呵，我甚至没意识到我的皮肤在剥落，直到听到枪声。天，我真希望我小队的成员在枪响的时候已经麻木了……
//
//Vivace：█████，你还好吗——
//
//幸存者：为什么啊？我为什么要跑？我也应该在那里，不该在这里。我的小队啊，他们……咯咯尖叫……而我就他妈像个懦夫一样跑了，我——我都没试试帮一下他们，我的队——我不能——
//
//[可以听到急促的呼吸声]
//
//[Vivace站起来，握住他的手]
//
//Vivace：█████? █████，看着我，看着我。看着我的手，我在握着你的手。你现在在医院，我是来帮你的。你认识我的，█████。我是哈珀。你是安全的——
//
//幸存者：哪里……
//
//Vivace: 你在Beta区，█████，Level 11。它很安全。你现在也是安全的。深呼吸。
//
//[可以听到幸存者的呼吸声趋于平稳]。
//
//Vivace：很抱歉这事发生在你身上，█████，没人理应遭受这种折磨。来吧，我们带你去休息，好吗？
//
//[对话结束]
//
//« Object 19 | Object 20 | Object 21 »
//
//作者信息及图片授权
//Footnotes
//1. 参考信息：麦克风(此处被称为植入物，以混淆偶然浏览文件者。)通常放置于人员活动密集区域。由于对象处于驻地中较少有麦克风的一翼，故并未捕捉到所有对话内容。
//2. 译注：原文如此。见下：The heat-detection of Achlys is derived from unit EN-06's ability to spread itself via bodily fluids, however, Achlys gas is more potent than the entity's own viscera.
//3. 为M.E.G.导火索的前成员。已被要求保密。package wupin;
//
//public class ruisaduqi20 {
//
//}
package wupin;
public class ruisaduqi20{
}