//Object 29 - “3D视觉眼镜”
//Object 29
//photo-1604187349790-ecd899cf38eb?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8NXx8M2QlMjBnbGFzc2VzfGVufDB8fDB8fA%3D%3D&auto=format&fit=crop&w=1000&q=60
//一副3D视觉眼镜
//
//3D视觉眼镜是一副为佩戴者提供第三人称视角的眼镜。虽然3D视觉眼镜在其他层级是不常见的，但是它经常会出现在Level 290 (据说首先是在这个层级找到的，所以该物品被编号为29) 和 Level 68的角落或椅子下面。有时，3D视觉眼镜也会出现在Level 25 和Level 40.
//
//描述：
//3D视觉眼镜的外观与电影院提供的用于观看3D电影的普通3D眼镜相同。它们都有一个薄而方正的框架。3D视觉眼镜和前厅的3D眼镜的唯一区别3D视觉眼镜的镜片颜色是倒过来的：右面是红色镜片，而左面是蓝色镜片。这个眼镜只有一种尺寸。
//
//虽然3D眼镜外表看起来很脆弱，但是它们却惊人的耐用；它们耐撕裂，不容易被折断，并且防水。佩戴该眼镜时，眼镜会粘在佩戴者的脸上，确保眼镜在佩戴者在跑步、跳跃或在水中时不会脱落。虽然眼镜被粘在了脸上，但佩戴者可以轻松的摘下眼镜。
//
//性质：
//带上3D视觉眼镜时，原本的普通视力会被第三人称视角代替。
//佩戴者会从自己身后的一个略高于自己的点俯视自己，就像在21世纪的第三人称游戏一样，随着身体移动，并且随着头而旋转。这种第三人称视角的视力与正常的视力几乎一样。
//
//第三人称视角的视野比正常人的视野更广，佩戴者可以充分的观察周围环境。一些有用的优点如下：
//
//更宽广的视野
//提升视角
//观察远处物体时的清晰度远高于正常情况下的清晰度
//在安全的躲在墙后的情况下可以看到周围
//一位近视的流浪者（以下为采访实录）说当自己带上3D视觉眼镜时，他的看到的景象变得十分清晰。直到目前为止，还不清楚盲人带上3D视觉眼镜时会发生什么。
//
//用途：
//3D视觉眼镜由一些练习使用3D视觉眼镜来观察周围，并利用其优势的流浪者佩戴。他们训练自己的协调能力，感觉能力（空间感知）以及适应第三人称视角。与其他人相比，经过训练的流浪者使用3D视觉眼镜会更自然。
//
//高级M.E.G.兵团偶尔也会在特别危险的探险中（特别是救援和突袭， 前线探险以及清除实体）使用3D视觉眼镜。
//
//效果：
//刚开始佩戴3D视觉眼镜时，佩戴者会感到迷失方向；没有经验的佩戴者可能会感到头晕、不堪重负、失去平衡，严重情况下甚至会感到呕吐并且情绪失控。
//
//反之，对于长期使用3D视觉眼镜，处于第三人称生活的人，摘下眼镜也会引起头晕目眩以及感到轻微的恐慌。对于那些已经习惯了更广阔的视野的流浪者来说，视野的变小会让他们感到不舒服。
//
//M.E.G. 录音记录
//从10:34到12:19的录音片段
//
//
//日期: 2021/9/23
//采访者： M.E.G.研究人员爱丽丝·苏
//被参访者：独立流浪者罗伯·马修斯
//<开始采访>
//
//苏：谢谢你能让我们了解这个眼镜。我想你已经使用它一段时间了。
//
//马修斯：是的。
//
//苏：你在哪些情况下或在哪些层级里佩戴眼镜？
//
//马修斯：我一直都戴着它
//
//苏：一直？你从来没摘下眼镜吗？
//
//马修斯：没有（笑了一下）为什么我要摘下眼镜获得更差的视野？再说了，我是近视眼。
//
//苏：你以前······？
//
//（马修斯从他夹克的内兜中掏出一副普通的眼镜）
//
//马修斯：对，我的眼是近视的，我一直拿着我的近视眼镜，以防万一，你懂的。但当我带上它时 (拍了一下3D视觉眼镜) 我的视力像白天一样清晰，甚至更清晰！
//
//苏：…所以你即使睡觉时也不摘吗
//
//马修斯：不
//
//(苏试探性的把手伸向马修斯的3D视觉眼镜)
//
//苏：我可以戴一下你的3D视觉眼睛吗？我想体验一下。
//
//(马修斯马上往后靠了靠，然后摇了头。)
//
//马修斯：不，相信我，那样对我们俩都不好。我已经告诉过你突然转换到另一种视觉的影响，特别是你已经习惯了当前的视力
//时
//苏：哦，我知道这一点，我只是有点好奇，仅此而已。
//
//（苏重新坐到了椅子上）
//
//苏：你确定不把你的眼镜借给M.E.G进行研究吗？只要几天的时间，并且你会得到补偿。
//
//马修斯：抱歉。这个眼镜已经是我的一部分了。这就像剥夺一个人的感官，你懂吗？
//
//<采访结束>package wupin;
//
//public class sandishijueyanjing29 {
//
//}
package wupin;
public class sandishijueyanjing29{
}