//package wupin;
//
//public class shengzhimian1113 {
//
//}
//PLS-IV-113 - “生质棉”
//评分: +23+–x
//统合物品分类系统
//物品编号 #：PLS-IV-113
//位置：帕拉斯研究所
//安全性：安全，无害
//用途：
//加工用原材料
//状态：
//可量产
//物品编号：PLS-IV-113
//位置：帕拉斯研究所
//photo-1594734415578-00fc9540929b.jpg
//PLS-IV-113制作而成的面料。
//
//描述：
//PLS-IV-113从材料学上被命名为生质棉，生质棉的最主要成份是天然高分子化合物。经检测，生质棉内部纤维还附有15%左右的其他物质，其被命名为伴生物，主要为柔软沙发的部分物质。
//
//生质棉的表面含有蜡质，被称作棉蜡。棉蜡对生质棉具有保护作用，但在高温时，棉蜡容易熔融。经脱脂处理，较原生质棉吸湿性增加，吸水能力可达本身重量的0.8倍，未经脱脂处理的生质棉则拥有十分良好的防水效果，约为脱脂后的1.2倍。
//
//生质棉具有高比强度、高比模量的特性。 比强度是同等截面钢丝的0.8倍，比模量仅次于特种碳纤维。其纤维密度极低，密度是1.2g/cm³。其断裂伸长低、具有很强的吸收能量的能力，因而具有突出的抗冲击性和抗切割性。其耐腐蚀性、耐磨性优秀，挠曲寿命极长。
//
//生质棉同时具有极高的柔韧性与极强的附着性，同时具有一定的自我修复与自我清洁能力。在受到约2000N的彻底撕裂后，简单缝合的生质棉在28小时后彻底恢复如初。
//
//以下为帕拉斯研究所方面针对生质棉的材料特性测试
//
//测试：生质棉的材料拉伸力临界值
//方案：测试材料悬吊于空中，于下方特意制作悬挂点，悬挂重物
//对照：以同等形式悬吊于空中，并悬挂重物
//结果：对照组最大悬挂重量为50KG，生质棉最大悬挂重量为120KG，多次测试数值平均值为115KG
//测试：生质棉的材料防水性测试
//方案：测试材料完全浸泡于液体内
//对照：以同等形式浸泡于液体内
//结果：对照组1分钟后彻底浸湿生质棉3小时后仍未浸湿
//测试：生质棉的材料自我修复性
//方案：测试材料被彻底撕裂，随后简单缝合，并在彻底修复后进行测试1
//对照：以同等形式处理，并于生质棉修复完全后进行测试
//结果：对照组悬挂重物后立刻断裂，生质棉于42小时后彻底恢复，拉伸力承受值于测试1一致
//附录
//收起
//主题:关于物品PLS-IV-113“生质棉”的试用报告及提议
//发信人:htwartd@backmail.com
//收信人:plstechnology@backmail.com
//收到试验样本已使用，样本表现出极其出色的防水性，并且确实可以有效附着伤口。
//综上所述，我方意见该样品适合作为医疗用具，例如止血带与三角巾
//——帕拉斯研究所医务人员
//
//主题:关于物品PLS-IV-113“生质棉”的试用反馈及提议
//发信人:workingerverday@backmail.com
//收信人:plstechnology@backmail.com
//样品试用完毕，已证明确实有作为服装原料的可能性，但建议需要适配其他材料共同使用，该材料更适合作为服装主体和补强部分。
//——一位服装设计师
//
//主题:关于物品PLS-IV-113“生质棉”的试用反馈及提议
//发信人:lifeshit@backmail.com
//收信人:plstechnology@backmail.com
//最近有一家新的酒吧开业了，不如拿去做点丝袜什么的试试？哈哈哈。
//——一位[已编辑]，此信息不具参考价值，发言者被扣除当日配给。
//
//PLS-IV-113报告（节选）
//收起
//181b1af07493d3dd.jpg
//PLS-IV-113的分子结构图。
//
//微观性质：含巯基，三氟甲基，醚键三种官能团，其纤维既不溶于水，也不溶于一般的有机溶剂，仅能溶于铜氨溶液和铜乙二胺溶液等。常温下其微观性质比较稳定。其纤维可与氧化剂发生化学反应，生成一系列与原来纤维结构不同的物质。其分子有极性，分子链之间相互作用力很强，但其分子内和分子间难以能形成固定氢键，特别是分子间氢键生成困难致使糖苷键易于旋转从而使其刚性大大减小。遇强酸可使醚键断裂从而改变其微观结构。
//
package wupin;
public class shengzhimian1113{
}