//Object C-96 - “声纹结晶”
//评分: +11+–x
//物品编号：Object C-96
//主要分布：后室C层群任何干燥的墙面上皆可以发现，但是需要以前人类的声音来制造。
//
//声纹结晶是一些有异常性质的晶体。
//
//pexels-peter-d-pper-2363577.jpg
//一块声纹结晶。发现于Level C-481的一片地板上。这块晶体的长度大约8厘米。
//
//描述
//声纹结晶大多是四方或单斜形状的透明晶体，与大部分盐的晶体形态类似。晶体大多数是无色的，但也有一些带有颜色，如蓝、浅绿、红棕、紫色、红橙色等颜色。
//
//声纹结晶放置在空气内不易潮解1与变质，但是在水中极易溶解，且目前没有发现声纹结晶能够在水中溶解至饱和。
//
//声纹结晶似乎比已知大多数可溶性盐的晶体要坚硬，不易碾碎。但是它却可以轻易地与它附着的墙壁分离。
//
//性质
//声纹结晶整块放置在水中时，会逐渐放出一段音频。大部分时候，这段音频是本层级内的录音，主要内容是之前的探索者的谈话。除了因声音穿过水而音质被扭曲，这种音频音质很高，而且响度与原音频几乎一致。
//
//声纹结晶溶解于水时，温度不能影响它的溶解速率。但只要搅拌或水在流动，溶解就会加速，音频亦会加快。若将一块完整的声纹结晶碾碎后放入水中，很多段音频将同时播放，以至于放出一段响度极高且混杂凌乱的声音。这种声音可能有巨大的精神影响效应，且甚至能影响周围空间的结构。
//
//声纹结晶溶解于水中后会形成一种特别的溶液，颜色与晶体的颜色相一致。这种溶液未检出任何特殊的物质或离子，却带有一种特殊的味道。这种溶液可能会有一种让人保持冷静和理智的作用，特别是这种特殊味道是清凉感时。
//
//当溶液是甜味时，流浪者报告“它让我又开心了起来，即使我不知道为什么”；是咸味时，大多数则称“我突然感觉到一种力量。”苦味的溶液似乎能让人“沉默与忧郁”。
//
//用途
//可以用声纹结晶了解之前层级探索者的经历等。以下是一份报告。
//
//结晶发现地点：Level C-67，一处封闭的小楼道内。
//记录时间：2021/8/23
//音频开始
//嘿！嘿！你好！这个晶体是在长吗？
//（某人手靠近录音点，杂音变大。）
//额，好像，变大了一点，对吧。哦，又变大了一点。
//好吧，所以，我***终于能讲话了是吧。哦，***，***。
//哦，对了，所以你能听到这个，说明，你也被困住了，对吧。
//（叹息声。）
//这个鬼地方，我就进了一扇门，结果呢，被困住了。你也是吧。这什么***地方，没水，没吃的，还**会突然没电。
//MEG档案部到底在干什么，我记得我把Level C-67的文档翻到底，也没有这个地方的一点线索。
//哦，你也被困住了。
//嗯。（似乎停了一阵。）
//等我想想。
//楼梯，每一层，都是实的，没法切出。连边边角角也都被我查过了。
//那扇白色的门，没法切出。真的。
//最底端的楼梯间，还有一把椅子的那个，整面墙都没法切出。哦，椅子加上一个人够不到的地方我没摸。
//三层的红色门，没法切出。门把手也打不开。
//垃圾桶，如果有的话，好像没法。把自己放在里面也不行。
//从我二楼做的标记往下，四周的墙面，都没办法切出。
//楼梯栏杆，没办法切出。这有必要讲吗？
//上到三楼那个走廊，没有出口，也没办法切出。从走廊门后面我就检查过了。
//对了，顶层楼梯间的地板，没法切出。
//还有，二楼那面涂成红色的墙，还有下面放着的木板，没办法切出。木板我是当床板睡的。
//好歹也找了五天了，我的补给也耗尽了。差不多排查了百分之四十了。我觉得这里肯定是有办法逃出去的。
//再见。你再见，我自己也再见。即使这声再见已经是我死后的事了。
//要是能把我的尸骨带一块出去就带一块吧，尸骨应该就在椅子上，能带多少带多少。
//（几分钟的沉寂。）
//这个晶体还在录吗？
//好像在的。那个，我有一个好点子，在三楼的走廊尽头，没灯的地方，我会喊出另外一块结晶。对，喊。你去找找。找到了，碾碎它，放进水里，捂住耳朵。文档里说，或许这会改变空间结构什么的。
//不管了，有一点可能，就做一点努力吧。
//（苦笑）我会尽量喊的。如果我太久没喝水嗓子哑了，那就没办法了
package wupin;

public class shengwenjiejing1096 {

}
