//Object 14 - “圣甲虫”
//RLxvItW.jpg
//由一位勘探者拍摄的图片，此物被发现于某位已逝的失落一族成员身上。
//
//圣甲虫是由黑色青金石雕刻而成的小型神秘甲虫状雕塑。
//
//描述
//圣甲虫是一种外表粗糙、形似蜣螂的雕塑物件，其表面形态十分类似于天青石，只不过比天青石的蓝色要深很多。其尺寸通常约为5至15厘米。它们有的会被白漆涂满，有的会被雕刻上许多细节，又或是在基座上刻下一行象形文字，这些文字通常是向埃及神赫普里1祷告的快捷祷文。这些物品似乎并没有明确的来源，它们似乎是在被称为新太阳王朝的失落一族的尸体上发现的。要注意的是，非失落一族成员使用该物品作为护身符被视作对该组织极为严重的冒犯。
//
//属性
//不同于一般的圣甲虫护身符2 , 圣甲虫雕塑本身是具有生命力的。如果手托底座的祈祷者对着雕塑低语，圣甲虫便会展开翅膀，发出响亮的嗡鸣声，并开始持续发出蓝光，时长可达整整一分钟。无论用何种语言，一句简单的“谢谢你”便足以使圣甲虫雕塑恢复至无生命态两小时，在这段时间内它将待机无法使用。实体也可以该令物品进入待机态，但目前人们尚不清楚这具体是如何实现的。
//
//在雕塑被激活时，圣甲虫之光似乎能够击晕大多数喜欢黑暗的实体，如果环境足够黑暗的话，它甚至还可以让人短暂失明。此外，嗡鸣的噪音似乎使危险的实体感到不安与烦躁，它们会主动尝试远离声源。
//
//用途
//大多数随身携带该物品的流浪者都视圣甲虫为实体驱避器，因为它的蓝光和噪音甚至能驱散笑魇。且由于其作用持续时间很短且冷却回复时间较长，故若使用者处在一个敌对实体密度很高的层级内仍使用圣甲虫作为实体趋避器并不很奏效。
//
//有报道称失落一族的成员可以将圣甲虫作为一种信息交流器使用。若没有诸如手机的现代移动通信设备，失落一族成员便可以利用圣甲虫雕塑交流信息——甚至可以跨层级传输——以类似摩斯电码的加密方式敲击雕塑，接收终端便可检测到叩击输出端而传来的嗡鸣声。目前其它组织尚不清楚两圣甲虫雕塑之间是以各种方式进行配对的。
//
//也有传言说，某些颜色奇特的圣甲虫雕塑可能被作为临时层级秘钥使用，但这一传闻尚未得到证实。
//
//Footnotes
//1. 赫普里是古埃及的黎明之神，通常被描绘成为一只蜣螂，抑或是太阳神拉的另一个神格。
//2. 圣甲虫是古埃及描绘蜣螂形象的护身符，它们通常作为私人护身符，现如今已成为古埃及最常见的遗物之一。
//package wupin;
//
//public class shengjiachong14 {
//
//}
package wupin;
public class shengjiachong14{
}