//package wupin;
//
//public class shennongzhang1005 {
//
//}
//Object C-5 - “神农杖”
//评分: +16+–x
//物品编号：C-5
//
//位置：M.E.G.“精准救赎”部门
//
//photo-1615485020471-b66207f5e3bb?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1170&q=80
//“神农杖”。
//
//描述：
//神农杖的外观是一根平平无奇的粗短树枝。然而，它在种植作业之中表现出了非凡的特性。
//
//如图，神农杖两端的末梢分别为单根与双根；若以单根末梢方向在土壤内插入神农杖，那么在其方圆千米1内的作物都将无视环境条件地高速生长、直至成熟2；若以双根末梢方向在土壤内插入神农杖，则千米范围内的作物除了会高速成熟之外，还将凭空出现一种强烈毒性。
//
//不过，杂草等野生植物也会受到同等影响，依然需要人员进行定期清理。
//
//神农杖本身无法焚毁。
//
//用途：
//神农杖当前被广泛运用于农作领域与毒素武器领域，M.E.G.为此在Level C-8内建起了一个秘密实验基地。
//
//获得神农杖的加持后，M.E.G.的粮草问题得到了些许缓解；同时，也得以纳入多种毒草、毒果等毒物，为毒素武器的制备提供了多种原材料；M.E.G.当前计划将其用于对敌对组织和敌意实体的袭击与打击行动之中。
//
//作者信息
//« Object C-4 | Object C-5 | Object C-6 »
//
//Footnotes
//1. 精准的1000m。
//2. 具体成熟时间不定；一周期平均约为33天。
package wupin;
public class shennongzhang1005{
}