//Object 57 - “深红地图”
//| 提示: |
//
//这件物品对在冒险家和十字军部门工作的兄弟姐妹们非常有用。其他阴谋组织不得获取Object 57和Object 57-A的任何样本、信息或位置。如不服从将面临惩罚。而你可以继续阅读这篇档案，亲爱的。
//
//-女祭司
//
//
//| 介绍:|
//
//Object 57，也被称为“深红地图”，是仅由教会制造的导航道具。该道具为一张1英尺 x 2英尺的平滑地图，纹理类似纸莎草纤维，底色为深红色。
//
//地图本身由Object 57-A制成，也被称为“深红树皮”。Object 57-A来自于深红森林中的树皮，经过一定的步骤后可以转换为Object 57。1通过使用小而锋利的物体，最好是刀或弯刀，可以有效地获取该道具。拔除后，这棵树会随着时间的推移自行愈合，大约需要3周时间才能长出一片新的Object 57-A。
//| 性质:|
//
//地图的特殊性质将在地图使用者进入某个层级的领域时显现，然后地图表面将覆盖黑色标记，表示该特定层级的2D版本。该地图可用于大多数层级，并通过其所代表层级的映射被证明是准确的。
//
//当进入一个包含多份叙述的层级时，地图将显示使用者当前所在叙述的2D地图，当使用者进入另一个叙述时，地图可能会发生变化。地图还可以显示使用者的位置，用红点表示。圆点与使用者同时移动，并且通过描绘也被证实是准确的。
//
//虽然Object 57在大多数层级上都能很好地运作，但在某些情况下，地图将无法运作，或者地图上会发生一些不寻常的事情。以下是一些例子：
//| 代码之家 |
//对ltem 57的影响:
//道具停止运作，无法显示层级的任何映射。地图上很快就会出现这样的文字：你在家，不需要地图，因为你已经熟悉这些地方了，不是吗？
//
//| 失灵之现实 |
//对Item 57的影响:
//道具变成灰色色调，无法显示层级的任何映射，可能是由于层级本身的不稳定现实。
//
//|时间之齿轮|
//对Item 57的影响:
//地图无法显示层级中的任何方向，而在地图上可以看到几个字：“你没时间了。”
//
//
//| 相关教堂设施:|
//
//COTBT-57-1，名为“树皮棚”，位于深红森林的荒芜地区，负责获取Object 57-A，而COTBT-57“地图绘制者”也位于深红森林，负责用Object 57-A制造Object 57。
//关闭附录？
//| 如何用Object 57-A制作Object 57 |
//
//你好，本档案的读者。我是教堂设施（也称为“地图绘制者”）的工作人员之一。今天我将指导你们制造自己的Object 57。
//
//在我们开始前，请自行拿一块Object 57-A，切成1英尺 x 2.5英尺的比例。这将是我们制作地图的好材料。
//别再拖延了，我们开始吧。
//
//1.	将Object 57-A放入沸水中，进行5分钟的浸泡，以进行提纯和软化。
//2.	从水中取出Object 57-A，将其悬挂在光源或热源下使其干燥
//3.	使用金属刷反复刮擦Object 57-A的表面。这将使其更加光滑。
//4.	然后，你就有了一个Object 57的实例！恭喜你，好好使用它，保证它的安全。
//
//学习制作物品的步骤后，你可以开始帮助你的兄弟姐妹们制作物品。
//
//作者信息
//« Object 56 | Object 57 | Object 58 »
//
//Footnotes
//1. 详见57-1号附录package wupin;
//
//public class shenhongditu57 {
//
//}
package wupin;
public class shenhongditu57{
}