//package wupin;
//
//public class shibaizhediaoxiang1026 {
//
//}
//Object C-26 - “失败者雕像”
//评分: +23+–x
//
//位于后室C层群中穿行，通常会看见这种令人毛骨悚然的雕像；它们在表情上栩栩如生、在动作上透露着对自己的自暴自弃。它仅仅是矗立在那，一动不动的诠释着失败带来的绝望。什么也不做却用它们的身躯引导着活人避开它们；因为这种雕像往往只会在危险的地域出现，并且它们的新鲜程度预示着此地的危险性。
//“雕像用自己的生命作为警示驱逐懵懂的人，避免他们步入自己的后尘。”
//
//物品编号：C-26
//发现地点：多地
//描述：
//Object C-26是一种由尸体转变1而成的雕像，在最开始它们曾经被认为是万圣节的恶搞物，但是随着在各处危险地带发现了这种物品，它才被明确的记录下这是一种因为未知影响而变成雕像的尸体。这种雕像有着模糊至难以分辨的面部，但嘴部却是以一种夸张的形势张开，表情狰狞。在姿势上结构稳定2并且被束缚住。
//
//在该物品为半径10米内会有效的驱逐实体或使雕像成为实体优先攻击的目标，一个雕像仅仅只能维持一周时间出现，在后该物品会快速的分解以至不会留下任何肉眼看见观察到的痕迹，但这种分解留下的腐烂味会重新吸引实体的靠近。在越危险的层级越能频繁的目击这种雕像，甚至有一些实体的尸体也转变成了这种雕像。这种实体转变的雕像意味着这个层级的生存等级至少代表三级或者更高。
//
//首个出现了“失败者雕像”的音频记录；
//
//流浪者Ptleo：（音频突然开始录制）告诉诉你多少次你了，别他妈的相信那群M.E.G.的狗屁采访员！他们只会把记录你的影像上传给其他的人用来笑话你！还有我说了多少次了别在外面的时候用那玩意了，你难道就不担心——（被打断）
//
//流浪者Calrk： 啊行行行，我听你的话行了不？不过你也下次别想出营地的时候带上我了。
//
//流浪者Ptleo： 你就拿这个来要挟我？你知不知道你这样有多——（再次被打断）
//
//记录员Calrk ： 那个是……什么？（Ptleo：我说多少次了别打断我说话！）你看眼…（声音很害怕）
//
//流浪者Ptleo： 都他妈活这么久了你还害怕这狗屁东西？这他妈难道不就是一个雕像？难不成它能突然跳起来咬你屁股一口是不是。我现在——（又被打断）
//
//流浪者Calrk： 你是不是忘了上次我们遇到这玩意的时候我们经历了什么？！被他妈三个笑魇追着杀！
//
//流浪者Ptleo： 够了，你也不看看当时做了什么。
//
//*实体的低吼声…*
//
//流浪者Calrk： 我操这什么——（仓促的声音）
//
//流浪者Ptleo： 这傻逼猎犬挺好玩的嘿，我盯着它它也不怕。死吧天杀猎犬！！！（猛烈的砸击声，但是这一击挥动到了雕像上，它碎在了地上）
//
//*随着雕像被破坏，出现了更多猎犬的声音*
//
//流浪者Calrk： 我操————（声音渐远并且有非常仓促的脚步声）
//
//*录音机被什么东西压碎了*（备注:这段录音复原于录音机内部的SD卡）
//
//作者信息
//« Object C-25 | Object C-26 | Object C-27 »
//
//Footnotes
//1. 比起这种雕像，更多转变成了悲尸
//2. 这种结构使得object C-26不会被撞击等影响推倒
package wupin;
public class shibaizhediaoxiang1026{
}