//package wupin;
//
//public class shikongshuijing1022 {
//
//}
//Object C-22 - “时空水晶”
//评分: +18+–x
//物品编号：C-22
//
//发现位置：Level C-34、Level C-20，C层群一些矿脉层级和少数其他自然地理开阔的层级
//
//归类：高级应急物品
//
//时空水晶是C层级内一种能够影响时空的深蓝晶石。
//
//描述：
//crystal-162608_960_720.jpg
//一块已经切割为标准状态的时空水晶
//
//时空水晶为深蓝色，质地较脆，其他物理特性与一般水晶并无区别。
//
//时空水晶存在特殊的力场，可以影响层级空间结构，但目前其原理不明。至少20cm³的水晶周围可以观察到空间的微弱扰动，但更大体积的水晶不会有更明显的效果。
//
//目前已探明了一些时空水晶的空间扰动能力，克莱尔博士已经证实，使用高亮度光束1集中照射水晶，将在5米空间内的随机方向，如果室内直径小于5米将会投射到墙壁上，映照出任意前厅人类聚落的影像，具体景色是完全随机的，但总是人类聚落的画面。影像将一直存在，直到照射光束关闭。
//
//用途：
//时空水晶除了可以使后室人员观察前厅活动外，最受广泛欢迎的是它的空间传送能力，当两块至少20cm³2的水晶互相多次击打摩擦时，将产生“吸引”3效应，两块水晶会发生类似互相连接电流的视觉效果，吸附在一起，而后随即分开。但此时两块水晶已经互相散发指向光芒，即无论其中一块水晶在哪里，另一块水晶都会向其方向散发柔和的蓝色光线，如果人员切入另一层级，可以以此寻找层级出口。另外如果流浪者在危险层级遭遇了致命且无法逃离的危险，可以将携带的水晶用力摔碎，之后流浪者将瞬间传送到另一块水晶的放置地点，无论流浪者在哪个层级，包括无出口的危险层级，但另一块水晶完成传送后也会立即碎裂，失去机能。所以人员大多会将两块连接的水晶，一块放置在安全区域，另一块在身上携带，以在危险时迅速传送。此种逃生能力也使时空水晶成为后室中的受到广泛欢迎的商品和战略物品。
//
//因此，各种大型组织都在想方设法获取、储存水晶，流浪者也希望能够获得水晶做为生命屏障，但目前探明的水晶储量很少，经挖掘事件发生后，被证实存在水晶矿脉的只有Level C-34、Level C-20，一些其他的矿场层级和自然地理开阔的层级，但发现的储量都很少，其中Level C-34的矿脉由于大量挖掘已经有了枯竭的迹象，目前未知Level C-34还能够开采多少数量的水晶，其他层级发现的矿脉储存数量也很少，另外在一些室内建筑层级也可以找到时空水晶，但概率很低。由于庞大的需求和供给数量不足，加上大型组织往往限制交易，优先保证自己成员的需求，导致水晶的价格非常昂贵，一块标准的20cm³水晶的价格可以达到数万块货币或等价的杏仁水，大部分普通流浪者无力负担水晶价格，所以目前时空水晶多用于大型组织的层级探索小队和重要人物的转移，以及财力充裕的流浪者，普通的流浪者则需一定时间的积蓄才能购买水晶，往往作为收藏，在万不得已时使用。
//
//其他的时空水晶能力尚在探索中，蒙面女郎成员声称水晶可以打开层级通道，甚至开启前厅通道，但经长时间测试水晶除显示前厅影像外，并未表现扭曲空间，打开层级通道的能力，因此这可能是谎言。克莱尔博士尝试过以更高能量轰击水晶，但除影像外水晶并未表现出其他效果。
//
//
//
//水晶已经为我们打开了一扇窗，一扇通往前厅的窗，虽然我们暂时还没有找到开启的门，但已经很接近了。
//
//———监督者A
//
//
//
//作者信息
//« Object C-21 | Object C-22 | Object C-23 »
//
//Footnotes
//1. 至少20000流明以上，且必须集中
//2. 注意如果水晶体积不够，可以使用粘合剂粘合，粘合剂不会影响水晶效能
//3. 如果需要取消此效应，只需再次击打摩擦，数次后光芒会暗淡消失，如需再次启动水晶，再次击打即可
package wupin;
public class shikongshuijing1022{
}