//Object 70
//物品编号：70
//
//位置：多地
//
//威胁等级：无威胁
//
//描述：Object 70是对一系列发现于后室各处的尸体的统称。所有尸体都面部向下地趴在开阔、单调的地点，也有少数例外被发现于难以抵达的位置。乍一眼看去，很容易将其与其他死去的流浪者混淆。
//
//辨识Object 70的方法为查看他们的面部。每一具尸体的容貌均为平平无奇的中年高加索男性，留有棕色短发，瞳色为黑色。他们没有胡须，但是脸上可见枯槁的皱纹，证明他们已经步入老年。所有的Object 70都面带疲惫、平和的表情。在每一具尸体的脖颈右侧，都可以找到一块处于早期阶段的黑素瘤。
//
//所有的尸体都身着颜色、风格各异的三件套西装，其中最常见的是一套棕褐色的V字翻领商业西装。他们的右手无名指上戴有一枚朴素的银色戒指。在所有案例中，只要尸体没有受到周围环境的破坏，他们的西服便会表现得整洁如新，显然在死前不久刚刚被熨平。同样地，如果尸体穿着皮鞋，那么他的皮鞋也会被擦得锃亮。
//
//每一具尸体的手中都提着一个老式公文包。公文包中可以发现一些平平无奇的物件：最常出现的是装有自制晚餐的便当盒、文具与水瓶，但除此之外，不同尸体的公文包中也有一些独一无二的东西。如果这些公文包中的补给尚未被取走，则流浪者应最大化利用这份无人看管的口粮。这片开阔世界中的补给十分稀缺，你身边的环境也不一定能满足你最基础的需求。
//
//至今为止，这些尸体的面容尚不能与任何已知的活人相匹配。这些尸体完全没有指纹，对他们进行的DNA测试也无法取得有效成果。尽管这些尸体谜团重重，但这是他们唯一的生理学异常。如普通的尸体一般，他们也会枯朽、腐化，最终只留下一具白骨。
//
//目前，我们无法查明这些尸体可能的来源，也不清楚其在后室各处出现的原因。不论我们对其已经有了多少了解、又还有多少有待查明，可以肯定的是，哪怕是在最绝望的时候，也要留心那些地上趴着的尸体。package wupin;
//
//public class shiti70 {
//
//}
package wupin;
public class shiti70{
}