//躯器编号：Flesh C-78
//
//代价：小
//
//安装位置：骨骼
//
//生产商：水煮骨髓由有识血肉学者氏族主导研发并在各有识血肉贸易巢进行批量生产后交由“躯”售卖，因此仅保证安装过程无危险，对产品本身性能有任何疑问或建议请直接与有识血肉对接。
//
//介绍
//水煮骨髓是一种经过基因改造批量生产的骨细胞集群套装，可在拆解原有骨骼钙质晶格并进行结构优化后加入再金属丝线框架提高骨骼强度，并且不会产生后遗症和排异反应，该技术也被广泛运用于活体建筑骨骼框架构件和战斗用骨骼护甲构件。
//
//通常一个标准的水煮骨髓会包含一个能够自主完成注射工作的活体注射装置和一系列经过调配的微生物和组织，以及一个小号容器装着的“蘸料包”，具体微生物和组织配比如下。
//
//“盐”
//是一些外观近似噬菌体的小型遗传物质注入装置，会主动搜索成骨细胞并附着其上向其中注入改良RND片段，这些片段会进入细胞核的DNA复制序列并导致成骨细胞的DNA出现变化获得升级需要的功能。
//
//“味精”
//是一系列有较强溶解能力的微生物，在“盐”将成骨细胞稳定后会快速在骨骼外围制造向下的入口以供其他细胞进入，同时会对原本骨骼的钙质框架进行溶解并拆解不被识别的外来入侵物，是免疫系统被“花椒”麻痹后的暂时替代品。
//
//“花椒”
//是由一部分编辑后的源免疫系统细胞构成的特殊攻击性组织群，会对免疫系统造成一定程度的蒙蔽和瘫痪以保证升级工作顺利进行，同时这些细胞也会向躯体发出指令让躯体误以为该区域正在进行伤口修复工作因此提供更大量的资源支持。
//
//“开水”
//是经过改良的大型寄生虫，会吃掉升级过程中产出的废料并产生大量角质层用于重新支撑起神经和血管网络来保证在没有骨骼固定期间神经和血管不发生移位，同时这些角质层也是支撑金属框架生长的模板。
//
//“大料”
//是改造的主体：一种经过特殊修正的腐金葡萄能够命令其他腐金葡萄将体内的金属元素析出聚集在自身附近并对此进行进一步加工，输出一种强度较高且含有金属单质和金属盐混合的茧状硬质框架。
//
//说明
//如何使用： 尽管注射完成后剩余生长过程过程基本是自动完成，但出于流程透明的需要以及少部分仍然存在需要注意的内容，还是向您介绍水煮骨髓的使用流程。
//
//一、 您需要在自己准备进行升级的骨骼附近注射水煮骨髓：首先定位您需要升级的骨骼位置并将注射器覆盖于皮肤上1，打开注射器后部甲板并按压其肌肉组织进行启动，注射器腿部开始抓握您的皮肤固定即为启动成功。
//
//随后注射器口器会自动接入您身体并找到最接近的骨骼进行注射，完成后坏死脱落，此过程大约需要1~2小时。
//
//二、 注射进入身体的细胞套装会快速根据其职责划分完成位置部署和基础工作准备。
//
//三、确定各分工后水煮骨髓会立刻开始行动，“盐”会寻找最近的成骨细胞进行变异，完成变异后的成骨细胞能更高效的分解骨骼表层并且可以一定程度上融化骨骼里层。
//
//同时“花椒”会开始分泌信息素蒙蔽免疫系统，其他细胞聚集成以味精为带头的小规模团块状，各个部位完全到达指定地点需要一天左右。
//
//四、升级过的成骨细胞将骨骼表层破坏后味精会继续向下呈小孔状渗入，其余部分会跟随味精快速向下，“开水”开始吃掉已经完成任务的“盐”和部分被杀死的免疫细胞，并以此作为养料分角质层支架。此阶段您的骨骼会变得极为脆弱，容易折断和损伤，所以为了不留下后遗症请在此阶段静养10~15天。
//
//五、成骨细胞和“大料”在完全破坏的骨骼基础上重新长出新的骨骼，此时请您打开我们为您专门准备的蘸料包并按照说明书定期服下药物，这些药物是改良后的腐金葡萄制成，带有足量的金属供给“大料”对您的骨骼进行升级。
//
//“大料”会比成骨细胞更快投入修复，将金属单质聚集在“开水”的角质层内，由于角质层无法析出而快速累积金属，最后转化为金属框架。
//
//原本的成骨细胞会按照预定路线继续进行骨骼生成，用钙质层像覆盖普通骨骼一样覆盖金框架，在这一过程中“大料”会向钙质晶格中加入金属细线，让整体骨骼在保留金属韧性的情况下不会像无机物肢体一样引发严重排异反应，这一过程需要15~20天。
//
//六、改造完成，现在您可以自由享受远比曾经坚韧强壮的多的骨骼，同时改造过的成骨细胞会继续保留并逐渐演化出近似单细胞生物的生存能力，这使得您在开放性创口未愈合的情况下仍然可以展开骨骼修复生长，而升级后成骨细胞更大体型也让生长或是拆解变得更容易，从理论上说这能有效提高您未来的抗击打能力。
//
//注意：
//
//一、 若注射器尚未注射完成并自动脱落，请立即联系周边有识血肉成员，这可能代表您的骨质不足以承受升级等一系列原因。
//
//二、 请不要在短时间内同时对两块以上的骨骼进行升级，您的身体难以承受如此大量的金属元素和养分供应需求，除非您已经接受了其他针对内分泌系统和消化系统的大规模改造。
//
//三、 由于升级过程中需要暂时蒙蔽免疫系统，所以请不要让您正在进行升级改造的区域产生伤口，若是确实产生伤口，请立即找最近的有识血肉巢穴进行杀菌和修复工作2。
//
//四、该升级确实会导致身体体重增加，但“躯”保证您的体型相比之前不会有变化，所以不对使用此手术升级后的肥胖或是身材焦虑负责。
//
//五、请勿在未使用水煮骨髓的时候使用发配的蘸料包，否则极有可能引发严重的重金属中毒甚至可能致命。
//
//获取
//目前其标准版可通过流浪商人处购买，若是希望购买实验版的探索者可以前往有识血肉城市购买，实验板的价格仅为标准版的1/10且功能更强3。
//
//若是不愿意等待水煮骨髓长成也可以直接购买完全版，分别是量产型完全版和定做型完全版，其中量产型完全版价格与原版水煮骨髓相当，但是适配性较差，可能会出现轻微的排异反应并且骨骼修复能力会下降。
//
//而定做型完全版则是需要采取使用者基因并在专门的生化培养舱中进行培养的专属骨骼，100%适合且不会产生排异反应，但是价格要昂贵的多。
//
//如果您能抽出大约两个月左右的时间并且资金充足的话，强烈推荐您直接前往level C-309进行一次全身改造，如果选择全身改造我们也能为您附赠一系列诸如肌肉增强和自愈能力加强等的改造手术。
package wupin;

public class shuizhugushui1078 {

}
