//Object C-65 - “说唱烟草”
//评分: 
//+12
//+
//–
//X
//统合物品分类系统
//物品编号 #：C-65
//位置：“后室娱乐”相关层级
//安全性：中性
//用途：
//麻醉/实体驱散
//状态：
//易获取
//物品编号：Object C-65
//
//说唱烟草是一种可以驱散部分实体，并带有一定麻醉作用的烟草。
//
//photo-1584825093714-f5d917af9317?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8Mnx8dG9iYWNjb3xlbnwwfHwwfHw%3D&auto=format&fit=crop&w=700&q=60
//平铺在纸上的说唱烟草。
//
//描述
//说唱烟草通常为棕褐色的烟丝或烟叶，并带有较淡的松香。
//
//在被售卖时，说唱烟草通常被装在一印有“后室娱乐”logo的方形铁盒当中。当说唱烟草或与说唱烟草相连的可燃物触碰到铁盒上的logo时，后者将发出足以点燃前二者的热量。
//
//tea-caddy-1646043_1280.jpg
//盛放说唱烟草所用的铁盒。
//
//用途
//驱散实体
//在流浪者吸食说唱烟草后，其身上将发出一种类似杏仁水或原味幸运豆奶1的气味，同时夹杂着类似动物油脂的味道。这种气味可以有效的驱散有嗅觉的实体2。
//
//在吸食说唱烟草的同时，流浪者将开始出现一系列症状，这一系列症状被称为“说唱病”，具体表现为：
//
//说话时会开始押韵，严重时将会改变患者原想表达的意思3。
//性格会变得外向，且变得自高，自大。
//会突然对音乐表现出极高的兴趣和天赋。
//开始渴求如轻松可乐、记忆汁等具有依赖或成瘾性的物品4。
//上述症状将会在吸食说唱烟草后逐渐消退，若长期吸食该物品，“说唱病”的消退时间将会越来越长直至无法消退，同时，其症状也会愈发严重，故不建议长期吸食说唱烟草。
//
//麻醉
//说唱烟草经水煮后，会产生一种淡黄色的胶状物体，在食用该物体后，流浪者将会在饮用后的一段时间内失去知觉5。故说唱烟草通常被用来进行手术前的麻醉。
//
//获取
//说唱烟草可以在Level C-70的商店中、Level C-140中、以及“后室娱乐”的销售员手中获取。
package wupin;

public class shuochangyancao1065 {

}
