//package wupin;
//
//public class siweigongzhenzhuangzhi1109 {
//
//}
//Gear C-109 - “思维共振装置”
//评分: +13+–x
//Gear C-109 思维共振装置
//管理措施
//如果你读到了这个版本的文档，请尽快执行以下措施。你必然清楚它们是什么物品。
//
//除去使用落舟湾化身芯材的装置，现有的全部Gear C-109应及时统一回收并销毁，并进一步确认其与活偶之王、傀儡吾形及疯言杀手的联系。
//
//重新修订安全条例，明文禁止使用该装置攻击以上三类实体。应组织对全体Gear C-109使用者的二次培训，务必使其铭记新的安全规范和使用条例。
//
//尽快安排事故D3-1985-08-1受害者常██的后续处置措施。目前暂定为赔偿其身心损失，并将常██调离任何可能涉及频繁切入/切出的专业及职位，以免因误切遭到与“活偶之王”有关的二次伤害。
//
//那个东西已经盯上我们了。它想把船民们也转化成任它摆布的活偶。
//
//描述
//
//Gear C-109，通称思维共振装置，是一类能够放大思维对现实影响能力的小型奇术装置，以蘸水笔外形在层级中随机出现，被制造时则统一为扳手外形。目前我方仅能使用和层级意识有强关联的材料作为核心，制造拥有相同功能的装置。
//其实就是从我化身上拆下的材料。它们可以当作落舟湾的房间看待——正看着这份材料的你应该明白这意味着什么。如果你本来就在用被制造的思维共振装置，那你就是握着我的身体和我共振思维，进而改变你周遭的现实。
//
//第一件Gear C-109获取自狭窄岩洞的水池中，外形近似蘸水笔。关于其发现，详见发现报告S2-1855-06-3。此后，Gear C-109在多个层级被反复发现，且总是表现为相似的外形和材质。
//
//对自然出现在层级中的Gear C-109的拆卸及分析实验表明，该类装置由笔头、空心木质笔杆及少许纤维填充物组成。移除其中填充物，更换为当时可获得的其他材料后，装置失效；将填充物装入其他材质的外壳内，则仍保持原有效果。当时技术未发现其填充物的异常性质，Gear C-109的逆向工程因此停滞。
//
//我们收到了包着诱饵的鱼钩。它好用得过了头，哪怕给普通的大齐人拿上也能让他们更轻松地出入一方又一方的世界。
//
//01
//
//
//
//
//在落舟湾出于好奇将少许化身组成材料当成填充物放入笔杆之后，转机出现了：组装好的Gear C-109起到了强于原装置的效果。此后，该材料被用于复刻Gear C-109，并通过改良的处理仪式提升其灵敏度。
//
//用我的身体制造的装置是安全的，但这仅仅是因为我对你们没有恶意罢了。
//
//我方自行制造的Gear C-109复制品展现出额外的性质：当使用者对现实的影响力强到一定程度，且落舟湾化身在附近时，后者能够被动地感应到前者的强烈想法。此外，使用者进行切入时，若落舟湾化身位于目标层级，则前者倾向于切出到后者附近。以上性质并未得到过多注意，直到事故D3-1985-08-1发生。
//
//我早该注意到的。既然它们能指向我，也应该能指向其他的存在才是。不知道为什么，我完全没往这方面想过，甚至在出事以后都无法主动去思考“思维共振装置有问题”的可能性。为什么？
//
//该事故导致常██切入无记录层级，并受到层级内实体活偶之王影响，其个人信息因此带有轻微的认知危害，具体表现为无法被准确记忆。检查结果表明，常██的部分生理特性有向层级内另一类实体，受活偶之王精神控制的傀儡吾形转变的趋势。目前，常██没有受到不可逆的精神危害。
//
//按照规定，我得等到常██恢复过来，再让……他？还是她？来命名那个该死的层级。检查那天我也在场，常██的那个部位已经什么都不剩了。
//
//考虑到“活偶之王”这一名号，全部由船民组成的“卫耀”突击队开展了对敌对活偶类实体的清除和捕获行动。全部被击杀和俘获的实体均表现为近似结构和生理特性：它们内部不包含体液，却有相近的器官分化。其内部器官与从常██体内取出的异常器官构造高度相似。对无尽麦田中获取的文中人尸体进行解剖，结果表明该实体同样存在器官分化，但仅限于四肢。
//
//在“卫耀”小队的行动中，所有实体均表现出不可交流特质和对“活偶之王”的狂热崇拜，以及疯狂的、针对人类的杀戮倾向。与常██在待定层级的遭遇类似，这些实体称“卫耀”突击队成员为“迷途的羔羊”，反复尝试向后者灌输成为“王的子民”的种种“好处”。向这些实体展示自然生成的Gear C-109时，它们将其称为“王的牧者”。
//
//在“卫耀”返回述职时，他们向报告附录中加了这么一句话：“……而舟楫之子将永不向活偶之王屈服。我们的精神是自由的，我们永远是自己心灵的主人。”
//
//这话说到点子上了。
//
//02
//
//
//
//
//用途
//
//由于该类装置能够极大地增强使用者仅凭思维扭曲现实的能力，Gear C-109曾广泛用于突击队武装和建设兵团用工具，以提升效率和降低成本。考虑到自然生成的Gear C-109与实体活偶之王的联系，该类装置有极高风险，目前正回收并统一销毁，改为使用指向落舟湾的逆向工程产物。寻找其他安全的替代核心材料已提上日程。由于其材料来源，不可能向任何其他组织提供该物品。
//我能做的也只有这些了。它认为我们抗拒不了如此方便的诱惑，殊不知我们早就不再信任这等天下掉下的馅饼。思维共振装置是强大的武器，也是好用的工具；如此方便的东西，只有知根知底才能让我们安心，再不济也要尽量握在自己手里才是。
//
//我们的前辈见过无数不求甚解，对着某些事物顶礼膜拜的存在；它们所膜拜的东西“活”了过来，将它们吞噬殆尽。失落军团那群蠢货也是这样，而“活偶之王”正好是他们拜的其中一个“神”。算了，在文档批注里写脏话影响不好。
//
//附录
//发现报告S2-1855-06-3（概述）
//日期：当地时间18██-██-██
//地点：狭窄岩洞
//事件描述：突击队“清理一新”进行了对前哨站“溶洞驻点”及附近区域的例行蜘蛛清理工作。在12:00至15:00之间，“清理一新”成员赵█不慎坠入杏仁水池，所幸其他成员及时将其捞起。当日稍晚，赵█更换服装时，在其上身打底衣口袋中发现了首件Gear C-109。此前，全体参与行动的成员并未脱下或解开赵█的外套，更不可能将任何物品放入此口袋。该物品被送回测试，以确定其用途。
//
//思维共振装置相关试验（节选）
//
//除以*注明的部分，以下试验皆按照当前版本标准试验流程。
//由带有爆破类天赋能力的受试者使用该类天赋能力，对标准粗钢原料锭进行爆破，根据痕迹计算当量	Gear C-109将平均爆破当量提高了350%
//受试者使用标准奇术“无刀短刃”纵向分割标准粗钢原料锭	Gear C-109将平均切割时间缩短了70%
//受试者使用已上报的自行改进版本“无刀短刃”纵向分割标准粗钢原料锭	Gear C-109将平均切割时间缩短了74%
//受试者使用标准奇术“无刀短刃”自由雕刻标准粗钢原料锭	Gear C-109将平均切割时间缩短了82%
//*在不告知真实用途的状况下，将Gear C-109赠予未掌握奇术的大齐平民	受试者随身携带其3～5日后，切出能力开始提升，约3周后不再继续提升切出能力。此后，受试者切出用时平均减少了30%
//*在前一步基础上，详细告知受试者Gear C-120的用途	受试者持有的Gear C-120均因巧合被收缴或丢失，未取得任何观测数据
//03
//
//
//
//
//
//
//
//越是涉及到“创造”，它便越强。看来，Gear C-120将人类的“天赋能力”当成了“切出”，才造成了最后那两个试验的结果。
//
//自从常██那事以来，我们开始怀疑那些巧合全是“活偶之王”的安排，但谁也找不到半点证据。我们至今仍在缘由未知的恶意注视之下。
package wupin;
public class siweigongzhenzhuangzhi1109{
}