//package wupin;
//
//public class siweishenghuashiji1150 {
//
//}
//bject C-150 - “思维升华试剂”
//评分: +25+–x
//警告
//本文档属于权限类别γ类文档，如无特殊情况，严禁任何非E.P.B.内部成员访问。
//最近更新时间：20██年8月█日
//
//
//登录验证
//
//请输入您的E.P.B.干员序列号
//
//帐号	
//***********
//密码	
//•••••••••
//登出
//本物品档案由正电子后室有限公司（E.P.B.）1资料库收录。
//物品编号：C-150
//
//思维升华试剂(cogitation extraction reagent，可简写为CER)是一种可精准靶向大脑特定区域，并刺激脑电波产生的一组试剂。
//
//siwei
//一瓶正在沉降的思维升华试剂α。
//
//描述
//思维升华试剂是由多种经EB-12转化后的后室原生物品混合而成的制剂。这些制剂根据配方的不同，可以刺激人体大脑的不同区域，使得人脑的某种脑波显著增强，部分制剂可显著影响人的情绪和思维，因而该种制剂被称为思维升华试剂。
//
//由于缺乏精密的仪器，生化科学部的研究人员暂且无法确定这些制剂是通过何种途径刺激脑细胞，绝大部分的制剂是在优化镇静类药物比例时偶然发现的。由于这些制剂所用的原料大多为在后室中原产的物品3，这些物品本身的机制仍未探明，因此研究思维升华试剂的原理需要首先弄清楚这些后室原生物质自身的作用机制4。
//
//试剂种类及功效
//目前E.P.B.已经成功制备了四种思维升华试剂，这些试剂的制备方法、功效都大相径庭。但他们都具有一些共同特点：
//
//必须使用经EB-1纯化后的物质制备。
//必须使用后室原生物品制备。
//不稳定，必须在4摄氏度、惰性气体氛围下保存。
//下文将详细介绍各种制剂的制备方法与功效。
//
//思维升华试剂α
//思维升华试剂α是第一种被发现的制剂，它的主要功效包括诱导浅睡眠和刺激大脑的α波的产生。
//
//aerfa
//一瓶储存于安瓿瓶中的思维升华试剂α。
//
//制备方法
//1.取等质量的清幽之菊提取物，悲伤之水结晶，溶于50倍质量的医用级杏仁水中，充分搅拌至完全溶解。
//2.随后将混合液加热至50-60摄氏度，剧烈搅拌24小时。
//3.过滤除去不溶的杂质，再将混合物送入EB-1中进行一次反应，便可得到所需试剂。
//性状
//暗红色粘稠液体，久置后会沉降，使用前需摇匀。
//
//功效
//荧光成像显示，α试剂主要在桥脑与小丘脑两个区域富集，小鼠实验显示约0.5-1.5mg/kg小鼠体重的α试剂会让小鼠进入浅层睡眠，并且其α脑波会显著增强。在人体中观察到了类似的现象，受试者反映他进入了一种类似清醒的梦境。
//
//毒性
//分级-中毒
//口服-大鼠 LD50: 7450 毫克/公斤; 口服-小鼠 LD50: 3450 毫克/公斤
//
//应用
//安眠剂
//定向诱导α脑波
//捕获实体5
//受试者反馈6
//“一种奇妙的感觉，虽然说像是浅睡眠，但是我确定我的思绪依然是清晰的。我甚至能感觉到我的呼吸、我能看到我在睡眠中的小动作，这种感觉就像，我在以一个旁观者的视角看着我自己，仿若我的思维从身体脱出，成为了周遭世界的一双眼睛在观察着自己，但却没有办法控制自己。”
//
//— by 一位来自E.P.B.的志愿者
//
//思维升华试剂θ
//思维升华试剂θ是在寻找更强效镇静剂配方时被发现的，它的主要功效包括诱导深层睡眠和刺激大脑的θ波的产生。
//
//zeta
//在黑暗中显现荧光的思维升华试剂θ。
//
//制备方法
//取质量比为1：20清幽之菊提取物和记忆汁，在烧瓶内逐步升温搅拌，至约80-85摄氏度时，清幽之菊提取物完全溶解，随后停止加热。
//2.将混合液于室温下缓慢冷却，冷却至室温后再转移至4摄氏度冰箱中进一步冷却结晶。
//3.4度下放置过夜后，得到浅黄色棱形晶体，过滤得到晶体，晶体溶于20倍体积的医用级杏仁水便可得到所需试剂。
//性状
//淡黄色液体，有刺激性气味。
//
//功效
//荧光成像结果显示，θ试剂主要定位于桥脑与延髓，受试小鼠在注射了约2mg/kg小鼠体重的该种试剂后，出现了显著的镇静现象，并且θ脑波的信号增强。用于人体可使人进入深度睡眠，但过量极易造成休克现象。
//
//毒性
//分级-高毒
//口服-大鼠 LD50: 2730 毫克/ 公斤; 口服-小鼠 LD50: 269 毫克/ 公斤
//
//应用
//镇静剂
//定向诱导θ脑波
//抵抗层级的精神影响7
//受试者反馈
//“说实话，自从来到后室，我便再也没有过安稳的睡眠，但这个制剂让我回忆起了前厅中毫无顾虑的睡安稳觉的日子，那时的我从未想过会有一天连入眠对我都会是奢求。当我醒来后，我感觉自己充满了力量，我的思绪从未如此清晰，我的大脑似乎团结了在了一起，周遭的影响已经变得微不足道，即使是最恐怖的路段，似乎也不能影响我的思维一分。我从未像那一天那样如此的坚定过。”
//
//— by 参加临床实验的流浪者
//
//思维升华试剂β
//思维升华试剂β是是一种剂量依赖型兴奋剂，它的主要功效包括提升使用者思考的效率和刺激大脑的β波的产生。
//
//beita
//新鲜制备的思维升华试剂β。
//
//制备方法
//1.取质量比为2：1忆晶和悲伤之水结晶，于研钵中充分碾碎，用高浓度的盐水洗涤三次，再用蒸馏水洗涤三次，随后真空干燥除去水分。
//2.将干燥后的混合物溶解于记忆汁与医用级杏仁水的1:1混合液中，便可得到所需试剂。
//性状
//蓝色液体，有芳香的气味。
//
//功效
//荧光成像显示该种试剂在脑中的定位主要集中于小脑与脑皮层。根据注射的浓度不同，会对受试者产生不同的影响，注射剂量维持在0.1-1mg/kg时，受试者反映自己的大脑似乎更加清醒，并且十分放松；注射剂量维在1-2mg/kg时，受试者处于一种较为兴奋的状态，大脑处理信息与进行运算的能力都大大提升；注射剂量维在2-4mg/kg时，受试者则表现出明显的激动与焦虑，具体表现包括心跳加速、易怒、无法集中精神等；超过4mg/kg的实验由于安全性考量未被批准。
//
//毒性
//分级-剧毒
//口服-口服-大鼠 LD50: 42 毫克/公斤；口服-小鼠 LD50: 26 毫克/ 公斤
//
//应用
//兴奋剂
//定向诱导β脑波
//急救8
//受试者反馈
//“如果可以的话，我不想回忆起那种感觉，但是，这是我的任务，我知道，我在参加时就知道了。一开始，那针管将蓝色液体注入我的身体的时候我感到了难以想象的平静，这不是那种失去了所有听觉的安静，而是平静，就像身处于暴风眼一般，纵然周遭是呼啸的狂风，我的思绪却仍然是如此的平静且明晰，就像是，就像是我在主导着这风暴一般。但是随着注入的剂量越来越多，这种感觉逐渐消失了，我能感到我的五感正在消散，只有第六感，我的心灵仍在运作，我不知道再注射一点是什么结果，但我知道，那时的我肯定已经在生与死的交界了。”
//
//—by E.P.B.士兵受试者的反馈
//
//思维升华试剂Sigma
//根据E.P.B.保密协议，该种制剂的信息在此处不予显示。
//
//如若查看该种制剂的相关信息，请移步至“后室拓荒计划”页面。
//
//感谢您的配合。
//
//临床记录与异常报告
//在该部分列举了上述几种制剂的经典的临床反应与一些异常的报告9。该部分的数据可用作临床使用思维升华试剂的参考。
//
//如若您只是该种制剂的使用者而并非研究者，您只需要参考生化科学部发布会的资料即可。
//
//_
//+ 展开生化科学部发布会的记录- 收起
//
//时间：11/09/2022
//地点：六角阁会议发布中心
//培训人员：白曦
//
//视频记录开始
//
//参会人员依次入座后，白曦带着一个低温药品盒来到讲台上。
//
//白曦：欢迎各位研究员来参加此次的发布会。我想大家之前应该都读过关于思维升华试剂的简单报告了，那么首先我将介绍一下该种制剂的特点，随后将带大家了解一些关于该种制剂具体应用。
//
//白曦打开药品盒，将其中的试剂架拿出，其中放着若干管颜色不同的试剂。
//
//intensity
//思维升华试剂刺激后脑电波平均强度相对于对照组的强度倍数的统计学分析。
//
//白曦：思维升华试剂，顾名思义，它的作用是影响人的思维。近年的科学研究使得我们对于人脑的奥秘了解的越来越多，我们都知道人的思维源自大脑内的电信号，通过检测脑波，我们便可以对于人的思维进行一定程度的了解。而思维升华试剂最大的特点便是显著提升这些脑波的强度，从而从不同方面影响到人的思维，所谓的“升华”正是这层含义。
//
//白曦从试管架中拿起一管红色的试剂。
//
//白曦：我手上拿的这管制剂便是α制剂，它的作用便是刺激α脑波的产生，使人进入一种特殊的“清醒梦”。该种制剂不仅可用于临床的脑科学研究，它也是极佳的助眠剂，由于其毒性相对较小，因此较之其他种类常见的安眠药要更加安全，现已在E.P.B.的医疗机构中开始进行小范围的推广。
//
//白曦将红色的制剂放回，又拿起一管黄色的制剂。
//
//白曦：我们的第二个成果是在寻找更优的镇静剂配方中发现的。这种制剂的药效要显著强于我们现在临床上使用的镇静剂，但可惜的是它仍然有一定的风险性。不过这种制剂在稀释后可用于抵抗层级的精神影响，这一效果已被勘探部的同事们所证实，现已作为勘探部的特供制剂被使用。之前对于光栅的探索中，该种制剂便发挥了重要的作用。
//
//白曦顺势拿起最后一管蓝色的制剂。
//
//白曦：最后一种制剂，也是最为危险的β制剂，它作为一种兴奋剂仍然不能安全的用于人体。临床的多篇报告显示该种制剂在高浓度下对人体的危害是巨大的，这也是我们至今未能将这种制剂推广的原因。
//
//白曦将这些制剂放回低温药品箱。
//
//白曦：考虑到我们的终极目标的需要，现在我们在尝试开发β制剂的优化版，以期望减少β制剂的副作用。另外，我们在研究的过程中还有着不少有趣的发现，这些发现给我们优化制剂带来了新的思路。诸位想必都听过“思维是有重量的。”的论断，但这种论断是否为真？却是难以证实的，但我们的发现似乎提供了该种论断的可能线索。这也引得我们的思考，我们都知道思维不过是一种电信号，为何他会引起重量的变化？这一点是令人费解的，但或许换一种角度思考能给我们一点提示。长期浸润在思维升华制剂的脑类器官会出现重量的衰减，但正常培养的器官就不会，他们二者的区别或许就在于思维升华试剂的浸润强迫大脑在进行着高强度的脑电波释放，并且在没有头骨的屏蔽下，这些波会在外环境中逐渐耗散。或许这种脑波的耗散便是重量衰减的原因？或许他们就是思维重量的来源？这些猜想，仍需要我们去进一步验证。
//
//台下议论纷纷。
//
//白曦：那么接下来我将介绍我们后续…
//
//视频记录到此终止。
//
//_
//+ 展开思维升华试剂α的临床报告- 收起
//制剂3.110的临床报告11
//研究单位：生化科学部脑科学研究中心
//研究员：白曦，“66”，“四方月”
//研究日期：17/09/2021
//研究目的：评估该种制剂对于人脑的效果。
//实验设计：根据在小鼠实验及人体类器官中得到的数据，设置了大致的浓度范围。对于实验组志愿者注射不同浓度的制剂后，分别在注射后特定时间检测其脑电图，并随时进行心理状态等情况的评估，对照组仅注射生理盐水。
//受试者情况：受试者为从E.P.B.多个部门募集的志愿者，年龄在18-40岁之间，男女比例为1:1。将受试者分为六组，其中一组为对照组，五组为不同浓度的实验组，每组约6-7人。
//EEGchange
//受试者在注射该种制剂后的脑电波图的变化，从上而下分别为：未注射时（上），注射后（中），进入睡眠后（下）的脑电波图像。
//
//实验结果（摘录）：几乎所有受试者在接种该制剂后很快进入了睡眠，脑电图显示在睡眠过程中受试者的α脑波显著增强，平均强度是对照组的5.6倍,具体图像如右图所示。在受试者醒来后该种效应便消失，对大部分受试者的采访有着类似的回答，即他们均进入了一种“清醒梦”，这与临床上的浅层睡眠类似。
//不良反应：在该次临床实验中未发现明显的不良反应。
//结论：该种制剂可较好的诱导浅层睡眠，并且并未出现显著的不良反应，未来或可考虑用于安眠剂。关于该种制剂促进α波的产生的原因暂不清楚，需要进一步的实验来探究。同时，根据对于受试者的回访，以及研究人员的试用，我们感到似乎该种“清醒梦”似乎有别于浅层睡眠，大部分受试者与研究人员表示仿若在梦境时在以一种第三人称看向进入睡眠中的自己，虽然在该状态下似乎无法对于现实进行任何干扰，但所有受试人员都声称在此时思维是清晰的，这种现象仿若思维跳脱了身体之外。对于这种特殊的“清醒梦”现象目前我们仍然知之甚少，需要在后续实验进一步进行探究。
//_
//+ 展开思维升华试剂θ的临床报告- 收起
//制剂7.6的临床报告
//研究单位：生化科学部脑科学研究中心
//研究员：白曦，“66”，简
//研究日期：21/11/2021
//研究目的：评估该种制剂在人体内的安全浓度。
//实验设计：先前的小鼠实验证实，该种制剂的镇静效果极强，在小鼠体内过量极易造成小鼠的死亡。因此该次实验仅在极低剂量下进行，在受试者出现较好的镇静效果后即停止后续的实验。
//受试者情况：受试者为从诸多流浪者定居点招募的流浪者，年龄在25-50岁之间，男女比例为1.3:1。将受试者分为八组，其中一组为对照组，六组为不同浓度的实验组，预留一组为前六组浓度均未得到较好效果时启用的备用组，每组约5人。
//injection
//志愿者在注射制剂后的脑电波图，红色箭头为根据药代动力学及脑波变化推测的注射制剂到达脑部发挥作用的时间点。
//
//实验结果（摘录）：在第四组时便已得到较好的镇静效果，出于安全性考量，未进行第五组的实验。脑电波图显示，即使是低浓度的该种制剂，已经足以致使θ脑波的显著增强，并且造成脑电波图的大幅波动。
//不良反应：在该次临床实验第四组仅出现一例不良反应，该名受试者出现了呼吸紊乱、心跳减弱等现象，并且常规的肾上腺素疗法无法起到效果。经过一段时间的心脏起搏后，我们成功让该名受试者的心跳恢复。
//结论：该种制剂确实可发挥较强的镇静效果，不过其风险性仍然较大。后续需要在第三组与第四组之间继续寻找风险性更小的浓度。
//附：另外，有三名曾受试者在注射该种制剂后一同从Level C-289离开，他们表示在区域三遭受精神影响的效果显著减弱。根据他们的描述，他们仍能感受到来自层级强烈的精神干扰，但似乎自己的大脑在以一种更稳定的方式在运转，一个受试者声称“就像是月球围绕着地球，电子在轨道上运行那样稳定。”我们认为这种特殊的效应或许意味着该种制剂可用来抵抗部分层级的精神影响，应当在后续重点进行测试。
//_
//+ 展开思维升华试剂β的临床报告- 收起
//制剂23.2的临床报告
//研究单位：生化科学部脑科学研究中心
//研究员：“66”，“四方月”
//研究日期：06/02/2022
//研究目的：评估该种制剂在极低浓度下的对人体的效果。
//实验设计：结合三维类脑器官的数据，该种制剂在极低浓度下应该是相对安全的。为了证实我们对于该系列制剂的猜想，我们计划推进该项风险性较大的实验12。根据体外数据，该种制剂的注射浓度不应超过4mg/Kg，故我们设置在该浓度下的一系列梯度浓度进行测试。
//受试者情况（节选）：受试者为从E.P.B.武装部队筛选出的身体素质较好的青年与部分转化者。
//HE
//小鼠实验中，注射高浓度该种制剂后肺部组织的染色图。图像显示出肺组织的高度损伤，代表该种制剂的全身毒性较强。
//
//实验结果（摘录）：实验结果符合我们的预期，即在低浓度下出现该种制剂可显著提升受试者的注意力、思考效率等，但在浓度超过阈值后，这种效果将逐渐转变为过度的兴奋状态。
//不良反应：在该次临床实验中未发现明显的不良反应。
//结论（摘录）：该种制剂的实验结果确实证实了我们的猜想，即人体内绝大多数脑细胞并未在真正发挥作用，他们更像是在进行随机的信号传导或是迁移活动。该种制剂似乎可以调节这些脑细胞的功能，使得它们按照我们的想法进行行动，这也是思考效率提高的原因，但在过高的浓度下，该种制剂最终会影响到一些调节正常生理活动的脑细胞，这也是该种制剂毒性如此之强的原因。如若能减少这种负面效果，该种制剂应当可以显著改善人脑的利用率。
//_
//+ 展开思维升华试剂的异常报告一- 收起
//思维升华制剂在体外引起脑细胞的一种异常活性状态
//报告人：“四方月”
//报告时间：18/04/2022
//间介：当在体外类脑器官中使用任意一种思维升华试剂配方，当浓度超过一定阈值后，大量边缘区域的脑细胞的活性大幅下降，而位于核心区域的脑细胞活性却显著增强，并且表现出永生性。
//报告正文：
//在进行类脑器官的毒性实验时，我们选用了一些浓度远超过安全剂量的浓度来研究思维升华试剂对于大脑的破坏作用。
//confocol
//核心区细胞的荧光染色图像，蓝色代表细胞核，绿色代表细胞代谢产物。
//
//出乎我们预料的是，这些远超安全剂量的实验组并未表现出之前常见的脑细胞大量凋亡、脑组织萎缩等现象，虽然大量的脑细胞的活力显著减弱，代谢活性分析这些外围区域的脑细胞的代谢显著减弱，但通过染色分析我们确认这些细胞的结构完整，并且将这些细胞转移至正常的培养基中仍能恢复正常活性，这说明这些脑细胞并非真正死亡，而是更近似于进入了休眠状态。
//对于位于核心区域的脑细胞，如图所示，他们的活性则大大增强，具体表现为代谢活性显著增强、不停歇的进行细胞迁移、分泌出大量成分未知的蛋白质，并且与这些细胞接触的细胞也极易转化为“活性状态”或者“休眠状态”。在该种细胞的调节下，即使将思维升华试剂的浓度进一步提高也不会造成脑细胞的大量凋亡。对于该类脑的器官的进一步分析显示，休眠的脑细胞的某种具体的脑波会显著提升，而处于活性的脑细胞几乎所有种类的脑波的强度都得到了显著增强。
//我们尝试在小鼠实验中引入该种“活性细胞”，结果造成了小鼠脑细胞的大量坏死，受试小鼠在脑部原位注射该种细胞后的两小时内死亡。关于这种现象的具体原因尚不得知，仍需进一步研究。
//_
//+ 展开思维升华试剂的异常报告二- 收起
//思维升华制剂造成大脑质量的减少
//报告人：白曦
//报告时间：29/05/2022
//间介：对于长期浸润于高浓度思维升华试剂下的类脑器官的质量进行研究，发现其质量在不断下降，并且接近最低值。虽然细胞的活性并未受到显著影响，但类脑器官的信号传导、调节功能似乎与这种质量衰减呈现负相关的关系。
//报告正文：
//之前的研究发现，长期浸润在思维升华制剂下的脑组织的电信号与脑波强度随着时间的推移会逐渐下降。起初我们以为这是脑部细胞凋亡、或是脑细胞老化引起的。
//mass
//浸润在思维升华试剂（CER）中的脑类器官的质量损失折线图。
//
//当我们在处理一批浸润很久的的脑类器官时，部分操作员反映脑组织似乎比预想的要轻很多。这一发现引起了我们的兴趣，我们随机将较多准备废弃的组织进行称重，发现在浸润时间越久的组织中，其质量损失越严重，最高可达脑组织的30%，具体的质量损失情况如右图所示。但这些脑组织除了在信号传导等调节功能方面的下降，并未出现明显的凋亡现象。
//我们尝试培养了一部分重量损失较为严重的脑组织，但是常规的体外培养似乎并不能使其质量恢复。为此我们将这部分细胞放置于多种环境下，例如将这部分细胞移植到正常脑组织中。实验结果显示，在正常脑组织中，该部分的脑细胞的功能逐渐恢复，质量也有所提升。
//该次实验似乎让我们联想到一个经典的结论：“即人的思维是有重量的。”长期浸润于思维升华制剂的脑组织，其损失的质量究竟为何种物质？这种物质是否与人的思维有关联？这些问题的答案仍有待我们去发掘，但我们相信，如若能解开这个问题的答案，我们便能离我们的终极目标更进一步。
//保密协议与使用情况
//由于该种制剂潜在的风险与保密需要，该种制剂禁止对外销售，也不对外公布该种制剂的信息。任何参加该种制剂研究的人员必须要签订E.P.B.保密协定。
//
//目前，该种制剂仅向E.P.B.武装部队、勘探部、“迸进”高能实验室提供，并且使用人员需经过生化科学部的安全培训。其他任何人员若有必要理由使用该种制剂，请向理事会提交申请。
//
//鸣谢
//感谢诸位E.P.B.及流浪者志愿者对该项目的支持，感谢诸位实验员辛勤的工作，感谢实验动物们的付出。没有大家的支持，我们便无法开发出如此有价值的试剂。
//
//by E.P.B.生化科学部部长 白曦
//
//_
//○显示注释◎隐藏注释
//Footnotes
//1. E.P.B.的全称是正电子TM(后室)粒子科技有限公司(Electron-positivusTM Particle Technology Co.,Ltd. of Backrooms)。致力于使用最新的科学技术产品帮助每一位有需求的流浪者，帮助他们更有保障地在后室中生存与探索。对外宣称的目的是从微观视角探寻后室的奥秘，并让后室的资源造福人类。
//2. EB-1是生化科学部的一台特殊的自动化合成仪器，它的具体信息可在Level C-340中查询。
//3. 如记忆汁，忆晶，清幽之菊，悲伤之水等。
//4. E.P.B.分子工程部正在进行该方面的研究工作。
//5. 利用麻醉枪填充该种制剂，可对绝大多数实体产生较强的镇静效果。
//6. 这里仅列举最具有代表性的反馈作为参考。
//7. 仅在危急的情况下使用，使用前请确保自己知晓安全用量。
//8. 仍在临床实验的研究中。
//9. 即一些预期外且不会复现的反常作用。
//10. 3.1为实验序号。
//11. 该部分的实验报告均经过简化，删去了具体实验步骤与结论的分析。
//12. 在E.P.B.伦理委员会的讨论下，我们认为推进该项实验的收益大于其风险，故批准在适当的监管下进行该项临床试验。
package wupin;
public class siweishenghuashiji1150{
}