//package wupin;
//
//public class suqiezhongduan1049 {
//
//}
//Object C-49 - “速切终端”
//评分: +29+–x
//物品编号：C-49
//
//速切终端是一种与手机大小相当的仪器，通常仅由速切玩家协会提供给其会员使用。
//
//描述：
//%E9%80%9F%E5%88%87%E7%BB%88%E7%AB%AF.png
//一部速切终端。
//
//速切终端外表通常为深灰色（少数有蓝色、白色等其他颜色），重量约为100g~150g的类似于手机的仪器。外部有速切玩家的标志和一个较小的屏幕用以显示操作窗口，有计时、定位、导航等功能。翻开后能够看到一个较大的屏幕和操作键盘（具体样式参考下文说明书）。
//
//mapsample.png
//速切终端的屏幕示例。
//请注意：蓝色为流浪者，红色为实体，绿色为资源点。
//
//据悉，速切终端由E.P.B.所制造，速切玩家仅为委托者。E.P.B.称双方仅为商业合作关系。
//
//性质：
//速切终端的特异性表现为：不论使用者身在何处，其总是能精确定位使用者所处的层级（适用于所有在速切玩家资料库中记录在案的层级）及使用者本身或在速切玩家资料库有记录的社区、团体、前哨站在层级中的位置（仅适用于线性空间）。并根据使用者输入的目的地显示能够帮助使用者前往目的地的最短路径。若目的地不在本层级则显示最近的、能够帮助使用者前往该层级的层级出口，此出口不一定能直接通往该层级，但能够让使用者更加接近目标层级。
//
//当使用者完成路线选择及赛事选择后速切终端将开始计时，此时使用者将在视野的一角看到一个计时窗口1以及标记了已选择线路的小地图2；当使用者到达目标层级后，计时结束，成绩将自动上传至速切玩家资料库。
//
//在使用者切出时，速切终端能够检测使用者的切出类型，即能够检测使用者是否使用诺克立普贴、布兰奇的签名、赫尔墨斯装置等特殊物品切出，尽管这一作用的原理尚不能知晓。
//
//除此之外，速切终端被推测有能力干扰空间稳定性，以此增大使用者的切出概率或访问速切玩家协会中央服务器，但这一说法尚且无法证实。
//
//使用方法：
//速切终端的操作及其简单，以下是由速切玩家提供的指南。
//
//隐藏
//如何使用速切终端
//by 速切玩家协会
//一、速切导航
//
//1.翻开机盖。
//
//output2.png
//2.通过按键选择目的地及对应赛事。1
//
//3.按下“开始”键，开始速切！
//
//二、资料查询（需完整版终端）
//
//1.翻开机盖。
//
//2.通过按键访问资料库及对应条目。
//
//3.开始你的速切学习！
//
//三、访问社区（需完整版终端）
//
//1.翻开机盖。
//
//2.通过按键访问论坛讨论区或速切玩家在线聊天室。
//
//3.开始你的社交之旅！
//
//脚注
//1.按键因型号而异，此处展示为方向键01型普通终端。
//
//
//用途：
//如上文所述，速切终端能够为使用者提供定位、导航、路线规划等服务。因此使用者可以借助速切终端获取前往某一个层级的最佳路线、获取某些重要地点的位置信息或者帮助使用者从某些层级中脱身。
//
//速切玩家协会会将临时速切终端发放给报名者，同时为正式会员提供完整版终端。在举办速切竞赛时，也使用速切终端作为记录仪器。
//
//完整版的速切终端具有记录速切玩家赛事积分、访问速切玩家资料库、参与论坛讨论等其它附加功能。
//
//作者信息
//« Object C-48 | Object C-49 | Object C-50 »
//
//Footnotes
//1. 可以参考Speedrun中的计时窗口。
//2. 推测速切终端能够在视网膜上投影，然而这一原理同样无法知晓。
package wupin;
public class suqiezhongduan1049{
}