//Object 5 - “糖果”
//一个衣衫不整的男人来到了桌前。他的头发非常油腻。他的皮肤也很脏，在B.N.T.G的糖果矿里工作了一整天的他，全身沾满了已经风干了的糖分。在桌子另一边的，是一个女人，她有着红色的秀发，穿着休闲商务装。男人开口说话了。
//
//“嘿，听我说。我，呃——需要问你点事。”
//
//“当然了，这就是我在这里的原因，回答你们的问题。”
//
//“我可——能不能，呃，在下个星期和你请个假。万圣节快到了，我的女儿真的想要在十一层玩那个不给糖就捣蛋的游戏。她们要庆祝这个盛大的秋季节日和…”
//
//那个女人停顿了几秒钟，盘算着利润。
//
//“我们不是魔鬼。你随时都可以离开，但这么突然地请假，请的还是最有商业价值的假期之一那天，这会造成严重的影响。如果你在31号请假，我们会被迫将你的债务增加一百二十个点数。”
//
//“一百二十？！但是那会让我几个星期白干的。求你了，老板，就一天。”
//
//“这个数字无法改变，选不选取决于你自己。”
//
//“该死的。好吧，我会在万圣节上班的。”
//
//“很好。我觉得这是你的最佳选择。好好工作，你很快就能还清贷款的。”
//
//“是是是，无所谓了。”
//
//来自B.N.T.G的最新产品！
//
//万圣季即将来临，我们也知道所有人都想在Level 11玩不给糖就捣蛋的游戏！但是，我们明白很多人没有糖果来送给别人，尤其是最近很多的品牌都停产了。为了把你们从这种情况中拯救出来，我们决定大量生产单独包装的糖果！你可以在位于初生城或者是交易者之家的B.N.T.G超市中，以只需5个点数的价格买到一包一磅的糖果！
//
//PwNO9vVB6SHf2DW.jpg
//一磅装的Object 5。
//
//物品编号：5
//发现地点：从B.N.T.G.的商人处获得
//描述：
//Object 5是指一种由B.N.T.G.于2021年十月生产的，多种款式的糖果。目前无法从B.N.T.G那里得知他们得到如此巨量的糖果的方法，但据推测，他们找到了一个以大量糖果为自然资源的层级。这些糖果通常被单独包装并混合起来称重，最后以每包一磅的重量装进包装袋里。许多糖果的包装与前厅的糖果公司所生产的相似，例如Hershey和Wrigley公司的产品。在食用这些糖果后，人们会受到多种不同的轻微的超自然效果，这些效果可以持续数小时。
//   
//
//常见种类的糖果：
//   
//名称	描述	效果
//银舌头	小型的，舌头状的糖果，外形与真正的金属无异。它只会在被放入口中后融化，其他任何的加热方式都无法使它融化。	轻微地使食用者更容易被说服。
//咀嚼子弹	用银色的金属箔片包裹的子弹形状的巧克力。难以咀嚼。	食用者会短暂地失去所有触觉，但对痛觉感受器无效。
//枪	这是一种小型的，金属的，没有实际功能的枪。它们似乎是不可食用的，但是，直接把它整个吞掉会带来某种影响。因为它们会使人窒息，因此不建议流浪者食用它们。	食用者的手会暂时地转变成一把可用的枪。这些枪只会射出子弹状的巧克力。因为这些子弹是由巧克力制成的，所以不会造成太大的伤害。这些巧克力子弹不会具有Object 5所具有的特性。
//扁扁的Stanleys	一片薄薄的糖，被制作成人的形状。放在食用者的舌头上后，它很快就会被融化。	导致食用者以及身上的所有物品暂时性的变为二维的状态。当效果生效时，食用者会被立刻传送到最近的平面上。
//有害废料	极酸的硬糖，形状像是一个圆柱状的危害物品容器。食用者会出现严重的消化问题。	食用者的唾液会变得具有腐蚀性。这种特性对食用者的口腔非常不利，在大量食用后，牙齿和牙床都会受到严重的伤害。
//小小天才	粉色的威化糖果，上面会印有一些类似于“2+2=4”、“土耳其的首都是伊斯坦布尔”和“E=MC2”的标语。	食用者会报告感觉自己明显变得更加聪明，但经测试，他们的智力没有可见的提升。
//杏仁薄荷糖	O形的糖果，看上去与前厅的救生圈类似。食用者报告称它吃起来像是薄荷和杏仁结合起来的味道。	食用者会闻到清新的味道。没有其它的效果。
//十一层之鹰
//
//一个4年糖果成瘾者的自白
//
//回到2020年，当那些糖果第一次出现在第十一层的时候，我只是一个在初生城的后稀缺社会里享受的流浪者。我在the Meggies那里打工，除此之外，我的生活平淡如水。交些朋友。享受生活。
//
//时间来到十月，我的一些朋友厌烦了这种生活，所以我们就决定去参加万圣节的活动。我小的时候对万圣节没有兴趣，但我觉得现在就是找回童年所缺失的乐趣的绝佳机会。你觉得呢？所以，我找到了这件破烂的旧大衣，上面全是洞，就像是你在乞丐身上看到的那种一样，还有一个灰色的，平平无奇的面具，这样我就能装扮成钝人的样子了。我和我的朋友们互相玩不给糖就捣蛋的游戏，还一起和住在这个层级的友好的流浪者玩，然后从他们那里拿到了糖果。那天我们玩得很开心。
//
//结束之后，我和我的朋友分头回了家。喝了点酒然后开始统计那天晚上的收入，这就是事情的起源，你知道吗？就像，你突然发现，“这玩意还挺好吃的”，然后很快你就会对它上瘾。然后人们就会说“啊，我咖啡上瘾了”或者是“我对垃圾食品上瘾了”，但实际上这不算成瘾，直到你会不顾一切地想要再得到那些东西。你会背刺你的朋友，如果有必要的话，你甚至会去杀人。
//
//幸运的是，第十一层的效果阻止了我，让我通常只是去偷，而没有去到杀人的地步。我和我的朋友发明了一个小技巧，那就是在偷窃之前吃一个Stanley糖果，你就可以变成二维，从墙上的裂缝中走进别人的家里，需要逃走的时候就再吃一个。但这同样也很危险，如果在效果消失时你还在裂缝里，你就会被直接挤死。这件事情就发生在我的一个朋友身上，他吃了一个Stanley糖果，而在他逃跑的时候，主眼正在外面等着他，所以他只能在裂缝里等待他们离开。我是给他放风的人，你知道吗？我还没被主眼盯上，所以我可以安全地在那里等着，然后我就目睹了那件事的发生。当他还在等着主眼离开的时候，糖果的效果已经开始消失了，然后我就听到了我永远也不会忘掉的声音。这个声音不是他的尖叫声，尖叫声很快就结束了，而是他的身体在裂缝中被压碎时发出的可怕的挤压声。
//
//妈的，我在糖果成瘾的时候也干过一些坏事。我只是想凑够B.N.T.G.的点数，再买一袋糖果。这也足以让主眼盯上我一阵子了。我在堡垒里躲了好几年，才躲过了他们。
//
//当我来到堡垒的时候，找到糖贩子比我想象的要容易得多。它们就像是寻找灯塔一样寻找着你的欲望。我到那里还没有十五分钟，就看到了一个人，在小巷里吐着一大团血和脓液，他显然是一个废料人。我个人不想吃有害废料这种糖。我遇到过一些人很喜欢吃它，但我每次吃它的时候都会感觉我的牙齿要掉光了。我得成瘾得很深才会变成一个废料人，如果我真的到了那一步，我肯定会自杀的。不管怎样，如果我认为一个家伙是废料人，那他就一定会是某种糖的贩子，或者至少知道在哪里可以买到它。还有比交易更好的办法去得到钱满足糖瘾吗？
//
//在堡垒里的时光是我人生中的最低点之一。我每天有八个小时都只是在盯着墙。每隔一段时间，我会吃一颗子弹糖果，然后沉浸在那种感觉里。那时没有什么人会来看我，毕竟我在堡垒里就没几个认识的人，就算是他们来了，我大多数时候都会选择无视他们，陷在阴霾之中直到物资耗尽。耗尽之后我就会去找代笔人Sid再买一包糖。
//
//这种情况持续到了我的点数用光的那一天。在堡垒里偷东西会更加困难，因为这里有更多的眼睛会盯着你。当然了，不是外面的那个主眼，外面的那个主眼目前抓不到我，这是一件好事，但是人们的眼睛会更加地难以绕开，比如B.N.T.G.的人等等。如果他们是人的话。不管怎样，当我用完点数的时候，我觉得是时候回到十一层了。我不知道我回去干嘛，但肯定比在这里被B.N.T.G.变得更消极要好。
//
//从那时开始，我认为我需要把糖给戒了，然后我就开始反反复复的戒糖。尽管我会一次又一次地复发，但我会打些零工来为我的糖瘾买单。给the Eagle写文章，同时在the Meggies打着工，这就是我的处境。我真希望我能辞职。我听说对糖上瘾的人们总是千方百计想要摆脱那些东西，但这些努力总是无用功。尽管没有证据，但是我觉得B.N.T.G.会阻止人们戒除糖瘾。如果人们能够轻易地戒除它，那么BNTG就会赚不到钱，对他们来说，那是最糟糕的事情。
//
//你看，在这一点上，我就可以知道B.N.T.G.就是整个糖果活动的幕后主使。毕竟，除了他们以外还能有谁能够保持糖果的供应呢？我觉得他们就是在底层批发给一些值得信赖的源头，然后让它流向普通民众。在糖果的成瘾性暴露在公众的视野之中时，B.N.T.G.却公开表示不承认这些事实，但我认为他们一直都知道。这些卑鄙小人总是试图尽可能多地获取金钱。我想他们是故意让它有着上瘾的特性的，或者至少是在发现这种特性后决定利用它。不管是什么情况，他们肯定在通过各种手段运行着这种糖果经济。package wupin;
//
//public class tangguo5 {
//
//}
package wupin;
public class tangguo5{
}