//Object C-93 - “烫嘴拉面”
//评分: +27+–x
//物品编号：C-93
//
//位置：C层群内的绝大多数层级，以及Level 11和Level 1
//
//_noodle.jpg
//一袋半干状态的烫嘴拉面。
//
//描述：
//烫嘴拉面是一种在C层群内较为常见的食品。
//
//烫嘴拉面多呈现为被放在透明塑料袋中的一小团乌冬面，每袋约重200克。透明塑料袋上除了一串意义不明的阿拉伯数字外，没有任何标志。
//
//性质：
//烫嘴拉面有两种状态。
//
//半干状态
//半干状态下的烫嘴拉面大多呈米白色，且表面温度一般不受周围环境影响，稳定在3~5摄氏度。这一状态下的烫嘴拉面无弹性，且表面十分干燥。接触大部分液体都会使其表面温度飙升至100摄氏度，且短时间内温度不会下降。如果将其浸泡在液体中，液体将会迅速沸腾。奇怪的是，Level 7中的海水似乎不受这一效应的影响。1在液体中浸泡1~2分钟会使烫嘴拉面变得柔韧且表面有光泽，这一状态被称为“复水状态”。
//
//非常不建议您食用半干状态的烫嘴拉面。这种行为十分危险，会严重烫伤您的食道。如需食用，请将其在液体中浸泡至少1分钟。
//同样不建议您徒手拿取烫嘴拉面。建议您使用筷子或戴上手套拿取。如需徒手触碰，请确保您的手部干燥。
//请不要试图点燃或射击烫嘴拉面。一名M.E.G.雇员试图用打火机点燃一包半干状态下的烫嘴拉面时，烫嘴拉面发生了剧烈的爆炸，该雇员被当场炸死。
//
//复水状态
//这一状态下的烫嘴拉面是可以食用的。复水状态下的烫嘴拉面呈现为米黄色，附有光泽，口感柔韧筋道，且散发出一股浓郁的麦香味。一般将半干状态下的烫嘴拉面在液体中浸泡1~3分钟可以使其进入本状态。复水状态的烫嘴拉面将会失去其特性，且表面温度开始快速下降至可以入口。如果您将复水状态下的烫嘴拉面捞出并晾晒10分钟以上，它将会缓慢排出所吸收的水分，回溯到半干状态。
//
//附件：
//烫嘴拉面的发现
//发件人：ahandsomeguy@backmail.com
//收件人：ilovemissnagatoro@backmail.com
//主题：搞笑的事
//2022年6月3日 14:37
//老大，刚才我们医疗室接收了一个食道烫伤的病人，我问他怎么烫伤的，他回答：“老子吃面条烫的！”笑死我了，这脑x，吃面条也不知道吹一吹
//
//新进展，他是吃了一袋放在塑料袋里的半干乌冬面烫成这样的，几个兄弟怀疑他是发现了新的物品，已经让他带路去找了，他说他还发现了一大堆呢。
//
//发件人：ilovemissnagatoro@backmail.com
//收件人：ahandsomeguy@backmail.com
//主题：RE：搞笑的事
//2022年6月6日 02:48
//大新闻，小刘！我想你已经听说了，M.E.G.那帮子人真的发现了一种新的物品，碰到水就发烫，我们Level 11也发现了几包，我们这边的管它叫“烫嘴拉面”，听说你们Level 1的管它叫“条状岩浆”
//
//摘自《后室终极食谱注解修订版》
//后室终极食谱注解修订版2——滚烫汤面Hot noodle soup
//Tom餐馆的当红菜品！
//想要一种制作方便，无需热源，在诸如Level C-271这种寒冷的地方捧在手心还可以取暖的菜肴？如果你的答复是“是”，那么有请我们暖心暖胃还美味的——滚烫汤面！！！
//
//所需食材：至少1000毫升汤（任意材料制成，甚至可以是只放了点酱油和味精的清水。温度控制在30摄氏度最佳。）、200克烫嘴拉面、牛肉、香菜、葱花等辅料（可选）
//制作方法：
//准备一个容器，以足够放入汤和面条为准。将汤倒入容器中，其他食材放在一旁备用。
//将烫嘴拉面放入容器中，汤沸腾后加入食材。等待至烫嘴拉面变成米黄色。
//烫嘴拉面变色后，使用筷子或汤勺搅拌30秒至1分钟，随后冷却片刻即可食用。
//
//两个厨子的私人通讯
//我可以在面条里面放点热乎乎的火盐吗？
//——垃圾厨子
//
//傻x，做出这种面你可以去死了。
//——面条专家
package wupin;

public class tangzuilamian1093 {

}
