//package wupin;
//
//public class tangjingdin1048 {
//
//}
//Object C-48 - “糖晶锭”
//评分: +21+–x
//编号： Object C-48
//B.F.P.F.内部代号：BO09
//
//糖晶锭是一种透明的糖块，大部分在低温时有着类似玻璃的外观，可以食用或作为建筑材料等其他用途。
//
//QQ-20220620154948.jpg
//一堆糖晶锭
//
//分布：
//
//于大部分层级都有出现，但是高温层级除外。留意你能看到的一切玻璃碎片。
//
//描述
//如图所示。糖晶锭于低温中表现出玻璃碎片状，并且硬度韧性均较好。大部分碎片质量在2克至30克区间内1。这些碎片的边角较锋利。
//
//在温度较高时（尤其是在如Level 3这样的高温层级），糖晶锭会熔化为液态，熔点约为42摄氏度。液态的糖晶锭是一种透明油状液体，流体物理性质与浓硫酸相似；但液态的糖晶锭味甜，也可直接饮用。
//
//糖晶锭除了最主要的无色透明外，还有多种不同的颜色，如图片中展示的蓝色。茶色的也很常见。熔化、溶解这些有色的晶体会得到对应颜色的透明液体。
//
//性质
//无色糖晶锭的光滑平面，可能出现云天的倒影。蓝色的，可能出现星辰的倒影。
//
//糖晶锭可溶于水与杏仁水，形成一种透明溶液。溶液的粘稠度随溶质分数的上升而上升。溶液也是甜味的，但是特别地有一种清凉感。
//
//若用水浴法蒸干这种溶液，将得到一种粘稠的胶状物质，称为糖晶糊。这种胶状物质稳定，不会自行粘连，且可以倾倒、转移等；但当灼烧或用火焰靠近（甚至直接加入火盐）时，它会立即干燥并且结成原来的玻璃状形态。
//
//将糖晶锭直接与原液混合，它会逐渐溶解于原液，并同时使原液变为透明。最终，这种混合液体会具有原液的所有性质，但是它所有原来表现出来的色彩都会变成透明。取下这种透明材料，会发现它所有性质都与玻璃无异。
//
//对于一些人来说，直接摄入糖晶锭可能有心理平复作用，例如缓解探索后室的恐惧与怀旧感等。但对于另外一些人，这可能会导致孤独感加深，而且带来一种奇异的下坠感、深处虚空的既视感。这种效果只在直接摄入时有效。据推测，这是糖晶锭成分对于神经系统的直接影响。
//
//用途
//直接食用。这可以补充食物补给的缺失，但由于它仅能提供糖类物质和少量钾、钠、镁无机盐类，不建议将其作为长期食品。且由于它的边角比较尖锐，大多数时候需要将其重整为球状方可食用。
//与原液混合，制作成薄片状或者块状玻璃。
//作为建筑材料。利用糖晶糊作为干燥层级的建筑粘合剂，可以补充粘合性建筑材料的空缺，且易于直接拆卸（用水冲洗溶解）。但建筑需要严格干燥。
//制作一些容器、武器、工具。因为可以轻易重整物品的形状，而且用溶解-蒸干-灼烧法重整的糖晶锭比原来有韧性，所以可以用于容器、武器、工具的制作。但注意：这些物品需要绝对干燥。
// 
// 
// 
// 
// 
//
//脚注
//1. 这与玻璃碎裂时出现的碎裂现象基本相似，但是不完全相同。
package wupin;
public class tangjingdin1048{
}