package wupin;

public class tiaoweiliao1024 {

}
//Object C-24 - “调味料”
//评分: +15+–x
//Spice-bottles
//一例Object C-24
//
//物品编号：C-24
//
//描述：
//调味料是一类在各层级中发现的调料容器及其内容物的总称，通常是味精盅和盐盅，但也有少数发现其它种类调料品的情况。每次只会出现一个调料盅，且内部的调味料容量总是不足一半。
//
//调味料经常与外表贴的标签对应，但大多数情况下是没有标签且无法确认调料品种类的，当前已发现的内容物种类包括但不限于：盐、糖、味精、鸡精、研磨黑/白胡椒、孜然粉、五香粉、茴香、花椒、芥末、咖喱粉和肉桂粉等，这些调料的味道并无异样且保持情况良好。食用调味料并不会造成任何影响，且通常被描述为品质卓越的。
//
//用途：
//调味料当前被多数后室中的单人探索流浪者用于驱逐敌对实体。当他们位于存在昼夜更替的层级内生存时，总会在夜晚来临前将调味料涂抹在身上，以确保在夜间不会受到实体的袭击。
//
//目前已知大多数实体都会尽量远离调味料，其中包括笑魇、肢团、猎犬 、无面灵、窃皮者和悲尸等，这些实体在发现调味料的存在时总是低头且掩鼻离开，若将调味料洒在这些实体的身上，它们会极力抓取周围的布料进行擦拭或快速到达附近的水源进行清洗，还曾发现过部分实体因沾染调味料而呕吐的情况。
//
//调味料曾作为反制敌对实体的唯一手段而流传，但此后由于瓶装闪电和火盐的发现和应用，调味料也逐渐被失去了应对实体的主要职能，目前仅作为独自在层级中生存的保护措施使用，有时候也会向敌对实体挥洒调味料达到驱赶效果；在任何情况下都禁止向派对客使用调味料。
//
//当调味料使用完毕后，调料盅本身也可以作为一种妥善安全的容器使用。当前流浪者会倾向于装填火盐，即便因剧烈摇晃而导致火盐破碎，但也不会立即产生热量和光线，而且维持在更加细小的晶体状；装在调料盅内的火盐在洒出后会立即产生持续的火焰。探险者总署曾发现有民间流浪者使用调料盅装填蓝砂的案例，尽管短时间的存储不会对其造成影响，但长时间携带仍会因摄入升华的蓝砂而表现出中毒症状，也有因高温导致存放在调料盅内的蓝砂融化进而对流浪者造成伤害的情况，且调料盅仍然完好无损。
//
//来源：
//在一些建筑结构类似餐厅或食堂的层级中，可以在餐桌上或厨房灶台上发现，但数量极其稀缺。通常若在一个层级内发现了一例调料盅，至少3个月内都不会在同一层级中再次发现。
//
//似乎在不结盟贸易集团中存在可以少量且稳定供应的调味料来源渠道，故而可以与其进行交易购买。当前不结盟贸易集团对调味料采用预约制对外销售，似乎有意控制市面上的调味料数量，导致调味料因其本身的稀缺性而成为了一种在流浪者之间的硬通货。大多数情况下，向不结盟贸易集团进行有关调味料的交易中，调料盅均需另行购买。
//
//副作用：
//调味料更容易吸引食腐动物，通常是苍蝇、马陆和蝴蝶，有时候也会出现蛞蝓、秃鹳和鬣狗在流浪者附近徘徊。这些动物并不会主动靠近和表现敌意。在极少数案例中，发生过只有两三只鬣狗接近了熟睡中的流浪者的情况，它们舔舐涂抹了调味料的部位后迅速离开，期间并不会攻击流浪者。
//
//根据部分善意实体对调味料的描述，调味料总是散发着“令人作呕且腐臭”的味道，会让每一个实体们联想到腐烂的尸体和正在霉变的食物，这种气味大多数是难以忍受的，但可能存在少数会被吸引的实体存在，而且在一些特定层级中极有可能会吸引那些“危险存在”的注意；当前仍未能证实以上提及的情况。
//
//若有流浪者携带调味料或最近食用了使用调味料进行调味的食物，则会被大多数层级拒绝进入。这表现为在一些存在承担管理者角色的实体会主动到达流浪者附近并劝说其立即离开该层级，抑或是直接将流浪者传送至其他层级。流浪者无法触发大多数生存难度宜居的层级入口，且极易触发当前所在层级的出口，且这些出口都是仅限于携带调味料的流浪者使用。
//
//基于以上原因，探险者总署建议流浪者们谨慎使用调味料。
//
//值得注意的一点是，身上沾染了调味料的流浪者似乎更受那些单人探险的流浪者欢迎，且经常会邀请一同探索一些生存难度较高的层级。尽管这些沾染了调味料的流浪者总是无法完整归来，但邀请他加入队伍的意向总是持续稳定的。