//package wupin;
//
//public class tiaojiulaobin1194 {
//
//}
//Object C-194 - “调酒老冰”
//评分: +10+–x
//
//物品编号：Object C-194
//调酒老冰是有识血肉们在“深洞巢穴”找到的一种特殊矿物质，因其极其独特的特性而被各大组织尝试进行研究和应用。
//
//描述
//调酒老冰在无光环境下物理性质近似二氧化硅结晶，可以如常参与化学反应并像普通二氧化硅一样生成化合物，目前已确认调酒老冰生成的化合物不会具有调酒老冰曾经具有的性质。
//
//调酒老冰的特殊性质在其受到光照的时候才会表现，当其受到光照时调酒老冰会从物理层面消失：密封装置测验结果已确认该过程并非是汽化或液化，根据其他特性推测该物质极有可能是被光溶解了。
//
//目前确认该性质可见光触发，更进一步测量显示应为350-700太赫兹光线可以触发此效应，为方便描述暂且称该效应为调酒老冰的溶解效应。每流明光线的溶解质量大约在40~50克左右，如果溶解调酒老冰已经超过了光的溶解极限那么在光线照射末端阻挡物上会析出等质量的调酒老冰。
//
//溶解过调酒老冰的光线会明显展现出一系列与正常光线之间的差异，包括但不限于:
//
//笼罩的区域物体移动会承受约等于5个标准大气压下空气阻力的不明来源阻力，目前唯一有可能解释的就是这些光线本身能够产生阻力。这也使得进入该区域的探索者明显感觉到“凝渧感”“压迫感”。
//
//在不降低波长的情况下被溶解后光线穿透能力显著下降，同时在穿透过程中带来的光通量下降会导致对调酒老冰的携带能力下降，无法携带的调酒老冰会在物体内部析出，这一过程对于某些物品可能产生严重损坏，但是也能达到某些情况下的特殊建设效果。
//
//当光源被遮挡时，调酒老冰会在原光线照射落点处重新析出，原则上不会发生质量变化，但是通常来说由于光线照射区域较散且该效应无法被大多数容器隔断，因此实际上会有相当数量的调酒老冰散落到周围区域，需要在黑暗状态下重新回收。
//
//警告：这一过程对于生物体必然产生严重损害，因此所有对调酒老冰进行开采、加工、搬运的参与人员必须全程穿着遮光衣物，确保可见光无法穿透或是只能有少量穿透，开采完毕后的搬运也必须完全在不透光的环境下完成。
//
//用途
//由于调酒老冰易挥发，难收集，甚至在大多数时候无法收集的特性，以及其在有光环境下有可能对人体产生的高伤害性，目前对于调酒老冰的大多数应用只表现在研究阶段，研究者和大致相对的研究计划列表如下。
//
//M.E.G. 调酒老冰的发现，溶解调酒老冰后光线造成损伤的预防与治疗。
//E.P.B. 一种可利用光线调节自身及电路状态的晶体管。
//有识血肉 利用调酒老冰制造光敏感器官，并用光信号代替神经传导信号。
//发现
//目前已知最早的调酒老冰发现记录是有识血肉，当时在“深洞巢穴”的有识血肉技工氏族发现大批调酒老冰矿藏，由于该层级无任何可见光线，调酒老冰的特殊性质并没有被激活。
//
//因此有识血肉技师氏族认为只是普通的石英，但是当大规模开采并运输至“母亲的城市”时，光线照射导致调酒老冰特殊性质被激活并导致当时负责运送的技师氏族严重伤亡，随后有识血肉在付出一定代价的情况下成功确认该物质的特性，并将其作为科研成果的一部分分享给其盟友。
//
//获取
//在调酒老冰的特殊性质得以确认后，相当多层级中探索者认为的空气具有“凝重感”似乎都可以用调酒老冰含量较高来解释，所以可以认为该物质广泛分布于各个层级。
//
//但由于多数室内层级存在稳定光源，而室外层级光散射后单位面积下调酒老冰含量非常低，因此调酒老冰的唯一稳定开采场只有“深洞巢穴”，但由于各组织使用需求都较低因此也没有太多组织主动尝试大规模获取该物品。
package wupin;
public class tiaojiulaobin1194{
}