//躯器编号：Flesh C-61
//
//代价：小
//
//安装位置：全身
//
//介绍：
//铁丸铜汁是一种生物材料，由医学部研发的新型共生体技术与薇洛特（化名）博士的无机物生物学技术结合研发。解决了人造骨骼大部分的缺陷。与骨骼及结缔高度结合。用于替换骨骼，或制造义肢。以优良的性质作为材料大量倾销以为躯换取财富。
//
//分类
//“铁丸”第一版由记忆金属镍钛合金制成。薇洛特搏士直接在可塑性强的活体钛制银骨加入镍，再加入其他金属调整并培养为金属共生体，其还原温度降低至28°C。又以前厅生物光纤技术和银骨为灵感，效仿有识血肉科技制造活体生物膜注入液态金属以代替神经。结构上表面粗糙内部中空以容纳或承载“铜汁”。但又因为躯组织排斥金属，所以薇洛特博士以Flesh C-79为主。仅改造其中的金属丝部分制成了有机物占主导地位的第二版。
//
//“铜汁”为高密度细菌和杏仁水营养液组成的银白色或红褐色凝胶状液体，细菌分为两类——清汁和红汁。
//
//清汁由医学部制造。被用于代替骨膜的作用。与接受者细胞相结合培养以形成肌肉和结缔组织，大大减小排异反应带来的风险。
//
//红汁由医学部制造。被用于代替红细胞在造血功能的作用。红汁细胞与普通红细胞不同的是，其中的血红蛋白表现出与氧气的高结合能力。相对普通红细胞，供氧能力相对较强。
//
//获取时一般会得到组装后的成品，使用时请将本产品替换原本骨骼或对接至伤口处。
//
//注意事项
//一、请注意铜汁的颜色，一旦观测到其区别红棕色就代表它被其他细菌感染，请立即弃用。
//
//二、一经连接尽量避免拆除。
//
//三、铜汁不可重复使用。
//
//获取
//请提前半个月携带被移植者活体肌肉细胞与流浪商人处或医学部定制。市场上倾销的均为躯所认可的使用水煮骨髓技术的改版。不过你仍可以在薇洛特博士本人处换取第一版相关的技术，不过因为躯并未全部将其接受。所以从博士本人手中得到的相关产品躯组织概不负责。
package wupin;

public class tiewantongzi1061 {

}
