//package wupin;
//
//public class tongxinfenchang1193 {
//
//}
//Object C-193 - “通心粉肠”
//评分: +17+–x
//
//物品编号：Object C-193
//通心粉肠为有识血肉和“帕拉斯研究所”修建于其控制区的一种可快速跨越层级的永续大型工事。
//描述
//通心粉肠是有识血肉建设的巨型活体工事的一部分，作为其在各层级间或层级内立体建筑间联通装置，通常出现在有识血肉占据区域的交通要地或是巢穴中作为向城市运送重要人员或物资的主力通道。
//
//正如其名字所述，通心粉肠外观近似哺乳动物消化器官的肠道部分，不参与跨层级运输的通心粉肠通常长而粗壮并裸露在外连接两个大型建筑的房间，而参与层级间运输的通心粉肠则大多数埋入墙体或是地下。要简短的多并且通向末端的一个球状囊，理论推测在球状囊中实现层级跨越。
//
//通心粉肠在感应到有物质进入后会开始快速蠕动将进入者推送至目的地，具体速度根据其肌肉壁厚度而定，通常而言可达100千米/小时。其中填充有大量不明高氧气含量液体让人类和大多数有识血肉即使没有经过水下呼吸的相关改造也可以在其中正常进行呼吸不会产生窒息反应。由于液体提供可观的缓冲力因此即使通心粉肠高速行进人体也不会受到太强的压迫感1。
//
//使用方式
//不进行层级跨越的普通通心粉肠对所有可以进入有识血肉据点的探索者都通用，使用者只需蜷缩或平躺在入口等待肠道自行将自己蠕动到目的地即可，不过由于其中粘液通常会弄湿衣服，建议在使用前先向有识血肉购买防水容器。
//
//进行层级跨越的通心粉肠使用方式与之相同，但是代价要明显高得多，通常来说每次启动需要500瓶以上的杏仁水作为支付并且每次启动之后至少需要1~2周才能再次启动。当启动时所有进行本次跨层级移动的人和物品必须全部位于通心粉肠中，大约15~20秒后通心粉肠会剧烈蠕动将所有人喷吐之下方的球状囊中。此时球状能外壁上会出现一个类似门的装置，进入其中即可到达“母亲的城市”2。
//
//值得一提的是E.P.B.利用超声波探测系统确定了处于墙壁中的通心粉肠大概外表，在未启动时球状囊表面没有任何裂口，并且不存在对外界的其他通道，而在启动后整个通心粉肠本身都消失了。
//
//发现记录
//可以确定最早的发现纪录来自于一次有识血肉与U.E.C.的大规模敌意接触后大约2~3年各个巢穴开始扩建该设施，加上之前对U.E.C.的一部分监视推测该技术最早为该团体掌握，有识血肉应该是缴获其某物品并进行逆向科技得出。
//
//帕拉斯研究所则在“科技获取行动17号”后开始在文件中出现关于该技术的记录3。并在大约5年后开发出可以使用的版本，根据实验数据来看该版本比起有识血肉的原版本在传送数量和速度上有显著提升，但精度则严重下降。
//
//原理推测
//可进行层级跨越的通心粉肠通常被镶嵌于大型岩石或有机物组织中，尝试从外部观测该装置计划并不成功。有时血肉严格要求不允许清醒状态下携带武器进入该装置4，尝试破坏装置的行动也均以失败告终，考虑到有识血肉会通过神经连接知晓被连接者情绪状态加上其要求时进入肠子是必须接受极其严格的检查，目前没有成功混入的经历。
//
//因此目前找到最有可能是该装置运行原理的内容是通过某些技术手段从帕拉斯研究所数据库中获取的对该物品逆向科技后得到的结果，相关文档内容如下。
//
//- 关闭
//根据“χ-2 芬里尔之齿”在科技获取行动17号中带回的样本，我们可以开始尝试复制有识血肉的层级跨越技术——正如之前某些学说中所猜测的一样，后室中很多层级通过即视感和相似性进行相连——层级会生成作为通道的雨林进程及外观相似的区域。或能够暗示临近层级的物品。当探索者根据该物品或场景特征联想到另一层及时，他们就会发现自己已经被移动了。
//
//移动过程中探索者身上的大部分物品在大多数层级会正常保持，这一物品包括探索者体内寄生物或体表细菌等，因此活体也可以作为“物品”的一部分。这也是为什么发现有识血肉将该装置的操作员直接接入该装置的原因。在这样的情况下，所有乘客都会被认为是层级跨越主导者的物品——根据多次试验得出如此判断的理由应该是层级跨越主导者，本身相信。
//
//结合蓝色通道观测的层级相对位置可大概认为：使用这种方式跨越层级时该区域“层级间距离”越近、使用者携带物资越少则需要的即视感越小。通常层级简介的出入口内容提到必然成功的出入口都是极其接近的区域，较远的区域则通常会被记录为有概率可出入。
//
//修建该装置的层级和需要前往的层级间距离极远，因此为正常触发层级穿越效应必须让这种即视感显著加强，而目前最有效加强这种即视感的方法有三个：
//
//提升想象者本身的思维活性，选择想象力较强的成员作为层级跨越工作的想象者。
//加强场景相似度，根据经历过有识血肉主导层级跨越的人回忆可知，成功跨越到“母亲的城市”的成员发现所处区域与传送区域间相似度极高，并且刻意增加大量完全相同又极容易被记住的特征，例如伤疤、裂口等
//增强刺激，显然能让使用者大脑进入恍惚状态的物质对此类层级穿行都有所帮助，但其副作用也通常是显著的。有识血肉设施废墟附近操作员装置中提取出少量“记忆果汁”残留。而根据其记录，在每个个体启动后会进行一次时间极长的修养用于恢复记忆果汁对大脑造成的损害。虽然我方缺少直接修复活体组织的相关技术，但出色的化学能力让我们能制造出更好的精神活性药剂——在该装置上代表着更大的传送重量上限和更快的传送速度。
//但……代价……
//作者信息
//« Object C-192 | Object C-193 | Object C-194 »
//
//Footnotes
//1. 不过大多数探索者在初次接触时都会呛到，需要一定时间来适应
//2. 但是也有说法认为是该装置完全进入了母亲的城市，而不是那道门的外面是母亲的城市
//3. 该行动确定为Level C-307发生的一次涉及多组织的大规模冲突，其中一个有识血肉巢穴覆灭于U.E.C.的报复行动
//4. 可以在昏迷状态带入或是在清醒状态不携带尖锐物
package wupin;
public class tongxinfenchang1193{
}