//Object 31 - “通灵板”
//luigi.jpg
//Object 31 被发现时的照片。任何对还原该照片内视觉异常现象的尝试均以失败告终。
//
//物品编号：31
//发现地点 M.E.G. Beta 基地 未知 （见事故记录）
//描述
//Object 31 为一焦黑木制通灵板，拥有用黑色油漆涂出的26个字母、数字0~9，以及“是”“否”和“再见”字样。Object 31 也包含一块同样焦黑的木制占卜板，用黑色油漆涂有字母“X”。该物品于 Level 11 中一名为“女神之馈赠”的店铺地下室内发现。该店铺售卖的大多为神秘主义及新世纪灵性运动的产物。店铺地下室内除 Object 31 外别无他物。
//
//Object 31 具有一奇怪特性，在流浪者将手放在其板面上时会开始自己移动。该状态下的板面似乎由使用者所了解的已逝之友的灵魂所控制。流浪者在使用前默想其已逝之友便可通过通灵板与之交流。流浪者似乎不能与不认识的逝者的灵魂相交流。此外，每一次使用通灵板交流的时间不超过10~15分钟，随后通灵板需要至少几小时以再次使用。
//
//对于 Object 31 能否为失去亲人而悲痛的流浪者所使用的讨论仍在进行，并且已经安排实验来确认该物品的投入使用会缓解流浪者的痛苦还是加深这种感觉。
//
//实验记录：
//监督人员：佐菲娅·科奈利，就职于 M.E.G. Beta 基地
//
//实验对象：威尔森·伍德豪斯，位于 Level 11
//
//实验目标：确认使用 Object 31 让失去亲人的流浪者与其亲人的灵魂交流是否会对流浪者产生积极影响。
//
//前言：威尔森·伍德豪斯是 M.E.G. 成员希娜·伍德豪斯 的丈夫，后者在2020年10月31日一次对 Level 613 进行的探险过程中丧生。伍德豪斯先生被指示专注于他与他过世的妻子曾经的会议，同时激活 Object 31。
//
//转述文字的注意事项：来自通灵板的灵魂的回应使用另一种文字1以表示。为使其内容阅读通畅，增加了空格及一些标点符号。
//
//<记录开始>
//
//威尔森·伍德豪斯：亲爱的，你能听到我的声音吗？
//
//可以，我就在这儿，亲爱的。
//
//威尔森·伍德豪斯：哦，上帝！真不敢相信我又一次能和你讲话了，亲爱的。
//
//我也没想过我还能见到你，亲爱的。
//
//威尔森·伍德豪斯：希娜，我真的很想你。
//
//我也很想你，亲爱的。我这边还挺冷的，你最近过的怎么样？
//
//威尔森·伍德豪斯：维持生活……有点艰难，但我还是坚持做到了。话说，你说的“这边”是什么意思？希娜，你在哪里？
//
//亲爱的，我也不知道。我好像在一片无际的海中飘着，你的声音仿佛在空中回响。我多希望我能看到你的模样。
//
//威尔森·伍德豪斯：我也希望能看见你，希娜。你曾经真的太美了。
//
//现在也是，亲爱的。
//
//威尔森·伍德豪斯：啊，对不起。
//
//没事，亲爱的。我们要没时间了。你还有什么别的想问的嘛？
//
//威尔森·伍德豪斯：我不大清楚……我从来没想过这真的能有用，所以我觉得是时候结束对话了……对了，你是怎么离开的？我听了探索记录，但听不大清。我—对不起，我只是真的想知道一下。
//
//没事，亲爱的。其实，我也不知道我是怎么死的。挺奇怪的，前一秒我还活着，后一秒我就到另一个世界去了。我也想告诉你更详细的信息，但整个事件真的太扑朔迷离了。对不起，亲爱的。
//
//威尔森·伍德豪斯：没事的，希娜。
//
//时间快要到了。
//
//威尔森·伍德豪斯：啊…如果 M.E.G. 还让我用这个的话我会再来看你的。爱你，希娜。
//
//我也爱你，亲爱的。
//
//<记录结束>
//
//实验后的采访
//受访者：威尔森·伍德豪斯
//采访者：佐菲娅·科奈利
//前言：这篇采访紧随使用 Object 31 的实验而进行，用来确认使用者使用 Object 31 后受到的精神影响为积极或消极。
//
//<记录开始>
//
//佐菲娅·科奈利：和你的妻子谈话，你感觉怎么样？
//
//威尔森·伍德豪斯：那根本不是我妻子。
//
//佐菲娅·科奈利：啊？
//
//威尔森·伍德豪斯：我不知道我到底在跟什么鬼东西讲话，但反正不是希娜。
//
//佐菲娅·科奈利：为什么你会这么想？
//
//威尔森·伍德豪斯：我完全可以分辨出来。我和 Hina 结婚都已经十多年了，如果我真的和她在讲话的话我完全能感觉到的。
//
//佐菲娅·科奈利：我懂了。
//
//威尔森·伍德豪斯：好了，我现在要结束访谈了。和一个假装是我过世的妻子的人讲话简直是……我可不想这样过这一天。
//
//佐菲娅·科奈利：我理解。
//
//<记录结束>
//
//采访笔记：我要把伍德豪斯先生的话当耳旁风了。他现在说出来的话完全可能是过于悲痛导致的。我需要进行更多实验以确定该物品的特性。
//
//试验记录
//监管人员：佐菲娅·科奈利，就职于 M.E.G. Beta 基地
//
//实验对象：佐菲娅·科奈利，就职于 M.E.G. Beta 基地2
//
//实验目标：以进一步确认使用 Object 31 于过世的亲人交谈带来的情绪影响。
//
//转述文字的注意事项：来自通灵板的灵魂的回应使用另一种文字以表示。为使其内容阅读通畅，增加了空格及一些标点符号。
//
//<记录开始>
//
//嗨。
//
//佐菲娅·科奈利：爱丽丝？
//
//哈喽，小佐菲，是我。
//
//佐菲娅·科奈利：爱丽丝，是你！这太奇怪了，我曾经看过无数人向他们过世的亲朋好友交流，但他们不让我和你说话。
//
//嘛，我很高兴你终于能和我讲话了。我想你好久了，小佐菲。
//
//佐菲娅·科奈利：我懂，爱丽丝。我也好想你……能跟你讲话我真的好开心，即使只能讲几分钟，没办法。
//
//小佐菲，还是有个办法能再多聊一会儿的。
//
//佐菲娅·科奈利：真的吗？
//
//确实有个方法，但很危险。
//
//佐菲娅·科奈利：什么办法？
//
//我现在不能告诉你，要等记录结束了再说。
//
//佐菲娅·科奈利：但是，爱丽丝，那些监督者不会让我……
//
//小佐菲，有些事情是比 M.E.G. 告诉你该干什么不该干什么的东西更重要的。
//
//我快要走了，我知道你会做出正确的选择的。
//
//佐菲娅·科奈利：我爱你，爱丽丝。
//
//我也爱你，小佐菲。
//
//<记录结束>
//
//M.E.G. 事故记录
//2021年10月31日，M.E.G. 探员佐菲娅·科奈利与 Object 31 一并失踪。目前搜寻佐菲娅及通灵板的行动正在进行，推测为佐菲娅躲避了 M.E.G. 的追捕，并将 Object 31 作以私人用。
//
//在 Level -4 的深林之中，一位前 M.E.G. 探员气喘吁吁，停下脚步，将随身带着的 Object 31 放置在地上。
//
//佐菲娅·科奈利：爱丽丝，够远了吗？
//
//够了，小佐菲。现在把我点燃吧。
//
//她拿出一包火柴，拿出一根划向火柴盒。第三次，终于成功了。
//
//佐菲娅·科奈利：你得保证这么干我就能看见你。
//
//我保证。好了，准备好了吗，小佐菲？
//
//佐菲娅·科奈利：好了。
//
//她把点燃的火柴落在板面上，板面瞬间燃着起来，化为灰烬。
//
//谢啦，小佐菲。
//
//通灵板燃出更浓密的黑烟，火持续蔓延，黑烟笼罩了整片森林。佐菲娅咳嗽着后退。
//
//火中走出一巨大生物，一个八英尺高的类人生物。以山羊为头，全身布满黑色毛发。
//
//佐菲娅·科奈利：爱—爱丽丝？
//
//生物发出低沉的声音，那闪着红光的眼睛注视着佐菲娅。
//
//???：你觉得我看起来像爱丽丝么？
//
//那生物咆哮似地狂笑。
//
//???：谢谢你让我自由啦，小佐菲。
//
//佐菲娅尖叫着从那生物身边跑开，却被一块树根绊倒了。脸先着地，双手叉腰。
//
//???：嘛，来嘛，小佐菲。我又不会咬你。
//
//佐菲娅·科奈利：离我远点！
//
//佐菲娅仍在大声尖叫，尝试爬开，却被那生物快速地追上。
//
//随后，尖叫声停止了。整片深林一片寂静，除了那生物杀死第一个猎物发出的牙齿啃啮和撕扯血肉的声音。
//
//作者/授权信息
//« Object 30 | Object 31 | Object 32 »
//
//Footnotes
//1. 译注：原文为大写字母，此处加斜体
//2. 佐菲娅以自己为实验对象进行实验是违反 M.E.G. 实验协议的，但这个实验的进行在事故发生之前并未被发现。package wupin;
//
//public class tonglingban31 {
//
//}
package wupin;
public class tonglingban31{
}