//Object C-72 - “难得素”
//评分: +20+–x
//描述
//难得素是仅后室所有的物质，但通常直接作为材料。它们在后室以特殊方式被发掘并应用，且还拥有其他两种人工变体。它们以矿化植物的形式出现，暂未发现其他难得素自然附着物。
//
//难得素通常存在于一种矿化植物中，矿化植物通常为粗细不一的藤蔓与少量结有类似真空管外形的难得素结晶，大小在1~15cm之间。其藤蔓为闪亮的紫色，而结晶花朵通常散发着紫色的微光或雾气，散发的成分仍在研究中。值得一提的是，其藤蔓在隔绝空气的条件下热解后会形成紫色的闪耀且坚硬粗糙的粗制难得素金属质，若进一步提炼所得的产物即为难得素。其难得素结晶经采集后为保留难得素结晶的独有性质，需要将它浸泡在液态火盐和杏仁溶液中。
//
//实验记录
//除此之外还发现了难得素被流浪者食用后发生特殊效果。 以下展示了部分来自U.E.C对此物品进行或收集到的实验记录：
//
//实验编号#1
//实验对象：流浪者（男性，45岁，身材较矮，体型较瘦）将难得素掺杏仁水服用
//效果：身体漂浮在空中，不受控制地极速地做随机运动，直接切入层级后切出回到层级死亡，但仍然持续做随机运动
//
//实验编号#2
//实验对象：流浪者（女性，29岁，身材苗条）将难得素直接服用
//效果：所有体组织变成Level 0的墙纸色，且为动态，经24小时后再次观察后状态健康。
//
//实验编号#3
//实验对象：流浪者（男性，23岁，体态肥胖）将难得素直接服用
//效果：变成一团紫色和黑色相间的二维方形色块团，确定为死亡。
//
//实验编号#4
//实验对象：流浪者（男性，24岁，身材壮硕）将难得素放进腰果水里服用
//效果：突变成二维的多个人脸有序组合的平面，立在地面上没有任何运动，结果 ████████
//
//实验编号#5
//实验对象：流浪者（男性，24岁，身材壮硕）将难得素放进腰果水里服用
//效果：身体不受控制，以腹部为中心做均速向后翻的加速运动56分钟后向上切入层级，结果██████████。
//
//实验编号#6
//实验对象：流浪者（男性，24岁，身材壮硕）将难得素冰镇至-2摄氏度服用
//效果：身体爆███████████████████
//
//特性
//难得素主要有A型和B型两种类型，A型拥有易燃、催化和增幅的活跃性质，B型具备抗燃、惰性化和减幅的性质。
//
//将难得素A型和B型混合可以产生极大的爆炸力后同时在爆炸范围内向爆炸中心产生吸引力，若其中含有其他易爆物质可以发生连续多次的爆炸。据实验，它的产生的能量总和是火盐的11.7倍左右。
//有些难得素还具有磁性，据测试，难得素其制品有些具有磁性以及导电性，其原因未知。
//
//用途
//已知难得素A型可以与火盐掺杂，制作集束燃烧炸药，用于开发和探索。难得素B型与蓝砂掺杂会使其低温不融化并且转变为深紫色晶质，作为集成电路板或压印器的材料。
//
//获取
//已知利用诺克立普贴会在多次切出或切入的区域会产生一定量的难得素矿化植物中萃取。或通过将难得素结晶埋入土壤从而影响到半径25米周围的植物使其变异为紫色后产生的少量疣状物质中萃取，但难得素结晶会被逐渐消耗。
//
//基础制品
//难得素源质
//这种形态的难得素是人为制作的，将难得素、难得素结晶与液态火盐混合高温烧制并冷却，凝聚而成的透明结晶块。结晶块大体为粉色，一块1千克的结晶可能只有1克的紫色结晶，其原因未知。
//
//已知粉色难得素源质通常用于精密部件以作为类似金刚石的镀层、以及防具镀层和武器镀层，而紫色难得素源质通常被视作更好的铀，相比于铀，其放射性不会影响人类和实体。
//
//紫色难得素源质具有极大的易燃性，似乎永远不会被燃烧所损坏，所以它也可以充当煤炭等物品。
//
//难得素合金
//这是难得素金属质、源质与任意材料的合金产物，其整体颜色呈现为紫色、粉色和其中任意材料的颜色，拥有类似大马士革钢的纹理。不同合金钢其中任意材料的成分会有不同的能力和作用。
//
//这种物品常加工为高级金属制品，已知若其中任意材料的成分为火盐和蓝砂并制成武器可以得到引燃的效果，能点起紫白色的闪耀的火焰，这种火焰蔓延要比普通火焰更快且难以熄灭，且受到此火焰影响的实体碎块可作为合金钢中的任意材料。而将实体碎块作为合金材料会产生具备其实体部分能力的特性。
//
//而难得素合金还有一种泛用性极其广泛且易制造的初级人工制品，通常为区别于难得素合金被称为多素后室合金。多素后室合金是在制造工艺上由于难得素金属质、源质作为极其少量或微量而得名。
package wupin;

public class unobtainiumnandesu1072 {

}
