//Object C-57 - “望远镜”
//评分: +9+–x
//物品编号：C-57
//位置：Level 11或Level C-337的BHAA基地
//
//描述
//photo-1516107900639-682580124b87?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1025&q=80
//一位BHAA成员正手持望远镜。
//
//望远镜外观上和前厅的双筒望远镜几乎一致。其左侧和右侧镜筒分别刻有BHAA的图标和该望远镜拥有者对应的BHAA编号。
//
//望远镜自2022年7月7日开始由BHAA少量生产，并且只允许发配给BHAA成员。
//
//功能
//望远镜的一个功能是充当BHAA成员的身份证。所有经BHAA加密过后的文档都可以通过望远镜解锁。BHAA成员可以通过该物品看到其他人身上是否同样有望远镜。如果有，该物品会通过亮起的绿灯来提醒使用者这位是同伙。
//
//望远镜的另一个用途是充当便携式天文台，使用者可以直接通过它来观测Level C-337的星座，而不需要前往天文台再去观测。此外，在任意有星空或城市的层级，使用者都可以通过该物品观察星星或高楼，这会分别使使用者进入位于Level 11或Level C-337的BHAA基地。
//
//望远镜还有一个用途是对抗那些对眼神接触敏感的实体，如笑魇。透过望远镜观察它们，会使其眩晕一段时间。该效果似乎比原先驱笑剂弱，但考虑到后者已经失效，该方法成为了BHAA成员对抗笑魇的主要方式之一。
//
//望远镜还有一个特殊性质，它的所有功效，似乎只有持有者才能触发。因此，该物品成为了鉴别持有者身份的完美用品。
//
//材料
//望远镜镜片的材料是极度稀缺的一种特殊水晶，目前仅在Level 11发现过几块。BHAA的研究者发现了这种材料的特殊性质，并生产了一批望远镜，发放给了BHAA成员。但考虑到该种材料的稀缺程度，无法给每一位流浪者生产一台望远镜。M.E.G.目前正在Level 11与其它层级寻找更多该种材料，希望不久后，能实现望远镜的量产。
package wupin;

public class wangyuanjing1057 {

}
