//Object 97 - “万物机器”
//警告
// 
//
//M.E.G.禁止未经授权查看本文件。
//任何未经明确许可查看此文件的人将得到相应处置。
//The-big-logo
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
//
//Object 97 - "万物机器"
//everything-machine.exe
//一张"万物机器"中部分具体组件的照片。
//
//万物机器是Level 522中唯一流落在外的一件机器。这是一个高度复杂的设备，旨在完成一切可能的任务。
//
//描述
//当前对万物机器的本质有极大的误解，到目前为止其正在经受极为严苛的研究以挖掘其能力对M.E.G.产生有益成果的可能性。万物机器目前被假设为几乎可以处理后室中的任何问题，并可用于创造或销毁任何物质。然而，所有被创造或销毁的物质都将被转换成不同的介质，这些新介质通常继承了原先被转换物质的近似性质。被转换物质本身会以不明的方式崩溃，这违背了能量和热力学的多重定律。尽管未经证实，在理论上这些物质被彻彻底底地毁灭了。
//
//有关万物机器有多条线索指向后室机器人科技公司, 并且该机器疑似是由他们开发的。万物机器的建造目的疑似是为了探索逃出后室的可能性，尽管如此，由于它还只是一台原型机，尚不具备胜任该任务的能力。当下实验主要目标是测试出万物机器的能力极限。有关万物机器的相关认识仍处于误解状态中，因此上述实验过程依然是早期试验状态。
//
//万物机器是由一种叫做 "魔力方块"
//Hexcubes
// 的零件组成的环形机器。每个魔力方块根据其预先编程的相应使用需求存储数据，该需求可以是任何一切事物。因此，理论上据此特性可从现实中撕裂出一个洞从而达成脱离后室的目标。可由于用万物机器进行编程的复杂性质，通过其脱出后室当前仍被视作超出人力的可能性范围内。目前为止，万物机器主要用于存储数据，偶尔用于运行涉及到万物机器的有关测试。
//
//对万物机器的编程方法也受到很大程度上的误解，因此只允许能够准确理解万物机器的编程本质的个体对其进行管理。对万物机器进行编程的代码示例是高度危险的，有能力造成病毒在任何设备中突然出现。当一科技制品对万物机器中的代码进行扫描时，其能够相应地对此科技产物进行适配，故而不可对其代码进行拍摄。万物机器据信通过半科技半超自然效应运作，就像后室影响其自身1一般。
//
//后室机器人科技似乎对万物机器的诞生产生了重大影响，且影响自万物机器的发现一直延伸至万物机器的微调，一直到接近真正完成万物机器。后室机器人科技的CEO Yellow正在全力以赴定位万物机器的位置，完整的搜查团队及先进搜查技术的研发均是为了定位万物机器的位置。由于后室机器人科技的模糊意图，其可疑的道德观念外加其与制图师的潜在联系，M.E.G.已作出努力以减少后室机器人科技找到万物机器的机会。
//
//发现
//万物机器被发现于一场与后室机器人科技领导者Yellow的会面中。在第二次接触中，经过检查证实了万物机器的高度危险性，故计划以分裂者组织的明面身份对其展开一场突袭行动。经此过程，万物机器如今处于M.E.G.的掌控之中。
//
//有关万物机器的用途
//当前形势下，万物机器似乎能够做到许多独特的工序，从杀死实体到发现新层级，再到物质与补给品的形成。出于这个原因，万物机器的编程人员正努力尝试使用万物机器进行不同的测试。测试记录如下：
//
//万物机器: 测试记录:
//测试记录 E99-TEM:  销毁
//DESTRUCTION
// 
//测试时间: 9:29 A.M.
//
//测试物品: 万物机器, Level 389的"游戏大师"
//
//测试负责研究员: 研究员 Aether, 万物机器项目主管
//
//测试概要: 此次测试是为了尝试摧毁"游戏大师"。以下测试在Level 0进行。
//
//<记录开始>
//
//研究员 Aether: 运行程序，万物机器正处于活跃状态。都往后退，当前结果还不明了。
//
//万物机器开始颤动，其中一个魔力方块剧烈震动。之后，这个魔力方块脱离万物机器，在空中继续颤抖。
//
//研究员 Aether: 好的，所有人保持安静，万物机器即将激活。
//
//魔力方块开始长出锋利的门牙，在现实中咬凿出了一个洞。透过洞中，可以看到Level 389。
//
//研究员 Aether: 万物机器做到了! 99号实体马上就-
//
//魔力方块回到万物机器中恢复休眠状态。整个机器停止颤动。万物机器进入休眠状态。
//
//研究员 Aether: 哦，该死-
//
//<记录结束>
//
//在这之后，助理研究员 Micheal关闭了音频日志记录器。后推测由于打开一个进入Level 389的新入口所带来的过高输出功率耗尽了万物机器的系统储备，进而进入休眠状态以恢复其能量。在此事件发生的一周内，万物机器仅能够接收代码，失去了执行命令的能力。
//
//测试记录 E99-TEM:  销毁
//DESTRUCTION
// -2
//测试时间: 4:26 A.M.
//
//测试物品: 万物机器, Level 389的"游戏大师"
//
//测试负责研究员: 研究员 Azey, 探险者及万物机器实地专家
//
//测试概要: 此为摧毁游戏大师的后续尝试记录。以下测试在Level 389进行。
//
//<记录开始>
//
//研究人员在进入通往Level 389的裂缝前从万物机器中取出一个魔力方块，这个魔力方块已经预先编入明确的代码以摧毁游戏大师。
//
//研究员 Azey: 你好?
//
//Entity 99: 哇哦～ 一位来玩游戏的新客人？
//
//研究员 Azey: 并不全是，我是来摧毁你的。
//
//Entity 99: 是这样吗～ 啊哈哈哈哈哈哈哈！ 你可真爱开玩笑，我可必须告诉你～
//
//研究员 Azey: 启动销毁程序。
//
//Entity 99: 你可以把你的小玩具收起来了，它现在对你毫无作用～
//
//研究员 Azey: 等等，然后呢？
//
//Entity 99: 你不想陪我玩玩嘛～
//
//研究员 Azey: 不，离我远点！
//
//Entity 99: 现在可没时间讠- 嘿，你在往哪跑！
//
//<记录结束>
//
//在这之后，研究院Azey丢下音频记录器，设法通过由万物机器创造的裂缝逃离。裂缝随后不久便闭合了，疑似是游戏大师的操作。万物机器中取出的魔力方块已被重新插入万物机器中，并很快经万物机器充满了能量。
//
//测试记录 FTRMS-TEM:  逃离
//EXIT
// 
//测试时间: 7:34 P.M.
//
//测试物品: 万物机器, 研究员 Mills
//
//测试负责研究员: 无
//
//测试概要: 此次测试是由万物机器防卫主管研究员 Mills操作的未经授权的测试。测试中似乎试图回到前厅。任何有关研究员 Mills下落的信息都应被立即报告。
//
//<记录开始>
//
//研究员 Mills: 我决定了。我受够了这里。现在我要走了，这台机器会带我走的。
//
//万物机器开始颤动，可以听到一个魔力方块在万物机器中震颤直到它被射出并在空中继续颤抖。
//
//研究员 Mills: 再见诸位，看来这次它运行得很好啊。
//
//万物机器中的魔力方块可以被听到在空中剧烈地颤动，随后听到破裂的声音。
//
//研究员 Mills: 再-
//
//魔力方块粉碎，并且伴随着巨大的撕裂声。可以听到研究员 Mills的剧烈尖叫声。
//
//<记录结束>
//
//记录了此段音频的音频记录器被安然无恙的发现于毗邻的附近区域。在此次事件之前及之后的时间里，唯一的环境差异是一小摊血迹，这与研究员 Mills的DNA相匹配。魔力方块本身严重受损，但后由万物机器修复。
//
//万物机器 | 中心页 | 有关万物机器的开发 »
//
//工业革命设定中心页
//
//作者与译者!
//« Object 96 | Object 97 | Object 98 »
//
//Footnotes
//1. 译注：每个层级的间歇性不稳定的倾向package wupin;
//
//public class wanwujiqi97 {
//
//}
package wupin;
public class wanwujiqi97{
}