//package wupin;
//
//public class weiluonikatian1017 {
//
//}
//Object C-17 - “维罗尼卡甜”
//评分: +9+–x
//物品编号：C-17
//
//维罗尼卡甜是以维罗尼卡婆婆蓝花蜜为主要原料的一种后室风味饮料，可被用作镇静剂和治疗精神疾病。
//
//
//OC17.jpg
//“维罗尼卡甜”蒸馏后的固体。
//
//描述
//
//维罗尼卡甜是一种靛蓝色的液体，通常被装在一种带有紫红色包装环的特制塑料瓶中，该塑料瓶可以在土壤中被微生物分解后转化为数朵维罗尼卡婆婆蓝，从该塑料瓶的包装环上我们可以得知的信息为:
//
//配料表:杏仁水、维罗尼卡婆婆蓝花蜜、白砂糖、百合蜜、薰衣草、“治愈水晶”、圣约翰草、帕罗西汀、食品添加剂。
//
//功效:痛苦的情绪和不愉快的记忆，如果充斥在心里，就会使人委靡不振。所以，扫地除尘，能够使黯然的心变得亮堂。
//
//愿您能发现心中的乐土。——Dr.Celestia
//VANDERBOOM公司制造
//
//
//
//维罗尼卡甜现已证实能被安全饮用，其气味与维罗尼卡婆婆蓝的香味十分相似，有时不同的流浪者对维罗尼卡甜的味道描述各不相同，但大多数流浪者都在说它的味道是令人怀念和感到平静的泡泡糖冰激凌味，且该饮料具有类似于镇定剂的作用。
//用途
//直接饮用
//
//饮用该饮料能有效降低流浪者的情绪波动，长期饮用会使流浪者的性格变得更加温和、共情能力更强。
//
//此饮料会以不明原因将所有饮用过维罗尼卡甜过量的流浪者的精神连接起来，使其能彼此间心灵贯通，也常常能感受到其他流浪者或实体的想法，他们将会变得比其他人更容易共情，因此这些流浪者在遇到问题后，通常会选择用更温和的方式去解决问题，但他们常常会因为心软而使自己陷入各种危险境地中。现阶段这种无意义的自杀行为有所停歇，一部分喝过维罗尼卡甜的人自发在形成了名为“阿谟尔帕斯”的社团，他们热衷于与其他流浪者交谈艺术理念，时常与其他组织进行联合行动并开放贸易，与他们交往是安全的。
//
//
//我的朋友改变挺大的，自从他喝多了那个什么维罗尼卡甜以后，他就开始变得逐渐开朗了起来。   他有时候经常自言自语，我知道他是在对别的流浪者脑内通话，说实话，我们从没想过他的内心世界居然这么丰富，令我印象深刻的是，有一次我和他在被窃皮者追赶的时候，他居然在边跑边笑着捉弄它，还在一边跟我讲冷笑话，我老是担心他再这样不认真看待战斗的话，他总有一天会受伤的。
//——来自对一名流浪者的采访记录。
//
//
//收起
//喝过“维罗尼卡甜”的流浪者之间本应该是和睦相处的，但在这一天，A流浪者与B流浪者因不明原因争吵起来，一开始两人只是在据理力争，事态发展严重后B流浪者突然拿出手枪攻击A流浪者，A流浪者因此次冲突不治身亡。B流浪者在杀死A流浪者后突然面露难色，随后皮肤变蓝七窍流血并发出凄厉惨叫，该现象持续约五分钟后，B流浪者倒地不起，尸体化为一摊蓝紫色的浆糊和血水。经M.E.G相关部门检测，该流浪者留下的浆糊中含有高浓度强酸和氰化物，以及一种罕见的颜料——群青。我们至今仍未知流浪者发怒的具体原因，但我们呼吁那些喝过“维罗尼卡甜”的流浪者不要尝试去伤害“同类”。
//
package wupin;
public class weiluonikatian1017{
}