//package wupin;
//
//public class wuruqitu1009 {
//
//}
//Object C-9 - “误入歧途”
//评分: 
//+32
//+
//–
//X
//物品编号：C-9
//
//位置：Level 10（“麦田”）
//
//描述：Object C-9为一规则状物体，在Level 10被初次发现。目前该物体已被转移至Level 78（“空间站”）中一个足够大的舱室内保存。
//
//各组织均不承认参与Object C-9制造，故该物体应当为后室原生物体。
//
//Object C-9由数个大型金属器械构成，其中包括但不限于：
//
//金属棱锥体基座；
//数支长金属丝或棍；
//白色盘状物体；
//数个小型盒装物体。
//当时是Level 10的雨后，被雨水洗净的空气中弥散着一股若隐若现的薄雾。我正在麦田的淤泥里跋涉行进，起初是在寻找什么无人触及的建筑物，后来也许累了，想回BNTG的基地休息会。但就在我返回的路上，我看到了它。不假，正是Object C-9。
//
//它就像是一个荒谬的金属雕塑，沉默且突兀地闯入我的视野。原谅我，第一次看到这个钢铁怪物的时候，我以为它会是什么实体。毕竟它看上去实在是太大太可怕了。
//
//~《麦田拾遗——来自后室意志的馈赠》
//
//无法判断上述结构的用途，及其更详细的化学成分。
//
//发现了一张嵌在棱锥体侧面的金属圆片及一条金属针。圆片大约20cm长，封套上有一块高纯度钍234。此处根据镌刻图案的有无，将圆片分为正面和背面。
//
//正面图案如下：
//
//两个圆形，被一条细线连接，以及其它未知标记；
//数个指向同一点的细线，以及其它未知标记；
//一侧绘有数个细长矩形且环绕有一整圈未知标记的圆；
//直线及其旁边的大量未知标记；
//含义未知的矩形、折线；
//方框内的圆。
//我从杂草中拔起一块插在泥泞中的圆片，剥下泥土后放在手心观察。上面刻着一些诡异的图案，完全不像是有任何含义：
//
//荒唐，无厘头，古人的癫狂创作，没错吧？我一开始也是这么想的。
//
//~《麦田拾遗——来自后室意志的馈赠》
//
//开始，没有任何后室人类组织有能力从这些图案中获取有效信息；直到协调后室历919纪3155年704日，也就是Object C-9被发现超过约三百前厅年后，技术学者信号-烯醇醚发现了这一金属圆片上刻录图案的意义及其本身的使用方法。详细介绍请参见本文档附录1。
//
//有没有一种可能，那两个被直线连接起来的圈代表了一个质子和一个电子？
//
//这个假设立刻成为了我的突破口——后来的事实也证明，这个假设将成为我做过最聪明的选择。
//
//~《麦田拾遗——来自后室意志的馈赠》
//
//当时我想：如果把那些小竖线解释成氢原子跃迁能级所需要的时间，这些图案就合理多了。
//
//就这样，我发现了Object C-9的基本时间单位。于是接下来的一切都像是如鱼得水——依照这个发现，我很快就弄明白了那根金属针的用途。
//
//~《麦田拾遗——来自后室意志的馈赠》
//
//随后，信号-烯醇醚从圆片表面的沟壑中解码出了许多有效信息。
//
//我只是把金属针放到了金属盘上，对接了一个物体扩音器，然后轻轻用手推动盘体。紧接着，一个新世界好像对我敞开了大门。你可以想象一下，我从一个神秘的碟子里听到有意义的声音时将会有多么激动。我几乎立刻就把这个新闻告诉给了我们层级的监督者。
//
//~《麦田拾遗——来自后室意志的馈赠》
//
//其中，圆片正面的信息是一段长达5小时的音频。
//
//上述音频中多为意义不明的低频、高频噪音。其中仅有少量是可被辨认的，包括但不限于：
//
//Entity 52（“巨鸦”）翅膀扇动的声音；
//Entity 80（“母鸡”）的叫声；
//碟象、极乐羔羊及跃鹅的咆哮声；
//Entity 27（“鸭典娜”）的叫声；
//Entity C-98（“无足鸟”）的鸣叫；
//Level 37（“欢迎来到丛林”）环境音。
//如果让我简短的描述一下的话，那么它听起来就像是个实体大杂烩。我在碟片前沉默地坐了五个小时，这五个小时里，我在无数实体的鸣叫中我明白了，这个碟子就是Entity 0（“后室意识”）送给我们的礼物。
//
//此外，在圆片正面还读出了大量由前语构成的短句。这些短句的时长在1秒到10秒之间，每一句都由不同的人类念出。尚无法解析这些短句的含义。
//
//即便是最精尖的前语专家也发掘不开隐藏在这些沟壑里的深刻意义——它们如后室意志本身般神秘。这些声音的出处以及意义，将成为前语学者们的永恒课题。
//
//无法确认音频是否吻合上述描述，因这些辨认记录仅出于研究员信号-烯醇醚的主观判断。
//
//另，按照总结得出的解码规则，从圆片背面的沟壑中解析了共116张图片。
//
//此为其中的第一张和第二张：
//
//voyager_circle.jpg
//
//voyager_position.jpg
//
//圆，连接到黑色矩形的数根直线，诡异的窗户……后室意志到底想要告诉我们什么？
//
//我不知道。
//
//注意到上述两张图像明显受到污染，已经无法正常显示。类似的情形在圆片背面的多张图像中广泛存在。
//
//除受污染的部分外，剩余图像皆可能正常显示。下面仅举几例：
//
//voyager_island.jpg
//
//这张似乎是Level 628（“岛屿”）的一张照片。
//
//不错的旅游胜地，哼？上面的实体不会这么说。后室意志可不喜欢安宁。
//
//
//
//voyager_highway.jpg
//
//Level 50（“边狱公路”）。
//
//我去过那里，确实是很可怕的地方。按照MEG的记录，进入Level 50的人中只有我一个人活着回来。我必须向后室意志至上最崇高的敬意。
//
//
//
//voyager_flight.jpg
//
//大概是Level 36（“机场”），飞机的背影。
//
//那里有飞机起飞的记录。或许…谁知道呢？后室意志什么都能做，包括在一个小层级里起降一架飞机。
//
//它会飞向哪里呢？
//
//
//
//voyager_astronaut.jpg
//
//Level 78（“空间站”），不知道是哪个可怜的流浪者被后室意志偷拍了。
//
//我只希望他不是我们的工作人员。祝他安好。
//
//
//
//voyager_house.jpg
//
//Level 90（“新家”），大概是某个子层级。
//
//好吧，我不太确定是不是真的有这个子层级。毕竟后室意志知道所有层级，存在和不存在的都知道。它想给我们看什么，可由不得我们来说了算。
//
//
//
//那么……这张是最后一个。
//
//我不是按照圆盘刻印的顺序来的，本书里的图片排序完全遵循着我自己的想法。之所以选择把这张图片放到最后一张，是因为直到现在我都没有找到它的出处。
//
//也许是lv90.x，也许是lv 78，这些图片所描述的东西或多或少我都能猜出来些。直到它出现在我的面前。如此诡异，如此神秘，以至于我无论怎么想都想不起来它到底是哪个层级、或是出自哪个层级。更诡异的是，于此同时，我还隐隐约约地觉得似乎在什么地方见过它。
//
//我好像来过这里，或者我好像见过这个。
//
//你愿意看看吗？
//
//.
//.
//.
//.
//.
//.
//.
//.
//.
//
//
//voyager_earth.jpg
//
//我有一个猜想：这就是后室意志的身体。
//
//回头我会用数学证明它的。
package wupin;
public class wuruqitu1009{
}