//package wupin;
//
//public class wuyingdeng1121 {
//
//}
//Object C-121 - “无影灯”
//评分: +19+–x
//统合物品分类系统
//物品编号 #：C-121
//位置：C层群部分层级
//安全性：安全
//用途：
//医疗、探索
//状态：
//可获得
//描述
//photo-1497535731420-4ca00ff4a99a?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MTR8fHN0ZWFtcHVua3xlbnwwfHwwfHw%3D&auto=format&fit=crop&w=800&q=80
//一典型的无影灯的照片
//
//
//无影灯外观上看上去像前厅中20世纪50年代左右诞生的辉光管。无影灯主体为一个呈梨形的玻璃罩，其中有折叠的金属丝，有电线连接。灯座由黄铜及其他金属组成的合金制成，其上有铭文，但由于灯座通常锈迹斑斑，铭文难以辨认。灯把通常长约18厘米，铭文同样难以辨认。距离灯座约4厘米处（图中未显示）有一黄铜按钮，按下则无影灯会在1~3秒中逐渐变亮并达到顶峰，最高光通量约为400流明。灯把底部有旋盖，打开后可灌入杏仁水，可加入约60ml，加满后可运行约4个小时，运行时杏仁水会相应地减少，同时打开时应当将底部朝上以免洒出。
//
//无影灯在正常1发光时，梨形灯罩表面温度约为180°C，若不注意可能会导致烫伤。灯罩可以使用约60牛顿的力打破，对其中气体检测出了氖气及其他气体。灯罩打碎后，无影灯会在接下来的24-30分钟内逐渐变暗并最终无法使用。灯罩最初被打碎时，灯丝表面温度约为1080°C，会对人体造成烫伤。对灯丝的化验表明其含有约60的金属钨，其余材料未知。一种特殊的白光无影灯表面温度达到了300°C，灯丝温度达到了2000-3050°C，通常专用于手术。
//
//特性
//当无影灯被开启时，其不会在周围的物体后成影子，除非其光芒被遮挡超过约75%。也就是说，当无影灯位于一个房间中时，整个房间均可被照亮而光线不会透过墙壁。因此，无影灯的光线在一些森林或有迷雾的层级中穿透力极强，很适合用于层级探索，然而其对迷雾现象无效。这种特性非常有利于B.A.G.、躯及其他组织进行手术，B.A.G.与M.E.G.也是持有无影灯数量最多的组织。同时，无影灯似乎有一定程度上的驱赶实体的作用，同时绝大多数实体似乎并不会被无影灯的灯光所吸引除非光线直接进入他们的感光器官，现有的猜测是仅有人类及某些智慧物种可以看见无影灯穿过遮挡物的光线。
//
//使用
//医疗
//B.A.G.组织与M.E.G.部分基地中的医疗部门配备有白光无影灯用于手术，因为其特性让光线不会因为医生的遮挡而无法照亮手术部位。
//
//探索
//探险者可以使用无影灯在探索过程中照明，其也可以和预警弹珠一同使用，让探索者尽早发现实体的存在与位置。然而，无影灯也可能会吸引某些敌对实体的注意，因此应当谨慎使用。
//
//自卫
//极端状态下，打碎无影灯的玻璃罩并露出炽热的金属丝可以让无影灯成为一个有力的武器，其极高的温度可以有力地伤害实体或暂时将其吓退。
//
//发现及获得
//无影灯最早于后室协调时2008年首次于Level C-640中发现，后陆续于其他一些层级中发现。后室协调时2010年同样于此层级内首次发现白光无影灯，并随后投入医疗。
//
//M.E.G.、B.N.T.G.部分基地中会售卖无影灯，部分B.A.G.基地也会提供此类装备。
//
//作者信息
//« Object C-120 | Object C-121 | Object C-122 »
//
//脚注
//1. 即光强度达到顶峰
package wupin;
public class wuyingdeng1121{
}