//Object C-90 - “无重力宇航服”
//评分: 
//+17
//+
//–
//X
//
//物品编号：C-90
//无重力宇航服为后室娱乐为特殊作业生产的一种装备。
//
//%E5%AE%87%E8%88%AA%E5%91%982
//穿着无重力宇航服的后室娱乐员工
//
//描述
//无重力宇航服的外观为纯白色，外部材质与前厅普通宇航服相同，但其中不存在通风服、水冷服(液冷服)、气密限制层和隔热层。无重力宇航服的外部保护壳以及内衣舒适层之间填充着多个紫色的散发霓虹光的团状物，其为无重力宇航服的核心部件。这种光团不会受到任何重力的影响，当其被从无重力宇航服中取出时便会开始漂浮，但漂浮过程中会受到空气阻力的影响。
//
//无重力宇航服的外壳使其内部的霓虹光球与宇航服形成了一个整体，穿戴宇航服的人可自由控制宇航服本体与其自身获得与光团同样的特性。
//
//用途
//Object C-90研究说明与记录
//由M.E.G.测验者部门记录
//%E5%AE%87%E8%88%AA%E5%91%981
//穿着无重力宇航服跳舞的后室娱乐员工
//
//1.无重力宇航服的左手手臂位置存在一个10厘米X7厘米的操作板，在重力正常的环境下穿戴无重力宇航服时可通过调整其上方的转动开关来调整自身所受重力大小。无重力宇航服同样可在太空环境中充当宇航服使用，此时其不存在任何特殊作用。
//2.启动无重力宇航服前请先检查是否穿戴完整以及其是否存在未被完全密封的部位，如果在不完全密封的情况下启动无重力宇航服，穿戴者将被宇航服内外两种不同的重力撕扯并死亡。
//3.无重力宇航服的手臂操作盘上的开关旁有一个保险旋钮，在旋钮被打开前无法扭动转盘与启动宇航服。
//4.转盘共有5个档位，分别为“0”、“1”、“2”、“3”、“4”。开关初始状态时指向“2”，这是正常情况下宇航服与其穿戴者所受的重力，将开关扭到“1”档会使自身所受重力下降至原本的1/2，调到“0”时则完全不受任何重力影响。将开关调至“3”档位时，宇航服及其穿戴者将会受到原先4倍的重力，此时穿戴者通常会被压得举步维艰，如在此基础上将开关调至“4”，穿戴者会受到相当于自身8倍的重力并因此内脏破裂而亡。
//+ 批注
//
//——M.E.G.测验者部门博士王右于201X-3-24编辑
//
//
//获取
//可在后室娱乐于各个层级设立的站点以及他们的基地处支付杏仁水订制无重力宇航服，并在7日内送至购买者所留的地址。
//
//M.E.G.目前仅持有7件无重力宇航服，详细信息如下
//
//L型1件，订购并收货于201X年3月20日
//XL型2件，订购并收货于201X年3月23日
//M型3件，订购并收货于201X年4月2日
//S型1件，订购并收货于201X年4月10日
package wupin;

public class wuzhongliyvhangfu1090 {

}
