//package wupin;
//
//public class wuzhizhuanhuaqiangxie1105 {
//
//}
//Object C-105 - “物质转化枪械”
//评分: +5+–x
//物品编号：Object C-105
//
//分布： E.P.B.高级成员、E.P.B.内部保安队与护卫队、部分被赠与此物的其他组织高级成员，以及少量的E.P.B.特别交易购得。
//
//Object C-105亦被称为物质转化枪械。该物品是由E.P.B.公司所制造的特殊枪械。且只有E.P.B.公司掌握其核心技术，同时E.P.B.公司拒绝了所有加盟生产，以及所有相关核心技术的交易。
//
//Xm8_sideview.jpg
//一张前厅中XM8突击步枪的图片
//
//描述
//尽管物质转化枪械的外型大多与前厅相同型号的枪械相符。其性能、外壳材料与前厅的同型号枪械接近一致。尽管可以进行拆解、以清理枪管内的膛线。但上机匣与弹仓部分却与前厅相同型号枪枝结构不同。该结构通常为金属、工程塑料为主要材料。该部分异常结构被认为是E.P.B.公司让物质转化枪械拥有异常性质的关键。但对于其逆向工程与调查其运作原理都以失败告终。详见其文档«Object C-105意外报告»
//
//击发物质转化枪械后，所发射出的子弹。并非装入弹匣内的子弹。而是一种银白的不明物。由于子弹的特殊效应，对于被击发后的子弹之成分分析是不可能的。进入其异常弹仓的子弹也无法被再次取出。尝试取出的结果详见«Object C-105意外报告»
//
//同时物质转化枪械的子弹，不需要与前厅外型、型号一致的枪械相同。像是部署于E.P.B.保安队的XM8理应使用7.62×51公厘NATO，但也可以使用5.56×45公厘NATO。甚至于只要能够装入弹匣的固态物质，只要能够被推进弹仓就能够击发子弹。
//
//而被其异常子弹射中后的物品。则是发生不同的变化。使用与枪械型号相符的子弹，被击中物会被转化为杏仁水 。这种杏仁水的功效与灰色杏仁水一致。但是如果装入的固态物质，并非相符的制式子弹。则会产生不同的结果。不同规格的制式子弹 被击中物将被转化为各种贵金属。一般情况下，该转化范围约在击中点约五公分半径的球形范围内。
//
//而如果装入后室物品。则有以下特殊结果。更多项目尚待测试与追加，你也可以将你的实验结果加入其中。
//
//装入的后室物品	其结果
//氙弹珠	被击中物立刻转化微光向导。
//火盐	被击中物发出剧烈的爆炸。
//迁跃浆果	被击中物消失不见。但并未出现在浆果的原产地。
//罐装龙肉1	被击中物转化为热腾腾的肉类。该肉类与龙肉罐头的内容物口感一致。
//治愈水晶	被击中者伤部立刻恢复
//时空水晶	被击中物成为一片展示前厅画面的平面。当时空水晶的效果结束后，最后的画面留在该平面上。
//蓝砂	被击中物与子弹激烈反应，并转化成异常剧烈的燃烧弹效果。其残留物分析过后证明为蓝沙。
//糖晶锭	被击中物转化为具有蓝天色彩的玻璃。
//难得素	类似于蓝砂的结果。但在生物体上的结果不同，其相关结果被封存。
//重力黄油	被击中面立刻滑向重力面，不论这个过程如何违反牛顿力学都如此。
//另外，还发现如果“物质转化枪械”装入的子弹为货币，或具有流通价值的贵金属。被击中的实体或物体，会局部转化为同等价值的对象，该过程的结果物并不固定。但并不会造成转化为有毒物，像是难得素、瑞撒毒气、蓝砂。以下是转化效率所总结出的一张表格。2
//
//子弹种类	转化率
//非贵金属流通辅币	20%~30%
//纸币	15%~35%
//金银本位货币	30%~65%
//贵金属货币	70%~80%
//国家法定银行银行签发的货币或是纯粹的贵金属单质	85%~100%
//记录
//更多项目尚待测试与追加，你也可以将你的实验结果加入其中。
//
//新增格式
//
//> //时间：201X年8月15日//
//> 
//> //物品：Object C-105//
//> 
//> //装入子弹：//
//> 
//> //结果：//
//> 
//> //结论：//
//- 隐藏
//时间：201X年8月15日
//
//物品：Object C-105
//
//装入子弹：五十张一百欧元纸币
//
//结果：场地瞬间被罐头所覆盖，并造成实验者额头被一个飞出的罐头砸成脑震荡。约有三千个罐装龙肉被转换出来
//
//结论：我们应该减少塞入的金钱。
//
//- 隐藏
//时间：201X年10月20日
//
//物品：Object C-105
//
//装入子弹：五美元硬币
//
//结果：被击中物被转化为三瓶500ML容量的杏仁水。
//
//结论：杏仁水有点贵啊。
//
//- 隐藏
//时间：202X年3月24日
//
//物品：Object C-105
//
//装入子弹：三张一百元人民币
//
//结果：被击中物转化为两克左右的 治愈水晶
//
//结论：一定要说的话，能够治的伤跟前厅的价格差不多。
//
//«Object C-105意外报告»
//在Level C-67M.E.G.C层群Alpha基地的中，原本用于研究Object C-105的实验室突然发生大爆炸。回收的监视画面显示研究员尝试使用雷射机台切割Object C-105的异常弹仓，随后发生了巨大的爆炸。而爆炸与随之而来的火灾结束后，在地面的液体除了消防用水外，也发现了杏仁水以及火盐的成分。
//
//该事故的原因被认为是该异常装置被切割后，其维持的物品转化机制不受控制，引起大型连锁反应。并造成了最终32人死亡、98人重伤、326人轻伤的事故。监督者议会下令所有对于异常机械的暴力拆解必须位于基地外的单独设施，同时使用遥控设备操作。
//
//对于Object C-105的研究工作被叫停。并永久性的冻结。
//
//以下为被记录在M.E.G.组织数据库内，各组织或是购买者持有的枪械型号。
//
//持有组织或是持有者	型号
//监督者A	SIG P250
//监督者B	FN57
//监督者C	HK USP手枪
//Donald Claud	柯尔特M1911
//Aliza	GLOCK 18手枪
//E.P.B.保安队	XM8突击步枪与P90冲锋枪
//E.P.B.护卫队	SCAR突击步枪以及MP7冲锋枪
//B.F.P.F.护卫队	AK-74M突击步枪
//功能:
//1.：安全的在危险地带与敌人火拼，例如具有火盐、难得素又或是高精密仪器、保险库等环境下不造成二次危害。
//
//2.：同时该产品也能在你意想不到的时侯，拯救你一命。像是将金钱与贵金属塞入其中，获得 治愈水晶或是杏仁水。
//
//使用方法
//1、普通模式：此模式下被击中物会被转化为杏仁水。以此避免不必要的二次危害。
//
//2、后室物品模式：该模式下主要是看塞入什么物品来决定。塞入 氙弹珠，将会让产生的微光向导指引你的道路。塞入治愈水晶则会让你立刻疗伤，或是给伙伴快速疗伤。
//
//3、货币转换模式：此模式下，是个宛如抽奖一般的体验。但只要不使用错方法。你将能获得一线生机。
//
//购买途径：
//无，除了E.P.B.高级雇员与保安队还有护卫队外。其余的物质转换枪械皆由E.P.B.公司赠与多个合作伙伴，或是少量的特别贩卖给其他组织。
//
//客户评价：
//无外部评价
//
//内部评价：
//
//保安队成员：尽管很少人能够入侵E.P.B.公司内部，但该枪械在少数几次敌方成功突入内部后，在与我方火拼时，保证我司资产的安全。至少并不会造成更大规模的损坏。
//
//护卫队评价：某种意义上，该枪械在需要严格防止火花、二次损坏之情境下，其功用十分卓越。但是在护卫队的任务不只有护卫，也亦有帮助职员回收袭击者、袭击物的责任。该枪械会彻底的让袭击者或是袭击物被彻底摧毁。在此要求增加普通击发模式，或是换回原有武装。
//
//武装管理部与研发部已经接受到意见，正在讨论相关的事宜。
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//ID	
//EPB-DMR-5-96
//密碼	
//••••••••••••••••••
//登出
//发信人：EPB-ERD-4-24
//
//有时候我们真怀疑我们是一群天才还是疯子。
//
//我们研究后室物品的本质，我们发现了完成转换后室物品与前厅物质的手段。
//
//结果我们用在攻击敌人，跟类似抽奖的货币转换机制上？
//
//好吧！我是说我们确实需要更多的转换数据，我们没有这么多的物资、时间、人力，来去取得前厅与后室物品的转换结果。
//
//但我真的不知道该如何形容，这个造成武器的点子，到底是傻逼还是真的天才。
//
//回复：EPB-ERD-4-24
//
//发信人：EPB-DMR-5-96
//
//至少我们有把好枪可以玩。
//
//作者信息
//« Object C-104 | Object C-105 | Object C-106 »
//
//脚注
//1. 不论是冷冻后的内容物，还是压缩过后的金属罐
//2. 价值不会过大，所谓价值为主观概念，因人而异。
package wupin;
public class wuzhizhuanhuaqiangxie1105{
}