//Object C-52 - “吸安器”
//评分: +12+–x
//吸安器1是由黑星研发制造的可用于吸取流浪者体内寄生实体的物品，目前只有B.A.G.购买了少量吸安器用于救援任务使用。
//
//j5k8pt.jpg
//一台存放于B.A.G.总部的吸安器。
//
//描述：
//吸安器的外观类似于前厅常见的有绳吸尘器，但吸安器可以用于吸取寄生在流浪者体内的实体，诸如：疫疾、突刺者射出的尖刺等。被吸出的实体会被储存在吸安器的机体中，等待被吸出的实体自然死亡后，将实体的尸体取出机体，以继续使用吸安器。以下为黑星提供的关于吸安器的使用方法：
//
//使用瓶装闪电或者其他电源为吸安器通电。
//将吸口对准被实体寄生的流浪者腹部。
//按下吸安器上的按钮。
//确认实体被吸出后推动吸安器上的“实体锁”使其变为“on”模式。
//事后在实体死亡后，推动“实体锁”开关使其变为“off”模式。
//清理实体的尸体以继续使用吸安器。
//请务必遵循使用指南，否则后果自负。
//
//因为使实体自然死亡的过程过于缓慢，且吸安器的售价十分昂贵，所以目前B.A.G.只对开价500瓶500mL的杏仁水或等价物品以上的委托使用吸安器。
//
//吸安器使用实例：
//事件起因：2021年11月26日，B.A.G.在对于M.E.G.高级研究员[已保密]博士的救援行动中，使用吸安器成功吸出了被突刺者击中的尖刺，以下为现场录音：
//
//[EN-576]：好了，那个突刺者已经被我干掉了，你们继续关照博士的情况，我去四周看看还有没有威胁我们的实体。
//[AS-238]：嗯，你快去吧。
//[已保密]：啊，我的脖子！啊！
//[AS-169]：先别管这些了，毒刺的神经毒素应该还没扩散，快点，给我吸安器和瓶装闪电！
//[AS-238]：好了，电已经通上了，吸安器给你，快。
//[AS-169]：好！博士你稍微忍一下。
//(吸安器吸出实体时的巨大响声）
//[已保密]：啊，这是什么！嗯？好像不痛了。这是什么物品，居然可以缓解我的疼痛。
//[AS-169]：这是吸安器，而且这并不是疼痛的缓解，您已经痊愈了。
//[已保密]：哦天呐，真是神奇的物品，谢谢你们！
//
//吸安器对于刚寄生在流浪者体内的实体有极大的反制效果，但要切记及时使用吸安器吸出实体，防止部分实体的毒素扩散。
//
//吸安器违规使用案例：
//事件起因：2022年1月2日，B.A.G.雇佣兵[FI-993]违规窃取仍未做清洁处理的吸安器，试图吸出寄生在其体内的疾疫，虽然该事件已经被B.A.G.知晓，并且当事人已经受到严重处分，但[FI-993]仍然因为疫疾感染而亡。
//在对其进行解剖后，我们发现其体内发现了远远超过正常数量的疫疾个体。因此我们推测：若吸安器机体中仍存在实体，若在此时再次使用吸安器，则不会吸出被寄生者体内的实体，并且吸安器机体内所储存的实体也会寄生入使用吸安器的流浪者体内。尽管这只是推测，但我们仍然奉劝各位迷途者以及我们的成员：
//
//务必遵守上文的使用指南，不要去做伤害自己和伤害他人的事，你们都忘记牠的教诲了吗？
package wupin;

import model.wupin;


public class xianqi1052 {
	public void use(wupin w,int i) {
		
	}

}
