//Object 69 - “氙弹珠”
//3414766914_845782bd20_b.jpg
//氙弹珠的一张近距离图像
//
//描述:
//氙弹珠 是一种小型水晶球，平均尺寸为2.5厘米。虽然球体的确切材料尚不清楚，但它本质上还是水晶，相对比较坚硬。弹珠的内部为冷凝的氙气，释放出明亮的蓝光。氙弹珠同时也因其独特的属性和用途而受到许多人的追捧。
//
//这些弹珠在微光向导的生命周期中极为重要。它充当着这些实体的“卵子”，并以此繁衍更多的实体。当弹珠裂开时，便会将诞生的微光向导释放到附近区域。该物品和实体都是无害的，不会对流浪者构成危险。
//
//用途:
//里面的氙气可用于很多机械，主要用于临时照明。它们的大小和韧性使它们可以被用作各种装置中的投射物。弹珠破裂时将会释放其中的微光向导。微光向导是一种高智慧的生物，能引导流浪者获得各种补给（食物、水、设备等）。微光向导也可以随意地出现和消失。氙弹珠由于这些用途因而具有极高的价值，并受到各种团体的高度觊觎。
//
//属性:
//可以用任何材料(固体或液体)将弹珠包裹起来，以防止弹珠的孵化。封装弹珠可以防止它裂开并释放微光向导。几乎任何物质都可以这么做，但最常用的还是杏仁水. 目前氙弹珠形成的过程尚不清楚，但有以下几个理论:
//
//理论一: 微光向导死亡
//氙弹珠是在微光向导死亡后形成的. 该实体将被包裹在此晶体结构中，并被分解为氙气。这个理论是最合理的，因为它意味着微光向导走过了一个完整的生命周期。这个理论使得微光向导的物理生物学特征成了一个谜。虽然以前认为它们只是一个光点，但它们更可能是高度浓缩的氙气。该理论并不能解释它们的感知行为，但可以让我们深入了解它们的结构。
//
//理论二: 自然生成
//氙弹珠是层级内自然环境的一部分。相反，微光向导没有生命周期；它们源源不断地产生于该物品。这意味着氙弹珠是一种与火盐和Liquid Pain类似的自然资源，在层级内自然形成. 这不太可能，因为记录发现的氙弹珠数量并没有减少，这意味着不断有更多的氙弹珠被创造出来。
//
//理论三: 气体截留
//在Level 6内形成的氙弹珠是晶体形成时截留了少量氙气的结果。这是最不可信的理论，因为氙弹珠是在Level 6之外被发现的。该理论只对部分氙弹珠成立。
//
//位置:
//氙弹珠在所有层级内都很少见,但在Level -0, Level 6, Level 16, 和Level 170更为常见. 它们也可以在许多其他层级内被发现，但大多数报告来自于以上层级。
//
//
//B.N.T.G.物品奖励信息
//
//
//
//[物品]: #69 氙弹珠
//[数量]: 十 (10)
//[奖励]: 65克的#15 火盐
//
//
//
//我们正在寻找氙弹珠。请将指定数量的物品送至任何B.N.T.G.基地以领取奖励. 请将弹珠浸入任何物质中以防止损坏。
//
//
//
//LinkIcon2.pngpackage wupin;
//
//public class xiandanzhu69 {
//
//}
package wupin;
public class xiandanzhu69{
}