//Object 32 - “现实清新剂”
//现实清新剂是技术先进的插电式空气清新剂，由神秘团体“后室装修公司”使用。
//
//描述：
//现实清新剂是“后室装修公司”的常用装备，似乎会影响附近的现实。放置并打开后，将发挥多种效果。其中最值得注意的是设备发出的类似芒果的气味。最重要的是，在装备附近较短距离内，一些“流动”的现实会停止；“较短距离”就足以说明许多这类物品的用途。目前尚不清楚这种影响是否是由芒果香味引起的。
//
//当一个实体处于现实清新剂的影响范围内时，它似乎会使该实体晕眩，看似困惑且虚弱，并且行走困难。这似乎是由于实体也不适用于现实规则，“不符常理”的实体似乎更易受到影响的事实进一步证明了这点。
//物品也会受到影响，任何不遵守现实规则的物品或是停止工作，或工作程度较低。
//
//发现地点
//为了研究和分析后室装修公司常使用的 "现实技术"，M.E.G. Gamma小队派出了一个小组，前往后室装修公司附近的一个地点。据报告，后室装修公司的员工经常去那里。此次行动目的是从一个后室装修公司的员工身上拿走一个现实清新剂。以下是上述任务的视频记录。
//
//记录开始： （时间不可用） 8/17/2021
//
//（记录开始时，摄像机对着Level 3的一堵砖墙。之后摄像机快速下移，对着M.E.G.特工Camdon Retz,他伸出舌头做了个鬼脸。一名M.E.G.志愿特工人员轻轻地拍了一下他的肩膀，提醒他别那样做。镜头抬起，转到拐角处。在远处，可以看到一个后室装修公司员工在写字板上写字，5个现实清新剂被夹在它的皮带上。该员工抬头时，镜头迅速后移。）
//
//Retz： （Retz在努力把摄像机连在他头上的带子上） 所以这些东西到底是什么？
//
//志愿特工A： 不知道，可能是某种士兵？他们在做什么？
//
//志愿特工B： 似乎在“装修”,像某种家政公司那样。
//
//Retz： （Retz站起来，向有后室装修公司员工的大厅走了几步。）你们两个留在这里，如果我叫你们或者有东西跳向我，就快点来我这里。我可不想因为这些东西而死。
//
//志愿特工B：我们会时刻准备好的。
//
//Retz： 你最好是。（Retz站着，看着那个员工。显然是在等待它转身。员工转过去时，他开始安静地在走廊上跑过去，保持低姿态，尽可能不被人注意。他走到员工身后，将一只手放在设备上。然而，这被员工注意到了，他转向Retz以示回应。）
//
//员工： 先生？您不能拿这些装备。
//
//Retz： （Retz向后倒下，显然非常惊讶。他的头撞到了瓷砖地板上，并发出了声音。） 我——我——呃——
//
//员工： 先生，你还好吗？（员工开始接近Retz，Retz则在地板上向后退着。）
//
//Retz： 我——我很好——我——
//
//员工： 先生，你需要帮助吗？（员工向Retz伸出一只手，Retz退得更远了。）
//
//（在接下来的几秒内，可以听到脚步声，两名志愿特工正在接近。）
//
//志愿特工A： （可以看到志愿特工A跑到了Retz面前，拿着一把刀威胁着员工）)
//
//志愿特工B： 我操，Cam，你流血了。
//
//（Retz因头部受伤开始昏迷，摄像机角度开始向侧面倾斜，并向地板倒去。可以看到志愿特工A正在与员工争吵。就在这时，摄像机的音频和视频开始出现扰动，显然是在Retz倒地时发生了震动。
//
//志愿特工A把员工扑倒在地，并试图迅速用刀刺入，员工没有什么反应。可以看到刀子刺进了员工的胸膛，视觉故障越来越严重，员工的眼睛在闪烁，慢慢像灯泡一样熄灭了，显然表示他已经死亡。
//
//随着Retz被志愿特工B拖走，镜头摇晃并开始向后拉。志愿特工A站在员工的尸体上，另一名员工（后来被确认为员工“Cap'n”，）走到志愿特工A面前。大部分音频干扰消失了，可以听清他们谈话的大多内容。）
//
//员工“Cap'n”：你好[被音频故障干扰]我能帮助你吗？（员工“Cap'n”看着另一个员工的尸体，俯下身子，抓住一个现实清新剂，把它从尸体上拿下来，尸体上开始流出黑色的似乎是血或油的液体。）先生，你是想要这个吗？给你! （“Cap'n”把它放到了志愿特工A的手里，特工看起来依然对它对其他员工死亡的反应感到震惊）
//
//记录结束 （时间不可用）package wupin;
//
//public class xianshiqingxinji32 {
//
//}
package wupin;
public class xianshiqingxinji32{
}