//Object 8 - “小台灯”
//设定中心 » 工业革命设定中心 » Object 8 - “小台灯”
//物品编号：8
//描述：
//小台灯是由后室机器人科技开发的高科技设备，其主要目的是帮助流浪者在后室游荡时提供帮助。小台灯批量贩售给M.E.G.，并分配给后室中一些较低的层级。人们注意到小台灯总体上具有几个较为突出的特点，并且认为这些特点基本上对后室中的流浪者都有帮助。
//
//小台灯不应与后室中的其他标准灯具相混淆，后者可以在整个后室中被随机发现，或是使用电子产品制造。小台灯是由后室机器人科技特别开发的，让后室的各种异常在小台灯那明确的目标前所失效。首先，它似乎能够自主移动，尽管没有相应的程序或特殊的移动方式。其功能是在建立在实用的灯腿上的，而后室的异常赋予了它们自主移动的能力。这些例子可以在小台灯的特性中发现，它们是：
//
//具有充分的运动能力。
//具有明显的意识能力；能感知周围的环境。
//无法破坏
//能“看见”周围的实体，并变成普通的灯具来蒙混过关。
//在被攻击的情况下有自卫能力，通常使攻击者失明。
//小台灯已被证明是有帮助的，并得到了M.E.G.的信任，由M.E.G.分发给流浪者，以便在众多层级中提供光亮。
//
//欢迎您，监督者-A
//下载完毕。欢迎，管理员。
//数据下载中……
//
//由于最近发生的事，以及最近被发现的那张字条（见下文），所有的小台灯已从M.E.G.的前哨移除。是的，我们理解它为你们每个人提供了很大的便利，但是，它们可能装有摄像头。
//
//这张字条的来源不明，但就目前而言，其数据似乎与这张字条相吻合，足以让人对后室机器人产生合理的怀疑。
//
//台灯台灯小台灯
//我的老天啊，它们在盯着，它们都在盯着。小台灯有眼睛。
//
//我在那层走来走去，那盏灯在后面跟着我，它跳来跳去可真可爱。我拿起它
//
//我的老天爷……
//
//上面全是摄像头，到处都是细小的摄像头，细小的针孔摄像头，几乎看不到。
//
//背面写着后室机器人科技
//
//它们是谁？
//
//谁在监视我们？
//
//我得跑了。
//
//如果你发现了这张字体，请告诉大家小台灯的信息。
//
//小台灯在看着……
//
//老天爷，它们在跟着我。
//
//蹦跶时歹毒般监视着
//
//我得跑了。
//
//目前所有的小台灯都不值得信任。所有就这问题联系后室机器人科技后，都被回答道是疏忽，到现在为止后室机器人科技都没有向公众披露任何信息。package wupin;
//
//public class xiaotaideng8 {
//
//}
package wupin;
public class xiaotaideng8{
}