//package wupin;
//
//public class xiaoshiwoju1159 {
//
//}
//Object C-159 - “消食莴苣”
//评分: +23+–x
//salad-3480650_1280.jpg
//一颗新鲜的消食莴苣（背景已做处理）
//
//物品编号：C-159
//
//位置：位于Level C-245与蔗糖秘境的B.C.A.俱乐部
//
//描述
//消食莴苣是一种仅由B.C.A.（后室厨师联盟）研发并栽培的异常作物，外观类似于前厅菊科莴苣属莴苣，但体积略小于后者。
//
//消食莴苣可食用，口味与普通莴苣无异，建议经过烹饪后再食用。值得注意的是，消食莴苣包含绝大部分人体必需的营养成分1，但似乎完全不会为食用者提供热量——由于B.C.A.俱乐部成员有意地避开这一话题，该现象的原因未知。M.E.G.推测，消食莴苣内部的新陈代谢过程不同于任何已知的生物，而为消食莴苣提供能量的物质则完全不被人体所吸收。
//
//- 收起
//M.E.G. “测验者”部门在E.P.B.的协助下，从消食莴苣叶片取得微量样品，这种结构类似多糖的物质从未在前厅的任何一种生物中被发现，并被命名为莴苣多糖。莴苣多糖在消食莴苣中充当与淀粉类似的角色——通过光合作用合成，并被用于储存能量以供消耗。不过，莴苣多糖因其结构特殊性，食用后难以被人体识别，不参与人类新陈代谢，不为人体提供能量。
//
//E.P.B.人员亦指出，他们从消食莴苣中首次分离得到一种植物蛋白，组成肽链的氨基酸与以往的所有记录皆不符合，据称，该植物蛋白不被所人体吸收。
//
//——Romando Bērzi
//
//
//消食莴苣会为食用者提供大量饱腹感，且效果明显强于一般蔬菜，通过X光透视观测，消食莴苣在接触胃中消化液后逐渐膨胀，且最大可以膨胀至原先体积的5～6倍，推测消食莴苣中含有与胃液强烈反应的物质，暂未确定这种极具针对性的设计是否为B.C.A.有意为之。
//salad-3519389_1280.jpg
//待采摘的成熟消食莴苣，由B.C.A.人员拍摄于Level C-██
//
//用途
//消食莴苣口感清新爽口，且较于普通莴苣似乎更易保持新鲜，普遍被B.C.A.俱乐部成员及其他后室中烹饪爱好者用于烹制菜肴。
//
//消食莴苣不提供任何可为人体提供热量的物质（如典型脂肪、糖类、蛋白质），营养成分充足且产生饱腹感，有促进人体消耗自身皮下脂肪的作用，可以作为减脂食品长期食用2，尤其受到有降低体脂率需求的人群与喜爱清淡饮食者的青睐。
//
//- 收起
//6月5日本档案发布于M.E.G.官网后，B.C.A.相关方面称，后期将以相同的方式，继续培养与消食莴苣性质相似的蔬菜品种。7月2日，有流浪者报告称部分B.C.A.俱乐部开始将冠以「消食甘蓝」名称的商品摆上货架，商品外观类似于前厅十字花科芸薹属甘蓝，且食用后同样不为人体提供热量。
//
//在后续的报告中，B.C.A.开始售卖诸如冰草、马铃薯等异常作物，这些商品均表现出上述特殊性质。经讨论，M.E.G.决定以发现时间为标准，将具有类似特性的所有物品标记为Object C-159的子物品。下为已记录在案的Object C-159品种（为保持简洁删减重复出现的“消食”部分）。
//
//莴苣（Object C-159-1），最早发现的Object C-159品种。
//甘蓝（Object C-159-2）。
//冰草（Object C-159-3）。
//马铃薯（Object C-159-4），其中淀粉完全被莴苣多糖所替代，是目前M.E.G.制备莴苣多糖的主要原料。
//番茄（Object C-159-5）。
//更多品种有待补充。
//——Romando Bērzi
//
//获取
//你可以在Level C-245的“西餐爱好者”俱乐部及蔗糖秘境「应急救援」部以6～8瓶杏仁水的价格3换取约重500克的消食莴苣，Level C-245亦提供以消食莴苣为原料烹制的菜肴。有流浪者声称在Level C-194的基因仓库中疑似观察到消食莴苣种子样本，此说法尚未得到证实。
//
//附录
//一份来自B.C.A.的烹饪指南
//「零卡」色拉
//沉迷于蛋糕大师=D的绝妙面点无法自拔，在赘肉堆积后悔恨不已？现在回头还来得及，来看看这款真正「零卡」的可口色拉吧！在享用美味佳肴的同时保持完美身材将不再是梦想。（若您追求口感，可以选择「超美味」版本，只需参考下划文字内容制作即可）
//
//
//salad-2
//「零卡」色拉（仅供参考）
//
//配料
//鲜蔬
//
//消食莴苣（Object C-159-1）	40g
//甘蓝（Object C-159-2）	30g
//冰草（Object C-159-3）	10g
//番茄（Object C-159-5）	20g
//黄瓜	25g
//洋葱	20g
//青椒	20g
//湛蓝萝卜	20g
//色拉酱汁
//
//盐	3g
//沙拉油	25g
//白胡椒粉	2g
//
//
//
//
//
//
//
//
//
//
//
//
//I. 使用净水充分清洁「鲜蔬」，莴苣、甘蓝掰为不规则状，冰草掰小份，黄瓜切椭圆形薄片，湛蓝萝卜切圆形薄片，番茄切片（或角），洋葱切圈， 青椒去籽切圈。
//
//II. 将经过处理的「鲜蔬」码放在盘内。
//
//III. 将沙拉油与醋混合，再加入盐与白胡椒粉调匀。
//
//IV. 将「色拉酱汁」摇匀，食用时浇在色拉上即可。
//
//
//
//作者信息
//« Object C-158 | Object C-159 | Object C-160 »
//
//脚注
//1. 如大量的膳食纤维及镁、钙、磷，少量的铁、铜、锌等微量元素
//2. 由于消食莴苣不提供蛋白质，长期使用时建议配合优质蛋白（如牛奶）
//3. 蔗糖秘境事故受害者免费提供
package wupin;
public class xiaoshiwoju1159{
}