//package wupin;
//
//public class xibaozhixue1025 {
//
//}
//Object C-25
//细胞之血
//评分: +22+–x
//描述
//细胞之血原产于Level 3，是仅存在于其活动器械中的一种特殊液体。其外观一般为亮银色。这种液体极其粘稠且具有一定磁流体性质。鉴于细胞之血导电性良好且比热容较大，细胞之血是工业设计中不可多得的材料。
// 
//细胞之血的获取方法较为困难。通常的收集方法是利用高爆炸药摧毁单个活动器械并在其基本冷却后进入收集。活动器械中运作部分下方的位置常会出现细胞之血。因采集具有一定危险性且难度极高，这种收集是在严格管控下进行的，若是单人或小团体计划收集，建议前往因故障而停止运作的破损器械。
//
//用途
//制备悲伤之水
//这项技术给我们带来了巨大收益。在加热至60℃的细胞之血中加入过量水并通入二氧化碳，这样可以使得细胞之血分解为 悲伤之水，这也是为什么收集时不用水来冷却炸毁的活动器械的原因之一。
// 
//
//处理特殊空间间隙
//细胞之血有顺延空间间隙蔓延的特性，一般来说，在细胞之血中混入其他化学药品再使之与空间间隙一角接触便可以对大片空间间隙进行处理。如查找、清理、腐蚀、加固、采集材料等。
//
//发现
//于在Level 3的流浪者发现并上报，该流浪者在不久之后失踪。
//
// 
// 
//
//已通过
// 
//
//特殊用途
//研究报告
//
//我们逮捕了那个发现了细胞之血的流浪者及其所属的社区。感谢他们对科学所作出的贡献。
//
//依照计划，我们将他们分为A、B两组，每组共16人。每个人都将摄入250ml细胞之血，并被分别安置在16个分开的隔间(A组)和1个较大的房间(B组)内。这些房间足够坚固，无法被轻易破坏。房间中有充足的食物，足够维持他们基本的生存。
//
//实验进行的很成功，在记忆汁的镇定下，我们的奉献者们成功地喝下了细胞之血。接下来我们会在房间里安装摄像头，观察人体在摄入细胞之血之后的变化。
//
//第一天
//
//A、B两组均呈现脱水，头晕等不适症状，两组状态并无明显差别。
//
//第二天
//
//A组出现死亡，共3人因过度脱水而死。其余人(包括B组)已严重脱水，症状包括腹泻，视觉丧失，晕厥甚至皮肤大面积脱落。1值得注意的是，B组中有一人因缺水肉体溶解，凝结形成输液管补水。
//
//第三天
//
//A、B两组均出现机械化的症状，普遍为输液管、储水器、水泵一类，也有一些无用机械被制出。实验对象基本上完全脱水并丧失行动能力。
//
//第四天
//
//大致症状与第三天一致，不过他们吸水速率太快，原本被放在里面的水有点不够用了……
//
//第五天
//
//A组基本实现完全转化，就连已死亡的3个对象尸体也被转化为无用的机械与零件。B组大部分人也已完成机械化，甚至有数个对象互相利用机械部件连接，某些机械开始出现超自然现象，如无限电力、不断涌出的杏仁水等。
//
//第六天
//
//A组对象完全丧失行动力，化为活动机械与无用零件混杂的堆砌物，其外形与性质均与Level 3中活动机械相似。B组也完成机械化实验对象之间的连接物不断增多，包括但不限于电线、输液管、支架、光纤等。
//
//第七天
//
//A组反应完全结束。B组…………仍在生长。
//
//第八天
//
//B组对象之间的联系已经足够多，甚至可以视作单个机械，房间内水资源完全耗尽，不过由于其超自然部件的缘故，它仍然可以继续工作。
//
//第九天
//
//B组对象开始干扰房间周围的信号……摄像头信号丢失。
//
//第十二天
//
//虽然我们没有可用的摄像头，但现在也不需要了。毕竟，房间顶部的那个缺口显眼的很。
//
//第十三天
//
//B组所处的房间开始冒出浓烟，经证实，该浓雾主要成分为汞与悲伤之水。
//
//第十五天
//
//它制造的浓烟被转化为了降雨2，造成了对附近环境的严重污染，难以长时间探索。
//
//第三十七天
//
//B组房间发生剧烈爆炸，经探索发现它已不复存在，尚不清楚其消失原因。
//
//第三十八天
//
//鉴于它已经消失，我们在污染地区建立了临时研究所。
//在我们的不懈努力下，实验道具之一 ——紫钥石在其附近发现了异常，经全面搜寻，我们发现了一道通往Level 3的空间间隙，发现时这个空间间隙已闭合，推测为它所消失的原因。
//
// 
//A组回收表如下
//零件/材料种类	废零件	杂物	(仍能)活动的机械	半超自然机械	超自然机械
//零件/材料占比	24%	29%	39%	8%	0%
//
// 
//+作者信息
//
// 
//« Object C-24 | Object C-25 | Object C-26 »
//
//Footnotes
//1. 这是在供水充足的情况下。
//2. 虽然这里没有严格意义上的天空，指的是在空气中冷凝。
package wupin;
public class xibaozhixue1025{
}