//package wupin;
//
//public class xingyun1007 {
//
//}
//Object C-7 - “星云”
//评分: +19+–x
//物品编号：C-7
//
//位置： 目前主要发现于C层级内各式燃气设施，其他形态下也有发现，填充于各类气体容器中，或是在某个层级内以气体形式大量聚集。
//
//描述：
//astronomy-1867616_960_720.jpg
//气态星云
//
//星云是一种可燃气体，整体上大致表现出与前厅的天然气相似的物理特性，但仍有其独特性质。当大量星云气体被释放在空气中时，由于其密度较空气更小，会漂浮在空气上空，而后凝聚形成一幅壮丽的星辰图像，每次形成的图像各异，但总是深邃的宇宙图景，而此种状态似乎带有某种心灵效应，总能让人体验一种前所未有的宁静与安详，舒缓人员的心理状态。而星云显示的图像目前仍未证明这是否是前厅的宇宙区域。
//
//星云没有毒性，如果被吸入，心灵效应可能深入，转化为哀愁的情绪，产生对地球的思念感。人员总会报告感受到心灵的落寞感和忧愁，就像是被置身于无垠的宇宙空间，看着眼前可望而不可即的无尽星辰，不知归处。
//
//用途：
//星云可以完好的展现与天然气相近的燃料用途，例如住宅建筑、工业采暖，工业生产以及后室部分特殊构造发电机动力，也可使用星云驱动车辆行驶。星云在-33.2℃的温度下会冷凝为液态，此种状态下的星云可以做为航空燃油的替代品，甚至少数M.E.G.技术人员表明，经测试星云甚至可能用做火箭动力。液态星云混合一定比例的腰果水将大大提高星云的沸点，且不明显影响燃烧性能。不过由于后室的空间限制，很少存在可供航空器畅通飞行的层级。
//
//星云的性能被证明后，因为可替代部分火盐的使用途径，甚至更进一步的用途，各类组织希望寻找更多的星云来源。由于Level C-28的星云难以分流供应其他层级，Level C-34的星云储量有限，而其他层级发现的星云的数量不稳定，也难以持续性满足大量的需求，各种大型组织、武装组织、隐秘组织和流浪者都在寻找星云气体的大量蕴藏区。
//
package wupin;
public class xingyun1007{
}