//器编号：Flesh C-81
//
//代价：小
//
//安装位置：前额
//
//生产商：醒脑冰沙由有识血肉学者氏族主导研发并在各有识血肉贸易巢进行批量生产后交由“躯”售卖，因此仅保证安装过程无危险，对产品本身性能有任何疑问或建议请直接与有识血肉对接。
//
//备注：伟大母亲认为用无机物文明的食物命名产品有助于提高消费者对产品的接受程度，不过根据最近的市场调研结果来看可能有消费者不喜欢此类命名方式，因此该产品也有另一名称“䑏疏之角”1。
//
//+ 伟大母亲的低语
//介绍
//醒脑冰沙是一个小型应急生命维持系统，其主体包含内容如下：
//
//活性血液泵“冰块”：
//由数块肌肉组织构成的两个腔室，星状肌肉纤维结构能让这些肌肉朝各个方向收缩而不是仅有前后两个方向。肌肉能将脑内血液吸入上腔室并导入气囊完成氧气交换，并将交换完成的新鲜血液泵入脑中。
//上下腔室分别收缩一次为一个完整循环，用时大约5秒，循环间间隔一分钟，同时下腔室中有腺体会持续分泌微量的内啡肽保持使用者心情健康不失去求生意志。
//
//气囊“果肉”：
//主体呈海绵状，有较大孔洞，内外表面都可直接与空气中氧气进行交换保证在更小体积下的更大吸氧面积。通常情况下仅通过空气流动便足以满足最低维生需求，如果检测到切实不满足时，会缓慢收缩舒张加强周边空气流动以寻求更多氧气，与“冰块”连接完成整体养分交换。
//
//咖啡云卷“色素”：
//在未启动时“果肉”中含有经过染色的绿色咖啡云卷液体和对其进行向上驱离的信息素，“果肉”启动后的初次呼吸会将咖啡云卷液体喷出并完成气化，在使用者上方形成绿色云柱以标注使用者位置和告知需要支援信息。
//
//外层骨骼护板“装点”：
//这是负责包裹整个物品的大型骨骼套筒，整体采用水煮骨髓科技制成因此无需担心强度，目前可以选择不同外观，但是最推荐的仍然是安装在前额方向的角状。主体呈多段式结构，在其他器官启动后会撑开分化并将下方藏匿的少量肌肉组织外露伪装出头部受击破损的样子来蒙蔽搜捕者。
//
//“蜂巢”消化及防护装置“蜂蜜”：
//这是一系列经过基因剪辑的特殊细菌，平时储存在未被激活的血液泵上腔中，随着血液泵第一次跳动会快速分布到整个脑组织外围并开始溶解吸收非脑组织或该物品的蛋白质，当吸收达到一定程度后。会开始进行分裂，每一次分裂时，遗传物质链条末端部分会锻炼出一个特殊RNA序列，其中一部分会继承该特殊命令RNA对消化器官持续释放的信息素产生反应，前往此处并进入消化器官中被消化，因此这些个体会均衡的保持固定数量，并且能同时兼顾为整个机体摄取养分和处理未被确认为脑组织的入侵者两个功能，也就是说能在较短时间内同时作为消化器官和免疫器官使用。
//
//最终备用资源“牛奶”：
//这是一个小型囊泡，其中溶解着少量氧气和营养物质，足够让大脑支撑两个小时左右，是上述所有器官都已失去作用的情况下的最后一搏。
//
//说明
//如何使用：
//
//一、 尽管理论上醒脑冰沙可以完成自行安装，但是由于脑部较为精密以及大多数探索者并不具备相关知识所以建议您前往有识血肉巢穴进行专门安装。
//
//二、 安装完毕后醒脑冰沙会保持在萎缩休眠状态，只吸收少量养分并不会影响到使用者身心健康。将会保持该状态一直持续到使用者受到致命外伤或突发性器官衰竭等一系列难以维持自身躯体正常功能的情况为止。
//
//三、确认进入该情况后醒脑冰沙会开始进入活跃状态，在外层骨骼护板开启后原本处于萎缩状态的器官会迅速被唤醒并吸收血液膨张恢复开始工作，首先外层骨板会打开并爆散成近似骨茬和模糊血肉的聚合物2。
//
//四、“蜂蜜”的菌落群会溶解关闭所有大脑以外区域的血管和神经连接，仅保持大脑部分物质流通，随后开始分解除大脑以外的物质作为营养来源，同时“果肉”会伸出身体缓慢膨胀收缩，取得大脑能正常运转的氧气进入心脏，此过程大约需要10秒左右，在此阶段被挽救者可以直接关停醒脑冰沙，而不对身体产生任何影响。
//
//五、所有器官会按照预定模板开始运转，由“冰块”维持最低限度血液流通，脑组织本身会陷入近似呆滞或是浅睡眠的状态以减少能量消耗3，处于这一状态下，理论上大脑可以坚持72个小时以上，其中24小时左右脑干和头部肌肉会被溶解，48小时以上会失去小脑和大部分头部皮肤，72小时时大脑近乎裸露，4全部免疫活动仅交由蜂巢系统来完成，在此阶段被挽救者必须进行全身移植，但大脑基本完全保留不会产生太大影响。
//
//六、超过72小时后养分会严重不足，此时会由于功能和醒脑冰沙本身器官逐渐开始衰竭等一系列原因逐渐放弃脑组织区域来保证更好的生存
//
//80小时左右，脑桥和中脑会被完全放弃，使用者在完成身体移植手术后需要一段时间来重新恢复对器官的基本控制。
//85~90小时后，大脑的边缘系统会被抛弃，使用者将丧失大部分本能行为，即使移植完成后也必须要重新学习。
//95小时左右杏仁体和海马体会失去，此时就算使用者被拯救也将失去近期的短期记忆。
//95小时以上，大脑皮层会逐渐失活，得到拯救的使用者会丧失精神记忆和个性等一系列内容。
//七、若是超过100小时使用者仍然未得到救护，心脏中的腺体会将所有聚集的内啡肽全部释放，让使用者安详的进入梦乡。
//
//注意：
//一、 该物品的主要设计目的是为了针对躯干损伤脏器衰竭之类的伤口，如果是直接针对脑组织的毒素或是脑组织已经出现破损，那么无法挽救。
//
//二、 该物品的购买价格已经包含了在有识血肉巢穴进行身体移植的手术价格，默认移植的身体是偶像氏族的标准身体模板，如果有额外需要的请另行添加购买。
//
//三、 外层骨骼破损不影响整体装置发挥，因此即使在前端也没有太大问题，如果该装置整体损毁，那么大概率使用者的大脑也已经损毁。
//
//四、若不能接受头部长角这一造型的使用者也可以购买值于后颈部分的版本，该版本可以用头发将其遮住。
//
//五、躯和有识血肉全体成员承诺会以像拯救同族一样的努力去拯救每一个打出咖啡云卷信号弹的人类。
//
//六、以上给出的理论生存时间仅是在相对适合正常人生存5的区域，如果环境更加恶劣的区域这一时间会相应减少，如果是极端环境区域甚至只有备用能源能支撑大脑的两个小时。
//
//七、不要放弃希望，好好活着，奇特风景和数不清的秘密还等着你去探索，这样的伤不配夺走你的性命，相信你的队友，相信我们，更相信你自己，即使是这样的挫折，你要做的也是跨过去而不是在这里倒下。
//
//获取
//目前其标准版可通过流浪商人处购买，若是希望购买实验版的探索者可以前往有识血肉城市购买，实验板的价格仅为标准版的1/10且功能更强6。
package wupin;

public class xingnaobingsha1081 {

}
