//Object 28 - “幸运豆奶”
//幸运豆奶是一种由大豆制成的饮料，在后室颇受欢迎，可以与杏仁水媲美。幸运豆奶受欢迎度上升一定程度上得益于坚果过敏的人无法饮用杏仁水。
//
//描述
//幸运豆奶是一种大豆饮料，是杏仁水的绝佳替代品，适合对坚果过敏的人。 豆奶瓶通常由玻璃制成，类似于牛奶瓶，瓶身上有标签。标签似乎是与玻璃一体的，更像是有色玻璃。6种口味分别对应6个不同的标签，每种口味都有不同的效果。标签背面有成分表，成分如下：
//
//大豆：100%
//糖：0%
//天然防腐剂：300%
//人造调味剂/色素: 0%
//
//标签还提到其中含大量钙，使得该物品成为后室中最健康的饮品之一。
//
//幸运豆奶的效果与口味：
//如上文所述，每种颜色有对应的标签和口味，可以通过查看瓶盖的边缘来识别，瓶盖边缘有一条与之匹配的色带。标签上也有标注口味，很容易辨别幸运豆奶的口味。唯一的例外是运气款和香蕉味，两者都没有在标签上标注口味。运气款幸运豆奶的效果由实际情况决定，如果没有正确识别和处理，可能会造成危险。
//
//口味	颜色	效果	稀有度
//原味	白色	N/A，味道类似豆奶，热的时候更好喝	非常普通
//草莓味	粉色	类似咖啡因，带有薰衣草香味	非常普通
//巧克力味	紫色	缓解背部疼痛和肩膀僵硬	普通
//抹茶味	绿色	有镇静作用，能治疗失眠	普通
//香蕉味	黄色	N/A，有很浓的香蕉味	普通
//运气款	黄色	有很浓的香蕉味，饮用的豆奶越冷，饮用者越不幸，饮用的豆奶越热，饮用者越幸运	稀有
// 
//[音频日志加载中……]
//
//[开始日志]
//
//Nicky：好了，测试，测试1。很好，因为Stan和Arthur都出去办任务了，所以我一个人来录这个。
//
//[机械的声音]
//
//Nicky：所以豆奶是从这些有趣的小扭蛋机里出来的。它们在Level 4随处可见，而且也提供冷的豆奶，挺好的。这些扭蛋机不需要你付钱，而且用不着插座，可以直接插在墙上。这太疯狂了，我跟你说。
//
//[模糊的打开瓶子饮用的声音]
//
//Nicky：嗯，真他妈好喝，味道像巧克力牛奶，这真是用大豆做的？让我看看，营养价值……不加糖，不加人工调味剂，100%大豆。妈的，听起来就像是他们把《杰克和魔豆》2塞进了瓶子里，然后……这东西还富含钙？哈哈，看起来我找到了个好东西。
//
//[更多机械的声音]
//
//Nicky：啊哈，这个是黄的……就这样吗？黄的是什么口味的？？标签上该死的口味去哪儿了？？是柠檬味的还是香蕉味的？嗤，我猜唯一的办法就是……
//
//[喝豆奶的声音]
//
//Nicky：妈的——咳，咳，操，这可真——
//
//[响亮的砰砰声]
//
//Nicky：[清晰的尖叫、大喊，其中包含脏话] 哈……哈，呼，“好东西”，妈的……
//
//[持续几分钟的喘息声，偶尔有咒骂声]
//
//Nicky：好吧，我觉得，我应该起得来了。呼帮帮忙…… 起来，你他妈的。
//
//[录音设备被捡起的沙沙声和脚步声]
//
//Nicky: Alright……来吧，呼，只需要回M.E.——我操——
//
//[ 报告称，Nicky Oswald从Level 4切入了“蜂巢”，随后长达3小时的视频充满尖叫和脚步声，因此已被剪辑。最后，Nicky Oswald成功逃离，在“终点”与M.E.G特工Diana Hylius和Ray Thousand汇合。调查发现他喝的黄色的幸运豆奶是运气款，由于机器供应的幸运豆奶是冷的，在随后的3到4小时内他的运气尤其差，导致他因不明原因从非正常的入口切入蜂巢。饮用该豆奶后短时间内受伤如下：右臂三处骨折，跌入蜂巢导致的脚踝扭伤，连续三个小时为躲避猎犬、死亡飞蛾等奔跑造成的手、脚、脸和手臂上的多处擦伤和瘀伤。 ]
//
//[日志结束。]
//
//由于香蕉味与运气款过于相似，强烈建议在饮用前把任何/所有黄色豆奶加热到至少71摄氏度。如上文所述，二者标签上均未标注口味。
//
//幸运豆奶的用途：
//饮用幸运豆奶可以带来多种有用的效果。为了最大程度发挥该物品的作用，请按照以下说明进行操作（注：你也可以仅用它来补充水分。）
//
//提高睡眠质量：
//将抹茶口味幸运豆奶倒在纸巾上，然后慢慢地用它轻拍眼睛、鼻梁和眼睛下方。这有助于减轻眼睛、耳膜的压力，并疏通鼻子，从而提高睡眠质量。
//
//饮用：
//如果你想找一种获得效果的简单办法，直接饮用幸运豆奶。该物品富含营养，除了“幸运Nicky”事件外，没有记录到其它任何幸运豆奶引起的不幸事件。但大豆过敏者不能饮用该物品，因为其完全由大豆制成。
//
//作者信息
//« Object 27 | Object 28 | Object 29 »
//
//Footnotes
//1. 译注：此处为节目开始前的试音。
//2. 译注：一个童话故事。package wupin;
//
//public class xingyundounai28 {
//
//}
package wupin;
public class xingyundounai28{
}