//package wupin;
//
//public class xuankujiashiqi1045 {
//
//}
//Object C-45 - “炫酷驾驶器”
//评分: 
//+22
//+
//–
//X
//
//物品编号：C-45
//炫酷驾驶器为一台可以驾驶的机器。
//
//steer
//一台正以129公里每小时行驶的“炫酷驾驶器”。
//
//描述
//炫酷驾驶器为一台外观与游戏用驾驶外设相同的机器，其轮廓会显现霓虹彩线，彩线颜色会随驾驶速度而更改。当其处于待机状态时方向盘上会显现“后室娱乐”的图标及“博君一笑”的字样。其钢架可进行折叠，附有背带，利于搬运携带于各个层级。
//
//炫酷驾驶器包含一张方向盘，一根档把，以及三块踏板（分别对应离合器、刹车、油门）。当其处于开机状态时，其会延伸出驾驶座椅及置物台，驾驶座椅的高度由流浪者的身高决定，流浪者可席于驾驶座椅并进行驾驶。待机状态时，置物架及驾驶座椅会折叠收纳于炫酷驾驶器的钢架中。
//
//炫酷驾驶器拥有自主意识，在进行驾驶时可能会干预驾驶，但通常不会对流浪者产生危害。
//
//当流浪者在正常情况下驾驶炫酷驾驶器时，其会在不同的时速下出现不同反应：
//
//当时速小于30公里时，炫酷驾驶器会试图将档杆升至三档，并会在方向盘上显现“开的太慢啦！”“能不能开快点！”“还没有走着快！”等字样。
//当时速位于30公里-60公里时，其彩线颜色会由白色转为黄色。
//当时速位于60公里-90公里时，其彩线颜色会由黄色转为橙色。
//当时速位于90公里-120公里时，其彩线颜色会由橙色转为红色，且流浪者眼中的场景会逐渐转变为合成器风格的场景。
//当时速位于120公里-150公里时，其彩线颜色会由红色转为洋红色，并时而会在方向盘上显现“注意安全驾驶！”“尽量慢一点！”等字样。
//当时速大于150公里时，炫酷驾驶器会进行减速，并会在方向盘上显现“你他妈疯了吗！”“你不想活着我想！”等字样。若时速多次大于150公里，炫酷驾驶器会进行快速刹车并将流浪者从驾驶座椅上弹出。
//sun
//时速大于90公里时流浪者眼中的场景。
//
//用途
//炫酷驾驶器可用于在层级中进行快速移动，缩短两地间移动所需时间。
//炫酷驾驶器也可用于搬运货物，且置物台会将任何物品吸附于其之上，使得物品不会掉落。
//在紧急情况下，炫酷驾驶器也可用于攻击敌对实体或敌对流浪者。
//logob.png
//显现的图像。
//
//特性
//当流浪者在驾驶炫酷驾驶器时，若遭遇敌对实体或敌对流浪者，炫酷驾驶器会在保证流浪者安全的情况下自行将方向转向该实体或流浪者，并加速对其冲撞，然后进行减速。而当炫酷驾驶器即将撞到其他实体、流浪者或阻碍物的时候，其也会自行在保障安全的前提下将方向转向其他位置，并进行减速。
//
//当炫酷驾驶器稳定在一定时速范围内时，其会播放一些合成器风格的音乐，并通过显现文字与流浪者进行聊天。在此过程中若流浪者与其聊天，其会自行保持速度与方向，保障流浪者的安全。但不知为何，炫酷驾驶器可以播放声音和接收流浪者的声音，却无法通过声音与流浪者进行对话。
//
//若有除炫酷驾驶器的主人外的任何流浪者试图驾驶该机器，其便会释放出120分贝的声音，使该流浪者出现昏厥、反胃、头痛等生理反应。
//
//获取
//炫酷驾驶器可于Level C-70的商店中购买。
package wupin;
public class xuankujiashiqi1045{
}