//Object 85 - “亚格鲁格亚果”
//2022物品竞赛 » Object 85 - “亚格鲁格亚果”
//Agrugua
//我们的最新产品：亚格鲁格亚果。
//
//Asset #85：亚格鲁格亚果
//优先级：高
//
//价值：高
//
//价格：4.5磅火盐或进行其他等价的交易。
//
//不结盟贸易集团现推出一种既能帮您从善扶弱，也能助您为必要之恶的全新产品。是时候让亚格鲁格亚果隆重登场了！
//描述：
//亚格鲁格亚果（呀-咕噜-嗝-呀）是一种仅在后室少数地点内出产的水果。这种水果拥有许多近亲水果种类所没有的独特性质；它拥有柑橘属果实的外观，看起来像个中等大小的红色柠檬，且带有别具一格的草莓与酒精气味。因为亚格鲁格亚果仅在Asset 194出产，所以它早已风靡整个层级。
//
//功效与风味：
//Nutrition.jpg
//营养成分表 （由于员工的失职它会含有一定的错误信息, 请注意它的含糖量不是8克，而是33克。）
//
//亚格鲁格亚果在食用时拥有许多正面功效，主要是其令人难以置信的治疗能力。当此水果被食用后，任一轻微症状包括但不限于头疼，胃疼或喉痛都会渐渐好转，完全治愈的过程约为20分钟；此过程经常被详细描述为会让使用者感到“刺痛感”与体内的“温暖感”。而亚格鲁格亚果的味道则被描述为具有极大冲击力，兼具与草莓相媲美的甜度。1正因如此，只要您吃上一次，它令人垂涎三尺的甜味和让人上瘾的风味便会叫您欲罢不能, 亚格鲁格亚果就是好吃到根本停不下来！
//
//注意：亚格鲁格亚果被证实具有极高的酒精度，在短时间内进食多于5个亚格鲁格亚果将可能导致视线模糊，语无伦次，反应迟钝。在极少数情况下会诱发心脏病。2望各位注意。
//性质：
//亚格鲁格亚果还可以通过多种非食用的方式来治疗伤口：
//
//将亚格鲁格亚果汁敷在伤口或淤青上以开始20分钟的治疗过程。
//将一片亚格鲁格亚果按压于粉刺上将能在几乎一瞬间吸收所有油分并消除皮肤上的瑕疵。不建议食用被用于上述疗程的亚格鲁格亚果。
//吸入亚格鲁格亚果的香气可以治愈鼻塞并清理鼻窦。警告：过量吸入亚格鲁格亚果香气将会导致上瘾并使人易打喷嚏。
//用亚格鲁格亚果皮在皮肤上轻轻擦拭可以使皮肤变得软嫩白皙。但这也可能使皮肤暂时性地发炎。
//将亚格鲁格亚果汁滴入一流浪者的眼中将能短暂地大幅增强此人的视力。而如此做则会让他感到极强的刺痛感。
//销售地点：
//亚格鲁格亚果仅在Asset 194的果树上生长，使得Asset 194成为了亚格鲁格亚果的交易枢纽。售卖亚格鲁格亚果的商人会定期造访Level 11，Level 10 和猛攻站。这些商人可由其身后显眼的大号B.N.T.G.徽标与脸上如沐春风的表情认出来。他们总是乐意用亚格鲁格亚果来换取你的物品。
//
//配方：
//为了丰富它的吃法， 亚格鲁格亚果被开发出了制成各种各样的美味小食的方法，其中一些将在以下内容中介绍。
//
//亚格鲁格亚思慕雪
//Juice
//亚格鲁格亚思慕雪
//
//食材：
//
//3个过熟亚格鲁格亚果
//1个柠檬
//16盎司杏仁水
//步骤：
//
//先将16盎司杏仁水倒入料理机中。
//柠檬去皮，果肉置于料理机内。
//亚格鲁格亚果去皮，将皮放入B.N.T.G.官方特供垃圾箱内！之后将果肉置于料理机内。
//搅拌混匀20至70秒
//开动吧！
//成品：
//在Level 149炎炎夏日中犒赏自己的绝妙美味！它酸甜可口的风味将会让您的味蕾无比欢欣享受。
//
//注意：饮用亚格鲁格亚思慕雪将会在饮毕后即刻产生强烈的酒后效应。
//亚格鲁格亚沙拉
//食材：
//
//2个亚格鲁格亚果
//半头生菜
//10个草莓
//1个香蕉
//半个菠萝
//步骤：
//
//首先将亚格鲁格亚果，香蕉，草莓和菠萝切成小块或薄片。
//切片完成后，将水果平放于舒展的生菜叶上。
//将果蔬混合物置于碗内，待食材风味磨合得恰到好处。
//与朋友共度美好时光吧！
//替代品： 将亚格鲁格亚果汁浇淋在您的沙拉上。
//成品：
//如果您拥有充分的时间和原料的话，亚格鲁格亚果沙拉绝对是您的不二之选！它的制作过程简单易懂，给您带来梦幻般的舌尖体验！您永远不会吃腻！在惊喜酸甜口味冲击您味蕾的同时，您也享用了健康美味的一餐。
//
//亚格莱素™️ (呀-嗝嗳-吱)
//原料：
//
//7个未熟透亚格鲁格亚果
//20盎司腰果水
//1盎司火油
//任意量真菌簇或霉菌孢子
//步骤：
//
//将火油倒入一个小型防火容器内。
//接下来将腰果水倒入容器内，轻轻搅拌。
//将7个亚格鲁格亚果连皮磨碎，完全倒入容器内，充分混合。
//将真菌团/霉菌孢子充分研磨并倒入容器。
//容器封盖，充分摇匀。
//摇匀后将亚格莱素™️提取后就能使用注射器将它注入你的攻击目标体内啦。
//大功告成！
//成品：
//这种强大的浆液是后室内已知的最强毒液之一。身陷鏖战了吗？您只需把亚格莱素™️注射入您敌人的体内就可收立竿见影之效，我们敢打包票您一定能在战斗中凯旋而归。
//
//注意：请务必仅将本品用于正当目的。
//评价：
//Spencer S
//我永远觉得这些果子不够用！在此我个人强烈推荐亚格鲁格亚果。它治好了我所有的外伤，谢天谢地，B.N.T.G.爸爸愿意把它卖给我！
//
//Henry S
//这东西针不戳！虽然有点小贵，但最后绝对会让你觉得物所超值。我在用亚格莱素™️在对付猎犬时感到使用体验极佳。
//
//监督者-B
//在研究这种水果后，我们M.E.G.必须警告所有亚格鲁格亚果的消费者一次只得摄入少量的果实。一次性摄入过量会引发副作用。每天请勿食用多于两个 亚格鲁格亚果，因为对亚格鲁格亚果成瘾的现象已十分严重。
//
//Helen R
//当我渐渐变得人老珠黄之时，我定居在了Level 194，这里富产的亚格鲁格亚果极大地帮助我缓解了痛苦。它尝起来宛若天物，美味至极。但我也知道人生中所有的美好之物都已在冥冥中标好了价码。
//
//产品经理
//« Object 84 |Object 85| Object 86 »
//
//Footnotes
//1. 营养成分表使用非传统方式换算，某些信息可能存在错误。
//2. 目前仅有4例因食用亚格鲁格亚果而造成伤病的报告。package wupin;
//
//public class yagelugeyaguo85 {
//
//}
package wupin;
public class yagelugeyaguo85{
}