//package wupin;
//
//public class yanlixiang1188 {
//
//}
//Object C-188 - “岩里香”
//评分: +18+–x
//物品编号：Object C-188
//岩里香是一种通常生成于各室内层级墙壁或屋顶等区域的可饮用液体，味道独特，目前被作为一种高价值奢侈品和流通物在层级之间进行交易和使用。
//
//描述
//部分情况下后室在生成层级或产生物资时，原本应该出现在室内的物资会被错误地生成在墙体内部，这种情况下墙体内部的食物会长期处于有一定空气流通但相对封闭且温度恒定的环境中。
//
//尽管大多数情况下食物会干枯碎裂成墙体的一部分，但当所属层级湿度较高或是错误生成的食物本身含有较高的水分时，这些食物可能会在墙体中长期发酵，最终形成一种可以饮用的特殊液体。
//
//和其他发酵产物相似，这些液体有20%~40%的酒精含量，除此之外有10%无法探明的杂质，探索者将这种产物称为岩里香。
//
//尽管岩里香通常出现在绝大多数层级的墙体或是地下。或屋顶之类的位置，但是这些物质却超乎预料的纯净，在其中几乎不会检测到固体杂质，少数能检测到的固体杂质也是原有食物的残余。
//
//特殊效应猜测
//目前认为岩里香的产生是由于后室错误生成“补给”和“场景”的相对位置，因此后室对这些物品进行某种“修复”，希望其能以“食物”的性质脱离出墙壁而不是继续保持“交互”状态，但固体在空间上无法脱离墙壁。转化为的液体保有这一属性，作为一种“补给”不再“场景”这一固体发生交互。
//
//实验结果证明这一观点，岩里香在渗透入尘埃或墙体时不会溶解其中物质，只会渗透在其中。如果对其进行密闭蒸馏或是区域内渗透的岩里香已经到极限，就会很快滴落，滴落的物质不会与滴入前发生任何成分上的改变。
//
//获取
//岩里香最常见的获取方式是使用一个容器对准正在渗出岩里香的墙壁和天花板进行接纳，如果探索者恰好处于可以对墙壁以及周边物品进行破坏的层级也可以直接将浸透岩里香的墙壁砸下带回聚集地进行蒸馏提取。但是需要注意的是由于岩里香具有挥发性，保存容器需要有较好的密封性，目前认为最适合的保存容器是杏仁水喝完后的空瓶。
//
//少部生成环境极为巧合的岩里香会恰好处于一个相应的容器中，对于这类岩里香的采集需要小心的将容器取出后携带至聚集地中。
//
//使用方式
//由于岩里香对于口感的掩盖性较强，不建议与其他食物共同食用。目前认为较好的处理方式是在睡前或是用餐后取用，少量岩里香摄入并置于舌尖上品尝其味道，等待其中味道已经品尝完毕后自然咽下，感受暖流流过身体的感觉。
//
//功效
//无，尽管诸多传说中岩里香有助于过滤身体内重金属离子、强化探索者切入切出能力、甚至是让探索者获得奇术能力等种种功效的传言。
//
//但是实际上根据对其内容进行的化验以及试验结果来看，饮用岩里香的效果约等于饮用一瓶等量的清香型白酒，但是可能有略长的醉酒时间，原因似乎是那些具有芳香性但是无法探明的杂质。
//
//文化内涵
//由于岩里香有独特的口感且极其稀少，产出方式也较为独特，这使得它成为一种被广泛认可的奢侈品，通常来说在聚落欢迎外来者或是庆功的宴会上会被作为压箱体的高级物资取出以表示对来宾的尊重或是对功绩的认可。
//
//除此之外异途道门极其看重岩里香，认为这种从后室中自然生成的物质蕴含着某种灵气，是有助于修行的珍贵天才地宝。因此异途道门往往会以相比普通探索者高的多的多的出价来收购各类岩里香并在冥想打坐前饮用作为辅助冥想的物质，因此通过岩里香异途道门能获取大量资源也被证明是可行的。
//
//最后岩里香中特殊的杂质目前尚未完全探明，这给予许多科研探索的可能。有识血肉似乎也在大量收集岩里香并提取其中的杂质进行研究，但即使是有识血肉这样生物技术较为出众的文明也没有找到能够人工生产岩里香的方式，将食物放入墙中发酵只能得到普通的酒精，并且会有大量建筑材料残余。
//
//- 关闭
//我们愿意为任何发现的龙脉髄浆支付五倍以上的价钱，任何发现这些宝物的人都可以第一时间来向我们寻求交易
//
//- 关闭
//顶上芳
//这是最常见的一类岩里香，经常在各种室内层级的天花板上以液滴的方式缓慢滴落，晶莹透明，酒味香醇，入口绵，落口甜，饮后余香不绝，有一股淡淡的生石灰气味，如果上方有铁质电器的话会有一股独特的铁锈腥气，目前的市价是50倍等体积的杏仁水。
//
//壁中香
//同样较为常见，这类岩里香由于位于高度较低的墙壁中，通常味道更为浓郁厚重，酒体入口醇厚甘美，酒体柔和净爽，著香协调，余味悠长。如果所处区域有一些其他家具尤其是木质家具，则会带有一股淡淡的木头香味，否则只有酒香和淡淡的生石灰味，市价同样是50倍等体积的杏仁水。
//
//值得一提的是，如果生成区域靠近机械时，壁中香会有一股明显的石油味，严重破坏口感，这会导致其价格大打折扣通常只有原有价格的一半不到。
//
//锈花香
//这是指出现在有大量金属，尤其是机械墙壁之类区域的岩里香，其最明显的特征是周围的金属墙壁会出现轻微的锈蚀但并不会被锈穿，通常来说可以将周围的金属切割后直接将锈花香和金属容器一并取出。
//
//此种岩里香酒质清澈、色泽微红如锈似花、酱香醇厚、扣杯留香，故得名锈花香，市价可达百倍杏仁水，若是能带上容器则价值更高。
//
//琼浆
//这是最为稀有而独特的岩里香，目前可以确定的是，它会被错误生存在一些矿物质内部。这会使矿物质内层出现一个明显可见的空腔，而由于矿物质本身的完整性，这一空腔会连同其中的物质一同保存，最终形成类似水胆石的效果。
//
//由于本身有极高的艺术价值，该类型的岩里香几乎不会被饮用而将作为一种宝物永久收藏，其价值也极其惊人，其价值的判断方式近似于大多数宝石根据其成色和液体内容量来决定最终价值，但是可以明确的是这些价值已经超越了大多数探索者的承受上限。
//
//异化香
//这是出现的少数错乱和本身就有错误生成倾向的层级的特殊产物，其性质尚未探明，并且极其难以采集，目前已确认这样生成的产物不具有饮用可能性，但是有极高的科研价值，对于研究物质在后室错误生成的规律与利用提供了珍贵的研究素材。
//
//发现
//该物质最早的发现纪录是C层群民众自卫保护组织中队长之一的郭淼为改善营地中由于水资源匮乏而导致居民个人卫生状态较差的问题而组织进行的一次科研搜寻项目，目的是提取出一些较为容易制造并且气味较好的可喷洒香料。
//
//一部分探索者曾经在旅行中闻到浓烈的酒香味伴随着一股独特的香气，大多数探索者都反映这种气味能够舒缓心态并且让人略感放松，因此一只探索小队被派出试图寻找这些物质的源头，最终从墙壁中蒸馏出了最早的岩里香。
//
//而之后的化学测验显示其可以被饮用，之后便开始广为流传。
package wupin;
public class yanlixiang1188{
}