//Object 61 - 盐水中的流浪者
//物品概述
//Objects 61.1 到 61.12 是一组帆船。它们可以独自在陆地或者水面层级上自行移动，不需要船员，也不需要船长。
//
//描述
//Object 61 或称为布瑞森的船只。是以已故的B.N.T.G.的食品部负责人阿加莎-布瑞森命名的一系列物品。符合下列标准的都可以被归入此物品：
//
//1. 这些物品一般可以被统称为“帆船”。每个物品的品牌和型号不同，但是都可以与前厅中的物品样式对应上。
//
//2. 当这个物品进入任意一个层级时，其任何表面都不会有动物、植物、微生物或者真菌的痕迹。
//
//3. 对于上述物品，在它们所出现的环境或者层级中，没有关于上述物品的预先记录或者描述。它们也会改变周围的环境来“解释”它们为什么在水外，尤其是在陆地地区。
//
//4. 这种物品有着轻微或明显的磨损。
//
//5. 这种物品不需要其他人的协助就可以进入或者离开任意一个层级，只要它们想这么做。
//
//任何符合上述标准的物品，尤其是符合上述标准1和标准5的没有被记录的物品，应当立刻拍照记录下来，以便更好的对 Object 61 进行分类或者调查。但是非常不鼓励对任意的 Object 61 进行深入探索，因为进入任何已知的或者疑似为 Object 61 的实例都是十分不安全的。
//
//Object 61 的实例是按照其发现的顺序用数字标注。到目前为止，已经记录下了12个实例。Object 61.1 是在1990年9月，由Booreson首次记录下来的。每次发现新的实例都会比上一次发现晚2到51个月。
//
//值得特别注意的是 Object 61 的实例在层级之间移动的路径。除了几个例外，通常一个实例在两个层级之间的路径是已知的，而人类也可以通过物理或者非物理手段来追踪，虽然这样十分困难。1虽然直接使用 Object 61 来进行层级间的移动对人类来说几乎是致命的，但是通过对它们在后室中的行动的记录，可以收集到更多关于在层级之间移动的信息。
//
//Object 61 的“消毒”过程
//在 Objects 61.1 到 61.12 停留于某个层级时，其上经常会覆盖有一些生命力较强的东西（像是细菌、藻类、苔藓等。）然而，对上面的生物物种进行抽样年龄测定发现，在层级之间的移动过程中，该物体上存在的所有生物都被清除或者被消毒掉了。
//假设这也适用于人类。出于各种原因，对这种假设的任何测试都是高度不可取的。
//
//Object 61 的实例在到达某一层级后，可能会在原地停留几个月甚至几年。同样的，它们也有可能在类似的时间里消失。Object 61 的实例一旦离开该层级，就没有可靠的方式去追踪，所以很难预测它们的去向。一般来说，我们可以安全的假设它们在没有记录的层级或者未知层级中的某个区域通过未知的出口重新出现。
//
//medium.jpg
//在 Level 563 的城区边上的 Object 61.1，这是它最常用的栖息地。在陆地区域上时，其下方或周围可能会出现支撑物，以“证明”其外观，例如上图的拖车。在水上的则不需要。
//
//‡
//
//实体列表
//关于个别物品外观的说明
//在这个表格里标有*号的，在接下来的参考部分会有额外的对于外观的描述或者图像。
//
//Instance	Make / Model (prod. date)	Recorded Observances
//61.1	木制“龙”级龙骨船(1929)	1990/9， Level 10
//1991/3，Level 66
//2000/12， Level 282
//2020/7， Level 124
//2022/2， Level 563
//61.2	玻璃纤维-木制的M-16单桅三角帆船 (1950)	1992/6， Level 108
//1995/1， Level 204
//1998/5， Level 129
//2013/4， Level 532
//61.3	木制的“飞龙”船 (c. 1830)	1993/10， Level 66
//1994/1， Level 11
//2001/5， Level 103
//61.4	松树制维尼尔-泽法尔小艇 (1957)	1995/1， Level 240*
//61.5	金合欢wa'a kaulua2 (c. 1780)	1999/4， Level 291
//2006/6， Level 140
//2011/12， Level 8
//2012/1，Level 69
//2022/5， Level 817
//61.6	丹麦木制顶帆双桅船 (c. 1720)	2000/6， Level 85
//2008/7， Level 5*
//2019/9， Level 84
//61.7	木制小艇3 (c. 2000)	2001/3， Level 4
//2006/2， Level 7
//2010/8， Level 17
//2021/7，Level 100*
//61.8	木制“沙包”单桅帆船 (c. 1860)	2006/7， Level 233
//2009/1， Level 116
//2020/6， Level 115
//61.9	柴油动力的豪华帆船4	2008/2，Level 172
//2012/10， Level 33
//2014/1，Level 130*
//2019/7， Level 499*
//2020/1， Level 10
//61.10	聚乙烯帆板船(2001)	2013/11， Level 880*
//2015/9， Level 134
//2021/3， Level 500*
//61.11	Saw-board åfjording5 (c. 1820)	2017/12， Level 826*
//2022/1， Level 230*
//61.12	玻璃纤维 C&C 超级 30 竞赛游艇 (1977)	2018/6， Level 300
//2021/11， Level 173
//‡
//
//观察参考
//Object 61.4
//图片：2000/5， Level 240
//zephyr.png
//Object 61.4 现有的唯一照片。与许多 Object 61 的实例不同的是， Object 61.4 只在这里一个地方被记录下来。它一直在洛特卡湖直到2001年的4月份消失。洛特卡的孙子们都声称没有观察到 Object 61.4 到来或者离开，但是他们报告说洛特卡不太可能参与其中。
//
//Object 61.6
//日志：2008/7， Level 5
//Object 61.6 是在酒店大厅旁边的一个大门厅里。门厅里有很多沙发，边桌和墙上的喷泉。该物品本身被放在一个石头座上，周围被支柱绳索围了起来。还有一块描述丹麦皇家海军经历过的一些值得一提的战斗的牌子。在这个船只离开后，门厅又变为了一段普通的走廊。
//
//在该酒店的员工里，只有行李员 会在该物体停留期间做出评论。它们对该物品对走廊交通的影响以及如果酒店经理看到后会有什么感受表达了明显的担忧。
//
//Object 61.7
//图片：2021/8， Level 100
//medium.jpg
//Object 61.7 在 Level 100 的岸边休息，这里在涨潮时会被淹没。一般来说，想要进入 Level 100 只能通过和居住在这里的影子互动；而 Object 61.7 的出现，很可能不是通过这种方式。这说明 Level 100 可能还有其它的入口。
//
//Object 61.9
//日志：2014/1， Level 130
//Object 61.9 被发现于 Level 130 中一个大型拱顶游泳馆内，其安装有多个天窗，而该结构被认为是该物品的另一种表现形式。值得注意的是，Object 61.9 的船体上有几道很长的裂缝。
//
//该物品所在的被染成了不同寻常的茶色，同时池边还有一些茶色的污渍。通过进一步的测试表明，池水和污渍中都含有一定数量的体液，但是不属于任何已知的生命形式。
//
//日志：2019/7， Level 499
//Object 61.9 在 Level 499 被发现。这次它将这个层级的下层地下墓穴围成了一个被淹没的洞穴。而之前出现过的裂缝也消失了。
//
//随后许多报告提供给了M.E.G.，同时表达了对许多“神爱之繁生”成员被困在大迷宫表达的担忧，据估计大约是 Object 61.9 的干扰才导致这样的结果。在2019年7月30日，“导火索”小队的Rigel 和 Arcturus已经被派往Level 499 进行紧急处理。
//
//日志：2019/8， Level 499
//Object 61.9 和之前一起出现的洞穴在五周后一夜之间消失了。随后该地区又恢复了它原本的迷宫状态，同时被困人员也被解救了出来，没有人员死亡。
//
//在最初被困的30人中，有28人已无生命危险，还有2人正在紧急护理中。大多数人都表现出了感官剥夺和饥饿的暂时症状。可以将他们得以活下来的原因归功于他们在封闭的地下墓穴可以直接接触到泉水和植被。
//
//Object 61.10
//日志：2013/11， Level 880
//Object 61.10 是在“礁石行者号”外部一个似乎是为其定制的一个气闸中发现的。该气闸联通着海洋，但是内部却只有恰好可以容纳的下这艘船的水。这个气闸和它通往更大的潜水器的入口在这艘船离开时后消失了。在此期间，气闸和这艘船分离了：船只进水，并沉入了海底。随后便消失在了所有人的视野里。
//
//在Object 61.10 将近一年的停留时间中，一些在场的参观者们表示该层级内的电梯偶尔会对这个物品的存在表达抱怨。
//
//图像：2021/3， Level 500
//barque.png
//Object 61.10 最接近 Level 500 的船体时。据现场工作人员和观察员说，Object 61.10 在经过时没有明显的转向或者是规避动作，而是以直线行驶离开。
//
//Object 61.11
//日志：2018/1， Level 826
//关于 Level 826 中存在的 Object 61.11 22份个人记录中，最后一份被匿名归入M.E.G.的记录。
//对该物体的表象以及行为的第一手描述与现存层级中的 Object 61 实例相同，但是都提到了其在无底洞边缘的 位置以及都面对着“手”。
//
//日志：2022/1， Level 230
//Object 61.11是于2022年1月11号在 Level 230“陋滩”区域被发现。该物品并没有表现出扭曲周围环境来适应自己的迹象。但是，它是被发现于通往Level 18的门边上。6经过调查，通常教室和卧室的集合被一片漂浮在冰冷海水上的木板和草皮所取代，并且被持续的浓雾进一步遮盖。
//利用Object 57产生了以下的投影。为了可以在屏幕上看见它，对原始地图的投影进行了复制。
//
//origin.png
//在 Object 61.11 于2022年1月23号从 Level 230 离开之前，无法对水体以及一些更大的岛屿进行调查，而此后也没有再发现它。除了再有一些年代大约为19世纪末的纺织物和玻璃碎片以外，就别无他物了。
//
//‡
//
//作者/许可信息
//« Object 60 | Object 61 | Object 62 »
//
//Footnotes
//1. 上面提到的“例外”是指对层级之间的移动方式不了解导致的。
//2. 一种传统的波利尼西亚的双壳独木舟，现代双体船的前身。
//3. Object 61.7上面没有任何型号或者品牌的标志。外表被涂成绿色，后部刻有“LISA”的字样。
//4. Object 61.9中的文件表明，这是Holbaek Skibs在1954年做的Havet号的复制品。
//5. 一种传统的挪威划艇，起源于福森半岛，使用到20世纪中期。
//6. 译注：原文以及译文中均未出现该出口。package wupin;
//
//public class yanshuizhongdeliulangzhe61 {
//
//}
package wupin;
public class yanshuizhongdeliulangzhe61{
}