//package wupin;
//
//public class yansuanruipulaisipian1111 {
//
//}
//PLS-IV-111 - “盐酸瑞甫莱斯片”
//评分: +33+–x
//统合物品分类系统
//物品编号 #：PLS-IV-111
//位置：帕拉斯研究所
//安全性：安全，不稳定
//用途：
//医疗及劳保用途
//状态：
//可量产
//物品编号：PLS-IV-111
//位置：帕拉斯研究所 & 小范围外部流通
//描述：
//PLS-IV-111从药理学上被命名为盐酸瑞甫莱斯片1。本品呈蓝色，三角形，每瓶装25片。此类药物可以部分地逆转麻醉药、麻醉品、催眠药和酒精的抑制作用。所有瑞甫林类药物都可引起深度精神作用，包括警觉性、主动性和信心提高，欣快感、疲劳感减低，语言增多，以及集中注意力的能力增强。同时由于此类药物的异常性质，短时间内使用者的行动速度、新陈代谢和思考效率会被成倍数加速。由于神经元链接加速，使用者脑内电讯号传递变快，其眼中的世界会等比变得缓慢。本品测试起效时间10-15分钟，标准有效时间30-45分钟。
//
//以下为帕拉斯研究所方面节选的一些客户回复，有助于流浪者们了解盐酸瑞甫莱斯片。
//
//发信人:asdfghjkl@backmail.com
//收信人:plstechnology@backmail.com
//主题:关于物品PLS-IV-111“盐酸瑞甫莱斯片”的试用反馈
//效果不错，除了用完感到有些腰肌劳损没什么大问题。
//劳保良品，真心强推！
//——一位维修工作从业人员
//
//发信人:aidosfallingdown@backmail.com
//收信人:plstechnology@backmail.com
//主题:关于物品PLS-IV-111“盐酸瑞甫莱斯片”的试用反馈
//药很强，副作用也强。
//我的肱骨现在还打着夹板……
//一般，普通推荐。
//我估计这药上市后就不这样了，可能会回购的。
//——一位特殊作战人员
//
//发信人:lifeshit@backmail.com
//收信人:plstechnology@backmail.com
//主题:关于物品PLS-IV-111“盐酸瑞甫莱斯片”的试用反馈
//哈哈我TM就是后室之王 ！！！！！！！
//——一位[已编辑]，此信息不具参考价值，作为反面示例展示。
//
//附录：
//收起
//盐酸瑞甫莱斯片的作用功效：
//瑞甫莱斯是一种中枢神经兴奋剂，其弥补人类注意力及思维障碍的作用机制尚不明确。被认为通过影响突触神经元对肾上腺素和多巴胺的再摄取等机制，以及增加这些单胺物质并释放至神经元间隙。瑞甫莱斯右旋构体相比左旋构体更具药理活性。
//
//盐酸瑞甫莱斯片的普遍用途：
//本品用于弥补人类注意力及思维障碍，提高使用者的反应速度。
//在符合PLS-VI诊断标准的13-40岁志愿者参加的三个对照试验中证实了本品对于弥补人类注意力及思维障碍，提高使用者的反应速度的功效。当咖啡因等促醒类药物效果不佳时。本品可作为药理解决方案的一部分。对弥补人类注意力及思维障碍的解决方案可能还包括其它措施(如：物理的、心理的和外部的)。应根据PLS-VI标准或者PLS-IV的规定。并基于使用者的病史和体质分析做出诊断。
//是否使用本品需依据对每名使用者面对状况的严峻性的全面评估，并非所有情况下均可以使用本品。
//
//盐酸瑞甫莱斯片的药理副作用：
//
//可能会造成严重的头痛和眼部充血
//身体部分区域的肌肉痉孪
//有弱成瘾性
//盐酸瑞甫莱斯片的物理副作用：
//
//肌肉超限制移动，不加注意会造成严重的肌肉痉挛以及骨骼磨损。
//神经元超负荷运转，可能造成精神紊乱、过度用脑甚至脑死亡。
//连续服用六片及以上有致死的可能性
//
//哪些人严禁使用瑞甫莱斯？
//
//有明显焦虑、紧张和激越症状的人群 (可能会使这些症状加重)。
//已知对瑞甫林类或本品其它成份过敏的人群。
//孕妇、哺乳期妇女、6岁以下婴儿、青光眼患者。
//有家族史或诊断有抽动秽语综合征的人群。
//正在或14天内使用过瑞甫林类抑制剂治疗的人群(可能导致高血压) 。
//哪些人需要谨慎使用瑞甫莱斯？
//
//本品药效结束后可能引起头晕。所以当驾驶、操作机械或从事其它具有潜在危险性的活动时应慎用本品。
//癫痫、高血压患者慎用。
//特殊人群能否使用瑞甫莱斯？
//根据临床经验，给精神病患者服用瑞甫莱斯可能使行为障碍和思维紊乱的症状加重，因此在用药前应进行抽动症的临床评价，还应考虑使用者的家族史。
//在临床试验中，与安慰剂比较，本品和每天服用3次的瑞甫林分散片都可使安静状态的脉搏每分钟平均增加20-60次，收缩压和舒张压平均升高10-50mmHg。所以，服药后可能因血压升高或心率加快而可能引起危险的人群应慎用本品。对服用本品的使用者应定期监测血压和心率，尤其是高血压患者。
//本品应慎用于有药物依赖史或酒精依赖史的人群。长期滥用会导致明显的耐药性和精神依赖，并伴随不同程度的行为失常。尤其是在父母滥用药物时，可引起婴儿的精神病发作。因对滥用药物的停用可能引起严重的抑郁症，应对其停用过程进行监护。长期治疗停药时，可能会使一些潜在疾病症状显现，需要进行随访。
//临床资料显示，瑞甫莱斯对于有癫痫病史的患者、无癫痫但脑电图不正常的患者以及极少数的无癫痫病史且无脑电图异常的患者，可能降低其惊厥阈值。因此，一旦出现癫痫症状，应停用瑞甫莱斯。
//老人小剂量开始，视病情酌减用量。
//
//瑞甫莱斯与哪些药物会有相互作用？
//
//本品与抗癫痫药、抗凝药，以及类铬松合用可使血药浓度升高，出现毒性反应。
//本品与抗高血压药以及利尿性抗高血压药合用，效应减弱。
//本品与杏仁水合用可双倍增效，但副作用也会呈双倍增加。
//本品与中枢兴奋药、肾上腺素受体激动药合用，作用相加，可诱发紧张、激动、失眠、甚至惊厥或心律失常。
//实验记录
//收起
//报告提交时间：XXXX年X月X日
//记录实验：瑞甫莱斯的合成
//报告提交时间：XXXX年X月XX日
//记录者：已编辑-1
//记录概要：新型化合物瑞甫莱斯的合成获得成功
//
//10时00分00秒
//记录开始
//
//10-00-02-32
//实验人员取样并进行提纯
//
//10-05-36-28
//化合物A性状开始变化。
//
//10-39-23-45
//生成物被放入离心机内
//
//10-39-25-48
//离心机开机
//
//10-50-37-27
//化合物A转化为化合物B
//
//10-58-37-48
//实验人员加入化合物C
//
//11-04-37-28
//实验人员加入化合物D
//
//11-12-37-47
//实验人员将混合物放入反应釜
//
//11-47-24-46
//观察窗内混合物中生成白色固体
//
//12-00-00-00
//记录结束
//
//作者信息
//« PLS-IV-110 | PLS-IV-111 | PLS-IV-112 »
//
//脚注
//1. 瑞甫莱斯：密度：0.963g/cm3，沸点：202.1ºC，折射率：1.527，蒸汽压：0.321mmHg at 25°C，外观：白色晶体。此类化合物是一系列对中枢神经系统具有显著兴奋作用的合成药物（统称瑞甫林类）的原型。瑞甫莱斯为白色晶体，味辛辣。
package wupin;
public class yansuanruipulaisipian1111{
}