//Object C-64 - “压缩睡眠舱”
//评分: +12+–x
//
//物品编号：C-64
//位置：E.P.B.组织研发部门
//
//OC-64.jpg
//一张Object C-64的照片
//
//Object C-64是由正电子科技公司（E.P.B.）公司生产的睡眠舱。目前，只有E.P.B.掌握这种物品开发的关键技术。
//
//描述
//简而言之，Object C-641可以使受试人员以一种“梦境形态”进入某一个预先设置好的层级2，然后通过在梦中不触发任何关于目标层级的物理变化3，以此调查层级内以正常手段无法调查的区域。例如：狭小的走廊、实体横行的走廊、无处落脚的虚空、环境危害严重的地区。
//
//以使用压缩睡眠舱进入不宜反复进入的层级调查的方法调查，有效的避免了冒险队员的人力损耗，节省了探险队在各个层级间穿梭的时间，大大降低了探索层级带来的经济损耗。但其弊端也十分明显：需要层级的详细参数；只能通过意识进入，无法触碰和精细化检测物体；一次只能进入一人且启动一次所需的能量消耗巨大……总之，压缩睡眠舱使用的情景较小，对于层级的探索，将长期保持使用以人力进行实地勘探的方法为主。
//
//使用方法
//1.提前打开电子终端和主体设施，预热系统。
//2.选择一名年龄介于25~45岁的成年男性进入压缩睡眠舱。
//3.将各类电缆和电极接入受试人员的大脑，将辅助软管注入配套液体。
//4. 辅助软管连接注射针头，插入受试人员的静脉，打开压缩睡眠舱装置的第一道安全保险。
//5.在电子终端输入层级具体参数、离开时间，打开压缩睡眠舱第二道安全保险。启动装置。
//6.在显示屏上密切监视受试人员目光所及范围的情景，若出现异常，启用紧急撤离程序，避免受试人员的脑死亡。
//7.到达离开时间或紧急撤离成功，受试人员意识回到当前层级，拔下软管，第二层安全保险关闭。
//8.受试人员离开舱体主体，结束探索进程，第一道安全保险关闭。
//9.关闭机器。
//
//购买途径4
//一、前往Level 11E.P.B.驻扎处联系安德鲁•杨经理；
//二、致函epbparticletech@backmail.com表明购买意愿。
//
//由于压缩睡眠舱仪器贵重，价格昂贵，目前不支持线上配送。
//
//一套压缩睡眠舱市场参考价：
//300贴人造诺克立普贴
//
//2000克有效含量80%以上的火盐
//
//500L纯度达到90%以上的寂静汁液
//
//10套全新无重力宇航服
//
//10L指向树脂
//
//其他类型等价物面议。
package wupin;

public class yasuoshuimianchang1064 {

}
