//package wupin;
//
//public class yejianzhayong1195 {
//
//}
//Object C-195 - “叶茧炸蛹”
//统合物品分类系统
//物品编号 #：C-195
//位置：有识血肉巢穴
//安全性：安全
//用途：
//畜牧
//状态：
//可购入
//评分: +18+–x
//
//物品编号：Object C-195
//叶茧炸蛹是一种经过有识血肉基因改造后的虫卵及其副产物。
//
//描述
//叶茧炸蛹通常放置于有识血肉配备的专属容器中，己确认该容器由皮肤组织和少量肌肉组织构成。呈梭形，前端有骨质喷口用于喷洒叶茧炸蛹，目前已确认肌肉组织在启动后会按照预定速度收缩以减少使用者因为对计量无法准确把控而造成的浪费问题，在喷洒完毕后的剩余容器确认可食用。
//
//容器内含有的叶茧炸蛹外观与普通虫卵相差不大：直径一毫米左右黑色无明显纹路圆形颗粒状物。
//
//因其构造可有效分散压力，在面对来自上方的强大压力压时质地极其坚硬，失活的卵则呈现浑浊的青白色并且外壳会迅速软化，失活时间较长的叶茧炸蛹甚至已经泄露其中内容物质。
//
//对叶茧炸蛹中内容物质的分析显示其物质与普通虫卵中的物质相差不大1，除受精卵外只包括了一些简单的营养物质，以及每个叶茧炸蛹个体位于容器时为方便使用时附着在叶子上而包裹的粘胶状附着剂。
//
//使用方式
//主要使用方式是将叶茧炸蛹容器骨质一端接触到植物上表面，随后单手持握容器尖端，另一只手则握紧容器尾部，容器在持续感应体温后会自动苏醒持续释放虫卵对其进行涂抹。启动后涂抹方向需要使用者引导，应尽可能涂抹分散，不要涂双面或是重叠以防造成资源浪费。
//
//在非常紧急的情况下叶茧炸蛹也可以直接作为可食用食物，凝胶中含有少量矿物质和微量元素，而叶茧炸蛹本身则有一定数量的蛋白质，完全食用3~5瓶可以保证一个正常人一餐所需的热量供应，但是这是一种非常浪费的方式因此极其不推荐。
//
//生效过程
//当叶茧炸蛹接触到植物后会因为粘着剂效果而附着在植物表层并开始迅速孵化，该过程中会分泌大量强刺激性物质，对植物造成严重伤害并诱使其细胞加速裂变形成畸形虫瘿，目前这一过程和自然界中已经观测到的大多数普通虫类相同。
//
//但除正常生长效果之外叶茧炸蛹被观测到会对已有叶面构造进行进一步损坏：虫卵内除作为营养主体的虫类外还附带一部分微生物。这些微生物通常会生长在虫体内，伴随其唾液在虫子啃食叶片时进入植物的循环系统对其生长部分尤其是新的嫩芽和根系进行攻击，致使该部分溃烂。
//
//此时叶茧炸蛹虫体会开始分泌诱导性信息素让植物误以为其所寄生的叶片是新芽，并加强对该叶片的营养输送。由于这一过程会一直持续到虫体发育成熟，因此该过程中的植物会遭受相当大的创伤，对于大部分草本植物来说会直接致死。
//
//这些即将死亡的植物被叶茧炸蛹中的虫子汲取掉大部分养分后还会被伴生微生物阻止叶片内脂肪分解使其在被收割和烹饪时不会发出青草气味。通过该方式生成的虫蛹能够产生比同质量植物喂食动物后生成的肉类更大量的蛋白质，因虫类生长时间更短且经过改造后的物种有更强的消化能力，预计增量达到85%以上
//
//生长完成后虫体因基因缺陷无法进行变态发育，只能继续持续积累养分并将这些积累的养分以脂肪和蛋白质的形式储存起来，这导致虫体内会生长出大量脂肪并产生较为肥美的口感，同时该阶段的虫卵外层叶片会枯萎，以提示食用者叶茧炸蛹已经可以采收。
//
//进入该阶段后的1~2个月内，叶茧炸蛹就会因为脂肪阻碍器官正常运行而死去，由于并没有防腐措施，必须在其腐烂之前进行采摘烹饪。由于其中的高脂肪含量，烧烤和油炸都是口感较好的烹饪方式。
//
//获取
//和有识血肉的其他生物商品相似，叶茧炸蛹不具备自动繁殖能力，并且由于其基因存在严重缺陷，任何进行人工繁殖的尝试最后都以失败告终。因此目前唯一可行的获取方式为向有识血肉进行购买，在大多数有识血肉巢穴都可以买到未使用的叶茧炸蛹或是一部分已经生长完成的叶茧炸蛹成品，成品通常可以以两倍重量兑换杏仁水，叶茧炸蛹的虫卵价格则是每份一瓶杏仁水。
//
//用途
//对于大多数流浪者的主要用途是作为一种占地更小，产量更高的畜牧业：由于叶茧炸蛹最终成品消耗的牧草数量要比正常饲养动物切割肉质要高的多，并且对草本身也有一定改造效果，使得草也可以被人体食用，因此可以作为一种很出色的畜牧业产品，大部分森林层级的居住者都与有识血肉达成中长期贸易协定持续购入该物品作为食物补充和偶尔改善口感的零食。
//
//除此之外，由于叶茧炸蛹的强杀伤性也可以作为一种出色的无差别除草剂，能够在有效杀伤草本植物的同时产出蛋白质进行废物利用，减少开荒时的损耗。极端情况下有识血肉也将其作为彻底摧毁层级森林，用于开辟道路或是建设建筑时的施工装置2。
//
//目前观测到有识血肉已经成功研发出的一种新型技术，可以在原有叶茧炸蛹的基础上以其身体作为宿主进行次级寄生，将具有一定攻击性的生物寄生在叶茧炸蛹身上以达到在无人情况下快速布防的工作。
//
//作者信息
//« Object C-194 | Object C-195 | Object C-196 »
//
//Footnotes
//1. 但是受精卵的基因序列和普通虫卵差异巨大
//2. 以及极少数时候对于敌对组织占据层级的粉碎行动的焦土政策的一部分
package wupin;
public class yejianzhayong1195{
}