//Object 83 - “移动式真空吸尘器”
//设定中心 » 工业革命设定中心 » Object 83 - “移动式真空吸尘器”
//移动式真空吸尘器（Mobile Vacuum Cleaner，MVC）是能够在多个层级中发现的物品。
//
//描述：
//MVC 是一种常见于后室绝大多数层级的物品。它们会在有需求时出现，且通常具有被动且无敌意的特征。MVC 的商标名称为 “后室机器人科技™ ”，表明它们可能是由这家不知名公司专门制造而成的。据推测，MVC 的功能为清洁后室中的众多地面或地毯。它们会跟随自己在后室中发现的任何废弃物前进。由于后室本身的属性，它们表现出了一些奇怪的性质。
//
//当有人试图以攻击、拆解，或其他方式伤害 MVC 时，它们能够进行自卫。最常见的自卫机制是转向攻击者并开始吞噬他们身体的某一部位；随后，它们会用一套内置的金属牙齿将该身体部位切断。之后， MVC 会继续这一进程，直到攻击者丧失行动能力。最终，MVC 会将攻击者完全吞噬。MVC 在必要时能够发射大量在后室中四处收集到的垃圾，且通常会优先选用较锋利的物体。MVC 只有在攻击者超出其吞噬范围时才使用此种攻击模式。在成功削弱攻击者后，它们将以类似于其主要防卫机制的方式吞噬他们。
//
//MVC 的内部表现为一个塑料容器，外观与集尘盒完全相符。 MVC 的内壁和底部均由塑料制成。若使用该容器制作磨损布袋，则容器的材质将与磨损布袋本身一致。
//
//任何与 MVC 发生接触的实体都会将之忽略：实体似乎可以触碰到 MVC ，却不会注意到它。若流浪者使用 MVC 对抗实体，则实体并不会被后者吸引，反而会直接攻击流浪者。
//
//使 MVC 停止运行是可能的，但需要借助特殊工具。例如，使用火器可以出奇有效地对 MVC 造成破坏。虽然一般认为 MVC 的任何部位都可能很脆弱，但其顶部的中央部位往往是最脆弱的地方。一旦吸尘器被破坏，构成它的材料就都可以被回收利用。然而， MVC 的内部并不是普通的集尘盒，而是类似于一座单层房屋的小型口袋次元。
//
//这些口袋次元来自某一未知地点。目前最可信的解释是后室机器人科技™制造了它们，以便为 MVC 提供储存垃圾的安全场所。这些口袋次元非常安全，从未观察到它们发生转移或损坏。这些口袋次元都有具有导气管，似乎与 Level 1 中多处非常隐蔽的位置相连。MVC 的内部除了已被其吞噬的物体外不存在其他物体，其空间总量相当于边长 1400 米的立方体，这一数值似乎仅在受损的 MVC 内才会有所不同。
//
//若使用得当，则你可以利用这些口袋次元来制作磨损布袋。磨损布袋是一种小型背包，却能够储存非常大量的物体。如欲制作磨损布袋，则必须获取 MVC 的集尘盒。
//
//寻找 MVC 的最佳地点：
//MVC 会按需出现，因此建议投放少量垃圾来捕捉它们，最好使用盛过杏仁水的容器碎片。尽量避免在高度危险或实体横行的层级（如 Level 6）中进行诱捕；若利用这些层级，则 MVC 需经过更长时间才会出现。确保携带合适的工具以破坏 MVC；火器是最佳选择，但锤子等大型钝器在正确使用的情况下同样有效。另外，鉴于操作小型口袋次元并不容易，如欲获取磨损布袋，建议你向制作经验丰富的人寻求帮助。package wupin;
//
//public class yidongshizhengkongxichengqi83 {
//
//}
package wupin;
public class yidongshizhengkongxichengqi83{
}