////Object C-53 - “忆晶”
//评分: +14+–x
//物品编号：C-53
//
//位置：广泛分布在含有岩石的层级中
//
//v4iB5T.jpg
//成熟的忆晶
//
//描述：
//忆晶是一种生长在岩石上的稀有矿石，它们被更常见的发现于在黑暗潮湿的洞穴，隧道中。
//
//忆晶的形态多为半透明，颜色多样的六面体，触感与前厅中的石英并无两样，但其质地强度及其脆弱，任何碰撞，施压，甚至过大的声音都有可能让其炸裂成碎片，高速运动的破片会使流浪者受伤，所以在收集/运输忆晶时请务必小心。
//
//忆晶与一般的水晶不同之处在于忆晶会如植物一般生长，幼年的忆晶仅有盐粒大小，但在一段时间后它们将生长至4cm~6cm，时间长度从几小时到一周不等。
//
//忆晶很容易被辨识，它们在黑暗中会发出微弱的光芒，并且在未被收集时具有恒定的温度。目前这些忆晶是否为生物，它们如何繁殖，我们还不得而知。
//
//被收集的忆晶在五天后未被使用将会“变质”，变质期间的忆晶会接连失去温度，光芒和颜色，其作用也会因其衰退而减弱直至消失，完全衰退的忆晶将会变为一块毫无用处的灰色玻璃1。
//
//用途：
//不同颜色的忆晶分别有着不同的用途和使用方法，其具体类别如下:
//
//德利特晶
//德利特晶是第一个被发现使用方法的忆晶，其颜色为亮红色，通常被发现于被认为是危险的层级。
//
//v5iqns.jpg
//德利特晶
//
//使用方法
//将德利特晶含入口中，闭上眼，尽自己所能回想曾经经历过的一件事。一旦成功激活2，口中的德利特晶将会开始低频率震动，此时的流浪者将会感觉“头脑变得麻木”，身体逐渐失去触觉，并在几分钟后昏迷，昏迷时间约为六小时。清醒后的流浪者将会失去他在激活德利特晶时所想的记忆3，甚至不会记得自己使用过德利特晶4，他们只是认为自己“睡了个好觉”。
//
//值得注意的是，使用已经开始变质的德利特晶会产生一些副作用，据不完全统计，受到此类影响的流浪者会:
//
//想做某些事时却突然忘记自己要干什么
//无意识的怔住，时间由几秒到几分钟不等
//原本很熟悉的事物变得陌生起来
//记忆缺失
//
//为了防止受到副作用影响，请使用德利特晶前先确保其没有变质。
//赛弗晶
//赛弗晶是第二个被发现使用方法的忆晶，其颜色为紫色。
//
//v5ixhT.jpg
//赛弗晶
//
//使用方法
//闭上眼，两只手交叉紧握赛弗晶，将其置于额头处，想象自己已经记不清的一段记忆或一个人，如果赛弗晶被成功激活，使用者会突然感到周围的光线变亮，在此时睁开眼，使用者的意识将会重返那次回忆/与那个人进行过印象最为深刻的事5。
//
//当记忆回放完毕，使用者的意识会恢复，并且手里的水晶变为灰色玻璃。已经使用过一次的人无法再次激活赛弗晶。
//
//附录
//点击以打开相关信息
//德库晶
//德库晶是第三个被发现使用方法的忆晶，其颜色为蓝色，在各个层级0℃及以下的区域被发现。
//
//h2hksq.webp
//德库晶
//
//使用方法
//将身体的任意部位接触库德晶超过五分钟，使用者将会主观地感受到席卷全身的寒意。6接下来回忆任意一段记忆，随着回忆的进行，使用者的行动也会越发迟缓，直到几乎不能移动的时候，德库晶将迅速萎缩并直接消失。使用者恢复行动能力，这也表示着成功激活德库晶。
//
//成功激活后，流浪者在使用过程中回想的记忆将被“冻结”。被冻结的记忆具有以下表现：
//
//记忆变得非常牢固，使用者可以清楚地回忆起其细节
//与使用者的其他记忆和认知产生隔绝7。
//对“冻结”记忆产生一定程度的肯定。即使在使用过程中故意回忆与事实不符的记忆，也会在没有纠正的情况下认为错误的记忆是正确的。
package wupin;

public class yijing1053 {
	

}
