//package wupin;
//
//public class yixiangxianmo1189 {
//
//}
//Object C-189 - “忆乡鲜膜”
//评分: +17+–x
//
//物品编号：Object C-189
//忆乡鲜膜是有识血肉为应对“思乡症”而研发的一种特殊物品，主要作用方式是通过刺激使用者的脑部使之产生一种近似于回到“家”的感觉，用于暂时延缓思乡之情。
//尽管最终成果与预期计划南辕北辙，但确实制作出一种可以使用的物品，目前可用于缓解长距离独自行动时探索者精神状态的损伤和休息扎营问题，并在一定程度上维持探索者的精神稳定。
//
//描述
//忆乡鲜膜是一种在野外用于休息的特殊物品，可以让探索者独自在野外时不需要携带额外睡袋和露营装备，并且给予探索者一定的隐蔽能力。由于该装备不需要时常置于体表，因此分为两个部分构成，分别是脑后的连接接口和平常折叠背包中的睡袋本体。
//
//使用
//当探索者需要休息时将忆乡鲜膜的预制凹槽与脑后连接接口进行连接，此时探索者会感觉到明显的严重睡意和眩晕感，其颈动脉区域的血液被持续抽取并注入忆乡鲜膜中使芝肌肉恢复活性并按照预定轨迹展开形成两片包裹身体的膜状物，具体展开和折叠方式近似于鞘翅科昆虫的翅膀。
//
//这一过程大约需要15~20秒，完全封闭后的个体近似于一个长1.5米到2米的大型蛹装物，使用者全部器官将被薄膜完全包裹并且使体温处于较为恒定的状态，呼吸通过颈后预制接口进行，由于头部着地时，颈部与地面仍有一定空间，因此呼吸并不会受到阻碍。
//
//次日苏醒时当监测到探索者苏醒的脑电波后，预制接口会自动打开瓣膜使忆乡鲜膜内血液单向流入身体，此时探索者将会感到精神充沛，而薄膜则会因为供养不足进入失活状态，肌肉自动萎缩并按照预定轨迹完成折叠，一切就绪后从预制接口上脱落，探索者则可以开始正常行动。
//
//额外功能
//睡眠控制
//由于忆乡鲜膜在后方接口处有一个内置的生物钟系统，因此能提供类似睡眠定时的效果当探索者需要入睡时由于被部分抽取的血液和降低的体温以及适当方面的精神放松分泌物能让其迅速进入睡眠状态。
//该装置可以提前设置苏醒时间，当苏醒时间即将到达时忆乡鲜膜会逐渐撤去对探索者的覆盖，使探索者处于外界的自然温度下能够迅速且清醒。
//
//这一效果配合同样针对脑部控制的醒脑冰沙和脑花炖菌后能够成倍加强，几乎能精确控制自己的清醒时间到分钟级，并且让自己清醒时直接处于较为精神饱满的状态，即使在此之前睡眠时间较少，这一效应能显著增强在野外独自探索并且休息时间不足的探索者的生存机率。
//
//实体伪装
//当忆乡鲜膜处于启动状态时，由于后方脑部接口会刻意改变一部分探索者的思维状态，探索者将很难做梦，感觉自己处于一种浑浑噩噩心情低落的状态，这一状态的探索者会被大多数实体识别为一只悲尸，不会受到攻击。
//
//但是这一状态会显著降低探索者的休息效率，因此在每次入睡时探索者也可以选择不开启神经限制功能让自己进行正常的睡眠，而相应的忆乡鲜膜也就无法在实体面前对探索者进行伪装，因此这种休息方式通常处于周围有人放哨或者探索者已经成功到达目的地之后。
//
//原理推测
//忆乡鲜膜并不是直接改变探索者的意识，而是通过刺激大脑皮层中类似动物筑巢那一部分的意识体回忆唤起探索者对于巢穴的本能，使之产生一种安心感。
//
//这种安心感会被另外两条神经系统进一步加强：可以主动探测到当探索者想到巢穴时相对变得活跃的嗅觉和听觉神经并加以刺激，这就是为什么会听到一部分家的声音，并且闻到家里的气味或是自己身体的气味的原因。
//
//开发记录
//视频记录
//
//508：第九科研巢外交官508.7
//研究员：M.E.G.研究员高铭莹
//
//508：忆乡鲜膜的研发已经差不多可以投入商用了，没问题……
//
//研究员：效果很好，只是你们的广告词怎么写的那么奇怪？这东西对于治疗思乡之情一点用都没有啊。
//
//508：怎会如此，你们不是说在使用这东西的时候能感觉到像在家一样的温暖吗？
//
//研究员：家和家乡又不是一个东西……我们思念的是故乡，而不是在这里居住的那个定居地。通过刺激神经确实能让人产生像动物一样的本能反应，让自己有一种能待在巢穴一样的安心感，但这和缓解故乡的乡愁之间没有一丁点关系……
//
//508：我不理解，无机物文明总会因为一些莫名其妙的原因陷入消极状态，并且显著降低工作效率，工作时的注意力也会变得难以集中。
//
//研究员：你们就没有自己的故乡吗？……如果有一天你再也回不到“母亲的城市”，再也见不到伟大母亲，你不会感到失落吗？
//
//508：为什么会呢？大规模集群的情况下个体能使用空间显著减少，要追求族族扩张效率最大化就必须占据更多空间，就算伟大母亲撤回原本世界我们也能很快在这里建立起新的文明。我们不明白无机物文明一直试图回到拥挤而低效率的世界究竟为什么，学者氏族的兄弟们最早推测这是对领地意识和群居意识的畸变，并且试图在你们脑组织内编辑一部分神经来对这部分内容进行削减，但是似乎并没有想象中的明显效果。
//
//研究员：你不会理解的
//
//508：所以我们的实验失败了吗？
//
//研究员：不，这东西至少能用。
//
//508：但我们无机物文明雇用盟友因为对巢穴过度病态渴望而导致的消极效率下降问题并没有得到解决。
//
//研究员：我再说一遍，这叫故乡，不叫巢穴！
package wupin;
public class yixiangxianmo1189{
}