//Object 51 - “一些口袋”
//评分: 
//+7
//+
//–
//X
//— 描述 —
//Pocket1.jpg
//一个带有口袋石的Object 51
//
//
//Object 51是一种可以让流浪者们获得理想的储存空间的由水晶和金属制成的小型人工制品。 虽然它在应用方式上很像磨损的布袋。但是“口袋”在形式上和功能上与其有着很大差别：这种物品经常是以戒指、耳环、手镯或项链等珠宝的样式出现。而琥珀、蛋白石或黑曜石等无定形材料经常会出现于其上，故其俗称口袋石。
//“口袋”被各种团体觊觎，其要么在行动中被使用，要么被富人用作一种身份的象征
//
//
//— 用处 —
//当拥有Object 51时，流浪者们获得了随意“打包”周围的无生命或者是惰性物品的能力。被放入“口袋”的物品看上去像是突然消失，但是可以在使用者的精神控制下再次出现。大多数使用者需要直接触碰目标物质才可以控制它，但是有经验的使用者能够远程影响到物品。
//
//不论该被储存物品的历史如何，与“口袋”中的物品接触的人均会对其展现出不可思议的，超出感知的认识。储存在“口袋”里的物品不会受到时间的影响，这使得其成为运输易腐败，已腐败和容易退化的物品的最佳选择。
//
//“口袋”被认为拥有着无限的或近乎无限的承载能力
//
//— 危害 —
//只要不以危险的方式使用，例如将重物放在其上。口袋本身的使用和处理是较为安全的，与其相关的风险大多是在其发现过程中或是由于其高价值和高需求造成。那些没有组织或派别保护的“口袋”拥有者经常发现自己被想要“口袋”的人针对，并且他们自己的“口袋”也有可能被盗。
//
//建议拥有者在任何时候都要将他们的“口袋”藏起来，只有在无人注意时或是在盟友陪同下再使用
//
//— 来源&回收 —
//Pocket%202.jpg
//那些在Level 9中有着发光的窗子的屋子里经常有“口袋”。
//
//Object 51可以在Level 9被发现，它找起来并不困难。但是每次找到并回收一个“口袋”总要付出惨重的代价。在郊区的屋子里的保险箱、珠宝盒、金库和陈列柜中都有可能找到“口袋”。拥有“口袋”的屋子经常有一些不同颜色的窗户和明亮的灯光，其中蓝色的和绿色的最为常见，红色、紫色和橙色也很有名。而在Level 9之外找到“口袋”的事几乎闻所未闻，但是据说“口袋”是由流浪者进入后室时所佩戴的珠宝而产生的。
//
//Pocket%203.jpg
//一个潜在的有着“口袋”的建筑。
//
//想要回收一个“口袋”是十分危险的，但是在以三人一组的前提下回收是最有可能成功的。在尝试回收前，最好确定一条逃生路线，例如通往Level 10的草场，或是通往Level 283的游乐场。从获取点到撤离点的距离不应超过一英里，并且所有的小组成员要在8分钟之内独立的抵达撤离点。
//每个回收小组都要有一个指定的偷盗者，观察者和支援者。偷盗者负责用最隐蔽的方式进入到拥有“口袋”的建筑内并且取得它。但是不宜使用暴力，例如破门或者打碎窗户。观察者负责在偷盗者取得物品之前观察实体的动向，而支援者要随时做好顶替他们的准备。
//
//Pocket5.jpg
//跑吧，不要躲起来，不要被“邻里守望”看到。
//
//获得口袋后，“邻里守望”将会被警觉，并且会向该地区靠拢以消灭入侵者。此时各位队员必须要尽快跑到预定好的出口。如果偷盗者失去行动力，那么支援者就要带着“口袋”继续前往出口，而如果支援者失去了行动能力，那么观察者就要接过“口袋”前往出口。当成功退出了Level 9之后，那么就说明你成功了。
//
//那些“口袋”的拥有者在任何情况下都不应该进入Level 9。package wupin;
//
//public class yixiekoudai51 {
//
//}
package wupin;
public class yixiekoudai51{
}