//package wupin;
//
//public class youlingyemian1101 {
//
//}
//Object C-101 - “幽灵页面”
//评分: +63+–x
//物品编号：C-101
//
//位置：N/A
//
//Object C-101（或称为“幽灵页面”），指数张来源不明且内容令人费解的网络页面。
//
//
//描述
//发现
//附录
//描述
//幽灵页面是M.E.G.数据库中的数张不明来源的页面，这些页面的共同特点便是其所描述的内容1皆无法被证实存在，且任何人——包括该页面显示的档案撰写者2皆表示对此无任何记忆；除此之外，幽灵页面似乎无法被彻底删除——除非新建一个相同名称的页面将其覆盖，不过，它们已被证实会不定期地回溯页面来消除这种因素。
//
//幽灵页面通常会在M.E.G.数据库不定期发生的“异常停运事件”后出现。
//
//
//“异常停运事件”
//
//“异常停运事件”是指此前M.E.G.数据库发生过的一系列异常事件，该事件不定期发生，会导致M.E.G.数据库在一段时间内无法访问，此后又会立刻恢复正常运行——于此同时，一个新的幽灵页面将会产生。
//
//“异常停运事件”的发生会有如下预兆：
//
//数据库在信号良好的情况下仍需长时间加载；
//数据库默认版式加载错误；
//信号良好时访问条目时仍加载错误；
//编辑条目时无法保存；
//出现异常页面编辑、回溯，且无法查询到任何新增的编辑记录等。
//若出现上述情况，请及时备份编辑内容并向M.E.G.数据库管理人员上报。
//
//部分幽灵页面的信息：
//
//
//页面名称	显示的创建者	相关信息
//Object 1 -“杏仁水”	[数据缺失]	页面完整，但无任何人员拥有对类似物质的记忆
//Object 11 -“记忆汁”	[数据缺失]	页面略有残缺，且无有关此物品的任何记录
//[数据隐藏]	Dr. Liurd	无此实体目击记录，Dr. Liurd本人同样表示对此一无所知
//Entity 92 - “六臂”	[数据缺失]	文章残缺严重，剩余部分的描述不符合任何已知实体
//Level C-213	liiuibbfgfd	文章几乎完整，但图片遭到模因污染而损坏，创建者表示对此页面毫不知情。
//
//发现
//2022年8月3日，M.E.G.数据库的工作人员在例行检查的过程中发现了一张不明来源的名为“Object 1 - ‘杏仁水’”的幽灵页面（Object C-101-1），此网页文章的写作风格基本符合M.E.G.的档案编写格式。因此，“杏仁水”被认为是一种未曾上报过的新物品。
//
//同年8月5日，该工作人员尝试查看页面的创建者和创建时间，却在某种未知因素的干扰下以失败告终，这种异常引起了档案部的注意。经过细致的检修，排除了因系统故障或模因损坏而无法查看信息的可能。
//
//次日，即8月6日，M.E.G.数据库的工作人员就此事进行了访谈，最终结果令人大跌眼镜——没有一位档案员称此文章为自己撰写，并全部声称并不知道“杏仁水”这种物质的存在。此后的数次对流浪者的采访也只得到了相同的结果。
//
//8月6日 9:00 ，一位档案员找到调查此事的工作人员，称在8月3日晚11:00至次日1:20之间，他是唯一仍然在岗的人员。这段时间内，数据库曾发生一次长约5分钟的停运；5分钟后，数据库恢复运行，他并未察觉到异样，便在完成工作后自行离开。而在这次停运的短短数小时后，幽灵页面被工作人员发现并进行了上报。
//
//由于证据不足，对于幽灵页面的调查一度踌躇不前。直到8月17日，“杏仁水”档案几乎快要被人们遗忘时，又一份幽灵页面在当日的 14:06～14:12 出现了，与8月3日的情形一致，M.E.G.数据库同样出现了长约6分钟的不明原因的停运。工作人员在恢复运行后第一时间检查了数据库，并发现了一张名为“Object 11 - ‘记忆汁’”的幽灵页面（Object C-101-2），同样创建者、创建时间不明，且所有受访者都否认了“记忆汁”的存在。
//
//在两次离奇的停运事件后，8月18日，经过数据库高层的讨论，幽灵页面被正式列入物品行列。
//附录A：“波动”假说
//目前对于幽灵页面的由来，仅凭现有的线索还无从得出结论。随着更多的幽灵页面被发现，M.E.G.对于它们的研究也逐步深入。最终，“测验者”部门的博士们于2022年8月26日提出了“波动”假说。
//
//
//
//
//
//以下内容为研究人员提出的假说，尚未得到证实，仅供参考。
//
//
//
//
//“波动”假说
//
//正如其名，“波动”假说描述的是一种空间维度在事件线上的波动。所谓事件线，就是指在同一初始条件下，因不同事件的发生而分离出来的互相平行的维度。例如，你在回家途中，发现了地上的一块水泥块，那么选择踢走水泥块的你和默默走过的你就位于两条事件线上。事实上，正如同这个例子，任何细微的差异都可以分离出两条不同事件线，哪怕只是一块水泥块，都能衍生出无限条不同的事件线。因此，事件线类似于地球的经线和纬线，数量无限且没有宽度。
//
//“波动”，顾名思义，可以将后室维度想象成一条在事件线上、随时间流动而运动的点，若后室运动时发生振动，导致其偏移至一条与原先不同的事件线上，便称为“波动”。后室的振动通常由两种原因组成：
//
//1.后室本身的不稳定所导致。理论上来说，与之相对的前厅也存在事件线波动，但考虑到前厅的稳定性，这种情况少到几乎可以忽略不计。
//
//2.人类与实体（乃至某些与实体区别模糊的物品）的活动所导致。在假说中，一个空间维度会因为任何的变化而产生振动，大到层级崩溃、陨石坠落、超新星爆炸，小到老鼠爬动、枯叶飘落、空气流通，都会引起空间振动，当然，它们引起的振动的大小便是天壤之别了。因此，人类无时无刻都在导致后室的振动。随着人类数量的不断增长和对后室愈发广泛的开发，我们和部分行为相似的高智能实体成为了导致后室波动最主要的因素。
//
//当“波动”发生后，与现事件线不兼容的事物会被抹除。依然是举一个水泥块的例子，假设在你踢走水泥块后，你所在的空间维度发生了波动，并偏移到了一条“你没有踢走水泥块的事件线”上，那么，“水泥块被踢走”这一事件便因与现事件线不兼容而被抹除3。与此同时，它的衍生事件及再衍生事件也会遭到抹除——假设这块水泥块压死了一只蚂蚁，则蚂蚁死亡这一事实也会被同时抹除，以此类推。
//
//在事实被抹除的同时，知情者与之相关的认知也会被篡改。在这个过程之后，人脑会将现事件线中的事实视作“常态的”或“理所当然的”。再用水泥块举一个例子，“水泥块被踢走”这一事实被抹除后，你观察到那块水泥仍留在原位，却不会感到疑惑，因为在你的认知中，“我刚刚踢走了一块水泥”的记忆遭到了抹除，并遵循现事件线的认知，而保存“我刚刚并没有踢走那块水泥”的记忆。所以，人类在“波动”后，不会察觉到“旧认知”遭到抹除这一事实，“波动”的存在也因此难以得到证实。
//
//在前文中，我们提到，事件线的数量是无限的，两条事件线之间的差距可能非常微不足道。但也正因如此，一个空间维度只要发生极其轻微的振动，就有可能发生“波动”，不过，这种波动的影响也微乎其微。这意味着，在后室乃至前厅中，“波动”随时随地都在发生，但它们大多不足以改写整个庞大的维度。
//
//理论上来说，“波动”发生后，所有对于不兼容事件的认知皆会遭到抹除。但如果考虑到实际因素的影响，这种抹除通常不会是百分百。事件线从不是“非黑即白”的，在两种完全矛盾的世界线之间，有一块“灰色地带”，就好比马、驴和骡子，骡子是马和驴的杂交产物，因此，骡子同时含有马和驴的部分遗传基因，却不属于马和驴中的任何一种生物。
//
//将此例子带入假设，便可以解释幽灵页面的由来了——“杏仁水”，亦或是其他幽灵页面所记载的事物，都曾经确确实实地存在于后室。某种影响深远的因素使得后室维度产生剧烈振动，并导致了“波动”的发生，后室维度进入了“它们存在”与“它们不存在”两条事件线的中间地带——存在的事实和我们每个人与之相关的认知都遭到了抹除，但是，数据库中的有关页面幸免于难4。最终，这些事物消失了，而对这一事实“习以为常”的我们，便只能通过残缺的文字，探访着唯一能证明它们曾经存在过的东西——“幽灵页面”。
//
//附录B：人物评价
//我想，如果“波动”假说真实存在，那将会是一件好事。我读了这些“幽灵页面”，杏仁水给我的印象很深刻，它让我在黑暗中，是的，我看到了一丝光明。虽然我们已经有了太多对付实体的玩意儿了，但杏仁水……它给我的是希望，一种在漫漫长夜中看见微光的希望，一种支持着我不断前行的希望。
//
//好吧，我干嘛为一个可能压根儿不存在的东西说这么多——我不知道。但是，我是说如果，如果“杏仁水”曾经真的为后室带来过光明，我期待它的归来。
//
//——B.K.R. Liurd（摘录自MNN5《“波动”假说》评论区）
package wupin;
public class youlingyemian1101{
}