//Object 27
//尤米的糖是一类仅可在Level 9获取的糖果，其包装上都印有"尤米妈咪"的品牌名。
//
//关于尤米妈咪的描述：
//尤米的糖只能通过在Level 9中敲响任何一扇门获得。在敲门后的8秒，一个名为尤米妈咪的蛇形实体将打开门并与流浪者对峙。
//
//它的出现会诱发其70米范围内所有人陷入极度的歇斯底里，这通常会使受影响者发出尖叫。而一旦有人或任何外部声源发出声音，一道与邻里守望发出的光相同，但范围更大（直径50米）的强光就会出现，将范围内所有人化为灰尘。如果有人能始终保持沉默，该实体则会给予其一些尤米的糖，之后消失。因为实体的黑色色调和诱发恐惧的特性，有人推测尤米妈咪是由纯粹的固态寂静汁液组成的。亦有人进一步推测称，尤米妈咪是一种特殊的尖噬者，但当然，这些说法都未被证实。
//
//除身高恒为2.3米外，尤米妈咪有各种形态，因人而异，差别很大。据流浪者报告，该实体存在一些更为可怖的形态，且据说其提供糖果的稀有程度和数量取决于其形态的可怕程度。尤米似乎对13岁以下的儿童有一种特别的亲和力，因为它在其面前会表现为较温和的形态。有时，当儿童发出声音时，它不会立即处决他们，而只会变得焦躁不安或迅速关门。
//
//儿童绘制的顺从状态下的尤米妈咪。
//尤米的糖及其影响：
//尤米的糖种类繁多。其中大多数都具有一定实用价值，它们非常受欢迎，并可在后室中进行交易；而有些则具有灾难性的影响，应完全避免食用。
//
//红椒金瓜泡芙：
//27_1.jpg
//可用于交易一瓶杏仁水的红椒金瓜泡芙。
//
//是最为常见也可能最受欢迎的甜食。这种甜食外观类似马卡龙，即前厅的一种知名零食，但是更小。金瓜泡芙不会产生负面作用，但据说有一种强烈的令人感到愉悦的味道，几乎使人狂喜。它们以微甜而辛辣的味道而闻名，总保持温热，并且不会变质，可以保持几个月温热新鲜。这种甜食外层松脆可口，夹心甜奶油松软轻盈。还伴有引人注意的秋季香料风味。
//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
//
//杏仁糖珠：
//27_2.jpg
//价值五升寂静汁液的杏仁糖珠。
//
//杏仁糖珠是经高度浓缩的杏仁水小晶体，呈白色。 当轻微加热（40oC）时，它们会急剧膨胀，一颗杏仁糖珠就可以制出至少五升的杏仁水。由于杏仁糖珠非常稀有珍贵，所以只在大型团体中出现，用于更有效的储存等价于几加仑的杏仁水。它们也可嚼食，但有一种令人厌恶的苦味，且效果仅与一杯杏仁水等同或更低，并且会造成资源浪费。
//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
//
//棉花脆糖：
//27_3.jpg
//一块等价于一克火盐的棉花脆糖。
//
//这些浅色棉花糖有许多形状，包括许多动物形以及猫、南瓜和蝙蝠形。它们有极强而令人上瘾的甜味，而绝大多数人一吃就至少会吃下三块。像油腻棉花糖一样，它们是良好的能量来源，可以消除对睡眠或休息的需求，使人可以进行更长时间的体力劳动。不过，只有少量食用才可达到上述效果，一旦食用超过十克就会导致虚弱疲惫，可持续长达三小时。而超过二十克则会导致流浪者陷入永久混乱，使其缓慢变为悲尸。为避免食用过量，建议只在危急情况下使用。
//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
//
//幸运棒：
//27_4.jpg
//多种口味的幸运棒。一块普通口味的幸运棒价值五克火盐。黄色幸运棒则价值十五千克火盐。
//
//幸运棒是长而扁平的条状糖果，似乎是各种口味的硬化幸运豆奶。虽然多数常见口味的幸运棒，如原味、草莓味和巧克力味的效果都不如对应的幸运豆奶，但幸运款幸运棒的效果会更强，也更罕见。幸运款幸运棒有与对应幸运豆奶相同的亮黄色色调和明显的香蕉香味，但一旦撕开其包装，它就会逐渐从固态液化为粘稠的半固体，然后迅速变为蛋挞芯状胶冻。幸运棒越硬，食用者就会越幸运；而一旦幸运棒变得足够柔软可以咀嚼，其效果就会变成招引霉运。食用幸运棒带来的好运通常会是找到有用的物品和资源，甚至可以是从通常难以逃生的实体或危险状况下逃离。另一方面，霉运则会是随机地切入到危险的层级，遇到突然成群出现的敌对实体，以及瓶装杏仁水突然变成腰果水或苦痛汁液等等。所有效果在食用幸运棒后四到五个小时内就会消除，不过已转化的杏仁水将不会复原。
//
//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
//
//知识薄荷糖：
//27_5.jpg 
//大约价值十瓶杏仁水的一碗知识薄荷糖。
//
//作为一种比较常见的 尤米的糖，知识薄荷糖虽然和普通薄荷糖外观一致，但却有一种过于强烈的薄荷味，使人生厌，会残留烧灼般的薄荷余味，通常可持续六到九小时。食用薄荷糖可以使人获得其想要的关于任何技能的知识或专长1，其范围可从非凡医学技术或强大运动能力到仅仅知道最近的出口在哪。一旦薄荷余味散去，所有得到的知识或专长都会被遗忘。之后，食用者会遭受一定的副作用，可能是混乱或疲劳，也可能是丧失随机记忆，甚至是其本来就有的知识。
//
//其他种类：
//以下种类为普通无特别特性，或是记录尚不全面。在获得进一步信息前，请勿食用任何未被数据库收录的尤米的糖。
//
//焦糖火盐：
//一种平常的焦糖甜食；热食烫口，冷却再食。
//显示图片
//
//
//派对棒糖：
//彩虹颜色的棒棒糖，据称可以把人慢慢转化为派对客。这一说法尚未得到确认，不过当前正在严肃调查。
//显示图片
//
//
//这糖真黏牙：
//是这肉真黏牙的变种，为水果味而非肉味。它们更富有活力，一有机会就会扭曲爬走。有时会被撒上糖。
//显示图片
//
//
//皇家果冻：
//其存在从未被确切证实过，但据说它是小软糖样子的皇家口粮.
//显示图片
//
//
//巴别草莓:
//一种可食用的巴别润唇膏，有甜美的草莓味。其效果的持续时间比普通的巴别润唇膏稍长。
//显示图片
//
//
//螺旋藻棒:
//这是一种100%蓝藻造的糖果棒。味道不坏，而且就其大小而言，还难以置信的能让人填饱肚子。
//显示图片
//历史
//尤米的糖是已知最早的物品之一，约在2000年前即被失落一族开始使用，据说是由一位12岁凯尔特裔女孩意外发现的。自那时起，勇敢的流浪者和小团体就经常去Level 9探险，为努力树立地位而寻找尤米的糖。然而直到最近，B.N.T.G.才发现13岁以下的孩子受尤米妈咪的影响较小。自此开始，就有记录显示被恶毒团体派来的儿童新成员大量涌入，他们被当作获取尤米的糖的简易方式，多数时候不受任何监管。到目前为止，有超过57名儿童在Level 9死亡，且并非死于尤米妈咪处决，而是被该层级横行的实体杀害。M.E.G.正不分昼夜的努力保护孩子们免受这些危险群体3的利用，且已在Level 9的所有常规入口附近派驻了警卫，并且限制所有13岁以下的流浪者切入。
//
//作者/授权
//« Object 26 | Object 27 | Object 28 »
//
//Footnotes
//1. 想要获得的技能必须是物理上可实现的，且遵循现实规律。
//2. 译注：此处及下处原文存在大量代码显露（应与文本内容无关），译者在译文中已更改
//3. 主要由B.N.T.G.、The Reverence和The Completionists中的一些成员组成。package wupin;
//
//public class youmidetang27 {
//
//}
package wupin;
public class youmidetang27{
}