//Object 30 - “油腻棉花糖”
//marshmallows
//一位M.E.G.的特工正在炉子里融化油腻棉花糖。
//
//描述：
//油腻棉花糖的形状近似于圆柱体，味道甜美，质地柔软。这种棉花糖在后室的流浪者群体中很受欢迎，因为食用它们可以补充能量，还可以给予流浪者一些特定效果。融化以后的油腻棉花糖的粘稠度类似于巧克力酱或蜂蜜。
//
//这种食物只有融化后才可以食用。如果油腻棉花糖没有被融化，流浪者食用后只会感到疲劳，身体会变得沉重，还会慢慢失去能量。最好用杏仁水融化这种食物，这样会降低被细菌感染的风险，有人猜测这是因为杏仁水中有一种特殊的物质。
//
//用途：
//油腻棉花糖只有被融化后再食用才会产生正面作用，否则只会产生副作用。如果要做需要大量体力的复杂动作，建议保留一些融化后的油腻棉花糖。流浪者在需要逃离实体或者救助其他人的时候更喜欢使用这种食物。
//
//地点：
//油腻棉花糖可以在后室中的任何层级里找到，但是有些层级里有会出现油腻棉花糖的固定区域，能不能找到取决于流浪者所处的层级。最容易找到这种食物的地方是Level -599内的厨房。
//
//副作用
//这种食物很有用，但是当你食用它的时候，你可能会开始出现副作用，比如头痛，胃痛，腹泻。如果你吃的实在太多，你可能会心脏病发作。吃50-90个融化后的油腻棉花糖会让你的皮肤变得很松软，你的身体会变得苍白而且还会散发出甜美的香气。吃100-110个会让你的身体变得很沉重，你会感觉到你的身体很油腻，还会非常难以移动。
//
//Object 30的副作用日志
//开始录制的时间：中午12:17
//
//未知流浪者：“你……你们好？我刚才 *呕吐* ……吃了一袋这个……棉花糖……它们已经被融化了……我……我不确定到底发生了什么……我的皮肤变得……非常……油腻……”
//
//*这名流浪者开始失去氧气*
//
//未知流浪者：“我真的……需要帮助……我不知道发生了什么事情……”
//
//*这名流浪者开始融化*
//
//未知流浪者：“M.E.G……救救我…….如果有人听到这个的话……”
//
//*一位M.E.G.特工进入了那名流浪者所在的层级*
//
//M.E.G.特工：*对通讯员说*“我们需要医疗援助，这里有人过度食用了Object 30。”
//
//M.E.G.特工：“算了，取消任务吧，已经太晚了，我们救不了他了。”
//
//通讯员：“好，我们需要知道那些棉花糖的位置。那个人在哪个层级？”
//
//M.E.G.特工：“在Level 0，他已经完全变成棉花糖了，真令人伤心……”
//
//通讯员：“那我们需要把这个消息转告给总部。”
//
//M.E.G.特工：“等一下-什-什么……” *这名M.E.G.特工注意到还有其他21具正在变成棉花糖的尸体*
//
//M.E.G.特工：“什么玩意-这……”
//
//M.E.G.特工：*对通讯员说的* “紧急情况！我重复，紧急情况！Level 0里至少有21具尸体正在变成棉花糖，我需要帮助才能将他们带出这个区域！”
//
//录制结束：2018年4月6日，13:00
//
//注意事项：
//在食用这种棉花糖之前要先融化。
//不要融化超过30个棉花糖。
//食用完这种棉花糖后，要等待至少40分钟后再吃更多。
//要用杏仁水融化。
//吃的时候要小心，因为香甜的气味可能会引来实体。package wupin;
//
//public class younimianhuatang30 {
//
//}
package wupin;
public class younimianhuatang30{
}