//package wupin;
//
//public class youseyanjing1103 {
//
//}
//Object C-103
//评分: +23+–x
//警告
//经监督者议会商定，从2022年1月起，M.E.G.将中断与后室机器人科技的贸易往来。仍要执意使用后室机器人科技所制造的科技造物的M.E.G.探员将不再享有探险者总署的各项权利和福利。此决议长期有效。
//
//Meglogo
//
//M.E.G. - 为了人类的明天
//有色眼镜是由后室机器人科技开发的高科技设备，其可以影响流浪者的情绪。
//
//xSBToQ.jpg
//“冰封山脉”型有色眼镜。在M.E.G.的Alpha基地中被发现。
//
//描述：
//有色眼镜的外观似乎与前厅中眼镜的外观极其相似。两者区别为前者镜片有色而后者无色，且前者可通过旋转鼻托部位以调节镜片色彩的纯度，向左侧/右侧旋转可分别将色彩纯度升高或降低。该眼镜可能会给流浪者带来部分精神影响（详见下文），且随着颜色纯度的变化而有所增强/减弱。自前厅时2019年起，1有色眼镜就陆续凭空出现在M.E.G.建立的大型基地外围，如Level 1的Alpha基地，且出现地点均为流浪者的视野盲区。在Level 1被色彩浸染的一张纸条中称，Level C-5中也有有色眼镜出现，鉴于流浪者精神状态不佳，此言论并不可信。
//
//有数名流浪者报告称其在单独巡逻时发现了有色眼镜附带的一封信，此信所使用的语言均由流浪者最熟悉的语言写就，信的内容为对眼镜功能的介绍以及免费试用的请求，署名为“后室机器人科技”，这一发现引起了M.E.G.的高度重视。以下是第一张被发现的信，上有介绍“骄阳之耀”眼镜的内容：
//
//您好！若您发现了这封信，请代鄙人对M.E.G.的官员们致以最诚挚的问候！
//如您所见，这是我们倾尽心力制作出来的心血结晶，它小巧玲珑，精致美观！现在，请允许我向您介绍我们所开发出的新品种——“骄阳之耀”眼镜！看这橙黄色的镜片，美妙的颜色，不是吗？它象征着照亮黑暗的智慧之光，令人感到快乐和喜悦！这绝对对您有积极的影响——作为M.E.G.的长期合作伙伴，我想我们值得您的信赖！
//
//言归正传，“骄阳之耀”眼镜与经典的“冰封山脉”眼镜款式相同，您可以通过旋钮来调节镜片颜色的纯度——对，往左边多拧几圈，从而触发你对快乐的更深层次认知！感到抑郁？遭到背叛？朋友离去？戴上眼镜，助你横扫悲伤，做回自己！
//——您最值得信赖的合作伙伴，后室机器人科技™
//
//
//
//性质：
//目前，有色眼镜的所有品种均能够造成一定程度正面或负面的精神影响，以下列举了目前被发现的几种品种及其精神影响：
//
//“冰封山脉”
//“骄阳之耀”
//“记忆之巅”
//“放荡不羁”
//“冰封山脉”是最为常见、精神影响最小的有色眼镜品种，其镜片为蓝色。戴上它后，流浪者将会短暂眩晕，眩晕时间约为5~10秒。待流浪者意识清醒后，一切事物在其眼中均为蓝色，而原本为蓝色的物体的蓝色纯度将会更高。此时，持续注视某一物体30秒将会使流浪者感到极为冷静、专注，通常这可以使整理/编写资料和处理事物有更好的效率，但对实体无效。
//目前M.E.G.正在尝试将此种眼镜分发给档案员用作档案的整理归类，但由于后室机器人科技的可疑性，此提案被暂时搁置。
//
//
//“骄阳之耀”是第二常见、精神影响较大的有色眼镜品种，其镜片为黄色。戴上它后，流浪者将会发现其眼中的一切事物呈现出黄橙色，但原本为黄橙色的物体的纯度并不会有所改变。流浪者戴上眼镜10分钟以后将会不可避免地大笑且无法自制。具戴上此眼镜的流浪者声称，他们感到了“让我最快乐的一幕”，但并无对此类事件的相关记忆。“骄阳之耀”眼镜对防治人型实体有一定功效，如窃皮者钝人等。流浪者只需戴上眼镜注视实体10秒即可让实体陷入“粘滞”状态，此状态下的实体移动速度将会极慢。由于此类眼镜对于流浪者的精神影响较大，M.E.G.暂时并未广泛使用此类眼镜。
//“记忆之巅”是较为稀有、精神影响中等的有色眼镜品种，其镜片为红色。戴上它后，流浪者将会眩晕1~2分钟。待流浪者意识清醒后，将会在短时间内患上“超忆症”2，但眼镜被摘下后此效果将会消失，仅有记忆不会忘却。此类眼镜可利用性较小，M.E.G.并无使用此类眼镜的打算。
//“放荡不羁”是最为稀有、精神影响最大的有色眼镜品种，其镜片为黑色。奇怪的是，其似乎仅在极度偏执的流浪者身旁出现。流浪者将其戴上后将会不可避免地做出过激的、发狂的举动，包括但不限于：
//
//不惜一切代价得到自己想要的事物或人（如皇家口粮或流浪者所追求的对象等）。
//大肆破坏M.E.G.基地中的仪器和设备。这通常导致流浪者被处死。
//由于“放荡不羁”所带来的负面精神影响，M.E.G.已暂停一切对此类眼镜的研究。
//作者信息
//« Object C-102 | Object C-103 | Object C-104 »
//
//脚注
//1. 使用协调后室时授时服务器得知前厅时。
//2. 超忆症是一种极为罕见的医学异象，临床表现为大脑拥有自动记忆系统，且似乎都是在潜意识下发生的，具有超忆症的人没有遗忘的能力，可将任何事情的细节记忆得一清二楚。
package wupin;
public class youseyanjing1103{
}