//package wupin;
//
//public class yuanye1029 {
//
//}
//Object C-29 - “原液”
//评分: +25+–x
//物品编号：C-29
//%E9%BB%84%E6%B3%A5
//被原液涂满的墙壁
//
//简介
//原液是一种泥黄色、粘稠的液体，其最初的来源已经不得而知。原液只会在肮脏、受损严重的层级自然出现。它会以一种特殊的方式对整个层级进行修复。原液出现的频率正在不断增加，疑似其是从Level C-102中流出。
//
//性质
//原液会如同指向树脂一样有目标的进行移动，并且其所处温度越靠近零度，移动速度也会相应地加快。但是与指向树脂不同的是原液会主动向有破损、肮脏、变形的墙壁移动。在接触到墙壁后开始在墙壁上留下用于清理的黄色痕迹（在非清理状态时移动不会留下任何痕迹），这种黄色痕迹已被证实为原液本身；在二至三天后这些附着在墙壁上的痕迹会转变为与Level 0在外观、颜色、花纹均一致的墙纸，但其留下的痕迹在凝固后可能并非变成墙纸而是一种半透明的薄皮并与污渍一同剥落下来。
//
//如果原液足够多，那么它会尝试对破损的墙壁进行修复，接触到墙壁破损处后它会开始逐渐蒸发内部的水分，整个过程约需要四至五天，随后凝固成一种类似于石膏的物质并对墙壁进行修复。这种凝固后的物质会以一种极其缓慢的速度持续分泌原液，其原理目前尚不清楚。
//
//任何瓶子都可将它收集起来，如果收集足够多原液后，可以尝试将这种液体用作修复、清洁建筑物。特殊情况下原液似乎也会对武器进行修复，修复后的武器会变得崭新且更加结实耐用。由此，原液倍受人们青睐。
//
//用途
//将凝固的原液收集起来，在40℃以上的情况下它们的分泌速度会加快1，通过这种途径获得的原液被称为“人造原液”，它们往往会比自然形成的原液有着更快的移动速度、更加清澈的颜色，并且在清理墙壁时不会再使得墙壁变成Level 0的墙纸而是真正意义上的清洁墙壁。
//
//实验证明，将人造原液与其他金属相结合后，混合出的金属会进行细微的自我修复；这种修复如同树木生长中的愈合，可以将划痕或是擦伤修复，但是在面对过于严重的损伤时这种自我修复的功能则会消退，因此混合金属更加适用于制作观赏性或收藏性的物件，而并非用于制作工具、武器等。
//
//原液移动速度
//以下为原液在不同温度下的移动速度：
//-7℃ ： 冻结
//-5℃ ： 2cm/s
//0℃ ： 6.5cm/s
//5℃ ： 6cm/s
//10℃ ： 4.9cm/s
//20℃ ： 3.7cm/s
//35℃ ： 2.5cm/s
//液体的速度与体积无关，且在密闭空间内它们会停止移动。
//
//作者信息
//« Object C-28 | Object C-29 | Object C-30 »
//
//Footnotes
//1. 但依旧很缓慢
package wupin;
public class yuanye1029{
}