//package wupin;
//
//public class yuecenggunyou1190 {
//
//}
//Object C-190 - “跃层滚油”
//评分: +21+–x
//
//物品编号：Object C-190
//跃层滚油是可以迅速切入切出层级的器官，其能够显著增加探索者对层级切入的控制能力，目前种种证据都指明该物品的出现与有识血肉有很大关系，但有识血肉方面拒绝分享此类技术。
//描述
//跃层滚油是一种外观呈梭状的特殊器官，通常生长于大脑脑丘或骨缝下方，但也观察到部分长于脊椎甚至肠道膜外壁上层的特殊案例。跃层滚油脱离人体迅速失活，大多数保持器官体外活性的技术对此物品不适用，因此针对跃层滚油研究难度极高。
//
//处理
//切除跃层滚油会对宿主造成极其严重且不可逆的病理性精神损伤，包括极强烈的幻痛、被害妄想症、孤僻症和广场恐惧症等，成因尚不明确且目前除药物抑制外缺少有效的治疗手段。
//
//因此原则上不对跃层滚油宿主予以切除，但出于对健康考虑宿主应当定期前往附近大型幸存者据点接受脑部检查，以保证跃层滚油没有出现膨胀压迫神经甚至恶化成肿瘤的问题。
//
//以上问题已有相当多的病例，尤其是进入60岁以上的探险者有更高概率发生。一旦发生将极有可能导致严重的后遗症，即使明知道切除跃层滚油会对宿主身体造成一定伤害，如果进入此状态也必须进行切除。
//
//效应
//体内生长有跃层滚油的探索者会称为宿主，宿主有远比普通探索者更强的切入切出适应性，在速切玩家等几个经常切入切出的组织中表现的尤为明显。宿主们往往可以更快掌握一些更高精尖的切入技巧，比如反切或是连切。目前速切玩家记录中有相当一部分的保持者正是跃层滚油的宿主们。
//
//除此之外目前还有一些尚未被证实的效应，比如宿主们更不容易被实体发现或是实体往往会优先攻击非宿主的人类，但是这些效应尚不确定是否属实因此仅为提及，不应当太过信任。
//
//发现记录
//跃层滚油最早纪录来自一名因为严重脑部受伤而不得不进行开颅手术的探索者，由于当时探索者脑部的跃层滚油被误诊为肿瘤，在治疗时也对跃层滚油进行了切除。
//
//这反而导致该探索者陷入严重的精神混乱并且失去了大部分切入切出能力，最终于手术两年后因严重心理疾病抑郁而终，此后数起病例最终让M.E.G.确认这并非是某种病变，而是一个特殊的器官。
//
//原理推测
//不确定跃层滚油的原理，但根据大多数宿主反应来看，跃层滚油最大特点是显著提高探索者对于层级切入的“感知能力”，这使其能够更快并且更精确的进行切入步骤。根据之前针对通心粉肠的研究，可以认为这些探索者更善于想象对应层级的区域，更容易唤起脑中的即视感，从而更容易触发层级穿越效应。
//
//但更加无法解释的是宿主似乎模糊的知晓层级的入口和出口位置和使用方式，甚至包括一些非常偏僻、独特甚至堪称匪夷所思的切入方式，而这些宿主也是档案库中那些极其反直觉的切入方式的主要记录者。对此其解释中，绝大多数人用的语言形容词是“就像突然从脑海里蹦出来”这一类意思的语句。
//
//获取方式
//目前跃层滚油并没有可靠的获取方式，有识血肉以“生产速度缓慢和物资供应不足”为理由拒绝向任何组织出售此物品，但似乎有一小部分探索者植入了此物品。尽管他们拒绝承认自身与有识血肉的关系甚至一部分探索者对有识血肉的存在并不知情，因此该物品具体生成制仍然在探究中。
//
//有识血肉其他大多数作品不同，跃层滚油可以被子代遗传，由于新一代的后室出生孩子们年纪较小，对于脑内急速狂飙的发育状态和病变可能性目前尚不明确，但理论上子代的基因将比其亲代更加稳定，更不可能出现病变症状。
//
//- 关闭
//
//话只在内部说，但兄弟姐妹们都必须正确认识到。
//
//尽管当无机物文明想到活体变化时第一时间就想到我们，这说明广告效应确实树立的很不错，但是实际上你们也很清楚——这个物品和我们一点关系都没有。
//
//我们甚至不知道这东西是怎么运作的，以目前的技术手段无论是自然还是超自然的探测都完全无法揭示这些器官的运作原理，即使我们能做到近乎完美复原这个器官切下之前和切下之后的生理环境，但被切下之后器官还是会瞬间枯萎死去，无论是加入什么样的养分都毫无办法。
//
//更别提对其进行的活体分析，这东西的每一个组件、每一个细胞我们似乎都能理解，但是当他们拼装在一起之后这个器官的行为逻辑便完全不明白。
//
//只能推测有一种完全不同的能量驱使它，一种活体具备能量，这也是为什么从活体上摘除便会立刻死去，但对于如何侦测或利用这种能量却毫无头绪。
//
//不过基因统计学找到跃层滚油出现的可能性，由于经常开展为流浪者进行接生的工作，大多数新生儿的基因模板在这里有过储存。
//
//能够确认相当一部分后室出生人类基因组比起其亲代有完全不同的变化，变化的基因没有在清代任何一方的基因组中找到，就算真突变出此种基因也不可能做到数百个样本，完全不同的亲代所诞生的子代会有高度相似的趋同变异。
//
//那么既然后室能够错误的生成土地、现实法则和微观例子，为什么不能错误的生成基因呢？又或者说这种错误可能根本不是错误，只是超出认知所以我们才将其认为是错误呢？
//
//或许未来能找到更合理的解释但目前这样的可能性最高。正如其他错误生成的物品，这个器官这段基因也是不合理的、非常规的、甚至反逻辑的，但又确实能在后室中正常运作，工代更是有着稳定的多的基因。速切玩家这个无机物文明的组织中就有相当数量的这类成员，这些成员刚刚开始切入不久的层级就能比肩那些经验丰富的老个体。
//
//而我们中也有一些新生的兄弟姐妹出现这样的情况，这是不是代表着我们也正在逐步适应后室或者说后室正在逐步同化我们？从无机物文明的现实切入的个体越来越少，他们与自己的现实联系也越来越薄……而我们的现实受到后室的污染越来越严重。
//
//如果有一天母世界层完全被这份力量同化而无机物文明也彻底断绝与现实的联系，我们会不会已经成为了这片庞大而怪异的世界层的一部分，就如同那些被称为实体的生物一样？
//
//……我需要向母亲申请撤离计划的额外科研力量了。
package wupin;
public class yuecenggunyou1190{
}