//package wupin;
//
//public class yuelunqiqiu1046 {
//
//}
//Object C-46 - “月轮气球”
//评分: 
//+34
//+
//–
//X
//lunar-eclipse-3572336_1280.jpg
//橙黄色的“月轮气球”。
//
//物品编号：C-46
//发现时间：2022/8/16
//主要分布：
//分布在某些露天层级，如Level C-34。一般被发现于建筑物的外侧角落，或是树枝或房檐卡住。
//
//描述
//Object C-46指月轮气球。在地面上发现时，该物品表现为一个正球形的银灰色气球，直径约为300mm。气球一端有开口，系着一股细长的麻绳，长度在13~31米不等。
//
//月轮气球有正反两面，正面颜色较浅，触感温热，背面颜色较深，触感冰冷。如果将月轮气球放置不动，可观察到该物品表面的两面开始旋转，周期约是24小时。
//
//月轮气球的表面似乎仅仅是普通橡胶，内容物是星云。一个月轮气球内含的星云常压下一共有120L，这使得它成为星云的一个可行来源。
//
//若月轮气球被抛向空中，它将会在浮力的作用下，持续上升。最好先将麻绳系起或握紧，再上抛气球。气球升起到一定高度后，将会逐渐发光。发光时，可以清晰地看见与前厅月球相同的环形山与月海等图案。
//
//只要在露天层级且没有遮挡与雾气，即使在白天，气球发出的光也会被周围几千米的人所见。实体却不会对于这个气球有任何反应。
//
//一般没有先行涂色的月轮气球，发光的颜色是与前厅观测月亮相同的月白。如果月轮气球被先行涂上了任何颜色，发光的颜色就会转变成那种颜色。左上的图例就是被涂上了橙色颜料的月轮气球。不知为何，月轮气球上的颜料极其容易被冲洗掉。
//
//用途
//月轮气球首先可以被流浪者作为标志物使用。若流浪者身处危险之中，可以抛出一个红色的月亮气球。若其他情况需要呼救，可以抛出一个橙色的气球。目前，以气球光色来表现信息的章程正在与其它组织商讨中。
//其次，它同时是星云燃料的良好来源。
//最后，M.E.G.在2022年9月10日夜间，将Level C-305与Level C-271的基地顶上悬挂了一个月白色的月轮气球。
//从其他组织在Level C-271的效仿来看，这种标示自己组织基地的方法，已经受到了其他组织的接受。
//现在起，流浪者只要在Level C-305与Level C-271等层级看见本不存在的明亮满月，就可以跟随它找到一个友好组织的据点。一般来说，据点的大门就在这轮月亮的正下方。
//9月10日晚，M.E.G.组织与其它组织均在少数层级发出了如下广播：
//
//流浪者们，请注意。如果你正处于以下层级：Level C-305，Level C-271，Level C-34。
//
//请您注意观测天空。
//
//在天空中您能够看见一些大小不一的，白色的“满月”。如果您靠近这些“满月”，您会发现，这些满月，就是低低地悬浮在空中。
//
//那月亮下面就是有人类生活的友好基地。
//
//接下来，请记住：
//
//如果您迷失了方向，请跟着一轮气球般漂浮的白色月光走。
//
//……
//
//如果您在任何地方丧失了希望，请您仰望天空，并且想象那上面是无数轮气球般漂浮的白色月轮。
//
//- ......或是已成故乡的他乡。
//图源：》https://pixabay.com/zh/photos/lunar-eclipse-moon-blood-moon-3572336/
package wupin;
public class yuelunqiqiu1046{
}