//Object 74 - “迁跃浆果”
//2022物品竞赛 » Object 74 - “迁跃浆果”
//
//
//与object 74最初的发现有关的电子邮件
//
//backmailbar.png
//16th October 2021 17:34
//奥德汉·麦克塞恩 <amacseain@majorexplorergroup.com>
//to <mandb@majorexplorergroup.com>
//
//你好，
//数据库管理，我是奥德汉探员，此次发现将由我来记录:这是一个非同小可的事件，我发现了一个新东西——没错，闻所未闻见所未见。它看起来就像是一盒浆果，盒子倒是很普通，不过…盒子里的东西就像草莓，不论是从看上去还是尝起来；最重要的是，浆果的食用者全都“失踪”了，他们都被传送到他们第一次发现这些浆果的地方——以上为我的笔录
//
//补:此篇文章是我在Level4写的，目前刚通过一扇门离开了Level 2。稍作休整后，我准备去往beta基地。
//
//~ 奥德汉·麦克塞恩
//M. E.G. beta基地
//
//附录
//
//unknown.png
//单击预览
//16th October 2021 17:42
//M.E.G .页面审查 <mandb@majorexplorergroup.com>
//to <amacseain@majorexplorergroup.com>
//
//你好，
//
//这是一封误时的回信，我们为此深感歉意—但我们必须检查有关这些物品的所有记录，以确定这是一件未收录的物品，而这一切自然需要一定的时间才能够完成，而且…这并非儿戏。
//
//所以…你的页面引起了所有人的谋趣，读起来让我们有些人心惶惶。我们甚至从来没有听说过有关这些物品的传闻。如同你所说的:“闻所未闻，见所未见。”这些物品在为我们带来便利的同时可能有未知的风险存在，这也是我们即兴奋又担心的原因。
//
//哈哈…放轻松，显而易见，这在我们看来仍是些未经证实的消息，你可以先来alpha基地一趟吗？
//
//~ 莎拉·麦克马斯特
//M.E. G. Alpha基地
//
//16th October 2021 17:51
//奥德汉·麦克塞恩 <amacseain@majorexplorergroup.com>
//to <mandb@majorexplorergroup.com>
//
//没问题，我稍后便到。谢谢你对这封邮件的快速回复，同时感谢你对这次发现的重视！目前盒子里还剩五个浆果——是的，我吃掉了两个…我想你不会介意的，食用这些浆果也是迫不得已，我需要一些简易的研究以编辑我的那个附件…你知道的，不然谁会知道这些浆果可以传送。
//
//原谅我的草率，因为这并不太妙，我嗅到了一股危险的气息，我想那是附近的笑魇们——嗯，我不能再写下去了。
//
//~ 奥德汉
//M.E.G. beta基地
//
//三个小时后，奥德汉抵达了M.E.G .Alpha基地
//
//object 74的初次发现访谈，来自Level10中新临时基地的莎拉·麦克马斯特的录音。
//
//以下内容均为调查object 74所用: 此录音为最初发现object 74所录
//
//你们好，我是莎拉·麦克马斯特，以下录音部分将由我负责——在我们收录了一份他称之为“迁跃莓果箱”的未记录物品草稿后，奥德汉被要求接受采访，以用于我们调查这个物品并展开后续的研究。
//
//被采访者:奥德汉·麦克塞恩
//记者:莎拉·麦克马斯特
//
//<录音开始>
//莎拉·麦克马塞尔：好的，奥德汉——我已经开始录音了，你准备好了吗？
//
//奥德汉·麦克塞恩：如果你准备好了，那么我就准备好了。我是说…可以随时开始。
//
//莎拉·麦克马斯特：鉴于此物品影响的特殊性，以下所有问题请如实回答。
//
//莎拉·麦克马斯特：你是如何发现这个物品的？在什么地点？什么情况？
//
//奥德汉·麦克塞恩：呃…我想这并不复杂，这些浆果是我在不经意间发现的，当时我正在Level2探索，哈哈…只是简单地走来走去而已，在我无意时便发现了这个装浆果的小盒子。
//
//奥德汉·麦克塞恩从身后拿出盒子
//
//莎拉·麦克马斯特：仅此而已？这未免有些敷衍。
//
//奥德汉·麦克塞恩:是的，听起来的确有些离谱，但这是事实。呃…重要的是：这些浆果看起来没有任何腐烂的迹象，它们仿佛永远不会变质！这个我在电子邮件中也有提到，没错…它们美味极了。
//
//莎拉·麦克马斯特:有趣。它们可以保存很长时间…这对于浆果的研究来说万分重要，不错！但现在看来，我们需要观察这些浆果一段时间。
//
//莎拉·麦克马斯特:那是多久以前的事了？
//
//奥德汉·麦克塞恩:没有很久，我应该早点让你知道，但是目前来看，浆果不会变质…你知道的。
//
//莎拉·麦克马斯特:好的，我已了解，那么让我们探讨这个最重要的问题——在你的草稿中，你说这些浆果可以传送食用者，对吗？
//
//奥德汉·麦克塞恩:没错，不论我在哪里、什么地方、什么时候吃下这种果实，它们都会把我传送到我最初吃下它们的位置。
//
//莎拉·麦克马斯特:所以，除非你已经在Level2了，否则吃这些东西会把你带回那里？
//
//奥德汉·麦克塞恩:是的，我记得在我吃下浆果后，仅仅一个瞬间我便切出了地面。这种感觉就像——你吃了它，然后被一股无形的力往下拉，很奇妙的感觉。
//
//莎拉·麦克马斯特: …等等
//
//奥德汉·麦克塞恩:怎么了？
//
//莎拉·麦克马斯特:那些浆果上面有种子！
//
//奥德汉·麦克塞恩:是吗？然后呢。
//
//莎拉·麦克马斯特:嗯，如果可以的话，我们需要保存一些，以便我们的研究。
//
//奥德汉·麦克塞恩:好的..？
//
//莎拉·麦克马斯特:好的，感谢你所花费的时间。
//
//<录音结束>
//
//一天后，奥德汉回到了欧米伽基地
//
//
//与object 74最初发现有关的电子邮件。
//
//backmailbar.png
//Jan 1, 1970 00:00
//Alpha基地人员 <sarahmcm@majorexplorergroup.com>
//to <teamoverseer@majorexplorergroup.com>
//你好，监督者。
//有一个新的物品被发现了，而且似乎相当重要……我是说，很有用。最近的研究和记录解答了我们的谋趣所在，现在看来，这些担忧是多余的。
//
//这看起来的确是一盒普通的浆果，平平无奇。但是令我们惊喜的是，它可以把你传送到你发现它们的地方。没错，这是它很重要的原因之一。并且我们已经在Alpha基地确认它们的效果属实，这些浆果可能在以后会具有比食用更好的用途。
//
//尽管这几天的实验表明object 74没有任何的不良反应，但我们仍然会控制食用量，以免发生意外。哈哈…这个发现真的很重要，并且很成功。除此之外，我们现在称它们为“迁跃浆果”，一个滑稽的名字。
//
//还有一个发现，你还记得这些浆果上有种子吗？没错，一个令人激动的消息：这些浆果真的可以种植！所以我们应该尝试种植它们。毕竟，你知道的，这东西谁也不知道还剩下多少。
//
//因此，我们请求在Level10清理出一小块土地，并决定种植一些浆果。这个项目一旦成功，所带来的益处是毋庸置疑的。
//
//~ 莎拉·麦克马斯特
//M.E. G. Alpha基地
//
//Jan 1, 1970 00:00
//监督者团队 <teamoverseer@majorexplorergroup.com>
//to <sarahmcm@majorexplorergroup.com>
//
//好的，感谢你们的付出！经过一番讨论，我们一致同意派一个小组到Level10去研究这些浆果。如果得到结果，我们将很乐意探究它们的其他用途，收到请回复。
//
//~ M.E.G.监督者团队
//
//Jan 1, 1970 00:00
//奥德汉·麦克塞恩 <amacseain@majorexplorergroup.com>
//to <pagereview@majorexplorergroup.com>
//
//再次向您问好，监督者。经过大约五周多的时间，我们的研究终于有了结果，相信您会想看看这些重要结果的，请参见随附的研究视频摘要。
//
//附录
//
//unknown.png
//单击播放
//~ 詹姆斯探员
//Alpha基地
//
//Jan 1, 1970 00:00
//监督者团队 <teamoverseer@majorexplorergroup.com>
//to <basealpha@majorexplorergroup.com>
//
//我们对这些结果非常满意，非常感谢你们的付出。目前我们已经开始与B.N.T.G .进行交易，以便他们将浆果分发给流浪者。现在我和B.N.T.G .会确保大多流浪者可以从中受益。当然，数据库当中需要有一篇与之对应的文章。请继续努力。
//
//~ 监督者- B
//M.E.G.监督者团队
//
//版权 {日期丢失}
//后室机器人科技对因使用本服务而导致的任何异常损害不承担任何责任。
//
//不久之后，B.N.T.G .开始在互联网后台的网站上投放广告。
//点击广告进入商店页面。package wupin;
//
//public class yueqianjiangguo74 {
//
//}
package wupin;
public class yueqianjiangguo74{
}