//package wupin;
//
//public @interface yujingdanzhu1021 {
//
//}
//Object C-21 - “预警弹珠”
//评分: 
//+15
//+
//–
//X
//统合物品分类系统
//物品编号 #：C-21
//位置：全境
//安全性：中性
//用途：
//预警
//状态：
//易获得
//预警弹珠为一种可以用于警示危险实体的接近的玻璃制品。
//
//ccff95ba303fb8c9d2a5e6569c85593d7ebb1f14
//一些典型的预警弹珠的图片
//
//描述
//预警弹珠通常表现为一颗颜色随机（如淡红，淡绿，深蓝，浅黄以及透明色）的玻璃弹珠，内部拥有一条同色系颜色的玻璃构成的飘带，半径约为6mm，有时会达到1cm，但效果不变。
//
//预警弹珠质地较硬，不易破碎，不可溶解，软化点为1700℃，略高于普通弹珠，软化后效果减弱，减弱程度视温度高低而定。
//
//用途
//报警
//预警弹珠会在附近存在敌意实体时发出震动。振动频率依距离敌意实体的距离而定，与具体危险性无关。此特性被用于报警装置。
//
//具体关系如下：
//
//距离（m）	100	80	60	40	30	20	10	5	1
//频率（HZ）	35	57	79	105	211	397	687	1007	5324
//吸引注意
//可以将预警弹珠放在玻璃/金属容器中并丢到远处吸引实体的注意力以帮助自己脱身。
//
//使用
//一般有经验的探险者都会把预警弹珠中间穿孔（此举被证明对弹珠的效果没有影响），穿上线后绑在手腕上，有条件的还可以在上面覆盖一层隔音材料。注意：请不要把预警弹珠直接放在玻璃杯或保温杯中，曾经有流浪者这么做后被实体发现。我们花了3个星期才将遗体找全。
//
//辨别
//由于预警弹珠外表与普通弹珠类似，因此较难辨别。最直接的方法是靠近敌意实体观察其是否震动。最佳方法是靠近幼年无面灵100m。由于此方法太过冒险，不建议使用。一名流浪者发现当预警弹珠完全浸没在杏仁水中时，会以约50HZ的频率震动。此方法随后大量普及。
//
//经检测，预警弹珠震动的原因并非杏仁水具有威胁性，而是其治愈精神损伤的特殊能力引起了预警弹珠的误判。
//特殊情况
//在面对一些非常规实体时，预警弹珠会表现出不同的状态。
//
//死兆
//流浪者手腕上的预警弹珠一直以10HZ低频振动
//在这个状态持续约120分钟后，震频突然飙升至6000HZ以上
//几秒钟后，死兆出现在流浪者面前，预警弹珠炸裂
//人格刺客
//在流浪者看到人格刺客后，预警弹珠正常工作
//流浪者人格被篡改，预警弹珠停止震动，并不再对此个人格刺客起作用
//抛锚客
//流浪者遇到抛锚客后，预警弹珠未发生震动
//抛锚客提出求救，预警弹珠立刻以约3500HZ震动，流浪者逃离
//更多超规格实体的遭遇记录正在寻找中。
//
//发现
//由流浪者于Level C-20发现其本身及其作用。
package wupin;
public class yujingdanzhu1021{
}