//package wupin;
//
//public class zhenchifeiji1191 {
//
//}
//Object C-191 - “振翅肥肌”
//评分: +8+–x
//
//物品编号：Object C-191
//振翅肥肌为有识血肉技工氏族制造的一种用于辅助工具使用的小型器官，主要附着在刀刃、钻孔机或一部分技师氏族的手臂上用于使附着肢体开始快速震荡以完成一些工业需求。
//描述
//振翅肥肌是一类经过特殊改造的异步肌，与部分鞘翅科昆虫相似。由于肌肉收缩机械频率远大于运动神经元发出冲动的频率，此肌肉中的神经并不用于传导电信号而是仅仅用于维持电势差处于一个稳定水平，而肌肉在感受到持续稳定的电势差后便会保持输出。
//
//这能让肌肉以惊人的速度跳动，尽管因为体型无法做到在原本昆虫上此类结构每分钟300~500次的扇动翅膀。但在最高频率下输出也能达到200次震动每分钟，而少部分以牺牲持续性换来瞬间爆发性的军用版本频率可以达到更快的600次震动每分钟。
//
//相比起民间版本军用版本的肌肉组织会附带一部分保护液使得植入者的手臂处于液体中保证不会因为过大压力而断裂，同时液体也能加强散热和共振输出。但是这会导致使用者的装载部位看上去明显浮肿，对于大多数探索者来说难以接受此类审美。
//
//在装载了振翅肥肌之后，探索者将无法再穿着紧身衣物或是使用绷带等物品缠绕手臂1，否则极有可能导致在启动时血液供应不足，严重时会导致手臂坏死。同时这样的构造也大大的探索者的能量消耗，在此状态下的探索者，每日消耗可能是3~5份杏仁水而军用版本则更多，这要求装载此装备的探索者外出时携带更多食物。
//
//使用
//与大多数有识血肉的作品一样，振翅肥肌必须接入使用者的身体才能发挥作用。接入方式目前有外附着形肌肉和直接植入型肌肉两种，通常来说外附着型肌肉是为了针对那些不希望对自己身体进行太多变化的探索者，结合性较差但可以取出；直接植入型则必须替换掉一部分肌肉，结合性最强但无法进行替换。军用型仅接受植入型肌肉，因为军用型需要一系列改造，已经不可能满足替换型的要求。
//
//当振翅肥肌植入身体后使用者会明显感觉到自己身上多出额外器官，其操作手感近似于握紧拳头或是抬起手臂并保持肌肉紧绷状态一段时间。随后使用者将会出现一种类似于痉挛的感受但没有疼痛感，此时肢体便会开始以预定频率和预定幅度震动。
//
//发现记录
//尽管伟大母亲坚称该物品主要使用目的是用于辅助工程机械制作，但实际上根据内部资料该物品最早开发出来是为了在与无机物文明进行社交活动时占据上风。
//
//其开发过程是一名技师氏族在与M.E.G.军团朋友饮酒划拳时应提出失败者要被弹脑崩，技师氏族多次失败被弹后心怀不满，遂动用私人关系与多名学者交流提出此构想，并由学者试图进行努力最终造出原型。
//
//配合手部力量增强，可以保证在正常力道正面命中时让被弹脑瓜的人陷入轻度脑震荡，后来大多数M.E.G.军团喝酒的时候游戏就改成了吹牛或者小姐牌2。
//
//——就结果来看，可能稍微过于成功了一点。
//
//目前用途
//尽管大多数时候是技师氏族在使用这类装备，但是实际上最出名的使用者是伟大母亲在后室厨师联盟培养的众多野外厨师，这些致力于在荒野或是非聚集地区域也能为探索者制作美食的厨师们能够依靠振翅肥肌徒手发泡奶油。
//
//作者信息
//« Object C-190 | Object C-191 | Object C-192 »
//
//Footnotes
//1. 确实需要包扎时则不可使用振翅肥肌
//2. 两种源自前厅的酒局游戏
package wupin;
public class zhenchifeiji1191{
}