//Object 365 - “知茶”
//秉持“K.I.S.S”（简略易懂）原则，“探险者总署”将知茶列为Object 365，该物品由Entity 365的研碎残骸制成，且只能在Level 365中找到。
//
//盲知是什么？
//尽管盲知是Level 365发现的实体，但它们却不居住于此。它们来自超脱于镜中世界的领域，后室对它们而言具有毒性。这些知者短暂地进入我们的世界，以蚕食人类的灵魂。
//
//e4cee17e8183069b.png
//盲知的素描像
//M.E.G. 档案
//
//作为一个科学家，我简直不敢相信我写下的这些记录。但我知道这一切都是真的，因为我曾被列于它们的菜单之上。
//
//盲知形似于缓慢飞行的水母，优雅而静谧地在半空漂浮，辐射蓝与绿的爆炸光。它们呈半透明状，光盘般的躯体直径约8厘米。盲知习性残忍无情，且能够无视物理攻击的伤害，虽然它们有水生生物的外形，但却对液体有极强烈的厌恶。
//
//根据安妮·邓恩所说：“如果猎物被幸运女神所眷顾……当盲知失去了足够多的能量，衰弱到无法再返回镜中世界，那么它便会枯萎死亡，它袖珍的尸体将变得浑浊且硬脆。”
//
//约翰·莱因哈特教授 博士学位
//
//知茶是什么？
//知茶并非一种万应灵丹，它更倾向于一种膳食补剂或“维生素饮料”，由研碎的死去盲知溶解在沸水化开制作而成。这种饮料辅以杏仁水将效用更佳。
//
//尽管该效应依然属于传闻性质，但已有可靠的报告显示，饮用这种补剂将丰富饮用者的身体、精神，甚至“超自然”力。目前已确认饮用一次饮品便能暂时性加强这些能力，而对其定期进行摄入则能够累计永久性的增幅。
//
//安妮·邓恩
//M.E.G. “窥镜”团队
//
//备好盲知
//收集作以食用的盲知是件耗时的工作，你大部分时间都得守株待兔。
//
//盲知在死后不久会进行一种有机的蜕变，将它的尸体化作泡沫与凝胶。在这时，要谨慎地记录它的位置，并且切勿贸然打断。
//4686b010629c08b6.jpg
//盲知的生物残骸
//M.E.G. 档案
//
//盲知的尸体将最终凝固并变为奶白色，当它完全变硬且能被顺滑地从当前位置取下时，你便可以把它储存在一个干燥的容器当中。请小心，盲知是很脆的。
//切记： 不要（任何情况下都一样）试图清洗盲知的任何一部分，这会导致一个不可逆转与停止的负面进程开始启动。（遇水的盲知残骸必须被丢弃。）你可以用干燥的刷子掸去盲知标本上的疏松异物。
//802d02ebc15cb447.jpg
//研钵和研杵
//用来将死去的盲知磨成粉末
//M.E.G. 档案
//
//最后一步是把盲知研磨成精细的粉末，这是通过小心地将盲知标本打碎成小片实现的（你可以在这时清除杂质与污垢）。随后你要用研钵和研杵进一步捣碎碎片，接着将粉末储存在干净且干燥的容器中即可。
//我个人知茶的配方
//以8盎司（或一杯）作为液体的标准分量
//
//f0a8fa6b2df0b5cb.jpg
//小匙（1/16茶匙）
//M.E.G. 档案
//
//每次饮用时切勿混合1/8茶匙或者说两“撮”以上的盲知粉末。一撮指的是食指和大拇指能捻起的量，也就是1/16茶匙。
//
//永远记得要将盲知粉用沸水溶化，这是为了杀菌。
//
//我会先往里面加4盎司的开水，把盲知粉倒进里面用力搅拌，然后再加入4盎司冷水。这是为确保我能一口气把它喝完，免受“活口”的反胃口感。
//
//(“活口”是一种无害的触感错觉，就像口中充满了“活生生的夜行虫和蠕动的小鱼仔。”这种感觉将一路伴随你将它吞咽下肚的整个过程。)
//
//安妮·邓恩
//M.E.G. “窥镜”团队
//
//简史
//这一切开始于M.E.G.新兵J·J·乔丹与克里斯·麦肯纳发现了一个掩藏在Level 1的檀木箱子，箱内有一面被厚重的黄铜装裱的台镜、与之配套的黄铜发梳、研钵和研杵、装满白色粉末的玻璃药罐、小木勺，与一卷没有文字的图画指南。乔丹与麦肯纳在检查箱子里的台镜时进行了切入，并借此发现了Level 365与盲知的存在。
//
//为给在该层级迷失的流浪者提供安适与保护，探险者总署成立了“窥镜”团队。该团队为流浪者定量分配水与粮食，他们同样提供情报和地图。
//
//经安妮·邓恩确定，“檀木遗产”为一个未知人士创造的工具包，用来前往和在Level 365存活，收集死去的盲知。
//
//饮用这种名为“知茶”的饮品能让整个“窥镜”团队免受精神攻击和消极能量的影响，我们的身体与精神健康也因此得到了明显的改善，这令我十分满意。
//
//托马斯·奥利弗·格里尔
//M.E.G. “窥镜”团队
//
//致：未知收件人
//自：约翰·莱茵哈特教授，博士学位 <jrhinehart@consultant.com>
//标题：Object 365的摄入
//
//作为探险者总署的顾问与参议员，我向您提交这份有关摄入Object 365所带来健康益处的初步数据。目前记录中还没有任何有害的影响被上报。以下是志愿者测试对象报告频率最高的十个优点：
//
//附加的耐力与活力
//更快的反应和协调速度
//焦虑与压力减少
//注意力与集中力提高
//记忆力变好，更加善于回忆
//运气变好，或者说“好的巧合”
//直觉增强
//免受精神攻击的伤害
//自发开启的天眼
//预知梦与幻觉
//测试对象身体和精神能力（1-5）的显著提高皆可以通过研究随时观测与证实，这是最基本的。但涉及到通灵（6-10）性质的增幅时，对效用的分析便进入了一个晦涩的领域。这些结果戏剧性且零星残缺，想要通过科学印证显得机会渺茫。
//
//主观来说，我个人可不愿意去喝知茶，那种名叫“活口”的现象简直跟“嘴里塞满了活蛆”一样。
//
//原谅我草率的语言。
//
//（叹气）
//约翰·莱茵哈特教授，博士学位
//
//- 隐藏犯罪活动备忘录
//备忘录
//
//近期，M.E.G.对Object 365，亦称“知茶”的兴趣引起了Level 365以至整个后室的犯罪活动萌生。这些犯罪行为具体包括在黑市提供危险的盲知产品；绑架、杀害无辜的流浪者，将他们作为诱饵引诱Entity 365出现对他们进行收割。
//
//M.E.G.“窥镜”团队已干预了其中的一启犯罪行动，解救了一名男性人质并扣押了两名罪犯，第三名罪犯在逃脱追捕的过程中进入了恐惧蜈蚣。
//
//托马斯·奥利弗·格里尔
//M.E.G. “窥镜”团队package wupin;
//
//public class zhicha365 {
//
//}
package wupin;
public class zhicha365{
}