//Object 98
//物品类型：电子设备
//
//重要程度：优先实施保护
//
//保管措施：由获授权人员保管
//
//未经授权查看本文件，将本文件分享给外部或更改本文件者将被开除 M.E.G.。
//
//如果继续阅读则说明你已接受了潜在的处罚风险。
//
//
//
//
//
//
//外观
//Object 98 为一蓝色 USB，其上写有“P.P.S.”的字样；虽然字迹的油墨已明显陈年风化，但其仍保有粘稠的质地。该物品会散发出质朴的麝香气味，其中伴有淡淡的蜂蜜、酸橙气味。
//
//虽然从外观上看，该物品不具备伤害性，但在它接触到人的皮肤时，会使皮肤被划破或戳破，留下较浅的创伤；因此，建议拿取此物时佩戴手套或用其他物品包裹皮肤。古怪的是，该现象仅会作用于人类，不会伤害到其他任何生物。如果使用该物品接入的设备并非笔记本电脑，其上的文字就会变为“B.Y.E.”，物品也会失去原有的功能。这种现象的成因尚不明确。
//
//ppd
//Object 98 的一张照片，拍摄于其被发现后不久。尚不能鉴定出其上字迹的来源为何人，相关调查仍在进行。
//
//使用方法
//将 Object 98 接入笔记本电脑后，会有一个叫做“OsPo.exe”的程序开始运行。该程序可以自动生成诗歌，只要按下程序启动后显示的“确定”提示键，这一功能就会被激活。在使用者同意后，该程序就会随机选择一个种类的诗歌并开始创作。
//
//一般来说，程序生成的诗歌都是语无伦次的。但在少数情况下，会有可理解的诗歌出现，该物品的异常属性也会在此时起效。据信，这时 Obeject 98 所生成文字的最后一部分会包含对未来两到三天内将要发生的事情的预测。面对悬而未决的情况时，有必要留意这些文字的最后一行——通常这就是对未来的预言。
//
//该物品生成诗歌的能力每隔 2 到 4 小时可使用一次，如果在程序准备好前就尝试使其生成诗歌会导致程序停止运行并显示“别来了”。而如果试图将程序生成的文件拷贝入笔记本电脑，会引发波及直径约为三米的爆炸。奇怪的是，Object 98 不会受到爆炸产生的伤害，但其连接的笔记本电脑则会被摧毁。
//
//预测记录
//Object 98 对未来的成功预测记录如下。以下的每首诗都预测了其被生成后 2 到 3 天内会发生的事件。目前，已记录了五次成功预测，但我们仍在尽可能生成更多的诗作以寻求其他有用的信息。
//
//“挽歌”题材的诗作是五次预测中最先被记录的，诗的末尾提到了某个不知名人士的骨头会被压碎。在诗歌生成两天后，最初发现该物品的 Evelyn Parker 死在了她驻留的前哨，而且她全身的骨头都如诗歌中的描述一般被压碎了。
//
//
//
//“浪漫诗”是被记录的第二首诗歌。诗的末尾写到“但你的触摸已让我永远空洞”。在这首诗被生成三天后，Object 98 最早被发现的地点附近出现了一颗被斩下的头颅。头颅来历不明，而且是中空的。截至目前，被斩首的死者身份仍旧不明。
//
//
//
//“打油诗”在上一首诗生成后五个月出现。在上一首诗生成后不久，一名相关人员被安排尽可能多地尝试生成诗歌。“打油诗”中写到“我要在你的脸上留下伤痕”，而在诗歌生成两天后，保管 Object 98 的人员头部出现了几处撕裂伤。由于伤情发现得较晚，对该人员的抢救未能成功。此次事件后，我们决定日后优先处理有关该物品的文档。
//
//
//
//下面的一首诗称作韵诗，因为该诗的每一句都压韵。此诗的最后一行为“但别担心，我不会让你在高处失足”。这首诗对应事件的发生时间未知。在推测诗歌已经生成后的几日，一名相关人员前去保有 Object 98 的哨站内查看，发现其中的五十七名人员都被刺穿了脊椎，身体被挂在钢钉上，距地面约两米高。由于此事件的发生，现已将 Object 98 隔离储存，此后的诗歌生成由其自动完成。
//
//
//
//最后一首记录中的诗歌是“无韵诗”，唯一一首不押韵的诗。此诗的最后一句为“将我的感受散布给世界”。此诗生成后三天，Object 98 的监督者失踪了。之后的两个月，在多个层级内发现了数枚尸块，经鉴定，这些尸块均属于该监督者。
//
//
//
//
//
//Oswald……？啊啊，我知道这个人。他是我们时代很伟大的发明家，做出了很多难懂的装置。很难相信他一个人就能做到这种事，不过说不定也有帮手。不管怎么说，他的发明救了数不清的人。他的每件发明上都写了“Oswald”，不过我们对他本人了解很少。救了大家的也许并不能完全算他的发明本身，更多是大家心里对 Oswald 总有办法的信念吧。
//
//——摘自对监督者 A，Stretch 的一次访谈
//
//package wupin;
//
//public class zhinaxiekongdongderen98 {
//
//}
package wupin;
public class zhinaxiekongdongderen98{
}