//package wupin;
//
//public class zhixiangshuzhi1004 {
//
//}
//Object C-4 - “指向树脂”
//评分: +33+–x
//
//物品编号：C-4
//指向树脂是一种稀薄，蓝色的液体。后室中的任何一棵树中都可能含有指向树脂，但这种概率极低，通常一千棵树中只有一棵含有，且指向树脂的分泌过程极其缓慢。因此指向树脂是一种稀有的物资。
//描述：
//指向树脂的性质很特殊，它总是有着逃离当前层级的运动趋势，这种趋势带来的能量会在指向树脂碰到水时被激发，如果本层有可以直接进入的出口，它会以一定速度向着出口的方向移动。正常液态情况下的指向树脂运动速度大概在3m/s左右。指向树脂的运动速度会随着密度增大，压缩到固态的指向树脂1速度甚至能超越子弹。但指向树脂在被激活后碰到空气会迅速蒸发。
//
//用途：
//寻路
//
//指向树脂最常见的用途是在层级中寻找出口。有经验的流浪者会将1mL左右的指向树脂装在一个掏空的木球中，然后将木球放入水瓶携带在身上，在需要时摇晃一下其便会大致指向出口的方向，这样可以使用半个月左右。
//
//武器
//
//高浓度的指向树脂在必要时刻可以作为武器使用，它通常作为暗杀武器出现在餐桌上。在追击试图离开当前层级的目标时它也能发挥大用。
//
//工业
//
//由于该物品的特殊性质，经常有人建议将其作为能量来源制作发电站。但将指向树脂用于工业发展的提案均被驳回。原因是关于该物品的研究仍处于起步阶段，如使用不当其带来的后果将是毁灭性的。
//
//发现记录：
//指向树脂最初在C层群的[数据缺失]层级被发现，当时一名路过的流浪者在一棵老树2的树皮上发现了一小团粘稠的指向树脂。出于好奇，这名流浪者将树脂放到嘴里试图当口香糖嚼，后来搜救人员在距离他三十米的地方找到了他的下颚。这棵树后来成为了第一个官方的指向树脂采集点。
//
//作者信息
//« Object C-3 | Object C-4 | Object C-5 »
//
//Footnotes
//1. 1L的液态树脂仅能压缩成1cm2大小的固态树脂。
//2. 该树的树龄推测在500年左右
package wupin;
public class zhixiangshuzhi1004{
}