//package wupin;
//
//public class zhiyushuijing1009 {
//
//}
//Object C-8 - “治愈水晶”
//评分: +24+–x
//
//物品编号：C-8
//治愈水晶为一种可用于治疗伤口和作为兴奋剂、止痛剂的晶体。
//
//photo-1521133573892-e44906baee46?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1887&q=80
//一张治愈水晶的图片
//
//描述
//治愈水晶通常为粉红色的不规则晶体，质地较脆，用手就可以将其碾成碎屑。
//
//治愈水晶可以溶解在水或杏仁水中，但不溶于腰果水。
//
//用途
//辨别
//流浪者可以根据治愈水晶的溶解性来辨别杏仁水和腰果水。
//
//治疗
//流浪者可以通过将治愈水晶溶解在水或杏仁水中制成治愈药剂。
//
//治愈药剂为粉红色的粘稠油状物质，不易挥发，闻起来有一股类似桃花气味的淡淡甜香。
//
//该药剂有两种使用方法，分别为：
//
//外敷
//可以将治愈药剂涂抹在伤处。涂抹后，流浪者会变得疲倦，然后在五分钟内进入睡眠，睡眠时间决定于伤势的严重程度，最长不会超过两个小时。在睡眠期间，伤势会逐渐恢复。
//
//目前已知可以治愈的伤口以及治疗程度：
//
//利器划伤（为开放性伤口）：恢复至结痂
//烧伤（为深II度烧伤，烧伤面积约为8%）：恢复至形成瘢痕
//冻伤（为三级冻伤）：恢复至形成瘢痕，但仍有痛感
//由于其使用后会进入睡眠，故建议流浪者在确认周边环境绝对安全后再使用该药剂。
//
//内服
//在流浪者喝下治愈药剂的半个小时内，流浪者的智商和反应速度都会得到明显的提升，而且流浪者身上的疼痛会暂时缓解。在药效消失后，流浪者将会变得四肢无力，反应迟钝。若摄入量过多，有直接死亡的风险。所以建议不要一次性饮用过多治愈药剂。
//
//注：直接食用治愈水晶也会产生类似的效果。
//
//获取
//治愈水晶可以在无限医院中协助医生进行手术，或制服有心理疾病的病人后，在医生处作为谢礼而获取，有时也可以在病房的床头柜中找到。
package wupin;
public class zhiyushuijing1009{
}