//package wupin;
//
//public class zhonglihuangyou1182 {
//
//}
//Object C-182 - “重力黄油”
//评分: +47+–x
//物品编号：C-182
//
//位置：各大B.C.A.俱乐部
//
//butter
//一块重力黄油。不要忘记轻拿轻放！
//
//描述
//重力黄油是一款由B.C.A.（后室厨师联盟）生产的动物脂肪类产品，外观与普通黄油基本无异。
//
//重力黄油可直接食用，也可作为烹饪或烘焙的原料，主要成分为油脂，营养价值略高于使用牛奶制成的黄油。后室厨师联盟称，重力黄油的原料来自于团体内部饲养的特殊牛种。
//
//重力黄油质轻而软，可以使用纸张轻易地进行切割。重力黄油会于33摄氏度逐渐出现融化迹象，低于人类正常体温，放入口中即化，口感佳，但比普通黄油更容易腐坏——在高于38摄氏度的环境下，重力黄油会在12小时内迅速腐败并消散，此过程不会产生任何残余，但其将留下浓厚的烘焙面点的气味，而非一般黄油散发的酸腐奶油味，同时向空气中释放微弱热量，原因不明。
//
//异常性质
//当液态重力黄油被涂抹于物体表面时，该物体将被归类为“Object C-182-1”个体。无论处于怎样的条件下，正在进行自由落体运动的Object C-182-1在坠地时必定会以涂有重力黄油的一面着地，此过程的进行将可能无视任何已知的物理规则。推测重力黄油会给物体的对应面施加足够大的质量，确保其能以此面触地。具体详见下列实验报告。
//
//- 收起
//实验报告 I
//实验地点：Level 1
//实验记录：实验人员将两块一面涂有重力黄油的切片面包举至距地面约1米高处。其中一块（切片一）黄油面朝下，另一块（切片二）反之。
//
//实验结果：切片一在旋转半周后落地，黄油面朝下；切片二垂直落地，黄油面朝下。实验人员数次重复该实验，结果亦然。
//
//结论：Object C-182-1的着地面不受自由落体前的正反所影响。
//
//- 收起
//实验报告 II
//实验地点：Level 4
//实验记录：实验人员将一张A4印刷纸的边缘均匀涂抹重力黄油，举至距地面约1米处并松手。
//
//实验结果：纸张用该边着地并以近乎不可能的方式直立于地面。
//
//结论：Object C-182-1的着地面不受其面积所影响。
//
//- 收起
//实验报告 III
//实验地点：Level 11
//实验记录：实验人员将一块一面涂有重力黄油的橡胶皮1（胶皮一）举至距地面仅1厘米处，涂黄油面朝上，松手；同时，由另一名实验人员执行，将一块完全相同的橡胶皮（胶皮二）从距地面约210米处的楼顶扔下。
//
//实验结果：胶皮一旋转半周后以黄油面落地，在此过程中橡胶皮被观察到以某种方式无视了地面的碰撞体积，直至成功完成半周翻转；胶皮二旋转六周半，同时以每秒十余米的速度撞击地面并炸裂，但结果同上。
//
//结论：Object C-182-1的着地面不受原先高度所影响。
//
//- 收起
//实验报告 IV
//实验地点：Level 1
//实验记录：实验人员将一块橡胶皮的两面皆涂抹上重力黄油，举至距地面1米处松手。
//
//实验结果：橡胶皮持续下坠，最终悬浮在距地面数厘米处并以肉眼难以分辨的高速持续旋转，据推测其速度达到了每秒旋转数百圈并可以轻易地击伤任何尝试触碰该橡胶皮的人。由于M.E.G.难以停止该个体的旋转，该实验对象已被销毁。
//
//附加实验 I
//实验地点：Level C-28
//实验记录：实验人员固定一根不锈钢辊轴的两端，在其表面两侧涂抹重力黄油。
//
//实验结果：辊轴在缺乏下坠空间的情况下，跳过坠落的步骤直接开始高速旋转，速度与实验报告 IV的实验对象基本相同，同时产生了数目可观的机械能。由于金属辊轴表面光滑，覆盖于表面的重力黄油于26秒后被甩出，辊轴失去其异常性质。
//
//- 收起
//实验报告 V
//实验地点：蓝色通道
//实验记录：实验人员在Level C-██层级上方的外壁表面涂抹重力黄油。
//
//实验结果： 【已编辑】
//
//butter_2
//错误操作以重力黄油为原料的食品的结果
//
//重力黄油奶香醇厚，口感柔和而细腻，微甜，易于使用且拥有明显优于普通黄油的口感，得到了B.C.A.与其他烘焙爱好者的青睐。以重力黄油作为食材的面点将保留其原先的异常性质，直到其被食用完毕。因此，在烘焙及享用时应当额外加以注意，谨慎操作盛有重力黄油及相关食物的容器，防止食物浪费。
//
//获取
//你可以在各B.C.A.俱乐部的货架上找到重力黄油及以其为原料制作的面点与料理。通过支付10瓶杏仁水或半磅火盐可以向俱乐部成员换取一块约重500g的重力黄油。
//
//附录
//M.E.G.内部针对重力黄油的相关提案
//测验部 研究员 Dolka 的提案
//罗经点 探员 Gary 的提案
//后勤部 厨师 Frank 的提案
//内容：兴建以重力黄油为潜在能源的发电站，摒弃原始的火力发电，将重力黄油涂抹在涡杆两侧，利用其异常性质带动涡轮持续进行高速旋转，以达到近乎无限的电力供应，或能彻底解决后室中能源问题。
//情况：否决
//
//Overseer-A：反对。目前对于该课题的研究处于理论阶段，仍有很多问题值得重视，诸如：
//
//如何保证重力黄油不从载体上滑落；
//如何保证重力黄油不会因机器运作产生的高温而腐坏；
//选用哪种导体作为输电线路的原料可以承受如此巨大的电流；
//投入运行后，发电站的维修工作如何进行？
//Overseer-B：反对。附议Stretch，在这些技术难题充分得到解决之前，贸然行动会带来未知的风险，并非上策。
//
//Overseer-C：弃权。
//
//内容：重力黄油所具备的异常性质拥有相当广阔的应用前景，M.E.G.应当尽可能尝试取得B.C.A.所谓的“特殊牛种”并实现独立的重力黄油产业链。
//情况：否决
//
//Overseer-A：弃权
//
//Overseer-B：反对，M.E.G.与B.C.A.目前保持友好状态，B.C.A.明确将牛种保密，M.E.G.也缺乏不惜与B.C.A.发生冲突来获得该物种的动机。
//
//Overseer-C：弃权
//
//（备注：该提案实为由监督者-C单独负责审批，由Frank提交，由监督者-A与监督者-B作为附议人。）
//
//内容：将重力黄油及相关面点加入M.E.G.的早餐与茶点，以改善伙食，振奋成员们的热情。
//情况：通过已在部分M.E.G.前哨与基地执行
//
//Overseer-A：同意。我真的不想每天早餐都吃全麦面包配杏仁水了。
//
//Overseer-B：同意。B.C.A.做的咖啡黄油曲奇好吃得令人惊艳。
//
//Overseer-C：同意。你们上次去吃的时候为什么不带上我？
//
//一份来自B.C.A.的烘焙指南
//咖啡黄油曲奇
//由蛋糕大师=D倾情推荐的超棒饼干配方！咖啡与杏仁的香味交织，加上曲奇的香甜口感，无论是一个人在家享用精心准备的早餐，还是在午后咖啡厅静谧的角落捧书细读，这款甜点都将为您的生活增添别样的风味。
//
//配料
//重力黄油	62g
//糖粉	50g
//蛋白	22g
//低筋面粉	80g
//杏仁粉	35g
//来自Level C-offee的速溶咖啡粉	1小包
//使用绒麦粉净化的开水	1/2小勺 （2.5ml）
//来自Level C-372的龙坠香精	数滴
//制作过程
//重力黄油切小块软化以后，加入糖粉打发至体积膨松，颜色稍变浅。
//分1～2次加入蛋白，继续打发，使重力黄油和蛋白完全融合。打发至混合物顺滑、细腻、膨松即可。
//把咖啡粉用1/2小勺开水溶解后，倒入打发好的重力黄油中，使用滴管滴入几滴龙坠香精。
//继续搅拌，成为均匀的咖啡黄油糊。
//低筋面粉与杏仁粉混合过筛，筛入打好的咖啡黄油面糊中，将面粉和黄油糊搅拌均匀。请确保面糊干湿适度，可以轻易从裱花嘴中挤出。
//使用裱花嘴在烤盘上挤出曲奇花纹，烤箱预热到约190摄氏度，烘烤10分钟即可。
//« Object C-181 | Object C-182 | Object C-183 »
//
//Footnotes
//1. 为避免食物浪费，更深入的实验皆将吐司面包替换为橡胶皮。
package wupin;
public class zhonglihuangyou1182{
}