//Object C-77 - “蛛卵”
//评分: +20+–x
//物品编号：C-77
//
//位置：M.E.G.资源管理部
//
//photo-1607690424560-35d967d6ad7c?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=987&q=80
//“蛛卵”。由M.E.G.资源管理部所摄。
//
//描述：
//蛛卵回收自于Level C-98展开的一场实体交涉行动；此物品由M.E.G.探员林篁向Entity C-8“莱特妮丝”取得。
//
//“蛛卵”虽名为蛛卵，其外表和大小却与普通鸡蛋一致，不过“蛋壳”部分的硬度相比起真正的鸡蛋而言较为柔软，且无法被摔碎。该物品由其回收者林篁根据回收对象以及用途而命名。
//
//用途：
//蛛卵的特殊作用由林篁直接向莱特妮丝请教得来。使用方法与功效概括如下：
//
//首先需将蛛卵放入锅中，与任意液体一同熬煮。无论后者是何种液体，都将在至多25分钟后被蛛卵转化为一种特殊的乳白色浆体，编名为“蛛液”。蛛液可在低温环境下保存，并能经定向处理后凝结为一种性质与蜘蛛丝媲美的优质材料。蜘蛛丝的韧性与强度本就胜于大量同等粗细情况下的其他材质；而加工蛛液后所制造出的该种材料之性质甚至优于真正的蜘蛛丝。
//
//目前，蛛液已被运用至M.E.G.的工程应用、机关设计等多种领域，所有的调取与应用工作全部交由资源管理部负责。
//
//正在开发蛛液的更多用途。
package wupin;

public class zhuluan1077 {

}
