//Object 19 - “滋水枪”
//hgqlIfV4n5RLTea.jpg
//滋水枪最常见的外观。
//
//滋水枪是一种特殊的水枪，根据所含液体的不同，可以当作工具或武器。储罐可以用来储存液体，便于运输。
//
//描述:
//滋水枪有普通水枪的外观，用储罐带固定在储罐上。储罐可以装满任何液体，当装满多种不同的液体时，它们不会混合，而是根据密度分层；不建议这样做，因为它们在之后不容易分开。滋水枪及其储罐似乎对所含液体的性质免疫。
//
//性质:
//滋水枪可以用来喷射任何液体。每种液体都有不同的效果：
//
//当装满正常的水时，它不会表现出任何异常效果。
//当装满杏仁水时，它可能会对较弱的实体造成中等程度的伤害，但如果滋水枪指向人类，它甚至不会开火。只有一个例外，使用者可以将杏仁水放进自己的嘴里，以快速提神。这可以使滋水枪成为储存大量杏仁水的良好解决方案。
//腰果水从滋水枪中射出后，似乎会暂时变得更有效。由于能够在射程范围内射出水，它可能会被用来让实体远离你。
//Smiler Fluid可用于对付笑魇。在滋水枪中使用它可以使液体更安全，更容易对付笑魇。
//Pyroil，是火盐的液体形式，在水枪中用作武器非常有用。发射时，它会在与目标接触时点燃。在滋水管内也不会硬化。
//也可以使用液态痛苦。除了普通的效果外，滋水枪和它的储罐在充满它时不会被腐蚀，即使在长时间之后也是如此。
//记忆汁从技术上讲可以使用，但从滋水枪发射时没有任何特殊功能。
//寂静汁液不应该被用作滋水枪的弹药，这只是一种浪费。然而，储罐可用于安全储存液体。
//发现地点:
//滋水枪主要存在于类似拱廊的层级中，但也可以在其他层级中找到。最好的地方是：
//
//Level 31的拱廊中。
//Level 33的一些商店里。
//Level 40的“储藏室”中。
//package wupin;
//
//public class zishuiqiang19 {
//
//}
package wupin;
public class zishuiqiang19{
}