//package wupin;
//
//public class ziyaoshi1020 {
//
//}
//Object C-20 - “紫钥石”
//评分: +19+–x
//物品编号：C-20
//
//保存位置：M.E.G.仓库
//
//分类：物品 – 特级
//
//紫钥石是后室中的一种罕见水晶矿。
//
//stone-3190526_640.jpg
//一块未被激活的紫钥石。
//
//描述：
//紫钥石的外观通常为通体紫色的晶体。在相同体积的情况下，该物品的质量和密度都与前厅中的普通水晶大致相同。紫钥石在黑暗的环境下会散发出淡淡的紫光。该物品具有十分良好的导电性和导热性，并且能够很好地吸收电能和热量。
//
//用途：
//当紫钥石连续吸收了0.006kw.h左右的电能或22000J左右的热量后，就会冒出紫色的烟雾并爆发明亮的紫光；此时的紫钥石即被激活。紫钥石在被激活之后，在该物品所在层级的100㎡左右范围之内将会开启一个层级出口。以下是激活紫钥石时的相关事项：
//
//“激活”并非凭空产生出口，而是打开一个距离紫钥石最近的，曾经关闭了的出口
//一个关闭的层级出口只能被紫钥石强行开启一次，此后该出口将永远消失
//出口会通向它原本所通向的位置，不会发生改变
//出口的持续时间与大小都极其不稳定，随时都有关闭的可能
//任何人员若持有激活状态下的紫钥石，则其在进行概率不定的层级出入时，都会使成功概率大大增高
//如果一次开启出口的时间过长，紫钥石将大概率裂为碎块并变成灰色，失去作用
//注意：若短时间内对紫钥石注入激活所需10倍的电能或热能，将会导致强烈的空间扭曲现象
//获取：
//紫钥石似乎只会出现在类似于Level C-20、Level 181等存在矿物的洞穴型层级中，但概率极低。目前并无可以快速高效地获取紫钥石之方式。
//
//附录：
//以下为安妮·文森特博士与派对博士对紫钥石展开的实验之记录：
//
//- 关闭记录
//实验1：
//实验项目：击碎或切割紫钥石
//实验结果：紫钥石被击碎/割开，所有碎片在有规律地闪烁了2-3分钟后变为灰色。
//实验2：
//实验项目：破坏一块已经被激活的紫钥石
//实验结果：紫钥石受损后，整块晶体开始剧烈闪烁。派对博士迅速将其丢出实验室外；该物品在空中发生小规模爆炸。
//哦，那应该会很痛=[
//
//实验3：
//实验项目：让一块完整的紫钥石被蓝色瓶中闪电直接击中
//实验结果：被击中的紫钥石开始剧烈抖动，诡异刺眼的紫光笼罩了整个实验室。地板和天花板开始渗出类似石油的液体，整个房间也开始剧烈震动；此时派对博士试图打开房间的门但失败了。极短的时间后，房间开始自墙壁开始慢慢陷入无法被照亮的黑暗。在派对博士和安妮·文森特博士即将被黑暗吞没时，恐惧怪兽忽然从黑暗中冲出并抓起紫钥石消失不见；房间恢复正常。
//备注：安妮·文森特事后表示：“放心，那个大家伙没事。”
package wupin;
public class ziyaoshi1020{
}