//Level C-361
//评分: 
//+12
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//photo-1662237393050-1de97c4b0506?ixlib=rb-1.2.1&dl=fabian-jones-A9MYLjjoyws-unsplash.jpg&q=80&fmt=jpg&crop=entropy&cs=tinysrgb
//正在Level C-361中滑滑板的流浪者，然而在拍摄后的下一秒他就摔倒在了地上。
//
//Level C-361是后室C层群的第361层。
//
//描述
//Level C-361表现为一处巨大的名为“超级无敌暴龙金刚爆炸暗黑”的滑板公园，其大致位于北美洲的某处海岸旁，流浪者可以远处看到远处金黄色的沙滩；滑板公园的四周则是停着部分车辆的停车区。整个滑板公园的占地面积只能被大致测量，约为130500平方英尺。该层内的时间永远停在了中午时分，且有着极强的Wi-Fi信号。
//
//此层以其丰富的滑板训练场地与极容易使流浪者受伤的特性而出名。因此，流浪者经常可以在该层级内发现许多其他正在练习滑板的其他流浪者。
//
//除此之外，滑板公园一共分为两个部分，一为新手区，二为专家区，它们都拥有着宽广的场地。目前此层级的专家区已被用作与速切玩家协会的比赛场地，详情请见下文。
//
//以下将逐个展开描述。
//
//新手区
//新手区是Level C-361中最为旷阔的区域，其分为两部分：室内滑板区与室外滑板区。室外滑板区里配置了大量难度较低的滑板场地以供流浪者来进行练习，开放下沉式水泥设计，周围的墙面也毫无浪费的做成弧面。基础的台子，杆子，抛台都配备齐全。其场地大部分为"碗槽"，一般来深1米到3米，最深可达5米。
//
//photo-1563692712050-3e68350add0d?ixlib=rb-1.2.1&dl=nadine-shaabana-3YYiDD_4Xg4-unsplash.jpg&q=80&fmt=jpg&crop=entropy&cs=tinysrgb
//新手区中正在滑板的流浪者。
//
//该区域中具有一种特性：流浪者不会因训练时意外跌下滑板而受伤。滑板Expert团队的成员也常常出现在这里为流浪者进行滑板指导，但会向流浪者索要2瓶杏仁水的培训费用。
//
//流浪者也可以前去室内滑板区进行训练。室内滑板区位于一座双层滑板场馆内，有着比室外更为基础的滑板场地，建议初学者首先来到这里进行练习。除此之外，场馆内部还配置有轮滑护具店与各种小吃店铺，并免费供应流浪者们大量的运动饮料，流浪者可以选择在此处进行休息。
//
//目前新手区户外的场地包括：
//
//初级连接碗池 难度：⭐⭐
//狗骨池（不建议初学者尝试）难度：⭐⭐⭐
//"胶囊黑洞" 难度：⭐⭐
//"阿姆斯特朗火焰回旋池" 难度：⭐⭐⭐
//"极点洞" 难度：⭐
//三层连接楼梯 难度：⭐⭐
//火山口 难度：⭐⭐⭐
//人字脊 （目前已关闭）难度：⭐⭐
//专家区
//photo-1496885950879-f0bb5768d2a6?ixlib=rb-1.2.1&dl=robson-hatsukami-morgan-SnGxdsmgexU-unsplash.jpg&q=80&fmt=jpg&crop=entropy&cs=tinysrgb
//专家区内的照片。为了避免受伤，有很多的流浪者选择在旁边观看。
//
//专家区为该层内另外的一个部分，占地约为38000平方英尺。该区域内有着超高难度的滑板场地，诸如坡道、丘陵、堤岸、水滴和边缘等，它们都完全由花岗岩材料建造，表面非常光滑。其中最深的碗槽和管道甚至达到了30米深。
//
//在该区域内有着与新手不同的特性：流浪者在此受到的伤害会加剧。这也表明，即使只是从滑板上失足坠落，都有可能导致流浪者头破血流。因此建议非专家滑板手以外的流浪者不要轻易进入此区域，但由于这两个区域都没有特别的标识区分，使得许多新手流浪者误入此地并重伤离开。
//
//值得一提的是，流浪者将很容易在此处切出至别的层级。借助此特性，该区域已成为速切玩家协会新的比赛场地。
//
//目前专家区的场地包括：
//
//"死亡旋转" 难度：⭐⭐⭐⭐⭐⭐⭐⭐
//"凝视深渊"（目前已关闭）难度：⭐⭐⭐⭐⭐⭐⭐⭐⭐⭐
//盟多碗池 难度：⭐⭐⭐⭐⭐⭐
//大黑U池 难度：⭐⭐⭐⭐⭐⭐⭐⭐
//十杯池 难度：⭐⭐⭐⭐
//米奇池 难度：⭐⭐⭐⭐⭐
//基地、前哨与社区
//SkateBoard Boi
//由一群热爱滑板的初学者组成，团队人数约为10人。
//开放交易，可以帮助流浪者修复滑板。
//目前已有超过10人曾在该团队内因为不专业的指导而受重伤。
//滑板Expert
//由约30名经验丰富的专业滑板手组成。
//提供滑板购买渠道，价格在1至90瓶杏仁水不等，也可以用其他物品交换。
//提供专业滑板教学。
//时常举办滑板竞赛。
//入口与出口
//入口
//可以从Level 12意外切入来到这里，尽管二者并无任何联系。
//从Level 119中切入一个用混泥土铸成的管道即可传送于此。
//通过触摸Level 116内小吃店上贴着的写着“超级无敌暴龙金刚爆炸暗黑滑板公园”的海报来到这里。
//同时，流浪者也可以通过切入在任意一个有关城市的层级内部找到的写着“超级无敌暴龙金刚爆炸暗黑滑板公园”的海报来到该层级。
//出口
//切入任意一处的涂鸦，你可以来到Level C-448。
//目前可以在专家区中意外切入到Level C-14，Level C-43，Level C-46，Level C-150等。
//在室内滑板区进入一家名为"Maura的餐厅"的餐厅，就可以来到Level C-124。
//流浪者可以从滑板公园的出口出去并来到Level 167.
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1361{}