//Level C-357
//评分: 
//+12
//+
//–
//X
// 
//
//生存难度：
// 
// 
//存在未知实体GICHPnD8MgvleNs.jpg
//Level C-357中一条暗色森林中的道路。
//
//Level C-357是后室C层群的第357层。
//
//描述
// Level C-357是由一片未知大小的松树林所组成的一个层级。该层级没有昼夜交换系统，始终处于早晨状态，但光照强度会因为地区的不同而发生改变。该层级并没有降水，但有数条从未知发源地流出的河流使得该层级始终处于潮湿的状态。该层级并没有任何的人类与动物活动的迹象。同时，树林分为两片区域，亮色树林与暗色树林。
//
//亮色森林
// 亮色森林的亮度偏向早晨时稀疏的树林，颜色更加的亮丽光明，树间也会时不时的有阳光照射进来。路径较为平坦，可以很顺利的通行。路边的石头上，苔藓较为稀少，石头较为粗糙。路径通常每隔1000m会出现一个十字路口，通常除了一处写了“暗色森林”标识外，其他的标识均为“？？？”。尚不清楚前往“？？？”会发生什么，因此M.E.G.不建议流浪者尝试走“？？？”的路径。走“暗色森林”的路径将会使流浪者到达暗色森林区域。尝试原路返回的行为，会因为该层级的特性而导致迷路。通常森林中会有些许洞穴，但大部分洞穴仅有1千米深。
//
//暗色森林：
// 暗色森林的亮度偏向阴天的茂密树林，颜色更加暗淡阴森，树间能照进来的阳光十分稀少，树的颜色更加暗淡。树木上通常会有部分脱落的树皮，并且树旁会有些许有毒的颜色鲜艳的蘑菇，有些树木甚至能以一种十分诡异的方式缠绕在一起。路径十分泥泞且曲折，想要通行十分困难。路边石头上有大量的苔藓，并且石头特别的湿滑。河水相比亮色森林而言十分浑浊，流速更加的快。在暗色森林的区域里，路牌大多是残缺或者完全折断的，极少部分是完整的路牌。路牌上大多数写着“I want to see you"，极少数的路牌上写着”亮光森林“。若流浪者走”I want to see you“，流浪者将会在行走数公里后遇见死路并且只能原路返回，但和亮色森林一样，原路返回将会使你迷失，所以M.E.G.推荐所有流浪者走”亮色森林“以回到亮色森林。在该区域，有数个洞穴，洞穴内部因为昏暗且因为本身的特性，所以调查程度不高。但是据目前的探索，矿洞内有大量的铁矿以及某种未知的植物矿石。因为暗色森林的特性，所有任何试图闯入洞穴的行为都是被明令禁止的。
//
//特性：
// 若流浪者在任何区域与任何时间试图原路返回，将会导致流浪者完全迷失方向并到一个未知的区域。即使这不会产生过大的危害，但是通常传送后的区域距离原路返回的地点有上千米的距离。
// 任何尝试在暗色森林触摸墙壁或者岩石的行为都是十分危险的，因为触摸墙壁将有极大的可能会导致身体的部分切出，并且无法再切出。当身体一部分切出时，请毫不犹豫的砍下那部分身体并立即离开洞穴。
//
//实体：
//一个黑暗的影子似乎会在暗色森林的开阔区域等待着某个人的到来，当流浪者或探测机器靠近它时，它就会消失。在M.E.G.军人向它提出交涉申请后，它在一个雨夜里留下了一张纸条1。其文字内容由各种报刊杂志剪切拼凑粘贴而成。
//基地、前哨与社区：
//M.E.G.（探险者总署）“三百米”前哨站
//位于亮色森林距离暗色森林约300米的位置。
//无人值守，有需要时会派遣人员暂住。
//有一些尚可使用的通讯设施。
//入口与出口：
//入口
//在Level C-9当中，走向一条有时会出现的小岔路，即可来到本层级。
//从Level C-97某些低矮的灌木丛中切入，可能到达本层级。
//出口
//进入暗色森林的一个洞穴当中，然后从岩壁切出，即可到达Level C-50。但鉴于暗色森林的特性，请流浪者非必要勿使用此办法离开。
//更多信息
//« Level C-356 | Level C-357 | Level C-358 »
//
//Footnotes
//1. I alWayS Wait him BuT he NEVER back again.Why he ForgEt ME?
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1357{}