//Level C-320
//评分: 
//+28
//+
//–
//X
// 
//
//生存难度：
//等级 阿赖耶识
//
//五蕴假合
//我执生灭
//六道无明
//Level C-320是后室C层群的第320层。
//
//描述
//Level C-320主体表现为一悬空的灰烬厚层，上下皆有天穹，四周边界不明。灰烬由檀香燃烧而成，推测积压厚度超3×10⁸m。Level C-320中的檀香灰烬物理性质特殊，具体表现为：
//
//任何深度下压强均约为1个标准大气压。
//具有类似流体的流动性。
//愈靠近上天穹，灰烬温度愈高。
//Level C-320下天穹为墨黑色，类似夜空，承托于沙漠下方。大量纤细的银色丝线状物质卷曲附着于其上，勾勒出缓慢流转的漩涡纹样。在本层级中，流浪者的重力感始终指向下天穹。
//
//流浪者切入Level C-320时，一切随身物品及衣物立即消失。流浪者将以仰躺的姿态裸身出现于灰烬荒漠下表面，俯视下天穹。十秒内，檀香灰烬迅速吞没流浪者。上升开始。
//
//灰烬层内部没有光线。上升过程中，香灰将不间断地摩擦皮肤并造成疼痛。不慎吸入香灰将诱发强烈的生理反应，包括咳嗽，呕吐和窒息。这将带来极大痛苦，建议通过持续屏气避免。上升过程中，流浪者无法摄入氧气、水和食物，但这并不会导致死亡。皮肤大面积擦伤或自残行为同样不会对流浪者造成任何生命威胁。他们将始终保持存活直到上升完毕。
//根据曾切入Level C-320的流浪者叙述，上升过程在主观上长达数百年。
//
//+ 附录 流浪者柯寿的口述
//推测当流浪者心理活动趋于平静时，缓慢上升将结束。此时流浪者的身体开始自发燃烧，并迅速跃升至脱离灰烬进入层级上半侧。燃烧致伤及流浪者于灰烬层中所受损害都会在升离灰烬瞬间复原。另外，Level C-320的上天穹与下天穹不同，银丝不再出现，取而代之的是一轮银白色圆环。
//
//流浪者随后将遭遇生神，并由祂护送离开Level C-320。
//
//Level C-320 中体感时间与后室标准时换算比例约为 ：650∽11
//
//基地、前哨与社区
//该层级不存在任何已知的的基地、前哨与社区。
//
//入口与出口
//入口
//在Level C-32、Level C-630内自杀。
//于Level C-305中遭遇车祸而死。
//在Level C-110找到一本《地藏菩萨本愿经》并朗读全文。流浪者将立即自书堆切入Level C-320。
//出口
//保持内心平静。结束上升后，生神将遣送流浪者至Level C-160。
//
//
//
//……
//
//
//诸法有我，诸行无常。
//
//
//
//
//香檀已尽，功德圆满。
//
//
//
//
//
//moon
//上天穹。
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1320{}