//Level C-388
//评分: 
//+16
//+
//–
//X
// 
//
//生存难度：
//神秘
//未知安全
//未知实体数C388-1.jpg
//Level C-388的一盏强光路灯。
//
//Level C-388是后室C层群的第388层。
//
//描述
//Level C-388似乎是一座在强烈的黑暗笼罩之下的岛屿，其具体面积未知。Level C-388的植物表现为寒带性状，但该层级内的平均气温却常年维持在37℃，干燥闷热的气候使得人们几乎无法在没有降温措施的前提条件下建议任何开放性基地。由于该层级内部没有昼夜循环，因此探索人员只能通过协调后室时授时服务器获取精确时间。相比于其他呈现出黑暗的层级来说，Level C-388允许流浪者使用照明设备来看清道路，但光的强度会缩减至正常层级的三分之一甚至更小，一般照明手电筒已基本失去其正常作用，但M.E.G.已在该岛屿上布置了数个强光路灯，用以指引流浪者前往Level C-388内设立的流浪者之家前哨站。
// 
// 
// 
//Level C-388内有时会出现一些集群的微光向导，跟随它们的引导，流浪者能安全的到达一处古朴的老式洋房门口，这座建筑占地约500平方米，且常年保持照明。当流浪者需要进入时，只需要轻叩大门，几分钟后便有一名乌鸦状的商人前来开门，之后，流浪者可以选择与其交易，或者离开此处。目前为止，只有一名探险队员被邀请进入房屋且未再次返回，M.E.G.人事部门已判定此人死亡。
//
//C388-2.jpg
//鸦人之家。
//
// 
// 
// 
//此后，流浪者以该建筑物为起点，沿着正东方向行走大约800米后，会到达Level C-388的其中一个边缘，看到白色海滩和由靛蓝色的海水组成的大海。这种海水对人无害，但依然不可饮用。由于没有潮汐力的影响，海面只在风的作用下缓缓飘荡，并不会出现高于0.4米以上的海浪。趟着海水下潜至深处，将会看到一些不明实体在海底游动，暂时无法判断这些实体是否对人类造成威胁。因此，M.E.G.建议流浪者留在岛屿上，万不可擅自下水。
// 
// 
// 
//
//基地、前哨与社区
//M.E.G. “光点-流浪者之家” 前哨站
//位于所有强光路灯的终点处。
//常驻3人，均为退役的M.E.G.罗经点队员；流动人员约10人左右。
//为流浪者提供基本生活物资，且开放贸易。
//入口与出口
//入口
//第一次进入Level C-388的流浪者，是通过在Level C-418中F3层里突然出现的一个黑暗的隔间内部切出而到达本层级的。
//进入Level C-481中的一处黑色的，看起来像是“丛林神庙”的建筑物内，即可到达本层级。
//有时，被海水淹没的流浪者若之前与鸦商进行过交易，则会在濒死状态下被传送至本层级。
//出口
//目前探明的出口仅此一个：尝试从一处生长排列正好为六芒星顶点的六颗松树的中心点切出，即可到达Level C-71的树林区。
//附录——与鸦商的谈话
//采访记录
//
//[记录开始]
//
//（探险队员叩响了鸦人之家的门，过了几分钟，一名鸦商出门迎接了他）
//
//鸦商：先生你好，请问有什么需要交易的吗？
//
//探险队员：你好，请问你就是……我不太好用我们的命名称呼你。
//
//鸦商：没关系，你知道我是谁就行。
//
//探险队员：那好，我想在你这里交易到与你问话的机会。
//
//鸦商：可以，不过既然只是问话的话，我就象征性的收你10个珲吧。不过你只可以问我3个问题，我会尽可能的告诉你。
//
//探险队员：行。我的第一个问题是：这个层级是怎么被你们发现并定居的？
//
//鸦商：迁徙，我随着我的家族在世界里飘荡，而家族随着世界里的“晨风”飘荡，经历过种种困难之后，一部分族人和我一起选择定居在了这里。
//
//探险队员：（由于担心浪费提问机会，这名探险队员并没有继续追问）好，我的第二个问题是：你们的族群是怎么诞生的？
//
//鸦商：嗯……我所知道的内容，都是从我的长辈那里得知的，不能保证真实性。长辈告诉我，我们的先祖从混沌中逃离了出来，从此预示着厄运的摆脱、绝境的希望。我们是原始欲望的收割者，吸收来自混沌的力量所用；虽然我们并不与黑暗为伍，但也无法逃出它的掌控之中。
//
//探险队员：（探险队员思考了一会儿，随即说到）既然你们是后室的原生物种，那你们有尝试过离开这个是非之地吗？
//
//鸦商：你说的是“世界”？
//
//探险队员：我想我们应该说的是同一个东西。
//
//鸦商：不，我们不能离开这里，我们的生命凝结于此，我们的希望也承载于此。但你们不一样，你们是世界的异族，不被世界之手所牵引。世界因你们的到来而复苏，但也因此开始凋亡，这就是你们的命数。
//
//探险队员：我承认，我可能完全没有理解你的意思。
//
//鸦商：也许有一天你会理解的……还有什么需要交易的吗？
//
//探险队员：我想我应该暂时没有什么需要的了，感谢你的耐心回答。
//
//鸦商：没关系，我们后会有期。
//
//（说罢，这位鸦商便关上了门）
//
//[记录结束]
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1388{}