//Level C-334
//评分: 
//+19
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
//安全
//稳定
//实体绝迹
//Level C-334是后室C层群的第334层。
//
//描述：
//Level C-334是一片具体大小未知的空间，具体表现为一片树林，这一片树林内部的树木种植整齐，并且保证了其枝叶遮盖住了绝大部分天空。而当流浪者进入这个层级之后，将会发现自己正站在一条林间小路之上，这里是唯一能够接收到阳光大范围照射的地方，这些道路由一些看起来年头很久的花纹砖组成。道路宽约三米，并且将会一直向着北方延伸。如果此时流浪者尝试走进树林并向着东西方向行进，将在行走约几百米后再次遇到这些石砖道路。每行走大概400-500米，道路两侧通常会出现一个由被粉刷成白色木板与一些钉子简单制成的长椅。
//
//这些长椅上大概率会放着一个盖着布的竹篮，竹篮内则放置着一些补给品，流浪者可以随意取走食用。这些物品随着树的种类不同将会出现些许不同，目前已经出现过的物品有：杏仁水、切成片的吐司面包、新鲜的水果、灌装果酱与配套黄油刀、果脯。果酱与果脯都是常见的那些类型，列如草莓果酱或杏果脯等。
//
//此层级内一共出现了四种树木，每种树林之间的样貌皆有很大差异，以下为具体介绍。
//
//桃树林
//桃树是此层级内能够见到一种树木之一。
//
//x47ZtS.md.jpg
//桃园蓓蕾初绽，生意盎然满园~~~
//
//这里所有的树都是盛开着桃花的桃树，日光明媚……桃花有时红又有时白还有的时候会是淡淡的粉色，它们都时不时地朝着土地上；朝着道路间；朝着椅凳上飘洒着花瓣。花瓣慢慢悠悠的飘落，但从未将地面占据，总会有的地方多，有的地方少……
//
//行走在林中，似有喜温宾雀。但叽叽喳喳，只闻其声，不见其形，甚是热闹。院内常见小物游闹嬉戏，其不惧游人。那淡淡花香清彻满园……
//
//行走在道路上发现一扇立于道路中间的门时，推开此门穿过门框即可来到新的树林。
//
//竹林
//竹子是此层级内能够见到一种树木之一。
//
//xIZVns.md.jpg
//嘘~~~不要说话，感受这宁静……
//
//这是一片只有竹林的物语，神秘而又令人舒适……微风吹拂着细细的叶片，奏响着那属于槐序的乐章，月光照耀着前方。现有如黄玉般的叶片从竹子身上脱落，但就算如此，在皎洁露光的映射之下，又好像在空中翩翩起舞，落在了心头之上。熙熙攘攘的枯黄之叶点缀着道路，点缀着那炎节之梦……
//
//嘘~~~仔细听。“蛐蛐蛐蛐……蛐蛐蛐蛐……”“知知知~~~了~~~知知知~~~了~~~”那是什么？那是一场属于虫们的心灵饕餮盛宴，触动着每个过路人的心……
//
//行走在道路上发现一扇立于道路中间的门时，推开此门穿过门框即可来到新的树林。
//
//银杏林
//银杏是此层级内能够见到一种树木之一。
//
//xIZnA0.jpg
//这……就是生命的，韵律……
//
//这里有关银杏的序曲，那生命的篇章……透过那金黄的枝叶，最后一点点霞光打在了地上，那一个又一个精致小球。风儿吹过，如同黄金一般的伞叶，怀揣着对生命的感悟，从母亲哪里纷纷离家，开始了它的生命之旅……一片，又一片，它们最终感悟了一切来到了他们的归宿，孕育它们所有之处，金黄满地。
//
//“哗啦啦~~~”那是什么？那是有什么小家伙拨动着树叶的声音，一定是松鼠们正勤劳的储备这自己度过那岁馀之时所用的种种……
//
//行走在道路上发现一扇立于道路中间的门时，推开此门穿过门框即可来到新的树林。
//
//松林
//松树是此层级内能够见到一种树木之一。
//
//xIZKhT.jpg
//不要害怕，这是森林的喘息声……
//
//看哪，一片黑暗森林，幽邃无比……你听到了什么东西正在哀嚎？？？不要慌张，那只是森林的喘息声，大地正在沉眠。这里并非死水一潭，仔细的感受，感受那树叶的吹动声，感受那小动物的活动声，感受森林的喘息声……一切都是那么的静谧与安详，不要害怕，不要慌张，感受着来自大自然的安静吧……
//
//但安静总是短暂的不是吗？“咕咕咕咕~~~咕咕咕咕~~~”马上鸟儿们便开始了属于它们的朗诵大赛……静静的聆听……
//
//行走在道路上发现一扇立于道路中间的门时，推开此门穿过门框即可来到新的树林。
//
//基地、前哨与社区
//因此层级的非连续性，无法建立可靠的基地、前哨和社区。
//
//入口与出口
//入口
//发现一处被白色篱笆围住的树林后，翻越篱笆行走十分钟左右便可来到此层级。
//打开一扇被白色油漆粉刷的粗制木门，通过木门可以抵达此层级。
//在墙壁上发现一张印有桃树、竹子、银杏、松树的海报后，触碰海报便可来到此层级对应的树林中。
//出口
//行走在道路上发现一扇立于道路中间的红色门时，推开此门穿过门框即可来到新的树林层级。
//躺在长椅上睡着可以抵达一个令人怀旧的地方。
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1334{}