//Level C-331
//评分: 
//+6
//+
//–
//X
// 
//
//生存难度：
//安全
//资源充足
//实体绝迹colorhub.png
//Level C-331中唯一的建筑物
//
//colorhub%20%283%29.webp
//Level C-331中小木屋内顶层的云霞
//
//Level C-331是后室C层群中的第331层。
//
//描述：
//Level C-331是一片平坦的麦田。麦田的排列简单，麦田面积近乎无限，有部分硬质田埂在范围内不断重复出现。在麦田远处似乎是一片树林，但永远不可能到达，据M.E.G.异常观察小组推测可能是海市蜃楼，也有可能真实存在。经检验麦田中小麦是未知的小麦类种。Level C-331中的小麦可食用，但没有任何营养价值，目前正在调查原因。
//
//Level C-331中有原有的建筑物是一幢小木屋，由橡木搭成。小木屋内部共有十三层，但从外观上看只有一层1，小木屋内面积约100m2，每一层由木制楼梯相连，每层的面积都相同，每一层的楼梯都有二十阶，只有顶层的空间不同，小木屋顶层有一扇悬浮的木门，进入后只有一望无际美丽的云霞，走入云霞中会坠落，通过自由落体达到Level 142。小木屋内有基本的生活需求设施3，内部装饰类似田园风格，环境温暖微黑，墙边有石制壁炉，壁炉燃烧物质燃烧时不产生任何烟雾，但壁炉能无限的持续燃烧和提供照明。燃烧的物质是麦穗，仍不明确麦穗燃烧不尽和不产生烟雾的原因。
//
//小木屋的附近会随机生成一小片小池塘，面积尚未明确，池塘的面积会不定时的改变，但池塘的数量似乎不止一个，截至目前 M.E.G.研究基地已发现三个不同体积的池塘。池水非常清澈，底部深度约5m深，池塘周围通常会有茂密的杂草，此现象原因尚不明确。 经M.E.G.研究基地实验表明，这里的水可以饮用，但里面有一种未知的酸性物质，水的味道偏酸，其中不存在任何微生物和浮游生物。短时间内饮用可以解决人体脱水症状，不明确长时间饮用会产生什么副作用。水中的未知的酸性物质，推测可能成为副作用的前提。
//
//Level C-331的土壤主要成分由各种颗粒状矿物质、有机物质、水分、空气、等组成，但不包括微生物，所以Level C-331中并没有任何生态系统，但能生长植物，其中的有机物质来源未知，Level C-331中的所有植物都可以进行蒸腾作用和光合作用。土壤中只有成片的小麦，混杂着小部分杂草，杂草不可食用，杂草分泌一种剧毒的物质，接触会使皮肤溃烂，食用后会在5分钟之内死亡。4。但这种草是全新的不同种类，此植物还有待研究。M.E.G.在此层级中发现了唯一一颗枯树，枯树的位置会随机改变，不会有任何的开花结果现象。此枯树可利用，此枯树上的所有木材均可作为材料，在砍伐此枯树后，枯树被砍伐部分不会复原，在枯树位置改变后，所有部分都会复原，此枯树是M.E.G.的重点研究对象。
//
//Level C-331中有黑夜白昼变化。由于此层级经观测不存在任何天体，光源尚未明确，只知道是天空中闪耀的光点提供照明。此层级温度适宜，白昼平均温度为23oC,夜晚平均温度为12oC，在Level C-331中的环境温度可能是由植物的蒸腾作用和光合作用提供。
//
//colorhub%20%282%29.webp
//Level C-331中发现的唯一的枯树
//
//基地，前哨和社区
//M.E.G.常驻护卫基地
//Level C-331中的宜居环境为M.E.G.创造了合适的基地环境。基地面积庞大，设备充足。设立此基地为了保护Level C-331的环境完整性和帮助误入的流浪者。
//
//M.E.G.常驻研究基地
//是Level C-331中最大的综合研究基地。目前为止在Level C-331中已发现多个异常现象，但对环境和活体无危害。包括小池塘的面积变化，枯树位置的随机改变和小木屋壁炉中燃烧不尽的麦穗。
//
//据研究Level C-331中的土壤营养成分极高，可以利用与农作物的种植，在Level C-331
//中已开垦1000m2的水稻实验田，水稻生长迅速，产量高，营养价值高。Level C-331的其它土地还有待开发，目前为止没有任何不良现象。据推测，Level C-331可能成为人类宜居的场所。
//
//实体
//此层级实体绝迹，无任何已知实体。
//
//档案记录
//M.E.G.档案：奇异天文景观
//colorhub%20%281%29.webp
//Level C-331中观察到的奇异现象
//
//Level C-331中此现象于█年█月█日被M.E.G.异常观测小组发现。此异常现象对Level C-331中的事物没有任何影响。此现象出现概率次数很少，在晚上偶然出现。此现象十分美丽，多位M.E.G.异常观测小组组员观察此现象时都认为Level C-331如梦境般完美，是Level C-331中独特的现象之一。当此现象出现的时候，Level C-331的植物会异常茂盛，地形也会发生改变。在此天文异常现象范围内，所有发生改变的部分都将是真实改变的。会出现大量的橡树和杂草，麦田会大片消失。在Level C-331的发生此现象的时候，小木屋周围的小池塘全部消失，所以在Level 998的阶梯尽头的空门廊，房间与云层的交界点坠落进入Level C-331的方法不适用。如果在Level C-331发生此现象期间通过上述方法进入Level C-331，将会卡入Level 10。在Level C-331此现象期间中的小木屋的顶层云霞也会改变。通过天文望远镜观察此现象产生类似的天体是无效的，在通过天文望远镜观察的过程中，只能观察到一片漆黑。
//
//
//入口和出口
//入口
//通过Level C-339的钢制门有很大机率达到Level C-331。
//在Level 10的无尽麦田中一直延前方行走周围的环境会慢慢改变成Level C-331。
//在Level 37的小屋中，会有几率看见悬浮的木门5，进入后可达到Level C-331。
//在Level 998的阶梯尽头的空门廊，房间与云层的交界点坠落，会掉进Level C-331小木屋附近随机的小池塘。
//在Level ？的[\%$^&$#^&&*((}{+_[数数……%*据缺失]*……%*（】$^%#%#>{:{<PP>"»%$@#$@^%#^#@$%@&>{<":LL":L{>""{可达到Level C-331。
//在Level 18中如果你碰巧遇到毛绒恐龙，你可以跟随它一段时间，可能带你到达Level C-331。
//出口
//与上述入口方法一致，在Level C-331延前方不断行走，周围的环境小概率会慢慢变成Level 10。
//在Level C-331中小木屋的顶层木门中的云霞坠下，可以进入Level 14。
//在Level C-331的小池塘的最底下，找到直径2m的钢制管道，可达到Level 2。
//作者信息
//« Level C-330 | Level C-331 | Level C-332 »
//
//Footnotes
//1. 此空间存在许多不合理因素，还有待探究。
//2. 你可能知道Level 14是一个多么美丽的层级，你不会想去那的。
//3. 包括床，餐桌，椅子和灯光（由油灯和壁炉提供照明）。
//4. 死亡原因通常是窒息，器官衰竭和脑溢血。
//5. 遇见木门的概率极小，这种进入Level C-331的方法可以忽略不记。
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1331{}