//Level C-308
//评分: 
//+7
//+
//–
//X
// 
//
//生存难度：
//等级 4
//
// 
//自然危害
//敌对实体
//Level C-308是后室C层群的第308层。
//
//Level C-308主体由一片宽度和深度都完全无法测量的类石蜡物质构成，由于Level C-308存在4种差异较大的状态，且该层级本身存在的极端不稳定性，所以参考图片及地图无任何参考价值。M.E.G决定不予展示。
//
//Level C-308主要状态区分方式为通过类石蜡物质主体状态及整体温度变化趋势。M.E.G暂时将其划分为4个平均变化周期，分别对应前厅中春夏秋冬。处于不同状态下的Level C-308主体外观和危险程度各有不同。
//
//冬季
//这是Level C-308最安全的时期，天空呈现类阴雨天的阴蒙状态，来源未知的平射光线分布在上方，且气温保持在20摄氏度左右。低于熔点温度导致了蜡质保持固体，因此此时Level C-308地形稳定，通常为高山峡谷以及层叠由凝固浪花组成的弯崖，其中存在着大量红烛修建的城市。除此之外也可以看到大量失去行动能力的红烛。本季节并没有可活动实体，探索者可以在此季节利用Level C-308进行移动。
//
//春季
//此时的Level C-308逐渐变得危险：天空的阴蒙开始逐渐化为乳白色且平行光线持续增强，气温逐渐升高，速度大约为2℃/天。30天左右到达人体可忍耐的极端温度，周围蜡质开始融化并向下流淌使Level C-308表层充斥着大量融化的蜡质，这导致流浪者的移动速度被严重拖慢。地形变得非常不稳定1。进入春季15天左右，环境会变得不适宜生存：地面已经布满大量粘稠的蜡质，这导致了流浪者难以行动，40℃的高温使得该层酷热难耐。此时的探索者应尽快找到出口离开2。
//红烛的熔点比普通蜡质更低，所以此时它们已经可以开始行动，但仍然保持着上一个秋季拟态出的外观，此季节红烛仅会漫无目的的缓慢移动。
//
//夏季
//这是Level C-308最危险的时候，天空呈现暖黄色光照变得极为耀眼，气温高达60℃以上，没有防护的探索者将迅速被抽干水分。
//在此状态所有蜡质完全融化成液体并因未知的引力来源产生巨大浪潮，根据秋季凝固的地貌估算这些浪潮可达100米以上，此季节红烛会以液态形式融入蜡质海洋中并袭击误入的探索者。3
//
//秋季
//这一季节是Level C-308夏季向冬季的过渡，温度开始逐渐降低，降低4。天空中光芒逐渐减弱变回乳白色，但未知引力来源的潮汐仍然存在。在此过程中蜡质会缓慢凝固，因此会以波浪外形完全进入固态最终形成在冬季常见的地形。
//
//此季节红烛会脱离蜡质海洋，拟态成近似陆地生物的外形并表现出社会合作性，观测到在夏季气温变低时，蜡质开始逐渐凝固时会开始利用蜡质修建具有不明意义的大型建筑集群，似乎为模仿其他层级的建筑造型，目前被关注到的建筑外观包括近似 Level 11的城市， Level C-408的帐篷区等5。
//
//目前有明确目的并且值得记录，有较高辨识度的建筑有
//
//Level C-93的木屋，值得一提的是在外侧还修建了巨大的半圆形薄膜，原因末知。
//Level C-134的巨大圆柱及大坑，借助大坑仍然未能发现Level C-308底层。
//Level C-110的大量旧报纸堆，蜡质报道以超乎想象的精妙程度印刻所有文字。
//一座怪异且违背物理学常识的近似于悬浮状态的多面体高塔，并没有找到其建筑原型，并且暂不知道它如何保持稳定。
//目前的M.E.G研究人员认为Level C-308中的建筑可作为未知层级建筑的参考，但此提议并未施行。
//
//实体
//Level C-308除误入实体外仅会生成一种被称为红烛的特殊实体。
//
//红烛生理学概念近似于一团有自主意识和行动能力的蜡，相比起Level C-308常见的蜡质颜色为红色且熔点更低。
//
//这使得红烛能更早液化并更晚凝固，在春季和秋季能保持自由活动，只有冬季才会被彻底凝固失去行动力。即使在融化之后也不会溶于Level C-308普通蜡质，而是以近似游泳的方式在其中前进，这也是夏季红烛的主要移动方式。
//
//春季和秋季由于温度降低红烛从液态逐渐变成半固态。此时可以从蜡质液中离开并且拟态出看上去像对于后室其他层级生物模仿的外形，除了颜色外细节都极为相似。甚至一些探索者报告在将其外壳打破后里面的内脏结构也是完美模拟的 但是被模拟的只有结构，除此之外实体本身的性格和能力并不会出现。
//目前被观测到可以模拟的实体包括（但远不止于）
//
//人类，通常为穿着隔热服或是双手掐住脖子面容痛苦，推测为Level C-308的探索者和受害者。
//Entity C-98，表现出有限的飞行能力，尽管由于其重量很快会坠落并将自己摔碎。
//Entity C-6，个体的行动力似乎比模拟成人类的个体更强
//红烛并没有具体个体概念，根据观测它们可以自由组合成巨大物质或是分离成较小个体，任何大小等于或超过人类的个体都被确认有至少近似于人类的智力。目前推测他们的智力跟体型有关。
//
//这些个体本身力量和体型成正比但是较小，通常体型等同于普通人类级别的个体能也仅有100N左右的推力。因此在正面对抗时无需担心，但是其本身具有的较高温度和流体特征使得其可以轻易越过防护措施进入人体。
//
//这通常会造成隔热服缝隙凝固导致行动不便，但真正致命的是其可以直接穿过呼吸道等孔洞进入内脏造成严重烫伤致死。
//
//这些个体具有极高敌意并且会主动攻击任何进入Level C-308的实体，包括人类，有探索者报告被这些尸体杀死的探索者体内流出远比进入量更大的红烛，推测红烛具有某种将受害者转化为自身物质的能力，但是具体如何做到还不得而知。
//
//特殊效应
//该Level C-308无任何特殊效应
//
//物资
//Level C-308不会产生任何物资，除了构成本层级的蜡质可以作为一种可靠的燃料以外，Level C-308无法找到任何其他产物。
//
//基地、前哨与社区
//C层级民众自卫C-308支队
//这是C集群探索者结成的小型自助保护组织的一部分，目前有大约10人左右持续驻守在Level C-308直到夏季到来时会从一个未知通道撤出，春季到来时又会立刻返回，这里总会有一个组织骨干驻守，当前的驻守是伍凌支队长。
//他们会持续燃烧带有颜色的烟雾，通常为绿色。由于本层较严的扩散很快可以很轻易的察觉，追随绿色烟雾指引就会达到其营地。该支队会尽快帮助探索者脱离险境但是并不接受回报，当探索者询问他们为什么这么做时得到的回应是“你已经付出的够多了”
//
//网络情况
//Level C-308网络极差，大部分区域的网速仅有1b/min
//
//入口与出口
//入口
//从任何有蜡质残留的墙面试图切入都会直接切入Level C-308。
//据分析C层级民众自卫C-308支队有一个持续且稳定的特殊通道，但是他们拒绝分享，并且任何试图了解这个通道的人都会受到C层级民众自卫C-308支队的攻击
//出口
//据分析C层级民众自卫C-308支队有一个持续且稳定的特殊通道，但是他们拒绝分享，并且任何试图了解这个通道的人都会受到C层级民众自卫C-308支队的攻击
//在其他层级发现内脏被蜡质填满并且严重烧伤的尸体，推测深层区域存在某个出口，但是没有找到能进去的办法。
//进入与层级及高度相似的建筑时有概率会被传送到其真正的层级
//作者信息
//Footnotes
//1. 大量大型构造体会因为下方融化而在自身重力影响下倒塌
//2. 在紧急情况下可以寻求 C层级民众自卫C-308支队帮助
//3. 目前尚未找到在此季节进入能有效生还的方式
//4. 速度与春季升温速度等同
//5. 且建筑还原程度极高，目前它们具体数据的获取方式暂时不得而知
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1308{}