//Level C-392
//评分: 
//+21
//+
//–
//X
// 
//
//生存难度：
//等级 4
//
// 
// 
// 
//Level C-392是后室C层群的第320层。
//
//JIqZvknHlF6S5is.jpg
//老旧的房屋，漆黑的街道
//
//描述
//Level C-392表现为一片破败的由中式老房屋和石制街道构成的老城区，类似于前厅中的古城或是老住宅区，此层级中房屋与街道有着规律的排列组合，但每个房屋的外表结构和内部装横都是完全随机的：有如内部全空的房屋，有的房屋内存有大量物资和家具。甚至有实心的房屋。Level C-392没有昼夜更替，永远滞留在夜晚，但东部的天空相对比较亮一些。这里的温度保持在27℃～33℃，街道在这里呈网状分布，有宽有窄。
//
//在Level C-392中，暴露在强光下是非常危险的，即使只是一瞬间，你也将会被大量实体锁定，尤其是钝人和死亡飞蛾，即使您精神状态十分正常，你也会被钝人袭击。这里的灯光虽稀少但总是凭空的出现在或是凭空的消失。这导致您很有可能没有预兆的被强光照到。不过您依然可以安全使用约150流明以下的弱光，比如电子设备屏幕，火把，小灯泡等
//
//在Level C-392的街道中，充斥着类似于蟋蟀类昆虫的叫声，据来过这的流浪者称，这种声音会使人心情烦躁，易怒，长期生活在这种声音下会导致体力不支甚至发疯。这是非常危险的，因此可以选择待在室内或者使用耳塞，摄入大量杏仁水也可以缓解这种影响。
//
//区域
//根据建筑的不同形式和排列，大致可将这里分为4类区域
//
//R1MIr5Q36H9Nbgf.jpg
//一座寺庙…
//
//旧街
//所有拥有宽型街道的区域的统称，是这一层级中最常见的区域。低矮的老旧的中式店铺挂着破烂的锦旗分布在街道两旁，在这一区域能够看到货架七零八落的百货店、假人满地堆的服装店、腐臭弥漫的小吃店等等。颇似曾经辉煌的商业街被废弃了一样。这一类区域中灯光更多，更危险；但相对的，物资也更丰富，不过能够安全食用的只有罐头和杏仁水。
//
//旧巷
//这是由一条条较为狭窄的石子路构成的区域，这些石子路漫长而遥远，但是走在街道上你会发现这段距离很短。巷道两侧建有一排排两层高的中式老住宅。这里几乎没有灯光，只有部分楼房的窗户里透着微弱的光，但并不代表这片区域很安全。
//
//灯光房
//如果您运气好的话，在旧巷区域探索时，您可能会发现一间叫灯光房的敞开着大门的建筑，那是实体“老者”所在的房子（见下文实体部分）。这里是Level C-392中最安全的地方，这种建筑内部是独立的，整个层级里的所有灯光房永远是同一个。
//
//施工区域
//被一道道施工铁皮墙围住的区域，别进去！那里面全是碎砖钢筋和淤泥的废墟，你会陷进去的，小心散落的电线，它们依然危险。
//
//ZmJ4dCc3oRLaP9B.jpg
//一张珍贵的图片，前面是城墙区域，左为施工区域，右为旧巷
//
//城墙区域
//此区域为一堵向两边无限延伸的城墙，这里可能是Level C-392的边缘地带，目前仅在该层级的东部发现此区域。城墙在流浪者眼中会以难以名状的形式不停地扭曲交错着，变化着形状和颜色，报告将其描述为“十分诡异的”，但奇怪的是，电子设备无法捕捉这种扭曲，这可能只是一种精神影响。接近城墙会使流浪者感到强烈的恐惧，所有越过城墙的尝试都因此特性而失败。墙前有一片宽为约30米的覆盖着苔藓的平滑岩石空地，似乎城墙有某种吸引实体接近的能力，这里游荡着明显比其他区域更多的实体，探索此层级时请尽量避开此区域。
//
//远处的辉煌
//在Level C-392中，向着东面，你会看到一条断断续续的发光线条，轮廓看起来像是
//一些很高的楼房。这似乎表示城墙外面有一个截然不同的开阔空间。
//
//bJTKdoYQwfgZj6c.jpg
//唯一一张墙外空间的照片，拍摄者已遇难
//
//如果你沿着“城墙”向一个方向不停的走，你可能会在城墙上找到一条很长的隧道，走到尽头就能够到达墙外面的空间。以下为唯一一位从墙外空间回来的探险者所描述的景象：
//
//那是一片广场，停泊着许多的废弃车辆。左右两边各有一条漆黑的、破旧的道路沿着城墙分布。广场前面，是一片如镜子一样泛着白光。上面有座看不到尽头的大桥，桥上有着数不尽的荧光灯，桥上的两排绿植中透出红蓝绿三种颜色的霓光。远处有星星点点的辉光，条状的光源和直射云霄的光束。就像是在遥遥地眺望前厅的大城市一般。辉煌中透出一点点的朦胧，想要触及却又遥不可及……
//
//（回过来神）
//
//不对，别被那光芒吸引了，它们会让人丧失理智，失去感知。我的三位伙伴都离奇的不由自主的走向桥那里，而且根本拦不住。只能眼睁睁的看着他们被光照到，被成群的实体蚕食，这是可恶。
//
//（情绪失控）
//
//我差点也丧失了理智，记住！杏仁水什么的都是不管用的！赶紧回去！遇到这种该死的隧道可别冒险进去！
//
//实体
//实际上Level C-392中游荡的实体并不多，主要来源于接触强光而出现的。Entity 2~11在这里皆有出没,Level C-392也有2种特殊实体：
//
//远光魇
//出现在旧巷区域的一种敌对实体。没有人见过它的真正外表，它会发出一阵尖锐的咆哮随后突然现身在流浪者的身后一段距离，并且像一个远光灯一样向着流浪者射出一束约2000流明的强光，强度能够照亮整条巷子。这时它会快速地向着流浪者移动，你这时要赶紧掉头以你最快的速度奔跑，跑出旧巷区域便能逃脱。
//
//4rFcykJQEt9nZBM.jpg
//灯光房
//
//老者
//居住在灯光房里的一种中立实体，拥有较为高大的人形身体和不停扭曲的诡异男性面貌。本体只能在灯光房里移动，但是其意识可以游荡在整个层级，甚至可以对流浪者说耳语。他可以流畅地说汉语，乐意与流浪者交谈和交易，且声称只要能和他聊天便可给予住处和食物。一般情况下保持友好，但是如果试图攻击他或是挑逗他便会变得敌对，发起攻击时可以整个的将他所厌恶的人吞下，尽管你跑出了灯光房也难以逃脱。
//
//基地、前哨与社区
//由于Level C-392面积巨大，较为危险，难以到达，Wi-Fi强度低，因此此层级只有一个组织。
//
//蹭吃蹭喝蹭网392组织
//这个组织隶属于M.E.G.，常驻人员有四人。基地驻扎在灯光房的一间40平方米的小房间里，他们一直保持和老者的交谈，保持老者与他们的好感度，并白嫖使用老者提供的充足食物和资源。灯光房的Wi-Fi信号很强，生存条件良好。他们能帮助进来的流浪者，给予他们物资，且劝告他们要保持对老者的友好交流，保护流浪者的安全。并且能够帮助流浪者离开Level C-392（见下文入口与出口部分）
//
//入口与出口
//入口
//在Level 996触碰一只非常亮的灯泡，随即灯泡便会消失，然后进入Level C-392
//在Level 448里进入一扇生锈的门。
//在Level 423的商店的冰柜里里注视一根透明冰棍，然后你会眼前一黑，进入Level C-392。
//在Level 321中卡进一张带有中式房屋的画，便会被传送到Level C-392。
//出口
//进入一家门口撒着彩色纸屑的百货店，便会进入享乐层，千万别进去，除非你不想活了。
//通过施工区域的一个脚手架爬进一间房屋的二楼，然后你会从Level 49出来，此过程不可逆。
//从灯光房二楼可能会出现的一扇狭窄的门中出去，便会到达随机的层级（大概率是安全层级）。这也是392组织长期在此驻扎的原因：收留流浪者，等出口出现了之后再把他们送走。
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1392{}