//Level C-339
//评分: 
//+14
//+
//–
//X
// 
//
//生存难度：
//等级 3
//
//不安全
//不稳定
//未知实体colorhub%203.webp
//Level C-339中被光照亮的大厅
//
//Level C-339是后室C层群中的第339层。
//
//描述：
//Level C-339是一处未知的无限重复空间，此层级面积未知，实体未知。此层级类似一个大型阁楼，墙壁由墙纸贴住，地板由漆木铺垫，天花板微微泛黄，有一盏钻石玻璃吊灯提供照明。建筑物内部的装饰奢华，环境微亮，部分地方漆黑。此层级有楼层，但目前未知一共有多少楼层，每个层楼的设备，装饰，布局都一样，只有雕塑的出现并不符合空间的规律。大厅窗户外部是类似Level 10的无尽平原，但处于永夜环境，只有Level C-339中的无锁房间中是明亮环境，窗户外面也是无尽平原，目前为止没有任何已知从建筑内部到窗户外部的出口。
//
//Level C-339中部分楼层都存在形态不一的雕塑，大部分雕塑为人体雕塑且具有明显的人体学特征，但这些雕塑的神情以及姿态是非人类的，并且通常能够使观察到它的流浪者产生恐惧。雕塑类似古希腊风格，且是由混凝土和钢筋构成，外表浅灰，磨损严重。这些雕塑无实质危害，但可能导致看见过雕塑的人中度精神创伤1，雕塑的出现是不规律的，在每个楼层中不会重复出现。
//
//Level C-339的地板上有发现红色干涩印记，根据M.E.G.实验小组的检验，是人的血液。血迹可能是由失踪的流浪者留下，但我们未能找到这些流浪者的遗体2。在发现血迹的楼层中能够找到一些物资3和杂物4，且随Level C-339的空间变化而消失。
//
//colorhub%204.webp
//Level C-339中连通大厅的走廊
//
//Level C-339中漆黑的走廊是连接Level C-339大厅的未知部分，不与Level C-339进行空间变换，出现机率小，在任意楼层的钢制门中出现，且是一条无限长的医院长廊，不确定是否有尽头，前方发散强烈的白光，走廊两侧是不同的无锁铁门，进入此长廊的任意的铁门，都将进入Level 10。
//
//Level C-339中有许多木制门，也有小部分钢制门，因为Level C-339的面积无限大，据统计可能有几亿扇相同的木门和钢质门。但大部分木门都上了锁，只有小部分可以进入，钢制门是无锁的，出现的机率很小。无法进入的木门，尚不知道其内部构造，上了锁的木门无法用任何已知的方法打开5，即使会留下无法修补的痕迹，进入钢制门是已知的能够离开这里的第一种方法6。没上锁的木门进入后内部类似一间未完工的房间，里面明亮空旷，是M.E.G.在Level C-339的唯一基地。窗户外面是类似Level 10的无限平原，但是窗户也无法用任何物理方法破坏，导致M.E.G.对建筑外部的研究终止。
//
//无锁房间的数量稀少，目前M.E.G.只发现3间无锁房间，因为Level C-339的变化，能够找到无锁房间的过程是艰难的。
//
//Level C-339的空间十分不稳定，空间时刻都在发生变化。因此Level C-339中的窗户，进入此层级的入口，每个门和雕像的位置会不时的改变，目前为止没有任何人目击过Level C-339空间变换的过程。无锁房间的入口和钢质门的位置同样发生改变，在我们的研究中发现，在任意一个门上留下标记，在Level C-339的空间变换之后仍能找到原先的标记。
//
//所有流浪者，如果你意外切入了Level C-339，请阅读以下忠告：
//
//在路上可能会捡到背包，包里可能有食物7或一瓶杏仁水，可以维持大约一周的生理需求。
//这里的面积很大，很大几率迷失方向，一旦从进入此层级的入口离开，就不可能回到原点8。
//如果你遇到困难，请去寻找带有M.E.G.特征标志的门，例如明显的M.E.G.字样，我们任何时候都在那等你。
//colorhub2.webp
//Level C-339中拍摄的无锁房间
//
//基地、前哨与社区
//M.E.G.临时护卫基地
//设立此基地的目的为了保护已知的无锁房间，目前有约10人负责保卫基地和帮助误入Level C-339的流浪者。
//
//M.E.G.临时实验小组
//M.E.G.临时实验小组是负责并且研究，实验和记录异常现象。在已知的无锁房间搭建实验平台，此实验小组约6人。
//
//实体
//目前在该层级仍未有任何实体的目击报告，不完全没有实体威胁。雕塑的无规律移动和变化是有待研究的对象，怀疑是Level C-339中存在的已知实体。
//
//档案记录
//收起
//M.E.G.档案 1	时间：█年█月█日	第一次记录
//M.E.G.探员1：	这里可真大，会有人在这吗……？
//M.E.G.探员2：	这鬼地方能有谁啊?
//M.E.G.探员1：	报告后台，这好像有许多房间，有可能是出口
//M.E.G.探员2:	该死，门上锁了，嘿!过来搭把手
//M.E.G.探员1：	[通讯杂音……]
//M.E.G.探员2:	人呢?……啊！……[通讯杂音……]
//[数据缺失]
//收起
//收起
//M.E.G.档案 2	时间：█年█月█日	第二次记录
//M.E.G.探员1：	第二次记录，我们已经达到目的地，有何指示?
//后台通讯站:	[通讯杂音……]
//M.E.G.探员1：	怎么回事，嘿，兄弟，联系一下后台
//M.E.G.探员2：	后台，后台，我是探员███，听到请回复
//M.E.G.探员1:	兄弟，看到刚才的黑影了吗?
//M.E.G.探员1：	人又跑哪去了?
//[数据缺失]
//收起
//收起
//M.E.G.档案 3	时间：█年█月█日	第三次记录
//Level C-339端口开启失败，记录结束
//收起
//M.E.G.档案 4	时间：█年█月█日	第四次记录
//Level C-339端口开启失败，记录结束
//收起
//M.E.G.档案 5	时间：█年█月█日	第五次记录
//Level C-339端口开启失败，记录结束
//收起
//M.E.G.档案 6	时间：█年█月█日	第六次记录
//M.E.G.探员1：	报告后台，我们已经达到Level 11
//后台通讯站:	现在我需要你们去寻找Level C-339的入口，执行命令
//M.E.G.探员1：	我们正在上楼，完毕
//M.E.G.探员1：	达到第39层，准备跳下，降落伞准备就绪
//M.E.G.探员1跳下
//M.E.G.探员2跳下
//M.E.G.探员2:	报告后台，M.E.G.探员1已进入
//M.E.G.探员1：	报告后台我已进入Level C-339，等待指令
//后台通讯站:	[通讯杂音……]
//[数据缺失]
//收起
//收起
//M.E.G.档案 7	时间：█年█月█日	第七次记录
//M.E.G.探员1：	这是个未完工的房间吗？
//M.E.G.探员1：	兄弟把相机靠过来点，有在拍吗？
//M.E.G.探员2：	在拍呢，你联系一下后台，把坐标发给他们
//无线电联系系统：	……加载中…….加载完毕……发送中…….完成发送！
//M.E.G.探员1：	后台，坐标已经发过来了，开一下端口
//后台通讯站:	端口打开失败…….
//后台通讯站:	第二次尝试，端口打开失败…….
//后台通讯站:	第三次尝试，端口打开失败……，你们那边空间太不稳定了！
//后台通讯站:	第三次尝试，端口开启中……开启中…….开启中……开启成功！
//进来10名M.E.G.技术探员进行基地搭建……
//收起
//收起
//M.E.G.档案 8	时间：█年█月█日	第八次记录
//M.E.G.探员1：	报告后台，已进入长廊
//M.E.G.探员2：	报告，前方白光刺亮
//M.E.G.探员1：	是类似医院长廊？
//M.E.G.探员1：	门没上锁！
//M.E.G.探员2：	进去看看……
//M.E.G.探员1：	报告后台，我们进入此门
//M.E.G.探员1：	报告我们已经进入铁门，达到……Level 10?
//收起
//入口和出口
//入口
//在Level 0中，向任意一个固定方向行走下去，会在几个小时后，在某个任意地区的地毯切出，到达Level C-339。这种进入的方式极其罕见，因为很少有流浪者能在切出Level 0之后到达Level C-339。
//在Level 11中，从任意一栋建筑物的第39层跳下，都有可能进入Level C-339，这样做是极其危险的9。
//通过 Level 1 的木制走廊门进入 Level C-399，这是目前已知最安全，最稳妥的方法。
//出口
//在 Level C-339中有随机生成的钢制门，进入后会有几率把你传送至Level 0或者进入 Level C-339中的未知走廊，也有大概率进入Level C-331。
//Level C-339中有许多房间，但大多数都上了锁，进入 Level C-339中的未知走廊的任意铁门，可达到Level 10。
//Level C-339中如果你进入带有M.E.G.字样的房间，M.E.G.探员会帮助你离开这个地方，到达M.E.G.“Alpha基地”。
//作者信息
//« Level C-338 | Level C-339 | Level C-340 »
//
//Footnotes
//1. 中度的精神创伤可能表现为长时间的情绪低落，悲观厌世，社会性孤独自闭，或严重的睡眠障碍，焦虑紧张，恐惧胆小，甚至出现自杀倾向。
//2. 据推测可能是通过出口离开了此层级，但为什么有血迹，尚不明确
//3. 包括消耗的各种刀具、夹具、量具等。
//4. 无利用价值的小零碎物品
//5. 包括撬锁，砸门，炸药，化学物腐蚀
//6. 详细请见出口部分
//7. 能量棒和包装零食
//8. 因为空间的不稳定性，内部的空间会发生改变
//9. 这样做成功的几率不大，在没有任何防护的情况下，无需尝试
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1339{}