//Level C-304
//评分: 
//+28
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
//安全
//稳定
//极少量实体
//一个宁静的小镇，有着永远的黄昏。
//
//描述
//jbGyQI.jpg
//黄昏，让我如此怀念。
//
//Level C-304是后室的第304层。一座永远黄昏的小镇，清凉的风从东边吹来，天空永远布满云，干燥的土地永远长着无需浇水的绿植和艳红的野花。这里只有晴天，从任何方向和角度看到的太阳永远在地平线以下，而赤红的晚霞照耀着半边天。盯着远处的天空看，会出现黄昏到黑夜的渐变，照相机也可拍到这个场面，但眨眼或按下快门后一切如常。橘红的水云存在于过去，而赤红的天际预示着未来。
//
//建筑及物资
//此层级是一个中小型镇，以公路为中心的两侧呈对称状。无论从哪个位置出发都会在10分钟后会回到最初位置。
//
//老旧的小型超市
//通常放着少量杏仁水，两袋或三袋薯片和以箱为单位堆叠的纯净水，极少的概率出现皇家口粮。
//
//照相馆
//小镇唯一崭新的地方。里面有二十七本书，内容却是一致的，是看这本书的流浪者的过往，带出照相馆后书架上会自动填补新的书籍。有意思的是，公路另一侧照相馆中书里文字除了签名外均为镜像。
//
//照相馆正中央有一台打印机，粉墨盒会在用完的五分钟后自动填满，抽屉内的A4纸数量也是如此。输入任何内容，打印机都只会打印出一只幼年萨摩耶的图像，较低概率打印出一只土狗的简笔画。据说有人打印出一句话[数据删除]，但没有得到证实。
//
//小镇居民楼
//内部的设施相同，但公路两侧的居民楼并非对称，里面的设施会在每次打开门后重新摆放，摆放位置是随机的。每一栋房子里只有一间卧室放着一瓶50ml的杏仁水，而在公路对称的那间卧室放的却是同等容量的腰果水。居民楼后面有被废弃的锅炉房，藏有少量火盐。
//
//Wi-Fi
//这里有较强的Wi-Fi。
//
//实体
//会有一些错误的卡入这个地方的迷路实体，但会在一小时后消失。
//
//前哨和基地
//The M.E.G.
//仅有五个人。
//在公路中心向太阳的方向有一个基地。
//入口和出口
//入口
//在Level 11打开一扇破旧的门。
//在Level 18回想小时候的家园。
//出口
//找到一片草丛，靠近它并闭上眼睛，30s后会来到Level C-92。
//找到医院的精神科，在座椅上坐5分钟，起身后来到Level C-144。
//不是吗
//我曾在这里生存，书上如此写
//
//依然一样
//那里亘古不变，无论我在与否
//
//什么时候
//那里早已拆迁，装修，重造
//
//日期:我不记得了，我只有在这里生活的记忆，五年？十年？
//
//天气:雨。下雨了吧。。
//
//我有点遭不住，无时无刻的心里压力击打着我。好像在深海，我无法呼吸，难受，心疼。
//
//我该怎么办，我没有办法。该死，我不能伤心，我需要时刻保持开心，该死，为什么。
//
//为什么。我感觉到我将要逝去，和这里该死的，炸裂的黄昏一样，一点雨都没有。
//
//那是家人么…
//
//你为什么在云上，我好想你，我什么时候才能找到你。
//
//呼吸，我呼吸不上来，心头压着一块石头，我感觉我在混乱。哦不，我已经混乱了。
//
//我该怎么办。
//
//我该怎么办。
//
//救命。
//
//救命。
//
//救命！
//
//救命！
//
//救命！
//
//救命！
//
//它在向我靠近！
//
//求你了，救我！
//
//求你了！
//
//哦不，我又在说疯话，该死……
//
//我想我得走了，明天就离开这个鬼地方。
//
//一天都不能待。
//
//依然存在
//记忆永远停留在那个黄昏
//
//日期:来这的后室的第二个标准日。
//
//天气:晴
//
//要下雨了，我感受到了雨滴，我在一个平地搭了帐篷，我不明白这里有什么好。
//小镇居民楼后面有人在哭，我问了以前在这里的人，他们说，以前并没有这样的场景。
//这里不是能长久待的地方，我得离开这儿。
//哦不，哦不不不，我想起来了，我不应该离开这儿？
//这是第几次了？为什么我还想着离开？我不能离开
//她需要我。
//为什么我还在？
//我需要冷静，是的冷静。
//我足够的冷静。
//这里有下雨的迹象了，潮湿的空气笼罩在我的肌肤上，我的心头依然是那么压抑。
//我需要休息。
//
//我觉得我忘了什么，但是头部的惨痛让我无法思考。
//
//睡吧，让这该死的一天过去。
//
//生存
//雨滴，待着锋利的刀，刺向了我。
//
//日期:我来这的第3天。
//天气:阴。
//这里真不错，可惜的是卧室是乱的，我只能居住在照相馆中。
//有种家的感觉，我想待在这里。
//
//高大的树木总让我想起念书的日子，也是在前厅的日子，我想回。
//
//黄昏侵占着天空，和夜晚对抗，看多了也没意义了，但今天它在退缩，嗯，应该是快晚上了，也不知道是不是我盯的太长时间了。
//
//真奇怪，蚂蚁开始搬家了，这该死的天是不会下雨的。等等，哪里来的蚂蚁？哦不，我居然看花眼了。
//
//这里不是家。
//
//居民楼的后面有女孩的哭声也有狗的叫声，过去一看，哦我的老天，一个十三岁的女孩，她的狗子死去了。。虽然不知道狗子是怎么进来的，这个女孩为什么独自一个，但我能深深的感受到她的情绪。
//
//就像是我的鸟离我而去的那天，一样的悲伤。
//
//除了这件事，还有一个，为什么打印机会打印出“黄昏是太阳的葬礼，雨是天空的哭泣。”
//
//这样终究不是家。
//
//我开始变得神神叨叨的，总是回忆过去的事情，我明明记得？不对，我不记得。
//下雨了，小雨。不应该。
//
//我看到我的家人在云上，他们在向我招手。
//
//“求你了，不要走！不要留下我一个人！”
//
//“这是终止吗，我想不是。”
//
//看看她真实样子
// 
//
//生存难度：
//等级 3
//
// 
// 
// 
//融化人心的雨，冲洗这件“记忆”
//
//描述
//jbGRw8.jpg
//即将下雨的征兆。让我如此怀念。。
//
//Level C-304是后室的第304层。下着永不停息的雨。橘黄与深蓝交杂的天空，暗蓝色的雨水滴在皮肤上，会使这块皮肤如冰淇淋般融化1。将纯净水与干燥的土壤以2:5的比例混合，敷在被侵蚀的部位。或者将紫蓝色叶子切碎，等量的雨水和杏仁水混合，一并口服。穿着雨衣站在雨下超过15分钟，会开始逐渐失去记忆，这个过程会持续30分钟。失去记忆的人通常会无意识让脖颈暴露在空气中，此时雨滴会融入皮肤，出现暗蓝色的脉路，三分钟后消失。当他们接受完“洗礼”2，会带着混乱的，这个小镇的记忆，穿戴好衣服重进进行漫游3，引诱并杀死流浪者将他们或者他们的尸身拖到公路上，褪去上衣4，进行的“洗礼”。他们的血液是暗蓝色的，铁离子被铜离子取代。如果您的同伴突然想要带您去一个地方，务必检查他的血液，如果是暗蓝色，快跑，他已经不是您曾经的同伴了。一个残忍而有效的办法，将全身的血液更换一遍，那您的同伴就会重新回到您的身边，可惜的是，他不会记得您。
//这是一座记忆中的小镇，雨后的空气混合着泥土的气息，带着淡淡的铁锈味，这是一个回忆。曾经的朋友，失去的记忆，会逐一出现在您的眼前，不必担心，他们友好。离去的同伴在云层下接受路灯的照耀，他们在等您。
//
//炸裂的头痛，不安却熟悉的雨滴，存在于脑海深处的记忆。这是记忆的颜色，也是哭泣的颜色，回吧，去吧，他们在等您。
//
//建筑及物资
//以中间公路对称的小镇，面积约为50万平方公里，一道无形的紫红色光屏隔离了这座“雨镇”外面依然是小镇，车水马龙，阳光普照，独留我一人流泪。
//
//崭新的超市
//货架围绕着正中心的收银台摆开，售卖着各种水果味汽水，《后室终极食谱》，“罐装龙肉”，瓶装矿泉水与“油腻棉花糖”。收银台上的抽屉通常是被锁上的，每过24小时里面会伸出一条有三米宽的章鱼触手来添补货物。不要靠近它，鲜红的的吸盘会吸住任何一个妄图攻击它的人，并卷住其塞进抽屉5
//
//照相馆
//一个老旧的照相馆。书架上的书变成了流浪者童年时最喜欢的故事6，和与家人曾经的谈话。打印机不再打印出动物，而是写着“蓝色幻想”的黑笔签名。公路另一边的照相馆则会打印出“白色希望”的蓝笔签名。
//
//居民楼
//打开后会呈现流浪者小时候的房间，不会在下次开门后重置。在床上睡下后会忘记在后室的所有记忆7，这些记忆会在离开居民楼的一小时内想起。厨房或餐桌上摆放的是流浪者最喜欢的食物，据流浪者描述，吃下食物会有“母亲”的感觉，安心。
//
//待在这里吧，待在你的过去，这里不好吗？我亲手为你打造的家。
//
//“这是我的家。”
//
//Wi-Fi
//照相馆中有微弱且稳定的Wi-Fi。
//
//植物
//食用洗干净的绿色植物和花瓣可以减轻雨水对人的影响。
//
//公交车站牌
//淡蓝色的顶棚可以挡住雨水，座椅底下通常藏着一瓶杏仁水。
//
//影响
//在雨中
//在雨中淋雨超过三小时会被融化，最后渗入地面。
//在雨中漫步超过15分钟会不自觉的开始接受“洗礼”。
//记忆会在无意识中被替换。
//替换记忆的过程无异议为痛苦的，希望与绝望，害怕与恐慌，绝望的想家，又害怕即将到达的未来。曾经的熟人会出现在雨下，熟悉的身影不停的挥着手，他们的呢喃在耳旁出现，渴望与无助，熟悉与陌生。很快，您会忘了他们，并拥有了“替代物”8。
//实体
//在公交车站牌有较高的概率看见年龄约为13岁的女生，黄格子风衣能遮住膝盖，包不住大腿的短牛仔裤，白色运动鞋，红色短袖和束起的长发。她通常会抱着一只幼年萨摩耶。
//
//有极低的概率看见一位16岁少女，披散着及肩的狼尾，黄色短袖，黑色阔腿裤。与之交谈可得知，她曾有一只幼年萨摩耶。
//
//一些实体会在错误地点卡出，不会消失。在雨水下可以用物理攻击杀死这些实体，他们的血液均为暗蓝色。
//
//前哨和基地
//M.E.G.正在此处建立基地。
//受到小镇记忆影响的人，在此居住。
//入口和出口
//入口
//在Level 11打开一扇破旧的门。
//在Level 18回想小时候的场景。
//出口
//一名13岁的少女会出现在公交车站牌，与她交谈后，会出现一辆蓝色公交车出现并带你离开，站点为你谈话时提到的安全层级。
//极低的概率看见一名16岁的少女手持雨伞。与之交谈可以要到一把蓝色格纹的雨伞，这个雨伞可以抵挡雨水的侵蚀，并且她会带你找到一扇通往Level 11的门，离开该楼层后雨伞会消失。如果说明想去其他安全的层级，则会有一辆绿色公交车出现。
//切出紫红色光屏会来到Level 18。
//你应该离开，离开我的梦境。
//
//Fantasy blue的一次临时采访
//unoccupied:您好
//Fantasy blue:不用说您。
//unoccupied:哦好的，我能问几个问题吗？
//Fantasy blue:哦……我不想回答，但现在我刚好有空。
//unoccupied:这个楼层是怎么一回事？
//Fantasy blue:指雨？
//Fantasy blue:雨是泪水。
//unoccupied:那只狗？
//Fantasy blue 抱起绕着她腿打转的狗。
//Fantasy blue:哦，不用担心，她是无害的。
//Fantasy blue:我来的时候就有这条狗了，我不知道我怎么来到的这里，每天见到的人都不一样，想跑的，想留着的。可惜的是，我从未见过这个小镇放晴的样子。
//Fantasy blue 将手里的狗举到 unoccupied 面前。
//Fantasy blue:摸摸？她不咬人。
//unoccupied 接过狗，抱在了怀里。
//unoccupied:你没有见过这里放晴的样子？
//Fantasy blue:嗯，我只见过它的雨天。
//汽车鸣笛声。
//unoccupied:要不你和我一起？我想多抱会儿这只狗。
//Fantasy blue:可以，但我不能下车。
//到站提示音。
//unoccupied 拿出了几颗棉花糖。
//unoccupied:一起下车？
//Fantasy blue 迟疑了一下，最终还是接过了棉花糖，抱起狗子下了公交车。
//unoccupied:你不是不能下车？
//Fantasy blue:啊，等下你就知道为什么了。
//公交车， Fantasy blue 和狗子的身影逐渐变淡，不到一分钟就消失了。
//unoccupied:我好像明白了什么。
//记录结束。
//
//Hope white的一次采访记录。
//unoccupied:您好。
//Hope white:不用这样，不过，你为什么又来了？
//unoccupied:你是怎么知道的？
//Hope white:嗯……我这里有份…出入的资料？
//Hope white在背包里翻来翻去。
//Hope white:(清了清嗓子)咳咳，我想问你几个问题。
//Hope white:我很乐意回答，但在这里聊天可不是个好主意。
//unoccupied:(小声)不在这里等可碰不上你啊。
//正在开伞的Hope white转头看向unoccupied。
//Hope white:什么？我没有听清。
//unoccupied:没什么。
//开门的声音。
//Hope white 抖了抖伞，挂在了外面的窗台上。
//unoccupied在沙发上坐下，Hope white去厨房接了杯热水，和一杯桃子味汽水。
//Hope white:你要问什么？
//unoccupied:(喝了口热水)你知道这里的雨是怎么回事吗？
//Hope white沉默了一段时间。
//Hope white:雨是泪水。
//Hope white:雨下完后小镇就可以恢复，但我不能确定它以后会怎么样。至于恢复后还是不是黄昏，很难说。
//unoccupied:你曾经有只狗？
//Hope white:是的，是一只萨摩耶。
//unoccupied:那它现在在？
//Hope white垂下了眼眸，并没有回答，雨下的更大。
//unoccupied:很抱歉说这个。
//Hope white:(喝了口汽水)嗯，继续吗？
//unoccupied递给Hope white一块棉花糖。
//Hope white:(很自然的接过)我怎么可能吃这种东西呢。(咀嚼的声音)嗯..真不错，但我更喜欢汽水啦。
//unoccupied:你有没有想过，离开这里。
//Hope white:我离开不了，(低头喝饮料)我做过很多种尝试，当我以为我终于逃出去时，眨下眼睛就又回来了。无一例外。
//unoccupied:你见过这里放晴的样子？
//Hope white:我见过，她没见过。或者是，放晴后她就消失了。
//unoccupied:也就是，这种情况是可以变好的是吗？等等，你知道…
//Hope white:嗯，Fantasy blue么，我知道。
//unoccupied:那，那道光屏？
//Hope white:是记忆的分界线。
//unoccupied看着窗外雨势的变幻，站起身来。
//unoccupied:我想我明白了。
//unoccupied:谢谢你能接受采访，但现在我得走了。
//Hope white:我送你。
//Hope white顿了顿。
//Hope white:我曾把伞借给过一个M.E.G.的人，当我再次找到她..应该是她..我的伞在倒在一旁，她已经成了一摊…
//Hope white闭上了眼睛。
//记录结束。
//
//Hope white 第二次采访记录。
//unoccupied:你好。
//Hope white:这次是？
//unoccupied递上一瓶葡萄味汽水。
//unoccupied:是一个好东西。
//unoccupied拉开脚下黑色背包的拉链。
//unoccupied:你应该会喜欢？
//unoccupied蹲下身子，抱起一只刚断奶不久的小黑狗。
//Hope white:可爱，哦不，等等，你是从哪里得到它的？
//unoccupied:我在Level 0寻找流浪者的时候，发现了它。真可怜，就给你抱来了一只。小心点，我这可是违反规则的。
//unoccupied:只是可怜了这么小的一只狗。
//Hope white:断奶不久就切入到了这里..真可怜。
//Hope white:所以，你再次回来只为送我一只狗？
//unoccupied:对啊，等等，你知道切入？
//Hope white:从那什么M.E.G.手里抢的书。
//Hope white:还抢了个手机，和字典。毕竟我很无聊。
//Hope white将伞递给了unoccupied，抱起发颤的小狗，放在了照相馆。
//Hope white:我得去找个人。
//unoccupied:我可以一起吗？
//Hope white同意了。
//unoccupied跟着Hope white在雨下走了半小时，走到一颗树下时看到了抱着一团白色的人影。
//Fantasy blue:你来了？
//Hope white:我来了。
//Fantasy blue:我认为并没有结束。
//unoccupied举着伞愣在原地，不明所以的看向两人。
//Fantasy blue:但我想见见它晴天的样子。
//Hope white:我想结束，但我无能为力。
//Hope white走出伞下，雨水在她手里汇聚成一把手枪的样子。
//Fantasy blue:结束了。
//枪声响起。Fantasy blue倒下，又在接触地面的一瞬间变成淡蓝色雨水。
//unoccupied:结束了。
//unoccupied:果然我还是不能明白。
//雨在变淡，雨势在变小。
//Hope white:你不必明白。
//unoccupied:请不要谜语人。
//Hope white:(猛灌了一口汽水)Fantasy blue是我，我也是我。但这两个都不是我。
//unoccupied:那你在哪？
//Hope white:我是那只狗，白色的狗。9
//unoccupied:你已经死了，是么。
//Hope white:(喝完汽水)还说我是谜语人，你不也是吗？
//太阳逐渐从云层中出来，Hope white招手示意unoccupied跟上。
//unoccupied:我从未见过这里的太阳…等下，被感染的人怎么办？
//Hope white:那些人会消失，和Fantasy blue一样，变成普通的雨水。
//Hope white走到了居民楼后面的草坪上，蓝紫色的叶子显得格外突兀。
//Hope white:这就是我。
//unoccupied:你已经死了，是吗？
//unoccupied放下雨伞，和Hope white并排坐在草坪上。Hope white低着头，不说话。
//unoccupied:嗯..我也成谜语人了。
//Hope white依然没说话，眼眶无声的画出一滴透明的泪珠。
//记录结束。
//
//这是一个遗落在居民楼的一页日记。
//日期:哦该死，我好像又来这了，第几天了，十七天？
//
//天气:雨。有转阴的现象。
//
//我被这的天气影响的够糟了，记忆的影响让我无奈又气愤。你有什么资格篡改我的记忆。
//
//真不知道我写这日记干什么用。
//
//真不知道这怎么一个回事。
//
//外面的天气有转晴的现象。啧，它还能再怎么糟糕？
//
//今天太糟糕了，我唯一的朋友不记得我了，只想让我和他去淋雨，淋那该死的雨。
//
//我去他…唉，没人找我聊天了。
//
//我在这该死的层级快疯了。
//
//明天接着去公交车站牌等！我就看这信息是真是假！
//
//
//
//记忆让我抓狂。
//我该如何才能得到你的赞赏。
//
//
//-关闭
// 
//
//生存难度：
// 宜居
// 
// 
//我在这里，所以它便在。相信我，我会给你，你所需要的。所以，请不要离开我。
//
//描述
//jbGhFg.jpg
//这里放晴了。美丽吧。
//
//Level C-304是后室C层群的第304层。一座与前厅相似的小镇。在这里，偏激想法和情绪会被压制，但这并不意味着没有暴力。通常情况情绪会无故低落10，当这种现象超过一周时，情绪会通过任意事件爆发，“暴力”会通过眼眶以红色液体流出。情绪低落会在爆发后逐渐减弱，四次后会彻底消失，暴力的行为也会逐渐消失。离开该层级的半个月后恢复，但暴力倾向明显减弱。
//
//这里白天有固定不变的10个小时，夜晚有着纯白的“人造月亮”。云是普通的水凝物，雨也是普通的水珠，这里没有雪日，20°干燥舒爽的空气，不存在沙尘与雾霾。
//
//建筑及物资
//建筑围绕邮局扩散开，由近到远，装修程度会逐渐出现明显的差异。崭新和残破的建筑物随机分布。物资会出现在小镇各处。
//
//书店
//建造在曾经的照相馆上，书本由流浪者自主编制，发布。打印机留了下来，墨盒和A4纸可以自动填补。打印机所打印的东西为流浪者输入的东西。
//
//物资补助站
//是失去过同伴的流浪者建立的。他们搜集散落在不同地点的物资11，并将其免费提供给有需求的流浪者。Hope white也在此地帮忙。
//
//食品售卖站
//是曾经的小型超市。抽屉中的章鱼触手变成约20cm高的小人，黄色裙子红色画家帽。50cm的蓝色长发会在剪断后迅速恢复原样。
//
//货架上基础物资为各种口味的汽水，油腻的棉花糖，幸运豆奶其他有需要且普遍易获得的物资可以将样本放入抽屉中，章鱼会消失两至三天12，随后该物品会出现在货架上。
//
//餐厅
//厨房会出现食物的特性被保留了下来。一周有两道三次会提供食物原材料，不会出现已被做好的食物。
//
//公园
//有着宽50米的人工小湖，并没有观赏鱼，水源无法查明，似乎是无限的。池水自带清洁功能，用来清洗衣物则有着洗涤剂的效果。可饮用。
//
//沿着任意一条嵌有黑、白色鹅卵石的小道走，尽头均为小湖。白色石阶则通向圆木制小亭，中心圆桌上摆放着一小罐茶叶，茶叶品种未知，类乌龙。
//
//淡粉的花围绕着白色长椅开放。在长椅上捡到的花瓣泡水有凝神静气的作用。
//
//- 通过
//一间存放了深蓝色雨水的房间
//10×10米宽的房间只有单调的浅灰色墙壁，藏于中心邮局底下，入口被封锁，门的位置在天花板上。
//
//制造该房间的原意是为了研究雨水成分，但过后不久雨水却出现水位上涨的情况。
//饮用5ml，记忆会开始替换，一小时后会彻底忘记过去的记忆。饮用量与时间成反比，一次超过65ml会立即死亡。
//
//雨水具有自我清洁的功能。
//
//如果跳入雨水，则会在5分钟内完全融化在雨水里。13
//
//Wi-Fi
//很强的Wi-Fi覆盖此层级。
//
//实体
//Hope white一位16岁少女，披散着及肩的狼尾，黄色短袖，黑色阔腿裤。有一只黑色小狗。
//
//你可以信我。
//
//章鱼小人由章鱼触手变成，可从其他层级获取货物。每24小时会补一次货。将她杀死的5小时后，会有一只新的章鱼小人从抽屉中爬出，新的章鱼小人没有被杀的相关记忆。
//
//你不会想杀她的，对吧。
//
//哭猫
//仅有两只，为灰色哭猫和棕色哭猫。
//
//误入此曾经的实体。
//通常会在5分钟内消失。如果超出五分钟还没有消失的迹象，请拨打Hope white的电话。她会来处理。
//
//前哨和基地
//M.E.G.的C基地。
//有25个人
//资源补助站
//7个人，不包括Hope white。
//入口和出口
//入口
//在Level 11打开一扇破旧的门。
//在Level 18回想小时候的家园。
//出口
//找到一片草丛，靠近它并闭上眼睛，30s后会来到Level C-92。
//找到医院，在座椅上坐5分钟，起身后来到Level C-144。
//找到Hope white，她会带你离开。
//在公交车站牌等到一辆绿色公交车，站点为随机的已探测的安全的层级。
//作者信息
//« Level C-303 | Level C-304 | Level C-305 »
//
//脚注
//1. 如果融化穿透皮肤，会有红色血流出。
//2. 在雨下淋雨但不能被雨水侵蚀，记忆要处去自身记忆和外来记忆彻底融合未开始吞噬的阶段。“洗礼”必须漏出颈部，多余的地方也是可以的。这个过程是对血液的侵蚀，和精神上的强迫服从。
//3. 并非真正的漫步，包括探索与其他行为。
//4. 全裸也可，但胸膛必须露出。
//5. 抽屉宽三米，长一米。不幸的情况会被扯下头颅等部位。
//6. 包括听说，读本，幻想，梦境。
//7. 在后室出生或者失去前室记忆的人并不会受到影响。
//8. 在这个小镇中记忆有关的东西，而替代物是幻觉。
//9. 并不真是一只狗，这里有隐寓。一方面是狗死的时候我也死了。另一方面，狗也可以是希望。
//10. 只会在该层级有此情况，如果离开后没有减弱，请去看心里医生。
//11. 不包括食品售卖站和个人的物资。
//12. 和获得的难易程度成正比。
//13. 只可以融化具有记忆的人或物品。
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1304{}