//Level C-365
//评分: 
//+26
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//Level C-365是后室C层群的第365层。
//
//描述
//photo-1595757872761-992fd6d3ab25?ixlib=rb-1.2.1&dl=eddie-sundgren-Y90MI--vSuI-unsplash.jpg&q=80&fmt=jpg&crop=entropy&cs=tinysrgb
//层级内一座小山丘的照片。
//
//photo-1513628253939-010e64ac66cd?ixlib=rb-1.2.1&dl=guille-pozzi-sbcIAn4Mn14-unsplash.jpg&q=80&fmt=jpg&crop=entropy&cs=tinysrgb
//繁星点点的夜空。
//
//Level C-365是一块直径20千米的圆形草甸区域，区域边缘是繁茂且无法穿越的森林，试图强行穿越的流浪者会被传送至该层级的正对面。草甸大部分地区是平原，少部分是低矮的小山丘。层级内有一条由东向西方向贯穿整个草甸的小溪，小溪内的水含有剧毒物质，无法饮用。层级的中央区域是一块大平原，平原中央有一座小木屋。值得注意的是此层级没有任何的补给品，无法长时间停留。
//
//Level C-365内的气候十分舒适，气温维持在16℃-24℃之间，且均为晴朗天气。层级内按照4小时白天和12小时黑夜的规律循环，破晓时太阳会从北方升起，并从南方落下。夜幕降临后，清澈的夜空会布满点点的繁星，如同画一般的呈现在天空之上。
//
//层级内生长着茂盛的小草1和Level C-365内一种特有的发光植物：星光草。星光草在夜晚会发出不同颜色的光芒，如同夜空倒映在水面上一样绚丽。除此之外层级内并未发现其他的生命迹象。
//
//木屋
//木屋是该层级中央区域的一座木结构房屋，被24米×25米的方形篱笆围绕着，篱笆无法被破坏，木屋外墙没有做装饰。木屋内的装潢是20世纪90年代的风格，内部家具齐全且均可正常使用。屋内Wi-Fi信号良好，可以借此与外界沟通。
//
//木屋的客厅区域摆放着沙发和一台电视机，电视机可以正常打开但无信号。沙发上有流浪者发现过一篇手写的短篇小故事，似乎是原主人书写，目前此故事已被公开。客厅旁的厨房区域放置着一个食品储藏柜，但储藏柜是空的，没有任何补给也不会刷出补给。木屋的卧室区域有一张2.5米×3米的床，流浪者可以在上面休息。根据M.E.G.的调查记录，卧室的床可以让流浪者快速入睡，推测可能与床的材质有关。
//
//- 收起故事
//欢迎来到这里，亲爱的旅行者2。当你看到这篇故事的时候，我已经离开这里了，和我的爱人去其他地方生活了。这个地方有着我们两人的故事，有着星光草的故事。我这个人文笔比较拙劣，不太会表达，所以请大家看个大概就好。
//
//我还记得我第一次遇见她的时候，她深棕色的翩翩长发，蓝色的如同蓝宝石一般的眼睛深深的吸引着我，她很喜欢把左边耳朵旁的头发扎成一个小辫子，看起来非常特别，远远望去就像天使一般美丽。于是我开始追求她，只是我没想到事情是如此的顺利，就像上天的安排一样，我们顺利的走到了一起。
//
//我们的生活平淡无奇，过着重复但不无聊的日子，就这样过了好几年。有一天她抱来一颗小草，那小草是绿色的头上好像还有一颗软软的球，她说这东西很好看，当时我并没有太在意。直到那一天的晚上，我看到这颗草发出绚丽的橙色光芒，那种光芒非常的温暖，它的光芒照耀着我，让我回想起这几年简单的幸福生活。于是我跟她约定要把这种草种满草甸，我把这种草叫做星光草，因为它像星光一样美丽。
//
//不知道哪一天她发现了一颗蓝色的星光草，但是她没有告诉我，一直在偷偷的种下。在我生日的那天，她带我来到屋外，指引我看向一座小山丘，那上面鲜艳美丽的蓝色组成了一颗爱心的形状，非常的漂亮，就如同她蓝色的瞳孔一样。她说这是她送给我的生日礼物，我非常的开心，从身后抱住了她。那一刻，感觉太过美好。
//
//我们还是走到了这一天，准备结婚了，收拾好东西和心情，我们也离开了这里，重新面对喧嚣和未来，我想我们一定会白头到老。
//
//亲爱的旅行者，这就是我跟她相遇的故事，这就是这片星光草甸的背后故事。谢谢你能看完这一篇故事，这里的美丽是带不走的，所以请你们尽情享受美好的风景吧。如果你觉得不开心，就走到木屋外面，看向小山丘上的蓝色，那是永不言弃的蓝色，是和谐之下的蓝色，那耀眼的蓝色一定会让你感到温暖。
//
//祝你们玩的开心
//—JR
//
//- 收起故事
//星光草
//bokeh-1742113_960_720.jpg
//夜晚蓝色的星光草，虽然模糊但依然可以感受到它的光芒。
//
//星光草是Level C-365内一种特有的发光植物，由绿色的茎干和顶部散发着不同颜色光芒的绒毛球组成，绒毛球散发的光芒似乎有各种独特的效果。目前在层级内发现的星光草共有3个品种，不同品种的星光草高度以及绒毛球的颜色、光强各不相同，但绒毛球的大小是完全一致的。
//
//星光草茎干的韧性和强度都极高，无法被低温或高温损伤且试图弯曲、折断或用工具破坏茎干的行为均不会造成任何的效果。层级中的星光草无法被连根拔起但其顶部的绒毛球质地柔软且可以摘下，摘下之后的绒毛球会继续保持发光2个小时左右，随后便会迅速熄灭。被摘下绒毛球的星光草会在10分钟内迅速枯死，并在30分钟后重新长出一颗与原先外观一致的星光草。
//
//层级内的星光草主要分布在平原上，仅有一种生长在小山丘的山坡上，似乎是刻意种植的。平原上的星光草平均每平方米25颗左右，但不同品种的星光草分布有一定的差别。目前M.E.G.已证实该层级的星光草无法带出层级。
//
//M.E.G.的研究团队针对星光草的特性、外观、分布以及产生的特殊效果做了研究与分析，以下是星光草的研究报告。
//
//- 收起研究报告
//3个品种星光草的茎干部分直径均为1.5厘米左右，且无法被常规方式破坏，顶端的绒毛球是由茎干延伸上来的众多丝状植物纤维构成的球体，直径为3厘米左右。星光草在白天不会发光，仅在夜晚发光。研究发现白天时星光草的茎干会进行光合作用储存能量，夜晚时会将能量推送至顶端的绒毛球，能量会激活绒毛球内部一种未知的生化反应使绒毛球发出光芒。
//
//下列表格是3种星光草的具体研究数据：
//品种	外观与分布	特殊效果
//橙星光草	高度10厘米左右，发出橙色的光芒，亮度约20流明3，分布在平原区域，是层级中数量最多的一种星光草，每一块平原都有广泛分布。	橙星光草的光芒具有温度，在其周围区域的温度常年保持24℃。因为橙星光草数量众多，所以点亮了该层级的大部分区域。
//粉星光草	高度8厘米左右，发出粉红色的光芒，亮度约15流明，是层级内分布数量第二多的星光草，主要集中生长在几块较大的平原区域。	粉星光草散发的粉色光芒具有修复的效果，受伤的流浪者如果躺在粉星光草丛中入睡，在睡眠过程中可以快速修复伤口。但是此效果只对粉光可以照射到的部位有效，且有效范围只有光源10厘米以内。
//蓝星光草	高度16厘米，发出淡蓝色光芒，亮度约30流明左右，是三种星光草中亮度最高的，集中分布在木屋东北方向500米的一座小山丘的山坡上，组成了一颗爱心的形状。	蓝星光草的光芒有让人感到平和，安心的力量。所有流浪者都表示：他们躺在蓝星光草丛中时，感受到了温暖和甜蜜的感觉，就像和自己的爱人拥抱一样，望着淡蓝色的光芒就好像在看着自己爱人的眼睛，温柔又动人，很像自己热恋时的感觉。
//- 收起研究报告
//基地、前哨与社区
//M.E.G.星光草研究团队
//这是由8人组成的科研团队，团队内均为M.E.G.的植物学家。他们长期驻扎在层级内，定期会有M.E.G.的士兵给他们配送补给品。他们主要对星光草的生长特性和种植做研究。他们曾试图将星光草带出该层级进行种植，但以失败告终。
//繁星摄影团队
//此团队是由摄影爱好者们自发组织的摄影团队，目前有15人。他们在层级内拍摄星光草和其他各种景观，如夜空中的繁星等。进入该层级的流浪者如果想要拍照纪念可以联系繁星摄影团队，他们会为流浪者提供免费的拍摄服务。
//入口与出口
//入口
//在其他层级偶尔会出现一小块发着橙色光芒的草地，躺在草地上入睡即可来到该层级。
//M.E.G.经过调查证实进入该层级的流浪者在离开后，14天内无法再次进入该层级。
//
//出口
//摘下三颗相同颜色星光草的绒毛球，在绒毛球保持发光时握在手中入睡即可回到进入该层时的层级。
//来自一位流浪者的宣传
//你还在为每天面对可怕的实体感到恐慌吗？你还在为每天面对恶劣的环境感到无奈吗？Level C-365欢迎大家前来游玩，你只需要找到一块发光的草地，躺在上面安稳的睡一觉，就可以进来欣赏美景。这里有美丽的夜空，有优美的星光草，一定会让你感受到与众不同的心情！
//
//作者信息
//« Level C-364 | Level C-365 | Level C-366 »
//
//Footnotes
//1. 前厅中常见的小草，高度约3-4厘米。
//2. 因为是男主人第一视角，所以用了旅行者的称呼。
//3. 前厅中40瓦的白炽灯约400流明。
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1365{}