//Level C-316
//评分: 
//+6
//+
//–
//X
// 
//
//生存难度：
// 
// 
// 
//雨.jpg
//一名“对数尺”组织成员为Level C-316他眼中的Level C-316画的像
//
//Level C-316是后室C层群的第316层。
//
//描述：
//Level C-316无固定形态，现有的观测记录说明，无论Level C-316呈现出什么样的形态，其内部总是以未知方式在下着暴雨，雨水成分尚不可知，粗略计算每小时可降水50mm，不过经检测，雨水中有5%的成分是杏仁水。检测由来自多所大学的博士后和教授组成的名为“对数尺”的组织在他们建立的“雨伞(Umbrella)”实验室进行。目前该组织在多个层级中都建立了研究不同项目的实验室。“雨伞(Umbrella)”主要工作是研究如何提取和利用雨水中的杏仁水。Level C-316内部温度始终保持在15到20摄氏度，大多数情况下刮3到4级风。Wi-Fi信号强。有昼夜变化（个别情况除外），白昼13个小时，黑夜10个小时。
//
//
//
//Level C-316的形态在每人眼中都不一样，推测形态的决定因素是进入Level C-316时的心理和精神状态（部分观测记录见附录一）。虽然不同人眼中其形态不一，但其地形结构却始终不变（目前其地形结构尚未完全了解）。Level C-316中实体及其形态和实体数量也因人而异，推测原因与进入Level C-316时的情绪有关（部分观测记录见附录二），但只有接触雨水的时候有可能出现实体。另外，被观测的实体仅观测者可见且只能与观测者接触，实体受地形影响，非观测者的攻击可以使实体受伤但非观测者不会有任何物理上精神上的感觉。任何从外部带入Level C-316的物品都将保持原来的形态结构和功能。
//
//对数尺.jpg
//“对数尺”组织的标志
//
//
//此外，现有证据表明，暴露于Level C-316内的雨水中时，人会对Level C-316产生一股怀旧感，尽管这个人此前并未来过这个地方。人体皮肤暴露雨水中时多数情况下会变得悲伤且悲伤程度随暴露时间增加而增加，暴露在雨水中3小时，人会因心脏骤停而死。据“对数尺”成员回忆，暴露于雨水中时“熟悉但陌生的回忆会涌上心头”。拿雨伞或穿雨衣等通过防止皮肤直接接触雨水的方式可以避免这一现象，利用Level C-316内的地形挡雨也可。喝纯杏仁水也可短暂避免这一现象，但持续时间因人而异。另外，直接饮用雨水会导致器官衰竭死亡。
//
//
//
//
//
//
//- 附录一（形态观测报告）
//序号	姓名	进入Level C-316时的精神状态	眼中Level C-316的形态	具体特征
//1	约翰·███	近乎崩溃	镜子迷宫	由许多高大的镜子组成，地面是黑色地毯，天空常阴，有时会出现隐形的障碍，部分镜子为幻象
//2	史██	冷静	博物馆	灯光柔和，呈淡黄色，不知何处发出。天花板被一望无际黑暗代替，雨水从黑暗中降下，有时会出现隐形的障碍，部分展品是幻象
//3	马德罗·███	近乎崩溃	工厂厂房	面积极为庞大，有多种加工设备，没有屋顶，长期黑夜，有时会出现隐形的障碍，部分设备是幻象
//4	丹·████	冷静	森林公园	有人和车通行的道路，道路两旁种有多种常见行道树，每隔一段时间会开花结果，同时还有多种花草，有时会出现隐形的障碍，部分植物是幻象
//结论：每个人眼中Level C-316的形态不一。Level C-316的地形不会变化，但部分地形会迎合流浪者眼中Level C-316的形态而变得透明。推测雨水或空气中的某种物质有致幻作用，能够根据流浪者精神状态而改变其眼中Level C-316的形态，形态基本能导致产生该精神状态。
//- 附录二（实体观测报告）
//序号	姓名	进入Level C-316时的情绪	见到的实体特征	实体数量
//1	佐藤█	愤怒	1、手执武士刀，面戴恶鬼面具，身着江户时期武士服的人形生物，身高约3米，身材魁梧，实体表现出极大的杀人欲望，极度危险
//2、红色武士刀	极多
//2	西洛·████	轻度悲伤	1、竹骨油纸伞
//2、路灯下穿着棉布长袍打着伞的人形生物的背影，威胁程度低	较少
//3	艾伦·██	惊恐	1、没有皮肤，血肉裸露的四足爬行生物，威胁程度高
//2、生锈程度极高的左轮手枪，可正常射击	较多
//4	斯嘉丽·██████	舒畅	1、有雏菊图案的粉色雨衣	极少
//结论：Level C-316的雨水中可能含有某种物质能让人产生幻觉，出现实体，且接触幻觉时大脑会产生与实体接触的错觉。推测心脏骤停的原因为出现被实体杀死的幻觉导致惊吓过度。实体的数量和危险程度随情绪的激进而增加且出现实体的外观基本与该情绪在某种程度上相符。有报告称喝纯杏仁水可减少实体数量。
//- 附录三
//“雨伞(Umbrella)”实验室研究员████·████的实验日志
//
//
//3月9日
//先前的检验结果说明，雨水中有百分之五的成分是杏仁水，这次用蒸馏法尝试提纯，竟然炸了！看来常规的方式根本不能把他们提取出来，雨水的成分太复杂了，有好几种从未发现的元素，现在最大的难题就是把雨水中那那些带有负面效果的物质提取出来（真不知道雨神那帮家伙为什么想要这种物质），剩下的雨水虽然成分虽然复杂，但却对人没有害处，不过从这一步再到提取出纯杏仁水，仍然需要极其漫长的过程。
//
//
//7月19日
//成功了！终于成功了！雨水中令人伤心的物质提取出来了！从雨水中提取杏仁水的进程跨了一大步！整个小组都欢呼雀跃！看来今天晚上必须得开杯香槟了（如果有的话）！
//
//
//10月24日
//小鼠又死了，看来雨水中还有另一种物质能使生物死亡，尽管M.E.G.对这种物质展现出极高的兴趣，又给我们投了一大笔钱，但把它提取出来依旧很困难。上午头儿又来了，对我们发了一顿邪火，似乎是因为B.N.T.G.的人刚从他办公室出来吧。我们不得不加快研究速度了。
//
//
//12月2日
//设备又受潮了！真不知道雨神这帮人是怎么做的保护工作，真不应该把设备放他们那！不过这两天去雨神基地做实验的时候老感觉气氛跟我第一次来的时候不太一样，那死气沉沉的，我记得原来这里是有笑声的啊。还有，这的老人都去别的层了吗？
//
//
//12月16日
//该死，商场的货架上怎么摆着我们正在实验的提取杏仁水？目前还无法百分之百的确保它对人体无害，肯定是麦尔斯这个混蛋，要么就是他的走狗斯登干的！坐在高管的位子上颐养天年，没想到这样的勾当他也能干得出来！把我们提取的杏仁水摆在货架上卖给别人，等别人找上门他再把责任推给我们，他们就是这么赚钱的！得想个法子……
//
//
//12月23日
//可恶，艾德劳被抓了，得避避风头了……
//
//
//12月31日
//头儿给了我们一张该死的纸，他妈的，尽管这对实验的进展有着无比巨大的帮助，但，唉，好一个·“合作”。
//
//
//
//千万别喝████████牌的杏仁水！不要参加“雨夜”计划！
//
//- 附录四
//“雨夜”计划
//在雨中
//我们彷徨
//我们恐惧
//我们惊慌
//但
//人总是怀抱希望
//他人递来的一把伞
//是友情
//是亲情
//是爱情
//成为我们的志愿者吧
//成为他人的雨伞
//为人们遮风挡雨
//留下爱
//在这个雨夜
//（60岁以上者优先考虑）
//总负责人：斯登
//承办组织：M.E.G.“雨神”基地 , B.N.T.G.“欢声笑雨”杂货铺 ， 对数尺“雨伞”实验室
//
//- “雨夜”计划相关文件（需权限）
//项目名称：“雨夜”计划
//
//负责人：麦尔斯
//
//项目内容：测试提取杏仁水对人体的危害程度及雨水提取物的应用。步骤如下：
//1、在“欢声笑雨”杂货铺上架提取杏仁水，售卖提取杏仁水的部分利润作为“雨伞”实验室的经费。
//2、“雨神”基地负责定期以体检名义检测饮用者器官状态，检测报告交由“雨伞”实验室处理。
//3、志愿者将被带到“雨神”基地的武器研发部门实验室，测试雨水提取物武器的杀伤力。
//
//项目意义：此计划意义重大，对开发Level C-316内雨水有很大的促进作用，同时对M.E.G.在其他层级的探索提供了物质条件。
//
//基地前哨与社区
//“雨伞(Umbrella)”实验室：
//主要研究项目是提取和利用雨中的杏仁水
//由“对数尺”组织建立，是该组织最大的实验室
//监控室对所有人开放以便发现实体，保护人员安全
//配备多种重武器以应对多种多样的实体
//与M.E.G.关系良好，并受M.E.G.保护
//与B.N.T.G.商务往来频繁
//M.E.G.“雨神”基地：
//承担“雨伞(Umbrella)”实验室的安保任务
//面积大，是流浪者的庇护所，“雨伞(Umbrella)”实验室部分实验在此进行
//防雨设备齐全
//戒备森严，监控全方位覆盖
//定期开展体检
//“欢声笑雨”杂货铺：
//B.N.T.G.旗下的大型市场
//主要商品是雨具和杏仁水
//杏仁水储存量大
//入口与出口
//入口
//在Level C-323打开一座潮湿的木门可进入Level C-316
//跳进Level C-363中的一个湖泊有几率进入Level C-316
//尚未发现其他入口
//出口
//在雨水下暴露1小时有极小几率进入Level C-368
//尚未发现其他出口
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1316{}