//Level C-345
//评分: 
//+32
//+
//–
//X
//来自M.E.G.档案部的提醒
//本文档受不明模因影响而导致档案被多次篡改，谨择必要信息阅读。
//
// 
//
//生存难度：
//等级 3E
//
//不安全
//不稳定
//生存污染6lqYVowhyLHCEjk.jpg
//从Level C-345拍摄的一张照片。
//
//Level C-345是后室C层群的第345层。
//
//描述：
//Level C-345外观为一座大小无限的商场，但可探索范围较小，因为目前为止多数区域都被一种未知材质且无法破坏的警戒线包围了起来，任何试图穿过它们的流浪者都会切入一个未知层级。层级中的WIFI信号较好，可以在聊天区保持顺畅的信息传递。该层级的温度维持在26℃左右，进入此地的流浪者会感到空气闷热，因此在本层级中携带较多的杏仁水用以补充水分是必要的。
//
//特性：
//商场设施近似上世纪90年代的风格，设备齐全，你可以在该层级找到一些与前厅中品牌一致的店铺，但店铺中的货架上通常是空的。其中一些设备有着特殊的异常性质，它们将会与流浪者自发地交互，例如引诱流浪者进入一些店铺中的冰柜。这些冰柜通常使人出现类似找到出口的幻觉。流浪者靠近冰柜后，后者会自动打开，在吸引前者进入后关上，而进入的流浪者将会消失不见。进入后的流浪者尚不明确具体会发生什么，但大部分人认为，进入后其将会被冻死或者传送至其他层级。
//
//商场的电力与照明系统相当不稳定，并被以相当诡异的方式安置。天花板上的荧光灯时而成群出现，时而消失不见，并且照明亮度也强弱不一，为流浪者带来了极大的不便。路灯将会匪夷所思地随机出现在天花板上，但它们反而是本层级内照明最稳定的发光物件。除此之外，许许多多商场内的店铺也有着极为诡异的照明系统布置结构，有着店铺名称的牌子丝毫不会发光，但是店铺内一切反射率大于等于镜子的一切物件均会淡淡的发出黄色的光芒。部分店铺内通常播放着令人不安的歌曲，大部分流浪者将其描述为“虚无缥缈的女性声音”。若发现完全熄灭的荧光灯，请绕行，因为位于灯下的流浪者将有极高的概率会被头上掉落的灯击中头部。
//
//目前商场的层数并不确定，在商场大厅内抬头可以观察到大量相似楼层竖直向上排列，并无法计数。楼层间有标注有“小心地滑”字样的楼梯相接。直到现在，这些楼梯的材质仍然令人迷惑。据分析，这些楼梯的表面有一层类似于人类眼角膜第一层的上皮细胞层，这些上皮细胞一直保持活性并且可以进行再生，所以当楼梯表面受到磨损时，可通过细胞再生、周围正常细胞移行，恢复至原有的光滑状态。由于材质的光滑性，在楼梯上行走通常被认为是不可能的。目前，B.F.P.F.已经开始收集对楼梯材质并用于研究。
//
//在该层级落单并停留一段时间后，该层级的灯光会全部熄灭，此时的Level C-345是最危险的。在全黑中探索一段时间后，流浪者会到达一家明亮的，墙纸为粉色的儿童玩具店，玩具店的货架上摆满了各种较为沉重的毛绒玩具。在经过一段时间后，货架上的玩具会倒塌并且无法阻挡地压向流浪者。这会导致流浪者被压死或窒息。并且随后天花板将会下落并且砸向被掩埋的流浪者，绝大多数流浪者都无法在此情况下生还1。
//
//商场中存在少量表现为安全通道的随机可见非欧几里得空间，或将导致流浪者在商场中迷路，严重时将致使流浪者卡在墙中或是从空中摔落，因此流浪者在商场中探索时需多家小心。
//
//商场中约六分之一的区域充斥着大量无衣着的白色人体模特，与其交互会导致流浪者出现与上述冰柜幻觉一致的癔症。部分人体模特已被证实具有行动能力并对流浪者抱有敌意，暂不确定其为实体还是该层级的一部分。
//
//商场作为休息处的区域有时可以发现一些饮料机，尝试使饮料机电路短路将导致其随机掉落各种瓶装液体，其包括但不限于：“崂山可乐”、“健力宝”、“西红柿味尖叫”、“王老吉”、“五粮液”、“阿萨辛奶茶”、“旺仔牛奶”、液态蓝砂、“洁厕灵”2、“玻璃水”、“液态樟脑丸”、“罐装玛莎拉”、“蜘蛛饮料”、“塑料味杏仁水” 、“后室牌能量饮料”、“脑脊液”、“Level 0牌地毯风味饮料”、“别墅牌香烟饮品”。有些液体不能供于饮用，请流浪者务必留意。
//
//商场内确定没有售卖香烟的地方，不过商场的角落有一间卫生间大小的吸烟室。值得注意的是，吸烟室内仅有入口处有够一人站立的地面，其余地面以下均是深渊。
//未知的彩色烟雾在天花板顶端持续弥漫，经试验，少量的一氧化碳气体将会导致吸烟室天花板着火并燃烧约半小时。
//吸烟室的墙壁上半部分是棕色的，下半部分则为天蓝。四周墙面末端以下则是岩壁深渊且深不见底。
//如果有人在商场除吸烟室或卫生间外的其他区域吸烟，会被下意识地吸引到此室，接着失神地跳下去。
//
//实体：
//该层级中存在着一种身穿黑色长袍的特殊无面灵，它们似乎并不受人体模型的异常效应影响。它们会收集该层级中的人体模型并将后者塞入冰柜。被塞入冰柜的人体模型会融化，凝结成一块，随后该实体便会利用这块材料在该层级中心处的空旷地带搭建一种类似雕像的建筑，这似乎是某种仪式。
//
//在大多数店铺外的有许多外形为猫的毛绒玩具，它们的外壳通常具有高温，会灼伤一切靠近的流浪者，已被证实它们的外形在有实体附近徘徊时有极低概率会不定时变成狗的形状。因此尽可能的远离这些玩具是必要的行为。
//
//在该层级的一些地方总会时不时的发现一种用成块人类组织搭建而成的雕像。它们似乎不会腐烂，而且散发着一种让人眩晕的味道。M.E.G.已采集了这些人体组织样本送往基地进行生物学调查。3
//
//据称，在极少见的情况下有观测到已被记录在数据库中的部分友善实体，在该层级内有目的地行动中。
//
//鬼警会在本层级某些角落巡逻，寻找任何试图破坏商场设施的流浪者，并将他们带往逆志者之牢。
//
//恐惧怪兽似乎喜欢在该层的黑暗角落搜寻着什么。
//
//tePlFfkdH7azCBZ.jpg
//Level C-345警戒线旁一个狭小的区域。
//
//怀旧徘徊者
//一种人形实体，其表面覆盖了类似楼梯一样的眼角膜以及其他皮肤材质，但组成的十分扭曲，类似溶解了一般。其身躯各各部位都嵌入了不同的电器，包括电视、电话、录音机等。这些电器保持开启状态，电视内播放着20世纪20年代的老旧动画，但画面经常不间断性的出现错误雪花；电话保持响铃的状态，但时不时会被接通并播放失真严重的同时期4的音乐歌曲；录音机也时刻播报着那个年代的电台广播，但似乎有些内容遭到不知名的修改。怀旧徘徊者会颤抖着的在商场内部徘徊，一旦发现流浪者，其身上所有电器都会开始播放一段悠扬但失真的音乐并开始追击流浪者，在接触到流浪者时会将其抱起折断流浪者的脊椎。
//基地、前哨与社区
//M.E.G.（探险者总署）售货员前哨
//该前哨现仅有9人幸存，但M.E.G.在不断往此前哨派遣人员。
//会帮助所有来到该层级的流浪者离开该层级，并且提供杏仁水。
//他们正在尝试关闭该层级的入口。
//后室娱乐 “购物”共享前哨
//居住约2名人类成员和许多实体。
//有大量新品推荐员驻守在层级中向误入本层级的流浪者推销后室娱乐的新产品。
//有炫酷驾驶器的抽奖活动，于该层级购买后室娱乐的产品可进行抽奖，中奖概率为0.1%。
//B.F.P.F.临时样本采集站点
//人数通常保持在5人，每当样本采集足够将会交替人员。
//私下与M.E.G.幸存者达成共识，互相保护。
//这个站点已经在采集样本足够后搬离。
//入口与出口：
//入口
//进入Level 11中的写着“安心毛绒”的毛绒玩具商场会有概率到达此层级。
//在Level 33的服装店停留超过1个小时将到达此层级。
//在Level C-440中通过一个摆满空货架的房间将到达该层级。
//在Level C-151中，在卧室里找到一个毛绒玩具并抱住将到达该层级。
//在Level C-75中入眠并在梦中听到一阵古旧音乐的旋律时，将会在该层级苏醒。
//出口
//试着穿过警戒线，这会令流浪者切入一个随机层级。
//任何试图切出的行为都会有低概率导致流浪者掉入Level 1。
//进入一个名为派对用具的商铺会导致流浪者切入享乐层。
//在店铺内翻阅名为《重生之勇闯后室成为M.E.G.大哥》的书十分钟将会前往Level 153。
//进入层级的洗手间会到达Level C-57。
//在层级可探索区域边缘附近，从入口进入之后不间断行走约12千米时，流浪者有可能发现此前未发现的破坏性地穿过墙体的树根，在树根和墙体的夹角处切出有可能使流浪者进入一个存在大量树木的层级。
//进入该层级的儿童游乐区将会到达lavl c-☺。
//进入该层级的一扇写有“餐厅”的门会到达Level C-123。
//在一些特殊情况，即饮料机周围存在大量人体模特的情况下，流浪者有可能从饮料机中取出一个积满油垢的黑色铁锅，当流浪者与该铁锅交互时，有可能会将流浪者传送至Level C-98。
//错误的 Eorrorrrrrrrrrrrrrrrrrrrr。
//抓住店内的只有一半的地球仪，将会到达Level C-206。
//在卫生间内发现一个内部边壁类似人体组织的洞穴时，通过洞穴可以到达Level C-43。
//作者信息
//« Level C-344 | Level C-345 | Level C-346 »
//
//Footnotes
//1. 除非他们的衣物够结实。
//2. 但瓶子上却标识的是雪花啤酒。
//3. 注意：在一些情况下会出现雕像整体或部分丢失的情况，通常这种情况只会发生在有多名流浪者同时观察到雕像之后发生。流浪者批注：这不就是object C-26不腐烂版本吗
//4. 与电视动画同时期。
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1345{}