//Level C-391
//评分: 
//+7
//+
//–
//X
//Level C-391原本是一片荒地，在E.P.B.1等人类团体共同努力下，这里变成了绿洲，焕发了生机
// 
//
//层级属性：
//宜居
//富有生机
//和谐
//Level C-391是后室C层群的第391层。
//
//Level C-391是一片被荒地包裹的大绿洲，其内部极其富有生机，动植物繁荣，此层级的绿洲内还有三个湖泊，湖泊的水源已被确认为杏仁水，Level C-391一直保持永昼状态，类似前厅的11点钟，没有四季更替，绿洲部分气候宜人，天气会分为两种状态，晴天时温度保持在20摄氏度，下雨时温度保持在17摄氏度，此层级中心半径150公里内是富有生机的绿洲，愈在外面动植物愈少，最后变成一块沙石和野草组成的荒地，极为干旱，不会下雨，温度保持在30摄氏度，E.P.B.上级已经在此层级的绿洲建立基地。
//
//在此层级刚发现时，地形全是荒地，没有任何绿洲，也没有除了野草之外的动植物，E.P.B.发现此层级之后，也极少量派人去此地采矿，直到2022年5月17日，来自东北方向的季风吹了过来，同时过来的还有积雨云，随后此层级里下了一场微雨，第二天，等到E.P.B.干员查看情况时，发现此层级现在的湖泊处（原本是荒地）变成了一块小绿洲，有杏仁水湖泊以及没见过的动植物，E.P.B.干员向上级报告,得到上级的重视，鉴于这里气候宜人后宜居的条件和丰富的资源，E.P.B.上级决定在此层级东北部建立前哨，控制东北方向的季风和云，引来风和雨，改变此层级的生态，经过E.P.B.几十位成员和几只电仔的努力，使用科学武器（例如催雨弹、控风器)引来了“春雨”，不知为何，此层级的动植物生长很快，仅两个月时间后，此层级很大一部分就变成了绿洲，成为了现在生机勃勃的Level C-391随后,E.P.B.在此层级中心东北方向十公里建立了基地。
//
//- 点击隐藏记录
//(文中对话的是两名E.P.B.采矿员，为a和b)
//(记录者为E.P.B. a采矿员)
//
//a:这的资源还不少嘛，煤炭和石油都有
//
//b:可不是嘛，来这工作也很荣幸。
//
//a:呵呵，你不热吗？
//
//b:你这一说，还真挺热的，我才发现我出了大汗。
//
//a:那行，我给你去拿水壶，你喝点水。
//
//b:行
//
//a:wc，那怎么流下来水了？？
//
//b:？？？是不是水壶漏了？
//
//a:不是不是，还在那摆着呢，我出去看看。
//
//b:这好像是雨水……
//
//a:自信点，把好像去掉，这就是雨水,这干旱的鬼地方下雨了!!
//
//b:不能吧？我们出去看看走
//
//a:那快走
//
//b:这雨下的挺小的，只能说是微雨了
//
//a:我听说这层挺大的，要是都下雨的话，那也不小了。
//
//b:先回去吧
//
//过了几小时……
//
//a:这雨停了，咱们出去看看情况
//
//b:荒地里下这点雨，能有什么情况？
//
//a:嘿，我还真发现情况了，那是有一个绿洲?!
//
//b:别骗我，你出现幻觉了？
//
//a:你自己看
//
//b:真的有!!你看那儿，不光有湖泊，还有我们没见过的树!那还有一个颜色红色的树!(现已E.P.B.命名为彩枫)
//
//a:嗨，这树的果子还能吃，味道还很好。(果子为麦果树的果子)
//
//b:这还有一个杏仁水湖呢
//
//a:确实，我倒觉得我们可以改变这个层级的生态和气候
//
//b:你想啥呢？一场微雨就把你感动了?
//
//a:可这里突然出现一个绿洲，如果我们引来更多的"春雨"的话，那可能这个层级就会彻彻底底的改变
//
//b:可这……
//
//a:我们是见微知著的，我们已经见到“微”了，那就不能把“著”造出来？
//
//b:想法真奇特，行吧，我们给上级汇报去
//
//记录结束
//
//
//- 点击隐藏
//经过E.P.B.上级讨论，我们决定使用科技力量改变Level C-391的生态气候，有志者到这里报名参加行动
//相信，我们会改变这里的。
//
//由于未知原因，在雨后天晴的30分钟内，天空中一般情况下会出现彩虹，在此段时间，如果盯着彩虹，自己的身体将会充满生机，精神充沛，直至彩虹消失为止。E.P.B.调查未果。
//
//实体/物种
//无有害实体，但有动植物在此层级内活动，详见下表。
//
//植物类
//除前厅中热带雨林些许植物外，还有此层级的特殊植物，列表如下
//麦果树
//生长于此层级的湖泊旁，会结出此树的果子，可食用，树皮比较坚固，可以用于建造。已被E.P.B.养殖
//
//粘脂树
//生长于此层级的绿洲各地，树如其名，此树会分泌出粘性极强的树脂，这些树脂可以用于研究制造，已被E.P.B.养殖。
//
//彩枫
//极少量生长于此层级的绿洲各地，此植物的树叶颜色会变化，晴天时，树叶的颜色是红色，雨天时，树叶的颜色是绿色，雨过天晴后的30分钟内，树叶的颜色将会变得五彩缤纷，有很多颜色2一般情况下，越靠近树冠颜色越深。E.P.B.将其用于监测天气。
//
//动物类
//除前厅中热带雨林中的些许动物外，无其他动物。
//基地，前哨和社区
//E.P.B希冀基地
//E.P.B.Level C-391的总基地，监控整个层级，人数约110名E.P.B.成员，研究和利用这个层级里的资源，其内部由生活区，研究区，监测区，信息区和养殖区，以及一个仓库组成。
//
//E.P.B.季风前哨
//E.P.B.Level C-391控制监视整个层级的天气，然后报告给希冀基地，人数20名。
//
//后室环境公司前哨
//此团体的一个前哨，人数不明，但应该在20以下，与E.P.B.基地关系一般
//
//入口和出口
//入口
//从Level C-194西南方向45度角左右行走数十公里后，沙漠慢慢会变成荒地，继续往前走，等到沙漠离开你的视野之后，你就来到了Level C-391的荒地区域，而不是Level C-194.13
//在任意一个森林层级内找到一些荒地野草，在其附近切出，有几率来到Level C-391
//
//出口
//原路返回Level C-194
//从此层级的湖泊水底切出，有50%的几率来到Level 48。
//
//更多出入口待查。
//
//
//
//- 点击隐藏
//（记录开始时为雨天）
//
//我们拯救这个层级花了多少力？
//
//不知道啊！但我见过那时候的阵仗，几十名成员和几只电仔一起去这个里面长途跋涉，花了大劲，找到一个合适的地方，建立起一个前哨，然后使用一些科学武器，控风器造云器啥的，最终硬是造出来几大朵云朵，还搞来了风，发射催雨弹，来了雨，然后日夜不息的时刻监督此层级的变化，整个过程花了两个月吧……两个月后，这个层级的气候就差不多了……你可要知道，这是费了大劲的，那时候还有十几个人中暑了，顶着正午的阳光……
//
//再看看，现在一片生机，那是我们奋斗才换来的，为了E.P.B.，为了人类，为了创造更好的生态！那时候我们一直喊着“生机！生机！”一直奋斗着，期待着生机
//
//你看，雨过天晴了，出现彩虹了
//
//我们最终盼来了生机。
//
//Footnotes
//1. Electron Positive™ Particle Technology Co.,Ltd. of Backrooms，正电子™后室粒子科技有限公司，对外宣称目的是从微观视角探寻后室的本质。同时致力于特种工业产品制造与贩卖，分子科学、原子能、量子技术研究，资源探索与层级勘探工作等。目前成员人数不明。
//“整体大于部分之和。”
//2. 一般是红、橙、黄、绿、青、蓝、紫中的一个颜色
//3. 这个层级现在的编号是Level C-404
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1391{}