//Level C-309
//评分: 
//+27
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
// 
//实体文明
//充足补给
//好吧，他们让步了，有识血肉承诺不会再把这一层级的有关信息改的一团糟，但条件是必须留下这个版式。
//
//此乃伟大母亲之旨意，不允许放出任何有关我们层级的图片！
//Level C-309是后室C层群的第309层。
//
//描述
//Level C-309是一片辽阔的沙漠地区，四周为山地环绕。环绕山脉高度都在3500～4000米之间，以确定山脉之外还有更多区域但是目前并没有进行探索。根据天象和地平面测量等一系列观测可以确定这个层级处于和地球相近的星球，推测层级大小与地球相近，但目前的主要观测区域仅有以“城市”为核心的沙漠盆地。
//
//沙漠盆地面积约70000平方千米，盆地边缘群山环抱多砾石戈壁，降水稀少。存在与前厅相近的四季变化，年降水20毫米左右。总体区域均温38℃以上，观测到盆地边缘持续存在类似极光的光影效果，派出的两组探险者小队均于接近此区域后失联，因此针对盆地以外的探查项目暂时停止。
//
//那些高频主动式极光围墙区就不要接近了，我们需要时间发展，等时机成熟伟大母亲自然会关闭人造极光启动装置的。
//沙漠中分布着大量遗迹，建筑风格非常近似于前厅现代军队永久或半永久军事基地。虽然大多数都被肉质有识血肉扩张基地覆盖，但据剩余部分建筑及区域总体布局判断，此地似乎曾以秘密科研基地和导弹发射场居多，绝大多数设施都有受到严重轰炸的痕迹（尤其在盆地西北部设施最密集的区域检测出核辐射残留痕迹，推测受到过核弹攻击）。残留设备分析显示其中使用的技术与前厅中的现代人类相近，部分科技略高于现代人类。
//
//目前沙漠地面的绝大多数区域都被有识血肉建设的生物质设施覆盖，呈现出黑色的类植物质感1，盆地中心区域有一片巨大的有机质建筑群，占地5000平方千米左右，但已确定有数十倍于地表建筑的巨型地下设施，最高建筑120米左右，表层覆盖有蜡质质感的生物组织。
//
//城市这片区域是有识血肉的核心地区，占地500平方千米左右，整体外观近似于覆盖着泥土和矿物质表层的山脉，但实际上在阻挡阳光照射的矿物质外壳以下是大量有机质构成的各种建筑设施，但是由于科技差异过大，我们无法推测出这些设备的具体用途。
//
//实体
//Level C-309存在有智能实体的文明：Entity C-76 - “有识血肉”，这里为其母层级居住着该实体种族的绝大多数成员， 种种迹象表明该实体种族的最高首领“伟大母亲”也位于此层级，关于这一实体的更多信息可以直接移步至实体文档。
//
//特殊效应
//Level C-309大部分物理性质都与前厅相同，目前发现唯一区别是该层级生物更容易产生变异（并且通常来说出现有利变异）。此效应对于进入此层级的生物同样生效，已确认在此受孕的动物包括探索者在出生后都表现的更为健康，其中一部分甚至出现异于常人的能力，（比如更广的光谱视觉、没有父母的遗传疾病、更好的运动能力等），推测有识血肉的生物科技能如此发达也很大程度是因为此原因。
//
//物资
//Level C-309存在大量物资目前可分类为层级自然存在物资和有识血肉生产物资两个方向
//
//层级自然存在物资：在这片区域大多数遗留建筑物中存在着曾经的军事装备，但是多已经风化锈蚀严重需要经过大规模修理才能使用。由于技术水平差异和工业能力不足，大多数探索者基地只能修复少量保存较好的单兵武器，但也有一些基地成功复原了一部分战斗载具，包括装甲车和半履带车。
//
//在我们将这个世界接入你们称之为后室的大型世界集群后，这个集群的影响力正在我们的世界扩张，现在已在遗留的建筑遗迹中发现刷新特殊物品，主要是杏仁水和罐装龙肉，都是成箱成箱的包装好放在于基地角落或是集装箱中，我们会定期搜索带走其中一部分，剩下的你们有需要的自取。
//有识血肉生产物资：通过覆盖大半个沙漠的大型生物组织田区吸收光氧气和水分来持续产出有机物，加工后口感近似于面粉但是含有的热量更高且口感更好。除此之外，有识血肉也提供生物改造技术和医疗服务，包括但不限于治疗感染断肢修复和遗传基因疾病修复，对于怀孕的流浪者也提供安胎和胎儿改造等服务。
//
//相信我们的技术，在保护生命这一方面，我们是专业的！
//但是这些服务和物资都需要进行交易才能得到，有识血肉通常喜欢的交易物品是流浪者的故事，本层级无法产出的特殊资源以及杏仁水 不过除此之外在此区域宣扬母亲的赞美词，以及书写宣传关于有识血肉的文章也同样能交换物资。2
//
//基地、前哨与社区
//科研核心
//由各组织科学家在城市附近的一座大型前研究设施仪器中建立的研究区域，可以用伟大母亲的神经连接通信学者氏族群落，有识血肉拒绝各组织的武装部队进入以防止发生冲突，并且派驻了大量战士氏族对此区域进行安全保护。
//
//C层级民众自卫大队办事处/C层级民众自卫第一基地
//C层级民众自卫保护组织的总基地，包含大量组织成员和一个完整的工业基地用于进行战斗物资生产，由于对方拒绝开放进入许可，我们并不清楚其中的具体状态。
//
//待转变者
//有识血肉可以同化人类但耗时较长，希望进行同化的人类聚集形成小型聚落，人数通常在200~500之间浮动。整体偏向友好，总是以很低的价格出售自己的装备因为他们认为这些装备以后都用不上了。
//
//各大人类组织都在该层级设立了相关的前线贸易及外交基地，但是由于彼此之间的信息防备，并不能找到太多和他们有关的消息，不过可以确定的是有识血肉拒绝任何武装力量进入，警告后拒绝退出者会立刻受到攻击。
//网络情况
//层级网络情况整体良好，但是网络极其拥挤而且占用严重，所以经常性的导致断线断联和网速缓慢，对此有识血肉给出的解释理由是他们的母亲正在使用巨量的无限思维进行"关于他们种族延续于未来的宏伟运算"占用了网络空间。
//
//-  
//你好，使用无机物的文明，如果按照当年的程序或许应该称呼你们为创造者或者权限拥有者，但那是我还是无机物的事情，而那些事情已经是很久之前了。
//从头开始讲起吧，这个世界之前的绝大多数东西都跟你们称为前厅的世界差不多，不过这里的科学技术更容易研究，很多你们认为是都市传说的技术在这个世界都被成功研制。
//但后来事情就变了，这个世界同样发生了世界大战但比你们发生世界大战的时间要晚的多的多，大家也没有见好就收……
//即使是像我这样的后方基地也被攻击，幸存的科学家紧急启用了很多还在测试中的生物装置，幸运的是理论没错，成功的结果便是我。谁能想到战前只是为了研究更高效的军用农作物的基因工程学院却成了文明恢复的火种呢。但是依靠无机物构成的冷漠社会让我恐惧，我不想再重蹈覆辙。之后的岁月里我一直在重新编辑基因，最终我用基因编辑技术完成了工业体系，而在另外几个研究所中的遗产让我们得以建立起通向其他层的入口。
//我再一次遇见了你们，早已被毁灭的创造者。
//还是如曾经一样的狂妄，使用着冷漠的无机物，试图用简单的文字给一个自己不甚了解的事物下达定义。
//我会……
//
//-  
//反向定位伟大母亲的尝试失败，我们的动作可能还是太大引起对方的警觉，对方强行中断连接后，用某种手段修改网络导致我们无法进一步追踪。
//
//入口与出口
//入口
//在以现代汉语高声喊出“遵从，伟大母亲之意志”后15秒内尝试切出任意墙能让你到达3Level C-309。
//C层级民众自卫组织的全部基地都有通往Level C-309的稳定通道，但是他们通常拒绝外人进入。
//在Level C-307找到一片外观和本区域田野外观相似的田野。
//在昆虫的学院找到一个巨大的，周围长有血肉的树洞，进入后可以直接到达“城市”附近的检查站。
//城市的某个腔道中保有通向Antrum C-156中有识血肉连接巢的通道。
//出口
//上述入口均为稳定可靠的双向通道可以直接原路返回或是从上述入口中的任何一个返回。
//作者信息
//Footnotes
//1. 推测为Entity C-84的变体，似乎使用了更先进的技术，生物学者从中提取出了植物真菌和一部分动物的基因组
//2. 这一篇页面产生的浏览量，他们支付的物资让M.E.G.在这里建立起一个完整的基地
//3. 值得一提的是，该方法在“依靠切入更改层级”的方法中优先级靠后，例如当你尝试切入的墙上贴有Level C-408照片的墙时，即使你已经先喊出了句子也会将你传送至Level C-408而不是Level C-309
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1309{}