//Level C-369
//评分: 
//+33
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//Level C-369是后室C层群的第369层。
//
//描述
//Level C-369是一个面积约20平方米的酒店房间。其内部为现代简约装修风格，包括一个卧室兼书房和一个卫生间。卧室内有床、床头柜、冰箱、微波炉、电热壶等家具，同时有至少一个插座，处于通电状态。床头柜里应有至少4根不同类型的充电线，可以连接至插座为设备充电。冰箱内储存有足量速食食品与罐装杏仁水，消耗后会在1-2天内自动填补。卫生间内配备了沐浴露、洗发露等物品，但水龙头与淋浴头无法出水。该层级内有较好的Wi-Fi信号覆盖。
//
//Level C-369内有一面巨大的落地窗，透过其可以看到一栋巨大的公寓楼。该楼层的边际无法以肉眼观察到，疑似向四周无限延伸。推测该公寓楼为Level 13或其他相似层级的一部分。
//
//Level C-369疑似漂浮在空中，从落地窗无法看到其自身所在建筑的景象。
//
//Level C-369可能由多个类似这样的房间组成，流浪者无法在其中相遇。
//
//Level C-369内可能存在一种特殊效应：在该层级内的流浪者无法通过网络与他人交流。然而其在网络上留下的数据真实可查，现推测为某种覆盖全后室的心理屏蔽效应。该效应会在一段时间后解除。其产生原因与解除原因皆未知。
//
//基地、前哨与社区
//本层级不存在任何基地、前哨或社区。
//
//入口与出口
//入口
//进入Level C-114中的某个盥洗室。
//可能存在更多入口，但目前未知。
//
//出口
//未知。
//附件
//验证通过
//M.E.G先锋者论坛备份_2021_3_17_22_53_41_A8826BOI03
//讨论串标题：新层级
//讨论串状态：已删除
//讨论串创立者：用户Cyer_K
//讨论串创立时间：2019年8月5日16时39分04秒
//最后回复：2021年3月17日22时50分34秒
//
//>>用户：Cyer_K
//嘿，兄弟们，不得了了。
//我发现了一个新层级。
//A类移动设备   发表于 590天前
//>>用户：Cyer_K
//我先说一下我是怎么进来的，呃，就是我原本是在医院里的，打算白嫖一点杏仁水。然后我就去了一个卫生间上厕所。
//
//我推开一个隔间门，然后我就切进这里了。
//A类移动设备   发表于 590天前
//>>用户：Cyer_K
//还没人，那我先描述一下这里的样子。我也不太确定这是不是新层级，我还没发现过新层级。到这儿之后我先去资料库检索了一下，感觉没有哪个很符合我这里的样子。
//
//这里长得像个宾馆房间，有一个卧室，还有洗手间。我在前厅都没住过条件这么好的宾馆，这里旁边还有个电冰箱，里面装满了饮料和快餐，感觉很nice啊。
//
//有一说一，我最开始还以为我切到Level 5之类的地方了，毕竟这种宾馆在后室挺常见的。但是兄弟们，看看这个：
//A类移动设备   发表于 590天前
//>>用户：Cyer_K
//           FmG8VdOXPM6QvZL.jpg
//           A类移动设备   发表于 590天前
//>>用户：Cyer_K
//真的牛批。我从这里的落地窗往外拍到的。
//
//我感觉我在的这个房间在很高层。从窗户往外上下左右看都是这种楼，简直就像是tm无限延伸的一样，神了奇了。
//A类移动设备   发表于 590天前
//>>用户：Cyer_K
//我试了一下，这里的窗户和门都打不开。窗户好像是防爆的还是啥，用这里床头的烟灰缸也砸不开缝。
//
//从窗户往上下左右看都看不到我这边有什么东西。遮雨棚啊之类的。我都不确定我是不是也在一个像对面那栋楼一样的楼里。
//
//说不定我这个房间是浮空的？
//A类移动设备   发表于 590天前
//>>用户：Cyer_K
//这都十分钟了怎么还没回复？我tm不会断网了吧，我看这里wifi满级啊。
//A类移动设备   发表于 590天前
//>>用户：Cyer_K
//不会啊，我刚刚又刷新了一下论坛，资料库什么的也都能连的上。
//
//搞嘛，我命令你们速速回复我。
//A类移动设备   发表于 590天前
//>>用户：Cyer_K
//顶。
//A类移动设备   发表于 590天前
//>>用户：Cyer_K
//顶。
//A类移动设备   发表于 590天前
//>>用户：Cyer_K
//顶。
//A类移动设备   发表于 590天前
//>>用户：Cyer_K
//？神经病吧，我又发了几个帖子也没人回，在论坛又回了几贴也没人回，这tm是单机论坛？
//
//爱咋咋地吧，我先睡一觉。这里环境这么好，不睡可惜了。
//A类移动设备   发表于 590天前
//>>用户：Cyer_K
//早上七点准时起来，这jb帖子还是没人回。
//A类移动设备   发表于 589天前
//>>用户：Cyer_K
//现在是中午12点20分。我坐在床头想了一会儿，我觉得我知道是怎么回事了。
//
//这个地方有什么异常能影响到我的网络。我只能得到这个结论了。我上网完全没问题，还可以看到最新的发帖。这里的wifi一直是满格，所以我只能猜这个地方有什么邪门的干扰力让别人看不到我的发言。
//
//这听着也太扯淡了，我自己都不信。这个房间还能影响到这么细节的东西？难道我上的一直都是什么镜像网站？
//
//没道理啊。
//A类移动设备   发表于 589天前
//>>用户：Cyer_K
//我把这里都搜了一遍。床头柜里有四根充电线，还有插座可以插，所以我暂时还不会陷入断网危机。冰箱里面的罐装饮料我尝了一听，就是普通的杏仁水。快餐都是那种加热即食的，我用冰箱旁边的微波炉转了一个，味道还不错。卫生间里有两小瓶沐浴露和洗发露，还有一个莲蓬头。但是水龙头和淋浴间都没水。
//
//我现在要想想怎么能离开这里了。我已经看外面那些大楼看烦了。
//
//说起这个，顺便说一下我的猜测：我觉得对面那个大楼应该是个类似Level 13或者差不多的楼层的地方。我能看到那里面偶尔有人影晃荡，但是我看不清。
//
//我跟他们离得太远了，打光、大叫、砸窗户都没什么用。见鬼的防爆玻璃。
//A类移动设备   发表于 589天前
//>>用户：Cyer_K
//操，我感觉事情有点严重了。
//
//我根本切不出去，我都撞墙撞地板搞得自己划伤了。根本不行。
//
//这里的门也打不开，纹丝不动的。这破jb门简直跟门框粘死了一样，我连个缝都看不见。也没有锁眼，不会还是个电子门吧？？
//
//叼你妈的，我再想想办法。
//A类移动设备   发表于 589天前
//>>用户：Cyer_K
//我把烟灰缸砸碎了，但是窗户上还是没缝隙。
//
//见了鬼了，我先歇会儿。
//
//他妈的，这怎么办啊？？
//A类移动设备   发表于 589天前
//>>用户：Cyer_K
//熬夜看完了《神威小福龙》。妈的，感觉好烦，完全睡不着觉。
//A类移动设备   发表于 588天前
//>>用户：Cyer_K
//起了。话说这地方居然还有昼夜变化。
//A类移动设备   发表于 588天前
//>>用户：Cyer_K
//拿这里的热水壶砸窗户。没用。热水壶砸凹了。
//A类移动设备   发表于 588天前
//>>用户：Cyer_K
//我看了对面的大楼好久。隔着这么远根本看不清人的活动，但我觉得那里肯定住着什么人。直觉。
//
//我突然很好奇，以前有人来到这里吗？和我一样从Level C-114进来，或者还有什么别的鬼办法进来？
//
//我真想知道他们是怎么出去的。不会死在这儿了吧？没看到尸体啊。
//A类移动设备   发表于 588天前
//>>用户：Cyer_K
//在这里的第三天。我感觉我快发疯了，除了看手机就是吃饭睡觉。幸亏这里还有电。
//A类移动设备   发表于 587天前
//>>用户：Cyer_K
//好消息，冰箱里的杏仁水和快餐真的会刷新，就像Level 283里的炸薯条一样。
//
//真怀念我在那里的时候。当时那儿还有几个小丑呢，现在这儿连个实体都没有。
//A类移动设备   发表于 587天前
//>>用户：Cyer_K
//砸窗户，无果。
//
//我之前还担心全身砸上去会掉下去摔死，现在看来完全就是白操心。这窗户比铁板还硬。
//A类移动设备   发表于 587天前
//>>用户：Cyer_K
//有人能回复我一下吗？好无聊。
//
//我感觉好像我死了一样，根本没人理我。
//A类移动设备   发表于 585天前
//>>用户：Cyer_K
//傻逼。
//A类移动设备   发表于 585天前
//>>用户：Cyer_K
//傻逼。
//A类移动设备   发表于 585天前
//>>用户：Cyer_K
//不i阿苏一定要苦功夫耶娃古毕沙罗干哈库布里克
//A类移动设备   发表于 584天前
//>>用户：Cyer_K
//嘟嘟嘟嘟嘟嘟嘟嘟嘟
//A类移动设备   发表于 584天前
//>>用户：Cyer_K
//反正没人看，我说点不能说的。
//
//我喜欢Olivia好久了。就是那个常驻在Level C-8的瑞典姑娘，我也不知道她姓什么。
//
//她真的很漂亮，又很温柔。每次跟她相处的时候都很愉快。那是个单纯的傻姑娘。如果我在前厅遇到她，我肯定会试图追求她的。
//A类移动设备   发表于 584天前
//>>用户：Cyer_K
//为什么在后室就不能追求她呢？我记得也有很多人在这里结婚生子。
//
//从这里出去之后我就要向她求婚。失败了也无所谓，至少要尝试一下。
//A类移动设备   发表于 583天前
//>>用户：Cyer_K
//Olivia！我应该怎么追求你呢？
//
//哈哈，我以前可不敢在论坛说这些。随便了。
//
//今天我要把《黑暗君主》看完。
//A类移动设备   发表于 582天前
//>>用户：Cyer_K
//好无聊。aabbccdd。
//A类移动设备   发表于 581天前
//>>用户：Cyer_K
//傻逼M.E.G.。傻逼B.N.T.G.。傻逼蒙面女郎。傻逼B.F.P.F.。傻逼龙血族。傻逼U.E.C.。傻逼古老一族。
//A类移动设备   发表于 580天前
//>>用户：Cyer_K
//我已经尽可能地把每种食物都吃一遍了。我都快吃吐了。呕呕呕。快餐都是重复的。
//A类移动设备   发表于 578天前
//>>用户：Cyer_K
//我感觉身上黏糊糊的。我用杏仁水给我洗了个澡。这一次把冰箱里的都用完了，不过不久还会补充上吧。
//
//哈哈，真奢侈。
//A类移动设备   发表于 575天前
//>>用户：Cyer_K
//我想上Olivia。
//
//把她的工作服扒光，摁在桌子上，抓住她的辫子。
//
//我想听她一边喘息一边说我爱你。操。
//
//幸亏我还能看片。
//A类移动设备   发表于 574天前
//>>用户：Cyer_K
//为什么我还要在这个傻逼帖子里不停地回帖？又没人看得见。
//A类移动设备   发表于 572天前
//>>用户：Cyer_K
//嗨。
//A类移动设备   发表于 457天前
//>>用户：Cyer_K
//老兄，我看到你的帖子了！等着我，我马上就带着M.E.G.的人去救你！
//A类移动设备   发表于 454天前
//>>用户：Cyer_K
//真的吗？太好了！谢天谢地你们会来，我就知道的。
//A类移动设备   发表于 454天前
//>>用户：Cyer_K
//当然了，M.E.G.不会抛弃任何人！
//A类移动设备   发表于 454天前
//>>用户：Cyer_K
//当然不会！哈哈哈
//A类移动设备   发表于 453天前
//>>用户：Cyer_K
//操你妈。
//A类移动设备   发表于 450天前
//>>用户：Cyer_K
//还有人吗？
//A类移动设备   发表于 392天前
//>>用户：Cyer_K
//我感觉我的手机快要坏了。可能是我一天到晚都在用它的缘故？我不太懂这个。
//
//它一打开就烫的不行，真该死。
//A类移动设备   发表于 377天前
//>>用户：walkintome
//？
//PC端   发表于 17分钟前
//>>用户：walkintome
//为什么一个新帖会有这么多回复？
//PC端   发表于 17分钟前
//>>用户：walkintome
//我操？
//PC端   发表于 17分钟前
//>>用户：SCIENCE_RYA
//这是啥？
//A类移动设备   发表于 17分钟前
//>>用户：walkintome
//你还活着吗？
//PC端   发表于 17分钟前
//>>用户：joker01725
//什么东西。
//C类移动设备   发表于 16分钟前
//>>用户：SCIENCE_RYA
//我操，好tm吓人，人还好吗？
//PC端   发表于 16分钟前
//>>用户：11SoraDK
//这是一个恐怖故事吗？我刚刚从我的主页上刷到的。为什么是一年前的？
//A类移动设备   发表于 16分钟前
//>>用户：walkintome
//如果你还能上网，回复我一下。
//PC端   发表于 16分钟前
//>>用户：Kevin_007
//真他妈邪门。我以前从来没见过这条帖子。
//B类移动设备   发表于 16分钟前
//>>用户：callmeWil
//有人认识他吗？
//A类移动设备   发表于 15分钟前
//>>用户：joker01725
//所以，他现在还活着？
//C类移动设备   发表于 15分钟前
//>>管理员：EveSOI已封锁本贴。
//
//>>系统提示：本贴已移入待删除界面。仅管理员可查看。
//
//
//按照规定，本备份离删除还有：04小时36分07秒
//作者
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1369{}