//Level C-338
//评分: 
//+9
//+
//–
//X
// 
//
//生存难度：
//等级 3
//
// 
// 
// 
//Level C-338是后室C层群中的第338层。
//
//8a0c7605f06544768aeffe5ee3e17fe4-2.jpg
//Level C-338中的一个较小架子
//
//描述
//Level C-338是一座面积约为8123平方米，5米高，且墙面及天花板分布有耀眼白色发光点的虚拟货币矿场，其中至少有9000台的挖矿设备，但是矿机数量不是固定的，其会以崩坏或生成的方式改变数量，2009年5月30日刚刚被流浪者发现时，他们在这里建立了基地，此时这里有约3000台矿机。但当2015年M.E.G.入驻并记录矿机数量时发现，全年这里的矿机没有超过4台。
//
//本层级中所有矿机都被整齐的摆放在金属架子上，架子数量随矿机变化，且架子会随着流浪者的深入逐渐扭曲，最终变成由灰色未知物质制成的且以违背前厅物理学方式搭建起的巨大平台，流浪者爬上去并尝试切出平台会离开此层级到达Level 11。
//
//如果在本层前进了主观上“足够远”的距离，你会看见一张被涂黑的纸，上面的内容无法辨认，但是在背面写着一句话：普天之下，皆为利兮。买鹿之谋，皆罔顾兮？如果看见这句话的的人曾做过“见小利而忘大义”的事，会立刻头痛欲裂并大喊罪人知罪！望上神饶命。如果此人真的诚心悔改，会在消失一半的肝，一个肾，一只眼睛后晕倒，随后会被一在未知地方出现的着明代道士袍的无面灵喂下一瓶杏仁水后苏醒，期间任何人员无法靠近此人附近约30米的范围，直到此人苏醒。如果没有做过此等不义之举，则会感觉到强烈的不安和心悸，有一种“被金钱吞噬”的感觉，但不会造成心灵危害，而且根据部分回访调查所知，进入过本层级的流浪者在之后的3-6个月内均乐于施舍和帮助他人，对过度使用或者老旧物品极其厌恶。
//
//与前厅噪声巨大的虚拟货币矿场不同的是，这里的声音只有未知来源的34分贝的风扇轰鸣声。矿机外观与前厅中显卡外观类似，而且其不是由任何已知物质组成的，但是极其韧性极高，硬度极大，除非经连接缝拆开，否则无法破坏。
//
//这些矿机曾被拆解过，里面的芯片中只有理论上不可能存在的HeO,经检测这种呈现金属状态的物质电阻为0。但是当尝试使用它时，其发生了巨大的爆炸，最后在地上留下了发光的字可究其物理而不可妄用，而且当携带此物质时被发现无法离开本层级，即使携带显卡离开也无法获取此物质。
//
//为探究其原因，一些矿机被带出此层级，而它们全部变成了腰果水蒸汽。
//
//但是M.E.G.以太坊基地的所有驻员，都称本层级“越来越热”，但是本层温度计显示温度始终为25摄氏度，原因未知。2019年12月以来，本层级温度大幅上涨，随后停止，最终温度为40摄氏度。目前已强制要求全部人员撤出本层级。
//
//根据2019年12月以来进入后室的流浪者所称，前厅爆发了“矿潮”，大量显卡被用于获取ETH，推测这就是温度上涨的原因。
//
//本层级已被报告的实体只有无面灵，它们会定期出现并维护矿机，推测这就是矿场能够无能源运作的原因。这些无面灵是无害的，请不要伤害以及干扰它们，否则你会被它们丢进Level 75。
//
//基地、前哨与社区
//M.E.G. 以太坊基地
//这里有约7人负责记录矿机变化情况并且负责保卫此基地，以及帮助误入的流浪者。已全部撤出。
//
//入口与出口
//出口
//攻击或干扰此层级中无面灵被丢入Level 75。
//喝10L以上杏仁水并安稳睡去以到达Level 46。
//切入灰色平台会被传送到Level 11的楼顶上。
//在此层级中找到名为Level C-339光线路径计算卡的矿机并尝试用血液清洗它的PCIE接口会使你掉出本层地板进入Level C-339的任意位置。
//入口
//在Level 92中找到一扇发出微弱白光的门并进入以到达本层级的随机位置。1
//在Level 11中找到一个发出巨大轰鸣声的大门进入以到达本层级。
//在Level C-337中使用刻有“ETH”字样的望远镜观察星座，会在受到星座影响后到达本层级。2020年初此望远镜被发现卡在离地面约7000米处的高空，无法使用，此进入方法失效。
//在Level 1中找到一块贴有”588“字样的纸条的老旧显卡默念”我需要ETH“后静坐三秒即可被传送到本层级的某安全位置。
//作者信息
//« Level C-337 | Level C-338 | Level C-339 »
//
//Footnotes
//1. 不会砸在无面灵头上或卡入墙体。
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1338{}