//Level C-398
//评分: 
//+18
//+
//–
//X
// 
//
//生存难度：
//
//等级 变化
//
//不安全
//信号屏蔽
//环境恶劣且变化莫测
//Level C-398是后室C层群的第398层。
//
//描述
//Level C-398整体表现为一处石灰岩洞穴，其内部道路崎岖，且空气浑浊，少有通风处，气温也极低，任何不携带保暖措施进入该层级的行为都会使流浪者发生低温现象并死去。所有电子仪器也在这一层中全部失效。当流浪者进入该层级后，会发现后方的路被落石堵死，据M.E.G.探测，发现该洞穴大致为喀斯特地貌，且其因地面溶蚀面积过而大造成渗穴现象，导致大量落石在洞穴内部坍塌，目前M.E.G.已收到超过10例流浪者因落石掉落而死亡的报告，所以请流浪者在勘察该层时做好充足的准备。在洞穴内部还发现少量的石英，铁，铝的氧化物与人为开采的痕迹，有人提出该洞穴前身应为私人矿洞，但M.E.G.还未进行证实。
//
//photo-1584079247326-05f7001058ee?ixlib=rb-1.2.1&dl=jed-owen-uqSzeZMbd_0-unsplash.jpg&q=80&fmt=jpg&crop=entropy&cs=tinysrgb
//目前唯一一张有关Level C-398的照片，位于洞穴瀑布附近。
//
//目前M.E.G.已发现该层级与Level C-415一样，不遵循任何时空的标准模型，而是以非线性方式弯曲和扭曲。因此，各人很可能会发现自己离他们进入的地点不远。迷失在 Level C-398的人也经常观察到似乎违反已知物理定律的不合逻辑或其他异常特征。具体表现为有个别石块悬浮在空中，流浪者靠近这种石块时也会随之漂浮，且无法恢复原样，直至被洞顶异常尖锐的鹅管与石笋刺穿而死亡。
//
//同时，该层级中的空间大小也在不断的变化，其地貌也会随之改变，曾有记录说有一群流浪者在探索洞穴时被变化中的石壁挤压而死，目前M.E.G.已发现该层级唯一不会变化的地方为一处洞穴瀑布，现以将其作为基地使用，这里是洞穴内唯一的水源，但水中钙镁元素超标，只能在蒸馏后饮用。虽然上文提到该层级是一个石灰岩洞穴，但越往深处探索会发现该层级由不同类型的岩石组成，其占据主要部分的则是浅灰砂岩。有人曾尝试想用炸药炸开墙壁来逃出该层，但这么做只造成了洞穴更为严重的坍塌，任何想要炸开墙壁的行为都是不明智且被严厉禁止的。
//
//在Level C-398中没有任何的光照来源，M.E.G.曾试图在墙壁上装上洞穴探照灯以便于其他流浪者进行探索，但在灯安装后不过1天时间就会受到未知力量而破坏。
//
//流浪者在该层探索中会发现有许多的分洞穴，但里面大多通往的的是死路，只有少部分有极为狭窄的狗洞可令流浪者通行，这些狗洞宽度一般不超过1米，流浪者在里面爬行时洞中还会渗水出来并导致流浪者窒息，有流浪者曾报告说他们在爬行过程中发现远处有微弱的光亮，但都因狗洞的长度未知导致体力耗尽而未能达到光亮处。幽闭恐惧症的现象时常出现在正在狗洞中的人身上，除非流浪者的心理素质过硬，否则盲目进入狗洞的行为都是不明智的。
//
//实体
//目前该层中只发现了蝙蝠这一实体，暂未有任何目击其他实体的报告。它们大量的栖息在洞穴顶部，但这些蝙蝠似乎比在前厅中的更具有攻击力，且很容易被流浪者的灯光所激怒，一旦它们被激怒后，会立即从四面八方抓挠流浪者的裸露的皮肤与头发，所有被抓伤的流浪者都会在30分钟后毒性发作而死，表现为嘴唇全紫并肤色发青，他们的尸体皮肤表面也会分泌出毒素，一旦有其他有流浪者接触这些毒素，它们同样也会在30分钟后死去，服用杏仁水也无法治疗这一情况。
//
//基地、前哨与社区
//M.E.G.渗穴探索者基地
//约有十名经验丰富的洞穴探险家。
//位于该层假定的中心：洞穴瀑布旁。
//提供帮助。
//救助受伤的流浪者。
//入口与出口
//入口
//如果你在Level C-296中探索时找到地板上的一个缺口，跳进去就有可能来到这里。
//喝下一口Level 27中的泉水，就会直接出现在该层的洞穴瀑布附近。
//有人曾在Level 197探索时意外切入了地面后就来到了这里。
//出口
//曾报道有一群流浪者在入口附近开凿出了一个洞口，有人切入进去后来到了Level C-415，但在切入两人之后洞口便坍塌了。
//潜入洞穴瀑布约80米左右的距离，有可能来到Level C-230。
//在洞穴变化时切入地面，就有可能来到Level 132。
//走进一个在洞穴崩塌后才出现的洞口可以直接来到Level 75。
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1398{}