//Level C-321
//评分: 
//+9
//+
//–
//X
// 
//
//生存难度：
//等级 3
//
// 
// 
// 
//photo-1517588978316-1cebd2151f37?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1780&q=80
//Level C-321的照片。
//
//Level C-321是后室层群C的第321层，该层级表现为一座无限大的地铁站。
//
//描述：
//Level C-321虽然酷似地铁站，但该层级中却没有任何类似候车处或是地铁铁道的结构，该层级仅有无数的过道与空房间，过道的墙上通常会挂有一幅前厅中的城市铁路地图。
//
//一些较为空旷的走廊中央一般会摆有一两张长椅，通常可以在长椅上找到一两张印有乱码的报纸或是装在纸袋里的杏仁水。在Level C-321探索一段时间后可能会到达警戒区。
//
//警戒区
//警戒区内灯光较为昏暗，是Level C-321中最危险的部分，你可以通过深入一些地上画有警戒线的走廊进入。
//
//警戒区中存在着多种危险实体，如窃皮者，钝人，具有强烈攻击欲望的无面灵等，它们不知为何无法离开警戒区。这些实体大部分都有着一定的异常效应，如曾有流浪者报告称在被一只无面灵追逐时，后者突然发出机械声，然后迅速缩小变成了一台照相机。该层级内异常效应运作的原理及规律尚不得知。
//
//警戒区的管辖权现在属于红星建筑队的“金网”部门，他们会帮助你离开这一区域。
//
//基地，前哨和社区
//红星建筑队 “金网”部门
//space-5445572_960_720.jpg
//金网的其中一个基地入口。
//
//“金网”是1993年时从红星建筑队中分裂出的一个子组织，该组织有着独立于红星建筑队的运行系统及决策权，但仍在名义上隶属于红星建筑队。
//
//金网的前身是红星建筑队于1990年成立的金网调查队，该调查队由以胡竞为首的十五名成员组成。金网在1991年调查Level C-321时与红星的建筑部门起了冲突，后者认为该层级坏境较为稳定，消除警戒区内的异常后稍加改造便可成为宜居层级，但前者认为该层级中的异常实体有较大的研究价值，应保留。
//
//前任红星领导人李师同意胡竞带领金网在此层级进行为期两个月的短期研究，再根据他们的研究成果评判该层级的异常是否值得保留，但截止期限未到，李师便因病去世，关于Level C-321的改造计划也因此不了了之，相当于默许了金网在该层级独立运作。
//
//金网目前拥有三百名左右的成员，并使用红星建筑队的技术在该层级的警戒区建立了基地与前哨，负责记录和研究该层级内的异常实体。M.E.G.对金网的行为持赞成态度，会定期给他们提供物资，倘若流浪者误入警戒区，应第一时间找到金网成员并在他们的帮助下离开。
//
//入口和出口
//入口
//可以从Level C-61或Level C-71等拥有交通枢纽的层级来到该层级。
//其他入口尚待记录。
//出口
//试图损坏铁路路线图会让你到达Level C-126。
//其他出口尚待记录。
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1321{}