//Level C-375
//评分: 
//+12
//+
//–
//X
//Level C-375- 第一空间 
//
//生存难度：
//等级 0
//
// 
// 
//梦
//Level C-375是后室C群层的第375层。
//
//描述：
//Level C-375在每个人看来都是不同的，不过他们都曾存在于流浪者的记忆深处。
//
//Level C-375是一个未知空间，它会重现流浪者内心恐惧的场景，唤起流浪者在前厅痛苦的回忆。Level C-375最常见的场景是两个人在大声地吵架，还有车祸现场、跳楼现场等场景。
//
//快停下来……停下来！
//
//幸存者声称，他们是以第三视角被迫观看这些场景，自己就像在看一篇烂片，什么都做不了。场景会不断在眼前循环，直到自己发疯。
//
//一辆汽车在国道上飞奔，快开到拐弯处时突然莫名其妙失控，前面是一个路灯……汽车不受控制地撞向路灯，在车头碰到路灯的一瞬间，一切消失。一辆车在马路上飞奔，开始下一次循环。
//
//
//在该层级内，会有许多“声音”徘徊在流浪者耳边，不过值得注意的是，这些声音似乎是流浪者自己的。
//“为什么……明明差一点就可以……”
//
//“我真的很没用，什么都……做不了……”
//
//“为什么偏偏就在那个时候，为什么偏偏就在那个时候切入？”
//
//
//虽然这个层级标的是“等级0”，但其实很少有流浪者能从Level C-375内逃脱，大多数人最后都会陷入疯狂。
//一名年轻男子冲上马路，试图挡住失控的汽车，但汽车穿过他的身体，径直冲向路灯。车内，驾驶位是空的，一个面色苍白的女孩坐在副驾驶位上，她的双眼睁的大大的，看起来完全不明白发生了什么事。男子捂住了眼睛，他不敢想象接下来的场景。
//
//基地、前哨与社区：
//该层级没有任何基地、前哨与社区
//
//为什么每次车头撞到路灯就又循环了？为什么接下来的场景没有出现呢？难道说……记忆……
//
//入口与出口：
//入口：在Level 18内回想一段痛苦的往事，有很大概率来到这里
//出口：在经历过无数次循环后，如果流浪者任然意识清醒，那将会被送到Level 11
//所以……不对……我知道了！
//
//
//Level C-375-第二空间
//“真的没有任何办法了吗？”
//
//“没有了，扩散的太严重了，发现的太晚了，剩下来的几个月，好好照顾她吧。”
//
//“医生”，李志跟着主治医生走出了病房门，“真的真的没有办法了吗？”
//
//医生十分无奈：“小伙子，中药西药都试过了，没用的，实在不行，信宗教吧，哪个教都成。”
//
//李志愣了一下：“不……不行！我们要相信科学，我们是……无神论国家！”
//
//医生苦笑一声：“亏你这么清醒，小伙子，但宗教至少能麻痹人，科学只能告诉人真相，好了，我还有事，回去吧。”
//
//李志茫然地坐在病床旁边的木椅上，病床上的女孩表情倒是十分坦然，仿佛她只是来这里暂住几天。
//
//“没救了是吗？嗯，那我死了以后，把我和我爹娘埋在一起吧。”
//
//李志瞬间泪如雨下：“那……我死了以后呢？”
//
//女孩十分惊讶：“当然是和你爹娘埋在一起了。”
//
//“不，”李志擦干泪水，“我爹娘坟地现在变公路了，我死了后要和你在一起，我们下辈子也要在一起。”
//
//“好啦好啦。”女孩安慰他，“你能带我去看海吗？咱是农村家庭，上海我就不奢求啦，但大海我只在手机里看过。”
//
//“呃……好，我借车带你去看海。”
//
//李志借了一个熟人的汽车，女孩几乎是被他扛上车的，她几乎不能靠自己行走了。汽车在国道上飞奔。他看到前面是一个拐角，还有一只路灯，李志正准备转动方向盘，他突然感到一阵晕眩，向下坠落、坠落，等他醒来时，他身处在一片黄色里。
//
//
//
// 
//
//生存难度：
//安全
//稳定
//幻梦
//我根本就没有看到她吓呆的样子，也没有看到汽车撞在路灯上，后来的事情是我自己想象出来的。这里来自我的记忆，我的……梦境
//
//
//
//
//
//
//
//李志手里紧握着方向盘，接下来就要碰到路灯了……前方出现了路灯模糊的影子，他紧张得手心里全是汗，如果……
//汽车在熟悉的地方失控了，他一下子换成了第三人称，又一次在公路旁看着汽车载着自己的爱人飞速冲向路灯……李志大叫起来，他猛地从床上惊醒，看着自己湿透的枕头，Beta基地内寂静无比。
//
//这里不是现实，这里是梦，来自我……也就是说……
//
//描述：
//在流浪者认识到该层级并非真实之后，可以短暂地控制Level C-375，十五分钟过后，流浪者将死亡。
//
//
//
//
//其实，每次我去挡住汽车时，我就已经猜到结果了，但潜意识就是希望挡住现实，所以一直在自欺欺人。
//其实我早已知道结果了。
//既然真实的现实无法改变，那就在梦里实现。
//
//我可以控制这里。
//
//那就在这里看一次海吧。
//
//闭上眼睛，想象着海风吹在自己脸上，想象着太阳缓缓落下，想象着她就在自己身边，着迷地看着大海。
//然后睁开眼睛，海浪拍打着沙滩，霞光出现在西边，她站在那里，张开双臂。
//
//基地、前哨与社区：
//这里只有我一个人，这里有你和我。
//
//入口与出口：
//入口：
//那里曾经是我和你一起玩耍的地方呢……终究是成往事了。
//
//出口：
//不重要了，人生就是要不留遗憾的，不是吗？
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1375{}