//Level C-399
//评分: 
//+17
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//Level C-399是后室C层群的第399层，最早于二十世纪五十年代被发现。
//
//2e9a91a26224b99d.jpeg
//Level C-399的一部分
//
//描述
//Level C-399为一片无边无际又平坦的黑色空地，及一面完全垂直于地面的黑色墙体，墙体向四周无限延伸。地面可反射光亮，但相对较为模糊。该层级无任何实体和物品。
//
//除靠近墙体的区域外，其他区域全部处于永无止境的黑暗中，不建议流浪者向与墙体相反的方向行进。
//
//墙体上布满以矩形为主的几何图形光源，大小不一，据目测大型光源面积可能超过300平方米，小型光源仅有50平方厘米左右，甚至存在仅有1.8平方厘米的光源。各光源的排列并不规则，且排列紧密，均不重叠。流浪者普遍称这些光源为“屏幕”。每块“屏幕”亮度都相对较高，不建议长时间直视“屏幕”。
//
//“屏幕”表面显示有可识别的色彩及图像，均以镜像显示1。显示内容主要为前厅各类电子终端的显示屏，常见类型包括各式互联网网页、手机软件、电视节目、电子游戏、电子时间、巨幅广告及宣传板等，已发现的所有显示信息均来自前厅，目前“屏幕”中均无后室终端的内容。
//
//“屏幕”一段时间会发生更替，即一块“屏幕”熄灭另一块同面积的“屏幕”进行替补。更替时间不定。
//
//最起初的Level C-399并非拥有如此之多的“屏幕”，二十世纪五十年代该层级被发现时仅有零散的几块正在播放前厅电视节目的黑白“屏幕”，且每个“屏幕”大小仅有9寸左右。
//
//随后的七十年中，“屏幕”数量迅速增加，在21世纪后“屏幕”数量呈几何式增长2。“屏幕”类型也不断丰富，从最早发现的“黑白老电视”3到现有的上文中提及的各式前厅电子信息。
//
//Level C-399也因其特殊性而成为了M.E.G.及流浪者们了解前厅最新情况的主要途径。
//
//值得一提的是，据几名流浪者报告，曾发现一块“屏幕”显示的互联网网站存在后室相关信息，是类似于都市传说的写作网站。但意外的是其所记录的内容与M.E.G.档案库高度吻合，且会随档案库的更新而实时更新，M.E.G.正在对此事进行调查。
//
//基地、前哨与社区
//探险者总署（M.E.G.） - “监控室”Level C-399基地
//据点位于一块显示有巨幅可口可乐动态广告的“屏幕”前
//常驻人员36～37人
//主要对“屏幕”数量进行计数和收集前厅最新消息
//愿意为流浪者提供必要生存物资
//友好且开放贸易
//入口与出口
//入口
//在Level C-23观看直播时尝试切出将切入Level C-399。
//在Level C-29连续使用任意电子产品超过两小时将切入Level C-399。
//更多入口正在探索中。
//出口
//在远离墙体的黑暗中奔跑将切入Level C-156。
//尝试切入一块显示有“新年快乐”或“春节快乐”的“屏幕”会切入Level C-191。
//由于“屏幕”的更替性，许多与“屏幕”有关的出口都是不稳定的，关于稳定出口的探索正在进行中。
//隐藏
//Autumn_Ginkgo_
//Autumn_Ginkgo_
//
//新人三作，感谢阅读
//图片系各个图源编辑而成，以下是各个图源：
//图源1、图源2、图源3、图源4、图源5、图源6、图源7、图源8、图源9、图源10、图源11、图源12、图源13、图源14、图源15、图源16
//我的作者页：Level C-🍂
//
//« Level C-398 | Level C-399 | Level C-400 »
//
//Footnotes
//1. 即左右颠倒
//2. 至今为止可观测的“屏幕”数量早已破亿，由于其数量之多且难以计数，M.E.G.于2012年底正式宣布停止计数
//3. 较早一批到达Level C-399的流浪者对上文中黑白“屏幕”的称呼
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1399{}