//Level C-370
//评分: 
//+3
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
// 
//无有害实体%E6%9E%97%E8%8D%AB%E5%B0%8F%E9%81%93
//林荫小道。
//
//Level C-370是后室C层群的第370层。
//
//描述
//Level C-370是总体上是一片广袤的温带落叶阔叶林。这里的气温总是维持在凉爽的10-15摄氏度，风力等级总为2级1。树林之间夹杂着老旧的大理石小道。有许多小湖与溪流夹杂在树林间，它们之间相互连通。其中流淌着清澈的纯净水，可以直接饮用。树林间、小路旁分布着可供流浪者歇脚用的凉亭与庙宇，内部有许多盛放着新鲜水果的盘子。
//
//Level C-370有着与前厅相似的昼夜循环。但在白天，这里的天气总会是多云，云朵总会半掩着发光体；在夜晚，类似于月亮的天体将总是处于满月状态，其反射出的光将照亮流浪者前行的道路。夜晚流浪者在这片树林中不会有恐惧情绪；反之，黑暗将使流浪者感到宁静。
//
//Level C-370只能同时容纳一位流浪者。森林内不存在有害实体，除了流浪者自己之外，只有原生于该层级内的昆虫与鸟类2。时间处于白天时，流浪者可以听到清楚而不聒噪的蝉鸣。时间处于夜晚时，蛐蛐的鸣声将取代蝉鸣。
//
//%E5%9D%9D
//小坝，小亭，小道。
//
//流浪者在这里将不会感到饥饿与疲惫。但如果流浪者想，他们大可以在一片森林间的草地上入睡，也可以在凉亭、庙宇中打盹；睡眠时，鸟、虫不会打扰流浪者。一次睡眠可以维持9个小时或更久。如果流浪者愿意，他们也可以选择食用水果、饮用清水；无论食用多少，流浪者都将只感觉到微微的饱腹感。
//
//基地、前哨与社区
//该层级只能容纳一人，没有已知的基地、前哨与社区。
//
//入口与出口
//入口
//当一位流浪者在任何含有森林的层级感到绝望、抑郁或处于濒死状态时，将会有一定概率陷入昏迷并在Level C-370中苏醒。
//某些曾经进入过Level C-370的人，只需独自闭上双眼，去回忆微风与虫鸣、感受宁静与和谐后，就可以再次回到Level C-370。
//出口
//过了至少三天且流浪者真心感到惬意后，他们将感到困意。若此时流浪者睡眠，他们将在Level 11内随机一套公寓里的床上苏醒。
//如果流浪者曾经遭受过创伤或者有严重的心理疾病、人格障碍，他们苏醒后将进入他们自己最美好的记忆。
//作者信息
//« Level C-369 | Level C-370 | Level C-371 »
//
//Footnotes
//1. 在此风力等级下树叶微有声响，流浪者将感觉迎面有微风吹来。
//2. 这些虫与鸟在前厅也都可以找到中。
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1370{}