//Level C-314
//
//
//评分: 
//+35
//+
//–
//X
//在很小的时候，我做过这样的一个梦。#a20000的花海侵占了大地。我躺在这噬人心魄的花瓣里，望着悦动在天空的海洋，任凭玫瑰的尖刺将我的肌肤刺破。
//
// 
//
//生存难度：
//等级 玫瑰
//
//宁静至美
//玫瑰圣地
//实体绝迹
//不再步入残忍的现实，我于此沉睡
//
//描述
//Level C-314是后室C层群中第314层。
//
//
//62f9102b16f2c2beb1592748.png
//在这无尽的海洋中祈祷，祈祷这是一场永无醒日的梦境。
//
//过道
//此层级位于海洋之下。
//
//海洋漂浮在半空，其原理未知。从底部仰望，能看到极小且模糊不清的白云与月亮。有闪着光的鱼群，掉下会变成一朵玫瑰。
//
//无论在此层级的何处，阳光永远从视野范围内的左上方射出，无法探测其光源。站在阳光下会感到温暖且舒适。并失去离开这里的想法。
//
//白色的教堂柱间隔40米，中间走廊地面长满玫瑰，软刺，但仍会划出白痕。白柱外侧长满不同种类的树，靠近树会出现白色光屏，触摸后会出现类似于湖面的淡蓝色涟漪。玻璃制品可以将其收集，味道类似玫瑰露1。
//
//玫瑰的数量无法数清，据流浪者称—吞下玫瑰花瓣会让她感到情绪有所稳定。
//
//
//娇嫩的玫瑰犹如一片海洋，藤蔓蜿蜒盘绕。雪白的教堂棱柱与阳光亲吻，蓝灰色的色调与玫瑰相互碰撞。战胜的玫瑰不停的荡漾，血红色海洋将我席卷。
//
//我沉醉在这香气中，教堂的森严与玫瑰的神圣让我漂浮在此，空气中的氧气将我托举。挽起的裤腿轻抚过花瓣，我感受着脚底带来的触感。折下一朵玫瑰，将它的花瓣轻轻的向上抛，海洋沉下，卷走了每一片花瓣。
//
//窒息的美丽让我忘记了溃烂的脚底，铁锈味被玫瑰所压下，我沉浸在海洋的拥抱，品尝着窒息的绝望。
//
//尽头
//62f9d59216f2c2beb1e6eba0.png
//走廊的尽头，海洋与玫瑰妥协的产物。
//
//顶端为巨大的白色的圆形盖。
//
//从白色柱子往外看会看到自己的家乡。与走廊一样，这里被一道无形的光屏隔开外界，触摸它会出现粉色涟漪。手可以伸出，抽回来后手上会布满划痕，深浅不一。
//
//蓝色的玫瑰约30cm高，花朵直径为10cm。花瓣触感近似于棉絮。并没有刺，也没有藤蔓，往下挖1米便会涌出蓝色具有腐蚀性液体。将花瓣抖落在上面，液体就会变成花瓣。空中漂浮着花瓣，原理未知，可以被触碰。
//
//声音在这里会被降低到20Hz。
//
//我在这里躺下，又站起回望过道。极端的安静让我感到不适。
//
//阳光也能感受到这里的美丽，妄图同我一起享受这场梦境。
//
//影响
//在这里，负面情绪会逐渐转变为正面情绪。
//渴望的人或物会在屏障的另一端给你鼓气，但这个过程只会持续3-5min。
//依赖。
//我渴望温暖，渴望一个稳定而又舒适的家园。
//
//我为她而来，她在此地呼唤我，数十年的哭诉与孤独，声音敲击着我的心脏。
//
//我躺在花海里，任凭玫瑰的尖刺将我的眼球扎破，血液涌上，我相信这才是她真正的模样。
//
//我在尽头回望我的一生，情绪同玫瑰一起摆动。
//
//我发了疯似的盯着海洋，冲进尽头为了找到她，我大声叫着。
//
//这里是梦，我的梦。
//
//"你的梦想是什么？"
//
//实体
//白色的玫瑰。
//比花更娇艳的唇瓣，20米长的银白色头发。
//她坐在教堂的白色栏杆上，赤裸着脚，白色长裙轻轻摆动。
//无尽的宁静化作恐惧包裹着我。不停的跑步只为逃离它。我拼命爬上柱子，血细胞与血浆背叛似的逃离使我脱力。躺在蓝色的海洋中，我再一次仰望。
//她的手指抚过倩仪的眼睛，猩红的世界渐渐褪去，她再次看清现实。
//她是她的光，是她存在的缘由与向往。
//她是她日复一日等待的心。
//她是幻想，是人们心中的乌托邦。也杀死了人们。
//"我只想来到一次花海，沉迷在此。"
//
//"那之后呢？"
//
//"我已经实现了梦想。"
//
//"这是逃避。"
//
//基地，前哨和社区
//你
//你的恐惧。
//你的逃避。
//你的向往。
//我展开了双臂。抬起白净的左腿，用力，旋转。跳起，伸臂，回头，扭腰，提臀…我不知疲倦的在花海中舞动。
//
//海水卷走了我每一滴血液。我的长裙依然洁白。
//
//左手手腕上的铃铛在此刻却一声不响，我笑它扫了我的兴。它笑我死于逃避2。
//
//出入口
//倩仪在语音的最后说出了自己的名字—歉意。之后再无她的消息。
//
//入口
//浸泡在水中，恐惧让你逃避，幻想逃离。
//出口
//面对现实，不再逃避。
//跑，快跑，离开这里别再回来！穿过走廊！还有人在等你！回归现实吧。
//
//
//
//
//
//
//
//她也在等你，别抛下她
//
//
//在我放弃了离开的念头，拥抱并亲吻每一朵玫瑰。阳光缠绕在我的指尖，这一切都美好而温暖。
//
//血液缓缓从我的身体流出，我感受着肌肤传来的感觉，享受着精神脱离肉体，浮动在半空，无人陪伴，远离一切。
//
//玫瑰的尖刺划过，我感受不到解脱。羽毛拂过我的心脏，我冲破了心里的最后一面屏障，颤抖的手，咬紧的牙关。
//
//我躺在破碎的衣物中，艳丽的玫瑰上，我任凭它蚕食我的血肉。
//
//树叶扎破了我最后的器官，血液在空中溅起，这是我最后的舞动。
//
//血液和泪水化作花瓣从空中飘落，虚脱的我躺在玫瑰花海之下。香气围绕我的周身，等待我的再次醒来。
//
//万幸的是，我依然在这里。
//
//等我许久的她，也在这里。
//
//
//
//作者信息
//« Level C-313 | Level C-314 | Level C-315 »
//
//Footnotes
//1. 饮用超过50ml会损伤胃粘膜。
//2. 孤独。
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1314{}