//Level C-389
//评分: 
//+11
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
//安全
//稳定
//大多区域极少量实体snaSP.jpg
//一张Level C-389中地铁主站的照片
//
//Level C-389是后室C层群的第389层，表现的像前厅的地铁系统。
//
//描述
//该层级似乎是完全封闭于地铁系统的。有流浪者意外切入本层时曾试图离开地铁站，最终在地铁站出口被一纯黑固体拦住，此类固体封住了整个出口，目前M.E.G.正在调查此类固体。对于此类固体，唯二可知的是，这不是前厅的任何一种固体，且此固体十分坚固，目前所有已知物品都无法取下该固体。
//
//Level C-389大致分为两个区域，站点与地铁。
//
//站点
//Level C-389的站点似乎是无限的，但分为主站与其余站点。主站是站点中最大的，且流浪者切入本层级也会到达主站，流浪者可乘坐地铁到达其余站点。其余站点除结构外与主站并无不同。
//
//Level C-389的站点中会产生一种怪异的舒适感，这不同于既视感，这种感觉似乎是强加进脑子里的。饮用大量杏仁水可以缓解这种感觉。
//
//Level C-389产生的舒适感大致分为三个阶段：
//
//1、产生舒适感。据流浪者描述，这类似于劳累一天后回到家的感觉。此时，如果可以，建议离开此层级或大量饮用杏仁水。
//2、舒适感加剧。据流浪者描述，此时已对层级产生依赖感，并看到模糊人影。据观察此时流浪者已丧失自我行动能力，若看到此类流浪者，建议予其灌用大量杏仁水。
//3、彻底依赖上此层级，并在层级定居。据研究报告，给予此状态下的流浪者灌用杏仁水已无作用，且此状态下的流浪者将对强制让他们离开者产生敌意。
//目前并不清楚这三个状态的发展间隔时间，这似乎是因人而异的。
//
//M.E.G.调查员与Level C-389定居者采访（节选）
//M.E.G.调查员：您会离开这里吗？
//层级定居者 ：你这个问题太奇怪了…这是我的家，我为什么要离开?
//M.E.G.调查员：（沉默一阵）我们是有些冒犯了，我们只是认为这太冷清了。
//层级定居者 ：冷清？你们瞎吗？这么多人的地你们说冷清？现在人真有意思。
//（我们可以确定，周围只有他一人）
//M.E.G.调查员：（沉默一阵）我们是有些冒昧了，打扰您了，再见。
//[采访结束]
//
//与采访同时传回的资料显示，此层级目前没有发现任何可以维持生命的物品，定居者的生理结构似乎也发生了改变。
//
//有流浪者在站点内目击了猎犬，但是攻击欲望大幅减少，据观察，猎犬不会攻击定居与此的流浪者。
//
//地铁站内有多个广告牌，这些广告在前厅中均不存在，切入这些广告可以到达其他层级。
//
//地铁
//若流浪者有充足的食物与杏仁水，在Level C-389中生活三天且意识清醒，将有地铁出现。
//地铁内有大量无面灵，这些无面灵的穿着为普通的21世纪服装。这里的无面灵智能极高，可以表现出常人的所有行为。在此，强加的安适感将会消失，取之的是匆忙感，这并非是强加的，是由流动量极大的无面灵造成的。无面灵在地铁停靠站点时流动，上下地铁的无面灵似乎是被传送的，上地铁的无面灵会突然出现，与之相同，离开地铁的无面灵也会瞬间消失，目前并不清楚其原理。地铁里很拥挤，但无面灵永远会给你留一个位置。
//
//铁路的尽头依然未知。在地铁上饥饿感的来临会更快，迫使人员离开地铁。M.E.G.探索者曾携带一袋干粮后探索五站被迫离开。新的人员已派出，探索站数已超过五站。
//
//- 开始播放语音
//不要再往这里派任何人！千万不要！地铁……它不是一个地铁，它…它…是一个实体！对…实体…它想我死……我不想…我不想！那些无面灵也是假的，全他妈是假的！它想让我待在这…这里…很…很舒服，我想…在这睡…睡一觉……我不能，我不能！它会吃了我的，一定会的！但是…但是…它不会放了我的…我有罪…我要待在这，但…但我…我脑子好他妈乱！但这…很舒服…我不能！我不能…我不能…什么？我觉得我好舒服，但是…我感觉我好害怕，它会…它会？我为什么要害怕呢……？但我还要…？这好…舒服，特别…舒服，我从来没怎么舒服过…我想…在这睡上…睡上一觉，好好的…睡上一觉…
//（巨大的物体掉落声）
//（人体倒地声）
//[语音结束]
//
//消息来自 M.E.G. Level C-389 地铁探索者 陈阳
//
//有传言，铁路的尽头是Level C-389的子层级，但此结论尚未证实。
//
//- 编辑内容如下
//有传言，铁路的尽头是Level C-389的子层级，但此结论尚未证实。
//在铁路的尽头，你将会到你家附近的地铁站，对！你前厅的家！你可以离开地铁站了，你可以回家了！一切都好好的！当然，你会受到点磨难的，你会做个噩梦…我做了个被地铁吃的梦，很离谱，不是吗？不说这些了，这只是一个梦不是吗？只是一个梦！只要你做完这个梦，你就能回家！这…这太好了，我要去……
//
//用户 陈阳 两小时未编辑，M.E.G.终端自动发送
//
//基地、前哨与社区
//由于本层的特殊性质，M.E.G.设法在本层建立前哨时均失败。目前，M.E.G.依然在寻找彻底解除安适感的方法。
//
//安适之家
//由意外进入此层级的流浪者在地铁主站组成，生理结构似乎发生变化，由于层级的影响，他们认为此层级是他们的家，他们欢迎新的定居者，但不欢迎调查此层级的调查者。目前约有20人。安适之家的成员会对强制要求他们离开的人产生敌意。
//入口与出口
//入口
//在C层群的任意拥有现代建筑层级进入一个地铁站，当你感到昏沉时，在此睡上一觉，醒来将会来到Level C-389。
//出口
//目前唯一已知方法是切入站点内的广告牌，不同的广告牌将通往不同的层级。
//城乡结合部宣传广告，你将进入Level C-12。
//沙漠绿化广告，你将进入Level C-30，危险，不建议尝试。
//日本神社旅游广告，你将进入Level C-169。
//不不不，不一定从广告的，那一点也不舒服！来坐地铁，它能让你回家！对，你前厅的家！
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1389{}