//PROTON-C-364
//评分: 
//-3
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//PROTON-C-364是后室C号质子群的第364颗质子，它作为后室各质子群的中转站而为人熟知。
//
//alley-89197_1280.jpg
//Proton-C-392西侧的尽头
//
//描述
//PROTON-C-364为一条长约5㎞的工业时期英式城市街道，街道宽约10m，沿街种植着高大的前厅树木。该质子气温恒定在286.75K（13.6℃/56.48℉）。该质子气候阴湿多雨，少有晴朗天气。该质子不存在日夜循环，处于永夜状态。街道两侧安装有路灯，路灯不间断地发出昏暗的光线，发光原理未知。
//
//街道两侧的房屋商铺多数无法进入；但少数房屋可以透过玻璃门或窗户看到屋内事物；更少数房屋可以进入，进入后便会切入其他质子。在街道东西两侧的尽头部分，尽管可以看到转向其他方向的支路，但在人员踏出街道的一瞬间便会切出该质子。
//
//尽管在该质子物资，实体都很稀少，但该质子易于切入、切出的性质，该质子已然成为了各质子群流浪者的中转点和休息点。在该质子，贸易十分盛行，此处为该质子中闻名后室的店铺列表：
//
//名称：卡辛斯基杏仁制品店
//店主：“卡辛斯基家庭委员会”
//售卖物品：各类杏仁制品，近日货源紧张。
//补充：所谓的“卡辛斯基家庭委员会”，只是格里高利 卡辛斯基和的他的家人而已。
//
//名称：原子猫杂货铺
//店主：玛丽 C 丁格尔学士
//售卖物品：基本生活物资，包括食品、水、背包、棉被等。
//补充：原子猫社团在此设立的官方盈利店铺！这里赚到的钱的40％用来支付玛丽学士和驻守此地的兵士的工资，剩下的60％则分配给社团的其他基地。
//
//名称：天堂修正案
//店主：克莱门特 约翰逊
//售卖物品：稀缺性物品、火器、电子设备等。
//补充：据老克莱门特说，他自己也不知道为什么给店铺取这个名字。
//
//名称：速切补给站
//店主：巴拉尔 肯尼迪
//售卖物品：速切协会所提供的各种速切用具及各种基础物资等。
//补充：速切协会官方设立的补给站，店主与著名的那位肯尼迪并没有关系。
//
//其他商店档案仍在更新……
//
//“齐柏林”效应
//“齐柏林”效应是在该质子发生的一种特殊事件。在事件发生前一天，天空会逐渐明亮起来，乌云也将会渐渐散去。在事件发生当天，该质子会完全处于白昼的状态。并且，自不可视的远方会飞来数艘老式氢气飞艇，飞艇长约50m，宽约10m，高约10m。在飞艇降落后，身穿海军制服的无面灵便会在飞艇附近招揽乘客。在乘客坐满（即5人）后飞艇便会在5分钟内起飞。在起飞后，飞艇实际上就已经离开了该质子。飞艇没有窗户，无面灵司机也禁止打开舱门。若是在此时打开舱门，全艇乘客都会晕倒，之后会在蓝色通道醒来。
//
//若是全程五个人都安静的坐好等待，那么司机就会询问乘客“想去哪里”。司机接受除了前厅外的任何答案。在决定出一个集体都同意的答案后告诉司机。五人便都会晕倒，且在他们说的质子醒来。
//
//如果无面灵司机在该质子没有招揽到足够的乘客，那么，飞艇与司机便会凭空消失，尽管有时只空缺一名乘客。
//
//基地，前哨与社区
//M.E.G驻扎点“菲尼克斯”
//为当地居民提供基础生活保障。
//由24名成员构成。
//为想要离开的流浪者指引切出点。
//B.N.T.G驻扎点“球手”
//在该质子中心部分设立了集市
//B.F.P.F基地“十字路口”
//与M.E.G在此处设立的基地用处相同。
//由23名成员组成，近日似乎正频繁的向该质子调取物资。
//A.C.S基地“普朗克”
//原子猫社团设立的第一个基地。
//社团成员大部分都在该基地工作。
//储存了大量的物资。
//欢迎流浪者加入社团。
//出口与入口
//该质子出口与入口极多，且连接着几大质子群，故该质子被称作“中转站”。
//
//- 收回入口
//
//以下为特殊情况，即多人都曾以同样的经历遭遇过。
//
//在PROTON 57中切入一幅路灯的画。
//在PROTON 11中进入一栋棕色，有着柠檬茶香气的大楼，这样的大楼在PROTON 11中有许多栋。
//在PROTON 777中卷入一场决斗并胜利，之后你会晕倒，并在该质子中醒来。
//以下为记录过随机切入的质子
//
//PROTON 45
//PROTON 7
//PROTON 64
//PROTON 424
//PROTON 46
//PROTON 194
//PROTON 9
//PROTON 6.1
//PROTON A-14
//PROTON 14
//PROTON 54
//PROTON 89
//PROTON A-11
//PROTON A-3
//PROTON A-34
//PROTON A-10
//PROTON F-2
//PROTON C-10
//PROTON C-42
//PROTON C-86
//PROTON C-404
//PROTON C-996
//PROTON C-8
//PROTON C-666
//PROTON C-6
//PROTON PT-1
//PROTON N-1
//PROTON N-14
//更多入口仍在更新……
//- 收回入口
//- 收回出口
//在街道尽头切出，你将有50%的几率切入PROTON 657，50%的几率切入PROTON C-7。
//饮用路旁水龙头内的液体，你就会昏倒，并在PROTON A-2
//沿着标写着“ 嘿！翔隼。
//Hej！Sokoly
// ”的路牌行走，你会进入一片下雪的公园。在公园待上5分钟后，你会昏倒并在PROTON -5醒来。
//进入一家名为“圣彼得福利院”的建筑会使你切入PROTON 18
//进入该质子的公共厕所有几率会使你切入PROTON C-18
//由于该质子切入/切出的未知性，任何记录在案的切出点均有可能失效，因此并未记录不稳定切出点，以上为稳定切出点。
//- 收回出口
//- 收回附件
//请示
//2019年10.11
//比罗尔 卡舍学士
//
//
//高导员，请问，在文章中把所有“层级”都替换成“质子”是必要的吗？我个人觉得没必要啊，有点傻而且很费事。
//回复
//2019年10.12
//高朗导员
//
//
//是必要的。
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1364{}