//Level C-385
//评分: 
//+32
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
//不安全
// 
// 
//Level C-385是后室C层群的第385层。
//
//已存取[点击隐藏]
//以下内容主要面向需要快速理解层级的流浪者，M.E.G.推荐流浪者完整阅读此层级信息。
//
//此层级为一个结构复杂且巨大的老式公寓，但其并没有多少价值，且你无法遇见任何流浪者。
//此层级中陷入因重伤或饥饿导致的绝境时不要慌张，你很可能会因此前往医院相关层级并恢复身体状态。
//切入地点所在的公寓单间有丰富物资且水电可用，应收集之后再离开单间，除了单间以外你无法在此层级的其他地方发现任何食物，且一旦离开你将无法返回此单间，因此你也可以在单间内度过在此层级的时光。
//此层级没有可用Wi-Fi。
//此层级的通道温度高且闷热，应保证水分充足。通道里破裂水管中的纯净水是可饮用的。
//此层级具有光线异常，可能忽暗忽明。
//此层级没有威胁实体。
//此层级空间相当稳定，不能以常规切出方式离开。
//应知晓此层级的出入口信息。
//
//lou-ti
//Level C-385 中一个典型的双跑楼梯。
//
//描述
//Level C-385整体在外观上类似于一栋巨大且不断延伸的老式公寓建筑内部，其拥有相当复杂的建筑结构，分部有大量楼梯以及通道，还有许多公寓单间的入口，但这些入口都是无法开启的。该层级所有物品均呈现出老化和欠缺维护，且此建筑似乎拥有无法被探明的高度。在该层级中永远存在淡淡的汽车行驶和鸣笛声，无法寻找到声音来源。
//
//大部分通道中都有4至16个与空调外挂机箱相似的机械设备，而机箱总是处于运行状态并向外喷出热气，这导致许多通道的温度都在29~38℃之间变化，且增加了流浪者脱水的可能性，流浪者应随时保证充足的水分。
//
//tian-kong
//首次在 Level C-385 里拍摄到的天空（来自重要回收物品-01，由流浪者陈品旧所拍摄）。
//
//在部分通道中，流浪者可以在高耸的建筑物之间观测到天空，此时汽车行驶和鸣笛声会明显提高，且此位置将被阳光所笼罩，在此位置晒太阳被绝大多数流浪者证实能够有效恢复其信心和精神状态。不过在大部分情况下建筑结构之间的空隙深处是漆黑且无法辨认细节的。
//
//值得注意的是，于白昼时，建筑空隙间会出现未知来源的阳光，尽管空隙上方是漆黑模糊的。在此处晒太阳没有任何明显的正面效果。
//
//根据M.E.G.（探险者总署）针对性派出的侦查人员多次勘探之后，已确认Level C-385是一个非常稳定且结构不变的层级空间，因此流浪者不能在此层级中以常规方式切出，不过多处位置仍然具有明显的异常拓扑空间。
//
//由于内部环境相当复杂，该层级地图的测绘仍在进行。
//
//公寓单间
//所有切入Level C-385的流浪者最初都会出现在一处公寓单间内部，在这些公寓单间内通常可以得到15瓶330ml的瓶装杏仁水，数量随机的皇家口粮以及罐装龙肉，有些情况下还能发现多种新鲜的蔬菜和牛肉。这些公寓内部装修完善且拥有完整的水电供应以及一桶装有充足天然气的15kg家用煤气罐，但物资仍然是有限的，且不可能连接到任何Wi-Fi。如果流浪者离开此单间，则房门将自行关闭且无法再次打开。
//
//值得注意的是，在这些单间中的电视机是可以观看的，但所有频道都在循环播放同一段内容（见报告补充附件）。
//
//边界区域
//根据已收集的报告显示，目前这些位置被认定为Level C-385的边界处，在这些位置中通向更远处的通道和楼梯都会出现不同程度的损坏，封锁或坍塌，并且在这些区域会出现不可见的屏障，这通常导致流浪者无法进一步向外探索。对于边界区域的位置进行总结发现其在此公寓中大致呈现为一个球形，直径在53公里至49公里之间。
//
//部分报告称在无法进一步探索的位置时，可以发现数个模糊的疑似某种未知的人形实体在无法通过的另一端游荡。
//
//根据M.E.G.数据库的记录，如果发现可以通向更远距离的通道或楼梯，并且继续深入探索的时候，流浪者将很可能会前往目前尚未被证实的Level C-385.1。
//
//特殊现象
//Level C-385存在环境光线异常，在流浪者于该层级移动时，可能会发现当经过层级某些区域时，光线会突然变化为白昼或夜晚两种情况，在进入夜晚的情况下，该层级部分通道和楼梯的灯泡会开始运作。
//tong-dao
//Level C-385 中一个突然由白昼变化为夜晚的通道（来自重要回收物品-06）。
//
//Level C-385拥有极其微弱的Wi-Fi，强度通常在0~1之间，但是有效的信号强度几乎无法持续超过1至3秒，且出现概率相当之小。该层级的Wi-Fi基本没有用处。一般情况下，除切入地点以外的公寓单间的入口处是连接Wi-Fi的最佳地点。
//Level C-385除了最开始的切入地点以外，似乎不会再出现任何食物或维持生存的设备，并且连其他有价值的物品也十分稀少。这导致流浪者无法在该层级中得到有效的生存物资以长期生存。只有在该层级的部分通道中能够发现破裂的水管和向外倾泻的纯净的淡水。
//Level C-385似乎不存在实体，除了在部分情况中会有后室地铁进入此层级，但目前没有任何成功乘坐后室地铁离开此层级的报告。
//在Level C-385中无法遇到其他流浪者，尽管其支持多人同时进入此层级。
//Level C-385的通道和楼梯中可以发现很多使用颜料涂画的符号或被张贴的铜版纸，且其通常是记录有由汉字书写的各种内容（如维修家具和电器，推销各种物品以及性服务等）和电话号码，但是号码规格都是不适用于后室的11位数字。
//部分证据似乎表明，切入Level C-385中的部分流浪者可能是无法以任何方法切出此层级。
//请切入Level C-385的流浪者积极寻找该层级的更多出入口或其他值得关注的信息并告知M.E.G.（探险者总署）。
//
//实体
//除了后室地铁以外，Level C-385似乎不存在任何实体，目前仅在边界区域中目击过实体。对于在回收物品-08的视频数据中记录的未知实体是否存在目前仍然未知。
//
//基地、前哨与社区
//稀少的物资以及流浪者无法在该层级形成团体的原因，导致本层级不存在已知的基地，前哨与社区。
//
//发现
//2021年5月9日，M.E.G.第十邮件部门（“顺风中转”）信息接收员得到来自流浪者陈品旧的邮件，并在交流后得到此层级的初步资料。
//
//入口与出口
//阅读此报告的流浪者应尽可能避免以下切入方式，如果切入此层级时请积极尝试以下方法。
//
//入口
//使用Wi-Fi在后室论坛中发布或转发Level C-385的图片都会导致操作者在数小时内切入该层级。
//在Level C-13中以快速奔跑并跃出此层级窗户的方式将有极大概率切入Level C-385。
//乘坐后室地铁可进入该层级的某个公寓单间内。
//出口
//此切出方法目前十分模糊，但大部分离开此层级的流浪者都是使用这种方法切出。具体内容为在Level C-385中经历数天之后，并且陷入非常的饥饿或身受重伤的情况时，会突然昏迷并出现在随机层级且身体状态恢复良好，大部分报告中通常是出现在Level C-114、Level 11的医院建筑内或者其他医院相关层级的安全区域。
//在Level C-385中成功连接任意Wi-Fi有极小的概率会使流浪者切入Level C-101或Level C-70。
//在Level C-385中每日进行高强度的探索任务可以增加切入Level C-96的可能性。
//更多出口尚在探索中。
//
//
//报告补充附件[节选]
//Level C-385 回收物品报告［封面］
//EagleSD.png
//M.E.G. - 为了人类更好的明天
//以下文件来源于M.E.G.信息记录设施，由众多流浪者和M.E.G.成员共同完善。
//Level C-385
//重要回收物品报告
//文件编号：LC385-1-AD-20220513
//
//文件类型：补充性文件
//
//
//M.E.G.官方认证
//
//
//Level C-385 回收物品目录
//
//Level C-385 回收物品目录
//更新时间：08/30/2022
//
//物品保管单位：M.E.G.第十四材料回收部门（“7号仓库”）
//
//前言：以下物品均回收于Level C-385，物品来源于M.E.G.探索兵团和其他流浪者报告上交。如果需要具体物品可向物品保管单位申请使用。
//
//物品编号	描述	回收人员	备注
//01	首次进入Level C-385的流浪者对该层级进行的记录	流浪者陈品旧	这份记录对此层级的报告撰写和探索行动提供了准备基础。
//02	对Level C-385公寓单间内的电视播放内容的影像记录。	M.E.G.罗经点成员百川一	对于视频内容的理解正在进行。
//03	一个小型录音机。	流浪者雷奥纳多	录音机已损坏，目前能解析的内容中只有喘气声和哭声。
//04	数张被张贴或涂鸦在墙壁上的广告的图像记录和物品样本。	M.E.G.罗经点成员京叶	内容多样但与后室基本无关，电话格式为遵循某种规律的11位数字，与前厅有强关联。
//05	一个后室常见的记录摄像头。	M.E.G.罗经点成员百川一	根据设备数据记录，设备的主人很可能是过去失踪的流浪者祺司。
//06	对Level C-385内异常环境光线的图像记录。	M.E.G.罗经点成员百川一	给流浪者对本层级的异常环境光线建立初步印象。
//07	一张于Level C-385的边界区域拍摄的照片，照片中可见在连接桥断裂的另一段有两个模糊的人形实体在游荡。	M.E.G.罗经点成员斯隆	该层级实体存在的图片证据，目前正在寻找可能存在的穿越边界区域的入口。
//08	一个未知型号的智能手机，内部仅有两份值得关注的影像记录。	流浪者克里多亚	对于视频内容的理解正在进行。
//
//
//重要回收物品-02 详细内容报告
//
//物品编号：02
//
//回收日期：05/25/2021
//
//物品描述：一份对Level C-385中的公寓单间内电视机播放内容的影像记录，其时长为3分17秒。
//
//回收人员：M..E.G.罗经点成员百川一
//
//视频记录
//[记录开始]
//
//dian-shi
//于影像记录00:27处的截图。
//
//[画面中大部分被一个未开启的电视占据，M.E.G罗经点成员百川一的上半身位于画面内。]
//
//百川一：好，开始记录，现在是2021年5月19日，我是探险者总署探索兵团罗经点成员百川一，目前位置Level C-385，接下来将进行对此层级的电视机播放内容记录。
//
//[百川一使用手中的遥控器打开电视机并离开至画面外，电视开始播放启动画面。]
//
//[13秒后，电视启动完毕，其开始自动播放以下内容。]
//
//[画面内容为一处类似直升机的交通工具内部进行空中拍摄，下方是覆盖整个地面的巨大建筑群，一名成年女性无面灵（Entity 9）正在画面前以未知方式发声。]
//
//女性无面灵：现在我们正位于后室装修公司正在建造的名为“公寓”建筑的外围，可以看见我们下方现在全都是这个建筑的一部分，目前这些都只是十五千米以下的超低建筑群，接下来我们将进入低建筑群内部，根据公司方面透露，据说这个建筑最高处的高度预测会有[无法理解]零九百九十九千米。
//
//[画面中广阔的空间变化为纵横相交排列的高楼，有向上延伸至画面外的，倒挂并向下延伸的，横向穿插于之间的高楼，场景正在快速向右移动。]
//
//女性无面灵：现在我们来到了低层级的内部了，这里的建筑高度一般在五十至一百千米之间，也是装修公司正在建筑的部分，并且即将完工，到时候预计将会进行一次进度报告，那我们来随机挑选一个建筑进行室内参观吧。
//
//[画面远处紧密排列的高楼被一堵距离此交通工具十分贴近的连续的墙壁取代，墙壁和之间偶尔出现的结构也在快速向右移动，可在其中发现很多黑色人形实体。]
//
//女性无面灵：这栋建筑的风格是走破旧风吗？那边那个楼梯是不是要塌了？那个道路怎么连围栏也没有？那边的承重柱怎么都只有一半？看来装修公司的建筑风格是很有想法的。那么外围参观完了，接下来我们就要进入建筑中心区了。
//
//[画面外紧凑的建筑结构突然变得非常空阔，只有非常遥远的位置外才有更多覆盖整个画面的建筑结构。]
//
//女性无面灵：嘿，这里的建筑呢？
//
//[画面下方，一个实体的手出现在交通工具边缘并以此攀上交通工具内，女性无面灵似乎非常极其震惊，画面也出现明显抖动。根据实体数据库对照，新出现的实体很可能为电视脑袋（Entity 132）。]
//
//女性无面灵：嘿嘿，你谁啊？
//
//[实体歪了歪脑，没有明显反应，但是其头部的电视机开始出现一个人像，且开始发言。]
//
//电视脑袋：哦，女士们，现在我们这里遇到了些特殊情况，也就是这的建筑结构全都消失了，哦，我不该说这么多的，不过你们不能再拍摄了……
//
//[电视脑袋在说话期间试图将手接近摄像头，可以听见争执的声音，视频到此突然结束，电视自动关闭。]
//
//百川一：视频记录完毕，进行第二次录制。
//
//[百川一使用手中的遥控器再次打开电视，其余记录与上部分相同。电视自动关闭后，百川一回到屏幕前。]
//
//百川一：视频录制完毕，视频内容仍然相同，推测已无更多内容，录制结束。
//
//[记录结束]
//
//备注：M.E.G.目前没有任何对视频中内容的任何相似记录，后室装修公司与此视频的关系仍在调查，请有相关信息的流浪者们联系M.E.G.并提供信息，你可以以此得到丰富的报酬。
//
//
//重要回收物品-08 详细内容报告
//物品编号：08
//
//回收日期：08/30/2022
//
//物品描述：一个未知型号的智能手机，内部除了两个视频记录外没有任何值得更多关注的数据。
//
//回收人员：流浪者克里多亚
//
//视频记录
//
//
//点击此处可下载该视频记录。
//
//
//
//点击此处可下载该视频记录。
//
//备注：第一个视频目前内容不理解。
//
//第二个视频中似乎出现了未知的袭击拍摄者的实体或人类，且视频似乎拍摄到不属于此层级的宽阔场景，这表示该影像记录也可能并非记录于此层级。目前内容不理解。
//
//M.E.G.目前缺少对视频中内容的理解，请有相关信息的流浪者们联系M.E.G.并提供信息，你可以以此得到丰富的报酬。
//
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1385{}