//Level C-317
//评分: 
//+21
//+
//–
//X
// 
//
//生存难度：
//
//等级 2
//
//安全
//稳定
//少量实体
//Level C-317是后室C层群的第317层，该层级是一片海洋，海面上漂浮着许多已标价的物品。
//
//zwZ5X8.jpg
//Level C-317中为数不多的不存在漂浮货物的海域
//
//描述
//Level C-317是一片目前没有被观测到尽头的海洋，有流浪者推测在Level C-317的一端为无限延伸的陆地，且登上陆地后可返回前厅。鉴于此观点没有得到验证且由于传播该观点的流浪者精神状态不佳，该观点并不可信。目前并不建议流浪者试图通过跨越该层级海洋的方法寻找陆地。
//
//Level C-317的海洋中只有海面可见，海平面一米以下的部分处于一种浑浊而不可见的形态，且使用任何手段探测该层级海面一米以下位置的尝试均以失败告终。即使海水呈现分层状况，但海平面一米以下的海水在被舀出后会立即呈现出与上层海水相同的清澈状态。
//
//该层级的时间保持在上午，任何带入该层级的机械钟表均会显示时间为10:00。层级内几乎无风，海面平稳，云层稀薄。
//
//该层级的海水密度处于平均值，但任何处于海水中的物体均会受到极强的方向向上的压力，这使得几乎所有物体均会漂浮在水面，同时也使得在海中下潜变得极其困难。
//
//流浪者在切入Level C-317后会处于该层级的随机位置，多数情况下流浪者均会发现自己正平躺在该层级的海面上，且附近除了货物以外没有任何的大型可漂浮物。但也有极个别流浪者发现自己在切入该层级后处于一张木筏或是一块看上去像是帆船桅杆的巨大木杆上。
//
//但无论流浪者在切入该层级后处于何处，流浪者的手中都会握着一枚老旧的，背面刻有“用于辨别方向或当作通用货币”的黄铜指南针。该指南针同时也广泛分布于该层级中，可在许多位置找到漂浮于水面之上的黄铜指南针。
//
//注意：有时可能会找到棕色的、内含大量黄铜指南针的腐烂木箱。该类型木箱随机出现且几乎均已被明码标价。请流浪者在支付后再打开木箱，反之后果自负。
//
//货物
//在Level C-317的海面上通常漂浮着许多货物（如杏仁水，书等），由于该层级的特性，所有货物均漂浮在海面。每个物品上都粘贴了一张镀金的小金属片，上面填写有商品的标价。这些标价各不相同，有些是以杏仁水瓶数、黄铜指南针数为货币单位，有些以其他物品作为货币。如果流浪者想要购买该商品，就需要按照标价“付款”1
//
//- 收起
//商品名称	标价	描述
//"便携木筏"	一般为2-5瓶杏仁水或1-3块黄铜指南针。	该物品未被购买时表现为一只模型小木筏，但在购买后会变成约四米长、全新且拥有船桨的蓝色木筏，木筏上有黑色指南针标志。
//"吸盘悬浮锚"	约10-30块黄铜指南针。	末端有类似头足类动物触手的红色吸盘的船锚。该物品质量并非很大，但并不受该层级海水特性约束，可在被释放后沉入海底。其上端有圆形把手，握住把手再将船锚抛出，船锚会在几分钟后被固定。把手大小可伸缩2，可用于套住木筏并将其固定，且一旦固定后除购买者外无人能将木筏移走。
//"OI剪刀”	2-3瓶杏仁水。	该物品为黑色，外观与正常剪刀无异。将其闭合并放置于两物品间，在慢慢打开剪刀后两物品间会被某种黑色粘性防水物质紧密粘连。可再次使用"OI剪刀"剪断该物质。
//任何漂浮在该层级海面的纸张等易吸收水分的物品在该层级的海中均会变得无法被水浸湿，但值得注意的是，当流浪者将此类物品“购买”后，该物品的防水特性将会立即消失。故辨别已购买货物的方法包括：
//
//查看物品是否被浸湿。
//物品表面是否仍有金属标价牌。
//查看物品磨损情况。多数情况下，货物均为全新且无任何磨损。
//据目前拥有的资料显示，任何不付款购买商品但却擅自拿取商品的流浪者会在几分钟后被一或几条巨大的红色头足类动物触手卷入海底，且这时流浪者的身体会不被该层级海水的特殊性质影响立即下潜，不知所踪。
//
//- 收起
//部分数据记录	
//流浪者A	该流浪者购买了一瓶杏仁水。在支付了三个黄铜指南针后，该流浪者安全离开。
//流浪者B	该流浪者购买了一把"OI剪刀"。该商品标价是2瓶杏仁水，但流浪者只放了一瓶，几条带有吸盘的红色触手卷住了流浪者的右手臂，直至流浪者慌忙“支付”杏仁水后触手才放开该流浪者并返回海底。
//流浪者C	该流浪者直接拿走了一块乙丙烯毛巾。其随后被一条触手快速拖入海底。
//实体
//Level C-317内几乎不存在任何实体，唯一已知实体是把流浪者拖入海底中的头足目动物触手，据推测该实体可能是一种古老且巨大的红色头足目动物，但该实体的实际样貌和生存习惯等仍不清楚。
//
//基地、前哨与社区
//M.E.G.”搜索者”木筏小队
//原均为M.E.G.搜索队员，但拒绝归队且拒绝跟随E.E.A采集队离开该层级。
//每位成员均拥有一只或几只木筏
//对流浪者保持友好
//拥有大量物资储备
//约10-15人
//E.E.A.采集队中转站A
//该中转站为采集队起到临时休息点、路线管理标、抵御抢劫物资者的作用。
//该中转站为由约六艘木筏拼成的平台，平台由两个"吸盘悬浮锚"固定。
//成员很少长时间停留，采集队有固定时间穿越该层级并顺便购买物资。
//经常与"海洋商人"交换物资，但双方并未明确合作/建交。
//会允许流浪者跟随并离开该层级，但不会主动向流浪者提供物资。
//每批采集队约20-40人，在该层级的停留时间平均约为60分钟。
//"海洋商人"
//此层级的常驻民
//乐于购买或交换物资
//拥有多个小型基地
//对流浪者处于中立状态
//约40-50人
//“游弋拾荒者”
//成员均拥有各类武器，一般会在头顶佩戴各类帽子或头饰。故建议尽可能远离任何佩戴头饰或帽子的流浪者。
//成员均有敌意，会抢劫其它组织成员或流浪者。
//会利用交易特性对“海洋商人”的多个基地进行多次袭击，并因此与该组织持完全敌对状态。
//成员数量未知
//入口与出口
//入口
//在Level C-205找到一片中间摆放着一瓶杏仁水的结冰湖面，走上前去拿起该杏仁水即可切入该层级。
//在任意生存难度0的层级中找到一面由海水和纸质小票组成的水墙，全身进入水墙后便会切入该层级。
//更多入口有待调查。
//
//出口
//在该层级的一片海域中找到一个巨大的漩涡，进入漩涡后会切入Level C-497。
//购买一个装有灰色沙子的沙漏后，其会立即在流浪者手中破碎，当灰沙全部流入海水中后流浪者会感到困意，此时立即进行睡眠即可切入Level C-269。
//购买一个雪花玻璃球后将其抛向天空，头顶会立即开始下雪，此时雪花并不会浸入海水中，而是会在海面上堆积。当流浪者在水面以上的身体完全被雪覆盖后，流浪者会切入至Level C-113。
//购买一个商务大厦模型后使其飘浮于水面之上，流浪者会在此时向后倾倒并切入至Level 11。
//找到一个被固定但浮在海面的极小木制房间，进入房间后将门反锁，地面会开始向外渗出无害的水雾。在水雾充满整个房间后，切入四周的墙即可进入Level C-430。
//更多出口有待调查，以上所提及物品每次的标价记录均不相同，故不在此写明价格。
//
//作者信息
//« Level C-316 | Level C-317 | Level C-318 »
//
//脚注
//1. 将标价数量的黄铜指南针或其它物品放在需要购买的商品的旁边。稍等片刻，当货币物品沉入海底后即视则购买成功。
//2. 仅能由购买者进行操作，他人无法改变把手松紧度。
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1317{}