//Level C-348
//评分: 
//+11
//+
//–
//X
// 
//
//生存难度：
//等级 4
//
// 
// 
//实体绝迹
//Level C-348是后室C层群的第348层。
//
//描述
//4.jpg
//一张金属通道的照片。
//
//Level C-348是一处具体长度未知的密闭银灰色金属通道。该层级的整体大致表现为一条笔直的甬道类结构，其内部没有任何的拐角或岔路。在通道内部存在有大量的环状凸起，经检测发现这些凸起的表面极度光滑，部分凸起的表面甚至达到了绝对光滑。这些环状凸起在该层级内平均约1米出现一个，偶尔会出现两个凸起互相间隔2~3米的情况。
//
//经化学与物理检测发现，用于构成该通道的金属不属于任何一种已知金属，而且它的金属活动性低于已知的一切金属元素。故在一般情况下，只能使用物理方法对该金属通道进行破坏。
//
//金属通道通向两个方向，其中一个方向不存在任何光源，而另一个方向则充满了白色的光芒。当人员朝向光亮方向前进时，光亮方向尽头的白色光芒会逐渐远离该人员，使人与光源之间的相对距离始终保持不变。任何朝向光亮方向的行进探索均没有发现该通道的尽头。当人员朝向黑暗方向前进时，该人员会感到来路不明的心悸与恐惧。向黑暗方向前进可以到达该层级的出口。
//
//截至目前为止，没有任何关于在该层级内遇到其他人的记录被发现。根据专业人士推测，该层级或许具有某种特殊的空间结构，致使其每次仅能够容纳一名人员或者让人员之间间隔极远。
//
//当有人在该层级内停留时间过长时，该层级会发生一系列巨大的变动，即该层级的内壁会逐渐变得光滑并伴随着巨大的金属扭曲声向内压缩。这种变动的速度会随时间的推移而不断加快，过于光滑的墙壁与地板将会导致人员无法正常站立与行走，而不断压缩的通道内壁将会导致人员被困死在一个区域内无法行动。这种变动将会在人员被彻底困死之后停止，此时受害人员往往会被彻底困死在一个区域内无法行动。值得注意的是，这种情况下，受困人员将会感受到一股莫名的安全感，这通常会导致受困者毫无反抗的被困到死亡。
//
//实体
//尚未在该层级内发现任何实体。
//基地、前哨与社区
//受层级特性影响，该层级内不存在任何人类聚集地。
//入口与出口
//入口
//未知。所有进入到该层级的人员均在逃离该层级后遗忘了该层级进入方式，并且任何被带入该层级的信息记录设备均在逃离该层级之后失去了所有有关该层级进入方式的记录。
//出口
//向金属通道的黑暗方向行走大约一千米后将到达Level 0。
//
//
//    -  收起
//提示：本记录来自于一个意外切入到Level 1的破旧录像机，经数据恢复之后检查发现其内部内容与该层级有关，故将其归档到本页面内。
//
//[之前的内容受到层级特性影响而丢失]
//
//[画面模糊漆黑，声音嘈杂不定]
//
//相机主人：……哼嗯……[衣物摩擦声]……
//
//[视角剧烈摇晃]
//
//[沙沙声]
//
//……
//
//[画面转向一个充满白光的金属通道，随后又转向了一条漆黑无比的通道。随着相机主人的动作，周围充满了摩擦声的回声]
//
//相机主人：……还是查不到……[咳嗽声]这图像匹配识别AI真的准么……
//
//[视角重新开始摇晃，但是可以判断出相机主人在向着光芒的方向前进]
//
//[皮鞋跺在厚重金属地板上的咚咚声]
//
//……
//
//相机主人：……啧……一看就不是啥安全的地方，太压抑了。[擤鼻子的声音]
//
//[脚步声与细微的衣物摩擦声，伴随着各种各样奇怪的回声]
//
//相机主人：[咳嗽声]靠，这破AI又说这是个新层级…………该不会真是新层级吧……
//
//[咳嗽声]
//
//……
//
//[大约二十分钟之后]
//
//[相机视角晃动，朝着黑暗的的方向晃了一下，随后朝向了地面]
//
//相机主人：……走挺远了……歇会吧……
//
//[相机视角位置下降，降到了地板上，视角朝向了那个充满白光的通道]
//
//[掏口袋的声音]
//
//[从烟盒里掏烟的声音]
//
//[一次性打火机点火的声音]
//
//相机主人：[深深地吸了一口烟]……咳咳……[又深深吸了一口烟]
//
//[相机视角里飘来了烟雾]
//
//相机主人：还得这样走多久啊……[深吸气]……要是真的还能回Level 1我一定给自己买一堆最好的雪茄……
//
//[远处传来了金属发出的吱嘎声]
//
//[类似于生锈铁门的门轴转动时所发出的声音，整个金属通道内回荡着令人不安的回声]
//
//相机主人：……嗯？[直起身体所发出的声音]……实体么？……
//
//[突然爆发出来的金属被扭曲的声音，听上去如同整个通道都被放入了轧钢机里碾压]
//
//相机主人：我操！！
//
//[相机突然被捡起，视角伴随着激烈的的脚步声出现了大幅度的晃动]
//
//[周围的金属扭曲声越来越响，不知从何而来的嗡嗡声回荡在整个通道之中]
//
//相机主人：[剧烈的咳嗽声]咳，喝[清嗓子的声音]
//
//[粗重的呼吸声，夹杂有一些咳喘]
//
//[相机拍摄到的画面混乱无比，不过依旧能够依稀辨识出相机主人正在朝向发光处奔跑]
//
//相机主人：……[过于含糊，听不出在说什么]，在……
//
//[相机突然被抛飞到了空中，与天花板撞击之后摔到了一个环状突起的旁边，镜头倒置着朝向了通道黑暗的方向，画面内没有人类的身影]
//
//相机主人：干！[人摔倒的声音]
//
//[金属扭曲声依旧在变响，相机视角内的通道伴随着扭曲声不断地向内压缩]
//
//相机主人：[挣扎声]……哎！[摔倒的声音]
//
//[几乎要被周围各种声音完全盖住的挣扎声]
//
//[金属通道向内压缩的速度越来越快，金属扭曲声如同雷鸣般刺耳]
//
//相机主人：啊——我操你——
//
//[金属扭曲声戛然而止，仅留下回声回荡在通道之中]
//
//[金属通道突然停止了压缩，但是其剩余的高度与宽度都无法保证一个正常成年人的常规移动]
//
//相机主人：……码……[摸索衣物的声音]……哈？
//
//[用手指指甲敲击金属壁的声音]
//
//[剧烈的咳嗽声]
//
//相机主人：……哼……
//
//[衣物摩擦声，伴随有一些躯体撞击金属壁的声音]
//
//[调试某种设备的声音]
//
//相机主人： ……没信号……
//
//[某种塑料外壳的电子仪器被放在金属壁上的声音]
//
//相机主人：……唉……
//
//……
//
//[大约半小时之后]
//
//相机主人：[均匀的呼吸声]……嗯……啊？……[咳嗽声]……我刚才睡着了？
//
//[咳嗽声]
//
//[摸索衣物的声音]
//
//相机主人：……这是过去多长时间了……
//
//[打开某种小型金属器具的咔哒声]
//
//[擤鼻子的声音]
//
//相机主人：……这么久了……要命……
//
//[衣物翻动的声音]
//
//相机主人：右腿卡住了，不过其他地方倒是还能动……相机在那边……[轻微的敲击声与摩擦声]拿不到……
//
//[几乎听不到的金属吱呀声]
//
//相机主人：……算了，走不了就歇会儿吧……正好我也困了……
//
//……
//
//[约四个小时之后电池电量耗尽，视频结束。在这剩下的四个小时里，视频里只有依稀的金属反光与轻微的窸窣声]
//
//……
//
//Kara博士的评语：这个层级对于人的精神影响还需要更多的调查。就目前而言，这个精神影响表现出的效果有些超出我的经验。记得把这个层级的生存难度等级往上调高一级。
//
//
//
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1348{}