//Level C-386
//评分: 
//+16
//+
//–
//X
// 
//
//生存难度：
//等级 2
//
// 
// 
// 
//Level C-386是后室C层群的第386层。
//
//描述
//Level C-386类似于一条无限长的小学学校走廊，主体由走廊、教室和与像走廊一样无限循环的操场构成。这里的外观与前厅相似，但该层级目前并没有观测到昼夜更替现象，似乎永远都是白天。学校的外形因人而异，每位流浪者看到的景象都会有一定差别，不过大体上是相同的。不要直视太阳，那会让人感到焦虑和不安。
//
//有的教室内部是图书馆，但这里的书都与前厅有关。在图书馆中央可以找到一个中国象棋棋盘，触摸它就会开始一盘棋局，奇怪的是并没有流浪者见到过对手，棋子全部都是自行移动的。曾有流浪者在棋局中尝试作弊，最终再也没有人见到过他。如果在棋局中取胜，会被传送到Level 0、Level 1或Level 5；如果失败，则会感到眩晕，然后被传送至Level 8。据报告称猎犬等实体不会出现在图书馆中，但这并不意味着图书馆内部是安全的，危险往往出现在流浪者自以为安全的时候，窃皮者可以自由出入图书馆，在图书馆中遇到任何流浪者都有可能是它们伪装成的。
//
//pexels-photo-256559.jpeg?cs=srgb&dl=pexels-pixabay-256559.jpg&fm=jpg
//Level C-386中的图书馆
//
//该层级资源匮乏，难以找到任何对流浪者有用的东西，不过有时能在饮水机中发现少量杏仁水。那些教室中除了课桌和椅子等常见教学用具之外没有其他东西，请不要在教室里逗留过久。
//
//该层级主要实体有猎犬、笑魇、窃皮者等，有报告称曾今有流浪者在该层级遭遇过2号实体攻击，但其真实性有待证实。这些实体通常在黄昏时出没，数量不定，对流浪者充满敌意。它们常出现在楼梯口或其他的黑暗处。
//
//该层级存在一种特殊效应，流浪者在这里几乎完全无法产生疲劳感和饥饿感，除此之外，据报告称有流浪者在探索该层级时产生了短暂的幻觉，陷入回忆，这似乎是该层级的怀旧感带来的，目前无法得知其原理，心理素质差的人可能会被永远困在回忆中，这种现象通常出现在黄昏时，可在图书馆内避免。据报告称流浪者在回忆中常常看见自己小时候的学校，并误以为自己回到了前厅。
//
//翻过Level C-386走廊的护栏，脚下会生成木质阶梯，阶梯会随着流浪者的前进生成，这些阶梯看上去摇摇欲坠，实际上非常坚固。沿着阶梯一直走下去将到达该层级的另一端，没有人回来过你将到达一个安全的地方。
//
//基地、前哨与社区
//黄昏旅社
//这是Level C-386目前规模最大的社区，常驻人口大约有200人，流动人口大约有100人，社区位于距初始位置约3千米的图书馆。该社区主要接收意外卡入Level C-386的流浪者，其常驻人员以体验黄昏时分回“家”的感受为乐，以幻觉麻痹自己，使自己产生离开后室的错觉，同时试图让其他流浪者加入他们。该社区对M.E.G.以及与M.E.G.结盟的流浪者不大友好。
//M.E.G.前哨站
//M.E.G.在Level C-386建立的前哨站，固定成员有50人，为流浪者提供帮助，物资由Level 11的M.E.G.基地提供。
//入口与出口
//入口
//进入该层级最安全可靠的方法是在Level 11中找到一个卡入建筑内部的人行道，从卡入点切入，有几率进入Level C-386，有报告称可以从Level 33和Level 52的墙壁切入这里。
//出口
//沿走廊走10公里有几率到达Level 52，穿墙切出可到达随机层级。
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1386{}