//Level C-347
//评分: 
//+14
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//Level C-347是后室C层群的第347层，于2019年4月30日被发现。
//
//描述
//购物中心
//一家购物中心
//
//Level C-347是一座高度现代化的城市，其占地面积约为6500平方公里。在Level C-347内，自然环境表现为凉爽的夜晚，气温恒定为19℃，湿度恒定为50%RH，Wi-Fi信号极强且极其稳定。时间在此层级内出现异常，具体表现为：日期会正常变化，但所有钟表（包括电子形式的）不可控地静止在凌晨的4：16。夜空多云，天空中可以看见月亮，但没有星星。
//
//货架
//一家超市的内部景象。
//
//虽然称其为一座城市，但Level C-347里称得上郊区的区域少之又少，乡村景观在此层级中不存在。该层级内所有建筑全部高度现代化，且或多或少地被霓虹灯装饰，呈现出大都市CBD的样貌。这些建筑全部可以自由进出。在Level C-347中，建筑物包括但不限于：货架上空无一物的便利店和超市，橱窗中没有任何物品的大型购物中心，没有顾客和店员的酒吧和咖啡馆，只有桌椅和电脑的高级写字楼，温馨舒适但似乎没有住户的公寓等。在建筑内部装潢完整，电力供应完善，所有东西都能正常使用，看起来好像整个城市在正常运作。但目前此层级内没有发现任何实体。Level C-347的街上没有任何交通工具，地铁和火车站中也没有运行的列车。有流浪者报告称“长时间停留在此层级会感到孤独、空虚和沮丧。”因此Level C-347被流浪者形象地称为“空城”。
//
//此层级中物资可以说是紧缺，因为它们会非常零散地出现在这座城市的任何一个地方，想要寻得非常不容易。物资主要有：杏仁水、幸运豆奶、皇家口粮等，有时甚至会出现新鲜的果蔬和肉类。
//
//事件
//“蓝月亮”
//蓝月亮
//一名流浪者拍下的“蓝月亮”景观
//
//“蓝月亮”事件是指在Level C-347中的特殊现象，即天上的月亮会定时地变为蓝色。
//“蓝月亮”事件通常在新月前后出现，表现为：月亮反月相地变成满月并且呈现出明亮的蓝色，天空中有源头不可知的舒缓、空灵的音乐，一些流浪者称这些音乐就是令他们感到孤独、空虚和沮丧的原因。“蓝月亮”会持续6小时左右。
//在“蓝月亮”持续期间，此层级的物资会自动补充，但不一定会在原有位置。
//
//基地、前哨与社区
//“夜行者”
//“夜行者”组织是由流浪者Rubin Nightingale发起的自助自治组织，其成员为有意愿在Level C-347内长时间生活的流浪者，目前规模为50人左右。据相关人员透露，此层级的物质可以支撑100人生活。
//“夜行者”的宗旨是收集此层级内的物资并在此层级内安全和平地生存下去，所以他们每天的工作就是在此层级内搜寻物资，并帮助迷路的流浪者，将其中有意愿的人吸收进“夜行者”。
//“夜行者”组织并没有试图脱离于M.E.G.，其成员也只是想在此层级过上宁静的生活。
//“一座空城，很自由，不是吗？”
//
//“夜行者基地”
//是“夜行者”的总部，位于中心广场旁边的“黎明酒店”内。
//所有的“夜行者”成员都被安置在这里。分配工作，救治伤员等事务都在这里进行。
//入口与出口
//入口
//目前已知的入口为：
//
//在Level 11的夜晚中，在没有实体的地方游荡有概率被传送到Level C-347。
//在Level 57中从一幅描绘着蓝色月下的大厦的画切出就会来到Level C-347。
//在Level C-96中昏迷后有极小可能在Level C-347的写字楼里醒来。
//在Level C-74中捡起一块蓝色的石头会被传送到Level C-347。
//出口
//在一个播放着萨克斯音乐的购物中心停留超过12小时会被传送到Level C-38。
//在地铁站中睡着会被传送到Level C-389。
//打开珠宝店的橱窗会被传送到Level C-22。
//切入礼品店的货架会到达Level C-113。
//如果强制调整时钟至凌晨4：30，会被传送到Level C-305。
//由于此层级场景多样，更多出口尚待探查。
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1347{}