//Level C-396
//评分: 
//+11
//+
//–
//X
// 
//
//生存难度：
// 
// 
// 
//Level C-396是后室C层群的第396层。
//
//描述
//Level C-396推测是一片无边界的草原，Level C-396的时间1、特征等随季节所改变，根据记录Level C-396的季节与外界不同，其中包括：
//
//动植物异常变化。
//环境异常变化。
//星体异常变化。
//季节标签不同2。
//材质变化。
//草原各季节的特点
//春原
//春原地表草坪呈亮绿色，草丛散布于地表，草丛中拥有青绿色花朵，任何实体闻到花香都可以使内心有较安定，且在一定的地平线上经有不定时凉风吹向各处。天空为青绿色并有深绿色的云朵，春原天空即使未有天体出现过，但始终处于白天状态。
//
//IMG_20220503_161525.jpg
//春原某处
//
//地表中含有河流水系，水系以东北角斜跨地表。水系色彩为亮绿色，属性清爽、无害。春原的房屋色彩由亮绿色向暗绿色渐变，房屋内部渐变为所上述色调度呈现顺序相反，其色彩渐变未有影响材质，材质类似为CD灯而密度确是CD灯的5倍。
//
//草地中时有出现过羊群，羊群行为无异常，羊群的皮毛呈绿色，皮毛类似于草根。
//
//暖原
//暖原的草坪呈亮黄色且尖部为青橙色，地表草丛色彩为黄色，其中拥有深黄色的花朵，散发出比春原境内花朵，更浓郁的气味其镇定效果，强于春原内的花朵。暖原的河流水系以放射状分布，且水系色彩为土黄色，液体属性类似温水、无害。
//
//暖原空中存在着四个太阳，分别位于空中的四个方向，呈橙色或太阳原本色彩。根据调查并非为热等离子体所构成，且未出现黑子、日冕、等离子泡、粒子流等现象。
//
//IMG_20220503_165232.jpg
//暖原某处
//
//时间停留于中午，因四个分别于天空中的太阳产生的热量之多，此身在暖原季节的流浪者务必注意是否有灼烧感。
//
//暖原的房屋材质为青瓷砖所锻造，密度接近于花刚岩。每阶青瓷砖独有一种黄色且重复类型。
//
//枫原
//枫原草坪至白天时为干枯，晚上则为未干枯。白天时天空被干枯枫叶所覆盖，且未知时间落下零散的枫叶片。3晚上则天空被未干枯枫叶所覆盖，且飘落下零散枫叶片，不定时飘落回至天空。
//
//IMG_20220503_182701.jpg
//枫叶某处
//
//枫原空中拥有类似于枫叶形状的太阳，其中不可遇见月球，但依然持续着昼夜。白天时空天中的云朵替换为巨型干枯枫叶，晚上则替换为巨型未干枯枫叶。
//
//羊群同完全覆盖表面，且羊群与天空、云朵、草地同一特征：
//
//白天干枯枫叶。
//晚上则未干枯枫叶。
//枫原水系形态以枫叶边缘线，由西北角不断重复着跨越地表，且水系色彩为暗黄色液体属性同春原。
//
//枫原的房屋材质由枫叶木材制成，其木头表面接近于光滑。
//
//寒原
//寒原由于本身特点，阻止自身信息向外传播，所无法被任何信息方法所记录，但可通过流浪者的报告所用笔试记录寒原。
//
//下列一份流浪者的报告：
//
//1号报告
//没有温暖的太阳，但有霞思的月亮，时间在那幽冥且安静的晚上，看寒原那雪白天空下起了雪，覆盖住草原变成白雪皑皑一片就像白色的布，这片草原站在上地表中，会有冷风吹着你，但它不会伤了你。
// 
//寒原之中没有实体，因为它们是坏人所被冻成一座座冰雕，展示着各自的姿势，水系以雪花形状所绽放在寒原这片大地之上，而河中水很寒冷可千万不要去摸它们因为怕你冷到，没有规律的路上会有吊灯为流浪者照亮光明的道路，让我们不畏怕死亡。
// 
//如果你看房屋穿着类似白色的衣服那是，房屋们怕冷所以它们穿上了白色绵衣，当你随着光明道路引入房屋时，里面就像进入了它们的怀抱中，是那样的亲切、温暖……
//
//2号报告
//太阳为这一片卓然的凛冽而敬畏，在万世的讴歌中象征着“至高无上的力量”的它不得不退居入一片惨白无瑕，它深知自己的强权有愧于凛冽得看似不受人待见却充斥着纯澈的民主。
// 
//月儿亦不为自己身着太阳的光而低声下气——此非她私自的请求，而是在公平的审判下太阳应尽的义务。她那骄傲的皎洁稀释着冰川雪莲的清香，慷慨解囊，撒向高原与天际相接处的大漠孤烟时已化为严寒义无反顾的呼啸。冰冷彻骨的雪不愿彻谁的骨，窒息却不荒芜，它与这片高原一样，只有无尽与世隔绝的沉沦享受。野生的霜不是那诗人凝结着愁思的箜篌引，凤鸣声也算得上是对这将寒凛视为自己灵魂的高原的亵渎——意识不配成为它的赝品，是为“寒原”。自然或人文，世间一切都是与它敌对的原罪。“岂曰无衣，与子同袍。”寒原不曰其无衣，几曾着眼瞥同袍？
//
//冒险者1号与2号：寒原跨度长达一个季节，怎么这时候才发现写的报告？也不知怎么回事，看着报告怎么那么抒情？真是让人疑惑……
//
//
//草原上的告示牌
//以下两种样式为目前所记录的告示牌，推测该空间内拥有更多样式：
//
//在这片草原之上你想跑就去随心跑去吧，你想走路就去走去一片片不同的草原上吧！只要你愿意，现在这些事情对你来说轻而易举，不会像生活那样的因难的。我们不会欺骗你，请相信这里永远没有痛苦。这里是你在后室中有生之年所能到达的最令人安心的地方。
//
//我与你已经尽力变得更好了，不然真的配不上这天堂般的地方……它在治愈，令人安心。空旷而不虚无，简约但不简单……相信我伙计们，来这里吧！所有痛苦的人都该来这里！
//
//- 点击隐藏
//一颗树生长在空中，因为那里风景优美，所以，人们称它为——大树。大树一直在空中站着。
//
//我们一直往下看，看见了它的朋友，它们像一把把大伞，遮住了夏天的炎热，为人们挡住了风雨，还把那些凉爽送给了人们。
//
//大树还有一个名字，叫“橡树”，它的叶子像大扇子，可好看了。大树还有一个寓意，就是“长寿”，它的生命力非常顽强。
//
//它可以活到几十年。爱大树，更爱这片草原。爱护草原，不去破坏它，保护它。它是我们的朋友，我们应该去保护它。
//
//如果没有了大树，那么，天空将会变得很灰暗，小鸟也不会在树上安家，树木就会减少，我们呼出的二氧化碳也会增多，氧气减少，那么，人类也会变得很瘦弱。
//
//如果没有了大树，小鸟也不会在树上安家，树木就会减少，地球上的氧气也会减少，人类也会变得很瘦弱。
//
//如果没有了大树，风沙会经常来袭击我们，所以大树能净化空气，我们要爱护它，大树还能美化环境……”
//
//“①我们爱你，别害怕②保护你③务必伤害我们④如果你累了那体息一下吧⑤这个地方真是一个僻难所⑥没有什么事物打扰你⑦你在这里可以继续活下去了！”
//
//研究人员根据第三种告示牌得知因未知原因所漂浮在空中的橡树，其中告示牌称为“大树”。另外“大树”叶子生长繁密且巨大，树的几十米下边，有着许多种不同种类的树杂交生长在同一特定区域内，在不同的树有着分布杂乱的各类鸟宜居。
//
//综上所述，我们可以推测：
//
//“大树”一旦陨灭整片草原，此层级可能坍塌，将转化为无法生存的灾区
//这片区域身处于异常空间中，无论如何寻找也无法未发现该区域。
//草原上的房屋
//下叙来自M.E.G.的记录：
//
//第一种:
//
//房屋占5平方米，且可从内部寻找许多食品类、实用异类物品，亦可娱乐类的物品供人消遣。
//
//第二种:
//
//结构类似于前厅的别墅。且房屋在四季的变化下的材质、外观都有所不同。
//
//房屋内部与前厅的别墅内部是保持一定上的水平，经过调查房屋内部物件应有电子产品、宜家产品等等，性质表现与正常物件可正常使用。
//
//房屋内部与外部不需净理，因脏污会产生某种特殊的效应变作氧气并，房屋有规律整洁。4
//
//内部应有耳语，内容大致如下：
//
//理想中的家？你可以完全放松你那颗沉重的心了？享受生活吧？
//可不用为烦心事所操心，只要管宜居就行，休息吧！
//这里不会有人类似校园暴力或家暴的形式欺负你。
//除了以上这些推测有更多且记录发现这些不定时耳语未有过重复现象。
//
//根据目前的记录，流浪者能否遇到房屋是完全随机的，而遇到第一种房屋的概率比遇到第二种房屋的概率较大。
//
//下列为记录文件。
//
//- 点击隐藏
//>……
//> █：我好像梦见了四处草原，每处都像美丽安心我能感受到耳边诉说着：“累了就体息吧没人会怪你，好好放松吧我们会永远保护你，安慰你……”
//> █：好吧累了好吧，放下一切负债的事，就休息吧。
//基地、前哨与社区
//草原上的心理询问室
//此层级存在一个由约二十名一般流浪者和心理医生组成的基地，他们会向其他存在心理问题的流浪者进行帮助。
//
//草原生存者
//这是由10个有心理疾病的人组成，他们会向饥饿，疲劳乏力的人进行帮助。
//
//草原生存者和草原上的心理询问室有着交往。
//
//入口与出口
//入口
//草坪与草丛会在其他层级随机出现或消失，试图切入草坪或草丛有概率进该层级。
//出口
//找到一块白色或黑色的草坪切入后该层级会将流浪者传送至一个无实体的层级或基地，而在这之前流浪者可以在这生活。
//作者信息
//脚注
//1. Level C-396时间日期和现实中国的汕尾时间日期一样，但Level C-393里的一天是外界的4天。
//2. 春季为春原，夏季为暖原，秋季为枫原，冬季为寒原因这样叫法根据每个不同的季节特点而来。季节来临转变时，导致所有流浪者们暂时性昏迷，醒后所季节转变模样。
//3. 落下的枫叶并非为天空中所覆盖的枫叶。
//4. 三天之后产生特殊效应
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1396{}