//Level C-336
//评分: 
//+21
//+
//–
//X
// 
//
//生存难度：
//可塑造环境
//战略级资源
//无有害实体
//Level C-336是后室C层群的第336层。
//
//描述：
//Level C-336是一个超现实空间，具体表现为由一个个立方浮空结构组成的空间。该层级能够看到的所有原生物质，都是一种各色且光滑的坚硬物质，这些物质组成了一个个浮空结构。而向任何一个方向望去，浓见度之外都将是一片紫色的扫描线网状图形的样子，而流浪者将发现他们头顶之上的远端无时无刻都悬挂着一个紫色的发光体，给予整个层级照明与温度1。
//
//鉴于该层级的超现实空间，对一些接受现实能力差的流浪者将产生勿扰，以下将列举已知的区域类型。因此层级空间无限延展，有发现新的区域类型请立刻通知M.E.G.。
//
//vo8VeI.jpg
//浮空岛区域的特写（一）
//
//voGiNV.jpg
//浮空岛区域的特写（二）
//
//浮空岛
//这是由一系列大大小小的橙色立方结构结团组合而成的浮空岛屿组合而成，是整个该层级出现最多的区域类型，也是目前而言探索难度最低的区域类型。
//
//浮空岛的各个立方结构并非“粘合”在一起，而是类似互相发生了引力而相互吸引。其引力强度并不相同，一般是根据不同立方结构的大小而判断。如遇到一些小型立方结构组合的区域，流浪者需小心不要贸然下脚，否则将可能造成力量过大而导致脚下区域结构不稳定，而导致分开。浮空岛被证实并不是完全实心的，如果流浪者跌入空腔结构，而在上方立方结构已经合并而未能逃脱，请立刻联络M.E.G.人员，将会派遣专业救援人员，请不要放弃希望。
//
//探索该区域的时候建议流浪者佩戴手杖，除去避免因地面不平而摔倒外，用手杖敲击不同的立方结构可以发出声音。有时流浪者可以再未被探索区域发现一些空心的立方结构，可通过敲击立方结构的声音不同而判断。使用破拆工具可以轻易敲开边壁，可在内找到诸如：杏仁水、灌装龙肉等补给品。
//
//voJKMQ.jpg
//碑之林区域的特写（一）
//
//voJMrj.jpg
//碑之林区域的特写（二）
//
//碑之林
//这是由一片灰色的高大立方结构层层林立而组成的“方形丛林”，留给流浪者可探索的空间只有那“碑”与“碑”之间的空隙，也是目前被报告出现数量第二的区域类型。这片区域浓见度相比其他区域类型而言很低，并且是唯一看不到扫描线的区域类型。
//
//碑之林的立方碑最底一般在两米高左右，而最高可达几十米高，但平均高度通常都在六七米左右高，因此尝试翻越立方碑是不现实的。因这些立方碑之间的空隙并非一致，这导致了整个碑之林犹如一个迷宫，探索该区域时请流浪者设置参照物。但有些时候，一些立方碑将会降低高度直至与地面平齐，但也会导致其他没有碑的区域伸出新的立方碑，探索的时候需要注意。稍加不慎，整个碑之林的结构便与之前将会完全不同，并且这个结构变化是随机的，所以请不要尝试等待区域变回先前的状态。
//
//如果出现了在碑之林内迷路的情况，请不要慌张，因为这是在此区域探索会发生的常态。目前所有曾在碑之林内迷路的流浪者2都提到了一件事，那就是这个立方碑迷宫里，一定会存在出口。并且很多立方碑会和浮空岛的空心立方结构一样，是空心并且敞露的。因此在碑之林内饿死或渴死是不太可能的。
//
//vo02qS.jpg
//螺旋面区域的特写（一）
//
//vo0faQ.jpg
//螺旋面区域的特写（二）
//
//螺旋塔
//这是一个由大量立方结构螺旋排列而组成的一个类似高塔的结构，该区域相对于与其他区域类型而言是一个稀少的区域。但相对的报酬也十分丰厚。
//
//螺旋塔是探索到目前阶段只发现五座的稀少区域类型，通常高度约50米。唯一可以抵达顶端的方式，就只有通过利用立方结构因螺旋而形成的凸起为落脚点，并向上攀爬。但这些立方结构与浮空岛上的一样，并不是牢牢固定在空中的，当遇到外力，这些立方结构会发现一定程度的位置偏移。所以攀爬螺旋塔的流浪者请务必小心，因此原因而失足坠落。
//
//但当攀爬到顶端之后，其得到的报酬也是极其丰富的。螺旋塔的顶端是一个平台，平台之上有除去围在靠近平台边缘装有大量会随时间刷新的补给空心立方结构外，最中心有一个台子，在此可以找到控制器（后文提），这对M.E.G.对此层级的评价的改变的原因之一，但每个螺旋塔的控制器只有一个，并且不会刷新。目前五座螺旋塔成为了整个层级所有流浪者聚落赖以发展所最关键的资源点之一。
//
//vHjVwq.jpg
//破碎区区域的特写
//
//破碎区
//这是此层级三个过渡区域类型的其中一个，也是相对而言最为麻烦的一个，因为这里用无序来形容十分的贴切。
//
//破碎区是一个两个区域类型之间过渡的区域之一，它由大量漂浮在空中并无规律运动的立方结构。但流浪者无需惊慌，因为这个区域内的重力极其微弱，似的流浪者可以轻易地跳跃到那些无规律运动的立方结构。
//
//vHjG01.jpg
//方块海区域的特写
//
//方块海
//这是此层级三个过渡区域类型的其中一个，也是相对而言比较轻松的一个，因为这里就是一片方块之海。
//
//方块海是一个两个区域类型之间过渡的区域之一，它由密集的立方结构漂浮在空中并随波逐流。直接跳入内部是安全的，因为这里几乎没有底部，并且整个区域有一股类似浸泡在水里的浮力，也并不会致人缺氧。任何人都能较为轻松地度过这里，很多流浪者表示就想跳进了能够浮起来的沙滩球池一样。
//
//vHjcAP.jpg
//明灯区区域的特写
//
//明灯区
//这是此层级三个过渡区域类型的其中一个，也是相对而言最为轻松的一个，因为这里只有一片灯光。
//
//明灯区是一个两个区域类型之间过渡的区域之一，它由一个始终平坦的区域与大量发光立方结构组成。行走在这个区域，头顶上方的紫色太阳将会消失，但大量颜色各异的发光立方结构将会照亮这里。很多流浪者表示行走在这个区域，会感觉自己的心情会变得很舒畅，烦心事都会消失。多在此区域活动是被认为对身心有益的。
//
//vHvnHI.jpg
//大厅的天花板
//
//大厅
//这是整个层级唯一的一个区域，这是M.E.G.层群C“矩阵”基地建立的原因，也是除控制器外调整此层级难度的根本原因之一。
//
//大厅是由多种颜色的立方结构互相解压组成的墙壁而因不明原因形成的空腔。在一次M.E.G.对此层级的初期探索时发现了此处，并发现了一个RJ45接口。经过测试，连接了这个接口的设备的网络速度可以达到4800Mpbs，这对整个后室甚至前厅而言都是一个难以想象的网络速度。随后，以此大厅为中心，M.E.G.层群C“矩阵”基地得到了建立。并因此对有关对后室白鼠的后续研究计划重新启动，相关人员也都迁徙到了此处。
//
//控制器是在五座螺旋塔内发现的一种独特物品，其造型类似一个手提式吸尘器上组装了一个类玻璃制成的瓶子。当流浪者手持控制器的时候，一个类似“UI界面”的全息影像将出现在流浪者的眼前。将控制器对准一个非生命物体时，那个物体在操作者眼中将会是闪闪冒着白光的，但如果物体大于一立方米，那么就只有一立方米范围内的区域会闪光。控制器一共有红绿蓝三个按键，当对准一个闪光的物体按下红色按键时，该物体就会被直接吸收进控制器内，并以液态的形式压缩储存在瓶子内，不同物质的液体不会混合；如果再对着发光区域按下绿色按键后，最后一个被吸收的物体将会原封不同的放在发光区域内，但在此层级外使用时只能使用红色按键而不能使用绿色按键；当对一个立方结构按下蓝色按键后，操作者的眼前将出现一个输入界面，界面内部全部都是二进制代码，输入代码可以改变该立方结构的状态，比如向一个方向移动等，可以用来制作交通方式或电梯等设施。
//
//这意味着，流浪者可以依靠控制器收集任何有用的物质并塑造此层级内的环境。目前全部由M.E.G.所管辖3。
//
//基地、前哨与社区
//M.E.G.层群C“矩阵”基地
//本来是一个科研基地，但因为发生了一些与B.F.P.F.不愉快的事件后，大量流离失所者被带到此处，逐渐发展成了M.E.G.规模最大的基地之一，近1/3的C层群活动的M.E.G.人员在此驻扎。该基地占地面积极大，功能齐全。以下为各个区域的基本介绍：
//
//A区
//A区是M.E.G.的研发区域，以大厅区域为中心建造。绝大多数的科研人员都在此处工作或即将调往此处。包括负责研发后室科技并制作有利于流浪者生存与探索的工具的研发部门，负责研究后室白鼠等上古后室文明遗留物而修复利用的考古部门，专门研究后室内科学运行逻辑而加以了解后室运行规律的后室科学部门等。
//
//B区
//B区是用于给流浪者居住的区域，由红星建筑队参与设计并建造。拥有大量不同风格的街道，但目前不对其他团体人员开放。目前常住人口预计超过八万人，但预留居住区域空间只利用了不到1/4。
//
//C区
//C区是综合区域，也是目前唯一对其他团体人员开放的区域。这里是综合区域，你可以找到商店、图书馆、理发店以及一些娱乐场所。这里支持开放自由的贸易模式，任何申报都可以在其选择的店铺进行买卖贸易，只要不进行违禁品勾当。
//
//D区
//D区是维持整个基地运作的核心区域，因为出去外出小队的探索外，这里也种植着大量作物。除去小麦与水稻以及玉米等这一类作为粮食的作物以外，西瓜、桃、梨、苹果等作物大量来自前厅的作物在近期内也都得到了极大地发展，预计很快就能流通时市场。
//
//B.F.P.F.“资料网”基地
//签署协议之后B.F.P.F.在此层级建立的一处大型基地，得到来自大厅的网络直线后主要用于储存资料。目前有300名B.F.P.F.人员，与2000名流浪者。开放贸易，对流浪者友好。目前与“矩阵”基地关系发展良好。
//
//E.P.B.科学研究站
//实际上处于“矩阵”基地A区内，与M.E.G.各实验部门进行友好交流，但整个区域高度自治。
//
//红星建筑队成员休息区
//位于“矩阵”基地B区内，整个矩阵基地的大部分设计由红星建筑队设计。
//
//入口与出口
//入口
//在Level C-137内排完队，将会来到此层级。
//在任意层级对着一个极其规整的立方物体切出将有极高概率来到此层级。
//出口
//跳进虚空，将会来到一个生存难度低的层级。
//作者信息
//« Level C-335 | Level C-336 | Level C-337 »
//
//脚注
//1. 因为无论何时何处观察这个“太阳”都处于正上方，所以只要处于露天区域的地方不存在阴影。
//2. 目前该层级内，还没有出现过人员失踪的报告。
//3. 实际上再签署了不能进行侵略性行为的相关协议后，将部分交付给了其他组织。具体为：M.E.G.保管两个、B.F.P.F.保管一个、红星建筑队保管一个、E.P.B.保管一个。
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1336{}