//Level C-390
//评分: 
//+8
//+
//–
//X
// 
//
//生存难度：
// 
// 
//实体已绝迹
//Level C-390是后室的第390层。
//
//photo-1516417156595-3ca5df62a3a4?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1331&q=80
//Level C-390当前环境
//
//描述
//Level C-390是一面积未知的沙漠荒野，并且拥有少量不可饮用的水。Level C-390的边缘似乎是无限的，有许多流浪者在该层级中探险行动中无法找到该层级区域的边缘处。
//
//当流浪者进入Level C-390时，他们会感到呼吸困难并有较严重的中暑现象。建议在进入该层级前储备大量的杏仁水，或其它层级中基地、前哨和社区中获取一件过滤式的防化服。
//
//Level C-390的各个角落都存在一些高楼大厦，尽管这些建筑已经处于荒废状态，其内部的设备已基本全部无法正常使用，但依旧能找到正常运作的两至三台的电脑设备。
//
//Level C-390似乎会在流浪者进入后触发流浪者想要自杀的情绪状态，该状态的强度是随机性的。推测该层级的空气带有能控制流浪者情绪的未知病毒，传播途径分别为空气传播、皮肤接触的传播1。另外Level C-390环境会在一次沙尘暴事件后，两小时内将重置该层级所有环境的时间段，并重置至两小时前的环境状态，因此不断循环下去。
//
//发现记录
//M.E.G.曾在该层级进行一次探索侦察，并发现该层级的子层级空间，该子层级空间位于Level C-390地下约3km处的巢穴基地，探索人员在该空间中发现原“告密者”组织一员在该层级长时间生存时的录音文件。
//
//- 收起记录
// 
//
//生存难度：
//等级 3
//
// 
// 
// 
//Level C-390.1是Level C-390的子层级，该层级的最大特点在于不受Level C-390的时间重置事件影响。
//
//描述
//photo-1544124488-80918322c89e?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=735&q=80
//Level C-390.1内部一走廊环境。
//
//Level C-390.1是位于Level C-390层级中沙尘暴中心位置，每当Level C-390发生一次时间重置事件后，Level C-390.1子层级中的环境将发生微妙改变，例如墙壁的结构、该层级中其他装饰的摆放位置等。当Level C-390发生一次沙尘暴事故时，Level C-390.1的墙壁没有碰撞机制2，这就意味着流浪者可以卡入墙壁之中，会有一定的概率切入至其他层级中。一些走廊的尽头方向随机发生改变，这导致流浪者在里面完全失去方向感。
//
//Level C-390.1内部也有其他层级的特殊物品、家具、装饰有着相似之处。例如：
//
//Level C-8里的一些家禽类动物的尸体。
//Level C-74的一块内容为“禁止前进”的交通标志。
//能看到大量类似于Level C-73的衣物、沙包和破损的书籍。
//类似于Level C-53里的座椅。
//Level 2的一些管道，并且，这些管道交错在一起。
//在该层级中发现一个漆黑的房间，进入后会看到Level 74的剧场舞台3。
//实体
//很少能看到生成实体，唯一生成的实体“死兆”，也有极少数情况下，会生成大量的实体，但该情况只被报告过一次。
//
//大量生成的实体会有：窃皮者、钝人、猎犬。
//
//基地、前哨和社区
//目前还未发现Level C-390.1中任何已知的基地、前哨和社区。
//
//录音文件
//在一次探索行动中，在该层级中的一个类似监控室房间中的一台电脑中发现原“告密者”组织一员在该层级长时间生存时的录音文件。
//
//[咳嗽声]
//
//名字，Porter ████，职位，“告密者”组织的重要成员。额…我为什么会在这儿？对，本想说在这里找回组织原本该有的东西，但现在我被困在这里了，我以为在之前这个子层级的空间和环境不会受到影响，可现在我觉得我的想法是错的，这里的环境也在不断发生转变。虽然吧，这里不受Level C-390的环境影响，但这里始终见不到阳光。
//
//而且这里居然会生成许多实体，因此不能掉以轻心。说实话，我宁愿死在酒窖里，
//
//我在这里一个人都没遇到，或许在我来之前，就有其他运气不好的家伙死在这里吧…真倒霉…操…我必须尽快联系到上司。
//
//行吧，环境发生转变了，我从监控室出来就看到发着红色微光的走廊，不知道怎么回事，看到这些灯光，我的意识似乎受到控制，幸好，监控室发出警告，我才缓过来神。
//
//操你妈的，杏仁水和氧气瓶好像要用完了，我必须获取更多能让我生存下去的物品。
//
//又开始了，环境再次发生转变，这次更严重，许多本不该属于这个层级环境的物品、家具什么的都卡在墙壁、地板和天花板中，甚至，我能看到一些尸体，额…有些家禽类动物还有…还有…人类的尸体，显然腐烂很久了，我看到许多实体在这个层级中生成，据我长时间的观察，有窃皮者、钝人、猎犬在这里生成成功，但死兆好像…没遇到过…
//
//我必须想办法尽快离开这里。
//
//很好，我找到一扇铁门，上面有带有权限限制的密码门，但我不知道怎么开启，因为我没有更高权限的密码，或许，可以试试一二三四？谁知道呢，那些高层可能会使用这么简单的密码吧。我还是回监控室看看那些电脑里有没有什么线索吧。
//
//我真的害怕了，这种孤独又安静的可怕席卷而来，那些实体突然间就没了，在发生这次转变后那些实体就好像蒸发一样不见了，而且…而且…为什么所有灯光都熄灭，应急灯射出来的红色灯光让我坐立不安，我在门口好像看到一个黑色的人影，我..不知道..我真的不知道，我发誓..我真的，该死！我操你妈的！[带着哭腔喊道]
//
//我是不是被他们看见了？
//
//.
//
//.
//
//.
//
//[注：此段落是额外发现的日志记录，该段落写满了“他找到我了，试图让我加入他们”以及“这里的悲剧还在不断上演中。”]
//
//入口和出口
//入口
//若要达到该子层级中，那么需要在Level C-390中迅速跑到沙尘暴中心位置，就能抵达该子层级。
//出口
//要完全离开Level C-390层级，需要找到一扇带有权限密码的铁门，目前猜测密码为“0390”4，打开后会直接到达Level C-101。
//若看到带有红色灯光的走廊，你将直接达到Level 255内的一个红色区域。
//- 收起记录
//基地、前哨与社区
//informer_logo.png
//告密者组织标识
//
//告密者
//部分幸存的流浪者描述，在Level C-390.1探索时总能看到一些明显的标识，根据调查得知，来源于名为“告密者”组织，由于该组织隐秘性很强，目前掌握的证据显示该组织大部分成员来自一些情报机构，曾在该机构中由于违抗其中一些“任务或要求”而离开。
//
//他们正在积极入侵M.E.G.数据库。
//由于特殊环境的原因，他们已离开该层级。
//入口与出口
//入口
//在Level 11中朝着某个固定方向一直前进，并行走至5分钟后，可能会传送至Level C-390
//在Level 81中试图尝试切出方式，将直接掉进Level C-390
//进入Level 46一所标有“告密者”组织LOGO的废墟中，会进入这一层级
//在Level 440找到一堵巨大的层级秘钥墙，然后找到一把标有“告密者”组织LOGO的钥匙，插入通向Level C-390的梯子，即可达到该层级
//若在Level C-9里听到很大的风声，此时你会走到一个三岔路口，不要做出任何选择，而是立刻原路返回，这个行为的后果会将你直接传送至Level C-390
//在无知之幕中探索一段时间后，将有几率达到该层级。
//若在Level C-34的远处看到一片沙漠区域，快速跑到该区域内，将直接传送至Level C-390
//出口
//若在Level C-390遇到沙尘暴事件，在该事件发生后两分钟内迅速跑到沙尘暴内部，将会直接达到Level C-390.1
//目前未能发现任何通向其他层级的出口。
//作者信息
//脚注
//1. 不排除唾沫传播、消化道传播、虫媒传播（此传播途径还未证实，在该层级中还未发现其他昆虫实体）。
//2. 意为这些墙壁失去被撞击的功能。
//3. 据观察报告显示，Level 74中的剧场舞台在该层级中为缩小版。
//4. 该密码是一名流浪者在多次试图开启并成功后所得出的密码，不排除该子层级的安全系统在试图开启并成功之后自动更换其密码。
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1390{}