//Level C-350
//评分: 
//+26
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//Level C-350是后室C层级群的第350层。
//
//描述
//Level C-350的整体是一栋有七层的方形大楼，每个流浪者在进入时都会被默认进入这栋大楼的第一层。除一层楼的大门被锁上以外，大楼的每一层的设计大致相同。
//
//每一层内部的都有数十个房间，但在一层中与大门相对的是一座电梯，流浪者可以通过楼梯和电梯前往各楼层。
//
//房间的分布规律并不难找出。通常以电梯所在的位置作为中线，中线左边分布拥有五个以下的房间，其余房间分布在右侧。但房间编号毫无规律，只有编号的第一位数字有律可循，这个数字通常代表着房间位于几楼。
//
//房间装潢单调，大多数只有床和配备有老式电脑的电脑桌，但也有极少数房间中配备有一些较为特殊的物品，例如病毒武器、藏有基因修改片段的冷柜等，我们不知道它们是原本就在该层级中出现的还是人为带来的。整栋大楼连通着稳定的电力，这为储存病毒带来了良好的条件，但整栋大楼的电力被使用过度时就会出现停电的现象，我们总结出了一个在该层级生活的规律“不触碰任何你会感到危险的东西就能活下去”。
//
//整个层级的温度都保持在人类可以存活且不会感到不适的温度，没有任何的实体，且有不少友善的组织，甚至还有充足的电力、WIFI和物资，可以说是宜居之地。但在这里长期居住的流浪者并不多，离开的流浪者都是见到过大楼中深埋的病毒的，他们将自己的想法描述为“一旦看见那种东西就感到自身的渺小，只要在认识到那些东西的可怕程度后就会不自觉地战栗，这里绝对不是什么好地方。”
//
//当然是在流浪者们不嫌弃这栋大楼的内容中的其他东西的情况下。
//
//基地、前哨和社区部分
//未知组织（不复存在）：
//似乎是最早进入这个层级并形成的大型组织。
//妄图通过病毒武器控制其他层级。
//在一场未知的危机后全部成员消失，连尸体都没有留下。
//M.E.G（已撤离）：
//一支研究小组，人数大概在五六人之间。
//与Z COM达成协议，完成收集病毒资料和进行分析的任务。
//已前往其他层级。
//Z COM：
//一只大约有十多人组成的队伍，负责维护楼层内部隐藏所深的病毒的安全。
//与M.E.G达成协议，负责收集层级中的病毒信息和分析病毒变化并上交到M.E.G的信息交流处。
//速切玩家：
//因其入口较为特殊，所以他们在这里布置了专用的线人进行中转。
//切入人数越来越少，现已停止了中转服务。
//入口与出口
//入口
//从任意C层级收到来自该层级的任何电子信息都会切入此层级。
//出口
//如果流浪者从大门望出去，就只能看见大楼外部是一片虚空，没有人知道落入虚空的人将会去往哪里，这意味着流浪者没有从外部出去的可能。
//当流浪者在大楼的第七层中停留三十分钟后将自动切出该层级。
//附录
//大楼的各个楼层中的一些房间有着不同于其他房间的内容，这说明在我们完成这篇报告之前这里是有人在进行着工作的，我们将这些房间中的内容进行了搜集并进行分析，制成了一个表格：
//
//房间号数	房间内容	调查情况
//305号房间	内有一些工作日记。	已完成
//472号房间	一些用途特殊的可改变基因的基因序列和用法详解。	已完成
//666号房间	处在休眠状态中的病毒武器和M.E.G调查小组离开前留下的分析报告。	已完成
//- 收起
//6月8日
//
//
//真是见了鬼了，几天前我还在其他楼层转悠，手机忽然间收到了一条意义不明的短信，然后就被切入到这栋大楼里了。
//“这里有充足的网络信号，时而还会出现杏仁水等物资，而且整栋大楼有着丰富的电力。我相信你会喜欢这里的，当然是在遵守我所说的‘规则’的情况下。”
//
//当我满头雾水正因忽然间的切入而困惑时，一个男人在我的身后开口了。我扭头望去，那男人身穿一件橙绿相间的休闲衬衫，面相很和善，他给我的第一印象就是“不会是一个会对你产生恶意的男人”。但使我好奇的是对方口中的“规则”是什么？于是我提出了我的疑问：
//
//“请原谅我初来乍到，你口中所说的‘规则’是什么东西？”
//
//“我会为你提供一切我可以为你提供的东西，例如生存需要的物资、住所等东西，但这些东西都不是免费提供的，我可不是什么慈善家，我们得进行古时就流行的‘交换交易’制度，如果你想要留在这里，就必须要用一个月的时间在这里辅助我观察病毒的外部变化并如实记录，这是一个简单的活计，一个月之后你想离开时我会给你一些必要的物品，留在这里也没有问题。如果你现在想离开的话，就到七层去，我并不会阻拦你，当然我什么都不会给你。
//
//不过请仔细思考思考，在整个偌大的后室中如此安定且居住有活人的层级可不多见。”
//
//成交。
//
//6月25日
//
//平平无奇的日子，那个和善的休闲装男布置的任务就真的就只是观察那些休眠中的病毒而已。尽管我不太喜欢那些东西，但现在寄人篱下，也只能乖乖照做吧。
//
//一件令我感到奇怪的事是，大楼的停电次数越来越多，恐怕要出现什么大事。那个男人到底想干什么？几天前我路过了一个处于禁止进入状态的房间，它不知为何处于开启的状态，于是我在好奇心驱使下向那里望了一眼……。这个房间的气温极低，全部摆满了铁制的存储箱，飘散着令人感到难受的、浓厚的消毒水的气味，还有几台老式电脑，这里恐怕就是那个家伙改变病毒的地方。
//
//7月1日
//
//半小时前，那男人将我叫到了他的办公室。
//
//“病毒多么美妙。
//
//它们没有思考能力，我来辅助它们思考，辅助它们释放天性，它们为我所用，我为它们所用它们是潘多拉魔盒，而我只是打开它们的人。你知道的，就如同我说出公正的‘交换’原则一样，我本来就不会做任何一件会违背我意愿的、没有好处的事，我现在想要完成的，是将研究完成并控制它们，再撒播到其他地方。
//
//实际上，那些冷藏起来的基因片段你也看见了吧？我在前厅中难以做到的东西而在这里就轻易地出现了。”
//
//这是泯灭道德的。
//
//“道德有何用？我本来就想成为这样的独裁者，不择手段地。你跟了我大概有半个月了，我知道你是个聪明人，而且现在实验也接近尾声了，我的手紧紧地握住了那个盒子。实际上为了握住这个盒子，我赌上了我从后室生活如此多年中所得的一切！！我坚信我将成为新的神。”
//
//疯子。你可曾想过与潘多拉魔盒进行“等价交易”的后果是什么？而且说来，那条无意义的短信也是你发送的吧，目的就是为了让更多人加入你的队伍，成为辅助你打开那个盒子的工具？
//
//“我不知道。”
//
//7月14日
//
//全乱套了，那个男人的步伐越来越疯狂，他在与我聊天那时起就撕下了那套伪装，真正露出了狼的本性。他把一切能够前往七层的道路封死，实际上他并不是不给我选择是否离开的时间，而是这里将所有离开的道路封死！大楼的停电时间越来越长，病毒的冷藏时间越来越短，我实在害怕哪一天它们真正恢复活性并被流出。
//
//已经有不少的人尝试从这里切出，但大多都失败了，当逃离者被捉回来后，有的人被关进了一个特殊的房间测试病毒，有的则被丢出了大楼，被那个男人和他忠实的追随者们送下了地狱。我不敢轻举妄动，每日只能照着那男人所说的去做。
//
//这样的行为总要付出代价的……
//
//7月28日
//
//天秤倾斜了，那个男人以自己的一切作为筹码，却仍然抵不过魔盒之重。
//
//一场持续数十小时的停电袭击了大楼。混乱中，有人打开了冷藏病毒用的冰柜，流出了生化武器这种病毒，我真想不到其他东西流出来后会发生什么。
//
//[凝固的血液遮盖了大部分的字。]
//
//实在没什么可以说的了。再见。
//
//- 收起
//这些东西放在后室的分类体系里就会显得很奇怪，既不能作为实体，又不能作为物品来分类，但为了后人观察并研究，我们将它们的种类、特征做成了一个简单的表格。
//
//病毒种类	特征	目前情况
//病毒	普通的病毒。	稳定
//生化武器	杀伤力巨大，难以治愈。	已消失
//纳米病毒	传播速度极快。	稳定
//N号蠕虫	你没有知道的必要。	稳定
//警告
//
//该文档似乎有更新，点此处查看更新内容。
//
//— 监督者-A
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1350{}