//Level C-380
//评分: 
//+9
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//Level C-380是后室C层群中的第380层。
//
//描述
//Level C-380是一条两侧伴随有居民楼的道路。该道路无限延伸，道路铺设有沥青且画有深黄色的中线，从平面视角来看这条中线就是该层级的对称轴。这里没有日落和日出，该层级总是保持有与前厅正午十点左右相似的阳光。
//
//道路两侧是四层的民用居住楼。每栋大楼装饰相同，墙壁上没有窗户，以玻璃制成的向街道一侧的门口使得流浪者更能看清内部情况，这里没有大门，只通过细腻的切割手法将玻璃切开，留下一个长方形的出入口。一层地板是由老式的淡青色瓷砖组成的，地板上通常会随意地摆放有一到两张的木制靠背椅。这里有着微弱的Wi-Fi信号。
//
//大楼中每层间都有相连的、用以上下的楼梯，楼梯是石制的配有木制扶手。楼梯每一阶的高度不一致，流浪者在行走时极易被绊倒。
//
//二层与三层都是商场，与一层极其不同的是，没有任何的Wi-Fi信号。同时这里的灯光来源于老式吊灯，这使得整个楼层色调均为暗黄色，充斥着复古感。尽管这两层楼从外部看来与一层大小相同，但在流浪者进入时就会意外地发现到这两层商场的大小并不符合一层的大小，经过M.E.G.的测量我们得知：该大楼中的二、三层的大小相同且比一层的占地面积大整四倍。
//
//商场内部货物多摆放在铁制商品架上，大多没有放置的规律。二层货物多为日用品，例如牙刷、茶杯等物品，且物品底部标有价格，外表有一层塑料膜，写有物品的详细信息，它们大多是2000年前的产物。三层货物多为食品，它们没有标有详细信息，大多不可食用，有流浪者在食用它们后出现不良反应。
//
//第四层是居民楼的天台，天台的面积与一层相同，这里和二三层一样都不存在Wi-Fi信号。从天台向外看时流浪者除了看见天上的云之外向地上或是向远处看就只会看见一大片的虚空，M.E.G.似乎派出了人员通过特定的方式来探寻这片虚空。
//
//特殊现象
//时间的流动在该层级中永远会比外界慢两倍，但是永远保持的光照会使得流浪者丧失时间感。只有在流浪者切出后才能回到正常的时间轴上。如果流浪者在这里待的时间过长，他们在切出后所浪费的时间更多。
//在该层级中只能存在一个生命体，这使得该层级中没有任何实体和第二个流浪者。当有流浪者进入该层级时，其余流浪者不能通过任何的切入手段进入这里。
//正如前文所说，这里大楼中的每一层的大小不相同，而且居民楼中只有一层有着Wi-Fi信号。有了这些条件，我们推断出大楼的二三层和第四层都并不存在于大楼中，而是存在该层级的虚空中的某一处，当流浪者在楼梯上打开进入楼层的入口后就会被传送到这些地方。
//基地、前哨和社区
//由于该层级的特殊现象，这里没有任何的基地、前哨和社区。
//
//入口与出口
//入口
//在其他层级中接触到另一流浪者从该层级带出的物品后会切入到Level C-380。
//在Level C-225中看见一张带有该层级的宣传海报后将会切入Level C-380。
//在Level C-345中接触到与该层级中出现物品的出产日期相同的任意物品也会切入Level C-380。
//出口
//在不进入居民楼的情况下，在道路上行走三公里后就会被切出到任意一个层级。
//在进入居民楼的情况下，在街道上行走十分钟就会切出到进入该层级前流浪者所在的层级。
//跳入虚空
//你为什么不多待一会呢？
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1380{}