//Level C-358
//评分: 
//+18
//+
//–
//X
//
//_2S4V%25301%28VW%28TJA%7BM4%24_%248.png
//
//是后室C层群的一个层级。
//描述
//Level C-358的大部分区域属于未开发的原始森林，其环境条件允许发展出多元且复杂的生态系统，在随后的探勘纪录也表明，此层级不仅有着不亚于亚马逊森林的生物多样性，只是栖息在此层级的实体，虽就习性、身体构造方面相差甚远，但外观上更像是猫与其他物种的结合。其中以''猫人''为此层级的智慧物种，猫人是一种直立行走、具有与人类一致的智慧程度、外型形似家猫进化而来的人亚族实体1。
//
//层级的核心地带是一座由木头为建筑材料建设出的小城镇，其城镇规模相当于人类社会的五线城市，文明水平在农业时代，但不存在货币交易的形式，居民供给主要以自给自足为主，其主要粮食为稻米搭配纯素饮食。就饮食方面''猫人''与常见的猫科动物大相径庭，其身体构造进化成更适应纯素饮食，但有时也会补充蛋白质。
//
//社会、饮食结构与猫人
//猫人的饮食结构与社会结构习习相关，在猫人的社会中不存在统治阶级，每位猫人皆是劳动阶级，所以建筑、饮食、文化、语言方面讲求实用为主，但因此层级不存在可用的高效能源故猫人的机械结构仍停留在人力运作，所以饮食方面猫人更注重保腹感、高热量等需供给长时间消耗能量的食物，但因长年进化使猫人不再以肉类为主食，于是猫人改良了传统稻米研发出一种，可以提供比其他谷物更高碳水的改良米。
//
//image.png
//未知果实的模拟图
//
//蛋白质方面由一种未知植物提供，其造型为一种葫芦形的红色果实，煮熟后口感类似鸡肉，通常搭配橄榄油食用，人也可食用，且人食用能提供一餐所需的蛋白质。另外经水质检测发现此层级的河流或猫人的饮用水皆是杏仁水。
//
//即便生活条件及进化使猫人更加完美，猫人的平均寿命依旧只到20年，半个月至一年就达到性成熟与其祖先家猫一致，也导致猫人的历史就人类角度而言并不漫长。就目前的资料表示，猫人从进化到现代发展时间跨度仅有一至两千年。
//
//重要事件
//在猫人的历史中最重要的一场矛盾，就是猫人与魈面兽的生存地盘之争，魈面兽原先与猫人是同属的物种，因地形气候与生活环境导致魈面兽，看上去就像一位佝偻的老人，因可怖的面容得其名，原先魈面兽生活得地形与气候较为阴暗潮湿，且光线极为不足，使得魈面兽维持且进化出完全适应黑暗环境的夜视能力，因条件极差使得生存物资也极为匮乏，为了生存使得魈面兽养成极为残暴且不择手段的性格。
//
//由于生活环境的限缩导致魈面兽不得不开始迁往现在猫人的居住地，彼时的猫人祖先也恰巧途经此地，届时的两个物种已进化成可直立行走且会使用工具的程度，于是他们就展开争夺生存环境的战争。但情况维持不久，由于长期适应黑暗环境，魈面兽的视力已严重退化，这导致战局的地位相差甚远，最终猫人祖先已压倒性的攻势占下目前的生存环境。
//
//在此之后幸存的魈面兽在往南方迁徒时在一个时间点集体消失，根据最后发现的位置是位于目前层级的入口处，怀疑魈面兽有可能迁往Level C-278或Level C-888，但目前依旧仍未有直接证据可以证实此观点。
//
//有关于此层级的大部分生物皆是食草生物，以及大部分物种都有猫科动物的外观，仍需再获取足够资料才可进行调查，但以目前获取进度来看已遥遥无期了。
//
//基地、前哨与社区
//在长年的交涉中，猫人与流浪者间的关系也逐渐形成盟友关系，以下便是猫人与流浪者共同组成的组织。
//
//猫人与流浪者互助会
//由流浪者提供人类的科技与技术，协助猫人一同改善城市建设。
//提供老年猫人的照护及娱乐活动，提供老年猫人更好的退休生活。
//协助流浪者办理入住需求。
//互助会中心也提供橘猫公车的每日班次。
//橘猫公车总站
//进出层级的重要设施，也是城市中重要的通勤工具。
//一天提供10个班次间隔半小时，一个班次两条线，一条往返层级出口，一条往返层级入口
//总站内提供便当、饮料(只有杏仁水)
//猎人猫安保公司
//公司成立之目的为提供因特殊原因无法培养职业技能的猫人、抑或是有兴趣者一份可以四处游猎和站哨的职业，服务内容如下。
//
//于服务期间内随时保护客户财产、人身之安全。 (贴身保镳)
//维护合作的前哨站、基地、社区的治安，实行人员管制。 (保安)
//入职的猫咪在正式上岗前必须完成入职训练；由于猫人在长年无天敌的情形下，逐渐丧失在夜间狩猎的习性，进而导致夜视能力丧失。但在透过长期的调整与适应下，公司拟定出一套既能保留夜视和狩猎能力之余仍能维持原先视力的训练措施2。
//
//入口与出口
//入口
//Level C-278于园区入口找到一公车站牌，随后会出现一只直立行走的美国短毛猫与您一同等待，约10分钟后会出现一辆有着橘猫造型的公车。上车时务必注意司机也是直立行走的猫而不是人，确认无误后便能启程，约莫10分钟后便会切入此层级。
//* Level C-888阅读一本名为猫奴百科的书也可切入此层级
//出口
//搭乘往出口的橘猫公车，出口通向Level C-214。
//作者信息
//« Level C-357 | Level C-358 | Level C-359 »
//
//脚注
//1. 人亚族（拉丁语：Hominina）是人亚科（Homininae）人族（Hominini）之下的一个亚族 ，原有七个属现存人属（Homo）尚未灭绝，因该实体的进化方向与人类一致，故使用人亚族实体与同族的智人并称。 (另外补充人属的学名是由一位名叫卡尔·冯·林耐（Carl von Linné )的自然学家命名的，在此之前就是专指同样；相同的；同性恋者(homosexual的缩写)。
//2. 冷知识，猫咪虽然夜视能力强但视力并不太好
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1358{}