//Level C-332
//评分: 
//+9
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//Level C-332是后室C层群的第332层，表现为一条名为Y322的中国乡村公路，这里的环境同前厅别无两异。其于2021年10月26日被名为██的流浪者发现。
//
//描述
//Level C-332类似于前厅农村的公路，远处被山脉环绕，气温恒定在25至31摄氏度，天气通常为晴朗无云，少有阴雨天气，气候宜人，夜晚不知从何处会传来不断的狗叫声，但这该层级暂未发现任何目睹到狗的记录。
//
//该层级的道路两旁时不时会分散有农村自建房，自建房类型有：单层小平房，瓦房，三层小洋楼与联排二层居民楼，以下将逐个描述。
//
//单层小平房
//个别房屋十分的简陋，墙壁同时由水泥与黄土组成，有部分残缺，分散的分布在公路两旁，里面摆放着许多的杂物，所能使用的物资仅为即将浑浊的杏仁水。
//
//瓦房
//分布在公路两旁的农田中，残破不堪，杂草丛生，随时都有倒塌的危险，M.E.G.曾收到过流浪者进入里面被砸伤的消息，只有极小的机率可以在倒塌的墙下找到罐装龙肉。
//
//v1ZkWV.jpg
//屋顶塌陷的瓦房。
//
//三层小洋楼
//该层级中较为完整的建筑，内部装饰同前厅中的差异不大，水电设施完好，物资也十分的丰富，但大多都被抛锚客占据，唯有少数的房屋可供流浪者探索，内部结构为：
//
//一楼：客厅，厕所与厨房
//厨房里有可供流浪者进行烹饪的配料，在冰箱中可以可以找到新鲜的蔬菜与腐烂的肉类。
//
//二楼：卧室
//可以在衣柜中找到当地服饰，流浪者可以在这里休息调整，同时房间内也配置有Wifi与电脑，但电脑由于未知原因处于断网状态，流浪者可以在一个名为Y332的文件夹中查找到该层级的地图。
//
//三楼：未知
//通往三楼的路是锁死的，任何的手段都打不开锁，从外面通过窗户也只能看到一片漆黑。
//
//联排二层居民楼
//该层级中最为常见的建筑，较为广泛的分布在道路两旁，大部分的大门为上锁的，流浪者可以通过撬锁进入，在里面你可能会见到居住在这的无面灵，他们有可能会热情地接待你并提供杏仁水，也有可能毫不客气的将你驱逐出去，这取决于你进去的时间与你的态度。
//
//v1VTZd.jpg
//远处拍摄的联排二层居民楼。
//
//有个别的居民楼一楼改造成了餐厅和小卖部，餐厅提供的菜品与小卖部的商品都与前厅相似，已被证实食用不会有任何影响，可用杏仁水与货币进行交易，请流浪者放心购买。如果流浪者想要入内就必须身着当地的服饰，否则将不予入内。
//
//在公路旁的农田上有时会出现正在耕种的无面灵，通过与他们的交谈你可以用杏仁水交谈获得他们的当地服饰，可以以此进入餐厅和小卖部。
//
//- 关闭Level C-332的异常情况记录1
//层级： Level C-332
//时间： 2022年1月28日 9:32 PM
//
//记录开始
//
//流浪者一号和流浪者二号站在 Level C-332的道路上，似乎在观察其中的环境。
//
//流浪者一号1： 这个地方看起来很像我的老家。
//
//流浪者二号2： 真的吗？反正我觉得这里挺安逸舒适的，感受一下这里的阳光吧伙计，照在身上暖洋洋的，没准M.E.G.把这里装修一下就能成为下一个宜居层了。
//
//一号： 得了吧，我觉得宜居层可够多的了，But实话实说，我们现在在哪，这是新的Level吗？
//
//二号： 嗯……我们刚刚在level C-236，但鬼知道呢，这肯定不是Level C-237，所以…..我们到底在哪？
//
//天空中忽然下起了暴雨，整个Level C-332仿佛陷入了无限的黑暗。
//
//一号： 他妈的，真不走运，怎么就下起雨来了，这该死的天气，我们去那边的房子里避雨吧。
//
//一号和二号开始奔向离他们最近的房子。
//
//二号： 见鬼，我的东西全湿了，自从我来到后室还没有这么狼狈过。
//
//一号： ……你看道路上的是什么东西？
//
//二号： 那些是…..实体？。
//
//一号： 这这这，数量应该有几百万只了吧？！？！
//
//二号： 什……什么？我看看…..悲尸….死亡飞蛾…….钝人……猎犬…..肢团…妈的这是什么实体公路？！
//
//一号： 它们朝我们这边看过来了！
//
//一号尝试向远处田地跑去。
//
//二号： 嘿！嘿！给我停下来！它们也许没有看见我们，我感觉呆在这里比较安全……
//
//一号没有回应，仍然向远处跑去。
//
//二号： 伙计？老兄！停下来！你那边也有实体，他妈的比在公路上的还要多！
//
//一号依旧没有回应。
//
//二号： 老兄，别把我一个人丢在这！我很害怕！
//
//二号开始啜泣。
//
//二号： 该死的！这地方简直就是地狱！
//
//远处传来低沉的咆哮声。
//
//二号：什……什么玩意？！
//
//咆哮声越来越近。
//
//二号： 不——不！退后！退后！
//
//二号跑到房间的另一端，蜷缩在角落里。
//
//一道闪电劈向屋顶，伴随而来的是山崩地裂的震动。
//
//二号： 发生了啥？！
//
//二号开始尖叫，又一道闪电劈向了屋顶。
//
//二号： 哦——不！不！这样下去这房子会塌的！
//
//雷雨声似乎停了。
//
//二号： 妈的，这….结束了吗？
//
//二号走出房间，眼前所到之处全是疮痍，地面上出现了一道道巨大裂缝。
//
//二号： 实体好像都消失了，但我还是要小…..
//
//地面再次震动，裂缝忽然扩大，二号掉了进去。
//
//地面的裂缝重合，好像什么也没有发生。
//记录结束
//
//- 关闭Level C-332的异常情况记录2
//层级： Level C-332
//时间： 2022年5月25日 12:47 PM
//记录员：M.E.G.侦察部成员Denis Mafflow
//
//Denis Mafflow：接到上级的指令，需要我完善有关于Level C-332的资料，好吧，够烦人的了，天天有事没事净折腾我们去这去那，谁叫我是侦察部的成员呢？算了，那天找机会请个假放松放松，那么我该做什么呢…..
//
//Denis看向南方。
//
//Denis Mafflow：有了，目前该层级还没有关于南方的资料，那我就去看看，到时候随便写个无异常糊弄一下就可以申请休假了，嘿嘿。
//
//Denis开始朝南方走了大概1个小时。
//Denis Mafflow：看来南方一切正常，那我也该回去了。
//
//南方发出了刺耳的破空声。
//
//Denis Mafflow：妈的，什么破事，这下子我又要继续向前看看发生什么了，我这该死的责任感啊~
//
//Denis又向前走了大概15分钟。
//
//Denis Mafflow：不是，玩我呢，什么事都没发生，估计是我的耳朵出问题了，看来真的得休假了。
//
//破空声再次传来，相较于之前，这次更加的刺耳，Denis痛苦的捂住耳朵。
//
//Denis Mafflow：这到底是怎么回事，不行，我必须再往前探索。
//
//不知过了多久，破空声越来越大，前方的道路布满了浓雾。
//
//Denis Mafflow：应该就快到了。
//
//Denis走进了浓雾中，忽然，他感觉脚下一空，跌入了无止境的虚空中。
//
//记录结束
//
//由M.E.G.调查证实，探员Denis Mafflow已死亡，并证实出虚空原有的区域应是前厅中的Y333乡道，未知原因这里成了一片虚空。
//
//基地、前哨与社区
//开垦者团队
//具体地点未知。
//团队成员通常在Level C-332的农田上耕种。
//可与其进行交易。
//v1ZJyD.jpg
//通往Level 11的道路。
//
//入口与出口
//入口
//走向Level C-236其中的一条支路就可以来到这里。
//出口
//如果你一直沿着公路往北走10公里，你会逐渐在地平线上看到城市的轮廓，随后你会被传送到Level 11。
//如果你试图翻越远处的山脉，你会被传送到Level C-41。
//狂奔在公路旁的田野上，将直接到达Level C-116。
//向着树木和建筑物稀少的地方走去，会到达Level C-712
//作者信息
//« Level C-331 | Level C-332 | Level C-333 »
//
//Footnotes
//1. 以下简称一号
//2. 以下简称二号
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1332{}