//Level C-346
//评分: 
//+10
//+
//–
//X
// 
//
//生存难度：
//等级 宜居…？
//
//稳定…？
//安全…？
//适合长期居住…？
//Level C-346是后室C层群的第346层。
//
//描述
//Level C-346是一个由AB两个城区组成的一片城市。同时，这一层级在某种程度上也是一个非线性空间，其性状表现为：流浪者可A城区到达B城区，但如果试图从B城区返回，会发现原来的路被B城区结构替代了。
//
//A城区
//A城区是该层级内最安全的区域，外观为一片多为红砖房屋的城市，风格类似于上世纪20年代的中国上海。在该区域经常能听到人的谈话声，但这些谈话声大多来源不明且无法辨认，但能确定是中文方言。A城区常年闪烁着霓虹灯，夜间的霓虹灯更多，约是白昼时的两倍。尽管A城区内有较多告示牌、广告牌以及横幅，但在A城区没有发现任何非人为的文字。该地区有正常的昼夜更替，但没有天气更替，常年处于阴天。
//A城区的大部分建筑物都比较密集，可以看到许多没有文字的告示牌及横幅(值得一提的是，一些好事的流浪者在上面写了字，因此不用感到担忧)。在A城区，经常可以见到饭店、小卖部以及旅馆，同时还有一间疑似为警察局的独立房屋。以下为具体信息。
//
//饭店
//饭店表现为有上世纪风格的饭店。其中会出现木质桌椅、空菜单及中式餐具。在墙壁上可找到一些食物的图片，多为油画风格。同时，你可以在这里找到包装不印有字的杏仁水以及一些常见的上世纪20年代食物。
//饭店的物品会在一天之内刷新，每间饭店都有固定的刷新物品，但每次刷新物品的位置不同。
//
//小卖部
//小卖部表现为单间小建筑，它们的占地空间通常较小，这里经常能见到木制的柜台以及货架。货架上会出现一些杏仁水，同样不印有字。在极少数的情况下，也会出现超级杏仁水，但目前这种情况仅记录在案三次。
//小卖部的物品会在一周之内刷新，每次刷新的位置有所不同。
//
//旅馆
//旅馆表现为上世纪20年代常见的旅馆，通常为两层，但无法用正常方式进入或离开。已证实的进出方式有：攀爬窗户进出、从其他层级切入。
//如果进入者试图敲打门窗，将会陷入昏睡并在一小时后醒来，已证实对身体无伤害。
//旅馆的房间通常是空的，有较多灰尘，但这些灰尘以某种方式粘在了建筑上，目前，暂时无法将它们清除（尽管它们是无害的）。某些迹象表明，这些灰尘可能不是真正的实体灰尘，而是类似花纹附着于建筑上的存在。旅馆通常没有开灯，但这里似乎以某种形式存在光源，光的效果类似于煤油灯。
//
//旅馆大厅
//旅馆大厅可以正常出入，外观为正常的上世纪二十年代旅馆，经常可以在这里发现柜台、红色地毯以及华丽的吊灯。值得注意的是，虽然每个正常的旅馆大厅明显和其对应旅馆是一体的，但旅馆大厅没有任何通向旅馆的门窗，所有本应通向旅馆的墙壁都被封锁。
//（M.E.G.提醒：旅馆在该区域内表现得过于异常，我们不建议流浪者私自进入，尽管目前没有记录证明它们的危险性。）
//
//警察局
//警察局在A城区仅有一处，表现为一间开放的独立房屋。
//在警察局的左侧有一间类似监狱的构造，其中关押着一名衣衫褴褛的成年无面灵，似乎已经死亡。任何试图破坏监狱铁栅栏的尝试都失败了。
//在警察局的右侧为一个小型办公区，有一个木制柜台以及一支似乎为模型的生锈枪支，其目前已在不知何时被人拿走了。
//
//B城区
//B城区的建筑风格与A城区类似，但大多都明显废弃。B城区仍旧发现了A城区存在的建筑结构，但明显也都废弃了。因此，这些类似A城区建筑结构的房屋失去了在A城区的几乎所有特性。B城区没有刷新任何物资，但它依然存在闪烁的霓虹灯。B城区有2个特殊结构：废弃钢铁厂、小型公园。
//
//废弃钢铁厂
//废弃钢铁厂是一个只存在于B城区的结构，目前只发现了一处。其表现为一间由红砖砌成的巨大工厂，其表面大部分玻璃都已碎裂，在其中可以找到大量蜘蛛网。在其内有较多前厅上世纪钢铁厂通常出现的设备，但大多都已老化不能使用。由于他们可能带来安全隐患，不建议流浪者靠近。
//
//小型公园
//小型公园表现为一个有中央喷泉以及围墙的公园，但围墙已经损坏，喷泉也已不工作。其中有明显曾经种过某些特殊植物的痕迹，但现在大多已被杂草或建筑废墟替代。
//
//在小型公园里发现了一个异常的纸条，并印有以下文字：
//
//收到回復Hj*013。 非常完美，我們正在進行最後的調試工作。L*gi13處於可控狀態，我們隨時可以啟動它。
//祝一切顺利。
//
//备注：该纸条目前被“天空之眼”组织保管。
//
//实体
//成年无面灵
//在Level C-127内经常能见到。它们通常穿着中山装并且十分友好，会让流浪者用杏仁水和他们交换一些似乎来自上世纪20年代的物品。
//
//派对客
//“天空之眼”成员余文于2022年一月三十日在A城区发现了三只派对客。但据该探员描述，这些派对客“行为十分异常，并且似乎不愿意靠近人类”。
//这种情况仅记录在案一次，因此推测由于该层级内有大量的心理疾病患者，可能该事件的“派对客”是由心理出现问题的流浪者假扮的，意图不明。
//
//基地，前哨站和社区
//“天空之眼”组织
//这是一个致力于“保护后室人群心理健康”的124人组织，其中90人常驻于Level C-346，剩下34人通常驻扎于其他层级。
//目前，该组织人数仍在扩充。
//他们热衷于与M.E.G.合作(通常是帮助治疗有抑郁症的流浪者或探员)，并帮助因为自杀进入该层级的流浪者。其中大部分人是心理咨询师或心理学家。
//为了“防止流浪者们在这个层级意外死亡”，他们通常不允许“心理不够健康”的流浪者进入B城区或离开该层级(除非非常有必要)。
//这一组织的常驻人员一般不进入其他层级，但是当M.E.G.向他们发出申请时，这一组织的成员一般会同意派人来到其他层级。
//Oculus基地
//严格意义上来说不算一个基地，但这里仍然经常有人居住并且有大量物资。“天空之眼”成员通常在这个区域集会。该组织的成员将这一区域的建筑粉刷成了白色，并在周围放置了很多告示牌，因此很好找到这一区域。
//入口与出口
//入口
//切入Level 11的任何一处红色建筑将会到达Level C-346的A城区街道。
//进入Level C-250一间出现在小区角落的活板门将会到达Level C-346的A城区任意一间旅馆内部。
//理论上在任何一个层级因抑郁等原因自杀即可到达Level C-346的A城区。该方式对同一名流浪者只可使用一次。
//（2022年6月2日最新消息：近期不知何种原因，第三种进入方式的触发几率大幅度降低了）
//出口
//在A城区的任意一处电话亭内切入即可到达一个安全层级。
//在B城区的废弃钢铁厂内切入，即可到达任何一个生存等级为3的层级。
//- 你为什么会看到这些？
//
//隐藏的信息
//
//C城区
//C城区与A城区和B城区的差别极大，整个区域都是以单调的让人发狂的白色建筑1与灰色地面组成的。它们的排列极有规律，全部都在一条外观类似于柏油路的道路两侧。目前的记录证明，这些房屋是可以进入的，内部什么都没有。该区域半数房屋是倒置的，当有人进入这些倒置的房屋时，进入者的重力会改变至倒置房屋的地板（类似于Level 7）。当进入者再次回到路上，重力又会回归正常。这一区域里，人为留下的任何物品都会在不易察觉的情况下消失。2
//
//D城区
//D城区是一个纯粹处于意念上的区域，当流浪者走到C城区的边境时，便会陷入意识上的混沌并进入该区域。该区域的样貌只能从大脑中呈现。
//目前我们收集了三个流浪者对他的描述：
//
//亚当：那个地方非常奇特，我隐约可以看到背景的虚空，还有一些像彩虹一样的东西在我眼前交错。我似乎可以一种平滑的方式在这里滑动，但无法与场景进行任何互动。
//麦克：这个鬼地方简直比那啥层级还要奇怪，就是一些不可理喻的，彩色的东西。还有，可能是因为在人脑里呈现的原因，这里的画质差得不得了，跟我在前厅的家那台破电视一样。
//史蒂夫：就是很奇怪的地方，物理似乎在那里并不存在，一切就跟错误了一样，到处乱晃。我具体看到了什么不大好描述，但这并不重要。
//
//目前没有任何记录能够证明这一区域如何离开，但可以确定离开是很容易的。3
//
//ŭ厶❶～ks%&l$n城区？
//ŭ厶❶～ks%&l$n城区是我们的家，是我们热爱的地方。我们在这里活着，我们在这里享受着平静的生活。
//我们不需要那样的眼睛。
//哈哈。
//
//- 你为什么会看到这些？
//常见问题解答
//（Q：提问者 M：M.E.G. T：“天空之眼”组织）
//Q：为什么这篇文稿没有配图？
//M：虽然我们有这个层级的照片，但是“天空之眼”不同意我们将这些照片上传。尽管我们可以强制上传，但还是尊重每个组织的意愿。另外，照片与描述基本吻合。
//T：我们为此感到很抱歉，但是所有照片都与我们的患者有关。我们不能泄露患者隐私。
//Q：为什么我在这篇文稿里看到了一些不该看到的东西？
//T：一些心理不正常的流浪者强制修改了这篇文章。如果你遇到这种情况，忽略这些内容就行了。如果你真的感到了困惑，你可以来到这里，我们会告诉你答案。
//Q：如果我或我的朋友遇到了心理障碍，该如何联系“天空之眼”？
//M：如果你找到了M.E.G.的成员，可以向他们提出申请，让他们帮你联系到“天空之眼”。
//T：进入这个层级，或者给我们留言都可以。
//Q：在我进入Level C-346之后，会不会被里面疯掉的流浪者攻击？
//T：我们对于精神出现异常的流浪者进行了管制，因此您一般不用担心这种问题。
//
//- 关闭文件
//
//from:[数据隐藏]用户
//to:M.E.G.
//主题：告知meg
//为什么你们会认为“天空之眼”是一个友好的组织？！我完全不知道你们这群傻子在想什么！
//时间:2022年5月14日 7:34
//
//from:M.E.G.
//to:[数据隐藏]用户
//主题：请详细说明
//抱歉，我们没有理解您要表达什么。请您详细告知。
//时间:2022年5月14日 7:41
//
//from:[数据隐藏]用户
//to:M.E.G.
//主题：dhhdhdh
//“天空之眼”这个组织只是一个包在保护流浪者心理健康外衣下的魔鬼！听着，从来就没有人因为自杀进入过该层级，进入该层级的方法也不只有那几个，他们全都被“天空之眼”这个鬼组织给隐藏了！我来告诉你们，这个组织都干了些什么！当有流浪者意外，进入Level C-346时，这个组织就会强行抓捕流浪者并夺取他们身上的物品！你们为什么要和这样的组织合作？这个组织到底给你们带来了些什么？我不知道你们之间具体发生了些什么，但是听好了，“天空之眼”在你们面前的任何举动都不可信！！！
//时间:2022年5月14日 13:24
//
//from:M.E.G.
//to:[数据隐藏]用户
//主题：请您提供证据
//我们已仔细阅读了您的邮件，但目前您没有足够的证据来证明这一消息的可靠性。请您将证据传给我们。
//时间:2022年5月14日 13:51
//
//from:[数据隐藏]用户
//to:M.E.G.
//主题：证据!!!!!!!!
//这就是你们要的证据！
//[数据隐藏]jpg.
//时间:2022年5月14日 14:07
//
//from:M.E.G.
//to:[数据隐藏]用户
//主题：已收到您的邮件
//我们收到了您的邮件。组织内部正在对其可靠性进行验证，在结果出来之前，我们都不会再与该组织进行任何合作并派人来到Level C-346进行调查。
//时间:2022年5月14日 14:45
//
//from:[数据隐藏]用户
//to:M.E.G.
//主题：（暂未设置）
//知道了，知道了，结果出快点。
//时间:2022年5月14日 17:06
//
//- 关闭文件
//
//我们的；罒f、N苩^】❽……
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//[系统由于不明原因崩溃，正在为您重新调试]
//
//[重启初始化……]
//
//[加载中……]1.2%
//[加载中……]2.0%
//[加载中……]10.5%
//[加载中……]17.6%
//[加载中……]36.7%
//[加载中……]85.4%
//[加载中……]95.2%
//[加载中……]97.4%
//[加载中……]99.1%
//[加载完成]
//
//[系统收到更新内容]
//
//[正在为您更新]
//
//[完成！]
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//2022年6月4日最新消息
//警告！即日起，任何流浪者禁止进入Level C-346，我们已封锁了该层级的所有出入口，请您不要以任何形式试图进入该层级！如果您在任何层级遇到了自称“天空之眼”成员的人，请不惜一切代价联系到M.E.G.！
//
//2022年6月11日最新消息
//Level C-346已经重新开放，我们对于其入口内容进行了更新，以下为目前观测到的入口:
//
//切入Level 11的任何一处红色建筑将会到达Level C-346的A城区街道。
//进入Level C-250一间出现在小区角落的活板门将会到达Level C-346的A城区任意一间旅馆内部。
//在Level C-22里杀死其中一名劫匪将被传送至Level C-346的B城区。
//在Level 188进入一扇印有“RED's”的窗户将被传送至Level C-346的A城区警察局窗户后。（这扇窗户的出现是有概率的）
//在Level C-64找到并切入一片红色的沙地将被传送至Level C-346任意位置。
//切入Level C-61的马路将被传送至Level C-346任意位置。
//在Level C-16切入哪件物品将进入Level C-346？（3）
//A.课桌
//B.黑板
//C.讲台
//在Level 6闭上眼超过20分钟但不陷入睡眠即可进入Level C-346的C城区。
//作者信息
//« Level C-345 | Level C-346 | level C-347 »
//
//Footnotes
//1. 它们一般都是三角顶的。
//2. 由于这一特性，该区域内洁净的让人有失真感。
//3. 某些迹象表明，离开该区域的方法可能是在该区域内移动一段距离。
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1346{}