//Level C-373
//评分: 
//+31
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
//精神危害
// 
// 
//Level C-373 是后室C层群的第373层。
//Level C-373于2022年1月17日首次被发现。
//
//1111114514.jpg
//M.E.G先遣队通过声波扫描在Level C-373内获取到的一张照片(经过后期处理)。
//
//描述
//Level C-373主要由面积辽阔的地面和占据整个Level绝大部分空间的天桥群两部分组成，二者构成上下级结构。但由于该层级的独特属性，还未有任何流浪者抵达该层级的边界并提供内容明确的报告。就目前的探索结果推测，Level C-373很有可能是一个无限大的层级。
//
//该层级没有昼夜循环，永远停滞在凌晨时分。
//
//由于该层级的某些未知特性，无法通过光学摄像机拍摄以获取该层级内部的影像；同时，常规的电子设备也将受到干扰，难以在层级内正常运作。
//
//区域
//
//◆地面
//
//地面是整个Level C-373的基础。Level C-373的地面区域构造异常简单——基本由外观类似于前厅的市区主干道公路1的交通路面重复并排拼合而成，且没有人行道。其间零星分布着交通浮岛和用以分隔车道的护栏——但更多的则是多到无法计数的桥梁立柱。在浮岛上一般会存在一至多根始终点亮的路灯，这取决于浮岛本身的大小。这些路灯为整个层级提供了唯一的光源。
//
//道路上偶尔会出现汽车——但一般都处于抛锚状态，这些处于抛锚状态的无人汽车会始终开启它们的双闪灯并持续鸣笛。它们出现于此的原因未知。对此类汽车展开的探索行为已被证明是安全的——抛锚的汽车内部一般会存有较为丰富的生存资源，包括但不限于风干肉、罐头、杏仁水、幸运豆奶等物品。这些物品在生存资源匮乏的Level C-373内是极其珍贵的。
//
//除了抛锚的汽车，某些车道上有时还会生成疾驰中的汽车，生成的频率与概率往往是不确定的，但其生成位置却总是在流浪者附近的车道上。这些汽车的速度一般在180km/h以上。它们的行驶路径严格按照其生成时所在的车道，不会改变。
//
//由于该类实体的高速度，想要拦截它们被认为是几乎不可能的。因此强烈不建议任何误入此层级的流浪者与疾驰中的汽车有所接触，并且当流浪者留意到渐强的引擎轰鸣声后应当注意来车方向并及时作出规避。
//
//由于长时间在地面的逗留将会大大提高Level C-373的特殊精神效应的作用强度，以及与实体接触的概率，因此不建议流浪者在地面逗留，且应尽快转移至天桥群区域。目前已通过实验表明，天桥群区域能有效减缓Level C-373特殊精神效应的影响并且拥有着极低的有害实体生成率。
//
//地面与天桥区一般通过阶梯相连接，流浪者可安全地通过阶梯到达天桥群区域。
//
//
//◆天桥群
//
//天桥群区域是Level C-373的主要区域。
//
//Level C-373的绝大部分空间为不可计数的各式人行天桥所挤占。材质、结构各有不同的天桥占据了绝大部分天域。这些天桥在大部分情况下都处于稳定状态。但少数一部分被称为集合体的天桥交错结构有较大的可能会在流浪者经过并离开此区域后，于流浪者视野之外发生完全随机的形态变动，变动的形式包括但不限于平移、翻转、旋转、扭曲。
//
//此类事件被称之为变动事件。
//
//1919.jpg
//一个刚刚经历过变动事件的集合体。
//
//
//目前，Level C-373的集合体结构变动事件的起因及作用机制仍是未知的，亟待进一步的深入研究。
//
//已证实的一点是，变动事件的发生并不会对天桥本身有所破坏；相反，这甚至常常能为流浪者提供一条或多条全新且通向不同区域的路径，但绝大多数时候这些新路径都会将流浪者带向死路或让流浪者们迷失方向。
//
//流浪者若目击到正在发生中的变动事件，应尽快远离。当变动事件发生时，集合体周遭的空间将会变得极端不稳定。流浪者在此区域中，切出的概率将会大大增加且无法保障切出目的地的安全性；且对变动事件的目击将会一定程度上加剧Level C-373特殊精神效应的影响。
//
//Level C-373内的天桥在外观上与前厅的人行天桥无异，且各自在外观上展现出鲜明的时代印记。但科学测龄报告指出，这些天桥的年龄完全相同，这意味着这些遍布整个层级的建筑是在几乎同一时间内被建造出来的。
//
//Level C-373的天桥呈现出高度复杂的多样性。Level C-373内的天桥主要可以分为以下几类：
//
//◆普通天桥
//普通天桥是目前Level C-373已探明区域之中数量最为庞大的一类。其外观与在前厅里所见的一般的人行天桥相似。此类天桥常常会并入集合体。建议流浪者们谨慎规划路线。
//
//◆蛇形天桥
//蛇形天桥是该层级已探明区域中较少见的一类。蛇形天桥正如其名，似蛇曲一般蜿蜒伸展。蛇形天桥一般孤立存在，不会汇入集合体。目前针对Level C-373的探查表明，蛇形天桥通常能导向能让流浪者以较为安全的方式离开该层级的出口。
//
//◆损坏的天桥
//损坏的天桥是该层级已探明区域之中少见的一类结构。它们损毁严重，无论是自身结构亦或是所处的空间结构均不稳定，极易发生崩塌事件或切出事件。此类结构常常集中出现在较偏远(距初始点400公里以上)的区域中。它们会对流浪者产生独特的精神效应，流浪者会无意识地被其所吸引；常常会有流浪者受其影响，试图接近并登上此类结构。但结果几乎无一例外地或死于崩塌事件或被切入至高危层级。不建议流浪者接近此类结构。
//
//◆复合天桥
//复合天桥是该层级已探明区域中结构最复杂的一类天桥，一般呈现多层构造。这类天桥内的环境较复杂，往往成为了Level C-373内实体如笑魇、猎犬等的聚集地。但同时，此类天桥也是整个Level C-373中生存资源最为丰富的一类结构。
//
//◆浮空天桥
//浮空天桥一般位于该层级距地面区域200-600米高的空域中。此类结构静止在高空中，接触难度极大。最近一次探索行动表明，浮空天桥其实是被肉眼不可见的拉索固定在空中。这些拉索的材料和来源暂时未知，留待日后进一步调查。
//
//◆未完工的天桥/施工现场
//这是整个Level C-373最为罕见的一类结构。在此类结构附近的区域中，往往会存在着大量可用的精制建材和建筑工具。此类天桥因为极低的完成度和复杂的地形环境，往往又成为实体们所偏爱的潜匿地，故而具有较高危险性。不建议流浪者对此类天桥展开探索。
//
//在以上所提到的所有种类的天桥上，都有一定概率生成无人的地摊。地摊是Level C-373内主要的一类补给点。地摊上常常会有少量的货品，货品种类包括但不限于食物、药品、耳机线、和空白内容的CD、U盘，且均未标注任何标识与生产信息。
//
//
//特性
//
//Level C-373效应
//
//作为一个新发现不久的层级，Level C-373有着其独特的层级精神效应。这种效应的发生机理仍然未知。目前这种层级精神效应被认定为一种认知危害。
//
//当流浪者进入Level C-373时，流浪者的意识就将会开始受到缓慢但明显的扰动。
//
//流浪者受到层级精神效应影响的整个过程大体可以如此表述：流浪者开始逐渐变得只能够记忆Level C-373内部事物或与之相关的概念的具体细节，但与之同时发生的，则是流浪者对这些繁复细节进行模糊综合、提炼概括出总概念以及理解、记忆总概念的能力的逐步丧失——他们会开始无法记清楚并理解代表某些概念尤其是抽象概念的词汇，这将导致他们在言语表达上的障碍；但他们仍能理解这些概念当中的细节成分2。
//
//之后，随着时间的推移，这种异常的认知状态将会逐渐深化，以至于影响流浪者的过往的记忆——他们能回想起回忆中某一件事件的具体细节，但就是无法回忆起事件的全貌，亦即，回忆失去了其本身的模糊性，那么回忆本身也就不会成型——这种症状类似于某些超忆症患者。
//
//在流浪者自觉精神异常之后，他们往往会因这种模糊感陷入较为严重的偏执之中。他们会试图尽力调动自己的思考，试图从这些琐碎的细节之中得出一个总结概念，以此平复内心的焦虑；但这种行为往往宣告失败，这反而会进一步加剧流浪者的偏执。
//
//若在自觉异常之后，流浪者仍长时间逗留于该层级，那么层级精神效应对流浪者的影响在不久之后将达到最高峰。这种高峰状态将一直持续直到到流浪者离开Level C-373为止。
//
//达到最高峰状态一般需用时9-72小时左右。
//
//当达到最高峰状态后，流浪者基本丧失头脑中对绝大部分高级概念与次级概念的理解，但其保留了对最底层概念(如数字，几何体等)的理解，并且仍能记住那些已无法理解的概念里极端入微的细节。
//
//此时的流浪者最后常常会因严重的认知污染、失语症和思维障碍而产生幻觉，这种幻觉最终会让流浪者的精神趋于崩溃。这种状态下的流浪者往往会陷入一种疯狂状态。此时，流浪者在该Level 内的生存概率将大大降低——他们需要面对复杂的路径和以钝人为代表的实体的威胁。
//
//不过这些流浪者往往会在濒临死亡的瞬间从Level C-373之中切出。切出Level C-373之后，层级精神效应的作用将会逐渐减弱，流浪者的精神状态也会慢慢回复正常，不过这往往伴随着在回复期间记忆的丢失。从Level C-373逃出的流浪者的这一回复过程通常持续一到两周不等。
//
//发生于Level C-373内的此精神效应无法通过服用杏仁水等常规的精神状态回复方法加以缓解。
//
//需要注意的是，M.E.G调查人员在对从Level C-373脱出的流浪者进行长时间的定期回访调查过后，发现这些流浪者的精神状态和心理承受能力普遍得到了提升——这意味着流浪者们或许能通过前往Level C-373并在此间逗留的方式提高自己对于精神模因危害的抵抗力与能极大有助于在后室复杂多变的环境下生存的良好心态。
//
//这就是为什么M.E.G如此重视Level C-373。未来，M.E.G计划进一步合理探索、开发Level C-373，以便于M.E.G特工力量的培养和为流浪者提供相关的服务。
//
//
//实体
//
//Level C-373的主要实体为笑魇、猎犬、肢团、钝人。它们主要集中生成于复合天桥、以及地面区域的桥体立柱附近。但有时这些实体也会游荡到Level C-373的某些固定资源点附近。
//
//偶尔，在Level C-373的地面也会出现车兽。
//
//
//基地、社区及前哨站
//
//该层级目前暂无已知的基地、社区与前哨站。
//
//但M.E.G计划于2023年1月在此建立名为“过路人”的前哨站。
//
//
//入口和出口:
//
//入口
//
//目前已探明三种进入该层级的方法。
//
//在Level 11走上一座距城市中心较远的人行天桥有概率切入Level C-373。
//在Level 69一路行驶直到视野中出现人行天桥。
//在Level 9中寻找一辆灰色工程车，驾驶工程车一路行驶将有概率来到Level C-373。
//
//出口
//
//在开始出现幻觉之后濒临死亡威胁可切入Level 11。
//顺着蛇形天桥一路行进可来到Level 11、Level 20、Level 80中的一个。
//在一次变动事件中意外切出将会把你带到任意一个空间结构不稳定的Level。
//在未受层级影响至产生幻觉之前从天桥上坠下将有概率以高速下坠状态切入Level 63、Level 77、或是枢纽。
//作者信息
//«Level-C-372 | Level-C-373 | Level-C-374»
//
//Footnotes
//1. 通常是六车道。
//2. 为方便流浪者理解，特在此举例。以一张椅子为例——我们假设“椅子”就是一个成型的由各种细节提炼出的概念，而椅背、扶手、坐板、支撑腿和椅子用以坐下的这一功能特点等则是“椅子”这一概念的细节组件。现在，一位刚进入Level C-373的流浪者见到了一张椅子。若此时你问他，那是什么东西，他定能干脆利落地回答道：“那就是一张椅子”。但随着时间推移，就像我们刚刚说的，特殊精神效应将会开始明显影响流浪者，此时，若是你再问他，那是什么东西，流浪者将失去之前的果断与明了，可能经过一段时间之后，才会予以答复：
//“那是一张……一个？……嗯…有四条腿的……带有…呃，扶手的……用来……坐下的木制品吧，我不知道怎么表述才好。”
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1373{}