//Level C-307
//评分: 
//+68
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
//安全
//友善层级
//敌对人类组织
//按你们的说法我是后室C层群的第307层，1。
//
//描述
//目前这里拥有一大片温暖的热带雨林，我已经把气温调到最符合人类的25度左右所以你们应该可以生活的很舒服，具体地形细节就跟你们在别处见到的热带雨林一样没什么奇怪的，我懒得搞你们数据库的图片所以你们自己脑䃼一下就行
//
//雨林中有大量正在不断扩展的人类建筑，这些都是探索者修建的，如果你们进度够快并且一切顺利的话，我会慢慢成长为一个由无数建筑构成的巨大城市层级，这需要很长一段时间，不过我相信可以做到，这样就能脱离……好吧，没法用人类的词语描述这种进步。
//
//实体
//原则上这里不会有那些奇形怪状的玩意，它们会毁坏人类的作品而且并没有对生态系统或我的发展有任何好处，所以我不会像其他没脑子的家伙一样允许那些东西在身上横行霸道，当然要是偶尔有悄悄溜进来的漏网之鱼记得自个儿处理一下，我相信你们能把这事儿办妥，办不妥的老规矩，发个邮件我来处理。
//
//唯一一个例外是那帮蛀虫——或者你们称之为后室装修公司的家伙，他们试图抹杀我们这样的自主意识，并且希望所有层级都遵循他们的想法来改造，那帮混蛋肯定也在偷偷潜入我，见到他们请格杀勿论，就当帮我个顺水人情。
//
//特殊效应
//没有，真没有，没有迭代，没有篡改数据库，没有什么隐藏玩意儿！其他家伙弄的各种各样的陷阱和隐藏都把你们搞得有受害妄想症了，我发誓这里好好的，你只需要来这好好生活就行了。
//
//-  
//我把他设置成作者不可见了：该层级存在特殊效应：层级本身具有自主意识并会主动与人类交流，其可以控制层级中的大多数事物，包括但不限于昼夜时长，层级温度，物资生成䓁，出于此考虑不应与层级自主意识交恶
//
//该意次表现出对人类的友善，并总是鼓励人类修建大量建筑以促进它达到“人类语言无法描述”的状态，其表现出对其他层级的认知，总是称呼其他层级为“没脑子而且短视的蠢蛋”但是拒绝解释原因，对后室本身则一无所知。我只能写那么多了，如果写太多会被看出文档长度不对的，总而言之它没什么恶意，目前。
//
//好吧好吧我承认我适当修改了一点点精神影响，让探索者更不想离开，但是也没改多少嘛，有什么要紧事的话还是可以直接走的，纠结那么多干什么嘛……
//
//物资
//我是以面积见长，你要说那些稀奇古怪的东西还真没能力搞太多，我记得当时好像弄出过一条流着杏仁水的河流但忘了在哪，不过自然材料管够，往下挖一点应该有金属矿的，食物水那些也不是问题。
//
//所以总而言之，如果你没有什么比较独特的东西，可以去其他层级自带过来，实在有什么很需要的发个邮件给我，我看看能不能帮你们搞，但别抱太大希望。
//
//基地、前哨与社区
//这里的人还是蛮多的，不过团体会引发争斗所以其实我不太喜欢这种拉帮结派的行为，不过好消息是我地方够大，看不顺眼的自已出去打不准在我这动手。
//
//C层级民众自卫队后勤大队
//他们说这一层主要是他们生产后勤补给装备和进行人员调动以及治疗用的，这层没什么人需要帮助所以他们就不公开具体位置和在干什么了。
//
//M.E.G.先锋基地
//不是，你们自家的基地还要我来介绍？
//
//U.E.C.先锋基地
//他们用了很不文雅的词汇描述你们。并且不希望我向你们透露任何关于他们的信息，所以我就不写了。
//
//后面它写的都是那么的内容，为了方便阅读性就不一一描述了，总而言之，绝大多数团体都会在这里设立一个小型据点，你在这里可以联络到大多数团体。
//网络情况
//我已经把限制完全解除了，按理说这应该是最快网速，如果你们还嫌慢的话自己去修信号基站去。
//你问我这东西的基站咋修？我咋知道？
//
//入口与出口
//入口
//其他几个探索者团体的内部通道，他们说不让你们知道。
//在 Level 11进入野外用品商店有概率传送到Level C-307。
//在 Level C-408想象自己来到一处和谐友好的土地，可以来到这里。
//在 Level 10田野上漫无目的的游荡时有小概率被传送到Level C-307。
//Level C-45有小概率存在一片热带雨林，进入这片热带雨林能将你传送至Level C-307
//出口
//不是，你要出去干嘛！
//
//如果你真的很不喜欢我的话，在这里待久了可以收到Level C-408的照片。
//走进热带雨林灌木较为低矮的区域能把你送到Level C-45
//其他几个探索者团体的内部通道，他们说不让你们知道。
//切入任何一棵咖啡树能让你到达Level c-offee
//进入一片荒芜的废墟或长有血肉的树能让你来到Level C-309
//走进自然生成的田野能让你到达Level 10
//我正在构建通往 Level 11的通道，等我消息。
//作者信息
//Footnotes
//1. 应Level C-307本实体的强烈要求，本篇文章主要由它自己写作完成，不过我们还是帮它做了基本的格式修正
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1307{}