//Level C-313
//评分: 
//+19
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
//不甚稳定
// 
//Level C-313是后室C层群的第313层。
//
//描述
//Level C-313通常是一个面积有限的密闭空间，对于每一个处于其内的流浪者展现出不同的形态。流浪者不会在这个层级中相遇，即使他们在同一时间与地点切入这个层级。
//
//对每一个身处Level C-313的流浪者而言，这一层级的内部构造与设施都与他们各自在前厅中的“家”几乎完全相同。1这意味着根据观测者的不同，Level C-313的体积与形态将会有着较大的不同。这一点与Level C-17非常类似。因此在切入此层级时，较容易使流浪者产生他们已经回到前厅的错误判断，而这在一定程度上是危险的。
//
//处于Level C-313的流浪者，会感到一种类似“回家”的满足感与安定感。这通常使得他们乐于逗留在此层级。
//
//Level C-313的内部设施似乎维持在流浪者最后一次见到他们前厅中的家时候的样子，包括电器、家具、食物和水。这使得Level C-313成为后室中少有的存储有淡水的层级。同时，层级内的电器都具有未知来源的稳定供能，且整个层级覆盖有良好的Wi-Fi信号。
//
//若Level C-313有窗户，则窗外景色将与前厅中流浪者的家的窗外景色相同，但看不到任何人类活动。从窗户的观测结果来看，该层级似乎具有昼夜更替。窗户可以打开，但所有向外打开的窗户全部变为内开，且试图将任意物品伸出窗户时会被阻力阻止。这通常会作为下文所述的异常现象而被流浪者留意。
//
//除此之外，Level C-313与现实世界不同的异常之处还体现在以下两个方面：
//
//打开可被定义为“大门”的门并走出它，将会在身体所有部位完全越过门后随机切入一个后室C层群的层级，随后该流浪者将无论如何也不会再次回到Level C-313。该层级的生存难度与流浪者在Level C-313逗留的时间成正比，流浪者留在Level C-313的时间越长，打开大门后所切入的层级便越难以生存2。除此之外，该层级无法通过其他方式离开，尝试切出将总是失败。
//敏锐的流浪者将留意到该层级与自己印象中前厅中的家有一些细微的差别，且差别会逐渐变得明显。最初将总会是窗外的景观发生细微变化；随后，一些日常用品的颜色、图案等开始发生变化；流浪者逗留相当长一段时间后，一些设施出现不符合常理的形态改变。这些改变似乎都是在流浪者视线之外完成的。目前的任何改变都证实不会触发危险的效应。在流浪者注意到任何一点改变并将其认知为异常现象的瞬间，Level C-313给予他们的安定感将开始衰减。一定时间后，流浪者将产生一种离开的冲动。
//鉴于能够进入本层级的流浪者大多已经阔别其家庭很久，不再熟悉自己家的构造，且由于此层级的特性而趋向于长时间逗留于此，所以意识到异常情况并试图离开时，通常已经来不及从此层级进入一个足够安全的层级。
//
//探索记录
//下面为一些探索者在Level C-313中所记录的资料。其中所记录时刻均为其到达该层级后在其中度过的时间。
//
//- 收起相关记录
//探索记录1
//
//流浪者姓名：张██
//层级表现形式：约80m2住房；
//备注：张██在切入该层级后由于发现窗户的异样而迅速意识到自己进入Level C-313，并开始记录所观测到的变化。
//记录的变化：
//
//00:02:36 记录到窗外的马路车道线消失；
//00:06:02 木地板花纹发生轻微扭曲；
//00:07:28 房间内所摆放的照片有一部分出现了褪色失真的现象；
//00:08:42 从大门离开此层级，进入Level C-166。
//此纪录作为应对Level C-313的杰出范例而被保留。然而仍不鼓励在发现自己进入Level C-313后决定继续在此逗留。
//
//探索记录2
//
//流浪者姓名：赵█
//层级表现形式：约93m2住房；
//记录的变化：
//
//04:52:23 记录到窗外绿化带中一棵树变为明显粗大且仅于热带生长的猴面包树，而非其周围的女贞树；
//05:21:13 客厅灯光从原先的淡黄色变为白色；
//05:27:21 客厅中摆放的钢琴琴键数量从88键变为84键，且弹奏时出现音准异常；
//05:28:10 餐厅灯光由暖黄色变为白色，餐厅墙上悬挂的油画从乡村景色变为有着红色背景的倒置房间，房间内装潢类似餐厅，但画工拙劣；
//05:28:53 从大门离开此层级，进入Level C-34。
//这是最早提交的关于Level C-313的记录报告，报告者表示在此层级发生的变化令其感到不安。
//
//探索记录3
//
//流浪者姓名：：████ Schmid
//层级表现形式：约280m2别墅，2层并有阁楼3；
//记录的变化：
//
//00:23:51 从房内看向园圃时，发现其中所有花的颜色泛红（包括绣球、大花葱等原先非红色花的植物），叶子的绿色饱和度变高；紫藤所开的花变为倒置的红色虞美人；同时，发现园圃的景致在日光照耀下出现失真现象。
//00:24:10 从室外照射进房间的可见光逐渐无法照亮整个建筑内部，这使得房间内部变得昏暗，尽管从窗户向外看能够观测到正午的景色；
//00:24:28 打开别墅客厅的吊灯，发现其仅剩余2个灯泡，其余4个消失；
//00:24:41 客厅展示柜中陈列的红酒、高脚杯、瓷盘等用品在较为昏暗的情况下出现异常的反光现象，并未探测到可造成该种反射的光源；
//00:25:38 打开通往园圃的大门，发现已离开此层级并进入了Level C-207。
//这是一个较有代表性的证据，证明每个人在此层级内部时这个层级发生异常改变的速度是不同的，而将记录2与记录3对比能够更明显地发现，对于每个人来说打开大门所进入的随机层级的生存难度的增长速度随在此层级逗留时间增长的速率也不同。因此建议，一旦发现自己进入Level C-313，请尽快地从大门出去。
//
//探索记录4
//
//流浪者姓名：顾██
//层级表现形式：一间救助站4
//顾██在切入后没有观测到任何异常改变，约3分钟后打开门并离开此层级，进入Level C-302。
//
//推测若进入Level C-313后其显示的场景不是流浪者的家，则此层级对流浪者的心理影响不会产生。
//
//探索记录5
//
//流浪者姓名：肖██
//层级表现形式：约88m2住房；
//记录的变化：
//
//04:08:07 卧室的衣柜颜色发生轻微变换，从白色变为较破旧的米黄色；
//06:09:19 床单的图案发生轻微扭曲与破旧；
//14:36:51 层级的墙壁变为灰色的。窗外景观显示为傍晚与夜晚的交接时段，房间内灯难以打开；床正对面的电视屏幕变为镜面。卧室中出现《农神吞噬其子》《雨中女郎》等画作的拙劣仿作；物品出现与探索记录3中类似的未知反光现象，能够持续听见未知来源的，荧光灯工作的嗡嗡声。
//14:37:03 房间格局发生了变化，包括：原先通往厨房的门现在通向一条有终点的短隧道；一个面积约2m2的空房间取代厕所与卫生间的门对接；客厅面积扩大，长沙发消失，被一个小凳子代替；茶几的四条支撑腿仅存留一条，但仍稳定站立；客厅电视变为一个面积大致同等于原电视屏幕的矩形入口，通向一个较大的空房间，内部空旷，且被未知光源照亮5；层高提升了约6m。
//之后的记录所描述的现象暂不能被理解。现该人员已失联，推测其打开大门后进入了极端危险的层级。
//建议流浪者进入此层级后不要在其中进入睡眠。
//
//基地、前哨与社区
//由于性质特殊，该层级没有已知的基地、前哨与社区。
//
//入口与出口
//入口
//在其他层级中独处时有极小概率发现一扇制式极其类似流浪者前厅中的家的大门的门，它通常通往此层级。
//出口
//从大门出去，会依循上文所述规律切入到后室C层群中的一个随机层级。
//附录
//下面是首次探寻该层级的赵█在该层级中以及离开后写下的记录原文。
//
//- 收起记录
//我记得我原先在Level C-28里转悠，刚刚进入那里没多时的我正处于一种惶恐与不安之中。不过我折入一栋居民楼的楼道，看到那扇门的时候，一切仿佛平静了许多。
//
//没人比我更熟悉那扇门。木制，金色的把手，沉重而安稳，就连把手上的磨痕，似乎也和我最后一次见到它时一样。它仿佛在吸引我进入，仿佛在对我说，只要进入门后的那一方天地，我就不再是后室里的流浪者，而重新回到我魂牵梦绕的地方，我的归宿。
//
//于是我进去了。一切好像就在那里等着我一样。沙发靠背上摆着的一排公仔，茶几上花瓶里插着的花，还有落地窗透进来的午后阳光，以及阳光里浮动的灰尘。我在这里住了十五年有余，尽管切入后室以来我对它的记忆在一点点衰减，但那些躺在我回忆底部的东西就这样被调动了出来，然后展现在我面前。
//
//一开始我觉得我通过某个未被发现的入口进入了Level C-17。但是我从内心深处不相信这里是后室，因为毕竟这里的一切，都与我的家是那么相似，甚至我觉得这就是我的家——我准保是通过那扇门回到了前厅。因为只是坐在沙发上，看着客厅一角那静静洒下的阳光映在钢琴上的金影，就让我感到无比的安心。
//
//这里有水，有食物，我甚至用冰箱里的菜花了几个小时给自己做了顿饭。手法已经生疏了很多，但是有着久别重逢的味道。坐在餐桌前，看着墙上挂着的那幅画——静谧的乡村农田，那是我小时候一直幻想着去的地方。
//
//约莫五个小时了。已经入夜。我望向楼下的绿化带，看见那丛树里，不知怎么就冒出来一棵硕大的东西。突兀、粗大而又高耸，以我贫瘠的知识储备，那好像是一棵猴面包树。我的心一沉——像是发现了原本属于我的东西被打上了别人的标签一样。它为什么会出现在这里？如果不是物业发了疯搞非洲景观试种植，那就是我在后室里待得都出现幻觉了。我用视线刻意躲避那棵树，好像我不看它它就不存在一样。毕竟我的身后，我的脚下，还是我的家。那里的灯光是温暖的黄色，仍旧让我从心底里感到安适。
//
//不到半小时之后，仅仅是一转眼的工夫，我从我的卧室走出来的时候，客厅的灯光已经变成了白色。白得让人发慌，让人想起了手术室的无影灯。一股冰冷的感觉从脊柱下方缠绕着爬升到天灵盖。客厅里什么都没变，只是亮眼的白色灯光便足以让我的安适感消失不见。我坐到沙发上，眼睛从指缝里打量着熟悉的一切。茶几上的花依旧是粉色的，钢琴依旧披着紫色的布矗立在角落。我那时多么希望下一次眨眼之后黄色的灯光能够再次充盈我的视野，可是没有。
//
//钢琴逐渐吸引了我的注意。我眼角的余光总是瞟到那里有什么东西，但看过去时，却什么也没有。我鼓起胆子掀开紫色的绸布，抬起键盘盖细细端详的时候，一种更加惶恐与不安的情绪扑面而来——琴键，琴键少了至少四个。我小时候最喜欢按动的那个响起来好像敲动三角铁的C8，带着我的指纹一起不翼而飞。我颤抖的手指按向琴键，仅仅按动了一个，那传出的声音好像把它周围的所有键带动着一起按下去了一样尖锐刺耳。我当即跳了起来，键盘盖都没顾得上盖，就把自己拖到了餐厅。那里还有着温暖的灯光抚慰我。
//
//我的心跳催动着精神不断地紧绷。这里不再是我的家——或许从一开始它就不是。我揉了揉因为久处白光之中有些疲惫的眼睛，却在再一次睁眼时，看见餐厅里笼罩我的暖黄色灯光变得惨白。
//
//耳边传来荧光灯嗡嗡闪烁的声音，就像Level 0，我离开家之后一步踏进的那个天杀的地方一样。它向我昭告了一件不争的、残酷的事实——这里不是我的家。
//
//恶作剧一般，那幅乡村恬静景观的油画，也变了样子。猩红的颜料被肆无忌惮地涂抹在金色的画框之中，画布的上部有着倒立的桌椅，像学龄前儿童简笔画一样简陋。但桌椅的分布、桌上摆着的瓶瓶罐罐，以及坐在椅子上的那个类人轮廓，一切都那么像是——我现在所存在的那个餐厅，那个我原先以为能给我安心的地方。
//
//我不顾一切地跳起来，把一把餐刀甩向那幅画，然后转头跑过惨白色的客厅，拉开那扇曾被我寄予无数期待的门，然后跑了出去。
//
//门外是一片安详的田野，有点像那幅画本来的样子。转头看去，把我带来这里的门已经失去了踪影。
//
//我仍旧没有从余悸中缓过来。我刚才眼睁睁地看着那个我待了十五年的最熟悉的地方，在我的眼前变异，被那个不知名的层级侮辱。它为什么要用那么温馨的气氛吸引我在里面久留，随后却将我投给它的情感肆意践踏，将我对家的思念变作我内心久久不散的伤痕？
//
//我对自己苦笑。也许一开始就是我不切实际的幻想，幻想竟然能够在后室这个地方找到我真正的家。然而这里是后室。这里一开始便注定不会是我们眷恋思归的地方。眼前的这个层级，仿佛在抚慰我不安的心，仿佛要重新给予我那样的安定感。我感谢它，接受了这个地方并定居，但也许在那个层级里发生的一切，我永远不会忘记。
//
//如果看到一扇熟悉的门，请不要抱以太大期待。这里终究不是前厅。这里不是家。
//
//- 收起记录
//
//为了您的安全，再次强调：若在后室中进入Level C-313或疑似层级，保持警惕。请尽量克服留恋的情绪，并尽快从大门离开。
//作者信息
//« Level C-312 | Level C-313 | Level C-314 »
//
//Footnotes
//1. 以下特殊情况值得注意：即使两个流浪者在前厅中于同一个家内生活，他们依旧不会在此层级中相遇；对于现实中无家可归的流浪者，这个层级通常对他们展现为他们所最熟悉的密闭房间；理论上来讲，于后室出生的人无法进入此层级，目前没有相关记录
//2. 然而对于每个流浪者而言，出口处所对接的层级的生存难度随时间增加的速度是不一样的。
//3. 首次记录到Level C-313展现出多层的形式。然而，尽管其所展现的建筑在现实中配有大门外的园圃和露天的阳台，园圃和阳台皆属于别墅且从窗户或玻璃门能够看到，打开门并试图进入园圃仍会触发其他Level C-313大门的效果，而打开阳台门的尝试则失败了。
//4. 顾██切入后室前所处的地方。据悉其在前厅中是无家可归的
//5. 需注意电视墙后应该是记录者的卧室
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1313{}