//Level C-340
//评分: 
//+18
//+
//–
//X
//本层级档案由正电子后室有限公司（E.P.B）1生化科学部提供。
// 
//
//层级属性：
//安全
//稳态
//标准化实验区域
//Level C-340是后室C层群的第340层。
//
//Picture%201
//合成室的一角。
//
//E.P.B.生化科学部的介绍：
//欢迎来到E.P.B.生化科学部！很荣幸为大家介绍生化科学部的核心工作室之一，Level C-340，也就是大家经常提到的合成室。在生化科学部的诸多研究员与后勤人员的不懈努力下，合成室如今已经成为生化科学部的重要实验室，主要负责多组分物质分析，高危材料理化性质测定以及对于后室中常见的物质进行提纯的实验。同时，合成室也接受组织和个人对于特殊物质进行测定纯化的委托，具体的细节可向接待室的前台咨询。
//
//- 收起
//生化科学部一直致力于寻找一个安全稳定的环境用于进行复杂并且高风险的实验，而Level C-340正好符合这个条件。Level C-340最初由生化科学部的一名后勤人员在Level 11寻找合适的实验场所时无意中发现，那时的Level C-340除了中央的大型仪器外周围空无一物，在经过对其中环境与实体情况测定后生化科学部认为这样一个安全并且未被开发的层级很适合建设一个大型实验室。在经过长达两年的装修与仪器搬迁、组装等工作后，合成室终于开始运转，并且开始承接生化科学部中诸多高风险的实验。现今该层级在生化科学部的领导下稳定运转，也是重要的科技产品交易场所。
//
//- 收起
//描述
//Level C-340是一个干净整洁的室内实验室，分为接待室、准备室、合成室三个部分。接待室是Level C-340的第一个房间，由任何方法进入此层级均会首先进入该房间，接待室的地板与墙壁均被瓷砖覆盖，天花板处的LED灯为该房间提供了不间断的照明，由接待室右侧的门可进入准备室。准备室是接待室与合成室之间的过渡区域，在此处为流浪者们准备了进入合成室所必须的防护，如护目镜、一次性手套、实验服、防毒面具等，只有在穿戴好必须的防护后，才能通过准备室尽头的自动门进入合成室。
//
//合成室是Level C-340的核心区域，其中包含了多个实验台与非常多的实验仪器，合成室两侧的药品柜中也有非常多的实验原料2。合成室的地板与墙壁均被防静电材质覆盖，并且天花板的LED灯有防护罩保护。由于该层级的电力来源未知，合成室内偶尔会发生电压不稳的现象，但不会影响到室内仪器的运转。建议在出现电压不稳的情况下不要进行实验3。
//
//Picture%202
//EB-1的送样口。
//
//在合成室的中央的一个单独的房间中运转着一台巨大的自动化合成机器，这台仪器被命名为E.P.B-BSI-1（简称EB-1），在该层级被发现后EB-1便开始运转。EB-1的外部构造与常见的仪器差别巨大，并且由于无法找到停止EB-1的方法，所以无法对其内部构造进行分析。将一些常见物质送入EB-1会发生诸如纯度提升、性质转变、失去原有功效等现象，例如将一定质量小颗粒的火盐送入该仪器中可直接获得高纯的大型火盐锭，更多配方可在准备室和仪器所在房间的墙壁上直接找到，另外不建议将从该仪器获得的产物（尤其是火盐等含能材料）多次重复送入该仪器4。
//
//- 收起
//注：”→“代表将物质送入EB-1进行一次反应。
//杏仁水→气味与味道变明显，体积变为原来的1/2，营养价值提升→淡黄色粘稠液体，刺激性气味，溶于水可重新转变为杏仁水
//火盐（50g及以上质量）→等质量的高纯火盐锭→大块暗红色火盐结晶（禁止将此物质再送入仪器！）
//医用酒精→高纯乙醇
//皇家口粮→成瘾性大幅下降，提供的能量下降至原来的10%
//糖果→特殊效果消失
//悲伤之水→橙黄色针状结晶（强效镇静效果）
//星云（混合腰果水后送入仪器）→沸点进一步提升→透明液体，冷却后可得透明晶体（禁止将此物质再送入仪器！）
//糖晶锭→营养价值提升，显现出模糊的城市缩影图
//
//- 收起
//实体情况
//目前在该层级仍未有任何实体的目击报告，但有少数报告称目击到不明实体在操作仪器，虽然未被证实，但该层级的部分仪器确实偶尔发生自行运转5。
//
//生化科学部研究团队
//E.P.B 生化科学部物质合成研究组
//由约30名的研究人员组成，主要负责高危物质的合成方法探究。
//E.P.B 生化科学部物质分析研究组
//由约25名研究人员组成，主要负责分析测定各层级收集到多种物品的组成成分。
//E.P.B 生化科学部仪器管理与维护组
//由17名研究人员与9名后勤人员组成，负责合成室内仪器的管理与维护，同时也负责对于EB-1的研究。
//E.P.B 合成室安全保障组
//由40名武装人员和8名医务人员组成，主要负责合成室内外的安保工作，同时也负责对于实验室中安全事故的紧急处理。
//E.P.B 合成室销售部
//由大约10名来自商业部的人员组成，主要负责合成室中产品的销售与受理委托等业务。
//实验记录与事故报告
//- 收起
//实验主题：杏仁水在EB-1中转变情况的探究
//实验目的：将从不同层级获得的杏仁水送入EB-1，收集反应结束后的产物，进行分析，借此分析EB-1的运转规律。
//实验日期：2020/04/17
//实验员：仪器维护组见习实验员 “66”
//实验方法：取50 mL杏仁水，用100 mL注射器吸取，于EB-1大容量送样口直接注射进入仪器内，等待EB-1处理结束后，于仪器取样口收集产物。
//实验结果：EB-1首次处理结束后，获得约25 mL杏仁味无色透明液体，进行后续分析测定其成分发现其中营养物质（如糖分等）相较于原液总量并未发生变化。于是我们继续将浓缩后的杏仁水再次送入EB-1，得到带有刺激性气味的淡黄色胶状固体，将该物质重新溶于水可再度得到类似杏仁水的液体，对该胶状固体进行分析，其中营养物质的组成与杏仁水基本相似。
//结论：基于上述的实验结果，我们讨论后认为，这台来源不明的仪器EB-1，应该具有浓缩杏仁水的效果，同时这也印证了我们的想法，即杏仁水应该是由某种不明溶质溶于水后得到的产物，我们拟将第二次浓缩的产物命名为“杏仁冻”，这种物质可以作为更高浓的杏仁水来使用，相比于普通杏仁水有着更高的营养价值与更轻的质量。我们一致认为这种浓缩的“杏仁冻”对于后室的探险团队的价值巨大。
//生化科技部部长批复：你们的实验报告我已阅读，你们的结论对于我们认识后室中诸多物品具有重大意义，这也说明EB-1这台仪器的奇妙性质。我已听说你们实验条件艰苦，但是你们似乎从未向总部申请过额外资源，我已向总部申请更多后勤人员前往合成室，希望能帮助你们更快完成合成室的建设工作。
//另外，我已亲自检验“杏仁冻”的效果，建议适当补充一些香味物质以掩盖其刺激性气味，这可以避免部分对于气味敏感的人员无法使用该物品。
//
//- 收起
//- 收起
//实验主题：探究医用酒精在EB-1中的转变情况
//实验目的：利用医用酒精这种已知组分的物质，进一步确定EB-1的特性
//实验日期：2020/09/23
//实验员：仪器维护组实验员 “66”
//仪器维护组见习实验员 四方月
//实验方法：基本与实验一相同
//实验结果：EB-1处理结束后，从取样口1,2分别取得了纯度极高的水与乙醇。
//实验结论：与实验一类似，EB-1确实可以做到提纯,分离混合物中各组分的效果，同时对于乙醇这种易燃的材料，整体实验过程安全、高效。我们讨论认为，EB-1或许能作为提纯一些含能材料的理想仪器。仪器维护组认为可以考虑下一次实验进行火盐的相关实验。
//生化科学部部长批复：目前得到的结论基本保持一致，同意实验进度进入下一阶段。进行实验前务必做好防护措施，实验员“66”已多次操作EB-1，经验丰富，我建议火盐实验由他来进行操作，具体实验安排由实验组结合实际情况来确定。
//合成室的远程监控已安装完成，我会在办公室与生化科学部的高层一起远程监督下次的实验。
//
//- 收起
//- 收起
//实验主题：探究火盐在EB-1中的转化情况
//实验目的：利用EB-1的纯化特性，研究火盐的组成成分
//实验日期：2020/09/26
//实验员：仪器维护组实验员 “66”
//仪器维护组见习实验员 四方月
//注：此次试验由生化科学部部长白曦远程监督。
//实验方法：将一定量的火盐加热熔化，由高温送样口注入EB-1，等待反应结束，在取样口收集产物并分析。
//实验结果：高温送样口注入约50 g液态火盐，在取样口收集基本等质量的大块火盐锭，反应时长约10分钟。
//实验结论：经由实验员辛苦的反复实验，我们基本确定，在投入质量大约50 g以上的液态火盐后，EB-1可以安全高效的将火盐转变为更高大块的火盐锭，整个过程相较于用传统方法制作，火盐损失较少，同时也更安全。可以预见，利用EB-1来大规模合成火盐锭可以节省大量的资源，也更安全。在实验组内部讨论后，我们提议对于火盐锭进行进一步的纯化，以探究火盐是否和杏仁水一样可以进一步纯化得到某种更高纯的物质，如果可以得到纯合的火盐，或许可以加深我们对于这种高危材料的理解。
//生化科学部部长批复：你们的发现振奋人心，EB-1在帮助我们理解后室一系列奇异物品上起到了至关重要的作用，这一度让我们相信EB-1是解开后室诸多谜团的关键。经生化科学部高层讨论后，我们同意关于火盐的后续实验，但是要注意纯化后的火盐可能的危险性，应当做好足够的准备工作。
//
//- 收起
//- 收起
//事故简述：2020年10月2日15时12分，操作员“66”在对火盐锭在EB-1处理后的产物进行收集时，产物忽然发生爆燃现象，操作员“66”受重伤，见习操作员四方月在扑灭EB-1取样口的火焰时，被飞溅的结晶碎片击穿防护服，造成贯穿伤与小面积烧伤。
//事故原因分析：纯化后的火盐锭转变为高纯的暗红色结晶，这种结晶已表现出极端的不稳定性质，只有将它储存于填充惰性气体的密闭容器中才能避免其出现发热、自燃等现象。实验组将极少量该物质在惰性气体氛中再次注入EB-1中，以探究该物质是否为火盐的纯合物，但得到的物质性质过于不稳定，实验员“66”仅轻微震动了产物便引发了爆燃现象。该物质的不稳定性使得无法继续对其性质进行研究，对于火盐纯合物的探究就此终止。
//我已不愿再看到任何的人员损失
//事故后续处理：两名实验员在及时医治后均已痊愈。感谢实验员四方月在突发情况下的镇静，EB-1仪器在该次事故中并无损伤。我们已派遣后勤人员进一步优化合成室内的防护措施，以避免高危实验对于研究人员的伤害。
//事故记录员：生化科学部部长 白曦
//
//- 收起
//- 收起
//事故简述：2021年3月8日16时09分，研究员四方月带领见习实验员简进行星云的纯化实验，在收集星云第四次转化的产物时，机械臂在转运产物时的轻微震动造成了爆燃现象，合成室内的防爆玻璃出现裂痕，随后室内消防系统启动，明火在1分30秒左右被扑灭。无人员伤亡，EB-1也未受损。
//事故原因分析：我们推测星云与火盐具有类似的性质，高度纯合的星云和火盐的性质可能都极不稳定，它们都只能在混合部分惰性材质的条件下才能稳定储存。我们讨论后建议对于所有的易燃易爆的含能材料在EB-1中最多只能进行不超过三次的反应。
//事故后续处理：在对于取样口进行了足够的猝灭处理后处将爆炸的残渣清除，同时重新安装新的防爆玻璃，在准备室与EB-1附近张贴明显的告示提示操作人员对于含能材料的操作规范。
//事故记录员：仪器维护组组长 “66”
//
//- 收起
//- 收起
//事件简述：2020年3月18日18时49分，本人在合成室临时搭建的活动实验室内进行简单的火盐锭合成实验，在火盐锭结晶时，实验室内突然出现灯光闪烁、极大的噪音等现象，我敢说这和之前那次临时实验室线路没搭好绝对不一样！但是奇怪的是，火盐锭合成实验在电压不稳的情况下顺利完成了，甚至超过了之前所有已记录的产率！但是平行的一组却很奇怪的产率接近为0，按理说在电压不稳、缺乏良好的降温与真空保护的情况下，产率的提升和几乎无产物都是不正常现象。
//事件记录员：见习实验员 “66”
//生化科学部部长批复：临时合成室的条件可能成为一种外因影响了实验结果，根据之前的记录，在电压稳定的情况下实验室的契合度是很高的，建议以后在电压不稳的情况下停止实验，以免造成危险。
//另外，事件记录请尽可能不出现个人情感的流露，以论文写作的格调为模板，本次记录已归档。
//见习实验员“66”，前几天我去合成室查验施工进度，发现实验室连空调都没有安装，建议你工作需要劳逸结合，合理安排实验，在17时后应离开实验室休息。
//
//- 收起
//- 收起
//事件简述：2020年4月21日，在施工时，一名施工人员声称他目击到一个疑似无面灵的实体进入合成室，随后靠近了一台仪器，在该名施工人员试图报告这一情况时出现电压不稳的情况，随后该疑似实体便消失无踪。尚不清楚该疑似实体是否为造成电压不稳的原因。
//事件记录员：见习实验员 “66”
//生化科学部部长批复：关于实体的情况已收到，我已向总部申请额外的安保部队，请诸位实验员最近注意安全。
//
//- 收起
//- 收起
//事件简述：2021年7月13日，研究员四方月和后勤人员在对仪器进行日常检查过程中，位于合成室东区的恒温摇床忽然在无人操作的情况下自行启动，同时部分后勤人员称疑似观察到半透明实体。随行的安保成员立刻撤离实验室中的研究人员并进行全方位的搜索，但并未发现任何实体存在的迹象。
//事件记录员：仪器维护组组长 “66”
//生化科学部部长批复：之前已收到若干次不明实体的疑似目击报告，仍不能掉以轻心。该次异常事件处理方法十分正确，建议应对所有进入合成室的新人告知不明实体的情况。
//“66”，长久未见，伤口是否已经完全愈合？
//
//- 收起
//入口与出口
//入口
//从 Level 11处找到一个贴有“注意机器危害”的玻璃门，进入后可来到该层级。目前该入口已被E.P.B控制，非E.P.B成员需在申请后进入。
//出口
//离开准备室的入口玻璃门便可回到 Level 11。
//作者信息
//« Level C-339 | Level C-340 | Level C-341 »
//
//Footnotes
//1. E.P.B.的全称是“正电子TM(后室)粒子科技有限公司(Electron-positivusTM Particle Technology Co.,Ltd. of Backrooms)。致力于使用最新的科学技术产品帮助每一位有需求的流浪者，帮助他们更有保障地在后室中生存与探索。对外宣称的目的是从微观视角探寻后室的奥秘，并让后室的资源造福人类。
//2. 原料包括但不限于杏仁水、火盐、医用酒精等，由生化科学部提供。
//3. 参见异常事件报告一。
//4. 将从仪器获得的产物反复送入该仪器易引发严重的安全事故（一般为三次以上），参见事故报告一、二。
//5. 参见异常事件报告二、三。
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1340{}