//Level C-315
//评分: 
//+12
//+
//–
//X
// 
//
//生存难度：
//等级 5e
//
//不安全
//稳定
//非实体危害C315.jpg
//Level C-315入口处照片。
//
//Level C-315是后室C层群的第315层。
//
//描述
//Level C-315由入口和主区域组成。入口为一个黑暗但具有微光的台阶组成，顺着台阶往下，即可看到一个散发着绿色光线的通道口。里面呈现一片纯绿色的无限空间，且来自该空间的光源不明。
//
//入口处并无危险，但不会刷新任何物资，也不会出现任何实体。若流浪者沿着进入本层级的台阶一直向上走，则会发现自己似乎进入了一种循环之中。据流浪者所述，它们好像在“不断的被传送至台阶的起点”。即使如此，仍有流浪者在台阶的传送中偶然能发现某些异样，包括但不限于：
//
//扶手旁的灯会突然全部熄灭。
//眼前似乎闪过一瞬间模糊的城市画面。
//墙壁上出现一些风格为上个世纪60年代的脱落的墙纸。
//即使流浪者们坚称保持清醒，但有时仍然会传来不属于流浪者的细微脚步声。
//当流浪者走下台阶，进入了主区域后，他们会立刻被一种颜色接近于“绿幕”的光照现象所影响，流浪者将瞬间迷失方向，这意味着他们无法再返回入口处，只能从这片绿色区域逃脱。
//
//以下是对所有从Level C-315成功逃脱的流浪者的采访。
//
// 
//
//采访对象：布兰茨，男，25岁，欧洲人，前罗经点小队二等兵
//
//以下为报告截取内容
//
//采访人：当时都发生了什么？
//布兰茨：我找不到方向，只能到处乱跑，大概跑了十几分钟。
//采访人：你是怎么找到出口的？
//布兰茨：在那之后，我终于撞到了什么墙壁之类的，站稳了脚跟。然后拿出了指向树脂，晃晃悠悠的跟着它的方向绕过了……我也不知道多少个弯，反正之后就看到了一扇门。
//采访人：那扇门长什么样子？
//布兰茨：没记住，那会我基本上已经神志不清了，我手上和衣服上都变成了那种该死的绿色，而且手臂已经基本上要透明的看不见了。最后是靠仅存的一丝力气才撞开门的。
//采访人：在那之后，你到了哪里？
//布兰茨：好像是Level 1？那里是一个充满着绿色方形涂鸦的仓库区域，不过之后我就昏倒了，记得不太清楚。
//采访人：感谢你的配合。
//布兰茨：多问一句，我身上的这些绿色的玩意还能去掉吗？
//采访人：我想你可以咨询一下治疗部。
//布兰茨：好吧……
//
// 
//
//采访对象：安洁莉娜，女，37岁，非洲人，前踪迹制图者小队一等兵
//
//由于采访对象已无法发声，因此采访者使用了问答方式提问
//以下为报告截取内容
//
//采访人：你在那里的绿色区域待了多久？敲一下为半个小时。
//（安洁莉娜敲了4下）
//采访人：你有没有遇到其他实体？敲一下为是，两下为否。
//（安洁莉娜缓缓敲了1下）
//采访人：那些绿色是通过你的皮肤不断渗入你的体内的吗？敲一下为是，两下为否。
//（安洁莉娜重重的敲了1下）
//采访人：你是怎么发现出口的？是通过身上的指向树脂还是紫钥石？前者敲一下，后者敲两下。
//（安洁莉娜先是思考了一会，然后坚定的敲了2下）
//采访人：之后你回到了哪里？是Level 1吗？敲一下为是，两下为否。
//（安洁莉娜敲了2下）
//采访人：你到达了C层群？敲一下为是，两下为否。
//（安洁莉娜敲了1下）
//采访人：你到达了哪一层？现在我开始报数，从20开始加起，层数每多20层，你敲一下，如果小于20，则敲两下；之后我改为10层一下，5层一下，直到你到达的层级。
//（根据统计安洁莉娜的多次敲击和反复确认，她到达的是Level C-143）
//采访人：好的，感谢你的配合。
//（安洁莉娜点了点头）
//
//根据上述采访可知，Level C-315的主区域拥有者类似于Level 0的走廊式结构，且具有对人体的渗透作用。人的表面会渐渐变成绿色，然后不断的透明化，直至该部位完全消失。这一过程可能会持续2~3个小时左右，因各个部位的深浅厚度不同而导致被渗透的时间具有细微差别。
//
//推测正是由于该种现象，才导致本层级内不存在任何实体，以及可能存在的未成功逃脱的流浪者的遗体。目前该层级已经被M.E.G.划分至“禁止进入”的危险层级名单之中，并进行严格管控。
//
//基地、前哨与社区
//M.E.G. “绿色安全”前哨站
//位于Level C-315入口处。
//常驻2人，每30天轮换一班，且持有小型武器。
//驱逐一切试图进入Level C-315的流浪者或团体成员。
//入口与出口
//入口
//仅供档案员查看
//
//- 验证通过
//Level C-220一栋黑色涂料装饰的建筑之中存在一扇到达此层级的门。
//出口
//通过指向树脂在本层级的绿色主区域内找到一扇到达Level 1的门。
//使用紫钥石可到达Level C-143，该方式不稳定。
//推荐意外到达Level C-315的流浪者使用特殊切出手段离开本层级。
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1315{}