//Level C-367
//评分: 
//+6
//+
//–
//X
// 
//
//生存难度：
//等级 5
//
// 
// 
// 
//Level C-367是后室C层群的第367层。
//
//通知
//
//在撤退行动结束后，有关Level C-367层级的相关信息将在进一步探索和归档整理后登记为正式内容，目前该层级相关信息来自M.E.G.驻层级防御部队文书Lights中士的手写笔记，存在部分主观描述和错误信息待修正。
//所有来自该层级的图像信息已被封存，直到确认该类信息不存在精神危害为止。
//
//描述
//该层级为一艘军用舰艇的内部舱室，目前已探明区域为不同规格及功能的487个舱室及不同长度和内饰的932条走廊，其设计风格近似于二战时期战列舰的内部，在部分走廊墙壁上悬挂有风格复古的油画或横幅，内容为壮汉与章鱼形怪物搏斗或英语写成的“保持清醒，继续战斗，战至最后”。
//他们，他们做到了
//
//走廊内有大量拖曳状血迹和未知成分、散发有鱼腥味的粘液。
//
//除M.E.G.于入口军火库处建立的基地及已确认安全并建立有效防御的舱室外，超过半数1舱室被该层级具有的未知大量实体控制，实体的特征包括：
//
//呈人形，与健壮成年男性身材相仿
//身着具有鲜明特征的海军风格制服，大多沾有血迹
//无法分辨任何特有人类面部器官
//行动迟缓
//推测不具有智能，无法进行生物本能以外的活动
//拥有智能，可以准确辨明层级内各舱室功能和联系
//可以熟练使用部分舱室内设施，如灭火设施等
//可以熟练使用军用制式武器
//复数个实体间没有有沟通能力，由推测为喉咙内发出的不同节奏和音调的短音节组成简单语言
//人类无法与其沟通，任何在实体五米内的人类将被无差别攻击，攻击方式为使用肢体击打或撕扯，表现出远大于正常人类的力量。
//身体表现出与外观不符的强度，已知只有大口径霰弹枪近距离轰击或侵彻力较强的步枪弹能对其造成无法活动等级的伤害
//在破坏心脏位置或头部致其不断流出有浓烈鱼腥味的深红色体液后可使其失去活动能力，失去活动能力的实体会在三十分钟内液化为深红色体液，被排水设施引向未知区域，未探明该液体对人类的副作用
//他们会进化，他们不会死
//层级内的墙壁无法被任何物理手段破坏。
//
//层级内一切电子设备均无法使用，只有M.E.G.基地内提供的无线电设备可在层级内使用，因为防御行动的损失，现存通讯设备197 143 104 66 45 21 10 5套。 我们失去了最后一套设备和最后一个防御组
//
//部分外观为炊事房的舱室内有放置了食物的冷藏柜，每天24:00后冷藏柜内将重新以未知方式补充随机种类的食物，目前M.E.G.仍控制5 4 3 2 1 0个该类舱室保证食物供应。
//弹尽粮绝
//
//基地、前哨与社区
//基地
//M.E.G.以一个军火库为中心向外拓展了部分区域作为可居住点，并设立了三道防线，现存 3 2 1 0道防线防御实体的进攻。
//基地完了，就他妈是个人间地狱
//
//档案员补充
//
//鉴于维持基地的难度已不可接受，M.E.G.已通过出口撤出所有人员并放弃对该基地的维护，后续出现在该层级的人员可找到撤退前遗失的装备和补给。
//不建议任何人员尝试进入该层级，该层级目前情况未知且极度危险。
//
//入口与出口
//不要再来这了
//
//入口
//在位于公海的船只上使用一支被登记的军用制式步枪进行10发点射有大概率进入该层级。
//出口
//拧动层级内任意一个鲜红色水阀三圈将随机到达一个已被登记的可使用的M.E.G.设施。
//档案员补充
//
//Level C-367的目前状态不明，派出侦查队进行侦查的计划已经失败。
//完成撤退的剩余M.E.G.站点人员已有73％出现向层级内实体转变的症状，授权对转变个体进行处决。
//大概没人看的作者信息
//Footnotes
//1. 无法确认确切数量，因为随时可能发生实体的入侵事件将造成控制舱室数变动。
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1367{}