//Level C-341
//评分: 
//+13
//+
//–
//X
// 
//
//生存难度：
//等级 2
//
// 
// 
// 
//Level C-341是后室C层群的第341层，该层级表现为一片血红色的海湾。
//
//LbzPSI.jpg
//Level C-341
//
//描述
//Level C-341由一片未知面积的血红色海湾组成，层级分为一片环境适宜的海岸，和一大片未知面积的血红色海域组成，整个海湾似乎被非常高的环形山脉包围着，该层级存在明显的昼夜交替，且天上有类似太阳和月亮的物体，但是早上和晚上分别都只有六小时，层级中的空气异常清新，该层级气温早上处于10°C~24°C，晚上气温处于-5°C~-13°C，海湾的深度不详，目前潜水员最深只潜入到79米，推测海湾深度似乎为无限深，海域的海面很平静偶尔会吹起海风。
//
//Level C-341的海岸呈现为典型的热带沙滩海岸模样，海岸主要由沙子、贝类和螺类的碎片构成，沙滩上偶尔会有不明品种的蟹，螺，海星被海浪冲上岸，海岸上不知什么原因不存在任何植物，海岸上会有几栋小木屋，小木屋内会随机刷新一些杏仁水，罐装龙肉，皇家口粮等补给。
//
//LbznYj.jpg
//层级海域中类似于海豚的生物
//
//Level C-341海湾的海域主要由杏仁水组成，海域中有一些特定区域的海水较为温热且含有盐分，但是因不明原因整个层级的海域都呈血红色，能否直接饮用目前尚不明确，层级的海域中存在一些未知品种的大型海洋生物和藻类植物，同时存在大量的类似前厅海豚的生物，海域每5至6小时会涨潮一次，涨潮会持续1小时以上，涨潮时潮位会固定涨72米，每次退潮都会有一两只类似海豚的生物搁浅在沙滩上。
//
//实体
//层级的海域中只有歌鲸这一种已知实体，早上时海岸上不存在有害实体，但是晚上会出现死亡飞蛾、笑魇、窃皮者等实体，所以晚上探索层级是极不推荐的。
//
//基地、前哨与社区
//M.E.G.“血海狂潮”哨站
//该哨站共有13人。
//他们在此帮助意外切入该层级的流浪者。
//开放交易。
//B.N.T.G.“赤色海岸”基地
//该基地是B.N.T.G.的一个小型捕鱼站兼晒盐场。
//B.N.T.G.于2019年11月5日建立该基地。
//该基地共有50人，由于基地中多数人是渔夫所以该基地的战斗力不高。
//他们开放交易。
//入口与出口
//入口
//在Level C-44躺进一个流出红色液体的浴缸
//在Level C-88切入一处肉壁有几率到达Level C-341
//在任意一个关于海的层级潜水，潜到一定程度时，水会变红，这时再浮到海面上就会到达Level C-341
//出口
//潜入海中，潜到一定深度时周围的水会慢慢变透明，这时浮出海面会随机来到一个关于海的层级
//躺在海湾的沙滩上睡着，醒来有可能会来到Level C-91
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1341{}