//Level C-353
//评分: 
//+36
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//Level C-353是后室C层群的第353层。
//
//描述
//Level C-353是一间美式独栋别墅，其主要区域是一个面积约为25平方米的游泳池。该层级的时间永远停止在了下午4：30分，具体原因未知。游泳池的建设较为奢华，其有着花岗岩贴砖，池水澄澈，带有一种菠萝味的飘香；泳池旁配备着完好的救援措施，在泳池的四周摆放着一两张沙滩椅于其配对的白色圆形小桌，外围还栽种着一两颗热带植物，在泳池四周的栅栏上还挂着一块牌子，上面写着：
//
//克莱门特的公共私人泳池！
//开放时间：下午5：30至7：30
//永不开放。
//
//泳池规则：
//1.不允许在泳池边追逐打闹。
//2.不允许在泳池内大小便。
//3.不允许跳水！
//4.在7：30之前回家
//5.不允许在泳池旁吃东西
//6.在克莱门特先生有事时恕不开放，非经允许禁止入内！
//7.该泳池永远关闭
//
//
//牌子上的多数内容已被划掉，只有一两句为新加上去的，原因未知。vrup60.jpg
//泳池的一角。
//
//流浪者可以选择在Level C-353的泳池中游泳，但会发生一些奇怪的现象，如：
//
//听见儿童的嬉戏欢笑声。
//泳池上的游泳圈忽然动起来，并在5分钟后停下。
//一些不知从哪里来的玩具突然掉进泳池中
//感觉自己好像被什么东西碰到了。
//在本层级中可以遇到一名名为克莱门特的实体，其性别为成年男性，年龄大概在30，40岁之间，性格冷漠，不可与其进行交易，流浪者可以与他进行对话交流，但在大多数情况下克莱门特都不会与流浪者交流过久，如果流浪者向克莱门特提及诸如是否有家人之类的问题，会被他毫不留情的打断并不再与流浪者进行对话。
//
//该别墅一共有两层，通往二层的楼梯是被封锁住的，不仅如此，大多数情况下克莱门特都不会允许任何流浪者进入别墅，流浪者只能在泳池范围活动，只有少数情况下克莱门特才会让流浪者进入一楼，但是不能使用一楼中任何的物品。一楼的构造为客厅，厨房与餐厅，其中客厅里堆放着一些装着儿童玩具的箱子，从上面的灰尘可判断已经很久没人使用，地上也散落着一些积木与娃娃，茶几上有一副克莱门特与一个类似是他女儿的合影，墙上还有儿童涂鸦；如果流浪者运气好的话，可以在沙发上找到一张日期为2021年7月30日的报纸，报纸上的内容大多因未知原因变得模糊不堪无法分辨，只能找到一篇名为：一名5岁女童被发现在自家泳池中溺水身亡的新闻报道，其中有一句：“警方最终判断为意外身亡，无他杀可能”的话被刻意的圈画了起来。与报纸摆放在一起的是一副写着”我的爸爸和我“的画。
//
//采访
//在许多次的交谈过后，一名不愿意透露姓名的志愿者终于取得了克莱门特的信任，以下是第一次的采访记录。
//
//采访编号：1024
//采访者 ：无名志愿者
//被采访者： 克莱门特
//
//克莱门特：你是要采访我吗？
//
//志愿者： 是的，那么采访现在开始。
//
//克莱门特：好的，你想问我些什么？
//
//志愿者： 那我们就以一个轻松的问题来开头，请问你之前为什么叫这个游泳池为”公共游泳池“？
//
//克莱门特：我和我的女儿大概是在…..2个月之前搬到的这个小镇，为了能哄我女儿开心然后给她找多点朋友，我就建了这么个游泳池来免费请镇上的孩子们来游泳，这也就是为什么那边的栅栏上有一个泳池规则的牌子了。女儿走了之后，我就把这游泳池关了。
//
//志愿者：嗯….好的，我记录下来了，那么就开始我的下一个问题：为什么二楼是锁上的呢？里面有什么？
//
//克莱门特：就是一些房间罢了，我的卧室和我女儿的卧室，自从我女儿意外走了之后，我就把她的卧室锁了起来，我怕睹物思人，可……你看，客厅里都是我和她生活过的痕迹，这也让我怎么能够释怀呢？
//克莱门特：我的爱妻走了之后只剩下了我和我的女儿相依为命，可事到如今……
//
//克莱门特叹了口气，摇了摇头。
//
//志愿者： 我很抱歉听到这个，那我问最后一个问题，就是您的妻子…..是怎么走的。
//
//克莱门特抬头，望向了远方。
//
//克莱门特：那原本是一个美好的下午。
//
//克莱门特：我刚接我的妻子出院，带着我的女儿，艾丽萨，正准备回家。可不知为什么，一个该死的货车司机，他闯了红灯！就这么猛地一下撞到了我们一家三口，我的妻子当场抢救无效死亡，而艾丽萨也因为发炎，失去了能够讲话的机会…….在万分悲痛过后，我和艾丽萨搬了家，来到了这里。只可惜，天命弄人啊！
//
//志愿者：我不知道怎么能够安慰你，死者已经离去，生者还要继续，请您振作起来！
//
//克莱门特：谢谢您的安慰，要不是我那天意外有事出门，让艾丽萨独自一个人在家，也不会这样………….
//
//志愿者：那好，我的采访结束了，也就不打扰您了。
//
//采访结束
//
//- 关闭Level C-353公路边上的监控录像
//由一名流浪者提供，此监控正好拍下了泳池中的景象，以下为2021年7月30日下午四点30分的监控画面：
//
//几名年龄类似在12岁的男孩在别墅外的栅栏四处张望。
//
//那几个男孩在再三确认没人后翻进了别墅的游泳池。
//
//动静不算太大，但好像在别墅内的艾丽萨听到了什么动静，跑出了客厅查看。
//
//女孩被这几个不速之客吓到了，准备想跑回别墅内报警。
//
//那几个男孩立马冲了上去，用手擒住了女孩的脖子。
//
//女孩惊慌的踢起了腿，想要挣脱开来，却毫无帮助，只能眼睁睁的看着那几个男孩扛着她把她丢进了水里。
//
//那几个男孩肆意玩弄着女孩，多次把她的脑袋按在水里不让她出来。
//
//最后一次将头按在水里的时间最长，此时可以看到女孩已经没了生命体征。
//
//屋外响起了车声，那几名男孩逃也似的离开了泳池，并没有留下任何踪迹。
//
//克莱门特在几分钟后慌张的跑出了别墅，看到了他泡在水里的女儿。
//
//他试图给她做人工呼吸，可这一切都已经是无济于事的了。
//
//克莱门特跪倒在地上，不停的忏悔。
//
//视频结束
//
//第二次采访记录：
//
//采访编号：1025
//采访者 ：无名志愿者
//被采访者： 克莱门特
//
//克莱门特：请问您为何再次登门拜访？对了！我得感谢您，我现在已经快摆脱掉丧女之痛了！
//
//志愿者： …….我得让你看看这段视频…………..
//
//志愿者将手机递给了他，克莱门特看了起来。
//
//克莱门特：……这…….这怎么会是这样！？为什么？？为什么上天会这么对待我！
//
//志愿者：请您不要激动……
//
//克莱门特：妈的老天爷你就要一直这样玩弄我，折磨我吗！这帮对案件调查无所事事的废物警察！这帮他妈肆意玩弄生命的狗东西！为什么要这样对我！为什么要这样对我！
//
//克莱门特愤怒的将身旁所有的东西摔到了地上。
//
//志愿者： …………
//
//克莱门特抽出了枪，向门外走去。
//
//克莱门特：是时候该做一个了断了。
//
//采访结束
//
//在这此采访之后，Level C-353的时间恢复了正常，但泳池中的水变为了猩红的液体，闻起来有血腥味，疑似是大量的人血。
//
//现在流浪者可以在客厅的桌上找到这么一封信：
//
//写给各位意外来到这的流浪者的一封信
//时间：2021年12月31日
//
//
//您们好。各位意外来到这里的流浪者们，感谢那名志愿者告诉给我的真相，我已经了绝了这些破事了，并走出了那常扰我的悲痛，现在我来介绍下这里。
//这是一件普普通通二层的别墅，一楼厨房内有许多的物资，但你们用的上的可能只有杏仁水和罐装龙肉了（笑）我可费了好大劲才搞来的，现在通往二楼的通道我也开放了，大家可以安心的在里面休息，就别弄乱我女儿的遗物就好啦！泳池的话我也重新开放了，只要你们不嫌弃就行。
//
//我呢？啊，我啊，我已经离开这了，至于去哪的话，我也不知道呢，祝我好运吧！
//
//在二楼的卧室内可以找到一幅画，疑似是由克莱门特画的，上面画着他，和她的女儿。
//
//基地、前哨与社区
//并未发现任何的基地、前哨与社区。
//
//入口与出口
//入口
//在Level C-207中和一群人游泳时就会被传送到这里，人群数目至少为5人以上。
//在Level 11中推开一扇带有泳池的别墅的门就会传送到这里。
//如果你在Level C-439的回忆中意外切入了一些儿童玩具，你便有可能来到这里。
//出口
//如果在泳池内待着的时间长达2小时，就会被传送到Level C-148。
//选择从前门出去，就可以传送到Level 167。
//如果你在离开本层时携带了游泳圈之类的物品，你会被传送到Level 119。
//如果流浪者试图切入游泳池的底部，有一定的概率会直接来到Level C-33。
//仅有很小的概率会在克莱门特的卧室中找到一把沾满血迹的手枪，触摸它你就会来到Level C-181。
//如果流浪者试图翻出栅栏，也会来到Level 167。
//误喝下泳池中的水，你会在一阵肚痛之后来到Level C-341。
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1353{}