//Level C-372
//评分: 
//+35
//+
//–
//X
// 
//
//生存难度：
// 
// 
// 
//Level C-372是C层群的第372层。
//
//描述
//Level C-372是一座地势起伏不平的山脉，地表生长着茂密的植被。在多次长途跋涉后，我们仍然没有找到这里的边界，因此普遍认为该层级是无限大的。
//
//cuzco-valley-peru-landscape-225146.jpg
//Level C-372的丘陵地带
//
//总体上来看，Level C-372如同后室对安第斯山脉中部地区的复制品。这里气候温暖干燥，有旱季和雨季之分。雨季来临之时，地表植物会迅速生长，直至高度增长将近一倍；到了旱季，它们又会恢复原先的高度。该层级拥有完整的生态系统，很多生活在前厅的动物也同样在此处繁衍生息，最为常见的是无峰驼和大型猫科动物，它们应该也是错误地切入了后室并来到这里。
//
//Level C-372有着多种无威胁的实体。你可以发现虫群在土壤中不断地穿梭着，使泥土蓬松而肥沃，由于数量众多，它们具备作为食物来源的潜力。有流浪者报告称观察到了一种性情温顺的尸鼠，为了适应这里的气候，它们褪去了部分毛发并改为杂食。
//
//Level C-372的中心是一座被称为“新库斯科”的古代城市，为团体“太阳之子”所建造、占领（详见下文）。
//
//资源
//矿产资源
//Level C-372的地底岩层主要由石英岩和页岩组成，蕴含丰富的矿产资源，包括但不限于煤炭、铁矿、铜矿、锌矿、银矿、锡矿、硝石、硫磺等重要工业原料，这些矿物会在被开采完毕后自动补充，新库斯科城半径16千米内的区域补充速度最快，这被印加人认为是所谓的“太阳神”给予他们的馈赠。在这片区域外，离新库斯科城距离越远，矿物的补充速度越慢。在新库斯科城半径102千米外，矿物将不再补充。
//
//……
//崭新的身躯
//
//
//
//特殊资源
//SM372-01
//SM372-01外形呈现深灰色油状液体，被称为“灰矿油”。运气好的话，您可以共睹其从地底岩缝中不断溢出的景象。事实上，这种物质并不少见，但分布稀疏，迄今为止，仅在“大矿洞”中发现了大型油田。
//
//spanner-3013129_1280.jpg
//经过“灰矿油”处理的铸铁扳手。
//
//将物品浸入灰矿油中，确认其薄膜已经紧紧地附着在物体表面后取出。处理完毕的工具耐磨性极好，寿命长，在流浪者中广受好评。如果在物体中直接掺入灰矿油，其硬度、韧性、耐热性、耐腐蚀性都会得到大幅提升，这种材料可以用于制造各式工具、武器和机械设备，拥有广泛的应用前景。SM372-01是B.N.T.G.的A级开采对象之一。
//
//
//
//……
//坚固的甲冑
//
//
//SM372-05
//SM372-05通常是白色微透明玉质固体，也存在极其少见的无色透明变种，散发着耀眼的白光，得名“昼光玉”。其只会Level C-372的水体中生成，产量相当稀少。
//
//crystal-1685590_1280.jpg
//罕见的无色变种
//
//昼光玉质脆，没有加工成工具和武器的潜力。然而，昼光玉是性能良好的化学试剂，当它作为催化剂参与时，铁可以直接与空气中的各种物质发生反应，同时释放热量。这理论上可以解决后室中的能源问题。但是，此反应极其剧烈，如果不把铁的用量降低到100微克以下，放热过程便会导致爆炸。
//
//目前，没有一个团体具备这样的精密技术。昼光玉的应用仍处于研究阶段，目前并没有利用其特性的有效方法。
//
//……
//嗜血的内心
//
//
//
//基地、前哨与社区
//“太阳之子”
//自称是五百年前在试图逃离“恶魔”的途中意外切入后室的印加人族群，他们建造了位于层级中心的新库斯科城，文明发展水平与前厅已经衰亡的印加文明相似。
//截至2022年，这个族群已经发展到了约1300人的规模，不同阶级的公民各司其职，构成了一个完整的社会体系。令人诧异的是，这个社会中没有“君主”这一角色的存在，不得而知印加人在五百年的光阴里是怎样保持团结的。
//太阳之子的成员平日里会种植作物、圈养家畜、开采矿石，也有小部分成员从事服务业、制造业和商业的工作。与他们互动被认为是有益的。
//……
//
//
//新库斯科城由居住区、大矿洞、太阳金字塔三个区域组成。
//
//“居住区”
//居住区占地约17平方千米，是成员们生活起居的区域，也是新库斯科城最主要的区域。这里最为古老的建筑经检测已经有约五百年的历史。所有的房屋都由石砖筑成，屋顶则用枯木和茅草搭建。M.E.G.和B.N.T.G.被允许在居住区修建基地。
//
//cave-hole-landscape-blue-sky-sunny-555727.jpg
//从大矿洞的入口仰望天空
//
//“ 大矿洞 ”
//“大矿洞”是经过“太阳之子”世世代代的而开发形成的一处人工矿洞，总面积达12平方千米。在大矿洞中，矿物自动补充的速度是Level C-372中最快的，分布也最为密集。整个大矿洞均属于印加人的领地，外来者不被允许在这里进行开采。
//
//“太阳金字塔”
//太阳金字塔是新库斯科城最大的宗教场所，也是此处最为神秘的地方。这里仅允许“太阳之子”的成员入内，因此我们无法确定该建筑的内部结构和实际用途，即使印加人已经声明这里仅仅作为一处祭拜神明的地方。
//
//…...
//我曾长眠于此
//
//
//
//
//
//M.E.G.（探险者总署）“遗迹”大使馆
//M.E.G.在居住区内建设的小型前哨，旨在研究“太阳之子”的文化并与之进行交涉。
//约有15位常驻人员。
//可以为流浪者提供食物和住处。
//附录A：首次采访“太阳之子”成员的音频记录
//B.N.T.G.（不结盟贸易集团）372号资源提取站
//B.N.T.G.所建设的大型基地，位于新库斯科城郊外。
//以在Level C-372中采集资源为主要目的。
//有48位常驻人员和一百余名雇工
//开放贸易，您可以在这里以较低价格购买物资2。
//后室重工 “斯特林”级一号工业区
//B.H.I.C.第三大的工业区，多为冶金、化工以及矿业工厂。
//位于距新库斯科城约34千米处。
//驻扎有20余名核心成员与数百名搬运/操作工人。
//入口与出口
//入口
//Level C-372的入口是保密的，您可以在Level 1中向“商人之家”的 B.N.T.G.工作人员 提出申请。如果申请通过，他们会短暂地让您失去意识，再次醒来时，您会发现自己身处372号物资提取站的临时宿舍中。
//出口
//离开 Level C-372 最简单的方法就是在372号物资提取站中找到一扇生锈的铁门，这会将您送回Level 13。
//在新库斯科城中找到一个20世纪早期装修风格的旅馆会把你带到Level 5，找到这间旅馆很容易，因为它显得非常格格不入。
//触摸一块半掩在土壤中的、沾满灰尘的靛蓝色玻璃将会被传送到Level C-28。
//在太阳神庙中错误的地方切出会来到神域
//……
//也必将卷土重来
//
//
//
//
//五百年前，恐怕我不是这样想的……
//
//
//
//
//
//
//
//我恨透这里了。
//
//
//
//
//
//老东西，还记得吗？
//
//
//
//
//
//我还尚幼的时候，你发现了我的能力。
//
//
//
//
//
//你畏惧我的强大，害怕我在日后会取代你“欧米伽”的地位。
//
//
//
//
//
//恍惚间，我看到我的鲜血染红了大地。
//
//
//
//
//
//而你，擦拭了刀上的血迹，扬长而去。
//
//
//
//
//
//你把奄奄一息的我扔到了曾经那荒无人烟的库斯科，想让我自生自灭。
//
//
//
//
//
//你却浑然不知，我是不死的。
//
//
//
//
//
//我的意识永远在这里游荡着。
//
//
//
//
//
//呵，这里的神明不堪一击，它不配书写库斯科的意志。
//
//
//
//
//
//我击败了它，取代了它的位置。
//
//
//
//
//
//是的，我取代了它。这个层级彻底处于我的控制之下。
//
//
//
//
//
//数年后，一群无知的人类落入这里。
//
//
//
//
//
//瞧瞧，他们就像猫爪中的老鼠一样。
//
//
//
//
//
//弱小、无助而绝望。
//
//
//
//
//
//但他们很聪明，没有挣扎，接受了我的支配。
//
//
//
//
//
//我的子民用这五百年的时间创造了美丽的新库斯科。
//
//
//
//
//
//而我，则在崭新的身躯中复活了。
//
//
//
//
//
//你，或者说，任何一代“欧米伽”恐怕都不过是一群乌合之众的头头罢了。
//
//
//
//
//
//漫长的五百年，我过着与世隔绝的生活，外面可能已经发生了太多事。
//
//
//
//
//
//但是，我还清晰地记得，我那所谓的“父亲”是怎样残忍地杀死我的。
//
//
//
//
//
//欧米伽，我已经找到你们的弱点了。
//
//
//
//
//
//总有一天，我会回来的。
//
//
//
//
//
//祝你好运。
//
//
//
//
//
//你问，我是谁？
//
//
//
//
//
//有意思。一个凡人居然对我这么感兴趣？
//
//
//
//
//
//在下 因蒂
//Inti
// ——库斯科太阳之神。
//
//
//
//
//
//不过……你们可能还知道我的另一个名字。
//
//
//
//
//
//一个早已被我抛弃的名字。
//
//
//
//
//
//森ϻ
//
//
//
//
//
//作者信息
//« Level C-371 | Level C-372 | Level C-373 »
//
//Footnotes
//1. 即英译的“库斯科”。
//2. 包括用灰矿油处理的工具、武器和各式金属制品。如果您有需要，也可以在这里直接买到灰矿油
//3. 这是一个单向通道，当您走进了这扇门后，您会从Level 1的一堵混凝土墙中切出。
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1372{}