//Level C-377
//评分: 
//+16
//+
//–
//X
// 
//
//生存难度：
//等级 3
//
//不安全
//稳定
//中量实体
//Level C-377是后室C层群的第377层。
//
//描述
//Level C-377主要表现为一片河流及河流两岸。在白天，此层级十分安全，但在夜晚，这里将会变得相当危险，此时请尽可能的切出层级或者返回入口的前哨。
//
//sss
//小道起点的后面。
//
//小道
//小道由沥青或石板筑成，道路无法被破坏。切入此层级时会出现在小道的起点。起点后面被警戒线和木杆拦住，上面有一个写有“前方危险，请勿靠近”的字样，任何尝试靠近或破坏警戒线的行为均以失败告终。
//
//小道全长约5.4km，在到达终点时，你将会回到起点。
//
//陡坡
//道路右侧是一处无限延伸的陡坡，其斜度略大，爬上去会十分费力，陡坡上布满人工种植的花草和树木。在这里休息是个错误的选择，因为即使是白天，草丛中仍然藏有许多“多眼蠕虫”的幼体，它们会在白天活动，保护好你的眼睛。在夜晚，这里会出现许多危险的实体，此时行动无疑是十分愚蠢的。
//
//河流
//道路左侧是一条河流，河水是浑浊的，经检测，河水除含有大量泥沙杂质外没有任何异常。即使是在白天，河面依旧有很浓的白雾，因此无法确定对岸的情况；但在夜晚，会看见对岸有时隐时现的亮光，但此时请尽可能的远离河流，曾有多名流浪者声称水里有对他们充满敌意的实体。
//
//红枫叶林
//ccc
//废弃工厂的一部分。
//
//红枫叶林距离层级入口约2.2km。这里违和的栽种着许多的枫树，枫树的种类与前厅的相似，但树叶一直以来都是红色的，没有变绿的迹象。在这里会经常性地刮起大风。
//
//废弃工厂
//工厂位于临河小道上方、红枫叶林内，主要由红砖和铁板筑成，其内部十分空旷且黑暗，但相当于其他地方，这里是一个很好的避难所，设施内会随机刷新物资，如杏仁水，罐装龙肉。夜晚，这里不会自然出现实体，但在河边闲逛的实体很有可能经过这里。
//
//雾镇
//雾镇位于河流对岸，两岸相隔约12m。雾镇的建筑类型被形容为“老旧的小区”，其房屋已经破败不堪。但即使如此，仍有少量无面灵居住在这，这些无面灵多为老年无面灵，友善并且无危害。夜晚在小道上看见的亮光已被证实是从雾镇发出的。
//
//曾有多名流浪者游到对岸来到了雾镇，并声称自己在这里看见了与自己亲人十分相似的无面灵，其多数为看见者已故或很长时间未相见的长辈。出现这种现象的流浪者都有一个共同点：他们的长辈都在或曾在类似的小区生活。
//
//雾镇是此层级最安全的地方，这里只会出现无面灵并没有其他实体，但这里十分不稳定，会更容易切出。
//
//实体
//此层级内有三种独特的实体，分别为鳄齿、多眼蠕虫和一个未知实体，以下为其详细资料：
//
//echi
//由流浪者绘制的鳄齿。
//
//实体名称：鳄齿
//
//描述：鳄齿的长有与鳄鱼相似的鳞甲，和6支细长的腿且牙齿密而尖，通体深黑且带有红色光泽，皮肤光滑，背部有大量尖刺。有三张大嘴，分布于头、胸腔、尾部。头部窄而长，脸的两侧各有两只眼睛，头上的嘴向两侧延伸，看似在"微笑"。它们会用侧面对着猎物并一直跟随，随后迅速的冲向猎物将其吃掉。仅在夜晚的斜坡上出现。
//
//防范措施：鳄齿头部的嘴很大，但是控制开合的组织却异常的少，所以鳄齿的头部仅仅只用于威慑，那个部位十分脆弱，成年人可以轻松地将其上头骨掰下。但此举并不能将鳄齿杀死，它们会迅速逃跑，但这也给你提供了足够的逃跑时间。但请注意，失去上头骨的鳄齿也失去了眼睛，它们会消耗一定时间在脖子处生长嗅觉器官。
//
//duoyanruchong
//由流浪者绘制的多眼蠕虫。
//
//实体名称：多眼蠕虫
//
//描述：多眼蠕虫是一种身体为米色的巨大的蠕虫生物，长有一张似犬的嘴，皮肤会分泌出一种毒素，接触到毒素的部位会出现红肿、瘙痒等生理反应，持续1~2周不等。当毒素不小心误食或进入伤口时，最初你会止不住的呕吐、腹痛，约3小时过后你的身体会开始陆续长出许多水泡，水泡会越长越大，最大直径可达3cm，一段时间后水泡会自行破裂且钻出许多多眼蠕虫的幼虫。
//多眼蠕虫的幼虫会钻进并吃掉一切生物的眼睛，每吃下一颗眼睛，其体型会增大，并且在其背部会长出一只眼睛，当眼睛破裂时，则会有大量的幼虫泵出。幼虫会一直存在，长度大于40cm的个体仅在夜晚出现。
//
//防范措施：多眼蠕虫的速度不快，但还是应当保持距离，避免沾到毒素，更不要随意的去往斜坡上的草地。若是不幸误食毒素或使其进入伤口，请不惜一切代价弄破水泡或者把长有水泡部位浸泡在杏仁水里，以防实体大量繁衍。
//
//实体名称：？？？
//
//描述：我们并没有人真实目击到？？？，但可以确定的是此实体体型庞大，呈蛇状只出现在夜晚的河流中，并且以尝试游到对岸的人为食，攻击往往是致命的。
//
//防范措施：不要在夜晚渡河。
//
//基地、前哨与社区
//后室援助小队（B.A.G.）前哨
//常驻成员一般在20至35人之间
//位于临河小道入口
//帮助流浪者切出此层级
//阻止做出危险举动的流浪者
//流浪者聚集地
//人数在10人左右
//位于红枫叶林的废弃工厂内
//热心帮助路过的流浪者
//入口与出口
//入口
//在Level C-289中沿着一条向下的沥青小道行走一端距离可以使你来到此层级。
//在Level C-332中向一条较宽的河流走去，随后你将来到此层级。
//出口
//在斜坡上行走有小概率进入Level C-14。
//有时入口会出现两条小路，沿着远离河流的那条小路走，你会来到Level C-236。
//触碰任意一朵花卉，你将来到Level C-352。
//在雾镇中被雾笼罩后会随机去往一个多雾的层级1
//作者信息
//« Level C-376 | Level C-377 | Level C-378 »
//
//Footnotes
//1. 如Level C-71 ，Level C-430 。
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1377{}