//Level C-349
//评分: 
//+15
//+
//–
//X
//
//
//由于特殊原因，该层级已按照时间顺序分为两个版本：
//
//-版本1
// 
//
//生存难度：
//等级 4
//
// 
// 
// 
//Level C-349是后室C层群的第349层。
//
//描述
//5626316429_7f96be32d1_b.jpg
//Level C-349 内的景象
//“很美，对吧？但也暗藏着许多的危险”
//
//Level C-349为一片相似与前厅的山地森林群系，森林内部存在的树木以云杉,冷杉,茶花,高山栎,高山松,乔松为主体，这些树木都可以被砍伐利用。Level C-349的最大半径为397公里，超出这个范围都会使其回到起点。该层级内时刻永远保持在傍晚夕阳。经调查，Level C-349内部存在大量物资，如杏仁水湖，火盐矿等等。但因为存在及其危险且未知的新实体，该层级不宜居且难以生存。
//
//实体
//Level C-349中存在较多危险实体，这些实体种类不一，但它们总是群聚行动。这些实体群主要由猎犬、悲尸、雄性和雌性死亡飞蛾、窃皮者、钝人、肢团和爆酸者组成。
//除此之外，该层级内似乎还存在一只鸟形实体。因其特性，该实体被命名为“相思鸟”。
//“相思鸟”与另一个名为“杰瑞”的鸟形实体类似，它们似乎都具有控制流浪者思想的能力。但不同的是，“相思鸟”可以入侵流浪者的回忆，并呈现各种幻象来引诱流浪者进入陷阱。被引诱进陷阱的流浪者全部失踪，目前尚不知他们遭遇了什么。
//目前已证实杏仁水对于对抗“相思鸟”的思想入侵无效。
//遭遇“相思鸟”时，建议流浪者立即远离它，它需要时间来入侵思想，这个时间足够逃离“相思鸟”。
//
//基地、前哨与社区
//M.E.G. (探险者总署) “鸟类观察者”前哨站
//为流浪者提供住所、食物、杏仁水等生存物资和必需品
//可以有效对抗实体侵袭
//坎尔贝村
//目前其人数规模为26人
//他们自称是Level C-349的原住民
//他们是友善的且愿意帮助流浪者
//此处有稳定的wifi信号
//他们知道“相思鸟”的存在，有一套对抗“相思鸟”思想入侵的方法
//可以找他们学习这种方法
//入口与出口
//入口
//在 Level C-27中找到一棵云杉树切入。
//进入 Level C-6中的一片公园并在树木最茂密的地方躺下，片刻后你会到达此层级。
//出口
//找到坎尔贝村村民，他们可以带你离开这里。
//-版本2
//
//
//“说实话，我到现在都还没太想明白”
//
//“那天他明明可以和我对抗，为什么…”
//
//“也许这就是人类吧”
//
// 
//
//生存难度：
//等级 3
//
// 
// 
// 
//Level C-349是后室C层群的第349层。
//“你好呀，人类，亦或是‘流浪者’。这个页面能够出现可都是因为我， 爱沐一级
//M.E.G.
// 的先生们已经大概其把这个页面编辑好了，然后我又在上面加了一些小批注”
//
//“话说你们人类的玩意真难用，这些话还是我好不容易控制了一个流浪者写的”
//
//“I̸͚̬͕̠̤̳͇͓͑n̵̖̲̖͔͉̫͌̃̈́͠t̴̟͓̬̉̊͐̎̽͒e̵̒̑͋̒͝ͅr̸͈̞̞̬͚̒̏͌́̅̑̓ę̸̢̮̟͈͓̀̔̌̓̓͘͝͠s̷̛͇͖̬̝̓́̾̉̑͜͠ẗ̵̪̮͉͘i̴̻̞͎̖͙̞̫͋͂̒̆̄̂̑̓n̸̫̘̺͔̰̣̖͓̒̄̿̿́ḡ̵̺̱͙̀̔̊̑̏…”
//
//描述
//同上
//“反正你在前面都看过了，我也就不再复述了。总之就是，这里很美，但很危险，不过不要怕，我已经和另一群 另一群先生们
//“君自故乡来”
// 聊过了，我会尽我最大的努力把实体引出去以方便你们在这个地方生存。那老不死的肯定气死了。”
//
//“此地不宜久”——一位朋友的忠告
//
//实体
//大部分同上，但不同的是，此层级内的实体在“相思鸟”之前的一次拜访后开始变少，目前推测其为“相思鸟”所导致，它这样做的原因还在调查。
//
//实体“相思鸟”拜访站点时的录音
//录音开始
//
//急促的脚步声，同时伴随着枪械的摩擦的声音
//科斯特1：“实体“相思鸟”，请说明你的目的”
//
//“相思鸟”：“不要紧张嘛，我是来…额，那个词应该叫，撕…谈合作！对！”
//
//科斯特：“合作？”
//
//“相思鸟”：“是的，额…我看你们在这个地方生存的挺可怜的，偶尔帮帮你们也不是什么坏事”
//
//科斯特：“我们该如何相信你？”
//
//“相思鸟”：“也许，（短暂思考过后）我可以帮助你们清理怪物？”
//众人小声议论
//科斯特：“我需要跟上级通报一下再做决定，毕竟这种情况有些特殊”
//
//“相思鸟”：“好的，我可以等…但有一件事情你们需要知道…”
//
//科斯特：“什么？”
//
//“相思鸟”：“你们知道‘思乡症’吗？”
//
//科斯特：“从未听说过，是一种疾病吗？”
//
//“相思鸟”：“好吧，不知道也没关系，但是我需要把 他们
//“君自故乡来”
// 的话转达给你”
//
//科斯特：“谁？”
//
//“相思鸟”：“总之，他们警告你们，不能在这个地方…”（话没说完）
//
//？？？： æ–šÂ你£ÌÉÏÔË在ÁÆ干á ÖóÞ什么¢ñë？╟╨╬╥▐п
//
//科斯特：“什么声音？”
//录音开始变得不清晰
//“相思鸟”：“哦不，被那个糟老头子发现了，我失陪一下”
//录音内混入大量杂音
//科斯特：“所有人…提…戒，这可能…实体…陷阱！”
//混乱的枪声
//
//录音结束
//
//事后，保安队长科斯特回忆在“相思鸟”离开后他们遭遇了大量实体的攻击，但奇怪的是整个站点的人都不约而同的表示他们在实体进攻后第5分钟失去了意识，再次醒来时实体不知为何全部撤退。
//经M.E.G.调查发现Level C-349中还存在一未知且高等的实体，它是造成此次实体攻击的原因。不过有趣的是，它有可能是实体“相思鸟”口中的“糟老头子”。
//另外，关于“相思鸟”口中的“他们”，目前仍在调查。
//
//基地、前哨与社区
//同上
//“ 爱沐一级
//M.E.G.
// 和那些我的死对头，你知道的”
//
//
//
//入口与出口
//入口
//同上
//“我也说不好，但你已经进来了”
//
//出口
//同上
//“找他们或者我都行”
//
//
//
//
//
//
//stupid...
//
//
//“ Y̸͕̞͉̫̰͋o̷̻͕̐̓̑͝ư̴̳̝̥̪̔̾̅̈́͌̋̀ ̶̤̣̲̒͌t̸̙̪͎̒͊͌͛̃̓͘̕ͅh̸̡̰̱͍̃́͊͂͘i̶̛͇̘͉̬̪̩͉̇̒̉̓ń̵̢̰̤̗͍̳̗͈̆k̴̛̜͎̯̰̉͆̀̄̕͝ͅ ̷͍̭͇̬̙́̈́̾̇y̸̨̎̓ó̷̮̝̐u̴̢̝̱̰̦͈̟̬͋̌̒͝ ̵̙̯̱̣̼͉̅͛̓̌̈́͛̚ͅć̷͇͑̐̿̏̈̕̚a̷̋͑̄̑͆͜n̷̡̛̋̆̈́ ̸̟̭̲̭͈̰́͌̄̎s̵̛͈̭͇͉͙͈̾̅̍̐̇͝t̸̨̖͍̺̰̠̏a̷̗͎̝͚̗͎̝͆̾̋͝ņ̴̈́ḓ̴̦̥͉̻͖̌͂̾̎̿͑̓̏ ̷̗̗͕̣͖̑͌̃̔̄ų̶͔̩̙̦͇̟̝̊p̴̮͈̗͂̈́̏̓̑͝ ̶̹̂͂̍t̷͓̪̼͉͍̒͊̓͊̇̎̕͜͜͠o̶̯͕̬̮̰̒̎̎̋͘ ̴̨̙̞̦̜̫͖̣̌̾m̴̫̳̙͍̙̜̻̅͆͊̚ͅę̴̳̼̙̣͌̾͂͠ͅͅ ̵̼͉̠͖͓̪͓͇̎͑͝w̴͕͉̜͇͗̓̿̃̃ͅi̶̦̰̟̮̠̒̐t̸̛̩̀͘h̴̜̦͙̳̖͈̖͕͑̎ ̵͇̣͙̀̐̓h̴̻́́̈́̀i̷̧̾̿s̷̢̼̩̰͖̠̔̃́͒́ ̷͓̳̯̹̩̀̄h̷̰͔̩̣͍͉̓̊̈́͐̆̀͘͝ę̴̤̮͇̼̹̫̏͐̾̈̑͊͂̕ļ̵̳͍͓͔̒̔͠p̶̫̝͙̀́̊́́̓̓̒?̶̫̃͊͋́̏̕
//难道你们觉得有了他的帮助就可以对抗我？
// 
//
//
//Y̴̛̜͉̲̖͐̅̇ò̴̳͋̑̒͌͠ṵ̷̠̂̔̆̆̈́͐̒̍ ̶̧̍͊̆̌̚D̶͖͔̻̤̦̋̆̀͑̎͗̃ỏ̷̡̗͚̫̹̰̐͌ṅ̸̛̦̙̠̎̇̾'̷̼͗͂̊̒t̴̼͓̱̬͉͗̕ ̵̰͎͚͓̑̌̄͆̾d̵͙̮̯̟̺̾̎̀̂e̸̹̜̤̬̊̂̊s̶̯̞̥̬̻̒͜͝ȩ̴̬̺͚͎͓͍̋̅̂͐̆͐̈́ͅr̶̡̬̟͔̘̹͇͖̀̇͋͘v̸̘̱̭̻̣͋́͗̇̓͜͝e̴̝͓̲͙͛̓̒͒͂͠ ̷̜̬̱͍̺̇̓̌̈́̀̇̓̿͜ͅǐ̷̗̩̝͎̫̫͍̱̒́̊͑͑̓t̶̜͔̝̝͈͉͚̪̎̌͂̊͐.̸͉̰̗̱̘̝̟͗̄̈ ̷̨̬̰̗̥̑̈́̈́͗̉͝͝ͅA̶̞͌͊͂͘n̸̢̙̼̾͜d̷͓͉̈́͆̌́̉̄̈́͒͜ ̵̭̲̳̀̔̐̔̔͋͛t̴̛̹̳͚̼͍̝͍̼͛͂͂̔͝͝h̸̯̯̖͋͋a̵̢͔̪̞͉̲̻̮̓͆̿ţ̵̮͍͎̜̭̓̇̇̋͐͜͝͝ ̶͎̠̻̠͛̅̓̑̚t̴͚̘̖̱̲̦̎̂̍́̑͘͝͠r̴͎̺͚̉̿̐̄̚͝͝a̸̡̩̪̬̗̮͛̓͒͘͜͠ͅi̸̢̱̮̼͎͛̊̆̓t̵͇̼̻͇͈͕͌ơ̸̬̤̗̫͉̩̒̅̂̀̆͌r̷̛̺̋̐͛̏̓
//你们根本不配，还有那个叛徒
// 
//
//
//H̴̠̄̓͂e̶̦̣̤̱̮͒'̵̛̹̫͇̐͒͛͒͘s̷̝̗̼̩̣̝̈̔͒̋̀͠ ̷̘͈̰̥͒̅j̸͚͕̳͆̃u̵̬̬̤̱̗̓̕s̶̪̑̂̈́͆͝t̵̤̻̄ ̵̛͉̮̄̑̈́͂̓̂̌m̸̡̡̺̙̙͑̐̇ẏ̵̢̤͚̫͇̗͖̤ ̷̺̻̘͉̤̳͍̂̂t̵̨̩̦͔̰̝̃͗o̷̡̙̻͉̺͚͐̑̚ͅơ̶̳͙̖̠̈́̅͝l̵͔͈̀̄̕.̴̧̦̩̯͕̘̞̊͂̊͘͠ͅ ̵̟̓̀̐̋̈͌̕͝T̴̲̞͉͊h̴̩͔͓̩̆͜e̸͔̞̝͛̀̌͝ ̸̫͔̀̈́̄̌̽͆̕W̸̤͈̰̠͇͔̪̋͛̃̀ő̶̩̭͇̄̆̈͠ṟ̶̭̦͙͍̽̅͑́̾͝͠l̵̨̤̙̫̄̀ḍ̷̖̖̆̍̃͝ ̵̨̟̼̹͇̐͂̈̔͂ͅì̶̠̼̙̉͝s̶͚̥͕̥̼̼͒̅̃͝ ̴̢͇̖̰̤͍́̔̓͒̿̾̎ͅm̵̧̢͔̬̜͂̍̀͗͘͠i̸̢̨̢̩̅ͅń̷̳̘̙̠͔̎͒̓̓ė̸̪̫̎̉͠ ̸̭͕̲̘̟͇̳͈́̏̈̋͌̿ạ̴̢̣̣͍̠̹̼̓̅͛͊̎͛͂͝f̷̭͙̱͌̑̃̆̔t̵̢̡̻̤̮͓̀́̄̈́͛͋͝ͅe̴̡͙̗͇̗̒ȑ̵̨̢̛͖̹̖͖̲̽̌ ̸̬̭̃̑̿ä̷̧̙͈͕͋̾̀̚͠l̵̢̗͎̫̤̻̙̞̇͋͂̈̅l̶̡̳̞̳̜̫̓͛̈́!̶̧̝̹͍̮̺͍̅̅̿̾
//他只是我的工具，这个世界终究是我的！
// 
//
//
//“去你的吧，糟老头子”
//
//
//笑死我了，你居然还在用乱码吓唬人？还在C层群说英语？
//
//
//.̴͙̝͐̀̀́͆̉͆͛.̶̫̝̣̞̈̏̎͘.̴̧̗͑͛͆̚͝͝.̵̢̥͔̯͇̼̅͆̆͐͆̈͝.̴̧͉̞̻̱͇̅.̸̣͇̙̰̇͠
//
//
//“你以为我还不知道吗？”
//
//
//“听好了，我会帮助他们，直到战胜你”
//
//
//N̷̹̦̥̦̖̤̆̔̄͆́̑̊̚ȁ̸̗͆̓i̷̢̪̻̺̞̣̮̊͗̕v̶̤̇̾̓̔͊̋́̕e̷̮̟͓͎͂̎̽͆̐̒̏̚,̴̢͉̟͍̯̇͘ ̶̨̬̘̩̦̬̜̍͑̈́̏͜e̸̮̬̋͋̀̋̒̉̆͑v̸̢̡̺͚̠̦̊̓̇̂e̷̳̟͖͉̜̜̠͕͂̀́n̷̝͙͙̹̈́̓̀͊̒̄̕ ̷̨̙̜̇̈́̑į̷͎͎͒f̵̛̹͇̦̝͎͋̊̀͂̇̉͠ ̷̥̥͙͍͉̲̑̅͋̑͗̈́̊̒ͅý̸̨͍̣͓͗͘ő̴̝͚̪͍̘̙̂̚ư̷̧͖̖͎̤̍̀̅͂̀̚͝ ̵̹̹̦̞̬̖̗̎͆̈́̓̓̈́ͅk̶̡̰̰̥̄̍̄͘n̸̠̘͇̐̐̊͜͝ŏ̶̗̲̜̯̼͙͗́͂͗̚͝ẁ̷̼̩̻͉͍͕͈̖̆̃ ̴̙̫̠̫̥̈́̔̑̌͂̒͜ẉ̷̻͖̜̐̀̌̾h̸̦͎̯͙͍̺̆͛̂́a̷̲̥̿͐͗͂͊̿͛͋t̴̼̤̦̫͉̹̏̓̍̔̓͝ ̶͕͖͎͙͇͍͔̪͌͌̿̃͑̓͠t̶̼̗̞̲̟̘̩̉ḩ̷̰̟̭̙̻̀̾̅͋͌̽͝ẻ̵̜͖͖͕̜̺̜̠͐ ̷͈͎̗̾́̓͐̈̌͝u̷̬̥̳̫̪̟̽ͅs̶̳̓̓͊̈́̀͠ȇ̸̠͓̮̒̚̚,̷̛̟̰͓͎̬͋̓ ̴͔̐̾͜I̶̡͎̎̋͌ ̴̛̛̮͋͐͂͐̉̌a̶̬͎̱̭͍̲̾͆̓̆̈͝ḿ̴̲͉̬̍͂͝ ̶̜͐G̷̟̯̼̩̳͊̃̀̈́o̵͍̮̘̣̜͚͋̄́̇̐d̵͓͑̍̾̈́̔͘
//天真，即使你知道又有什么用，我是神
// 
//
//
//“笑死我了，祝愿上帝保佑你的屁股眼”
//
//
//H̴̳͒̅̄̓o̷̲̝̰̔w̴̧͖̗̩̳̒ ̴̗̞̔̈́͒d̵̻͈͐̾̄̑́̕ͅá̴̻͚͈͙̘͚̇̌̄̉̋r̷̡͖̪̤̃͑̃͛͝e̸̜̅ ̴͚̣̲͈̠͓͖̻̉̑̆ẙ̸̢͍̜͋ǒ̶̢̘̫̞̺̟̦̽́͑ú̷͙̪̝͇̣̍ ̶̨̙͓͕̮̤̐̒̑̓̕͝s̴̡̫͒͗̀͜p̷̢̹̠̀͛͜e̵̟̐̀͝͠͝ḁ̶̜̟͈̯̂̃̆̄̍k̴͍͖̪͖̱͂̈̈́͊͌ͅ ̷̬͉̹̥̌͋̓͐̇̈́̓t̷̙̤̣̞̿͜o̸͕̭̘͂̓̍ ̶̞̯̲͔̯̖͂̿̿̊̾̅̚͝G̴̦̗̪̺̭̊̽̌̔̓ͅo̴̱̥̗̲̦̪̘͒͌͑̾d̷̡̡̖̣͎̪̥̲̾̎̑̈̋̔̈͐ ̷̩̲̰͋̇͋̊͒̕ͅL̶͙̱̐̅̉i̴̟̬̲̍͆k̴̛̩̥̲͙͠e̶̤͈̥͂ ̷̤̦̞̫̃͗̋̆̿̕T̴̺̯̫̳̄̚h̷̡͈̜͖̹̣̐̓̉̎̕a̷̻͔̙̍̍̋̎͜t̵͉̣͓̯͌̒̉͗͂!̷̡̡͇̲͙͈̩̻͊
//你怎么敢这么对神说话！
// 
//
//
//“你就是个神经病”
//
//
//“我一定会帮他报仇的，你等着吧，老不死的”
//
//作者信息
//« Level C-348 | Level C-349 | Level C-350 »
//
//Footnotes
//1. 该层级站点安保队长
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1349{}