//Level C-329
//评分: 
//+11
//+
//–
//X
//
// 
//
//生存难度：
//等级 变化
//
//局部安全
//区域视觉影响
//实体数量变动
//Level C-329是后室C层群的第329层，此层级处于永夜状态，无昼夜更替现象。层级大体上表现为一个无边际的室外停车场。目前该层级大部分区域已由B.A.G.接管。
//
//描述
//Level C-329有两个主要区域，一个区域为能进入此停车区的公路。另一个则为停车区。
//
//在此层级最常见的现象则是视觉变化对流浪者的影响，对于视觉变化，通常是指在特定的区域内对流浪者及其物品所产生的一种视觉效果，此效果对事物及其性质等并无影响。但流浪者及其物品受到此效果的影响后其视角内的事物皆呈扭曲，锯齿化，波浪等效果展现出来，以及有概率使流浪者出现幻象。效果的强弱则主要由流浪者所处的环境因素影响。
//
//lights-2773056_960_720.jpg
//一张公路的照片，由B.A.G.拍摄
//
//公路
//公路的外观为一条长度未知，宽度五米的道路，道路材质一般为沥青或水泥，在此区域中，将会有中等程度的视觉变化作用于流浪者。
//
//由于视觉变化对流浪者的持续影响，人们会错认为在该区域实体活动并不活跃。但事实上，包括萤火路灯，车兽，突刺者，暗影等系列实体，往往潜伏在难以被流浪者发觉的角落展开袭击。
//
//在此区域中，路灯通常显得可有可无。然而值得一提的是，其排列方式一般是凌乱的，且大小，款式，照亮程度均不一。但不规则的摆放正是萤火路灯想要的结果，它似乎基于伪装的意图，将路灯摆放的较为杂乱。所以当流浪者经过时，应当尽量远离任何路灯。
//
//公路中，车辆来往为普遍现象，但此区域并没有正常的车辆。所以多数流浪者在访谈时所描述的“大量车辆行驶于此”有两种可能：
//
//流浪者因为视觉变化的影响，从而间接导致幻象的产生
//那些车辆实质上是车兽
//因此对于这类智慧生物，一个显著特征在于，这些实体展现出了和其他层级不同的活跃性。大致表现为向四周无规律的行进，以及车速不稳定这些特征。
//
//流浪者如果需要进入停车区，只需要找到一面平交道栅栏。一般它是关闭的，只有极少数的平交道栅栏会处于开启状态。
//
//大部分的栅栏在关闭时，流浪者可以使用暴力的方法来进入，也可以通过清除栅栏周围的突刺者来让栅栏开启。若流浪者强行进入，除非有极快的速度，否则将会在触碰到的一瞬间产生高压电，直至你死亡。
//
//photo-1604275291560-55f54cec0e4d.png
//一张停车区的图片，拍摄者未知。
//
//black-2569352_960_720.jpg
//无人机拍摄的俯视图，由B.A.G.拍摄。
//
//停车区
//停车区大致可分为两个部分，我们将其命名为川域和雾域。
//
//川域
//川域的整体外观除了在部分标志线内有未知红色物质铺洒于地面，其他与正常的室外停车场别无二致。
//
//根据某位流浪者的陈述，当他踩在这类红色物质上时，感到了焦虑，恐慌，甚至害怕的心理，视野也越发模糊，且似乎看到了大量实体向他靠拢。但当他远离那片区域时，实体随即消失，身体状况也逐渐恢复。原因未明。
//
//在此区域内，将会有微弱或中等的视觉变化间断作用于流浪者。
//
//至于休整的地方，流浪者只需找到一盏白色现代路灯，并处于路灯的光源下，这样遭到实体的攻击的概率会大幅降低，并且会逐渐消除身上的疲劳感。
//
//据观察，这些路灯一般均处于常亮状态。但偶尔路灯会以由暗到亮的方式出现明暗变化，此时，出现实体的概率会与灯光的亮度成反比。值得一提的是，当即将发生此事件时，流浪者周围会出现未知来源的嗡嗡声。
//
//若发现路灯频繁闪烁，则说明视觉变化将可能作用于流浪者。
//
//这里有着不适宜人类居住以及长期探索的危险实体，除去经常出现在各种层级的死亡飞蛾，窃皮者，还会出现非常危险的抛锚客，突刺者。唯一值得庆幸的是，这里是警告风筝的栖息地之一。
//
//让大量流浪者慕名而来的则是这里的物资，其不仅丰富且种类不一，含量与Level 3相当。目前已被证实存在的物品有杏仁水，油腻棉花糖，皇家口粮，层级密钥，瓶中闪电，后室TCG卡牌，倒转怀表，幸运豆奶。
//
//雾域
//雾域的整体外观与川域十分类似，也为一个正常的露天停车场。且无实体，无物资，无视觉变化效果。可以作为流浪者短暂休整的地方。
//
//进入此区域后，所有的摄像设备都会失效，因此实际的场景只能靠流浪者的描述来得知。
//
//虽然此区域并无视觉变化作用于流浪者，但在大部分区域，都会弥漫着一种霾类物质，其中夹杂着部分星云，浓烈时将会影响流浪者的可视度。
//
//须得警惕的是，尽管在该区域的流浪者在生理层面上体现出了一种“恒常性”1，即新陈代谢保持一种稳固恒定的状态，不再需要同外界进行物质交换，细胞也同步地停止生长同衰老的变化。
//
//然而，一旦流浪者离开该区域，原定被遏制的生理变化会毫无保留地爆发于流浪者的躯体上，系列的饥饿、困倦、酸痛会骤然间席卷而来，在该区域停留的时间愈久，则该恶质变化爆发得愈发猛烈。
//
//因此，流浪者若需长期驻留于此，请做好以上心理准备，或者永远生活在这里，加入他们。
//
//天空直梯
//流浪者若需去往其他部分2，则要找到天空直梯。其外观为一间标准的现代电梯，且无法发现源头所在。
//
//直梯的位置一般处于一片空旷，且无路灯之地。在流浪者靠近它之时，位于其上方的感应灯便会开启，以便于流浪者发现。
//
//搭乘天空直梯去往下一部分时，此过程通常需要十分钟左右的时间。但多数流浪者在电梯中会表现出时间感知错乱的特征，这会导致原本十分钟的路程，流浪者却经历了十五分钟甚至更长。因此，为避免此现象对流浪者的负面影响，我们推荐流浪者在搭乘前准备计时类物品。
//
//基地、前哨与社区
//B.A.G.(后室援助小队)-“岚”基地
//这是B.A.G.在川域建立的营地，其内部存放有大量的勘探设备。
//有大约40位成员活跃并驻扎于此，他们掌握着减弱此层级视觉变化效果的奇术。
//接受雇佣，且在能力范围内他们完成任务的概率为95%。
//为所有有困难的迷途者提供援助。
//M.E.G.-“眼界”基地
//于2017年开工建造营地，2018年完工。
//大约有150名成员活跃并驻扎于此，流浪者在这些营地中可以进行短暂休整。
//开放贸易，商品源大多数来源于Level 3与此层级。
//拥有中等的武装力量，可以对付此层级中的常见实体。
//涅槃者
//定居于雾域，且在霾类物质区域生活。
//由五个人组成的社区，岁数均大于100岁。
//对拒绝他们请求的流浪者具有敌意。
//接受所有流浪者的入团请求，但几乎没有人这样做。
//入口与出口
//入口
//在Level 35中进入第六层时有大概率会来到此层级。
//在Level C-28的露天停车场中被实体恐吓后可能会来到此层级。
//短时间内使用诺克立普贴频繁切出/切入的过程中有大概率进入此层。
//出口
//在公路行走一段时间后，即可到达速切中点。
//在川域中发现漂浮的物品，切入即可到达Level 45
//在雾域的霾类物质区域发现树林，向此方向行进一段时间后会来到Level C-71。
//« Level C-328 | Level C-329 | Level C-340 »
//
//脚注
//1. 原用于表示知觉上对于某一物品的认识保持旧有趋势的心理学词汇
//2. 去往川域或者去雾域
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1329{}