//Level C-300
//评分: 
//+15
//+
//–
//X
// 
//
//生存难度：
// 
// 
// 
//37a4e0a0fe22e54c293f593b21c9.jpeg
//你还记得这里吗？
//
//Level C-300是C层群的第300层。Level C-300是一个仅仅存在于思想上的层级，其外观因人而异。
//
//描述：
//Level C-300是一个存在于人类1的思想上的层级，且只会在梦境中进入该层级。进入过Level C-300流浪者对于此层级的描述各不相同，甚至可以说是大相径庭，但无一例外，他们声称身处此处会令人感到平静和舒缓，亦或是一种似曾相识的感受，且绝大部分受访者在描述时称“这个层级带给我一种怀旧感”或是“它令我想起了自己童年那些模糊不清的回忆”。由于流浪者自身情绪的波动，他们“眼中”的环境总是会遭到不同程度的扭曲，扭曲程度与情绪的波动强度成正比。
//
//虽然存在于梦境中，但Level C-300是一种明显有别于梦境的存在，表现为流浪者的自主思考能力、对身体的操控力和对周遭环境的感知力，除此之外，当流浪者离开Level C-300，也就是从梦境中苏醒后，仍能在足够长的时间里保持对梦境的记忆，这足以让人记下在此层级中的感受。
//
//“卧室”
//如同前文所说，Level C-300的外观因人而异，但在几乎所有流浪者的叙述中，他们在进入层级后，都在第一时间发现自己身处一间卧室的床褥上，并同刚刚睡醒一般困倦，因此，卧室通常被视为Level C-300的起始点。
//
//在报告中，卧室的空间相当狭小，最小者仅能容下一张床，最大者也不过约25平方米。流浪者在卧室中通常会感受到一种独特的温暖与舒适，也有人称，他们“躺在床上、紧紧地拥抱着棉被时，明明处于一个陌生的环境中，却产生了强烈的安全感”。这些感受被认为是自发产生的情感，而非层级强行赐予的。由于强烈情绪的产生，卧室的场景通常存在着中等程度的扭曲。
//
//直接走出卧室的前门，将被送至“回忆”区域。
//
//“信物”
//在卧室最显眼的位置，流浪者将会发现一件其幼年时期曾持有并已经丢失的事物，即“信物”。所有案例中，流浪者们皆称这是他们“儿时最珍贵的东西”，且无一例外在某种强烈情绪的驱动下选择携带它们离开卧室。据称，在持有信物时，流浪者的负面情绪会逐渐消散，直至恢复至常态。
//
//playground-411362__340.jpg
//你曾经来过这里。
//
//“回忆”
//“回忆”表现为进入者儿时记忆最为深刻地方，如前厅中的学校、公园或游乐场。目前并没有观察到回忆的边界的案例，故一般认为此区域是无限大的。在此，流浪者会产生怀旧感，但这种情绪并不足以导致画面的扭曲，因此，回忆中的场景对于流浪者来说显得更为清晰。据称，即使无法观察到任何其他人类的存在，流浪者仍能听到数人以自己的母语交谈的声音，内容多数为寒暄或谈论日常生活。
//
//
//
//入口和出口
//入口
//流浪者称，在他们进入Level C-300，也就是入睡前的一段时间都曾因各种原因而感到悲痛、抑郁、歇斯底里，乃至绝望。我们目前认为，流浪者的强烈负面情绪是进入Level C-300的主要因素。
//出口
//从梦中自然醒来，你将发现自己仍在入睡前的所在之处，此时，你的思维已经脱离了Level C-300那具想象中的身躯，这被视为离开了Level C-300。在这之后，流浪者入睡之前的负面情绪会逐渐地淡却，直到其精神状态恢复正常，无从得知这些是否来源于层级的精神影响。与此同时，流浪者将在身旁发现自己的“信物”和一张纸条，纸条上以进入者的母语写着：
//别忘了你儿时最珍贵的东西——XXXXX2，和你心中的那份希望。
//
//如果你被外在因素影响而从梦中惊醒，则将被送至Level C-1。
//作者信息
//« Level C-299 | Level C-300 | Level C-301 »
//
//Footnotes
//1. 理论上来说，部分拥有大脑的中高智能生物也具备进入Level C-300的能力，但这一猜测显然难以得到证实。
//2. 此处通常为流浪者儿时对“信物”的称呼。
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1300{}