//Level C-387
//评分: 
//+9
//+
//–
//X
// 
//
//生存难度：
//等级 4
//
// 
//环境危险
//未知实体数量
//Level C-387是后室C层群的第387层。
//
//描述
//empty-city-transit.jpg?width=746&format=pjpg&exif=1&iptc=1
//Level C-387中公车的内部。
//
//Level C-387的中心区域为一个大型客运中转站。有大量公车在此停靠，它们的外观老旧，都是无人驾驶的。此层级可以多人进入，不过公车中只能容纳一人。这个层级被一股夜晚清新空气的味道所笼罩，令流浪者着迷。
//中转站后方可以发现一个便利店，那里很安全，可以随意进入。这里储备有大量未知品牌的前厅食品,也有后室中特有的食品：如罐装龙肉,皇家口粮，可以安全食用。冰柜中还有杏仁水和各种口味的幸运豆奶供应。这些物品隔些时间会自动补充，是补给的好地方。此层级没有昼夜交替，便利店的时钟停留在23:30分,该层级的中转站与便利店区域有较强的Wi-Fi链接。经测量，此层级的温度稳定在17°C左右。
//
//在中转站的外部有条公路，目测至少有12000千米长，周围被群山环绕，光线较暗。我们不建议流浪者一人在公路上寻找出口，因为它很危险，目前有流浪者报告说在公路上发现了大量敌对实体。但如果你乘坐公车离开此层级的话，这些实体便会消失，原因未知。所以此层级的实体数量没有具体的统计。
//
//事件
//如同一些其他层级，Level C-387中也会出现一些随机事件。
//
//事件1—江河大桥
//如果流浪者想离开此层级，就必须触发事件1，3中的一个。当公车在“山顶岔路”区域往右侧行驶一段时间后，有80%左右的概率会出现一座大桥。注意，在公车即将驶入大桥时，一定要把车上配备的窗帘全部拉上，闭眼直至驶出大桥。等周围安静下来后，便可睁眼。
//
//否则，你会成为我们的一员。
//
//事件2—木屋
//进入此层级时会极小概率触发此事件。事件表现为当流浪者来到此层级时，会发觉此层中只有自己一人，便利店的位置变为一栋木屋，有独特的吸引力，令流浪者想进入。木屋中 什么也没有 ，但流浪者会听见一个低语声，大致内容就是在鼓励乘坐无标签的公车。低语结束，木屋会转变为原来的便利店，流浪者也可以在此层级中发现其他人。低语声会侵入人的理智，使人特别想乘坐无标签的公车。一定要努力克制自己，不要这么做。你也可以去到M.E.G.的据点，那里有人员会帮助你。
//
//附录1—Sarah的回忆
//关闭文档
//我只不过是后室中一位再普通不过的流浪者，但我还是选择写下我的亲身经历，以帮助到进入到这里的其他流浪者。
//我在Level C-28中乘坐了一辆破旧的公车，便来到了这里。我下了车，发现这里跟别人所述的根本不一样。周围空无一人，那栋诡异的木屋出现在我的眼前。不知什么原因，我竟进入了那里…
//我还能回想起一切，甚至永远都不会忘却。木屋内是一个扭曲的空间，外观类似工厂里的一条狭窄走廊，周围墙体五颜六色，有着密集复杂的花纹装饰，还有严重的机械噪音和一些紧锁着的门。可我并不知道走廊具体延伸的距离。
//
//我准备再往深处探索，可这时，一个低语声响起。
//我还能记起他说的话：
//
//孩子，这里不是你该来的地方。
//
//听我的话，去乘坐那辆车吧，我可以指引你，来吧。
//
//那里有你的家，有你的一切，有你真正追求的东西，我不会欺骗你的。
//
//是时候该启程了呢……
//
//一个男性声音，听起来很友善，说了一些奇奇怪怪的话。
//我很疑惑，便想继续深入。突然，一股强大的无形力量，把我震飞了出去，我貌似失去了意识。等我醒来，木屋消失了，变为了其他建筑。
//
//而那时，我的眼中，只有那辆无标签的公车。
//我的双腿不受控制，直直向那辆车走去。我已意识到了不对劲，可身体仍然不受控制。
//还好，其他流浪者发现了我，疯狂将我拦下，我又再次陷入昏迷。
//
//不知多久后，我在M.E.G.的据点中醒来。我向他们讲述了这一切。最后在M.E.G.人员和我的商讨下，写下了这篇文档。但我不知道，乘坐那辆公车后，到底具体会发生什么。
//
//不过，还是一定要避免乘坐那辆公车吧，我这么想。
//
//Sarah
//写于2022.01.12
//此文档收录于M.E.G. C387号据点中。
//
//事件3—无尽隧道
//当公车往“山顶岔路”方向往右侧行驶后，有大约20%的概率出现一个叫做“江河山隧道”的穿山隧道。该隧道的延伸长度是随机的。一旦流浪者乘坐的公车进入这里，可能几分钟就会驶出这里，也有可能永远待在这里，目前没有办法解决这个问题。
//
//基地 前哨与社区
//The M.E.G. C387号据点
//位于便利店后的树林中。
//有21名人员常驻于此。
//为想要离开这里的流浪者提供指导与应对措施。
//为经历过事件2的人提供安抚与治疗。
//试图拯救“他们”这个团体。
//他们
//团体无名，用“他们”代替。
//大约有5-10人，驻扎于“山顶岔路”附近。
//团体成员全部失去理智，并都去过山顶。不论怎样，他们都逃了出来。
//物资储备严重不足，M.E.G.正在尝试拯救他们。
//对M.E.G和任何流浪者存在严重敌意。
//但在此团体中，一位名叫Charlie的男流浪者，仍然存在一些理智，被M.E.G.的人员带回了据点。M.E.G.的专员对他进行了采访，但他突然陷入昏迷，暂时无法醒来，目前正留在据点进行治疗。
//
//黎明队
//由7名流浪者自行组成。
//驻扎于中转站区域附近。
//对流浪者很友善，并为他们提供指导。
//开放贸易，出售一些其他层级中出现的物资。
//神秘区域—山顶
// 
//
//生存难度：
// 
//极度危险
//可能存在未知实体
//该区域被划分为Level C-387中的一个独立区域，被流浪者称为Level C-387.1。
//我们对这个空间的了解目前十分有限，该层级大部分的信息都来源于流浪者Charlie。
//
//这个区域距离中转站有200千米左右的距离，似乎在很高的地方。有50多位流浪者都去过山顶，其中40多位下落不明，其他幸运逃出来的人却都成了疯子，所以我们极度不建议进入此区域。
//
//入口
//目前只发现一个入口，即乘坐无标签的公车，行驶一段时间后会出现一条岔路，公车会往左边行驶。接下来 数据缺失。
//
//出口
//数据缺失。
//
//附录2—对Charlie的采访
//关闭文档
//正在恢复文件….
//
//解码文档中…
//
//恢复完成！
//
//M.E.G.专员： 好的，放松。告诉我你的名字，以及你去了哪。
//Charlie： 好的..嗯…我叫Charlie，应该是这样的。我..我去了哪里？？那地方堪称地狱..我好害怕..啊啊啊！！
//M.E.G专员： 请冷静，先生！慢慢来，先告诉我，你是怎么进入那的。
//[一段情绪安抚]
//Charlie： 哦..好，这个我还能回想起来。都怪我不注意，偏偏乘坐了那辆车…
//一开始一切都很正常，那时我想很快就能离开这层了..可是到了那个路口..我感到不对劲…公车正..正失控地，快速朝一条破旧的山路上驶去！！车内想起警报..和低语…..有，有一个人！！他一直在我耳边说话，他说了什么？？我想不起来啊啊啊！（吼叫）
//M.E.G.专员：很好，你不用担心..！你已经安全了，我们会让你休息的.，继续讲下去吧！这对任何人都很重要…..
//Charlie：哦..对，没错，我没事了..我安全了，谢谢你们救了我。
//我..当时..疯狂地，使出全力踹着车门，可它就像被焊住了一样..车窗也是，哪里都是！！！一种紫色的刺鼻气体开始出现。然后…我就昏迷了……醒来后，我就，我就来到了那里！！啊啊！！！
//M.E.G.专员：我们知道你很累了，那么，再问最后一个问题，你醒来后，在哪里？
//Charlie：我..我想起来了一点… 那里，被迷雾笼罩，貌似是在高处。我却感觉，那里只是一片虚无..那里什么也没有！！我只看到了，数不尽的被虐杀的人类尸体！我..当时不断在脑海中回想自己的亲人、孩子..也不知为什么，我开始往里深入…尸体堆积的越来越多，浓郁的腐臭气味充斥着这里…
//[沉默]
//啊！！我知道了！！！有人..它在这里，操控着这里！！！！！
//M.E.G.专员:是谁？！请告诉我！
//Charlie: 我不知道啊啊啊！！它不是人类，什么也不是！！我..趁他不注意跑了出来，从高处跳了下来…他的外貌，啊啊啊啊啊啊啊啊！滚开，不要！！！！！[昏倒过去]
//M.E.G.专员： Charlie先生！你还好吗..快来人啊！……
//记录截止 2022.04.17
//
//入口与出口
//入口
//在Level C-28的部分公交站中，有小概率会驶来一辆标签为387的公车。搭乘此公车，大约3小时左右，车窗外的风景会不断变化，最终流浪者会来到Level C-387的中转站。
//
//在Level 11进入一个客运站建筑会将流浪者传送到Level C-387。
//
//在Level C-450中从高楼跳下有极小概率会来到Level C-387，我们不建议这么做。
//
//出口
//乘坐标签为06的公车，最后公车会在Level C-6的城区停下。
//
//乘坐标签为183的公车，车内温度会逐渐降低，流浪者也会昏迷。醒来，就会发现自己身处Level C-183的缆车位中。
//
//乘坐标签为46的公车，窗户外的景色会慢慢变为Level C-46的，最终流浪者就会来到Level C-46。
//
//乘坐标签为230的公车，行驶几个小时后流浪者会昏迷，最终会在Level 230的交易区醒来。
//
//如果你乘坐的公车发生了意外（如撞山等），流浪者会在Level 399醒来。
//
//来山顶吧，我们在这里等你。
//无标签的公车通往山顶。
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1387{}