//Level C-360
//评分: 
//+33
//+
//–
//X
// 
//
//生存难度：
//安全
//宜居聚集地
//无危险实体vacancy8
//Level C-360入口
//
//Level C-360是后室C层群的第360层。
//
//描述
//Level C-360是一处无穷尽的平直空间，可以触碰到的东面、南面和地面完全平直，不存在任何弯曲。这一层级的每个方向均为灰白相间的格子图案，无法在墙壁和地面上进行标记或留下痕迹。
//
//目前仅发现在东南方向存在一个由东面和南面汇聚成的角落，若沿着其他方向前进则没有一个明确的边界和尽头。在这一层级的任何位置所看见的环境都完全一致，未发现任何可识别的建筑物。
//
//无论朝着任何方向前进，在主观视角中周围背景的灰白格子图案会跟随着自己一起移动，接近或者远离墙壁并不存在透视差异；这种情况不会影响到其它流浪者的视角。
//
//在Level C-360内没有任何可见光源和投影，放置物品不会在墙壁和地面上产生阴影和反射，但流浪者和物品自身的投影情况依然存在。根据当地居住者的描述，光源和阴影会在离开物品的边缘处被“整齐地切开”，没有任何办法对其造成影响。
//
//这一层级似乎没有明显的昼夜更替，但所有进入其中的流浪者都具有一致的生物钟，会在几乎同一时间一起产生困意、饥饿，也会几乎同一时间醒来；但被带入Level C-360的动物并不会受到影响，并且每一只动物的生物钟都不尽相同，以至于总会导致睡眠过长或缺乏睡眠。
//
//vacancy1
//Level C-360东南角
//
//这一层级内没有任何空气，也不会表现出任何气象模式，但身处其中的流浪者并不需要进行呼吸也可以存活和正常活动。被放置在这一层级内的建筑物不会发生风化和自然损毁；食物不会腐烂变质，但会随着存放时间而逐渐失去它的味道；植物和动物会一直维持在进入这一层级时的状态，流浪者的身体状态也会受此影响，毛发不会生长且几乎不会罹患传染病，但到达特定年龄段后依然会出现大多数的老年病症状。
//
//进入Level C-360的流浪者通常表现出不一致但有规律的变化，这种变化不会造成可观察到的生理和心理影响，仅仅只是在视觉上表现出异样。目前发现的变化包括但不限于：
//
//暴露在衣物外的皮肤皱纹、伤疤、色素沉着和痣全部消失，但在衣领、衣袖和裤脚处会有很小程度的变色（通常是50%中性灰）。
//vacancy3
//从Level C-360离开后的流浪者
//
//整体体积变小，但体重不变。
//绿色衣物和物品会变得透明。
//看向远处的流浪者时，他们的身体边缘会呈现出与轮廓一致的颜色，通常仅有青、品红、黄、黑或白色；在靠近后轮廓会消失。
//在每个流浪者的主观视角中，身体和其他物品在视觉上重合时可以通过流浪者的身体看到其背后的物品，肤色与物品固有色发生复合，导致总体上颜色偏暗。
//在每个流浪者的主观视角中，身体与其它流浪者的身体在视觉上重合会导致交集部分完全消失，边缘总是光滑的。
//这些影响会在离开Level C-360后逐渐消失，但仍然会在衣物边缘处出现不规则的灰白格子图形，图形会随着身体的移动而改变，以及身上穿着的暖色衣物会亮度增强，此效果可以等待24小时后消失或使用杏仁水擦除。在Level C-360内使用杏仁水也可短暂消除影响，但通常在3分钟后重新显现。
//
//vacancy2
//正六面体
//
//不时会有其它层级的实体进入，当前发现曾进入过Level C-360的实体包括但不仅限于： 笑魇、肢团、猎犬 、窃皮者、悲尸、无意识的无面灵以及死亡鼠。这些实体大多数都是以无目的性地游荡或静止不动的状态进入这一层级，也发现过极少数个例是以追逐某物的姿态出现，并且会在察觉流浪者存在并对其表现出敌意的瞬间垂直穿透地面，随后完全消失不见。当前无法确认这些实体的去向，这一现象可能部分解释了这一层级内没有其他层级实体的缘故。
//
//正多面体：
//在Level C-360内不定期会有一些正多面体从墙壁的一端穿过，这些实体内部是空的，并以匀速沿着直线向着一个方向前进，直到消失在视野中；即便使用无人机或汽车进行追赶也无法跟上这些物体的速度，无法确认正多面体的来源和去向。存在极少数的正多面体会一直悬浮在空中或在地面上静止不动。
//
//正多面体被记录有4种类型，即正六面体、正八面体、正十二面体和正二十面体。偶尔有机会正多面体会低空运动，有时会直接穿过流浪者的身体、物品和建筑物而不受阻挡，事后流浪者声称被实体穿过会感受到一种难以描述但异常美好的感觉，例如被蓝色正六面体穿过头部时的感受会被描述为“我闻到了蓝莓的香气，感觉自己的身体像一朵翠雀花一样盛开”，且每次的感受都不一样。
//
//块面：
//块面是一种看似二维平面但仍然属于三维空间中实际存在的实体，尽管难以发现和测量它的厚度，但依旧可以确认由它构成了每一个正多面体的结构。块面通常是以坠落的姿态从高空落下，落在地上后也完全静止不动。期间会有正多面体主动改变轨迹接近块面，当一个正多面体来到块面附近后，将会将其涵盖在内部，随后继续进行运动；而块面则会完全消失。
//
//由于数量过于罕有，对块面的了解正等待进一步观察和发现。
//
//线条：
//根据最早一批进入这一层级的流浪者描述，在最开始探索时，曾在地面上发现过一些黑色或笔直或弯曲的线条在相交运动，但在察觉到流浪者的到来后迅速消失在了视野范围内，在这之后再也没有见过其它线条实体的存在。
//
//偶尔会有在此定居的流浪者声称在远离聚集地的位置曾发现过线条在远处平行运动的迹象，但转眼间又消失不见，无法确认线条是否确实存在抑或是长时间处于Level C-360内的视错觉。
//
//虚线框：
//在极少数情况下，在没有流浪者和建筑的空地上会出现一个虚线框，这些实体多数是由不断闪烁的白色虚线构成的矩形或圆形的虚线框。实体出现后会在原地滞留3小时到7天不等，然后消失在原地。
//
//在这期间将任何物体放入虚线框所在的范围内会导致该物品的消失，在Level C-360早期探索阶段时，有未注意到这些实体出现的流浪者走入影响范围内，导致经常有流浪者消失。在这之后很长一段时间里，虚线框都作为居住者排放生活垃圾的地方使用。
//
//在极少数情况下，虚线框会平行于墙壁并贴合在上面，此时会在其范围内出现一个门把手。进入即可到达透明房间。鉴于这一点，不排除Level C-360内存在其他房间的可能性。
//
//vacancy4
//向镜头驶来的二面角
//
//二面角：
//当至少两个正多面体相撞时，正多面体将会沿着棱边破碎并分裂成若干个二面角。这些实体会缓慢飘落，形态如同纸张在高处落下时翻转摆动，并且能够在Level C-360的墙壁和地面上留下一个光滑且没有虚影的投影。此时与二面角接触的流浪者则不会感受到任何情绪。
//
//当前已发现二面角包括中间存在间隙的两个半平面组合、平二面角和直二面角这三种状态，且所有二面角到达地面后均会变为平二面角。对这些实体的面进行接触会感受到阻碍，但经由棱则不会受到影响，并且可以顺利穿过整个二面角。
//
//二面角能够遮蔽阻挡正多面体和虚线框的实体，受阻的正多面体通常会与二面角发生弹性碰撞，并以更快的速度逃逸。受遮蔽的虚线框会停止闪烁，物体在接触到遮挡部位不会消失，而是停留在二面角上方。当前二面角被用于标记和遮挡虚线框。
//
//占位符：
//占位符是一类广泛存在于Level C-360内的实体。这些实体呈现于背景相同的灰白格子图案，唯一将其区分开的是在边缘处的图案会在实体表面弯曲；平直的位置在视觉上无法分辨，仅会在弯曲面上显现出来。故此可以大致依靠图案的弯曲对占位符进行辨认。
//
//目前已发现的占位符中大多数为没有面部器官的人形、交通工具以及少量的植被和建筑物（多为构筑物）。这些实体会停留在原地且完全静止不动，无法以任何有效的方式对它们产生影响，也无法进行移动。正多面体、二面角和虚线框会自动躲开占位符所在区域，在这些实体周围进行定居也会造成妨碍。
//
//基地、前哨与社区
//探险者总署（Major Explorer Group） - C层群Omicron基地：
//作为The M.E.G.的大型基地和中转站使用。
//约230人在此长期驻扎，为其它流浪者提供服务。
//被调任和转移的The M.E.G.团队会这里暂时休整。
//因缺乏实体骚扰，仅设有2支5人安保小队在此轮班巡逻。
//偶尔会负责这一层级的卫生清洁工作，对居住者的垃圾堆放进行统筹管理。
//商人之家（Backrooms Nonaligned Trade Group）：
//作为C层群的主要存储设施之一。
//有大规模的贸易街和定期举办的集会。
//设有用以进行交易的场所，这一层级中大部分交易在此进行。
//有极少数保洁服务业，但收费高昂。
//驻留人数未知，估计不少于The M.E.G.的留守人员数。
//阿尔戈斯之眼（The Eyes Of Argos）：
//曾有一名阿尔戈斯之眼成员在追捕一未知实体时进入这一层级，该实体在进入该层级后立即穿过地面并消失。
//之后在此设有一支小型分队定期巡逻。
//会引导误入的无意识实体离开。
//会告诫居住者保持环境卫生。
//杰瑞的信众（The Followers Of Jerry）
//这个前哨站由杰瑞的信众成员建立并直接管辖。
//途似乎为作为仓库存放圣物及重要物品。
//定期在此进行对敌杰瑞和异端的宗教审判。
//设有用以守卫的大量武装人员。
//会在此印刷杰瑞圣经和传教儿童读物。
//有成员在此长期向其他社区宣传教义。
//失落一族（The Lost）：
//在距离入口约50km处有一个小型部落的遗迹。
//曾居住有60人以上。
//在此发现失落骄阳曾进行放牧的动物骨骸遗迹。
//似乎曾遭受了大规模的袭击。
//散落一地的青铜精英制式盔甲和兵器表明抵抗没有持续太久。
//此处已废置许久。
//卡拉格灵协会（The Kalag Institute）：
//作为卡拉格灵协会的小型前哨所使用。
//仅有一间办公室投入使用。
//平时仅有一名成员驻留办公，除获取补给外不会离开办公室。
//定期会有其他成员携带档案至此，离开时携带档案数量总少于来时
//会把一些档案进行粉碎后扔进虚线框里。
//永恒资料库（The Eternal Repository）：
//在这里占据了一个静止的正多面体作为设施。
//偶尔会有疑似主管理员成员来此开会。
//陪同的深蓝哨卫会在正多面体附近巡逻。
//会告诫和警告任何试图靠近的人。
//平时没人驻留。
//未知威胁程度。
//无羁探险者联盟（U.E.C.）：
//曾在此设有前哨和基地。
//曾作为关押”叛徒“和殖民地反抗者的监狱。
//驻留此处的家土防卫队曾与The M.E.G.发生战斗。
//战斗以U.E.C.被驱逐出Level C-360告终。
//此处现已弃置。
//后室娱乐（Backrooms Entertainment）：
//仅有一个由十几个帐篷组成的营地。
//定期在此进行游戏制作的研讨。（不涉及任何随机数和掷骰子）
//会分享近期的游戏资讯，并制作成册。
//经常向其它社区寻求试玩者。
//不时向其他社区赠送游戏实体。
//后室家居生产厂（Backrooms Furniture Producing Factory）：
//作为B.F.P.F.的一个大型基地和服务中心所使用。
//拥有充足的食物与杏仁水储备。
//会收留大多数离群和需要帮助的流浪者。
//有一个心理辅导办公室用以开导和指引那些失去希望和自尊的流浪者。
//设有一支会积极协助流浪者寻找工作的志愿者队伍。
//面向贫穷流浪者的免费医疗服务。
//与E.T.D.H交往繁多。
//龙血族：
//曾有一批艾普西隆（ε）实体小队从Level C-360深处到来。
//在发现流浪者后匆忙离开。
//此后再无发现其它龙血族实体存在的记录。
//当前未发现龙血族在这一层级存在基地的活动痕迹。
//未知威胁程度。
//红星建筑队：
//可能是红星建筑队的未知分队驻留处。
//似乎意图在此建立社区。
//经常向Level C-360内搬运建材，存放时间至多不超过3年。
//会在这里对建材进行粗加工，设有多个木材加工厂和石材加工厂。
//未知数量的工人群体与设计师。
//以待进一步观察。
//阿猫阿狗（Every Tom,Dick and Henry）：
//是一个由不动的正多面体和帐篷构成的小型聚落，主入口处有一块写有”Swtte F.A.“的木牌。
//大约有64个在此久居的成员，由一名为Jack的未知人员进行管理。
//大部分驻留成员的名字通常为Joe和Jane，其他外派成员的名字通常为Peter、Paul和Tony，确信系有意为之的更改。
//时常会和其他社区进行关于杏仁水、失去味道的食物和衣物的贸易，但从不和任何人进行语言交流。
//组织成员会不时与正多面体和二面角进行交互，曾有流浪者目击到其成员的身体与正多面体融合在一起的情况，但更多细节仍在探究中。
//E.T.D.H成员总是会被不经意地忽视和遗忘。
//虚线框不会对他们造成影响。
//居住者：
//多数为来自其他层级的流浪者。
//少数为老居住者在此诞下，或被来自其他层级的流浪者遗弃。
//极少数丧失记忆和情感。
//因丧失希望、自尊和勇气而在这里逗留，大部分对外进行乞讨或翻垃圾维持生计。
//由于对后室的恐惧，严重的PTSD症状和震颤使得他们无法从事正常工作。
//难以与其它社区成员进行有效的交流，表现出口齿不清和流涎症状。
//大部分成员情绪消极且营养不良，但没有成员转变为悲尸的记录。
//入口与出口
//入口
//Level 0的一间墙壁和地面均为灰白格子图案房间可以到达Level C-360。
//Level 1有时会随机出现一个白色补给箱，找到并进入其中，可以到达Level C-360。
//从Level 28 进入那团充满安宁、平和且如同无物的透明雾气中。
//在Level 57内通过一副没有内容的画。
//从Level 256将自己上传成功。
//在Level 600内长时间滞留约有（NaN%）的可能性到达Level C-360。
//Level C-5内保存失败。
//进入Level C-67右翼最末端的一个楼梯口向上，在踏上第13级台阶时回头。
//进入Level C-99的一处真真空。
//遍历卡勒巴格房间。
//在Level C-136内穿着和携带物品全部为纯黄色，有一定几率在于墙壁发生叠加后进入Level C-360。
//可能不存在出口。
//在Level C-165的管理员室内未经档案管理员的允许私自使用其电脑会被传送到这一层级。
//经由Level C-240的D:\市Adobe Photoshop栋CC层2018室可以直接进入这一层级。
//鉴于大多数C层群宜居和低生存难度层级似乎都存在一种方式进入这一层级，但这一猜想暂未被证实。
//N/A
//从上述入口进入层级时均会在同一个位置显现。
//
//出口
//从墙角向东约1公里处，墙上存在一个门把手，拧开即可到达Level 0的一扇灰白格子图案门附近。
//钻入带来的白色补给箱会回到位于Level 1的原处。
//与正多面体发生正片叠底后到达Level C-166，但大多数情况左耳会脱落。
//裸体时按照与背景相同的灰白色格子图案进行身体彩绘，然后在躺倒在地或靠紧墙壁时被虚线框选中消失，随后会随机出现在C层群的任一层级。
//掷任一骰子、盲选扑克牌和塔罗牌时掷出NaN，身体会逐渐淡出。去向不明。
//传闻中被线条缠住、切开或包裹可以被安全送出此层级，但未被证实。
//通过虚线框内产生的门到达透明房间。
//经由东南角的一扇虚线门可以到达Level C-240的D:\市Adobe Photoshop栋CC层2018室。
//从进入这一层级的入口皆可原路返回。
//正在寻求更对与其他层级连通的猜想出口。
//[占位符]
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1360{}