//Level C-323
//评分: 
//+15
//+
//–
//X
// 
//
//生存难度：
//等级 3
//
// 
// 
// 
//Level C-323 是后室C层群的第323层
//
//描述
//11249
//Level C-323 里所摄下的一幅照片。
//
//Level C-323是一座被废弃的酒店，酒店一共有四层，四层的构造几乎相同。流浪者进入该层级后，只会出现在层级的走廊上。层级的走廊相当的空旷，异常的安静，偶尔会遇到一些游荡的身着服务员服装的实体，但这些实体一般情况下似乎会忽视流浪者。
//
//走廊区域看上去相当的破败，大部分墙面和天花板的墙纸都已经脱落，露出灰白色的墙面。地面上铺设的地毯充满了灰尘和从顶部断裂的管道中流出的水。这些管道中的水是由少部分杏仁水和大量饮用水混合组成，可以安全饮用，目前暂不清楚水的来源。天花板上的灯有少部分破损无法使用，但大部分的灯虽然灯罩被破坏或脱离了天花板被电线拖拽住，但依然可以发光。这些灯照亮了层级的大部分区域。
//
//整个层级的走廊是一个非线性的空间，且向两端无限的延伸，流浪者在走廊里漫步时两侧会出现楼梯间，杂物间以及带有不同颜色标志的房间。
//（由于该层级的特殊性，流浪者无法在该层级相遇）
//
//楼梯间按照平均每500米一个的规律出现，所以流浪者可以轻易的找到并通过楼梯间来进行楼上和楼下的移动。但是楼梯间中的楼梯上下是随机的，只有一层和四层是固定的上楼和下楼的楼梯。
//
//杂物间在层级内固定出现在楼梯间的旁边，但分布是随机的，不是所有楼梯间的旁边都会有。杂物间是一间面积为12平方米的狭长空间，门通常都是紧闭着的，但可以打开。杂物间里面堆满了用于清洁和修理的工具，而在杂物间中有流浪者报告称遭遇过肢团和笑魇等实体，M.E.G.提醒误入此层级的流浪者不要去打开杂物间的门。
//
//在该层级中还有一种特殊的带有不同颜色标志的房间，这些房间随机的出现在走廊两侧，每一个不同的房间拥有不同的性质和特性。以下是M.E.G.对于每个房间的探索总结的报告。
//
//- 隐藏报告
//红色标志房间：
//红色标志房间是特殊房间中面积最大的一种，是占地约200平方米的方形房间，房间内相当的空旷。墙壁都是灰色的毛坯墙。墙壁顶部的四面有发光的荧光灯，照亮了整个房间。
//
//房间的正中间有一张木桌，木桌上放着一块发霉的松饼。流浪者可以将发霉的地方去掉来食用，味道与前厅的松饼一致，但无特殊效果，仅能用来充饥，且流浪者食用之后，松饼不会再重新刷新，但可以在新的红色标志房间内找到。
//
//蓝色标志房间：
//蓝色标志房间占地约120平方米左右，由两个区域组成，整个房间的墙壁和天花板上贴着崭新的浅蓝色墙纸，地面上铺着蓝色的地毯，房间内没有发现灯，但整个房间被未知来源的光芒照亮。
//
//在较大的房间里也有一张木桌，木桌上通常有1-3瓶杏仁水，偶尔还会出现皇家口粮等物资。与红色房间相同，流浪者在食用补给品之后，补给品不会刷新。较小的房间里有一张床，床只有床板，流浪者可以躺在上面休息，床不会对流浪者造成任何影响。
//
//白色标志房间：
//白色标志房间是该层级较危险的一种房间。占地约100平方米，房间构造呈圆形，房间的墙壁由乳白色的瓷砖砌成。流浪者在打开白色房间的门时只会看到一片黑色，且站在门外试图用照明设备照亮房间的行为均不会有任何的效果。当流浪者进入之后，房间会被未知的光源缓缓照亮，约10分钟后达到最亮。
//
//房间内会出现各种大小的木箱子，木箱子会在流浪者视野之外的地方不定时的刷新。流浪者可以在木箱里开出各种物品，比如一把无用的生锈钥匙、一张看不出来意义的涂鸦画、一包气球等。除此之外有流浪者在木箱里开出来似乎是被困在木箱里的肢团和悲尸两种实体。有时这些实体甚至会直接破箱而出，对流浪者造成威胁。M.E.G.提醒流浪者们应远离白色房间，以防遭到实体攻击。
//
//粉色标志房间：
//粉色标志房间是该层级中极少可以遇到的房间。根据进入过房间流浪者描述，这个房间是一个很小的六边形房间，在入口的对面有一个圆形的洞，通过洞可以到达其他的层级。除此之外房间没有其他多余的特征。
//
//特殊楼层
//根据流浪者的口述与一些日志中得知，通过该层级的楼梯有可能到达与回廊差异极大的楼层，目前已知特殊楼层如下：
//
//机械工厂：该楼层曾在两篇残缺日志
//中有所提及，该楼层目前没有发现任何
//实体，只有各种不断运转的机器，目前无法了解机器的运作原理与作用，该楼层除以上信息外并无其他异常特性。
//
//仓库：该楼层曾在一位自称Alex的流浪者口中提及，该楼层样貌近似于现实中的普通仓库，该楼层前端的置物架除了上摆放着清一色的置物箱外没有其他物品，由于Alex并没有深入探索，该楼层暂无其他信息。
//
//特殊实体
//“服务员”是该层级的独有实体
//在废弃的酒店回廊中游荡着服务员着装的未知实体，他们的面部被一层麻编织物覆盖，并且麻覆盖物似乎已经和“服务员”的面部皮肤贴合，成为了身体的一部分。
//
//他们的手臂部分通常以弯曲的姿态呈现在身前，手臂呈现出像是被烤焦一般的暗黑色，手腕处有明显的类似伤疤的裂痕，在攻击时，“服务员”亮银色的利爪会从手腕处伸出。
//
//在通常情况下“服务员”不具有攻击性，但是触碰到“服务员”时，他们会从手腕部分伸出黑色的利爪尝试攻击你，一但其中一个“服务员”对你发起攻击，其他“服务员”便会对你产生仇恨并且对你发起袭击，直到你进入房间或者楼梯间。
//但是无论怎样，“服务员”都不会进入楼梯间和房间，即使被激怒。
//
//目前已知：“服务员”不会主动攻击人类，并且“服务员”的移动能力极差，他们只能在走廊游荡，不会进入房间与楼梯间。
//
//基地，前哨和社区
//由于该层级特殊的空间性质，无法在该层级建立基地、前哨和社区。
//
//入口与出口：
//入口：
//在任何C层群层级中在关闭的房门旁切出有概率到达Level C-323。
//在Level 5的锅炉房中有概率到达Level C-323。
//出口：
//在回廊寻找粉色标志房间并进入即可离开Level C-323，一般情况下会进入Level 1或者Level C-6或者其他随机层级
//- 隐藏
//嘿！如果你看到这篇日志，我也许已经离开这该死的地方了，我本来想从Level 5的锅炉房去Level 3收集一些物资，结果来到了这破旧的走廊。
//
//走廊上游走着一种我从来没见过的实体，他们…好像并没有脸，不，严格来说，他们带着头套，穿着破旧的西服，我并不想靠近这怪异的家伙，还好这种实体并不会主动攻击我..
//
//我本来想走到这走廊的尽头，就一个走廊而已，能有多长，说不定一会就会有一个标志着出口的门在我面前出现！
//
//好吧…我放弃这种想法了，我大概走了几分钟了，出口没有出现，我途中不小心碰到了那种穿着西装蒙着头的奇怪实体，结果他伸出利刃开始攻击我，并且周边的实体几乎都朝我走过来…还好他们走到很慢，不然我不确定我会不会死在这该死的走廊。
//
//而且这里的管道流出的液体看起来很纯净，闻起来也很像杏仁水，但是我并不想喝这玩意，鬼知道这东西进了我的胃里我会怎么样。
//
//我只好尝试进入这些带有颜色标志看起来很诡异的房间了…我进入了红色的房间，结果…出乎我意料，这里很大很宽敞，并没有什么可怕的实体，桌子上还有一块很难闻的…松饼吗？
//看来这些房间都没有什么大用，我只能继续向前走了..还好这次我携带了一些物资，但愿这些物资够用吧。
//
//楼梯间？真奇怪，这无聊的走廊除了这些实体和房间以外还有楼梯间，或许我可以从这离开…
//
//看来我又错了，这楼梯间跟走廊一样无聊，不过我并没有离开楼梯间，因为这里至少没有那些烦人的实体，尽管这里的楼层看起来都一样。
//…好吧，我收回那句话，我看到了一座“机械工厂”..吗？这里在我上楼前明明还是一处普通的走廊…或许这里有出口…我的物资已经不太够了。
//
//这破工厂除了难听的噪音和难闻的汽油味以外什么都没有，真是该死，我没有找到任何有用的东西，不过令我高兴的是，我并没有迷失在这里，我回到了心爱的楼梯间，我只能继续走了，至少这样应该会快一点让我达到出口…
//
//我的物资彻底耗尽了…我现在仍然在这个楼梯间，我还能坚持多长时间？
//
//我发现了一间不寻常，我没见过的粉色房间，我并不想走进去，但我别无选择，我现在已经累的头晕眼花了，我没有物资让我继续前进了，到此为止吧….
//
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1323{}