//Level C-324
//评分: 
//+50
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
//安全
//不稳定
//实体绝迹
//描述：
//Level C-324是一个深度超过3km的电梯井。其面积大小约为20m*20m，远大于常规电梯井。井壁的材质为钢筋混凝土，附有锈蚀严重的滑轮，其上的数十根钢缆牵引住电梯与配重，整体外观近似前厅常见的电梯井。井壁上的电梯口除少数楼层外均已被水泥浇筑封堵。
//
//井中存在的唯一一台电梯于M.E.G.探索小队到达前已停止运行并静止在1000层处（详见在该层级中回收的记录Level C-324-A/B）。注意，由于可能存在的不确定性，建议任何团体或个人不要以任何手段重启该电梯，并尽可能维持电梯静止，在出现紧急情况时务必做出必要的抉择以避免可能发生的灾难性后果。
//
//流浪者在切入该层级时一般会来到电梯内。电梯门在被发现时已被暴力开启。轿厢主体由25mm厚度的不锈钢板构成，尺寸约为10m*10m*3m，地面较为整洁，天花板上嵌有整齐排列且运行正常的16块方形灯具。与常规电梯不同的是该电梯的楼层按键数量多达1000个，每个按键上均有一个1000以内的正整数，呈矩形依次排列在电梯门的左侧，不存在开、关门按键或紧急求助按键。
//
//按键“1”在任何时段均处于“已按下”的亮起状态，切断供电或暴力拆解等手段均无法造成影响，其余按键在流浪者刚切入时一般处于熄灭状态。
//
//楼层按键上方为一块液晶显示屏，用于指示当前楼层，下方为配电箱，在层级被发现时箱门已被暴力开启，于其中回收到了一台平板电脑，二十六柄合金匕首，十四柄改锥，三十支钢笔，以及大量金属或玻璃质物品，除平板电脑保持相对完好外其余所有物品均弯折损坏严重，少数沾有血迹。电梯左壁及后侧大半部分有由黑色记号笔，墨水，血液等书写的字迹，右壁中央存在一处贯穿轿厢的不规整缺口，直径为70cm左右，宽度足够一人通过。
//
//该层级中不存在Wi-Fi信号，资源稀缺且不稳定，存在仅能容纳一人的特殊性质。因此，建议流浪者在切入到Level C-324时尽快按照出口提供的切出方法离开该层级，再次强调，不要试图重启该层级中的电梯，在出现紧急情况时务必做出必要的抉择。
//
//- 隐藏
//回收于Level C-324的电梯内侧墙壁上，无意义内容已部分过滤。
//
//（字迹磨损严重。根据其内容推测其为最早的记录。）
//
//我是Alex1028，这里似乎是一个未被发现的层级。
//遵循探索协议，我简要记录一下目前掌握的信息。我是在乘坐Level 11某辆电梯时切入到此的，切入时有强烈眩晕，身上的东西基本上都不见了，除了插在口袋里的一只黑色记号笔，也就是我正在使用的这支。我离开前会把它留在电梯的角落里。
//
//如上文所言，我目前并没有电子设备，该层是否存在wifi存疑。电梯好像从我进入其就一直在下降，目前是610层。暂时没有遇到实体，心智相对正常，没有不适的症状，姑且再观察100层。
//
//500层了。状况同上。
//
//我想我该想办法出去了。
//现在尝试电梯按键。
//
//他们的运作好像是正常的，按下会亮起。我尝试了一下356，301，298这几个按键，它们都是我比较熟悉的安全层级。若我停止记录，则其为可能的离开方法。
//
//电梯会停下，但门不会打开。
//没法切出。
//停下的时候尝试切出也不行。
//
//电梯还在下降，现在是210层。我把剩下的楼层全按了，包括一些死区层级对应的数字。这个按键与层级似乎没有直接关联。按按键的时候我才发现1楼一直是亮着的，我不知道那里到底有什么，但是我有一种不妙的感觉。
//
//电梯还在下降，现在是100层。我承认我开始紧张了。轿厢很厚，没有专业的工具绝对打不开。在低于200层之后灯好像发生了几次闪烁，我不知道是不是幻觉。
//
//不是幻觉。现在是50层，灯一直在闪。
//
//40层。
//
//30层。
//
//20层。如果我没能出去，请代我向队长Uluolos10257和亲人问好。
//
//10层。我在摸黑写字。
//
//5层。
//
//（记录结束。）
//
// 
//
//（尖锐物刻画而成，用血液涂抹，较为显眼）
//
//致所有到达这个层级的流浪者，请立即按下所有按键。
//
//（记录结束。）
//
// 
//
//（字迹为锐器刻画，使用黑色记号笔重新描画，经鉴定非同一人完成）
//
//我是Steven19083。截止我切入这里为止，我并没有看到这个层级的任何相关资料。
//我不知道还有多少人进入过这里，但是估计我也出不去了。
//
//我也是从Level 11切入的。我身上的东西同样留在了Level 11，除了口袋里的一把改锥。
//
//我并没有看到Alex的那只黑色记号笔。这里地板非常整洁，几乎看不出有人到过这，但是墙壁上有很多划痕。这里似乎只会重置地板和其上的物品？我在地板上刻了一个大“X”作为标记，后来的人可以检查一下。
//
//拿这玩意写字太痛苦了。还好我在800多层就把按键全按了，不然还真没什么时间。
//
//说真的，切入后室就像一场噩梦。我早就记不清爸妈的样子了，每天都忐忐忑忑地活着，害怕下一秒就是人生的终点。有时候我会想，为什么不顺从它的意愿离去呢？顺从这个傻逼后室，随便找一个死区，躺下，闭上眼睛，然后就再也不用忍受痛苦了。
//
//现在机会来了。希望不会太痛。
//我要说的就这么多，改锥我放在地上了，希望下一个人能捡到。
//
//怎么还没到。
//
//他妈的还有多少层。
//
//我后悔按所有的楼层了。
//
//妈的能不能给个痛快啊
//
//300层
//我他妈不想继续躺下去了。让老子出去
//
//120层
//我把配电箱拆了，但是还是没有什么用
//
//50层
//显示屏根本不是玻璃的
//
//改锥断了
//
//（划痕较深）我想回家
//
//（记录结束。）
//
// 
//
//（为血液书写）
//
//我不想死
//
//（记录结束。）
//
// 
//
//（为排泄物书写）
//
//他妈的没有改锥。哪个傻逼写的按下全部楼层，我只想要个痛快。
//
//（记录结束。）
//
// 
//
//（为血液书写，字迹工整，显眼）
//
//请查看配电箱。
//
//（记录结束。）
//
//- 隐藏
//回收于Level C-324电梯配电箱中的平板电脑，无意义内容已部分过滤。
//
//- 隐藏
//我是Basic10380。
//
//装在我风衣口袋里的平板电脑被一起带进来了。这里没有wifi，一点都没有。
//
//知道自己快死了之后反而很平静，挺奇怪的。而且说不定是回到前厅，虽然不太可能就是了。后室里也没什么可牵挂的了，孓然一身。
//
//我会把平板留在配电箱里，这玩意的电池好像有异常效应，用了一个月电量还是不变，应该是够用的。希望不会和之前的东西一样消失。
//
//在剩下的时间里在平板里稍微整理了一下之前的各位写下的信息。向你们致敬。
//
// 
//
// 
//
//生存难度：
//极不安全
//极不稳定
//实体绝迹
//描述：
//本层级暂无编号。
//
//层级主体为一不断下降的电梯，有记录的位置均在900层左右，切入时通常会严重眩晕一段时间，尚不确定起始位置是否是1000层。
//
//流浪者在进入本层级时会丢失大部分物品，除了极少量的随身物品。电梯的楼层按钮中“1”层始终处于亮起且无法使用常规手段关闭。余下按钮功能正常，按下时会亮起，电梯在经过时会停顿，但不会开门。
//
//电梯的配电箱已被破坏且似乎无实际作用。按钮上方的显示屏难以损坏。电梯在每次到达1层后会对轿厢的地板进行清洁，在下一个流浪者进入时地面上的所有物品及痕迹都不会留存。
//
//所有可能到达过1层的流浪者均已失联。没有遭遇其他流浪者或实体的情况发生。
//
//基地、前哨与社区
//暂无。
//
//入口与出口：
//入口：
//推测在任何层级乘坐电梯时都有可能到达本层级，尤其是Level 11内的电梯。
//出口：
//无法切出。暂无更多信息。
// 
//
//啊，好像快到了。
//
//祝后来者好运。
//
//- 隐藏
//Sadness1938
//我没法像上面那老哥一样佛系。我的妻子还在Level 1等我，我的女儿才三个月大。
//我身上也没剩什么东西了，但是好消息是我他妈把背上的撬棍带进来了。
//没多少时间可拖延了。
//
//撬开了。
//但是没用。门外面是比地壳还他妈厚的混凝土，就2cm的空隙。门下面也没有滑轨，只能一点一点地打开一条缝隙。
//
//没用。
//没有意义了。
//几百米都是这种墙壁。
//
//为什么
//
//我他妈到底做错了什么
//我忏悔
//
//今天是我和妻子的结婚纪念日
//她还在等我
//
//救救我，不管是谁
//
//- 隐藏
//Little1843
//我是998层缓过神来的。我不知道是不是看错了，外面有光。
//
//二次编辑：
//Front91234
//我是999层回过神来的。我也看到了。那里可能是出口。
//
//- 隐藏
//此文档经过多次编辑，仅展示部分。
//
//Word24738
//去他妈的命运。
//
//我身上只有一把剪刀了。走电梯门显然是不现实的了。
//
//你们有没有想过，把电梯旁边开一个洞爬出去？
//
//剪刀彻底坏了，手一直在流血，但是墙壁已经凹下去一个洞了。
//我觉得能行，可是我的时间快到了。
//
//去他妈的命运。
//
//Bread19047
//果然贵的签字笔就是不一样。
//我把你那个洞搞穿了，Word，外面乌漆嘛黑的。
//我先走了，后面的加油。
//
//Tiny2054
//得感谢那个把撬棍带进来的老哥。
//那个洞稍微大了一点，可以把手探出去了。
//外面不是墙壁，至少我把整个手臂伸出去都碰不到。
//
//Great243
//感谢诸位。这个洞可以供一人通过了，我试着爬上去看看。
//
//很刺激，差点掉下去。1000层确实有光。
//但是根本不可能爬上去，真的。
//井壁上的滑轮什么的根本没法受力，难以理解为什么它只能支撑钢缆但是手一碰就掉下去。
//爬墙壁更不用说了，你不是蜘蛛侠。
//
//我们得想办法让电梯停下来。
//
//Sam2398
//？这他妈怎么让这东西停下来？
//
//怕不是说梦话
//
//有工具还好说，往底下丢东西都能把电梯井填满
//问题是你总不能拿签字笔和剪刀架住电梯吧
//
//Hard2348
//我有个想法。很疯狂。
//电梯会靠配重控制速度，我观察过了，那个洞对着的就是配重。
//只要增加配重，电梯总是会停下来的。
//至于重物？这里唯一的重物不就是……
//
//你。
//
//我计算过了，电梯正常下降一层平均需要1.32s。
//如果减慢了，那么就是可行的。
//诸君，我先行一步。
//
//- 隐藏
//此文档经过多次编辑，仅展示部分。
//
//Cena2349
//我脑子不好使，计算留给后人吧。
//回见。
//
//Peter2357
//反正78年的人生我也活腻了。
//同上。
//
//Flower4329
//减慢了。我反复测了8次。
//慢了0.1s左右。
//我不知道是不是误差，但是有这份希望就已经足够了。
//再见，所有爱我的人。
//
//Data2489
//我说不出什么煽情的话。
//操他妈的后室，下辈子别见了
//
//Past3457
//不如我们来玩成语接龙？
//万众一心。
//
//Present2001
//心如铁石。
//
//Yet2094
//石沉海底。
//
//Hello3204
//底死谩生。
//
//Watch3247
//生死与共。
//
//Killer3248
//操。
//
//你们真他妈闲，都快死了还搁这成语接龙。
//电梯已经很慢了，我估计是最后一个了。
//后来的流浪者可别忘了给你爷爷我上香。
//哎。
//
//……共贯同条。
//
// 
//
//基地、前哨与社区
//暂无。
//入口与出口：
//入口：
//在任何层级乘坐电梯时都有可能到达本层级，尤其是Level 11内的电梯。
//出口：
//从1000层的通道离开即可，你会返回切入前身处的地点。
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1324{}