//Level C-356
//评分: 
//+6
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//Level C-356是后室C层群的第356层。
//
//描述
//Level C-356是一颗体积约为地球0.3倍的类地行星，其赤道长约1.2万千米，具有和地球几乎如出一辙的地形，但在其第一次被流浪者发现之前并没有任何人类活动的痕迹。与前厅不同的是该层级的自转周期为16小时一圈。
//
//流浪者进入该层级后的起始位置为赤道以北任意一点，多位于北纬20度到北纬50度之间。
//
//据M.E.G.报告称，该层级的上空被一种透明的未知物质包围，这种物质无法破坏，流浪者也无法穿过，屏障之外的空间无人知晓。据说该层级并没有恒星一类的星体为其提供照明，有的仅仅是一方形物体通过一根类似于钢管的物体悬挂在空中，并且该层级的昼夜更替的发生具有突然性，光线不会慢慢变暗，而是发光体瞬间变暗，整个层级进入时长为8小时的黑夜。就算在发光体亮着的情况下，也始终只有半个层级处于白昼。
//
//该层级在进入夜晚之后，流浪者耳旁会响起前厅中人类日常生活所发出的声音，内容因人而异，有流浪者报告称他在北纬23.5度，东经116度附近听到了一种类似于哭声的声音，随后便产生了严重的耳鸣，该症状持续了将近72小时后逐渐缓解，这几乎使这位流浪者陷入崩溃，目前已在Level C-356中发现了多例类似事件，M.E.G.对此展开了调查，暂时没有任何收获。
//
//Wi-Fi信号覆盖整个层级，但信号较弱，M.E.G.不建议流浪者大量使用通讯设备。
//
//有流浪者报告称其在赤道附近1发现了完整的地球仪，但由于实体靠近，他没有近距离观察，在48小时后该流浪者与M.E.G.调查组再次赶到现场时，地球仪已消失。
//
//实体
//该层级常见的实体有无面灵、笑魇、猎犬等，但由于数量极少，流浪者很难在该层级遭遇实体所带来的危险，并且根据该层级流浪者报告，目前从未发现过实体进入城区的现象。
//
//基地、前哨与社区
//M.E.G.“东方”前哨站
//常驻人员500人
//保护和帮助误入此层级的流浪者
//调查和研究该层级的神秘特性
//对该层级进行测量和勘探
//帮助流浪者穿越该层级
//前哨站坐标约为东经110度，北纬40度
//L.E.B.“家乡”前哨站
//固定成员300人
//对流浪者提供帮助
//提供旅游服务
//前哨站坐标为东经116度，北纬23.5度
//“雪城”流浪者交易中心
//提供交易服务
//该层级最大的流浪者聚集地，约2000人常驻于此
//位于西经40度，北纬50度左右
//入口与出口
//入口
//在Level C-126的263号车厢切出可到达Level C-356。
//在Level C-386找到一个楼梯间，从楼梯间向下走6级台阶并跌倒可切入。
//在任意层级找到一个破损的地球仪并切入可到达Level C-356。
//出口
//在M.E.G.的指引下跳进东经116度，北纬30度的一条河流可切出该层级并到达Level C-75。
//朝任意建筑的墙壁切出有几率到达Level C-264、Level C-399或Level C-406。
//上传于2021.2.14
//
//附录
//Level C-356的层级探索记录（视频记录）
//
//时间：2022.8.21
//层级：Level C-263
//坐标：0°，100.5°E
//
//【记录开始】
//00:00:01 一个身穿黑色夹克衫的男人出现在了镜头里，并且挥了挥手。画面一转，一个完整的地球仪漂浮在镜头前方的空中。男人用手指了指地球仪，随即向地球仪走去。
//
//00:00:27 男人向地球仪靠近，但地球仪似乎在不断远离男人。
//
//00:00:53 地球仪停止移动，男人继续靠近。
//
//00:01:22 男人来到了地球仪旁边，这时镜头中出现了两只笑魇，正在向男人袭来，男人将手放在了地球仪上，地球仪顿时发出了蓝色的闪光，几秒之后，蓝光消失，镜头内一片黑暗。
//
//00:02:01 黑暗消散，男人到达了一个类似于小木屋的房间，他看到了███
//
//【数据库遭到未知力量入侵】
//【记录损坏】
//
//
//
//
//
//
//你还记得吗？
//
//
//在前厅的时候
//
//
//
//你坚信世上没有什么上帝
//
//
//
//地球的诞生，太阳的形成只不过是茫茫星海之中的一个巧合
//
//
//真的是这样的吗？
//
//
//也许
//
//
//
//在前厅中是这样没错
//
//
//但这里是后室
//
//
//这里有着无尽的黑暗，以及危险
//
//前厅那一套，在我们这不适用
//
//
//至少在这个层级不适用
//
//
//
//
//因为
//
//
//我就是这个层级的上帝
//
//【正在尝试恢复记录】
//
//【数据断点重连中……】
//
//【记录恢复成功】
//00:02:03 一个身穿白色长袍的无面灵向男人缓缓走来，男人下意识地后退了几步。
//
//00:02:07 无面灵忽然开口说道：“放心，我不会伤害你的，过来吧。”接着无面灵将男人带到茶几旁边坐下，并拿出茶杯沏茶。男人问道：“你到底是谁？这里又是哪里？”无面灵没有答话，而是继续沏茶。
//
//00:02:53 男人将镜头掉转，镜头中出现了一个巨大的地球仪，而一盏台灯将光线照射到地球仪上，男人貌似想到了什么，再次向无面灵提问：“这个地球仪不会是……”无面灵这时将沏好的茶递给了男人，开口说道：“没错，就是你想的那样。你们所谓的层级实际上就是摆在我房间里的地球仪，我随时可以改变你们所谓的整个层级的气候。这个层级由我掌管，我就是这个层级的上帝，想要将生活在地球仪上的你们干掉对我而言轻轻松松，但你知道的，我并没有这么做。”
//
//00:03:22 男人沉默了，而无面灵还在继续说：“我每天的乐趣就是看你们这些蚂蚁在地球仪上爬来爬去，你们为生存而生存，而我不同。嘿，你不用去看，你是看不到的。”此时男人正在仔细查看地球仪，无面灵制止了他，“喝了这杯茶，我已经让那两个笑魇离开了，你也差不多该走了。”
//
//00:04:01 男人喝完了茶杯里的茶，无面灵站了起来，男人也跟着起身，但此时镜头快速下移，很快就传来了摄像机掉在地上以及男人倒地的声音。
//
//00:04:20 画面一片黑暗。
//
//00:10:33亮光出现，摄像机再次落地，镜头朝向了昏迷不醒的男人以及远处的树木和蓝天。
//【记录结束】
//
//M.E.G.通告
//根据流浪者亚瑟·伊文思的视频记录，
//M.E.G.对此层级文档进行了更新
//
//隐藏
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//Level C-356是后室C层群的第356层。
//
//描述
//Level C-356是一个大小未知的木屋，木屋的中央有一台直径为2米的大型地球仪，木屋的角落中有一个茶几和两个座位。
//
//木屋内灯光昏暗，唯一的发光体就是地球仪旁的大型台灯，经推断该台灯就是流浪者在地球仪上看到的未知发光体。
//
//经证实进入地球仪后流浪者会被缩小，在地球仪上观测到的地球仪是一颗体积约为地球0.3倍的类地行星，其赤道长约1.2万千米，具有和地球几乎如出一辙的地形，但在其第一次被流浪者发现之前并没有任何人类活动的痕迹。与前厅不同的是该层级的自转周期为16小时一圈。2
//
//流浪者进入该层级后的起始位置为地球仪上赤道以北任意一点，多位于北纬20度到北纬50度之间。进入该层级后流浪者会自动缩小。
//
//据M.E.G.报告称，该层级的上空被一种未知物质包围，这种物质无法破坏，流浪者也无法穿过，屏障之外的空间在8月21日之前无人知晓，现已证实就是“上帝”所在的木屋。该层级没有恒星一类的星体为其提供照明，有的仅仅是一方形物体通过一根类似于钢管的物体悬挂在空中，现已证实其为木屋中的台灯，台灯的开关由“上帝”掌控。该层级的昼夜更替的发生具有突然性，光线不会慢慢变暗，而是发光体瞬间变暗，整个层级进入时长为8小时的黑夜。就算在发光体亮着的情况下，也始终只有半个层级处于白昼。
//
//该层级在进入夜晚之后，流浪者耳旁会响起前厅中人类日常生活所发出的声音，内容因人而异，有流浪者报告称他在北纬23.5度，东经116度附近听到了一种类似于哭声的声音，随后便产生了严重的耳鸣，该症状持续了将近72小时后逐渐缓解，这几乎使这位流浪者陷入崩溃，目前已在Level C-263中发现了多例类似事件，M.E.G.对此展开了调查，最终推测这些声音均由实体“上帝”发出。
//
//Wi-Fi信号覆盖整个层级，但信号较弱，M.E.G.不建议流浪者大量使用通讯设备。
//
//流浪者亚瑟·伊文思曾在赤道附近发现了完整的地球仪，并且成功通过地球仪切入了“上帝”所在的木屋中，切入木屋后，亚瑟·伊文思的身体及随身物品恢复至正常大小，并且见到了自称“上帝”的无面灵，M.E.G.根据其视频录像整理出来了更新后的文档。
//
//实体
//该层级常见的实体有无面灵、笑魇、猎犬等，但由于数量极少，流浪者很难在该层级遭遇实体所带来的危险，并且根据该层级流浪者报告，目前从未发现过实体进入城区的现象。
//
//除了上述实体之外，该层级还存在一个特殊的实体，研究表明其为无面灵亚种，该实体自称Level C-356的上帝，经M.E.G.证实其具有改变该层级天气等自然因素的能力。
//
//尽管“上帝”在与流浪者亚瑟·伊文思的接触中没有表现出对人类的恶意，但我们仍然无法确定“上帝”对流浪者而言是否安全，所以M.E.G.不建议流浪者通过切入地球仪的方式进入木屋。目前流浪者亚瑟·伊文思正在接受M.E.G.的隔离检查。
//
//基地、前哨与社区
//M.E.G.“东方”前哨站
//常驻人员500人
//保护和帮助误入此层级的流浪者
//调查和研究该层级的神秘特性
//对该层级进行测量和勘探
//帮助流浪者穿越该层级
//前哨站坐标约为东经110度，北纬40度
//调查实体“上帝”
//L.E.B.“家乡”前哨站
//固定成员300人
//对流浪者提供帮助
//提供旅游服务
//前哨站坐标为东经116度，北纬23.5度
//“雪城”流浪者交易中心
//提供交易服务
//该层级最大的流浪者聚集地，约2000人常驻于此
//位于西经40度，北纬50度左右
//入口与出口
//入口
//在Level C-126的356号车厢切出可到达Level C-356。
//在Level C-386找到一个楼梯间，从楼梯间向下走6级台阶并跌倒可切入Level C-356。
//在任意层级找到一个破损的地球仪并切入可到达Level C-356。
//出口
//在M.E.G.的指引下跳进东经116度，北纬30度的一条河流可切出该层级并到达Level C-75。
//朝任意建筑的墙壁切出有几率到达Level C-264、Level C-399或Level C-406。
//上传于2022.8.22
//
//
//作者信息
//« Level C-355 | Level C-356 | Level C-357 »
//
//Footnotes
//1. 该流浪者并未提供任何关于地球仪出现位置的经度信息
//2. 以上数据均以缩小后的人类为参照物
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1356{}