//Level C-312
//评分: 
//+11
//+
//–
//X
// 
//
//生存难度：
//等级 4
//
// 
// 
// 
//photo-1541395090642-a6befe8bbc95?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1170&q=80
//Level C-312内部照片，由一名流浪者提供拍摄。
//
//Level C-312是后室C层群的第312层。
//
//描述
//Level C-312是一处空间十分狭窄的地下洞穴，其内部大部分都布满了燧石或火山岩，并且多处地方都长满蛛网，由于其内部有火山岩的岩石部分组成，因此在某些角落处的温度较为偏高，据分析报告，其温度基本保持在45℃。但其他角落处的温度却大不相同，给人一种很阴冷的感觉，并且随时能感受到冷风从前方或后方吹来。
//
//由于内部的高度只有40厘米左右，因此探索人员不得不匍匐前进，由于长时间在狭窄的空间中不断行进，可能会导致人员的精神状态会受到极大程度的折磨，甚至会产生幻觉，这种病情推测可能由实体所排放出的有毒气体导致的。
//
//实体
//photo-1518559390216-c12d599379e2?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1174&q=80
//一名被袭击的受害者所拍摄到巨蛛怪的最为清晰的照片。
//
//“巨蛛怪”是该层级唯一一个独有实体，被记录到其外貌特征为大型的蛛形纲节肢动物，大部分都是白额高脚蛛，也会出现别的不同种类。唯一特点是该类实体没有雌性与雄姓存在，但不知何种原因，该类实体能在没有繁殖的需求下，生成新的实体的速度极快。巨蛛怪通常栖息在阴暗潮湿的角落，尤其是空间的局限性十分狭窄或者低矮的角落处，然而也有极少的情况下，该实体也会在较为宽旷的室内环境下的层次徘徊。巨蛛怪会大量吐出白色的蛛丝来为自己建立巢穴，据分析，这种蛛丝网会分泌出大量的神经毒素来控制受害者的神经系统，并且当受害者完全死亡后，会以受害者的尸体作为蛛丝繁衍的基本环境需要。
//
//基地、前哨与社区
//由于该层级的特殊环境，任何建造在Level C-312的基地、前哨与社区的尝试均已经失败。
//
//入口与出口
//入口
//可以在Level 96中尝试直接切入，将会直接达到该层级。
//在Level C-13里遇到巨蛛怪，它可能会将你打晕或利用神经毒素让你暂时失去意识，当你醒来后，你将平躺在该层级中。
//可能在Level C-20中遇到高度大约在40cm左右的小型洞穴入口，若尝试爬进去，你会发现自己已经抵达该层级，虽然此方法的触发方式的几率极为稀少。
//出口
//让巨蛛怪将你包裹在由球形的蛛丝网中，并尝试将其撕开，你就会抵达Level C-296中有积水处的一角地方。
//利用蛛丝网所分泌出的神经毒素让自己完全昏迷过去，醒来后，你就会发现自己在Level C-28中的地下室醒来。1
//在该层级爬行一段时间后，将随机传送至Level 0的地面上。
//作者信息
//Footnotes
//1. 虽然这个方法的确有用，但不建议流浪者使用这个方法，因为这太危险了，目前还不确定神经毒素是否将会直接造成死亡。
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1312{}