//Level C-318
//评分: 
//+7
//+
//–
//X
// 
//
//生存难度：
//等级 5
//
// 
// 
// 
//Level C-318是后室C层群的第318层。
//
//描述
//level
//Level C-318的一段影像，下附在同一场地录制的音频文件。
//
//
//Level C-318是由一片一望无际的灰绿色草地与一大群正在燃烧的枯林所组成的山丘。沾满尘灰的杂草与割裂的褐色土地组成了这里的草原，一颗颗正在燃烧的枯木组成了这里的山坡。烈焰如恶魔般无尽的徘徊在这里的树林与草地之间，力图要将这里化为地狱熔炉。包含着一氧化碳等毒气的巨大浓烟从不断燃烧枯林中不断的散发出来，燃烧在这一片“地狱”之中仿佛一刻都不会停歇，在灰蒙蒙的天空之中刻上一道道染的焦黑的痕迹。在这里不仅要小心那如同人间地狱般的毒气与火海，还要小心那埋藏在浓烟焦林中海量实体的威胁。
//
//Level C-318可能存在空间未知程度的扭曲与磁场干扰。在燃烧的枯林中前行时有较小可能会被传送到此层的其他未知地点，也有可能不断绕回原路。网络通信与定位设备在此层往往无法发挥有效的作用，诸如手机和指南针等。
//
//一般情况下，因为此层极其恶劣的环境与海量实体存在的威胁，我们极不推荐其他流浪者进入此层，但如果你一意孤行企图企图进入，则最好随身携带一个防毒面具和防火外套以抵御烈焰燃烧时所产生的浓烟与高温，并且需要携带大量饮用水以避免高温下大量出汗所导致的脱水。需要注意的是，这里的枯木可能随时将要坍塌，因为这里的树木似乎永远不会停止燃烧。并且，此层大部分的敌对实体基本都会出现在燃烧的枯林与浓烟里，同时这里的烈焰与浓烟似乎对此地的实体没有太大的影响。所以除非你做好了与大量实体战斗的准备的情况下，最好一直呆在草原上，不要贸然进入燃烧的枯林内。
//
//在燃烧的枯林中可能会出现一些不知被谁遗落的补给品，包括但不限于食物与杏仁水等等。少数情况下在焦林之中能够遇到一个由水泥砌成的形状不一的建筑物，进入其中的地下道内有较大可能会出现一些枪械和子弹、破旧的衣服、防毒面具与一些绷带等医疗用品。
//
//每片荒芜的草地上经常会出现一群白色的简陋房屋，它们是由涂过白色油漆的褐色瓦砖所砌成的，上面的油漆可以通过工具刮去。这些房屋的外貌似乎是20世纪初的平民小屋，有时还经常可以发现一些房屋坍塌的废墟。虽然根据传言，有小部分流浪者在这些房屋内找到了一些医用绷带，但事实证明这些房屋基本没有什么补给和物品，除此之外，一些实体也有较小可能出现在房屋内，因此，我们较不推荐企图搜刮补给的人进入房屋。
//
//wocao
//Level C-318的杏仁水溪流。
//
//此外，在草地与焦林的交界点有时会出现一条由杏仁水所组成的纤细溪流。不过需要注意的是，这里的溪流已经被灰土与毒气所污染，即使口渴也不可饮用，不然很有可能会导致头晕腹泻等甚至更严重的脱水症状。
//
//基地、前哨站与社区
//即使此层极其危险且网络与定位在此层可能并不适用，但因为此层含有非常稀有且有价值的补给与物资，所以仍有少量组织铤而走险驻扎在相对安全的草原上。
//
//赤色救援组
//一群武装救援人员，他们在尽力帮助误入此层的流浪者的同时并设法击杀其他敌对实体；
//这个组织的成员约为32人；
//待人友好，且开放交易。
//枯林掠夺者
//为了搜刮在此层的枪支弹药与其他补给品所组成的组织，大约有52名成员；
//经常有部分人员出入此层与其他组织据点交易；
//全副武装，对外开放贸易。
//“堡垒”采集点
//M.E.G.针对Level C-318的特殊性质所开发的采集点；
//该据点所采集到的任何物资都将无条件的转移至M.E.G.，且拒绝与其他组织或流浪者交易；
//与“枯林掠夺者”敌对；
//全副武装，且开放交易。
//入口与出口
//入口
//在Level 9中有较小可能遇到一颗烧的焦黑的树干，用手触碰他将会带你来到此层。
//出口
//在燃烧的枯林中前行时有较小可能遇到一颗并未被焚毁且保持长青的树木，用手触碰他将会将你传送到Level 9。
//被一根枯死且裸露的树根绊倒有极小可能将你带到Level 10（该出口未经证实）。
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1318{}