//Level C-383
//评分: 
//+21
//+
//–
//X
//来自M.E.G.档案部的提醒
//本档案由M.E.G.官方代为B.F.P.F.撰写1。
//
// 
//
//生存难度：
//等级 0
//
//安全
//较稳定
//实体绝迹C383-1.jpg
//Level C-383内的郊区处。
//
//Level C-383是后室C层群的第383层。
//
//描述
//Level C-383内为由一片由植物纤维组成的大陆，虽然其硬度远不及石块，但强度仍然可观。由于物质在本层级的高刷新率，以及M.E.G.之后在该层级发现的大量矿藏，目前已经逐渐发展成具有一定规模的流浪者暂住区域。根据M.E.G.第[数据隐藏]号提案，监督者团队曾经有意向将本层级的生存难度修改为“宜居”。
//
//Level C-383内拥有22个小时的昼夜循环，气温偏高，空气干燥，植被茂盛。天上偶尔会出现两颗太阳，但其中一颗一般极其微小，需要借助观测仪器才能发现。平原之上有时会生成一些房屋废墟，尽管这些房屋的风格通常具有天壤之别，但里面的物资基本一致，存在大量杏仁水、火盐、罐装龙肉，甚至有时会出现便携水枪，氙弹珠等稀有物品。其刷新速度相比于其他层级表现的更快，几乎每1到2小时就会生成一批新的物资。因此，这些房屋废墟在进行重新修缮后，成为了天然的物资站点，由M.E.G.与B.F.P.F.统筹管理。
//
//Level C-383分为三个部分：流浪者社区、森林区、边界区。这三者由中心向外扩散的方式排布。
//
//流浪者社区：
//由MEG的暂时性营地和BFPF的“晨星庄”社区组成，面积约为直径10千米的圆形区域，部分与“森林区”重叠。关于本层级的几乎所有活动皆发生于此。
//
//森林区：
//
//C383-2.jpg
//Level C-383内的森林区。
//
//除去“流浪者社区”外，直径为100千米左右的环形区域。由于大陆的组成为一种植物纤维，因此该森林中的所有植物均无根部，而是与大地直接相接，这导致了MEG植物学部门不得不为本层级的所有植物重新设立一门分类2。
//森林各处还有许多零星的洞穴。不过这些洞穴要么是深入太短，基本没有太多具有价值的资源，要么是洞穴环境过于复杂，具有极高的危险性，无法探索。即便如此，在距离“流浪者社区”东南方向约30千米的森林当中，MEG仍然建立了“三川矿场”，并用于对紫钥石等珍贵矿物资源的开发。
//
//边界区：
//在森林区之外约2千米的未知区域，由于越往边界深处，气温便越炎热，此处已不再生长任何植物。2千米以外的区域，大陆已经变为烧糊一般的焦黑色，且极其容易坍塌。过高的气温而导致地面燃起了熊熊烈火，阻挡了一切进入的道路，故边界区具体面积仍处于未知。
//曾经有调查员通过穿戴无重力宇航服前往天空进行观察，但由于几近300℃的高温影响，这位调查员只在进行了简短的数据采集3后，便被基地强制遣返。
//
//具目击者称，位于边界区的矿洞当中经常冒出一种奇怪的黑烟，这种黑烟会像是被“吸入”森林一样，迅速在茂密的林中失踪。但由于截至目前仍然没有可用的证据，因此请流浪者务必远离任何可能存在的类似与“黑烟”的物质。
//
//实体
//曾有记录记载该层级森林区域存在过一部分实体，如笑魇，死亡飞蛾，无面灵等等。但根据MEG后续的调查，发现这些实体在该层级内已经绝迹，不再对层级内的流浪者社区造成任何威胁。
//
//基地、前哨与社区
//后室家居生产厂(The B.F.P.F) “晨星庄”社区
//B.F.P.F已在Level C-383建立起了一个大型的流浪者社区，并自称“晨星庄”。其规模相当于一座村镇，共容纳有约3500名流浪者居住于此。该社区的主要构成为平房，但除此之外，流浪者们也在B.F.P. F的领导下建造了商店，医院，学校，餐厅，警署，办公楼等基础服务类设施。这些设施为该社区的持久运营提供了足够的保障。与此同时，“晨星庄”也拥有一定的军事实力，B.F.P.F下属士兵约600人常驻于此，负责保卫“晨星庄”使之远离外部威胁。当然，大部分时候，这些士兵的任务主要是协助警方维持社区秩序。
//办公楼是该社区的核心设施，它位于整座城市的中心，由于资源有限，其外表与社区内的平房并无太大差别，但其大门上方挂有一块标有烫金题字“晨星庄政厅”的巨大门匾。所有的外交程序，入住流浪者登记程序以及领导层选拔迭代程序都需要在此处进行。
//“晨星庄”是Level C-383规模最大的流浪者社区，并且对进入该层级的流浪者始终持开放态度。
//探险者总署(The M.E.G.) “三川矿区”前哨站
//M.E.G.发现Level C-383的时间远晚于B.F.P.F.，因此他们始终未能在该层级内部建立起一个持久的生存者社区。除去位于野外部分的一些暂时性营地以外，M.E.G.在该层级内所持有的最有价值的财产是一个超大型的矿场——“三川矿场”。该矿场已被确认含有大量的稀缺矿石资源，经评估，向其他受关注组织售出原材料和利用原材料开发新能源这两种可能的资源使用方法均能够为M.E.G.带来巨大的财政收入。
//“晨星庄”方面已多次要求“三川矿场”为其提供资源和资金方面的支持，并允诺会给M.E.G.提供丰厚的回报。但是由于M.E.G.和B.F.P.F.之间的历史原因，双方之间的沟通始终不顺利，未能达成任何书面文件。在该档案归档之前，双方依旧处于关系僵化阶段。
//入口与出口
//入口
//在Level C-199找到并进入一扇印有三颗星星符号的木门即可到达此层级。
//在Level C-423内找到一个操场，并站在操场中央连续做100～120组开合跳即可进入此层级。
//在Level C-126的第038节车厢切出可进入此层级。
//从Level C-345的饮料机处购买并喝掉一瓶外包装上写着“绿色风暴”的杏仁水两分钟后，流浪者将被自动传送至此层级。
//出口
//钻进本层级的森林区域中一个狭小的山洞将到达Level C-295。
//在“三川矿场”外围墙背阳面的阴暗处切出将会前往Level C-55， Level C-469和Level C-192中的随机一个层级。
//在森林区域内找到一座废弃的小木屋，并在其中逗留一晚后，流浪者将发现自己已经到达Level C-384。
//附录一
//- 认证通过
//[数据成像记录开始]
// 
//C383-4.jpg
//【检测到烟雾，为纤维燃烧时产生的碳化颗粒】
//【是否开启深度扫描？】
//-Y
//【深度扫描已开启】
//
//【检测到空间异常现象】
//【坐标（2403，1767，368）出现不明引力畸变】
//【……】
//【强度：VI级/扩大趋势：是/深度趋势：否/危险等级：III级】
//
//【检测到温度溢出，已将数据发送至频段M383-01】
//【是否继续扫描？】
//-Y
//【深度扫描已开启】
//
//【风力0级】
//【检测到烟雾同向移动现象】
//【速度：4.33M/S】
//【……】
//【环境温度过高，仪器进入冷却状态】
//-U
//【进入待机状态】
//
//[记录结束]
//
//
// 
//
// 
//附录二
//该资料属于一级机密文件，请输入您的管理者账号以访问
//ID	
//<你的账号>
//密码	
//•••••••••
//登出
//点击此处以跳转至加密页面
//
//作者信息
//« Level C-382 | Level C-383 | Level C-384 »
//
//脚注
//1. 撰写时间为2022/5/15。
//2. 该分类已于2022/5/10归档。
//3. 具体数据见附录。
//
//关于Level C-383内部调查报告总览
//一、Level C-383沦陷事件
//二、Level C-383修正文档
//
//一
//在后室协调授时系统时2022年5月6日中，处于边界区的A1~A5探测平台检测到异常高温，M.E.G.随即派出人员前往调查。以下是监测站发回的数据报告。
//
//信号源：AOO-383RE-01
//终端：meg#C-383-DF400-E
//时间：2022年5月6日08:11:34
//火源距离此处约2.4千米，能见度1000米以上。
//环境温度变化量：+4.1℃
//
//信号源：AOO-383RE-02
//终端：meg#C-383-DF400-E
//时间：2022年5月6日15:07:58
//火源距离此处约1.2千米，能见度1000米以上。
//环境温度变化量：+7.5℃
//
//信号源：AOO-383RE-05
//终端：meg#C-383-DF400-E
//时间：2022年5月6日15:07:58
//火源距离此处约700米，能见度100米。
//环境温度变化量：+48℃
//高温III级预警
//
//信号源：AOO-383RE-05
//终端：meg#C-383-DF400-E
//时间：2022年5月6日16:28:21
//火源距离此处100米，部分功能已关闭，进入防火状态。
//环境温度变化量：+340℃
//高温I级预警
//
//信号源：AOO-383RE-03
//终端：meg#C-383-DF400-E
//时间：2022年5月6日21:00:30
//火源距离此处2.2千米，夜视下能见度1000米以上。
//环境温度变化量：+20℃
//
//收到来自AOO-383RE-01的信号。内容如下：
//监测站被摧毁。
//摧毁前约10分钟内检测到I级空间扭曲现象，扭矩3000rd1。
//摧毁前1分钟环境温度变化量：-557℃
//
//信号源：AOO-383RE-04
//终端：meg#C-383-DF400-E
//时间：2022年5月7日02:24:33
//火源距离此处460米，部分功能已关闭，进入防火状态。
//环境温度变化量：+170℃
//高温II级预警
//
//收到来自AOO-383RE-03的信号。内容如下：
//监测站被摧毁。
//摧毁前约5分钟内检测到I级空间扭曲现象，扭矩[数据溢出]。
//摧毁前1分钟环境温度变化量：-540℃
//
//经过后期统计，截至2022年5月7日12:00，M.E.G.所设立的五座监测站全部被摧毁。大火已蔓延至原森林区边界5千米以内。
//
// 
//鉴于以上事件，M.E.G.最高层内部于2022年5月7日14:00召开紧急会议。将“三川矿场”内的所有人员及高价值物品撤离。
//
//二
// 
//
//生存难度：
//等级 5e
//
//不安全且不稳定
//环境污染
//已归档C383-3.jpg
//Level C-383在2022年5月20日之后的景象。
//
//Level C-383是后室C层群的第383层。
//
//描述
//Level C-383已经在一场带有超强扭曲空间力的大火事件后被摧毁。组成地面的是一种极其坚硬的黑色物质和黄色物质，其构成成分未知。这种地面向层级中心绵延约2千米左右，形成一个圆形区域。圆形区域外的一切空间均为虚空。
//
//Level C-383内不存在昼夜循环，内部始终保持着来自未知方向的、昏暗的亮光。在此地停留超过30分钟的流浪者会自燃，这种自燃不会出现明火，而是展现出身体在“崩溃解离”的现象。且无法以任何方式停止或逆转这一过程。
//
//基地、前哨与社区
//Level C-383的所有基地已在大火事件前全部被紧急撤离。目前Level C-383没有任何基地、前哨或社区。
//
//入口与出口
//旧档案记载的所有入口均已失效。
//使用紫钥石在Level C-382和Level C-384可以来到本层级。
//离开本层级，只能原路返回。
//补充附录
//- 隐藏
//德尔塔在2022年5月31日从龙血族内部收到的一封信件。内容很短，但基本揭示了大火事件发生的原因。
//
//亲爱的德尔塔姐姐：
//
//你好。
//
//我是奥密克戎，这封信是由我们的另一位兄弟帮我代写的。你离开我们已经很久了，虽然我并不知道你去了哪里，但希望你能保重身体。
//
//“大洪水”现象愈演愈烈，新一轮的天灾似乎又要发生了。我的预言告诉我，最近有许多空间发生了异变，它们要不变得更加恶劣，要不就直接消失在了虚空之中，只有尚未从“方舟”落下的空间们才幸免遇难。可是一直这样下去，难免会波及到我们的族群，因此只有提醒每一位龙血族的成员去到更安全的地方，才能最大程度的减少我们的伤亡——直到我们发现控制“后室”的方法的那一天。
//
//你知道吗？其实所谓的后室，已经差不多是一具“尸体”了。它失去了自我意识，变得混乱而无序，任由虚空蚕食它的本身。那些可怜的人类，把它身上的组织用所谓数据库拼起来……呵，“拼尸”又有什么用呢？一切只会向混沌发展，弱小而愚蠢的虫子没有神力、不懂变通，迟早要变成尸体的陪葬品罢了。而我们终将能找到让这副残缺的尸体重新动起来的方法，那时的我们，一定会成为这里的主宰——这是我们注定的命运。
//
//所以，为了能看到那一刻的到来，请你一定要照顾好自己，尽量保持与组织的联系，始终站在我们这一边。胜利的天平正在向我们倾斜，一切都会按照预言的内容顺利进行，我无比期待着那个光明世界的到来！
//
//奥密克戎
//
//
//作者信息
//« Level C-382 | Level C-383 | Level C-384 »
//
//脚注
//1. 一种权衡扭矩大小的单位，扭矩越大，空间越不稳定。目前，M.E.G.能制造出的人工空间扭曲现象所产生的扭矩大小约为120rd。
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1383{}