//Level C-354
//评分: 
//+9
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//Level C-354是后室C层群的第354层。
//
//photo-1533719791354-582f7a7e136e?ixlib=rb-1.2.1&dl=echo-grid-hQqIMb4uML8-unsplash.jpg
//"Level C-354的走廊"
//
//描述
//Level C-354是一组错综复杂的走廊结构。该层级拥有立体结构，其不同楼层被楼梯、通风管道和数量稀少的电梯所连接。该层级整体环境都仅有低强度的光照，而这些光照似乎总是从流浪者的视角中发出。1如果流浪者没有使用光源，则他们的视野仅有5米左右。
//
//在该层级中存在如下现象:
//
//该层级的空气中总是会有白点闪烁，类似于使用手机拍摄视频时的出现的噪点;
//如果流浪者久未眨眼，则他的视野会出现类似“画面失真”的效果。
//如果流浪者旁边有从前厅带来的电磁波源(包括手机、对讲机等)正在发射信号，则他有可能暂时失明，直到他距波源足够远或波源停止活动。
//我们推测该层级拥有将人眼部获取的模拟信号转换成数字信号的能力……不，我猜，或许我们的眼睛已不再是自然的结构了……
//(来自M.E.G.驻Level C-354基地“先驱者”探索小队队长Malkov)
//
//
//在该层级中，走廊的尽头或两侧有时会出现房间。各种物资在这些房间中生成，包括但不限于:
//瓶装杏仁水(多)
//皇家口粮(少)
//火盐(中)
//瓶装闪电(极少)
//早期数码相机(常见)2
//备注:使用本层级生成的数码相机拍出的所有照片都表现出不同程度的失真或异常。根据多数流浪者的描述，很多照片“令人不寒而栗”。
//
//在2016年首次有流浪者进入该层级以来，越来越多的异常现象报告不断出现。
//
//事件“2016-12-13”
//M.E.G.驻Level C-354第5分站，层级标准时间19:32
//有人员汇报，在总部所在的走廊的一端出现了大批钝人。总部立即派遣武装力量前去镇压。武装分队返回后，队长Colney汇报:
//“此次行动无人员伤亡。我们赶到的时候，钝人没有表现出攻击性。当有人向它们开火时，他们竟然没有受到任何伤害。过了5分钟后，它们却自己消失了。”
//其他人员的说辞与队长Colney的相近。
//
//
//
//本层级的实体种类多样，但不常见。目前已有笑魇、无面灵、死亡飞蛾、悲尸、钝人等被观测到。但似乎被本层级的特殊效应所影响，以上的实体均无法对人体造成伤害。
//基地、前哨与社区
//M.E.G.驻Level C-354基地
//由235名人员组成。掌握总部附近200m以内的详细地图和物资情况。
//尝试在该层级建立稳定的秩序，并尝试利用该层级的资源。
//入口与出口
//入口
//从Level 1的任意走廊切出都将把你送到此层级。
//在Levle 11某地下室中的一台电视中切出后，你会来到此层级。
//出口
//目前没有已知的方法离开此层级。
//收起
// 
//
//生存难度：
//等级 5
//
// 
// 
// 
//Level C-354是后室C层群的第354层。
//
//描述
//自从事件“2017-2-28”发生之后，Level C-354的环境不再具有良好的生存条件。Level C-354仅由材质不明的，灰色的坚硬地板、迷宫式排布的墙面以及具有特殊效应的空气组成。在事件“2017-2-28”发生前夕，几名M.E.G研究人员正试图使用光学显微镜观测一个数码相机。然而，研究人员在不断调整放大倍数时发现，显微镜成的像由像素组成，而这些像素都为5μm×5μm的规格。研究人员随后发现，本层级的一切物体(包括流浪者本身)都显示出此效应。研究人员Sarah将这种效应比喻成“一个三维的全息显示屏”，每一个5μm×5μm×5μm空间中的空气都为一个像素点，“也许是将真实的物体转换成类似像素的结构，然后呈递给我们的视觉系统。”
//
//而对于“假实体”现象，研究人员则认为它们只是该层级制造的某种影像。至于该层级如何获取这些影像，尚不得知。
//
//事件“2016-2-28”
//M.E.G.驻Level C-354基地第五分站
//2016年2月28日，一名男性流浪者Alex报告分配给他的食物无法食用，理由是“根本碰不到它，它从我的手中穿过去了”。此外，各种在Level C-354中搜集到的物品也无法使用。起初M.E.G.补给部门的前台员工认为这起事件只是恶作剧，故并未理睬。不久越来越多的流浪者报告该问题。3部门人员这才做出反应，开始调查。
//根据调查结果，事件的发生时间似乎与事件发生的位置有着一定的联系:在M.E.G.为本层级划定的“方向参考系”下，南部地区的事件似乎总是比北部的早发生; 而同一地点，不同楼层发生的事件也总是同时发生。持“全系显示屏”观点的研究人员认为，这种规律似乎与计算机屏幕的扫描更新类似，但其真实原理并未确认。M.E.G.指挥部随后开始制定紧急计划，动员一切力量，不惜一切代价找到层级的出口。
//
//事件2017-3-19
//M.E.G.与处于本层级的流浪者们始终未找到切出方法，每天在本层级因为缺失食物或水而出现的伤亡数正持续攀升。本层级中的犯罪势力开始抬头，并且试图捕食其他流浪者。M.E.G.高级管理者Evan因无法承受罪恶感而自杀。长达一个星期的时间，M.E.G.所有的权利机关尽数瘫痪。
//到了3月19日，流浪者之间开始流传关于人员“无法接触”的传言。被该事件所描述的效应所影响的人员将不会对外界做出任何规律性应答，仅会在层级内随意漫游(包括穿过墙壁)。笔者本人的亲戚也经历了此过程，导致笔者当时极度悲痛而昏厥
//“迟早会结束的，不是吗？”
//
//基地、前哨与社区
//在该层级中没有已知的基地、前哨和社区。
//
//入口与出口
//入口
//从Level 1的任意走廊切出都将把你送到此层级。
//在Levle 11某地下室中的一台电视中切出后，你会来到此层级。
//出口
//未发现有效的离开方法。
//
//作者信息
//« Level C-353 | Level C-354 | Level C-355 »
//
//Footnotes
//1. 然而，流浪者并不能互相观察到从对方视角发出的光线。
//2. 几乎每个房间都存在一架
//3. 值得注意的是，此前层级中的白色噪点的数量持续攀升，而到这一天达到顶峰。
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1354{}