//生存难度：
//等级 0
//
//安全稳定
//实体绝迹
//过渡层级
//评分: 
//+20
//+
//–
//X
//
//Level C-306是后室C层群的第306层，通常被称为“C306次航班”或“休息室”。其被认为是流浪者在两个层级之间进行切出中途可能会进入的一个“过渡层级”。
//描述
//客舱
//%E5%86%85%E9%83%A8
//机舱内部图片。
//
//Level C-306为一架普通的小型民用喷气式飞机，型号未知，燃油似乎是无限的，其内大多文字由汉语书写，少量为英语。该层级似乎不接近前厅任何一个型号。Level C-306共有50排座位，每排有6个独立座位，第三个与第四个之间有一条可供通行的走廊。值得注意的是，该层级无任何舱门。
//
//Level C-306座位宽约80厘米，被蓝色的布料覆盖。每个座位背后均有一个可升降的桌板与一个装有呕吐袋，以及一本内容均为空页杂志的空间。座椅可升降，只要按住扶手按钮并向后靠便可。
//
//IMG_20220802_121833_1_edit_279476314358916.jpg
//窗外的景象。
//
//
//Level C-306接近机顶之处每一排均有一个似乎用来放置行李的空间，同一区域有一个显示屏以及三个可打开的灯，显示屏在随机时间其会弹出播放乱码视频。
//
//Level C-306的窗外永远保持为夜晚状态，除写有“C306”的机翼外无法观测到任何事物。
//
//驾驶区
//通向驾驶区的仅有一扇门，已被证实无法进入。待研究。
//
//尾舱
//尾舱在层级末尾，其有一定数量的储存箱，可直接打开。以下为会出现的物资。
//食物饮料
//
//啤酒、可乐一类的饮料及面包、意大利面等食物。
//医疗用品
//
//绷带、药膏等，也有杏仁水。
//在关上箱门的数小时后会刷新物资。
//
//值得注意的是，层级内的物资无法被带出，但其补充的能量可以带出。
//
//厕所
//厕所在尾舱旁，其内有一个普通的冲水马桶，目前尚不明确水流冲向何处。
//
//社区，基地与前哨
//乘客
//
//切入该层级的流浪者。流浪者在该层级内一般会选择休息与补充能量。
//C306管理者
//
//%E5%B1%8F%E5%B9%95%E6%88%AA%E5%9B%BE%202022-08-03%20093514.png
//“C306管理者”标志。
//
//一个维护层级的安全稳定，防止有乘客进行破坏、维护层级清洁的团体，仅有6人。他们称自己“无法离开Level C-306”，不确定是否真实。他们似乎发现了驾驶舱的事实，但不愿透露。
//入口与出口
//入口
//
//在任意层级切出到达另一层级时1，有较小概率会陷入睡眠并在该层级任意座位醒来。
//出口
//
//再次睡眠会来到流浪者进入Level C-306前原本的目的地层级2。
//其它内容
//收起
//C306乘客须知3
//
//欢迎您来到Level C-306，也就是C306次航班！为了让广大流浪者都能在其中度过一段舒适的时光，我们特意编写了这一公告。
//“C306管理者”是什么？
//我们是C306管理者，负责维护本层级（或者说本航班）的安全、稳定。我们深知若本层级无人看管，后果将相当严重。我们无偿为您服务，但请您不要肆意妄为，否则您将受到处罚。
//乘客守则
//维护层级环境，请勿乱扔垃圾。请为其它流浪者带来清洁的环境。
//严禁破坏层级设施，违者没收其物品。这可能导致层级损毁。
//飞机有时颠簸，请勿在客舱长时间走动。您可能摔倒受伤。
//除非乘客情况特殊，请勿过多拿取物资。
//请勿与人争执、打斗。
//进入层级请收起武器。
//不要试图进入驾驶舱，违者驱逐。
//不要试图了解驾驶舱的信息。
//如果有C306管理者向你透露驾驶舱的信息，请无视并告知我们。
//以上。
//祝您度过一段愉快的时光！
//来自：C306管理者
//
//M.E.G.补充说明
//
//截止目前，这一组织4相对友好，没有任何异常行为5。然而仍请保持警惕，他们的目的不明，具体身份不明，也不能确定是否的确无法离开Level C-306。作为Level C-306实际的控制者，他们随时可以置流浪者于死地。若您发现了他们的异常行为，请及时联系我们。
//作者信息
//« Level C-305 | Level C-306 | Level C-307 »
//
//Footnotes
//1. C层群相对几率更大。
//2. 若流浪者使用特殊手段进入层级（如使用后室地铁），将回到一个随机安全层级。
//3. 此条例被该组织强行执行。
//4. 指“C306管理者”。
//5. 关于他们对驾驶舱的了解除外。
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1306{}