//Level C-382
//评分: 
//-4
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//e89f1b5698276032.jpg
//Level C-382的外部影像，摄于该层级的稳定状态。
//
//描述：
//Level C-382是一座依山而建的藏传佛教寺庙，建筑面积在八万亩左右，有各种房屋数百间。
//
//该层级气温极低，常年维持在-10℃到-40℃之间，偶尔会出现积雪现象，气候干燥，昼夜等长，每24小时为一天。
//
//该层级气压很低，大约只有0.6个标准大气压。
//
//该层级极为贫瘠，几乎不能发现任何可供利用的资源。
//
//山体
//该层级的山体以岩石为主，土壤、植物几乎不存在，面积极为广大。
//
//寺庙
//寺庙是该层级的核心部分，可以发现这一部分已经相当破旧。
//
//在寺庙周围，有转经轮八百八十八座，内部填满草绳。
//
//在寺庙的正门两侧，可见用藏满汉蒙文书写的“极乐慈悲真活佛，人间不坏长久住”字样。
//
//如果试图进入主殿，须先爬上石阶八百八十八级，叩头八百八十八次，念诵佛经八千八百八十八句，主殿大门才会打开。进入后可见一高约十八米的黄金佛像。佛像坐莲花宝座，袒胸露乳，右手持鞭，左手托一骷髅头，胸前挂骷髅挂珠，腹部有形似大肠之纹理，身披人皮袈裟。
//
//在佛像后可见一地下室的入口，进入后可通向监狱部分。监狱阴暗寒冷，恶臭扑鼻，破棉絮堆积于角落其中陈列火炉、皮鞭、烙铁、夹板、站笼等刑具，偶尔可见火炉上正加热热油，又见人手、人脚、人皮、人头、人眼、人心、人耳等整齐排列。
//
//主殿两侧又有银塔、扎仓、康村等建筑，内皆空无一物。
//
//寺庙中又有密室，存放舍利、金银、兵器等物，密室位置时常变化，原因不明。
//
//寺庙东部有一庄园，方圆数百丈，院内有花草山石喷泉装饰，其中花草已经枯死。建筑甚多，有酿酒坊、磨坊、经堂、会客厅等。其中主卧内有珍奇古玩不可计数。主楼有一密室，存有人骨成堆。
//
//庄园后乃是农奴院，有房屋十数间，无门窗，仅有一火炕一便盆，仅能卧榻，阴暗潮湿，臭气熏天，不见天日。
//
//寺庙内常有哀哭之声，令人惊慌战栗，不知其源。
//
//基地、前哨与社区：
//一个隐秘的废弃社区
//这是一座面积在4000平方米左右的石制仓库，距离寺庙十五千米远。仓库内有大量封死的牛皮口袋，每个牛皮口袋里都装有一到三个不等的风干的人类尸体。这些牛皮口袋在地面上整齐摆放，形成了一种奇异的图案，这个社区的成员似乎是试图利用这些尸体进行某种仪式。
//
//入口与出口：
//入口
//进入Level 140内的小屋有可能使你来到这一层级。
//进入Level C-20内的一条隐秘隧道可来到这一层级。
//出口
//在转经轮前静坐十五分钟可使你切出到某一层级，但是要注意，大多数情况下采取这种方式离开的流浪者都会到达生存难度4以上的层级。
//点燃层级内任意建筑，走入火堆，你切入到生存难度2以下层级的概率会大大增加。
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1382{}