//Level C-327
//评分: 
//+11
//+
//–
//X
// 
//
//生存难度：
//等级 2
//
// 
//地形危险
//环境不宜
//Level C-327是后室C层群的第327层。
//
//描述
//在该层级创造任何可见光都会导致探索者返回原层级，因此对此层级探索均在无光环境展开1。这导致大量探索问题，加之该层级地势较为危险探索进度缓慢，目前有详细记录的区域仅切入区域及周边区域。
//
//自然环境
//该层级目前探索的大部分区域近似前厅喀斯特地貌地下溶洞：空气较湿润但流动性良好2，平均气温20摄氏度左右。
//
//地面主体由被流水侵蚀和沉积作用用的凹凸不平的石灰岩构成，水流溶蚀导致该层级地势落差极大，加上缺少光照条件以及地面湿滑等恶劣环境的因素导致未探索区域频繁发生失足摔落事件。
//
//地面和洞穴顶可摸到大量生长中钟乳石，滴落的水会汇聚成小溪流汇入部分区域的地下水潭。水源和空气的来源目前尚未被探明，但化学分析确定他们可以正常的被人体摄入而不产生危害。
//
//尽管整片区域的水汽含量大致相当，但是以切入点3为界限越向下的区域越容易出现大规模积水。向上的区域则较为干燥，部分地面会生长有少量真菌类和近似苔藓类的生物。值得一提的是尽管下方较深却并未展现出因上方压力而质变或是坍塌的情况4。
//
//人文环境
//该层级存在大量年代久远的古建筑构成一座具有完整功能的城市，绝大多数基础设施都保存完好，包括道路、居民区、农田等，城市的主体结构有较为粗大的钟乳石雕琢形成，相比起普通的石灰岩有更高的材料强度，关于城市修建者的详细内容以及进一步的考古发现请移步“文化发现”段落。
//
//在原有城市的基础上后来的居住者们逐渐构建起一套相对完善的城市体系，依靠数百条锁链贯穿整个城市，进入此层级进行交易或是生存的流浪者都需要尽可能摸索着锁链前进以防止发生危险。
//
//生物5
//除了人类外该层级还存在着大量生物构成完整的特殊生态体系：这些生物中绝大多数的外观都和前厅中生物类似6，但感光器官都被退化，取而代之的是灵敏得多的听觉和嗅觉。
//
//由于地穴生态系统能量较少而且地形差异巨大，毒液一类捕猎并不现实，因此绝大多数生物都进化成体型小无毒但有尖利爪或牙的生物。尽管单只很难造成威胁，但是如果集群攻击或是在某些较为危险地形下突然受到攻击还是很容易引发意外，建议提前做好预防措施7。
//
//该层级的真菌起到近似普通生态链中生产者的地位，带出样本化验确定其可以缓慢侵蚀岩石并吸收岩石融化在水中产生的少量的能量，也记录到用水流代替身体内循环机制的类植物和少量近似于奶茶珍珠的微生物能够在常温下直接分解水以获得能量，但获得的能量比奶茶珍珠要高的多，推测这是奶茶珍珠的基因模板来源。
//
//除人类以外有大量有识血肉也来到这个层级，尽管无法确定他们的具体人数但有大量流浪者的报告，在探索过程中触摸到类似有识血肉有机物建筑的肉质，值得一提的是，有识血肉建造的连接巢中有可以通向其母层级的血肉腔道，从其中进入者将不会返回原有层级，这似乎是该层级唯一被记录的实体种类，似乎不会生成其他的实体。
//
//文化发现
//对于保留的文化遗迹进行进一步探索后探索者们对这里原本的文化风俗进行了还原，目前能确定这个城市最早的修建者应该来自云贵高原一带，其文化特点中明确展示了前厅中国高山区域少数民族聚落的文化风俗习惯。针对其文书的进一步解读显示这些人名确实来自云贵高原地区，推测是当地少数民族后代。
//该文明有大量石碑详细完整的记录他们一族的历史，但由于生存环境突变其文字经历了剧烈的变动，似乎从最初的象形文字转化成为了方便雕刻而使用的短平直符号，但原本象形文字遗留的大致结构以及较为混乱的叙事结构组，最终导致其语言在结构上极其混乱只能尽可能推测其含义。
//
//历史
//目前翻译结果认为：当地居民似乎来自前厅中云南地区的某个少数民族，为躲避战争而举足逃入洞穴深处，但是在洞穴中躲避一段时间后试图返回时却发现已经失去原道路。在最开始的混乱平息之后当地人在这里站稳脚跟并逐渐开始探索。
//值得一提的是这段记录中明确提到当地人是可以使用火焰的，他们并不会因为制造光亮而离开此层级，在房屋中发现的灶台等设施也证明了这一观点，推测是因为其进入层级是该层级而并非大多数探索者进入的层级。
//
//他们在这一层级逐渐发展出自己的文明和城市，存在了超过10代人对该层级的物资分布、生物习性等内容有相当详细的记录。值得一提的是，其中发现了数种之前从未记录过的物品，包括一个能让人双眼变成金黄色的液体，一个符号是“门”加上一些修饰性词语的特殊未知物品，一种能引发强烈爆炸的黑色粉尘等，但这些物品目前没有找到实物。
//
//早期探索者提到该层级物品为统一收拾去，且并末发现城市周围有处于墓葬区以外的尸骨所以推测这一族处于自行离去，目前离去方法及去向尚不明确。但是根据其中一些C层级发现失落一族营地中存在有与城市记录相似的文化符号推测这些人有可能已经加入当地失落一族并被对方同化。
//
//技术
//尽管该文明大多数技术落后，但对于某些物品的特殊运用方式却是人们通常没有想到或是尚未付诸实践的，遗留的很多壁画上记录着独特的物品使用方式，研究者进行进一步研究后总结出一系列确实可用的内容，比如将布料草药和部分火盐制成一种可以有效祛风湿的小包，通过一种特殊矿物质让杏仁水形成类似豆腐的凝固物质，一种在粘土中加入蓝砂的特殊制造技术等。
//
//推测
//关于这一部落的发现引起一系列争议：如果这些部落记录的文字确实属实的话很可能切入也可以发生在大型群体中，并且入口不再被恒定于最初始的几个层级，但是就如同曾经在其他层级发现会自然生成有记录的物品一样，没有人敢确定这究竟是随机生成来自前厅的畸形幻想，还是他们真正存在在这片土地上……至少曾经。
//
//不过说起来，如果我们死去，恐怕我们也没法向其他人证明留下的到底是真正由人所做还是随机生成吧，好好活下来啊。
//
//特殊效应
//Level C-327目前没有表现出任何特殊性质，但是由于其内部常年无光环境，大多数有正常视觉者进入后会感到恐惧，出现一定程度的妄想和幻觉，这些都是正常现象。如果感觉严重不安或是幻觉已经影响到正常生活的探索者请尽快离开或是前往有识血肉连接巢购买精神稳定药物。
//
//物资
//Level C-327存在着大量的物资，该层级的大多数生物本身无毒，且由于缺少光照有一种独特的口感，除此之外一部分洞穴顶部滴落杏仁水，甚至有固定的开采点，会定期产出地下的杏仁水，一部分中午石柱的内部也可能存有蓝砂和火盐之类的矿藏，尽管考虑到结构完整性不能长时间开采但是仍然能保证维持整个基地的运转。
//
//基地、前哨与社区
//无光的人们
//由于该层级独特的环境，这一层的目盲者和普通人能平等的生活，因此这一层有大量因意外或疾病致盲的流浪者以及患有严重眼疾的流浪者，这些人们在这里定居，学习曾经遗留部落的文化，通过出售当地特有的农作物以及矿石来维持稳定贸易。
//
//有识血肉收集巢
//层级特殊环境在对于可以改造自身基因和外表的有识血肉面前作用较小，加上该层级丰富的自然物资，有识血肉在这里建立了大型采集巢穴，有许多拥有声波定位或者灵敏触觉的个体在此层级生存，他们也向流浪者提供贸易活动和医疗服务。
//
//交通转移网络
//该层级特性。确定后有一部分组织开始试图在自己的基地中建造完全封闭的无光空间来到达该层级，在该层级进行物资交换后重新制造光源离开来完成较为安全的小宗物资交换。
//
//网络情况
//层级网络信号极差，即使在较为开阔的洞穴也似乎经过多个障碍物阻挡导致信号只维持在0.1MB/秒以下，大多数区域没有网络信号，同时绝大多数情况下开启手机行为会创造出光亮使探索者直接返回原层级。
//
//入口与出口
//入口
//当周围环境光照少于0.1流明时流浪者会自动到达此层级切入点区域8，判断自己进入此层级的方法包括触摸到粗糙岩石地面和感受到新鲜水气。
//在至少一次成功进入此层级后，只需要在光照少于1流明的区域闭上眼睛即可成功到达此层级。
//出口
//在自己身边用任何物品制造出一片亮度超过0.1流明的光照区域，便可以借助光照区域看到自己仍然身处原本所在的位置。
//在征的有识血肉的同意之后，可以前往其巢穴并通过巢穴中的一个类似腔道的结构前往其母层级。
//推测在某个区域有曾经遗留文明提到的出口，但是目前尚未找到。
//发现记录
//目前已知最早的发现记录是一次U.E.C.针对M.E.G.档案库的突袭行动。该行动导致档案库设施停电，有超过15名工作人员被困于地下设施中。
//
//在电力恢复后进行体检时发现受困者身上有受到岩石刮擦的伤痕并从伤口中提取出石灰岩碎屑，同时这些人员也反映自己当时并没有感觉到档案室平整的地面和机械设施，而是感觉自己处于一个阴暗潮湿的洞穴中。
//
//由于伤口中提取出的矿物被确认不可能出现在档案室，因此否决的是幻觉的可能，随后针对当时环境的一系列复原实验最终成功证明该层级的出入方式。
//
//作者信息
//Footnotes
//1. 夜视设备接收端屏幕同样会发出光亮触发此层级效果，导致探索者返回
//2. 对于深层洞穴系统来说很不正常
//3. 在这一层是较为恒定的区域
//4. 但下方确实积水较多，推测最下方已经完全被积水淹没无法探索
//5. 包括实体和非实体
//6. 包括大量两栖动物、节肢动物和少数哺乳动物
//7. 比如喷洒驱虫的化学物质或是佩戴能发出尖利噪音以恐吓周围生物的哨笛等
//8. 这通常需要一片完全封闭的空间或是进行多重遮光处理
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1327{}