//Level C-305
//评分: 
//+28
//+
//–
//X
// 
//
//生存难度：
//
//等级 1
//
//安全
//稳定
//极少量实体
//Level C-305是后室C层群的第305层。
//
//描述
//oUr7wjYN9X4QuHl.jpg
//凌晨04:30的街道。
//
//Level C-305是一条无限延伸的现代化街道，宽约20米，两侧带有人行步道。该层级内的时间永远停滞在凌晨04:30，可根据层级内部随处可见的钟表得知。尽管如此，外来的钟表在该层级内依旧可以正常运转，流浪者也会以正常速度衰老，食物腐败等现象依旧会发生。该层级的天空永远呈现深邃无云的灰色，无法观察到星星、月亮等天体。该层级内部的温度偏低，约为16摄氏度。
//
//层级内部存在较为稳定的Wi-Fi信号，并且已被证实不存在任何敌对实体，属于宜居地带。
//
//街道两旁布满了各类建筑，包括但不限于居民楼、便利店、诊所、旅馆等，且有着完好的供电设施，然而并不清楚电源为何。这些建筑之间紧密连接，不存在任何缝隙；且排列顺序、楼高与面积皆为随机决定。几乎所有建筑都仅有一个出入口，必然面向Level C-305的主街道。建筑的标牌、门牌及其内部的所有文字皆使用汉语或英语书写。除此之外，在街道的两侧，每隔约十二米就竖有一对路灯。
//
//便利店是该层级内分布最多的建筑，通常为单层，内有收银台、货架、储物间等设施。根据便利店规模的不同，其内会自动出现食物、工具、日用品等补给，并且会不定期刷新。少数规模极度庞大的便利店可与小型超市相比，往往会有流浪者定居其中。
//
//进入Level C-305后，流浪者将会统一出现在街道中的一栋17层居民楼内，该楼也被暂定为层级的中心，亦称“中心楼”。“中心楼”是该层级内已知唯一拥有多个大门的建筑。该层级内最大的社区“夜猫子之家”便驻扎在这一居民楼附近。
//
//基地、前哨与社区
//“夜猫子之家”
//由M.E.G.官方组织的流浪者社区，有大约400人常驻。
//他们欢迎新来的流浪者加入。
//社区范围内包含大量便利店、诊所、电子设备商店与书店，足以为其成员提供相对安逸的居住环境。
//治安情况一般。
//新康商城
//Level C-305内的另一个大型聚居点，目前有接近200人居住。
//主要活动范围在“中心楼”之外四公里处，一栋名为“新康商城”的五层大型超市。
//自给自足，与“夜猫子之家”并无太多联络。
//零散流浪者据点
//因为Level C-305内的环境安全、物资丰富，有许多流浪者选择在此定居。
//他们的居所分散且不固定，通常规模不会太大。
//已统计到的该类流浪者约有300余人。
//入口与出口
//入口
//从Level C-126的第74节车厢切出，即可抵达该层级。
//在Level C-244内，从商场走出，沿着夜路继续行走。一段时间后，周围将会突然出现大量建筑，其中包含“中心楼”。此时流浪者便进入了Level C-305。
//在Level C-407内找到一张写有“04:30”字样的床并睡眠三小时，苏醒后流浪者将出现在“中心楼”内的某个房间中。
//在Level C-138的石碑附近入睡有小概率进入该层级。
//出口
//从“中心楼”的不同大门离开，即可离开该层级。其中，一号门通向街道。
//二号门通向Level C-169。
//三号门通向Level C-238。
//四楼的逃生出口通往Level C-&。
//通往十七楼天台的门实际上会将流浪者带入Level C-47。
//你拉开了一辆出租车的后门，心不在焉地坐了进去。
//
//Level C-305内的天空一如既往地漆黑。你原本并不算是一个习惯于熬夜的人，但是在凌晨四点半度过了将近半个月的时光之后，任谁也会对这片夜色感到熟悉。
//
//好在这里还有房子。你心想。好在路灯和招牌都是亮的——至少自己还没变成瞎子。
//
//虽然你颇有一些怨言，但难以否认的是，Level C-305确实是一个安全的地方。在掉入这现实与幻想糅杂的错乱迷宫之后，这里是你抵达的第一个宜居之地。
//
//这也就不难解释为什么你的朋友最后选择要留在这里——并且还邀请你一起驻足。没有人会在有能力安逸的情况下，开启第二次冒险。应该没有吧。不过说他是朋友也有点勉强，毕竟你们只是无意间在这片地狱相见，并短暂同行了数十天罢了。直到刚才，你的戒心也没有完全放下。
//
//他加入了新康商城，不出意外的话，可能一辈子都会留在这里。这种想法未免有些草率——但貌似还真是最好的选择。自称探险者总署的“夜猫子们”告知了你们关于出口的信息：时空错乱的日本乡村、让人发疯的小房间、无边无际的黑暗学校。这听起来完全不是什么善茬，你不得不开始纠结是否离开这里。
//
//你甩了甩头，将纷乱的思绪抛诸脑后，合上了车门。
//
//实体
//Level C-305内仅会出现一种实体，即无面灵。无面灵在该层级内以轿车司机的身份出现，较为稀少，但的确存在。在空闲时间，司机会开着小轿车在该层级内来回，也有可能停靠在路边暂歇。层级内所有的车辆都配备有一名司机，其绝不会离开自己的车，也不会让别人坐上驾驶位。
//
//司机通常都是温顺的，但如果有人试图抢夺它的车，司机会表现出相应的反抗，必要时可能会杀死冲突者。
//
//在正常情况下，司机对流浪者非常友好。流浪者可以直接拉开停在路边的轿车坐下，向司机提出“开向某地”的要求，司机会无条件答应。流浪者也可以拦下正在行进的轿车、或是与其他人拼车。不建议与司机产生冲突。
//
//司机将头转向了你，那张没有五官的光滑面孔让你感到一阵恶心。
//
//“去哪里？”
//
//他的嗓音听起来倒柔和得多，像是一位儒雅的中年男人。这使你稍微好受了一点。你将脸转向窗外，尽可能避免与司机对视。
//
//“随便。带我兜个圈子，最后再绕回来。可以吗？”
//
//“可以。”
//
//司机爽快地答应了。他的手指在仪表盘上飞快按了几下，你感到腿边吹来了温暖热风。他们还有空调。你想着。挺不错的。
//
//阴冷的气氛很快一扫而空，车内的空气变得湿润而温暖。你向后躺在椅子上，眯眼望向窗外。司机开得很慢，于是你能够一个一个阅读外面的招牌。这种行为让你有一瞬间感到了某种惬意，就仿佛紧绷已久的神经终于得到了舒展。
//
//你想起了小时候，自己经常坐在父亲的车里。父亲下班很晚，你常常要在学校等到天色渐黑，他才会开着车姗姗来迟。你总会因为这件事和他发火，但父亲只是沉默地牵着你的手上车。晚上老是堵车，所以父亲开得总是不快——于是百无聊赖的你就会开始一个一个默读窗外的招牌。
//
//大运烟酒行……莲花超市……爱康来诊所……更多的则是没有名字的小买铺。
//
//真是荒谬。这些名字都是谁起的？大运烟酒行，店主叫大运？你很清楚这里没有店主。这些商铺被零落地摆放在这儿，就好像创世神是个小孩儿，从现实世界里胡乱拷贝了一些建筑，一股脑地丢在了这条大街两边。无限延长的街道……自己在这个活见鬼的地方待太久了，甚至都不觉得这是什么反人类的东西了。荒谬至极。
//
//“……是的，我是你们的老朋友，小文。今晚我们将继续讲述昨天的故事……”
//
//直到这时，你才后知后觉地听到了严重失真的话语声从前排传来。司机不知何时打开了广播，只是方才你想得有些出神，没有注意到这件事。
//
//司机似乎发现了你的反应，随口问道，“顺便听听广播，你要是不喜欢的话……”
//
//“不用了，就这样吧。”
//
//你松了一口气。虽然不知道这是哪门子的深夜电台，但至少也算沾点烟火气。你已经很久没有听见过有人用这么轻松的语气讲话了。
//
//街道依旧在向着远处的黑暗延伸，司机再度陷入缄默。你换了个舒服点的姿势瘫下来，静静地注视着窗外。一层蒙蒙的雾气已经笼罩住了车窗。
//
//附录
//M.E.G.通报
//
//日期：2022/04/22
//
//
//Level C-305中的许多报告指出，随着与“中心楼”的距离增加，建筑物内的物资数量与刷新周期会逐渐下降。
//经过长达四个月的实验，我署现已确认这一状况属实。经检测，在离开“中心楼”约50公里之后，物资的数量与刷新周期将会降至一半左右（参考数据由新康商城提供）。而在离开约70公里之后，建筑内几乎不会出现物资，通电状况与Wi-Fi信号也大幅减弱。
//
//与“物资衰退”同时出现的另一情况为建筑物的破败。随着远离“中心楼”，建筑物的外观与内饰也会出现变化，通常会变得越来越破旧、内饰越来越少。
//
//与我们合作的“司机”不愿意继续远离，因此我们的调查到此中止。可以推测的是，继续推进只会发现建筑物更加破败、甚至有可能成为断壁残垣。M.E.G.建议所有流浪者不要离开“中心楼”超过30公里，如有意外，可尝试向“司机”求助。
//
//M.E.G.通报
//
//日期：2022/06/19
//
//
//近两年内出现了多起流浪者失踪事件的上报，具体原因不明。
//M.E.G.再次强调：请流浪者不要离开“中心楼”及大型聚居点过远。如有意外，可尝试向“司机”求助。
//
//车上的广播似乎是从不同时间、不同频道的深夜电台里剪出来的。你听到几个主持人报出了完全不同的频道，提及的时间也差异巨大——有2012年的，还有2016年的。
//
//这也是创世神的恶趣味？不过对你来说倒也无所谓了。虽然是过去电台的重播，但好歹是活生生的人在说话。你半合眼睛，假装自己还在现实世界。这么做多少有点自欺欺人的味道——但你心甘情愿让自己休息一会儿。
//
//窗上的水汽越来越浓，已经看不清窗外的招牌了。橙黄色的灯光在窗上晕开，两侧的路灯隐隐约约地闪过。微弱的光线在你的眼里模糊了起来，好像一个有一个个小球在面前飘过。
//
//“近日，我省教育局局长……莅临第一实验中学，开展检查指导工作。……书记指出，教书育人是国家百年大业，也是培养未来栋梁的基石事业，必须务实‘细心学’、‘用心教’、‘开心玩’的教育理念，做好祖国园丁的伟大工作。在会后，第一实验中学将继续……”
//
//女人的声音在沙沙的噪声中温和地叙述着。你听着那些话语，却觉得仿佛什么都没听见。
//
//潮湿暖和的空气裹住了你的全身，像是躺在久违的被褥里一样。
//
//上一次这么放松是什么时候？是在掉入这片地狱之前吗？还是更早？记忆随着意识一同模糊了起来。你还记得自己坠入地狱的前一刻，完全称不上轻松。那同样是一个晴朗无云的夜晚，你开着自己的轿车——就像当年的父亲一样。又是加班到快十点，疲惫深深地刻在自己的脸上。理解了父亲当年接自己时的寡言少语，却已经过了能开口原谅的时候。
//
//你累了。
//
//
//父亲关上了广播里的音乐声，这使得你渐渐回过神来。
//
//“睡着了？”他一边问着，一边拉起手刹，让这台老车熄火。
//
//你迷迷糊糊点了点头。
//
//“我好像……我好像做了很长的一个梦……很长很长。”
//
//父亲回过头来，面孔在顶灯的光线下显得有些模糊，但依旧能看出几分疲态。
//
//“你太累了。赶紧回家吧。”
//
//他拔掉车钥匙，打开车门钻了出去。你晃了晃脑袋，跟着一起推开了后座的车门。
//
//父亲牵起了你的手，与你一同走入夜色之中。
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1305{}