//Level C-303
//评分: 
//+17
//+
//–
//X
// 
//
//生存难度：
//等级 5
//
// 
// 
//地形转变photo-1601625463687-25541fb72f62?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1170&q=80
//摄像机视角的一帧，出自第48集《狮王的回归》。
//
//Level C-303是后室C层群的第303层。
//
//描述：
//Level C-303大体样貌类似一片典型的前厅非洲稀树草原，由于该层级的异常效应影响，该层级的大部分区域都未能得到探索。
//
//Level C-303似乎是一部正在拍摄中的纪录片，因为在该层级的中心处有着一台无法用任何方式破坏或移动1的摄像机，且你可以在大部分后室视频网站上找到一系列名为“《走近自然》第一季”的纪录片，你可以在纪录片中看到以摄像机视角拍摄的该层级内部景象的历史录像。
//
//Level C-303中有着许多的野生动物，如斑马，长颈鹿，狮子等，但它们均会无视流浪者，即使流浪者站在它们身边或攻击它们，它们也不会有任何反应或受到丝毫的损伤。该层级中存在着一个雄厚的中年男性声音，它会解说摄像机所拍摄的一切，同样的，它也会无视流浪者的存在。
//
//在Level C-303中逗留是一件极其危险的事情，因为该层级的地形往往会在没有预警的情况下出现巨大的转变，如突然被放大好几倍2，突然切换至另一场景3。这可能会导致流浪者被卡在地面中窒息或是掉入巨大化的动物的口中。
//
//该层级中，距离摄像机越远，层级的结构就越混乱。摄像机远处的事物十分模糊，如同有一层蒙版遮罩一般，一直远离摄像机最终会让你坠入朦胧的地面。
//
//值得一提的是，在视频网站上，《走近自然》的上传者是一个名为“BRchannel”的无法查询到IP地址的账号。不定期更新的《走近自然》的第一集播出时间是2019年7月12日，在此之前该层级似乎是不存在的。截止至2022年5月16日，“《走近自然》第一季”已播出了89集，暂未清楚该节目是否会有第二季。
//
//基地，前哨和社区
//该层级不存在已知的基地、前哨和社区。
//
//入口和出口
//入口
//你可以在Level C-297找到一间摆有许多录像设备，墙上挂有绿幕的房间，将绿幕掀起，进入墙后的洞可以到达该层级。
//出口
//在层级变得朦胧的地区徘徊一段时间会到达Level C-69。
//作者信息
//« Level C-302 | Level C-303 | Level C-304 »
//
//Footnotes
//1. 即使移去摄像机下方的地面也不行，它会以未知原理浮在空中。
//2. 这似乎对应着纪录片中的“特写”。
//3. 这似乎对应着纪录片中的“切镜”。
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1303{}