//Level C-352
//评分: 
//+16
//+
//–
//X
// 
//
//生存难度：
//等级 4
//
// 
// 
//危险可规避
//Level C-352是后室C层群的第352层，探索该层级请注意保持安静。
//
//%E5%BE%AE%E4%BF%A1%E5%9B%BE%E7%89%87_20220731170551.jpg
//一张关于Level C-352的照片
//
//描述
//Level C-352是一座无限的巨型花园，花园中生长着一望无际的巨型真菌，多数个体的菌杆高达数百米；由于其伞盖足以覆盖大面积的土地，层级中极度缺乏光照，导致花园内部潮湿阴暗。
//
//层级中长时间弥漫着淡蓝色的浓雾，并导致可见度随着逐渐深入而降低。这意味着流浪者很容易迷失在密集丛生的菇林中。
//
//目前已证实长时间在本层级停留有罹患多种未知疾病的风险，因此不建议久留。
//
//反常的是花园内的其他较为矮小的显花植物却生长的异常繁盛，即使缺少阳光也依旧繁花似锦。且雾越是浓厚的地方花卉颜色越是鲜艳，部分个体甚至散发淡淡幽光，吸引着流浪者深入。据推断，在层级中受微光诱惑而迷失的流浪者多数已遇难。
//
//2022/7/31更新： 散发幽光的植物已被证实为实体“花卉”，请尽量远离并保持安静。
//
//该层的物资稀少，几乎不存在任何生存物资，建议在失去体力前找到出口并离开此层。
//
//“庇护所”
//此层级仅有一个可被称为“庇护所”的安全区域。目前已证实其位置每隔一段时间便变换一次，但总体而言通常出现在植被较为荒凉而光照较为充足的区域。
//
//“庇护所”出现时，该区域原有的植被都将被铲除，而阳光将能够透过浓雾照射进来并将雾气驱散。在“庇护所”内，流浪者将不会受到任何实体危害，且“庇护所”内将会随机出现杏仁水和其他有用物资。在庇护所内所有的负面状态（如幻觉，疾病等）都会因未知原因解除。
//
//“庇护所”存在的时长通常维持在3小时左右，3小时后“庇护所”将会消失，而所有植被都会恢复原状，此时阳光会再次被遮挡，雾气会再次充满整块区域。
//
//实体
//该层级环境难以生存，目前已知该层级仅有“花卉”一种实体。
//
//%E5%BE%AE%E4%BF%A1%E5%9B%BE%E7%89%87_20220731171824.jpg
//迷雾中的花卉
//
//“花卉”
//一种奇特而危险的敌对实体，外形极其类似颜色鲜艳的“花卉”，会发出微弱的光亮。
//
//该实体通常处于休眠状态，当其感受到超过40dB1的声音时将进入活跃状态。
//
//与记忆蠕虫相似，活跃状态下的“花卉”似乎能够读取流浪者记忆，然后制造并散发类似于迷迭香味的气体；过度吸入该气体会使流浪者产生多种幻觉。
//
//据多位流浪者口述，陷入幻觉的流浪者会产生回到前厅，甚至是自己已经与家人团聚的错觉，并放下警戒心，在迷幻中向层级的深处移动。
//
//该种实体无法自行移动，也无法对流浪者造成任何物理伤害，但它们似乎能够在流浪者深陷幻境时突然解除流浪者的“美梦”，突然清醒的流浪者多数会因为“梦醒”而绝望，再加上已经迷失而惊慌失措，最后在迷雾中彻底失去行动力，在病痛和绝望中死去，当流浪者死亡时，周遭的“花卉”会释放未知液体将流浪者的尸体快速分解并吸收，并在流浪者倒下的地方生长出来更多、更加繁盛的“花卉”。
//
//值得一提的是，当该区域的“花卉”过多时，其会侵入尸体的头部并接管脑组织控制躯体向其它区域移动；该形态可持续七天，此时的该实体具高度攻击性，尤其是进入活跃状态时。因此在层级中探索是需保持安静。
//
//该实体最为致命的弱点便是惧怕阳光。若该种实体长时间暴露在阳光下，很快便会枯萎并化为淡蓝色粉末状物质。这种粉末是目前唯一一种被证实能够完全治愈此层级中未知疾病的物质。
//
//除阳光之外的其他光源均对其无效。
//
//基地、前哨与社区
//本层级不存在任何已知的基地、前哨与社区。
//
//入口与出口
//入口
//在Level C-27中游荡时，有时会发现一些巨大的蘑菇，触碰即可到达 Level C-352；
//在Level C-20进入一扇巨大的木门将到达 Level C-352 。
//出口
//在进入层级10s原路返回；
//在层级深处有机会发现一扇较小的木门，进入将来到Level C-302。
//作者信息
//« Level C-351 | Level C-352 | Level C-353 »
//
//Footnotes
//1. 约为一个流浪者正常说话时的声音大小。
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1352{}