//Level C-351
//评分: 
//+8
//+
//–
//X
// 
//
//生存难度：
//等级 4
//
// 
// 
// 
//
//Level C-351是后室C层群的第351层。
//
//描述
//IMG-20220801-113955.jpg
//机场照片
//
//Level C-351表现为一座巨大城市，由于本层级的危险环境，尚未知其具体面积。流浪者来到该层级的初始地点是飞机场候机区的某个座位上，Level C-351整体上呈现出一种诡异的、令人窒息的氛围，其建筑布局十分怪异，高楼大厦和低矮平房纵横交错，有大部分的房屋因过于密集而挤在了一块。本层级自发现以来一直处于下暴雨状态却从未有过洪涝灾害发生，从飞机场的窗户向外眺望未发现任何实体存在，雨声特殊的精神影响会让流浪者内心感到平静并产生安全感，但流浪者不要因此放松警惕。受雨水影响，机场外部属于不可探索的区域。
//
//切勿接触到Level C-351机场外部的雨滴。“雨水”是一种极度危险的液态实体，对生命体具有强烈腐蚀性。当流浪者不穿戴任何雨具与“雨水”发生物理性接触时，“雨水”淋过的皮肤及其深层骨肉会从流浪者的身躯剥离下来，这通常导致流浪者失血过多而亡，且流浪者被剥离的身体组织会转化为一种攻击性极强的实体“索罗伯”。
//
//本层级的物资充足，流浪者可以在飞机场内部的小卖店里找到生存物资，如幸运豆奶、油腻棉花糖、糖果等。在自动售卖机里可以找到大量杏仁水以及其他前厅品牌的饮料，然而包括杏仁水在内，所有饮料中的糖分含量高到了不可思议的程度，因此淡水资源在本层级是种极其宝贵的物资。
//
//机场的卫生间对于流浪者来说是极度危险且不值得进入的，如果流浪者误入了机场的卫生间或水房，发现了尚未关闭的水龙头，并且闻到了刺鼻的化学物质，请立即离开当前的位置，流浪者已经中了该层级的陷阱，流浪者被溶解的组织会活过来。该层的自来水系统皆已被“雨水”所污染，直接饮用会将流浪者转化为“索罗伯”，加热状态下“雨水”会化为气态从水中逸出，气态“雨水”在空气中停留过久会逐渐消亡，在喝水之前将其煮沸是一种净化水源的好办法1。
//
//机场的部分商业设施内藏有黑色的记忆罐2、飞机模型3、行李箱（有时是空的）、罐装龙肉、好梦罐等物资，流浪者有时会在不远处听到人们嘈杂的脚步声和交谈声，这些声音具有强烈的精神污染效应，它们会干扰流浪者对危险环境的感知，从而使流浪者误认为他们从未跌入后室。如果你想弄明白机场到底发生了什么，请您前往二楼议会厅，路途中请避免机场的阴暗处，远离候机区的座位底下以及售货机缝隙，“索罗伯”可能会藏匿其中。如果有“身体组织”高速向您接近，请您不惜一切代价，以最快的速度逃离那片区域，即使是在被您“自己”追赶。
//
//
//神明赐予我最出众的形体，
//
//当我每次尝试把自己分离，
//
//我都恍惚地觉得双眼将燃烧殆尽。
//
//你会在我体内发现他们的曾经，
//
//这里精心雕刻着你的未来，
//
//今后的天气容易做梦，
//
//大雨将永恒不息，
//
//这是一个精心布置的礼物，
//
//
//                献于吾主
//
//特殊实体
//“索罗伯”
//流态实体，该实体外表呈现出鲜红色，白色、黄色条纹从胸口向四肢延伸，由生物组织和“雨水”接触后溶解活化而成。随着脱离生物体的时间推移，它们会随机长出新的五官。“索罗伯”会不断发出尖叫，并高速向流浪者接近，若被其包裹则会被当场溶解，流浪者被溶解后，将会分裂成更多的“索罗伯”。有些“索罗伯”甚至会产生智慧，成为“雨水”的信徒。
//
//基地、前哨和社区
//倾雨教团
//▲该团体基地位于二楼议会厅。
//▲人数约13~16人？。
//▲对外友好且愿意开放贸易。未知。
//▲成立时间未知。
//
//马鞍上的孤独旅者
//▲该团体基地位于机场地下三层。
//▲人数未知。
//▲成立时间未知。
//
//入口和出口
//入口
//▲在Level 36的候机区睡着有几率来到本层级。
//
//▲在Level 188捡起一张血迹斑斑的机票会被传送到本层级。
//
//▲在Level C-271的信箱里找到一封用日语所写的遗书会被传送到该层级。
//
//出口
//▲进入一个弥漫着血色雾气的登机口，一直向前行走直到雾气散去后会来到Level 14。
//
//▲吃下餐厅里的飞机餐，昏迷后会被传送到Level C-123。
//
//收起
//你好，流浪者，
//       我是目前居住于机场地下三层的幸存者，你可能会好奇机场为什么会有地下三层，实际上我告诉你，机场还有更多的地下楼层，只是还未探明。如果你正在前往二楼议会厅，请你立刻停止脚步，要想活下去，你一定要按我说的做。
//       1.丢掉你多余的行李，它们会影响你的奔跑速度。
//       2.脱掉你身上多余的衣服，这里不冷，我们也有充足的衣物资源。
//       3.从现在开始，请你无视任何条件，看到楼梯就往下跑。
//       4.当你下了一层楼，你可在防疫区找到隔离服，穿上隔离服必须保证没有任何一片皮肤裸露。
//       5.逃跑时请躲避一切水源。
//       6.远离阴暗处，它们喜欢躲藏在各种缝隙中。
//       7.你可在便利店里获得高功率手电筒，强光可以减缓它们的行动，注意仅仅是减缓。
//       8.来到地下三层，你便可以遇见我们的接待人员，我们这里有充足的食物、未被污染的淡水、强悍的安保系统以及良好的庇护场所，当然也有一些娱乐设施，我们会和你一起活下去并研究安全离开该层级的方法，但你务必确认你自己是清醒的，且到达的不是二楼议会厅。
//
//作者信息
//« Level C-350 | Level C-351 | Level C-352 »
//
//Footnotes
//1. 请勿在封闭环境下进行该操作，吸入气态“雨水”会将流浪者肺部转化为“索罗伯”。
//2. 记忆罐的内容通常与空难相关
//3. 飞机模型会在流浪者接近且未被注意到的情况下流出鲜血，并传出人的尖叫声，该尖叫声会吸引“索罗伯”，请流浪者在搜寻物资的时候格外小心
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1351{}