//Level C-326
//评分: 
//+26
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//QQ%E5%9B%BE%E7%89%8720221028224318.jpg
//对本层级主要风景的艺术化表现。
//
//Level C-326是后室C层群的第326层，是无穷多座无底的通天塔的统称，被办公室圣骑士所统治。
//
//描述
//Level C-326，被称为写字楼王国、无垠之牢笼、通天塔之国、骑士的领土，以及诸如此类的称呼。其主要由多座极高的塔楼组成，它们大多是办公楼，但也有其它的变种。不同塔楼的居民们在高塔之间建起了以桥梁、缆车、滑索组成的交通网，偶尔也可以找到连接两座塔的桥架，在通过它们时要小心。
//
//这些宏伟的巨塔只见得其顶端而不见得其底层，它们是如此之高，以至于周围只看得见如蓝天般的虚空而不见地面；当进入时，人们大多都出现在这些塔的顶端。如果你认为自己进入了这个层级的中部，那你最好放弃寻找其它流浪者的机会——于你而言，上方和下方都是无限的。
//
//偶尔，只是偶尔，会有一架只有一个按钮的电梯出现在这个层级中，你可以靠它前往顶层。那按钮上是一个无限符号。注意，普通的电梯只会连接有限多个楼层，它们可以作为在层级内垂直移动的方式。
//
//这里有日夜交替和天气现象。本层级敌意实体量较少，但不保证完全没有，建议决定探索的流浪者做好防护。
//
//主塔
//一座办公楼，它代表了后室，以及人类文明的造物所能到达的顶点。可以在里面找到很多办公用品。它也是这个层级的首都，圣骑士的宝座就位于它的顶端。
//
//许多其它塔楼也是较小的办公楼，它们被认为是对主塔的模仿。
//
//酒店
//酒店。它的顶楼是一座餐厅，由无面灵经营，但它们会要求你用餐券兑换餐食。而餐券需要在第一层的大堂那里拿——没有人，没有人去到过那里，你也最好放弃。
//
//酒店的高度也是无限的，每一个房间的编号都是一个无限符号，建议在探索时做好标记。由于打开门是需要钥匙卡1的，所以你通常进不去——你没在大堂办理入住。要搜刮的话最好带上开锁工具。
//
//如果你礼貌地要求的话，圣骑士也许会给你餐券。
//
//朽坏铁塔
//最危险的一座塔楼。这座塔由锈坏的金属拼接而成，你很有可能会陷入无限的坠落之中。实际上，如果你使点劲的话，你很有可能把它弄倒。不过，这对无穷的塔来说连九牛一毛都不算。
//
//（没有人试过把塔从中部弄倒——也许是因为塔的数量是无限的，所以你并没有弄倒一座顶层上有人的塔。）
//
//邮轮
//pexels-pixabay-163726.jpg
//宝藏之墙。
//
//由无数的集装箱堆砌而成，这座巨轮蕴藏着数不胜数的宝藏，吸引着闻风而来的流浪者的探索。每一个箱子里都装有货物，但它们之间并没有连接。流浪者们用强大的工具破坏着这座塔的结构。偶尔地，因为人们的破坏，塔会倒掉。但，和之前说的一样，这对于塔来说并没有任何意义。
//
//邮轮是很稀有的，目前只发现了一座。不过，现如今因为破坏，它的高度已大大不如从前，你需要费点力气在其它塔那里旅行一阵才能到达。
//
//杰克的豌豆
//巨大的藤蔓植物，爬在同样巨大的豌豆架上。我们不建议探索这片区域，因为它很有可能是活着的。
//
//不同于其它塔，它一直，一直延申到视线上方而无顶，从我们所在的可数无限大直到不可企及的不可数无限大的高度。不知道顶上有没有巨人，或者，有没有任何东西。
//
//骸骨之山
//较为特殊的一座塔。一座由骨头搭建而成的金字塔，它的底部直延申到虚空之中。不知它是为何而建，也不知道它为何存在，它内部是一个由阴森白骨构成的迷宫，不时可以找到已被淹没于无穷之中的君王的墓穴。
//
//进一步勘探和考古正在进行中。
//
//别墅
//这座白色的建筑由很多座白色的别墅堆叠而成，你可以在顶楼找到一个通向上一座的地下室的粗糙的活版门。（也许这更像是一座公寓而不是别墅？）
//
//这里也许适合居住。
//
//塔楼的种类还有一些，它们毕竟是无穷无尽的。
//
//办公室圣骑士亚斯明（Asmin）
//一位看不出性别的青年，梳着个蓝色的蘑菇头，打着领带。他自称是此层级的统治者。
//
//他随和、健谈，但你可以发现他似乎对一切事物都漠不关心。他偶尔会被目击到在其它层级出现并随意地游荡和娱乐。
//
//他的官方头衔包括：
//
//办公室圣骑士、巴别塔圣骑士、Level C-326之王、无限空间之骑士、办公用品的持有者、塔楼圣骑士、后室意志的仆从之一、光明骑士、后室旅者、一个和善的人。
//
//圣骑士的宝座
//最顶楼某个工位的一把办公椅，（据称）是整个后室最好的一把椅子，数百年来引起了无数为了争夺它的战争和阴谋诡计。不过圣骑士本人说并没有这把椅子，而且整栋楼里还有无数把一模一样的，这点我们不得而知。
//
//M.E.G.采访记录：“办公室圣骑士亚斯明”
//采访者：Solomon Myers
//受访者：后室官方皇家圣骑士亚斯明
//
//采访在主楼顶层，骑士的办公室中进行。
//
//采访者：你好，最近咋样？
//
//亚斯明：还行。你知道的，随便闲逛。
//
//采访者：我可以问你几个问题吗？
//
//亚斯明：请便。
//
//采访者：你是谁？
//
//亚斯明：吾乃办公室圣骑士亚斯明，此层级的统治者，无限空间之主。
//
//采访者：这话说得没错。
//
//采访者：你是一个人吗？还是说你是个实体？
//
//亚斯明：我不知道这两者有什么区别，以及具体什么意思。
//
//采访者：噢。
//
//采访者：你知道“后室”是什么吗？
//
//亚斯明：就是我们所在的地方。我所服务的人就是一个服务于后室的意志的人。
//
//采访者：一位国王？
//
//亚斯明：这儿是个办公楼，说是个经理还差不多。
//
//采访者：呃，难道骑士不该效忠于什么，皇室之类的吗？
//
//亚斯明：现在是新时代，皇室早就没有了。
//
//[删减部分内容]
//
//采访者：接下来——如果你不介意的话，我要问一些与……后室本身有关的问题。你不介意吧？
//
//亚斯明：我不是什么万事通，而且这方面有保密协议的。我不保证我的回答是真话。不过你可以问。
//
//采访者：为什么大多数人都被困在了Level 0?
//
//亚斯明：（挑了挑眉毛）谁和你这么说的？
//
//采访者：啊，我明白了。我们有回到前厅的方法吗？
//
//亚斯明：你们误入了世界的后端，要回到前端去是非常困难的。你们是闯入了帷幕背后的角色，而你们的演员入戏太深而不自知；你们是不小心点出了源代码界面的玩家，看着一大堆看不懂的代码不知所措；你们是人咽进肚子里的口水里的皮屑，不知道人的系统的运作方式，只知道自己将被胃酸淹没。
//
//亚斯明：（摇头）一个错误。我也没有进一步的建议。
//
//采访者：我……我会把这些上报给我的上级。
//采访者：有关于这个层级，有什么建议吗？
//
//亚斯明：随便逛逛，注意别掉下去。还有就是我不是随时都在。
//
//采访者：这是个蛮酷的层级。
//
//亚斯明：谢谢夸奖，它还拿过奖呢，旅店老板当时肺都气炸了。
//
//亚斯明：没印象也正常，那是第√3i届奖项。
//
//采访者：噢，真是奇怪……谢谢你的配合。
//
//亚斯明：不客气，空了来玩哦。
//
//基地、前哨与社区
//MEG社畜办公之家
//在主楼顶端的一个基地，为流浪者提供补给和保护、管理物资采集工作，同时利用本层级的资源和结构为MEG处理文书工作。目前有上百名文职人员在岗。
//
//后室家居生产厂（B.F.P.F） 基地
//本层级为此组织的物资采集点之一，他们在一栋副楼顶层设立了基地并参与了交通网络的构建。
//
//E.P.B.研究室
//在本层级的某处找到了一个拥有实验器材的楼层，E.P.B将其利用为实验室。一则轶事称他们本想向办公室圣骑士租用其中一座大楼，不过结果显而易见：他们付不起每月无限元的租金。
//
//后室娱乐大厦
//一整栋塞满了后室娱乐有关的物品的大楼。他们显然付得起租金，不过没有无限名员工在岗，所以只有顶层部分在营业。
//
//圣骑士的骑士团
//一群崇拜办公室圣骑士的，穿着中世纪装束的宗教团体，他们宣称办公室圣骑士是“圣子”。他们占领了一处表现为未完工的工地的塔楼，并把将塔楼继续向上修建作为宗教仪式。
//
//办公室圣骑士表示拒绝做出评价，不过他们有在层级内自由活动的权力。
//
//“邮轮海盗”
//一个黑道帮会支部，他们最初试图进行违法活动，但后来发现此地有大量的资源，于是转而收集资源运向黑帮在其它层级的基地。
//
//他们的标志是使用鲜艳的红色绳索在建筑间移动。建议远离。
//
//许多较小的社区、部落和结社不再赘述。大部分已探索的塔楼顶部都会有物资点、安全屋和通向其它塔楼的交通方式，如需在塔楼间移动，建议带好攀岩设备和抓钩、滑索等工具。
//
//入口
//在城市层级或办公楼层级中找到一架只有一个无穷大标志的按钮的电梯可以到达此层级。
//
//注意不要与电梯搞混。强烈建议不要轻易尝试按钮上的数字不是实数或不是数字的电梯。
//
//在城市层级找到一座高耸入云看不到顶的办公楼或类似的建筑也是方便地进入此层级的方法。
//
//在C层群中尝试切入封闭空间上方的墙壁就有可能到达此层级，并出现于其中一座以无限循环的空间为主题的塔楼中，如邮轮和别墅。不过要注意的是，以此方法进入的话你就有可能来到本层级的中部。通常情况（∞：1）下，你需要向上爬无穷多层才能到达塔顶，而此塔周围有社区和基地的概率也是无限分之一。
//
//在办公室层级内切入是最有可能到达主塔塔顶的方式。
//
//适用于个人的稳定地前往主塔塔顶的仪式
//找到一座摩天楼的楼顶或在最高的楼层的地板上
//躺下，闭上你的眼睛，想象身下的楼是无穷高的，直入云霄的
//想象自己切入了身下的地板，一直坠落
//在你感到自己突然摔在地上后，你就到达了主塔的最高层。
//出口
//喝得酩酊大醉并失去方向感，你就可能会在无意识间切入Level C-297。
//
//找到一座直伸入视线尽头的缆车设施并坐上，即可进入Level C-183。
//
//在办公楼内晕倒，即可来到Level 4。
//
//转悠到失去方向，即可进入其它与所处塔楼有关的层级。
//
//坠落直到失去意识，就可来到Level 198
//
//谣言说其实可以到达塔楼的底端，那是虚！！一！@#大！@#！@与！！！黑！@白！！音！？？！？白！！7！！#世！！@#田！！！介，不过也有可能不是。
//
//作者信息
//« Level C-325 | Level C-326 | Level C-327 »
//
//Footnotes
//1. 虽然本层级内确实有很多，但旅馆房间的钥匙卡不行。
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1326{}