//Level C-322
//评分: 
//+28
//+
//–
//X
// 
//
//生存难度：
//等级 5
//
//不安全
//不稳定
//环境危险
//你慌张地四下寻找出口，但面前的死胡同依然顽固地立在前方。正当绝望之时，墙壁中出现了一扇黑色的门，求生的本能使你未经思绪就立即飞奔进去，接着用尽全力堵住门。正当惊魂未定时，眼前的景象又使恐惧爬上了你的脊梁：这绝对不是Level 2，并且是一个你从未见过的层级……
//
//Level C-322是后室C层群的第322层。
//
//描述
//Level C-322是一个完全独立的空间，体现为两座悬浮于虚空中的平台，平台之间由若干根未知金属所制成的黑色锁链所连接。1两座平台的水平高度差估测约有30m，最短相距距离约有2km。较低平台外观为一块混凝土地板，面积约为10×7m，平台上方放置有一扇深色的木质门，门的方位恰好在平台的中心点，且朝向于锁链方位并平行于平台边缘。进入者将于此平台的门中进入至此层级。进入后可返回门中离开此层级，2攀爬锁链能够来到水平较高的平台，但攀爬的人员除非后来原路返回，其他均下落不明，初步推测为攀爬时不慎掉入虚空。
//
//此层级为孤立层级，不存在任何WiFi信号，也不会生成物资，定位系统无法使用且无法判定方位，因此如果要进行攀爬请做好准备。
//
//虚空仿佛要将自己吸进黑暗里，锁链散发着浓重的死亡气息。
//
//回去吧？可是……你想到了那些恐怖的实体追杀你的情景，即使外面的那只笑魇放弃了追赶自己，有那些数以百计的实体也难逃一死。你打了个哆嗦，看到那扇黑色的门静静地在那里立着，像在等待自己做出决判。
//
//上去吧。你带着一颗颤抖的心爬上了锁链，身后的门如死神的眼睛凝视着自己，你踏上了死亡之路。
//
//此层级攀爬锁链极其艰难，几乎不可能在不进行中途休息的情况下完成整段路程，这主要是因为锁链的特性。锁链长度及两端连接处均不相等，且锁链的环口大小不定，所攀爬的锁链有时坡度会陡峭到无法攀爬，因此前进时需要不断在锁链之间来回切换路径以免出现无法前进的状况。锁链的实际体积除攀爬者所在部分其他部分均不稳定，有时会出现“切入”锁链的现象3，因此攀爬时尤其需要注意前方的锁链是否能够进行攀爬，以免突然抓空而导致掉落至虚空。
//
//“呼哧……呼哧……”
//
//你感到快要撑不住了，前进所用的时间越来越短，休息的时间越来越长，但还是渐渐变得无力，你回过头看那扇黑色的门，它现在看起来似乎远了很多。这段路程走的很艰难，已经差点掉下去好几次了，如果真掉进虚空怎么办？甚至自己也无法保证掉进虚空后果会不会比被笑魇撕碎更可怕。你不会直接在锁链上掉头，如果要回去，必须借助另一根锁链，但自己所在的位置根本碰不到其他的锁链做支撑。
//
//继续吧。
//
//但你的内心抗拒着，你的身体快受不了了。你突然怀念起你在前厅的时光，那里美丽，安全，舒适，但你那时却不懂得珍惜那里的一切，即使是阳光此时变得像梦般难以企及。而虚空中传来的冷风一次又一次把自己无情地拉回现实。
//
//你痛苦极了，停下来再次歇息时不自觉地望向了虚空，它深邃的无形之眼只表达着期待着你落下的渴望。
//
//
//据一位有幸逃出层级的流浪者表述，于锁链中前进一定路段后能够目测到锁链所连接的较高水平平台。其平台结构与另一所进入的平台结构几乎呈前后镜像，不同的是门内的空间似乎是一个独立的空间，内部存在的未知光源会射出白色的光芒，据说注视光束能够削减身上的疲劳，并且有振奋精神的作用。4目前因为证据过少尚未知晓是否属实，并且进入门后会回到前厅的消息为谣言，我们目前尚未收到任何有人返回前厅的信息。
//后面的锁链体积都变空了，你只能继续。
//
//不知前进了多久，也许是几个小时，也许是几分钟，一束白光照耀在你身上，你抬头望去，那是一扇散发着白色光芒的门。它让你又看到了希望，身上的疲劳顿时减轻了几分，你强迫自己的身体继续前进，你预感那里是个能使自己安全的地方。
//
//你觉得自己要获救了。
//
//实体
//本层级未发现任何实体。
//快了，马上就到了。
//
//基地、前哨和社区。
//本层级无任何基地、前哨和社区。
//就差一点。
//
//入口与出口
//入口
//在后室中有生命危险且身处绝境时，如周围形态为建筑物内部，有概率找到一扇黑色的门，进入即可来到此层级。
//出口
//可以通过进入层级所用的门离开此层级，但极少有人能够幸存并且均身负重伤。
//进入较高平台中发出白色光芒的门，但进入者均下落不明。
//进入虚空。
//终于登上来了。
//
//
//但只有白色的虚无。
//
//
//你在期待什么？
//
//
//去相信一个虚妄的执念？
//
//
//
//
//你无助极了，受尽千辛万苦去追一个虚无缥缈的幻想，最后落得一场空。
//
//你望着那些黑色的锁链，它们却只是看着你无声地流泪。
//
//你觉得自己是前厅和后室中最悲惨最荒谬的人。
//
//……
//
//
//
//
//……
//一阵暖风拂过脸颊，像清脆的音乐流进了自己破碎的心中，将灵魂再次缝合如初。
//
//你感到身体越来越轻，慢慢消失，但意识却越来越清晰，就像一滩浑水慢慢变得清澈。
//
//你觉得你找到了归宿，和一个未知的世界融为了一体；你前所未有地轻松，并不是因为忘却了，而是因为接受了这个世界的所有。
//
//
//
//即使生命仍将迎来终结……
//
//xBy7an.png
//作者信息
//« Level C-321 | Level C-322 | Level C-323 »
//
//Footnotes
//1. 其悬浮以及重力原理未知 。
//2. 但离开的人极少数幸存且身负重伤。
//3. 切入后并不会传送至其他层级以及出现其他异常状况。
//4. 这名流浪者遇到了无法跨越的死路，只好返回离开层级，后来在被实体严重创伤时获得了援救。
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1322{}