//Level C-363
//评分: 
//+10
//+
//–
//X
// 
//
//生存难度：
//等级 4
//
// 
// 
// 
//Level C-363是后室C层群的第363层。
//
//描述
//mountain.jpg
//一位流浪者拍摄的Level C-363的森林。
//
//Level C-363是一片宏大的山区，时间保持在下午4点左右，Level C-363的山上可能会出现森林，也可能会生成出现草甸，由于地形的突然转变现象，极少数情况下两种区域会发生“重叠”。
//Level C-363的森林与前厅的森林别无两样，植物属于阔叶植物，少数情况下可以发现可用于饱腹的蕨类植物，味较苦，除此以外未发现任何副作用。森林内部存在严重的实体侵害现象，实体出没范畴一般可以划分为一个面积约10-20平方千米的圆，在其中会有大量实体出没，而相对的，森林外部范围内并不会出现实体。
//值得一提的是，森林中存在一些通常为绿色、蓝色或者黑色的特殊果实，这些果实具有一些特殊效果，一定程度呈现出类似于杏仁水等后室特殊物品的特点。绿色的果实尚未成熟，不可食用，蓝色的果实已经成熟，可以药用来缓解一些疾病，是此层级流浪者和实体的主要食物来源之一。黑色果实成熟过度，食用时会产生反胃的感觉。不幸者联盟的成员时常在这里活动。1
//在Level C-363山体上的草甸上则是有着各式的花朵，其中一些能够食用，而一些有害，这是另一种此层级流浪者与实体的主要食物来源，通常爆酸者会在这里生活，因此建议避开任何有腐蚀迹象的地面。以下是已知的四种花朵的功效：
//
//sweetflower
//一朵可食用的白色花。
//
//黄色花蕊白色花瓣的植株可以食用，能够饱腹，会有一种清凉甜蜜的口感，可以用于缓解红色花瓣植株所带来的副作用。
//主动触碰蓝色的花你将来到蓝色通道，目前被认为是一种自动切出，蓝色花朵数量极其稀少。
//生长有紫色花瓣的植株的营养组织内含有少量毒素，通过烘烤、烹煮等方式可以破坏液泡，释放内部毒液。生食时会中毒，症状包括腹痛、产生轻微幻觉、唾液分泌增加。大约12小时后症状才会逐渐减轻并消失，这些毒素并不是致命的，但会阻碍人体行动，建议非必要时避免生食紫色花朵。
//生长有红色花瓣的植株其总体上是无害的，然而，在根茎部位往往会长有一些锐刺，这些刺能够轻易地刺破人类或其他实体的表皮注射毒液，进而使得被注者遭遇一系列恶劣的反应，包括但不限于——引力减轻的幻觉（被描述为“灵魂出窍”）、剧烈的头痛、伤口极其瘙痒。，而以上作用都可以通过服用上文的白花进行一定程度的缓和，作用持续时间大约17小时。务必注意任何红色花朵。
//剩余花朵的功效未知
//在山区间横穿着一条蜿蜒曲折的公路，道路上偶尔会出现老式车辆，而这些车辆都是可以正常启动的。车上一般会存在有一些物资，如皇家口粮、杏仁水、火盐等。然而，应当注意的是，Level C-363的山体和公路似乎会随着探索时间的增加而不断变化，使得Level C-363无法用地图绘制的方法勘测地形，同时因此引发了多起坠落事故，甚至有些流浪者因此失踪。并不建议流浪者在没有必要的情况下以过快速度在公路上驾驶车辆。Level C-363的Wi-Fi很弱，有时甚至会出现断网的情况。
//Level C-363的山区有时能够发现连接公路的隧道，有时隧道后没有山体或山体上没有隧道），这被认为是山体地形转变所导致的。Level C-363的每个隧道口有可能出现可使用的汽车，这些老式车辆可能会在隧道口堆积在一起。所有隧道都标有编号，而可以按照编号分为四种类型，不同的隧道存在不同的内部情况，并且隧道的长度与山体长度并不相匹配。
//
//BR-1
//这个隧道的主要材质为钢筋混凝土，长约500米，灯照系统正常，内部几乎不存在实体，目前仅有两份实体发现报告，皆未被证实。目前认为隧道BR-1是整个层级中最安全的区域，是Level C-363的主要交易基地，不幸者联盟时常在这里活动。在隧道外无发电机轰鸣，即使BR-1是相较于四种隧道中灯光系统最正常的。
//
//BR-2
//这个隧道同BR-1一样由钢筋混凝土构成，长约600米，灯光系统有时出现闪烁现象。与BR-1不同，这里出现了更多敌对实体，包括无面灵、悲尸和爆酸者，在隧道外有轰鸣声，听起来是隧道内发电机工作时发出的声音。
//
//BR-3
//这个隧道的主要材质为大理石，长约800米，灯光系统的闪烁频率相较于BR-2的灯光更快。内部出现了更多的实体，包括无面灵、猎犬、悲尸、爆酸者和潜行鲨，这个隧道似乎是潜行鲨的巢穴，在这里发现了大量鲨鱼卵和潜行鲨幼体。在隧道外可以听见相较于BR-2更大的轰鸣声。
//
//BR-4
//这个隧道的主要材质为一种未知的吸光材质，这使得任何照射装备的照射范围会被缩小到方圆3米，隧道的照明系统完全失效。在内部时常存在M.E.G.人员设置的标尺，目前尚未得知这种隧道的长度，0-500m内不存在任何实体，此外杏仁水可以在这里被找到，少数时候可以发现皇家口粮。流浪者报告称隧道内存在以下实体：窃皮者、车兽、笑魇和清道夫，但报告人员都声称这些实体不是敌对的，即使他们攻击了这些实体，但它们仅仅只是“灰飞烟灭”了，推测可能是隧道的精神影响所产生的幻觉。500m以后只存在一个实体，它时常在这一段游荡，它被称为“聚合”，具有较强的敌意2，这一段隧道中不存在任何物资，标尺时常出现磨损现象，在深入过程中常常可以发现一些人类骨骼，但是根据唯一一根被带回来的骨骼的DNA检测显示，这些骨骼所含DNA不与任何一位已知的流浪者相匹配。在这里不存在任何精神影响，因此这里并不会出现实体幻象，你所看到的都是真实的。
//
//
//实体
//本层存在“便车”、无面灵、猎犬、悲尸、爆酸者、“捕兽夹”、潜行鲨和“聚合”，部分实体在此层级会出现与往常截然不同的行为。
//
//无面灵
//在此层级，无面灵表现出与Level 11截然不同的行为，它们大部分会对流浪者表现出极为强烈的敌意。通常他们会在森林里生活，有时能够在隧道内部发现他们，而仅有少部分表现平和的无面灵，被发现出没于草甸区域中。由于他们的生活环境，他们的衣衫相比较其他层级的无面灵要更为残破不堪。值得注意的是，幼年无面灵比其他层级的正常无面灵的行动更为迅猛，也更有在森林中袭击流浪者的欲望。除了草甸区域零散的无面灵团体外，似乎森林地区的无面灵形成了一定规模的“族群”，但是具体情况不明。不幸者联盟与M.E.G.探员都有试图与其交涉的尝试，但都以失败告终。
//
//猎犬
//猎犬在此层级更倾向于在森林中活动，它们很少离开森林，除非是为追赶猎物或躲避敌害。它们在森林中数量繁多，是其中最大的威胁，根据推测可能是因为森林内的环境非常适宜猎犬生存。通常成群结队狩猎，很少存在单只猎犬的情况，时常攻击流浪者和无面灵，它们似乎有很强的领土意识，对于侵犯领土的任何生物表现出强烈的敌意，如果森林的树上出现了爪印，说明这里是一群猎犬的领地边缘，建议不惜一切代价远离。
//
//
//“便车”
//“便车”是一种驾驶车辆的实体，他们的外貌无异于正常人类，身高为1.5-2米，他们是完全无害的，驾驶着一辆汽车，沿公路驾驶。遇到流浪者时会询问他们需不需要坐车。根据调查，它们的语言与人类的语言不同，但流浪者却能够理解。如果流浪者同意，那么他们就会搭载流浪者前进，在旅途中流浪者们随时可以选择下车，如果流浪者搭车超过一小时，那么他们就会睡着，醒来后会被送到任何一个安全的层级，身边会出现Level C-363车辆上出现的任何一种物资。如果流浪者不同意，“便车”会给予他们黄花或球状紫花。研究显示，流浪者若在来到Level C-363后没有在约莫72小时内没有乘坐过“便车”的车，那么他们将再也见不到“便车”直到下一次来到Level C-363，目前仍未发现让其下车的方法。当他们受到攻击时，会加速逃走，并不会反击。任何试图拍摄“便车”穿越层级过程的尝试都是徒劳的，在“便车”穿越前摄像设备会突然进入损坏状态，这种状态会持续到流浪者第二次主动触碰相机时，因此尚未得知“便车”是如何穿越层级的。
//
//
//潜行鲨
//潜行鲨的外貌如同前厅的双髻鲨，通常3米长，速度最快可加速到14mph，群居生活。已知它们可以在陆地中“游泳”，它们平时没有敌意，但在狩猎或者被激怒时将会追杀流浪者。通常它们会将流浪者拖入地底并杀掉，其咬合力似乎比前厅的任何一种已知的鲨鱼更强。它们的巢穴在编号BR-4的隧道中，它们无法离开地面，因此通常它们上山的速度相较于下山更加缓慢。通常它们会在森林的中心区域狩猎。
//尚未知道潜行鲨是如何在地面中游泳的，最流行的推测为“如同牧蛇一样切入地面”。其独特的狩猎方式可能也是依靠切入来进行的。目前发现了潜行鲨幼体和鲨鱼卵，依此推断其生殖方式与前厅的鱼类别无两样。
//
//
//“捕兽夹”
//“捕兽夹”是一种奇特的实体，通常生活于草甸区域，它们的外貌如同人们使用的捕兽夹，但浑身成乳白色。它们大部分身体由骨骼构成，骨骼间有关节，骨骼间有微小但及其有力的肌肉。它们用于夹住猎物的部分被称为口器，口器两旁连接的齿上可以分泌用于麻醉的毒液，同时也可以分泌一种类似消化酶的物质，测试发现它们可以在30分钟内将一只猎犬尸体彻底消化。口器中间有一块圆形的感应器官，当感受到压力时会立刻把口器关闭，很难打开，它们没有眼，只能依靠感应器官来感受周围的环境。它们的口器下方连接着几条细小的足，可以令它们以缓慢的速度运动。建议不惜一切代价避开草甸上突然出现的扁圆形白色物品。
//
//
//“聚合”
//“聚合”是一种危险的实体，一只“聚合”由多个个体构成，这些个体是一些亮银色的甲壳虫，值得注意的是，一只“聚合”个体无法生存，因此一群“聚合”个体所构成的集体被认为是一个实体。“聚合”具有较高的智慧，可以与人谈话，但它很少这样做，具有较强的敌意。“聚合”通常居住于BR-4隧道的500-?m处，目前在此层级仅发现了一只“聚合”。“聚合”可以根据意愿变化成不同的形态，也可以模仿一些实体的样貌和行为，用于蒙蔽敌人。一只“聚合”通常的形态为一只巨大的、有翅的蜘蛛，有毒素，可以麻醉猎物。尚未得知“聚合”是如何吃掉猎物的，最流行的猜测是“聚合”个体会将食物分而食之。
//
//
//
//基地、前哨与社区
//不幸者联盟
//基于种种原因而未能遭遇实体便车的流浪者组成的组织，已经形成一定规模，出于“存活”这一目的而愿意同其他流浪者或团体结盟，愿意开放贸易。
//为了应对实体威胁与恶意团体的攻击而装备了一定武装力量，在一些情况下愿意主动清理被称为“潜行鲨”的实体。
//人数未知，然而可以知晓的是，尽管由于层级的特殊性而无固定基地，但是该团体仍然愿意在大多数时候于隧道附近山体的山顶上建立临时基地，有时候能够在森林或草甸中遭遇其组建的小型团伙活动。
//
//夺金者
//一群因未知原因留在此层级的流浪者，目的同样是生存，他们对非夺金者人员持敌对态度，经常掠夺其他流浪者的临时基地，目前已掠夺了10个以上的临时基地内的物资。
//他们具有相对不幸者联盟更弱的武装力量，时常进行抢劫一类的活动，目前已经形成规模，但人数未知。他们通常活动于隧道旁的山上，经常与同区域的其他流浪者发生冲突。团体内部分人存在意外死亡的情况，推测可能与阿尔戈斯之眼有关。
//
//入口与出口
//入口
//到达Level 9远处可能出现的山区，你将来到这里。
//在Level C-236尝试切出有可能来到这里。
//在Level C-8远处想象一片变化的山峦，你将来到这里。
//在Level 11找到一辆老式的车辆并在里面坐30分钟左右你将来到这里。
//在Level C-81中想象山体在变化，你将来到这里。
//出口
//驾驶公路上出现的车辆沿公路方向持续行驶，并穿过至少一个隧道，你将来到Level 9、Level 11或Level C-236。
//搭乘“便车”的车将会带你来到一个稍微安全的层级。
//主动触碰蓝色花朵你将来到蓝色通道。
//在编号为BR-4的隧道中尝试切出，在极少数情况下你会来到Level 6
//作者（们）和帮助了这家伙的大佬
//« Level C-362 | Level C-363 | Level C-364 »
//
//Footnotes
//1. 相关团体参看下文
//2. 相关实体参看下文
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1363{}