//Level C-337
//评分: 
//+26
//+
//–
//X
// 
//
//生存难度：
//等级 2
//
//较不安全
//稳定
//中量实体photo-1600811990693-f01bc430a9b4?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1632&q=80
//Level C-337中某一座丘陵顶部的天文台。
//
//Level C-337是后室C层群第337层
//
//描述
//Level C-337看起来是一片长满草地的丘陵，偶尔会看到稀疏的树木。极其罕见的情况下会有植物密度较大的森林。在某些丘陵的顶部会有一种特殊的建筑：天文台
//
//该层级存在昼夜循环，约为19小时。其中只有约3小时白天。该层级在白天时相对安全。到了晚上，就会有较多有威胁的实体出现。夜空中会生成星星、星座和流星，它们对冒险者的危害包括但不限于晶状体损伤、皮肤灼伤、生理与心理伤害等。切忌在夜晚长时间盯着夜空看！除此之外，也有冒险者声称在入夜后的旷野里碰见过笑魇。
//
//天文台
//天文台是一种只会存在在Level C-337丘陵顶部的特殊建筑，已知的天文台有51座。其中会有无尽的水源、能源供流浪者使用，在附近还有良好的WiFi信号。天文台对敌对实体有某种未知的屏蔽作用，所有星星和星座均无法对其中的流浪者产生影响。因此在夜晚待在天文台内会是一件明智的事。
//
//每一座天文台都配备了至少一架望远镜，流浪者可通过它观察星座。当观察一个星座足够长时间1后，会对流浪者产生一些影响。观测过后，星座会消失。一共有800余种星座，不同的星座会有不同影响。详情可向M.E.G.索要。下面列出部分代表。
//
//photo-1629898144911-d3bd4b265cc3?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=765&q=80
//Level C-337星空中的猎户座。
//
//猎户座：回复理智与治疗伤口
//猎犬座：召唤数条猎犬到流浪者身边
//十字墓座：丧失大量理智
//北斗七星/大熊座：传送流浪者至Level 0到Level 11的任意层级
//剪刀座：在流浪者身上随机位置（包括内脏）出现一道伤口
//切记：不要试图观测未知的星座，这可能会造成某些极其严重的后果。
//流星雨
//流星雨是该层级的稀有事件。该事件随机在晚上发生，且每次会持续约10小时。事件发生时，流星的生成几率会大幅提升。详见下文。
//
//星源
//星源是Level C-337中的特殊区域，位于某些无建筑的丘陵顶部。
//
//星源已被证实是星星、星座和流星的源头。正因如此，星源上方往往具有超大密度的星星。当流浪者足够靠近星源时，这些实体便会对其发动攻击。目前还没有从此种攻击中幸存的案例。进入星源并以某种未知方式从攻击中幸存，你将可能去往Level C-337.1。考虑到该子层级的危险性，你依然需要远离星源。
//
//这些实体会利用类似海市蜃楼的原理将星源伪装成一个正常的天文台，以此勾引流浪者靠近。该假天文台会在白天消失。
//
//切记要在晚上进入天文台前，仔细检查上方星星密度。切记不要进入甚至尝试接近一个星源，不要在无建筑的丘陵顶部入夜。
//
//实体
//星星
//见这里
//
//星座
//星座是该层级的一种特殊实体。它们是若干星星的组合。比起单个星星的躲避与隐藏，它们更喜欢直接灼伤猎物，通过精神和肉体摧残使其失去行动力。同星星一样，它们会在白天休眠并隐匿。关于星座的观测见上文。
//
//流星
//流星是该层的特有的实体。它会少量出现并向地面砸下，并引起一场随机大小的爆炸。爆炸会对实体与流浪者造成伤害，但似乎不会破坏地形。它们的下落有明显的对流浪者的倾向性，而且有多种证据表明流星与星星具有互利性与共生性。
//
//流星有几率在爆炸处生成一个补给箱，里面可以开出杏仁水、火盐等物资。这是该层级为数不多的获得物资的方法。如果无人捡拾，补给箱会在白天到来后消失。躲避流星的最好方法就是躲在天文台中，但这样做会无法获得补给。
//
//在流星雨期间，流星会大量生成。这可以给流浪者带来更多物资，但同时使流浪者有更大危险被流星砸中。
//
//笑魇等2
//基地、前哨和社区
//M.E.G.天文观测小组
//M.E.G.天文观测小组是一个由22位常驻人员组成的团体，其总基地位于Level C-337最大的天文台内部。其职责是观测并记录该层级天体的情况，探索该层级的情况，并给予来到的流浪者住所与指导。
//
//M.E.G.天文观测小组的领导为洛斯克（Losc），代号平原。他是最早发现Level C-337的团体成员之一。他对该层级的了解比任何人都更深。
//
//洛斯克，及过半的M.E.G.天文观测小组的成员最初都是BHAA的研究人员。他们最早进入Level C-337并建立了基地，开始天文研究。后来有几位M.E.G.探员进入并说明他们愿意与该小组合作以此得到他们的研究成果来更好保护前往该层级的流浪者，该小组才正式命名为“M.E.G.天文观测小组”。
//
//入口与出口
//入口
//在任意层级用望远镜观察星星将有几率进入。
//在Level 3.1中使用发现的天文望远镜将会使你传送到此。
//在Level 11中发现一座大门紧锁的天文馆，并切入它的大门。
//出口
//使用天文台观察星座将会去到其对应的层级
//进入植物密度较大的森林足够深时，你会在Level 6或Level C-6中醒来。
//进入星源可能会使你到达Level C-337.1。危险！不要尝试！
//作者信息
//« Level C-336 | Level C-337 | Level C-338 »
//
//Footnotes
//1. 约为2-5分钟
//2. 通过观测星座可以召唤的实体
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1337{}