//Level C-333
//评分: 
//+12
//+
//–
//X
// 
//
//生存难度：
//这是一个
//美妙的
//夜晚K-R22ai1aww.png
//家园。
//
//Level C-333，夜晚。
//
//描述
//夜色真美
//
//你能看到那天边的圆月吗？
//
//那曾是我的故乡
//
//但终将不是我的归宿
//
//我从天边来到你们的身旁
//
//每晚陪伴着孤独的旅人
//
//他们有的迷失了灵魂
//
//有的放弃了理智
//
//可怜的人儿啊
//
//你们痛苦而又幸运
//
//痛苦的受到这无尽的折磨
//
//幸运的在折磨中作乐
//
//夜深
//
//月起
//
//无数生灵在这美妙的夜晚
//
//与我共舞
//
//基地、前哨与社区
//那曾是一段黑暗的日子
//
//那曾是一段苦难的日子
//
//我们寻找着心灵的居所
//
//在这阿鼻地狱之中彷徨
//
//你是否能够理解我苦难
//
//你是否能够同情我悲伤
//
//你只是仰仗着你的威力
//
//让这一切在你的歌声中
//
//走向灭亡
//
//入口与出口
//这不重要
//
//毁灭是我的职责
//
//安慰是我的怜惜
//
//我从明月中来
//
//到黑暗中去
//
//而你们只能在这混沌与秩序中
//
//求得一丝苟延残喘
//
//看这狡黠的月光
//
//你是否梦到了曾经的家园
//
//现在
//
//你们的梦醒了
//
//一切终将归于冷寂
//
//只有明月永存
//
//......
//
//关于Level C-333的修正档案
//Level C-333 » 关于Level C-333的修正档案
//评分: 
//+12
//+
//–
//X
// 
//
//生存难度：
//不安全
//不稳定
//强大实体侵袭
//我是编写者克西，该层级档案为Level C-333实际内容，从此层级幸存下来的生还者告诉了我更多关于本层级的信息，因此我将其描述整合进入该文章内。
//
//Level C-333是后室C层群的第333层。这一层由龙血族成员纽（ν）实际占领，并对M.E.G.数据库进行了不可编辑的修改。
//
//K-R22ai1aww.png
//这张图极有可能是“纽”自行上传到M.E.G.数据库中的。
//
//描述
//Level C-333是由一轮永不落下的圆月和一座陡峭的石山组成，石山目测高400~500米，其余部分均为深不见底的汪洋。由于Level C-333似乎是永夜状态，因此能见度极差，无法看清月光之外的任何景象。只能听见偶尔传到耳边的海风声和海浪拍击石山的浪花声。
//
//进入Level C-333的流浪者在此层级停留超过十分钟左右，会有一种不可名状之物从月亮方向出现并下落至流浪者的上空，其身形约为4~5米长，且长有许多暴露在外的腔体和蠕动的触手，但其脸型却神似人类。推测她为失踪多年的龙血族成员之一：“纽（ν）”。
//
//在此之后，流浪者会听见“纽”传来柔和的女音，其中包括各种自我介绍和关于月亮的描述，她的话具有很强的蛊惑性。根据流浪者所述，这种蛊惑性不止体现在文字当中，更多的是从她“柔和而细腻的眼神”里所透露出来的。像是中了幻术一般，无法自由思考。被蛊惑的流浪者将义无反顾的扑向她的怀抱，并被收进她的腔体当中。
//
//从她的话里唯一能活下来的方式，即是全神贯注并保持警惕，避免被她魅惑1。避免被她绕到她的圈子里，时刻想着反驳她说出的话，时刻准备好反击的工具。当她意识到流浪者的思维坚定难以攻破时，就会施加某种不知名的幻术使流浪者晕倒并送其离开Level C-333。尚不清楚她做出如此行为的动机。
//
//基地、前哨与社区
//本层级很有可能是龙血族的一个小型站点，由“纽”进行把守，并通过蛊惑流浪者获得关于其他人类组织的更多信息。
//入口与出口
//入口
//在Level C-300至Level C-399的深夜仰望具有月亮的层级当中的圆月，均有概率到达Level C-333。
//出口
//目前似乎只有“让‘纽’将流浪者送往随机的一个C层群中的层级”这一种离开的方法。
//作者信息
//Footnotes
//1. 这位生还的流浪者是性冷淡群体成员。
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1333{}