//Level C-302
//评分: 
//+38
//+
//–
//X
// 
//
//生存难度：
//等级 健康生活
//
//部分情况安全
//层级专属法律
//中立组织主导
//Level C-302是后室C层群的第302层。
//
//jfhDJK.jpg
//Level C-302的首张照片。
//
//描述
//Level C-302整体为一片面积约45万平方千米的森林，层级边境被山峰所环绕，拥有无结冰期的内陆海1，其一直处于类似冬季的降雪期，时间被定格于白天，部分地区能找到存有补给箱的废弃建筑，或是找到未完工的木屋。值得一提的是，所有迷途者进入此层级时都会出现在同一位置，因此此层级的出发点有许多人类聚集。
//
//Level C-302四处生长着橡树，树枝上堆积着雪，它们仿佛不遵循自然规律，不会因冬季环境产生变化，以至于它们依然生长着绿叶。Level C-302的天空为浅蓝色和紫色构成，并拥有着蓝色云朵，云朵不会移动，蓝紫色的光芒会透过云朵照射在森林里，停留于此迷途者会感到放松等影响。森林内不会降雨，但是却时而会有彩虹出现在森林间，这种超自然景象令许多流浪者印象深刻。
//
//Level C-302的降雪环境会使停留于此的迷途者感到无比的舒适，这种环境看似会十分寒冷，但是在层级内各处的温度都处于适合人体生存的标准，并且因为层级效应的影响，流浪者很难会因为饥饿、缺水而死亡。长时间停留于此并且与环境接触，会使流浪者自身的伤势愈合，其原因未知，已证实层级中不会因为传染病而大面积感染。
//
//虽然此层级常年处于降雪状态，但积雪通常会保持在15厘米以下的高度，多出的高度将会以未知的方式快速消失，且不会融化为水。这些雪同样不是冰冷的，它的温度保持在常温，这意味着层级在大多时间中，不会因过于潮湿从而出现受潮等现象。
//
//据实证，这些雪在触感上与普通的雪几乎相同，但是它们是可食用的，其口感类似于棉花糖，并带有甘甜味，并且会使迷途者产生饱腹感，还会带给迷途者愉快和放松的感受，缓解焦虑感。躺在这种雪上会使流浪者迅速入眠，并且躺在上面会产生轻盈感。
//
//洞穴
//在极低概率的情况下，能在层级中找到前往地下的洞穴：它们似乎都是随机出现的，并且在内部结构上也都有所不同。最常见的是一种名为“母巢”的洞穴，这类型的洞穴将会出现在层级的偏远区域，在外观上是一条倾斜约30°、长约2公里、宽3米的石质通道，可直通地下区域。
//
//当进入后约500米，全部可见光被墙壁吸收而消失。在暗区无论如何调转方向最终都会前往更深处，人员必须在完全黑暗的情况下前行300米，直到来到火光地带，但这时人员携带的照明设备仍然无法被使用。继续向前行进700米，接下来在达到底层前为消音段，任何传播声音的方式均无法实现。
//
//在抵达底部后就能找到“母巢”：这是种繁殖敌对实体的巨型卵，这意味着它们随时都可能产出实体。但它们的血液中拥有某种易燃物，细小的火花都可能直接将“母巢”所引爆。杀死它可能有效减少层级中实体的出现率、甚至是影响其他层级中的实体。
//
//基地、前哨与社区
//居民的社区
//约有300人在此居住。
//建造了一个大规模的镇子。
//拥有完善的货币体制。
//不接受对外交易。
//B.A.G.“零点”大型基地
//约145名成员驻扎于此。
//对层级内的伤员进行疗养。
//拥有完善运作设施与武器。
//承担了焚烧“母巢”的任务。
//B.F.P.F.“水寒”前哨站
//约28人常驻于此。
//定期对森林进行巡逻。
//兼层级雪地样本采集站。
//极少数时间开放交易。
//F.O.J.“卵巢”前哨站（已撤离）
//约有15人常驻于此。
//定期在居民区进行宣传。
//不时给予流浪者信物。
//各地都能找到他们的祭坛。
//速切玩家中转点
//约有5人常驻。
//比赛用小型中转站。
//这里是长期比赛的暂住点。
//会在比赛前一周准备补给品。
//无畏先锋“雪怪”商店
//约有9位常驻。
//它们会随机出现在层级的各地。
//与人类达成合作关系愿意不爆发冲突。
//大多数时候进行奇珍古怪的交易。
//M.E.G.“迷惆者”号
//有32人常驻。
//他们被困在了Level C-302.S。
//会为迷途者提供补给。
//他们一直无法回到陆地。
//B.N.T.G.“忍冬猎人”贸易点
//共有33人常驻。
//全时段开放交易。
//接受任何组织贸易。
//偶尔出售猎物。
//U.E.C.“火光”基地（已摧毁）
//约有130人常驻。
//他们会使用火焰焚烧“母巢”。
//是首个发现该层级的组织。
//在一次事故后，离开了层级。
//入口与出口
//入口
//在Level 63的木桥上朝一个云朵的方向跳下，可使你来到Level C-302。
//Level C-41的地上捡到一个白色的苹果，吃下它你可以来到Level C-302。
//与在Level C-192任意一处出现的覆盖着雪的橡树交互2会使你来到Level C-302。
//爬上Level C-271内的任意一棵树并跳下来，可能使你来到Level C-302。
//出口
//在内陆海中迷失你会来到子层级Level C-302.S
//闭眼走进任何淡色区的木屋，你会来到Level A-2
//使用内陆海周围出现的蓝色沙子掩埋自己，你会来到Level A-1或Level C-30.k
//从废弃建筑的墙壁切出你会来到Level ES-41
//找到一个散布着霉菌物质的水井，跳入后你会来到Level 456
//作者信息
//« Level C-301 | Level C-302 | Level C-303 »
//
//脚注
//1. 已被证实内陆海属于子层级，而非Level C-302的部分
//2. 无论此层级目前处于什么季节
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1302{}