//Level C-355
//评分: 
//+3
//+
//–
//X
// 
//
//生存难度：
//等级 2
//
// 
// 
// 
//level-c-355.png
//Level C-355的一张照片。
//
//Level C-355是后室C层群的第355层。
//
//描述
//环境
//Level C-355是一片巨大的海洋，尚未发现任何陆地。层级内水温恒定为55.5℃，其热源未知。层级的大部分海床处于极深位置，目前无法探测到其底部。层级的海平面并不是统一的，一个区域与另一个区域之间经常存在着巨大的落差，当出现这种情况时会形成一道巨大的瀑布。
//
//Level C-355没有明显的天空特征，当流浪者处于层级内部时会发现整片天空被一片灰色的迷雾所覆盖。
//
//Level C-355的海面上漂浮有各种漂浮物，其中一部分漂浮物会不定期出现补给品。由于水温原因，海面上会不断形成水雾，导致肉眼在该层级的能见度不超过3米。
//
//资源
//Level C-355由一种特殊液体组成，此种液体无法被带出层级，当流浪者饮用超过100毫升后将会在48小时内死于脱水。
//
//Level C-355内生长有一种巨大的海藻，其在被采摘后数日内会将自身温度保持在50℃左右，常被流浪者用于保温。层级内的大部分实体也以这种海藻为食物。
//
//实体
//Level C-355内存在着一种名为“热鱼”的实体，它们的外观表现为一条红色且巨大的鳗鱼。活着的“热鱼”体温会保持在70℃左右。流浪者可以安全的食用“热鱼”，但如长期食用则会使流浪者的身体发出高温。
//
//“热鱼”对流浪者无明显敌意，仅在被捕食时展现出防御行为。
//
//基地、前哨与社区
//蒸汽海盗
//一群试图劫掠流浪者的强盗
//通过捕食“热鱼”生存
//极少离开层级
//居民人数未知
//身体会散发出高温
//其主要据点为漂浮于层级内的一艘小型帆船
//入口与出口
//入口
//在Level-C-10内潜水3分钟后浮出有几率到达该层级
//通过Level-7中的一片常温的区域可以切入该层级
//出口
//在该层级因缺氧而昏迷可以离开该层级
//在层级内一片较浅的海床内可以找到一处裂缝，通过此裂缝可以离开该层级
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1355{}