//Level C-335
//评分: 
//+15
//+
//–
//X
// 
//
//生存难度：
//等级 3
//
//不安全
//稳定
//非实体危害
//Level C-335是后室C层群的第335层。
//
//描述
//Level C-335表现为一片无边际的黑色无重力空间，空间中存在正常标准的空气。层级主体为一条围绕未知天体的星环，星环宽约19万公里，长度已超出可计算能力范围。星环的组成并非小行星似的岩石，而是不计其数的人造卫星。
//
//xvBnRe.jpg
//Level C-335
//
//该些人造卫星的原功能类型丰富，包括通信、导航、气象监测及行星探测等功能。每颗卫星沿固定的轨道低速匀速运动，平均速度约为7公里每小时，但卫星间运动速度存在一定差异，致使星环产生了明显的层次。
//
//卫星是可破坏的，其内部构造与前厅中的大体相当。其中的零件与仪器等具有一定的利用价值。
//
//卫星之间密集分布，平均间距约1米，即便如此卫星也不会相撞。层级中没有常见的自然光源，但每颗卫星表面均可发出微弱的白光，大量卫星聚集使得星环十分耀眼。
//
//绝大多数卫星表面无任何标识，仅有少部分表面涂有字符标识。该类标识被认为是激活某些信息的特殊代号，在Level C-335内1把代号输入特定的电子设备后，该设备将以某种方式输出一种类型的信息。这些信息被认为与代号内容息息相关，且具有一定的研究价值。代号无法预测或自行编纂。
//
//以下为已发现的代号及相关信息。
//
//- 关闭清单
//卫星代号：33.0
//适用设备：收音机
//输入方式：调频至“FM33.0”
//信息类型：音频
//输出信息：一段舒缓又忧伤的音乐，伴随有海浪声
//备注：/
//
//卫星代号：1-9-7-7
//适用设备：电视
//输入方式：利用遥控器调至频道“1977”
//信息类型：影像
//输出信息：115幅包括前厅太阳系各行星的图片、人类的器官图像及说明等影像
//备注：/
//
//卫星代号：coffee
//适用设备：传真机
//输入方式：通过按键输入“coffee”并点击确认
//信息类型：文字
//输出信息：一张疑似Level C-offee ୧⍤⃝中的咖啡菜单
//备注：/
//
//卫星代号：#345#
//适用设备：移动电话、固定电话
//输入方式：拨打号码“#345#”
//信息类型：音频
//输出信息：嘈杂的讨论声，可以依稀辨认出讨论内容与某篇文档编辑有关
//备注：/
//
//卫星代号：49号战区
//适用设备：电报机
//输入方式：发送电报“49号战区”给任意另一台电报机
//信息类型：文字
//输出信息：Level 49中红蓝两军的战报和军队基本信息
//备注：/
//
//卫星代号：0209
//适用设备：蓝牙耳机与移动电话（手机）
//输入方式：通过移动电话打开蓝牙耳机的麦克风，清晰的说出“零二零九”
//信息类型：音频
//输出信息：杂乱的脚步声、嘈杂的交谈声与手机彩铃声
//备注：/
//
//卫星代号：uwu
//适用设备：移动电话（手机）
//输入方式：在手机内任意社交软件上给任意联系人发送“uwu”
//信息类型：文字
//输出信息：该社交软件内全部联系人同时给该名实验者用户发送了“uwu”字样
//备注：经后续调查，实验者的所有联系人均表示从未发送过“uwu”给实验者用户
//
//卫星代号：114
//适用设备：固定电话
//输入方式：拨打号码“114”
//信息类型：音频
//输出信息：持续不断且平稳的心电图“嘀”音
//备注：/
//
//卫星代号：sos-c182
//适用设备：平板电脑
//输入方式：在任意搜索引擎中输入“sos-c182”并点击搜索
//信息类型：图像
//输出信息：一张未知生物胎儿的X光片
//备注：/
//
//卫星代号：0
//适用设备：一切可以播放音频的设备
//输入方式：在设备上任意可输入数字的地方输入“0”
//信息类型：音频
//输出信息：嗡嗡声
//备注：/
//
//以下是流浪者上报的卫星代号及信息
//
//卫星代号：X1193
//适用设备：移动设备，电脑等
//输入方式：通过键盘在浏览器输入"X1193"
//信息类型：网页
//输出信息：充满神风，烂活和少量实用组件的网站
//备注：/
//
//卫星代号：bc1998
//适用设备：电脑
//输入方式：将电脑时间修改为“1998年”，并将任意一文件的名称修改为“地球保卫战”
//信息类型：影像
//输出信息：一部约25分钟的动画星际战争影片，影片中战争的背景位置可推测于前厅的太阳系附近
//备注：/
//
//更多信息正在发现中……
//
//M.E.G.鼓励并支持流浪者探索代号与信息并及时上报。对于主动上报者，M.E.G.将按照信息的重要程度给予一定的奖励。
//
//尚无法限制卫星运动，但可使其脱离轨道。此时卫星将永久离开星环，最终停留在星环附近，不再运动，并失去其发光性。若该卫星具有代号，则代号不再有效。此后星环轨道上的空缺位置将以未知方式补充同体积的卫星。
//
//由于Level C-335的失重环境，易导致流浪者脱离星环，进而难以返回。M.E.G.将为流浪者提供安全绳等相关工具，进入层级后需及时赶往最近的M.E.G.前哨站索要安全绳。
//
//星环内存在大量卫星碎片，主要分布在星环外围。该些碎片运动速度极快，高达2.8万公里每小时，其冲击力足以摧毁轨道上的卫星，对流浪者同样具有极大危害，应根据M.E.G.前哨站所发出的预警信号来及时躲避碎片，并避免前往星环外围。具有代号的卫星若被破坏则代号将永久失效。
//
//除星环外，层级中无任何其他天体，但在远离星环的空间中可以观测到Level C-24、Level C-175、Level C-206和Level C-356等层级景象。尽管无法靠近。
//
//基地、前哨与社区
//探险者总署（M.E.G.） - “斯普特尼克”Level C-335总基地及各地前哨站
//总基地位于在数十颗卫星之上的人工平台上，搭建有简易建筑，可识别度较高。各前哨站分散建立在几颗卫星上，悬挂有M.E.G.标识。
//常驻人员79人，其中总基地常驻41人，其他前哨站共常驻38人。
//目前拥有34个前哨站，其中27个处于正常运行状态，5个处于空置状态，2个处于废弃状态。
//定期派遣探险队搜集卫星代号并实验。
//各前哨站随时观测并发布即将出现在该地区的卫星碎片预警。
//愿意为流浪者提供安全绳及其他生存物资，但不提供庇护。
//友好但不开放贸易。
//入口与出口
//入口
//从Level 78一处舷窗外观察到一颗由远及近的人造卫星，并在此时从舷窗切出，将切入Level C-335。
//在Level C-113中将一个球形鱼缸倒扣在头部，并说出“休斯顿，我们有麻烦了”，将进入Level C-335。
//极少数情况下，在Level C-337通过望远镜观察到一颗拥有星环的气态行星，将进入Level C-335。
//出口
//尝试向星环内侧的黑色空间移动将进入Level C-206
//从任意卫星的太阳能电池板切出将切入Level C-399
//信息清单正在等待您的补充
//本页面开放合作，如果您有意要为Level C-335的卫星代号与信息清单作出贡献，请按照以下格式添加您的卫星代号与信息：
//
//[[div class="darkstyled-quote"]]
//**卫星代号**：（文字、数字、符号等均不限）（可与层级、实体、物品等有关，也可为其他）
//**适用设备**：（电子设备）
//**输入方式**：（方式不限）
//**信息类型**：（音频、文字、影像等）
//**输出信息**：（与编号相关）
//**备注**：（根据本人的需求填写）
//[[/div]]
//
//
//别忘了在作者信息处以[[*user 你的用户名]]的方式加上自己的名字。
//作者信息
//« Level C-334 | Level C-335 | Level C-336 »
//
//脚注
//1. 层级外一概无效
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1335{}