//Level C-310
//评分: 
//+11
//+
//–
//X
// 
//
//生存难度：
//安全
//宜居
//资源丰富
//Level C-310是后室C层群的第310层。
//
//维塔伦蒂大陆会接受任何一个尊敬他的人。不管你是谁，尊敬这片广阔的水土，它就会用资源回报你。这里有着充足的淡水资源，充足的矿产和丰富的水果。
//
//描述
//Level C-310是一片广阔的大陆，其面积约有2900km³。这里有着充足的物质资源，并发现有城邦以及原住民，原住民称这片大陆为“歪塔伦蒂大陆”。
//
//“考蒂雪山”
//“考蒂雪山”是位于大陆北部的高山，其常年覆盖着皑皑白雪，最低温度可达零下48℃。山脚下有大片松林，这里居住着大陆最原始的物种之一——绿瞳鹿
//
//绿瞳鹿，它们抗拒与人类接触，他们从“云海”迁徙到这里，在极寒下，它们进化出了耐寒的特征，绿瞳孔鹿的皮毛是上好的布料，可以有效的抵御严寒，在原住民疯狂的捕猎下，已经近乎灭绝
//
//展开文档
//“云海”
//“云海”是“维塔伦蒂大陆”占地面积第三的森林，因常年被云雾环绕而得名。
//这里拥有着许多原始的物种与植被：
//
//关闭
//物种名	眨鱼	金丝藤	飘虾	蓝瞳猫	原夜	神盾犬	塔尔	三尾鸟	更多物种正在探索…
//
//据原住民所称：“云海”的山泉水具有治愈伤病的作用。
//经证实，山泉水可以治愈伤病
//“德赛尔人族地”
//在南部的环形山中你可以看见“德赛尔族地”，这里是“德赛尔王国”的发源地，祭坛摆着德赛尔人祖先的石像，每年都会有很多的教徒来这里祭拜。
//
//不知因为何种原因，这里的温度永远让人感觉惬意而舒适，温馨的感觉从那树叶间穿过的一缕缕阳光体现，在那光中漂浮的细小杂物犹如天使的羽毛在微微抖动，在这其中，在这氛围下，好似真的见到了自己的先祖，轻轻搀扶着自己的手……
//
//“尤娜威斯群岛”
//被称为最浪漫的岛屿“尤娜威斯群岛”已经很久没有对外开放了，但在民间流传着各种原因，众说纷纭，至今还没有准确原因公布于众。
//
//“天马森林”
//在德赛尔族地以南的天马森林是全大陆面积第二的森林，这片森林的的土地有25%延伸到了大陆中部，上好的木材一般都取自于这里，所以也被称为木神的恩赐，这片森林的深处居住这一种神圣的物种，天马，他们是有翼类马科生物，对人类很友好，如果它们接受了你，你可以骑上它们在广阔的天空翱翔。
//
//在这片林中，偶尔会有身上散发着彩色光芒的蝴蝶成群游荡，在当地传说中，这是幸运之士的见证，它们轻轻地飞过，好似在指引着人们跟随它，附近村子的居民偶然会祭拜那些蝴蝶，他们相信，蝴蝶能引导他们走出苦难。
//
//早年间，这里曾是皇室的私人园林，不知何时，现在已然成为了大家共享的场所，但维塔伦蒂的法令明确规定，不可任何做出任何尝试破坏森林的举动，虽然这里允许砍伐树木，但绝不容忍过度砍伐，只有维持住这样的生态，大自然才能永远的造福于人们。
//
//“结晶庄园”
//四处可见的结晶矿是这里的地标，在水晶生长旺季，你可以来这里开采水晶，因此允许私人挖掘的“结晶庄园”成为了想要致富的人们最佳选择。
//水晶种类：
//
//关闭
//名字	紫水晶	蓝水晶	莹水晶	绿岩水晶	腐蚀水晶
//（近期出现，带有极强腐蚀性，不适宜出售或加工）
//斯威特王国
//
//斯威特王国建立在英特斯丁森林，现任国王：“克莱乌”。一位出了名的明君。以爱戴子民而闻名于大陆。这里的现居子民较少，多为上了年纪的老人，年轻人们一般会忙于家业，到了一定年龄的年轻人们，一般都会选择出国发展，因此，维塔伦蒂的业界著名商人多为斯威特人，除了生活方式奇特，他们的传统文化也是别具一格，把房屋建在树木上，被这里的人们认为是得到树神的庇护。
//展开文档
//
//  
//德赛尔王国
//-3a36c9fc9abe42f2.jpg
//流浪者骑天马拍下的德赛尔一角
//
//德赛尔王国四周建立着巨大的城墙，整体结构围绕山体而建，平民区还绕着山脚，而巨大的皇宫建立在山顶，在它们之间，是这里最大的商贸中心，
//德赛尔王国现统治阶级不明，面积约为斯威特王国的3倍，他们一直有吞并斯威特的野心，且现等级歧视现象频发，暂不适宜外来者入驻，自两年前的德塞尔逐月事件发生，此现象依旧维持至今。
// 
//德赛尔逐月事件：
//  
//
//展开文档
//基地、前哨与社区
//“M.E.G.大陆研究所”
//“M.E.G.”维塔伦帝大陆研究所，致力于研究这里奇特的生态系统和古老的生物，他们不会参与政治事件，在大陆的南部，拥有一块1000平方公里的研究土地，平时不允许无关人员进入。
//“大陆维和联盟”
//他们是本土的组织，负责维护大陆的和平，至少刚开始是这样，现在的官员使用实体和自己的权利谋取利益，至于民众的死活，他们毫不关心。
//入口与出口
//入口
//在任意层级中通过触摸一幅绘有中世纪建筑的油画可以切入该层级。
//出口
//向大陆人询问去往禁区森林的路，多数情况下会获得一个羊皮纸地图，沿着地图的红线行走就会渐渐发现已经进入了Level C-430。
//将自己完全埋入考蒂雪山的雪中会切入到一个随机的宜居层级。
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1310{}