//层 匚-叁捌壹
//评分: 
//+95
//+
//–
//X
// 
//
//生存难度：
//
//顺居
//
//司幽
//荒渊
//鲜有异兽焉
//层 匚-叁捌壹，乃列后室层群“匚”之其间，序叁佰捌拾壹尔。
//
//层叙
//四海六合之外，有沧溟1也，尚不知其界。其中有峡，环湖而存。山高岸束，崖峻峰朗。中央以壑，隔与阴阳。双生洑2流，涌动不歇。湖阴吞日，湖阳吐月。注而不满，克作归墟。洑生壑显，月出其中；诸山并道，日盖其上。其然反复，连焉不绝。晴雨交叠，阴晦不常。旁近六屿，均设铜鼎，云螭环身，其色金黑，广口刻其名，曰：草臧、虢阳、凝波、南泽、承静、珌渚。
//
//草臧
//ink-g902fba55e_1280.jpg
//草臧屿一隅，余所作也
//
//初至沧溟，必登于此。几比鼎处，有亭跃然。亭曰「青聍」，斐草叠翠。舟子傍岸，水波横平。由鼎处始经北遥望，呈海天交合之景，云深而藏丹3，弥漫无际，稠云淡淡。路出其南，林深通幽，具往复行百跬，遂见一庭，依峦而靠，曰「草臧院」。门扉轻掩，呼之无回。推门而入，可观四合，室庐清冷。佳木枯槁，窗寒萧冷。虽雕甍画栋4，然亭台桎梏，已见旧态颓圮5，无复繁奇焉。
//
//虢阳
//反折「青聍」，摇舟北使，过草臧岛。所见东北之孤崖伫于虢阳。其崖修广，绝胜云端。可见鸟雀盘桓，鸣声悠然清雅。泊船于岸，然无足之余地，徒增一鼎。从鼎口望，中有拨盘，内不可见。鼎下有言，以刻石曰：「休憩变幻」。其迹清広亘远，无可复。见者心脾爽厉，感怀而寐6。再寤7，见孤崖，但兀然一丘耳。此举复行，亦显高峰，如隔两世尔。
//
//凝波
//西北望凝波岛，甚觉惊异。其岸以碑石鳞立，出圹8而彰9。静听无闻，极视无魂。其具有文誊，曰「流浪者之墓」。悲矣，余忆曾往之太湖，有予宿者之曰汾伯公，亦与余云：「夫济远矣，必会乡邻，如有兵燹10，则民苦也。然天下鄙陋，夫如是知者鲜矣，汝亦须达11。盖可谓一叹，然其荒恨不可治也。」
//
//南泽
//南泽积云千百态，霞丹靡际，气拢天海。其岛岩通体曜彩，表里明霞，左右绛紫，无不使观者神迷。其岸西有潀洞12，自岭而下，冲刷岩壁，散彩传明。碪石滑质，具凝神之气，凿岩以取，置额角、外眦，相摩周转盏茶间，有醒神精目之用，可观五里外。
//
//承静
//自南泽泊舟子往东南，诡及承静。其名称岛，实为寺。其无岸基，全然浮于水，背倚昂山。山涧落溪，溅于底，暴涨不绝。承静寺上下而波，谌啅13灏溔14。寺左有穹碑，有书于上曰：「承动化静」。寺右有圆池，其间清泉一泓，平如止镜，不以寺摇而满溢。前庭颇伟，殿构巧致，壁龙凤翔舞于四周。循落溪处而上，可至寺后。有台径之通顶，然后庭逼侧，阶石孤险，涉足须秉力。及其顶，可见层叠浪岭，观此生阔绝之景。后庭独有一石，中道而开，但显一缝，有如深壑。其旁支细裂，如万千枝叶，呈蜿蜒轇轕15之势，无可名状。风动，缝内如埙16音，俯听其声，但若一人声「呢」尔。
//
//珌渚
//珌渚屿，系极南之岛，几近于湖阳之洑旁。其上生灵浩荡，岸齐赫花，未闻花名，攸积十馀里。直湖阳处升月，有小雨落，云烟并起。栖波之鸟，惊腾号噪，至水脉通联处，落足木枝。可见岛之繁化殊育，亦有石蟹、海鸭、蚌蛤之生，且多存诡质怪章之异兽尔。
//
//异兽
//沧溟有兽，居于珌渚，其状皆异，性温也。一名俐扻17，人面牛身，生两口，居于水岸，一口饮海，一口吞蒿。其鸣自名。于人无害焉；一名潽遗，其状如隼，足为牛蹄，翼羽状如人指，赫然怵目，然喜近人。若喂草臧之树果，将赠其羽三。研磨捣碎，伴海水二两吞服，可治耳疾；一名麦格，亦自称「哀母一己」，谓己曰涉险总衙。其族庞然，状如人，可学人语。行着诡谲，不合体统。岁性温顺，然好诳言戏人，言余古者，其族系千年后人，贻笑大方耳。然其善使器，可书，亦赠余之纸笔为摹，形同八股，其亦称沧溟为后室尔，亦知来去之法。
//
//卫所、堠及寨
//此地亦存麦格族之卫所，设于草臧岛。沧溟地势奇也，未见丰裕之实，徒山川之胜，盖卫所陋巧尔。
//
//麦格「桃园渊」卫所
//该卫所实存族人壹佰有柒
//其欲加伟18，以待来人悉具，余亦见19宾20矣
//来去之处
//来处
//
//岁秋七月乙末，初至汾州，尝过故人吴君之居所，见其门环绯紫，盖视之。但十息，忽入幻市，其烛无焰，色呈雄黄，其内空而无人，余行数刻，终见一缺，入内而感坠。遂至此。
//去处
//
//游舟反虢阳岛，待日出洑，月坠湖面，二者于壑而交，色光渺渺，方见盘中存物，乃为一六爻成卦。然！爻，皎也，日月相阖，方有动变之姿。鼎周生蓍草，拾其五十，陈于前，行蓍筮之法，心念去矣，诚然而掷。使六次，如三卦雷同，六卦为阳，方使出。然余暂留此处，未尝去也，麦格族亦无告所至何地也。
//作者信息
//« Level C-380 | Level C-381 | Level C-382 »
//
//Footnotes
//1. 大海
//2. 旋涡
//3. 太阳
//4. 雕：雕绘；甍：屋脊；栋：支柱。指有彩绘装饰的十分华丽的房屋
//5. 破败
//6. 睡觉
//7. 睡醒
//8. 圹 kuàng，离开祖先墓地，引申为离乡。
//9. 显然，明显
//10. 战火焚毁破坏
//11. 通达
//12. 潀，古同“潨”，亦作“潈”。意为水的交汇处。洞，山洞，清楚透彻地，零等意思。潀洞：急流
//13. 拼音：chén zhào。表示非常吵闹
//14. 拼音：hào yǎo。表示水无边无际。
//15. 拼音：jiāo gé。交错杂乱
//16. 拼音：xūn。一种土制吹奏乐器
//17. 拼音：lì sǔn
//18. 增加规模
//19. 被
//20. 当作客人对待
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1381{}