//Level C-311
//评分: 
//+8
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//Level C-311是后室C层群的第311层。
//
//
//我在这平原漫步，在这繁星的苍穹之下
//满心欢畅
//仿佛所有的罪恶从此消失
//留下的只有自然的芳香
//一草一木一河一湖诉说着这里的故事
//这里曾是一片荒漠
//来到这里的人
//或绝望
//或迷惘
//与这片荒漠一样死气沉沉
//而现在
//这里变成了生的天堂
//留在这里
//与灿烂的繁星和壮美的落日为伍
//将会是你发自内心的愿望
//这里没有危险
//没有谎言
//有的只是放松
//与欢畅
//这真美啊，不是吗？
//
//描述
//1
//Level C-311夜晚图片。
//
//Level C-311是一片以平原为主的区域，表面积约30平方公里，因其进入的难度以及其内资源的匮乏，Level C-311内未建立任何基地。Level C-311内分布着三座小型休眠火山，岩浆黏性小，因此不构成威胁。Level C-311的昼夜交替很快，白昼30分钟，夜晚20分钟，昼夜长短全年无变化。气温、降水适宜，无极端天气。Level C-311内有五条内流河，均注入同一湖泊。Level C-311内有植被覆盖，以草本食物为主，鲜有木本植物。
//
//进入Level C-311后，人会立即消失贪婪，虚伪，死板等负面方面的思想（离开Level C-311后该效果消失）并会产生对Level C-311风景的极度迷恋和向往。流浪者常会盯着星空进入恍惚状态，这种迷恋可使人心情愉悦且不会对人产生任何负面影响，也不会影响人的正常活动。因此Level C-311内不存在争吵，打斗，掠夺和欺诈等行为。
//
//
//在这沙漠的中央
//一朵玫瑰花
//静静地散放着芳香
//她躺在玻璃罩中
//那是她的追求者给予她的保护
//她喜欢整理自己的花瓣
//舒展自己的枝叶
//她很脆弱
//夜晚容易着凉
//她的追求者总是心急如焚
//她喜欢戏弄他
//总是不满足于他对她的付出
//用自己的病恐吓他
//而她的追求者也愈加自卑
//最终在愧疚中潸然离去
//只留下玫瑰花
//静静的躺在这空旷平原的中央
//孤芳自赏
//
//2
//玫瑰花
//实体二是一颗大致位于Level C-311中央的一颗被玻璃罩罩住的玫瑰花，目前的探索发现这是Level C-311内唯一一朵玫瑰花，玫瑰花可以与人对话，方式未知。玫瑰花曾是小王子的挚爱之物，常喜欢与人谈起她与小王子的故事。
//
//
//在这广袤的平原上
//有一位王子
//他绿色的长袍
//飘逸灵动
//正像他那热情的心
//充满了青春活力
//他爱上了一朵花
//那是一朵美丽，优雅的花
//他愿意为她做任何事
//他喜欢听她讲故事
//无微不至地照顾她
//他的心里已经放不下另外一朵花了
//因为这朵花
//整个平原对他来说都变得美丽
//他知道
//这个平原里有他所爱之物
//空气对他来说都变得香甜
//可是
//花儿的病越来越重
//他想帮助
//但是玫瑰花的刺让他避而远之
//玫瑰花总是觉得他做的不够好
//他也觉得自己是在帮倒忙
//于是
//他化作一缕金色尘埃
//离开了
//他是这里的王子
//却只能统领他自己
//他在这诺大的平原上游荡
//但他的心里
//一直存在一朵花
//
//小王子
//3
//访谈人员给小王子画的像。
//
//实体一是身高约1.4米，身穿绿色长袍，年龄约7岁的金发男性人形生物。他自称“小王子”。小王子常在Level C-311内游荡，若遇到小王子，他会主动跑来与流浪者交谈。与小王子交谈会使人感到极度的舒适和放松。对话的内容多为小王子自身的一些感悟。与小王子交谈过后，流浪者会有“心灵被洗涤的感觉”。对话结束后，小王子的身体会消散成一缕金色尘埃随风飘散，并在Level C-311的某一处再次出现。
//
//基地、前哨与社区
//无已知基地、前哨与社区
//入口与出口
//入口
//在Level C-264的夜晚仰望星空有几率进入Level C-311
//出口
//从Level C-311的边界走出可进入Level C-287
//
//
//
//
//这是一篇单纯、唯美、沁人心脾的童话
//却映衬着你我的倒影
package lvls13x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1311{}