//Level 586
//1.PNG
// 
//
//生存难度：
// 
// 
// 
//Level 586 是后室的第587层。
//
//描述
//Level 586，也被称作"迷失数据" 是一个直到最近才被认定存在的层级。M.E.G.研究员Sarah T.首先研究了Level 586在理论上存在的可能性，并在通往该层级的入口被记录之后的几个星期前证明了它的存在。自从被发现后，Level 586便被频繁地展开研究。
//
//Level 586由AI Koko访问，AI Koko通过一个类似于切出的方式进入这个层级，一旦Koko进入了本层级，它就会和拍摄的照片一起回传对本层级的描述，这便是本文用来描述Level 586的信息来源。
//
//Level 586表现为一片广袤的黑色虚空，并在虚空之中包含了被物理表现出来的数据，这些有物理实体的数据包含：
//
//损坏/像素损毁的图片，看起来被拼接到了极薄的二维物体上
//物理意义上的1和0
//时常播放的来自于声音文件中的声音和音乐
//从PDF文件中导出的文本内容的三维物理实体
//本层级中没有实体出现，因为这里没有给实体依存的物理实体。本层级全覆盖无线局域网，Koko通过WiFi信号将信息回传。
//
//奇怪的是，大部分在Level 586中存在的数据并不像是来自后室，而更像是来自于前厅。这也间接性的证实了数据可以像物质一样切入后室之中。有一个可能关于数据切出的例子是，有的时候当你删除一封邮件，你可能在废件箱里找不到它，此时这封邮件大概率就是从你的电脑中切出到达了后室。
//
//一些进入到Level 586的数据被损坏了，这些数据的损坏程度似乎随着其进入后室的时间增加而加深。这些损坏绝大部分是位翻转1，至于位翻转是如何发生的尚且是个无法解释的问题，因为Level 586中不存在任何可能导致位翻转发生的因素（最主要是如宇宙射线）。
//
//基地、前哨和社区
//本层级中唯一存在的意识是一份AI Koko的副本，我们特意将其留在这里，以便于后续的研究和数据记录。
//
//入口与出口
//入口
//在Level 400中的计算机上删除一份文件会使得这份数据传输到Level 586。
//将终点上的文件拖拽到一个标有“已损坏”的文件夹中会将该文件传送到此层级。
//Level 586与密码之间存在联系的可能性保留，但是其并未被证明。
//出口
//数据可以通过该层驻留的Koko副本传输到其他层级中的计算机上。
//
//Footnotes
//1. 位翻转，也被称之为软件错误，是指的单一位数据被损坏，此处的数据发生翻转，由1和0相互转换。位翻转一般发生在高能量宇宙射线下，存储结构收到干扰的计算机中。
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//凭证认可
//MEG实验记录 18735 “上传项目”
//项目目标： 传送一个人类意识到Level 586中。
//
//项目结果： 未确定，受试目标被认为行动中死亡。
//
//项目总结：
//“上传项目”第一次被概念化的提出是在两个发现之后。第一是Level 586的发现，它的发现使得人们相信物理实体无法进入这个层级。但是这也给予人们挑战，第二便是人们发现了level 522中，可以上传任意被置入物体意识的机器。上传者的意识备份可以被存储成数据文件，意味着存在意识上传到Level 586之中的可能性。
//
//项目更新 8/12/██
//我们从Backrooms Robotics公司采购了这台机器，从现在起我们都在努力调整它使其能够正常运作。
//
//项目更新 12/3/██
//在几个月的工作和调试之后，我们成功的调试出了这台机器的所有功能。被选中上传意识的人是M.E.G.的研究员Sarah T.，她是自愿报名的。
//
//项目更新 12/10/██
//上传过程很顺利，机器杀死了Sarah T.但也同时保存了她的意识，这意味着项目的这一步顺利完成了。
//
//项目更新 12/22/██
//Sarah T.的意识已经被传输到了Level 586通过终端机，到目前为止她还没有任何信息回传，我们并不清楚这一步顺利与否。
//
//项目更新 1/22/██
//在整整一个月的了无音讯后，我们宣布了Sarah T.研究员已确认行动中死亡。 我们所有人都为她感到悲痛。 她的成就包括了 Level 586的方案和 基础数据库的
//
//我没有死
//
//ㅤ
//
//
//
//
package lvls5x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl586{}