//在时间之初，一片光明之海倾泻在我们的天空之上。当最初的人类出生之时，他们目睹了这美不胜收的景观，便将其命名为“星星”。这些星星令人类繁荣，如同天空中的灯笼，为凡人们指明他们应走的道路。然而在这些星星诞生几十万年后，它们开始死去。起初，进程缓慢，它们的亮度以常人无法察觉的速率下降。然而，它们隐匿的速度呈指数级增长，最终已经完全暗了。
//
//诚然，这并未影响人类：在星星消失之时，他们早已不再利用星星，而是偏爱他们人造的火炬。他们并未意识到他们会消失——如果在黑暗中没有那些东西的话。那些隐居之人，未曾拥抱人类在科技领域的进步及他们对星星的忽视。他们依赖天体在陌生的地方寻找道路：然而现在，他们被抛下了，漂浮在深渊中。
//
//你是这些个体中的一个，你离开了文明。你并非唯一一个背叛自己亲人的人，即便他们的缺陷让你并不想和他们有联系。于是，你独自离开，跟随星星。
//
//hqdefault.jpg
//隐去
//
//应许它们将你引领至未知。
//
//应许它们将你引领至虚无。
//
//应许它们将你引领至无尽的黑暗。
//
//但当你随它们而行的时候，它们已然将你抛弃。奔赴虚无。你也并不确定如何做。你确定要继续长途跋涉吗，亦或回到你来时的地方？在你的犹疑之中，你选择了停在你所处的地方。你思考着为何星星会离去。或许它们已对人类感到无趣？它们这样做是为了考验人类吗？你又在这里待了多久？于是你在最初几日便迷失了方向。而你还要在这里停留多久？你孑然一身，任凭偶尔出现的流浪者和寥寥几个烁化为形体的抽象存在将你围绕？
//
//在此处，你再也不在你周围的事物上投入精力——即使它们已经在你身上生长。它最初是小而微弱的藤，艰难地于你手臂上攀缘；它们肆无忌惮的缠绕你的手腕，就好像你只是大自然的一部分。但时光流逝，你的模样已被植被完全遮蔽，小昆虫开始在你的身体中寻求庇护，像家一样对待。虫儿们与你交谈，低语着那些关于与你所渴求的无比相似的星星们的故事。
//
//Crotalus_cerastes_mesquite_springs_CA-2.jpge
//那条蛇
//
//“噫，堕落的凡人，我可否致辞于汝？吾乃Ixtal，首名裂(‽)头之子。星星抛弃了你，不是吗？我想知道你停留在这里已有多少时日，去重温星星从你身上拿走的一切…然而也有向星星索取的方法。若你有意，我也可以去裂(?)头把它们偷回来并赠返给你。可这样做我会失去生命，你的希冀是否强烈到可以将我的存在置之不理？”
//
//你粗糙的双唇翕动，发出刺耳的低语：“是…”
//
//“当然，我不该低估你的决心。这样想来，我亲爱的尸骸…”
//
//这条蛇缓缓从你身上离开，爬回黑暗里。片刻后你看到了它——星星。
//
//stars.jpeg
//星星
//
//它们降落了，划过天空，直奔地球。那些早已忘记了那些发光天体的人们张开双臂，欢迎星星的到来。悬挂于空中的美丽有如梦幻；它允许我们忘记了我们的困扰，捐弃我们的恐惧，让我们成为自己。距离我们在这个世界上初次辨认出星座已过了多久呢？几个小时？几天？几年？
//
//当流星向地球坠落，并在大气层中燃烧殆尽，仅留下一道炫目的光明时，人们会轻易向其许愿。不久后，其它星星也随之坠落，一会儿，一道道完整的条纹在天空中出现，就像空白画布上的笔触。
//
//夜光，因交相辉映的对比色与树冠而显得更强，这真是个迷人的景观。光阴流转，这景色展示着如梦似幻的景观和完美无缺的地平线，愈发壮丽、愈发荣光万里。正是如此一片高挂空中的，由闪烁星星构成的缥缈之海。然而这仅是昙花一现。自然中最美的风景往往只存在一瞬。它们坠落在地球上，以相当于千百个太阳的力重击地面。
//
//为群星令人欣喜的力量所痴迷，你就能永远被丢弃于此。
//
//永远。
//
//“飞升”进程，顾名思义，为一个人迅速升到高空，患上高空肺水肿——致使其死亡的过程。在这之后，他们的身体就会以极快的速度落至地面，并对靠近坠落点的任何人员造成伤害。然而，人们相信，这个人的灵魂在这样的进程之后仍然存活，并飘到称为“失落之城”的Level 555。这，将作为他的“来世”……
//
//— 摘自一份描述“飞升”进程的废弃文件
package lvls5x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl555{}