//Level 532
// 
//
//生存难度：
//等级 3
//
// 
// 
// 
//medium.jpg
//Level 532中的第七个门口。
//
//Level 532是后室的第533层。
//
//描述:
//Level 532是一个方形的小庭院，四周被风化的石墙所包围。这些墙向上延伸至视线尽头之处，环绕着一片毫无特色的天空。如同模拟标准的昼夜循环般，天空每12小时在黑白之间切换一次，在大约2分钟的时间内迅速褪色并转换为另一种颜色。分散在Level 532的是一系列由11个巨大罐子组成的墙，这些罐子由相同的石头制成，其中似乎是细腻的燃灰以及大块碎骨。墙壁上有七个门口，每个门口上方都有一个符号。其中六个门口通向其他层级，第七个门口上方有一个骷髅头符号，由一扇金属大门掩蔽，通向Room 532.1。
//
//在“夜间”，Level 532充斥着被称为影子的实体。影子共有11个，它们没有形体，外观轮廓近似人类，在这一层中漫无目的地飞掠。影子在流浪者身边经过后，流浪者会在几个小时至几天的时间内失去知觉。因此，强烈建议避免在夜间探索这一层级。
//
//Room 532.1:
//Room 532.1是一个通过大型金属门与Level 532相连的区域。这扇门虽然相对容易从外面打开，但无法从室内被移动。Room 532.1的形式为一条长而破旧的石制楼梯，楼梯底部的铁杆隔出一个小房间。房间中心是一个巨大的人形实体，其皮肤呈深灰色，披挂破旧的红色长袍和黑色金属链。该实体没有面部特征，只有一只位于面部中央的有着蓝色虹膜的巨大眼睛。该实体已表示出与流浪者对话的意愿。尽管它没有嘴巴，但它可以通过未知的方式发出人类的声音。它的所有发音都是英语，尽管M.E.G.成员Tong Huynh（越南裔）在收听该实体的录音时报告说听到该实体用越南语发言。
//
//Room 532.1的一个显著影响是，当连接其与Level 532的门关闭时，房间内的流浪者会经历时间膨胀，以至于在房间内的每一小时相当于房间外的大约5.5分钟。
//
//入口和出口：
//入口：
//Level 532可在以下level中通过一扇标有圆圈的石门进入：Level 178.1、Level 97和Level 11.1。每一扇石门都通向六个门口中的一个。其余三个门口的入口尚未明确。
//
//出口：
//Level 532可以再次通过用于进入的门口来退出，但是这些门口将通向不同的层级，而不是与原入口所在的层级相同。
//
//标有星星图案的门通向Level 78。
//标有书籍图像的门通向Level 117。
//一扇标有被划掉的大脑图像的门通向Level 112。
//标有十字图形的门通向Level 584。
//标有橙色明亮火花图像的门通向Level 155。
//一扇没有标记的门通向level 404。
//附件：
//M.E.G.访谈日志9649：
//采访者：丽塔·凯恩
//受访者：在Room 532.1发现的未命名实体
//
//<记录开始>
//
//凯恩：好吧，那么，呃，你有我可以写在你档案里的名字吗？
//
//实体：当然，丽塔，我们都有名字。我怀疑知道它对你是否有好处。
//
//凯恩：你说说看。
//
//实体： [无法理解]
//
//凯恩：呃，我要把它记为“无名”。所以，呃，你在这个笼子里呆多久了？
//
//实体：比你能理解的还要长。
//
//凯恩：有点晦涩，但还是继续吧。你到底是怎么来到这里的？
//
//实体：我被囚禁于此。
//
//凯恩：很酷，但是，呃。为什么，因为谁？
//
//[远处传来隐约的叫喊声]
//
//未知[从远处]：丽塔，天空开始变了。我们得走了。
//
//凯恩[大喊]：等一下，我要把这几件事问完。
//
//凯恩：上帝，我们说到哪了？哦，嗯，你为什么被囚禁在这里？
//
//实体：人们害怕他们所无法理解的东西。
//
//凯恩：这，呃。你能详细说明一下吗？
//
//实体：他们把我锁在这里，因为他们害怕我的能力。
//
//凯恩：好吧，你再说说是谁把你锁在这里了？
//
//实体：一些傻瓜。当我对他们不再有用时，他们决定抛弃我。他们曾把我当作神来对待，但一有机会就在我背后捅了一刀。我打赌你也信任你的朋友。如果他们有危险，我毫不怀疑他们会把你留在身后。
//
//凯恩：“我打赌你也信任你的朋友”。[她冷笑两声]我不是来跟你玩游戏的。谢谢你提供的信息。我该走——
//
//未知[从远处]:丽塔，我们得走了。
//
//[更多的叫喊声，随后是砰的关门声]
//
//凯恩[低声]:妈的。
//
//[脚步声，响亮的敲击声]
//
//凯恩[大喊]:喂？有人能打开这扇门吗？还有人在外面吗？
//
//[更多的敲击声]
//
//凯恩：该死。
//
//[远处传来笑声，可能来自实体]
//
//[随后是23分钟的静默]
//
//凯恩：他们会很快回来。
//
//实体：我不会指望的，丽塔。没有人回来找我。
//
//[随后是14分钟的静默]
//
//凯恩：能不能——有没有，呃，什么办法可以让我从里面开门？
//
//实体：如果有，你认为我还会在这里吗？
//
//[随后是62分钟的静默]
//
//凯恩：该死，他们要花多长时间？
//
//实体：这很容易知道，丽塔。这里的时间是可以预测的；只是有一个副作用。
//
//凯恩：那是什么意——5天，12小时，19分，32秒。什么？怎么会——你干了什么？
//
//[笑声再次传来，推测是实体发出的笑声]
//
//[随后是53分钟的沉寂，其间可以不时听到微弱的抽泣声]
//
//实体：你知道，我可以帮——
//
//凯恩：去你妈的。
//
//[179分钟的沉寂]
//
//凯恩：你刚才说什么？你能帮我做点什么吗？
//
//实体：你难道不知道最好不要和魔鬼做交易吗？
//
//[凯恩干笑]
//
//实体：只要把你的手臂伸过栅栏，我就能减轻你的痛苦。
//
//凯恩：行吧，那不会发生的。
//
//[63分钟的沉寂]
//
//凯恩：好吧。
//
//实体：这就对了；再往前一点。我几乎能够到你的手了。
//
//凯恩：等等，我——你做了什么？你他妈的做了什——谢谢你
//
//[7652分钟的沉寂]
//
//[开门声]
//
//未知：丽塔？丽塔，我们来了。
//
//未知：哦，我操。
//
//实体：她很好。丽塔，亲爱的，该走了。我会在两年后再见到你。
//
//<记录结束>
//
//注：丽塔·凯恩在Room 532.1被发现时处于休克状态。她目前正在M.E.G. Base Echo接受治疗。此日志的内容表明该实体具有未知的心灵攻击能力。因此，M.E.G.成员不得与该实体接触。
package lvls5x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl532{}