//Level 502
// 
//
//生存难度：
//等级 2
//
// 
// 
// 
//servos
//Level 502许多走廊中的其中之一。
//
//Level 502是后室的第503个层级。此层级表现为一个无限的数据中心。它是在2015/08/13被一个小型的独立探险组织发现的。
//
//描述：
//Level 502是一个无限且封闭的服务器机房。这些服务器在不断地运转且摸起来正过热。迄今为止，所有连接到这些服务器的尝试都失败了。这些服务器排列成了一座迷宫。
//
//这里会不定期地发生一种叫做热浪的事件。热浪是一种表现为Level 502的服务器突然且毫无提示地开始加热到40摄氏度左右的事件。这样的热量会持续2-4小时，经常导致流浪者中暑或热晕厥（即昏厥）。由于此层级其他的一切异常性质的存在，热浪和随之而来的意识丧失被认定为最危险的特殊效应。强烈建议携带杏仁水以避免脱水导致的昏厥。
//
//Level 502的另一项性质为在此层级内丧失意识的流浪者身上所将发生的事。当一名流浪者丧失了意识，他将立即消失，而他们的尸体将在几秒后在附近重现。但那个人（在此称为受害者）的尸体会发生严重的改变。面部的所有孔洞（眼睛、嘴巴、鼻子和耳朵）将裂为圆形孔，而连接着附近的服务器终端的各类线缆将通过上述面部孔洞直接连接到头部。而从天花板上伸出的钢丝将经过手腕将受害者吊在半空中。处于这种状态的人是不会做出反应的，即为功能性脑死亡。
//
//此层级中有一个值得注意的地点：一个名为“方尖碑”的大型哑光黑色矩形棱镜。方尖碑似乎是从天花板上的一个洞延伸到地板上的一个洞里的。这些洞被未知光源照亮。这里也是可以发现此层级的特有实体的地方。
//
//实体：
//此层级内可以找到一个特有实体，它被安置在方尖碑上，被称为“情报”。“情报”是一个人形机器人，穿着两件套的蓝色西装。“情报”的胸前有一块金属标牌，写着“此处有情报！”，一旦它被碰到，“情报”就会提供帮助以换取“自身的一部分”。一旦此交易被接受，此实体就会开始在全层级里给予无用的指示。这些指示只有接受交易者才可听到，且只会持续5分钟。一旦指定的时间结束，“情报”就会停下，响亮地发出“你的指示试用结束了。你愿意用你的灵魂以交换继续下去吗？”的声音。迄今为止，还没有人接受此交易。进一步分析表示，所谓的“自身的一部分”是一个人重要的记忆。而所有试图提醒别人这段记忆的尝试都会导致在一瞬间内被遗忘。
//
//基地，前哨与社区：
//U.E.C.（无羁探险者联盟）前哨
//据报道，在方尖碑附近的一个层级出口附近，有一些未知数量的U.E.C.成员建立了一个前哨。
//他们虽然愿意交易，但是他们会拒绝任何人进入他们的前哨。
//试图强行进入将遭到非致命的武力对待。
//似乎是由研究人员和一个未知的U.E.C.小组组成的。
//入口与出口：
//入口
//Level 120中任何处于工作中的服务器都可以切出至此层级。
//进入Level 172中一个标注了“数据中心”的仓库会来到此层级。
//出口
//尝试访问服务器有小概率进入Level 195。
//掉入方尖碑周围的洞会进入Level 400。
package lvls5x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl502{}