//群星
//
//
//「你恐惧它吗？」
//
//等离子体的舌头舔舐集群心脏周遭的空虚黑暗。
//
//「如果他吓到了你那也没事——它相当值得一看」
//
//我什么也说不出来，即使已经有足够的空气维持我的生命，我也感觉风景独自从我胸膛吸走浅浅的呼吸。
//
//「……它也吓到了我，但它用了一种很有趣的方式吓到了我，你知道吗？这就像你抓着栏杆，紧紧盯着过山车的道的起伏，急切地期待着快些坠落下去。」
//
//强光刺激我的双眼使其抽搐，将我的视野变得模糊。我已经无话可说。
//
//「你无需多言，没事的。」
//
//现在她离我越来越近；轻抚着月华，亲吻着宇宙。
//
//「你知道吗，Nadir，这与我想的有些出入。我妈妈总是说我会同群星共舞，尽管我怀疑从字面上看她就是指的现在这样。」
//
//「Aster，哦 Aster，是何你有如此热情？」
//
//「所以……要在另一面抓住你是吧？」
//
// 
//
//生存难度：
//
//等级：星体/等待分级
//
//宇宙异常
//有限宜居
//实体不足
//Level 599 是后室的第 600 层。
//
//描述
//Level 599 类似于前厅中发现的球状星团，最常见的星体为 M 级主序恒星（红矮星），这一星体约占星团的 60%，但其他几类主序恒星也存在于其中。这些恒星无所施加的引力，与在太空中所发现的恒星相比，它们往往发出极少的热量1。但仍然也有其他类型的天体，如小行星或恒星碎片也可在 Level 599 找到。
//
//尽管 Level 599 是一个类似星际空间的区域，但在无专业设备的情况下在该层级生存是可能的。然而由于完全缺乏合适的资源，长期可持续性的生活则是不可能的。
//
//在该星团中心区域坐落了一颗蓝色的超巨型恒星，这颗恒星被称呼为「Nadir2」，它是在层级中唯一一个观测到具有预期引力的恒星，然而它并未相较于周边的恒星发出更多热量。
//
//由于 Nadir 是唯一的大型引力来源，故此 Level 599 内的所有天体总是围绕其运行或向其坠落。如恒星这类较大的物体都保持在稳定的——尽管有时候是椭圆状的——围绕 Nadir 运行的轨道上。如小行星这类较小的物体反而会直接通向恒星。进入本层级后，个体将自动处于轨道围绕该恒星运行，但也有可能动力遭到改变，直接落向 Nadir。
//
//尽管这些恒星不发热，然而根据推测，在非呼吸性气体的集中区域，过于接近任何一个恒星都可能致命。截至目前，Level 599 还没有死亡报告。
//
//入口和出口
//入口
//Level 78的舷窗偶尔比平时的星星密度更大，打开气闸后即可进入 Level 599。
//
//出口
//出口还未被记录，层级探索仍在进行。
//
//我注视着她坠入火焰的喧嚣之中，她的灵魂挥洒在电离的气体上。她无法转身冲着我，但是我知道她已经感受到了一个人能感受到的最高的喜悦。
//
//天堂演变为一个具有放射性的唱诗班，为她坠入地狱无底深渊奏响小夜曲，原子核能炉紫罗兰色的手臂伸向她作最后的拥抱。
//
//炽热的光芒使我陷入黑暗。
//
//Aster，哦，Aster，是何让你如此多愁善感。
//
//他们在观景台上等候，看着新星散落于恒心虚空的斑点画布上，用天堂般的光芒哺育它。而她在万物中心，同群星共舞。
//
//收件： saida@backmail.com
//发件： lrichmund@backmail.com
//标题： Level 599
//
//老实说，我没有时间或者精力去讲什么邮件形式了，所以我就只说重点的事儿，599现在发生的事简直一团糟，Aster消亡了，猎户星座勉强的支撑着，整个系统一塌糊涂。这是我最后一次警告你，Aida，你需要他妈停止在 Level 78 的工作，我要给「流浪癖」递交辞呈，直到另行通知。
//
//收件： lrichmund@backmail.com
//发件： saida@backmail.com
//标题 回复：Level 599
//
//我理解你的担忧，但是我们还有很长的路要走。如果你要离开我们都会很想念你，然而我仍然希望你能够重新考虑一下。
//
// 
//
//生存难度：
//环境性危害
//极度不宜居
//实体绝迹Aster%20porthole.png
//从 Lvel 78 舷窗透过去看到的 Level 599
//
//Level 599 是后室的第 600 层。
//
//描述
//Level 599 类似于恒星内部；一个持续进行核聚变的炒热等离子海洋，正因如此，该层级无法安全进入，只可以透过 Level 78 的舷窗从外部观察。
//
//虽然舷窗视野十分明亮，但只要你不打开气闸，热量和辐射就不会袭来，所以站在它附近时安全的。由于设备的灵敏度有限，进行光谱分析时不可能的，但据信其温度达到了恒心核心的水平：几百万开尔文。
//
//在 Level 599 处于在 Level 78 可见状态时，试图打开气闸将使得 Level 78 充满高温和辐射，这将几乎杀死附近的一切，故此对 Level 599 的观测只得从外部进行。该层级的大小是未知的，尽管我们假设该层级不存在重大地理性质偏差。
//
//Level 599 最令人惊讶的一点是它发出的持续无线电信号，当一个无线电收发器被放置在舷窗附近时，尽管无线电频率有很大的偏差，它仍然会收到一个连续噪音流。偶尔，无线电信号会被转换为更清晰的东西，甚至被观测到类似于音乐甚至人类语言的信息传递。该层级是否存在意识还有待商榷。
//
//记录开始
//13/01/22 11:47
//
//以下是 Aida Sangstorm 和 Simmons Creel（B.C.A. 的「流浪癖」探索小组）同 Level 599 内异常现象之间的试验采访，他们在舷窗附近放置了一个无线电收发机。
//
//Aida：——抓住这个该死的东西。[她清了清嗓子]这里是 B.C.A. 探索小组“流浪癖”的 Aida Sangstorm，如果这个层级真的有某种形式的意识，那么现在是一个展示你自己个人能力的好时机。
//
//[收发器继续接收静态噪声]
//
//Aida：让我们再试试，我的名字是——
//
//[接受的信号突然转变，开始播放The Stranglers低音频质量版本歌曲“Golden Brown”3，Aida对此看起来做出了明显地反应]
//
//Aida：我说我的名字是 Aida Sangstorm，来自——
//
//[无线电信号登时转换为静态，Simmons试图调整收发器以获得更清晰的信号]
//
//Simmons：无线电波频率变化是随机的，我不确定是否我们可以……
//
//Aida：相信我，我们需要打通联系。
//
//[Simmons继续调整收发器，直到其收到连贯的声音，现在这些声音更接近于语言了。]
//
//599： 唉，[?]落在星云状的突触上。
//
//Aida：你能听到我的声音吗吗？[她走近舷窗。]
//
//599：软机器搅动天体之合成，我们以生物之活力以同光子斗争。
//
//Simmons：我可以试着发送一个无线电信号，也许这样我们就可以沟通了。
//
//Aida：你是说你还没这么做？
//
//Simmons：抱歉，女士，我现在就做。
//
//[一个约300Hz频率的信号被作为测试广播到层级中]
//
//Simmons：好了，现在我们只——
//
//记录结束
//在采访被叫停前，记录突然结束。Aida解释说录音设备是在Level 11从舷窗可见的同时关闭的。另一项采访尝试提上日程，然而 Level 599 此后没有再被观察到。
//
//空气仍然使人恶心。我跌跌撞撞地走过车站，直到我能感觉到我的脸沐浴在她天体的光芒中。
//
//我笑了，哪怕只是一瞬间，紧接着我感到罪恶感如潮水向我涌来。
//
//“不，我来这儿不是为了原谅你的”我叹道。
//
//我告诉自己，她不是故意让这些事情发生的，但我的脑海中却有一种发痒欲望的感觉一直在提醒我她在与Nadir的宿命对唱中的表现。
//
//Aster，哦，Aster，是什么让你如此凶猛？
//
//无线电颤动着对生命说道：“我不指望你可以，讲真，我不确定你是否可以这么做。”
//
//我摸出一个平坦的地方坐下，面对着热浪。我一点也看不到她了，但至少我可以感觉到她的存在。
//
//“他们给了你多久？”Aster问道，她的声音里充满着遗憾。
//
//我任凭潮湿的空气在我呼气前给了我一个温暖的拥抱，“几个星期，他们估计。我不能相信有多少人会在意——Aida甚至不忍看我。”屋子里一阵沉默：“虽然，倘若我是诚实的，我也不认为我足以这么做。”
//
//“别这么说”她怜悯反驳道：“你现在只是……有些不同了”
//
//“是的，我不同了，就如同我现在站在什么该死的核弹边上，Aster。”
//
//接下来的几个小时我们两个都什么也没有说，我只是让我的皮肤吸收更多的辐射了——现在这已经不重要了。
//
//沉默被层级广播公告打破了——关于畸点的一些东西，或者别的什么。我没有注意它。
//
//“你不能再待在这儿了”她对我说，一个声音明显的隆隆声振到了站点：“你会死的。”
//
//“我已经将死了，Aster，我现在最多也就是希望死亡快些来临。”
//
//我已经没什么可以失去了，在这一切之后。
//
//尽管无线电接下来完全静默，但我仍能感受到她的犹豫：“嗯……我至少可以试着让一切回归正轨”
//
//我停顿了以下，压抑愤怒的强大力量在我的身体中奔腾。
//
//“即使再你所作一切之后”我说，这时候我的声音因着遗憾与怜悯而颤抖：“你仍然试图去修正你的错误。”
//
//无线电的静音干扰声音变得更大——它现在越来越近了。
//
//“我们没有时间再去辩论了，现在就有一个解决方案等在你面前，而且你知道这是对的。”
//
//“可以做的对事”我打断道：“也许曾是如此，但现在只是……甚至我们不能通过放弃这些事去寻求解脱，你知道吗？这是屈尊降贵，再完美的苍蝇终究还是苍蝇。”
//
//她的声音颤抖道：“我知道你讨厌我所成的形态，而且在某种程度上，我必须同意你的管带你。在人眼中我已犯下不可饶恕的罪恶，但在神眼中，我距衪最近，接近成神。”
//
//我冲向收发器，将其摔到站点的墙壁上，“你不是神！Aster”我咆哮道，下巴上烧焦的皮肤裂开：“我甚至不知道你是否还是‘Aster’了。”
//
//“我更喜欢认为我是最好的自我，Orion”她通过收发器发出痛苦的声音：“最好的自我，来自宇宙之心脏中所锻造而出的什么东西。”
//
//我低下头，伸手去拿收发器，我用手臂将其捧在胸前，痛苦的抽泣着：“Aster，请你别……我不能这样做，我们不是一路人，从来都不是。”
//
//“或许的确如此”她耳语道：“但倘若这里还有一些希冀，你难道不愿意去带上这种希冀继续你的人生旅途吗？如果你继续待在这儿，你会死的，然后你就再也无法见到我了。”
//
//“如果事情真的发展到了那一步”我停顿，热泪盈眶：“我想，我的终结也会是你的终结，这可以安慰到我。”
//
//“他们不必要走到最终的……他们可以只是一个瞬间。”
//
//我什么也没说，此刻——收发器仍然在我胳膊下塞着，闷在我的胸口前。我的双腿终于又有了精力把我抬起，拖着我自己走向气闸。
//
//站点的晃动趋于平息，我的肺在临别时吸了一口新鲜的氧气，我的眼睛最后一次闭上。
//
//“好。”
//
//我们亲爱的 Aster 曾是后室的第600层——愿她的光芒继续燃烧当她回到 Nadir 的怀抱时，再会，Saltor Stella。
//
//Aster Reeves
//1999–2022
//“我妈妈总是说我会同群星共舞”
package lvls5x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl599{}