//Level 524
//好吧，好吧，我该怎么做这个……啊！在这呢，新页面。现在，让我们开始吧。
//
//首先是评分模块。
//
//评分: 
//+35
//+
//–
//X
//好的，下一个是生存难度……呃……难度……难度，啊！宜居，那就行了。
//
// 
//
//生存难度：
// 
// 
// 
//好了，现在是层级本身。
//
//Level 524是后室的第525层。它看上去就像作为不对——它看起来是一家相对较新的医院。
//
//描述
//不，等下，大小不对。
//
//描述：
//Level 524 等等，我需要给它加粗吗？让我们再来一遍。 Level 524似乎是一家无生命体存在的医院。不同寻常的是，该层级似乎不是无限延伸的，而是有限的，就像个普通建筑。医院里有许多被遗留的医疗用品，不哦老天，它是“不”还是“还”？呃——我猜猜吧。还有许多空床。尽管并无明显能量来源，该层级似乎有着无限的能源和自来水。食物也可被找到，如后文所述。
//
//Level 524的外部被厚厚的绿色藤蔓覆盖。在医院大厅的许多窗户上可看到大量的紫罗兰花。通过前门可离开该建筑。外面的水平跨度范围是无限的。它看起来像是一大片干草地，上面遍布生长着许多薰衣草色的花。不建议在外面待太久，因为——η？是你吗？呃——我待会再说这个。η？！
// 
// 
// 
// 
// 
//电脑！你好。
//
//爸爸在干嘛？
//
//“医院”…？
//
//爸爸在写关于家的事！
//
//我可以帮爸爸的忙！
// 
//
//描术：
//Level 524是非常非常漂亮的浅蓝色，它也是窝最喜欢的颜色。窝喜欢住在这里因未窝想睡哪睡哪因未介里有很多很多床。有时候窝和爸爸沿着大厅跑闹玩捉人游戏，但窝也有时会摔倒然后伤到自己，然后爸爸就不得不过来帮助我。有一次我的角卡进了窻帘我怎么删……奥行了。窗帘，然后爸爸用了很——长的时间把它解开。但事没关系，因未窝最后还是出来了。
//
//level 524是很大的。窝觉得比月亮大。窝不知道月亮有多大，但爸爸告诉我它非常大，窝觉得家比月亮还要大。有时候我禾爸爸喜欢玩捉迷藏，窝们做很多游戏来让时间过得快一些，因未有时这里的东西很无聊。爸爸很容易累所以窝有时候停止帮助他们。
//
//有时候我很想念妈妈。爸爸把我其他的角锯下后，他们就离开了。我不认为他们喜欢那样。爸爸说我有时会有妈妈的茸角，我觉得那使他们伤心了。我在做什么？奥！嗯， level 524的外面也非常漂亮！有时候窝和爸爸去外面看所有长得到处都是的漂亮的花！但是窝们不能出去太久，因为爸爸说那些花对窝们的肺有害。
//
//奥！我忘了告诉电脑我的名字！爸爸叫我η，但它们都说它的发音是Ay-tah。
//
//η？你动我的电脑干什么——你在上面打字了吗？？
//
//嗯…我，我只是想帮你……
//
//叹息 没关系亲爱的，谢谢你的帮助。我会，呃，明天再做一次。
//
//爸爸累了？
//
//对，咱们去睡觉吧。
//
//好呀！
//
//你知道我爱你，对吧？
//
//是的！你总是对我说你非常非常爱我！
//
//好……好
package lvls5x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl524{}