//Level 500
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//image-1.jpg
//通过层级顶层甲板所见的外部景象。
//
//Level 500是后室的第501层，目前认为其为提康德罗加级巡洋舰纳吉尔法。被发现于2012/24/7。
//
//image-2.jpg
//通讯专家Haymes和Mitchell正尝试利用该层级的雷达系统。
//
//描述：
//Level 500是一系列房间和走廊，看上去与美国海军巡洋舰的中上层甲板相似，后经对各种指示牌和设备编号确定确实如此。尽管该层级的时空尺度远远超过理论上这一类型的船只尺寸，但其中的房间似乎仍保持着相对稳定、且相对彼此和走廊固定的位置。
//
//该层级的大部分可利用空间都被各种类型的通讯和接收设备所占据，如军用无线电收发机和雷达系统，也包括常见设备，像固定电话或是车载收音机。该层级的所有能够发射信号的设备在失去电力补给或被毁坏前都在不断地发出某种形式的信号，这显然与其预设功能不符。由此产生的信号干扰使得与层级之外人员的交流成为了不可能，据推测，它甚至影响到了未被电信号干扰的走廊边界。
//
//尽管巨量的重复信号使其中大部分都难以破译，但看上去这些似乎主要是通过无线电传播的求救信号，一般以摩斯电码发出或由预录制的多语言合成语音朗读。据称偶尔还能听到人类的声音，但除了惨叫和哭泣之外，没有发现任何的正常交流，对于与之互动的尝试也没有回应。
//
//同样，该层级的所有导航设备也无法正常运作。
//
//虽然Level 500可进出区域的房间和走廊都没有通向外部的出口，但层级的上层甲板有几个窗户，透过可以看到连绵的海面和晴朗的天空。这种景象始终如一，不随时间变化，而且似乎没有昼夜循环或气候变化。
//
//尽管Level 500中存在大量在常理上需要定期维护才能正常运转的设施，但这里似乎不存在任何生命。人员可以成编制地安全进出，但他们永远不会遭遇其他流浪者。
//
//基地、前哨和社区：
//该层级没有已知的基地、前哨和社区。
//
//附件
//经恢复的该层级文件，内容如下：
//
//
//
//记录了一段信号，值得注意的是其中相对缺少底噪。
//
//MEG的通信专家Jeremy Haymes确定这段信号是一次SSTV格式的图像传输，随后对恢复的文件进行了解码。得到的图像如下：
//
//显示图像
//入口和出口：
//入口
//该层级可经由任何一层的门框方向精确地朝向地磁南极的门进入。归咎于后室内绝大多数GPS都已不可靠，想要定位一个这样的入口非常困难。
//
//出口
//该层级可经由走廊墙壁上任何一扇未上锁的门（前提是它能够作为入口）离开。多数出口都通向它作为入口时联通的层级，但却不一定通向完全一致的位置。关于这一现象的原理尚不清楚。
//
package lvls5x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl500{}