//Level 566 - “工厂”
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//factory.png
//位于Level 566中心的工厂。
//
//描述：
//Level 566是位于一大片的牧场中心的一座废弃的工厂。尽管该层级的面积看起来是无法测量的，但若有一个人试图离开工厂，那么就会发现，在离开一段时间后，他们将保持相对于周围环境的同一位置，实际上，无论他们走多远，都不会离该层级更远。需要触发该效应的距离尚未能精确测量，但流浪者所需触发效应的距离大约有1英里左右。在外部的较高处可以看见一些不同建筑风格和处于老化状态的建筑，但由于该层级的影响，他们很难到达该位置，值得注意的是，其中一栋建筑是经过风化后的郊区住宅，经常可以看到其烟囱能冒出浓烟。
//
//位于Level 566中心处的工厂建筑风格类似于前厅的工厂，尤其是在20世纪中期的美国所使用过的工厂。该工厂的结构有砖块构成，并且有两个烟囱从房屋屋顶处伸出。工厂内部明显比外部更大、更先进，大部分的结构有生锈的钢材和不明的金属材料所制成。其内部的机器虽然依旧很破烂，但总体来说也很极具现代化、密集、光滑；与现代化工厂中的物品更为相似。
//
//虽然内部的机器都不起作用，但M.E.G.的成员所提供的观察报告显示，它们被用于制造和改造有机生命体，以及制造各种有机产品。M.E.G.的所有尝试修复工厂部分的行动都以失败告终，所以其确切目的未知。
//
//基地、前哨与社区：
//目前Level 566内部还没有任何基地、前哨或社区，然而，由于工厂的存在以及工厂内部所发现的各种文件，被认为在过去的一段时间里该层级有人居住过。
//
//入口与出口：
//出入口在以下层级的各个区域中都不可预测地出现和消失，这些出入口都通向工厂内部的不同地方，并且被认为是入口和出口。该层级还未出现其他已知入口或出口。
//
//Level 522
//Level 123
//Level 56
//Level 150
//必然之囿
//自：巴丁·戴勒，BR 研究部
//至：耶鲁，BR领导
//日期：2014年6月21日
//主题：项目建议
//
//项目名称：工人制造厂 [WMP]
//
//发起人：巴丁·戴勒
//
//时间期限：2014年至2020年
//
//摘要：
//该WMP的目标是创建一个能够生产大量的侏儒的自我运行的制造工厂，该工厂将为BR组织提供劳工。这将通过采纳Level 566的现有结构并且使用各种BR技术对其进行增强工作用来实现该功能，所有开发和建设都将在Level 566中所建立的新BR前哨站进行。
//
//理论：
//由于许多项目因BR严重人手不足并且缺乏劳工而被推迟，最明显的是反后室单轨系统[TBMS]。该项目是指在创造一个完全在BR能控制范围内的大量可支配劳工来纠正这一问题。尽管该项目的代价十分昂贵且劳动密集，但最终结果将会比BNTG从我们处所采购出的所有劳动力要廉价许多。
//
//材料：
//
//由12名的BR人员所组成的团队。
//Level 566中工厂及其内部技术。
//大量来自BNTG的钢材。
//大量来自BNTG的火盐。
//生产已经停产的多用途超级士兵[APSS]项目的各种技术。
//生产各种人形机械增强（MHA）的技术。
//Koko AI的一个实例。
//任职员工：
//项目负责人：
//
//巴丁·戴勒
//技术主管：
//
//克里斯汀·亚当斯
//查尔斯·凯瑞
//软件开发：
//
//马克·温斯莱特
//伊利亚·邓斯特
//托马斯·考夫曼
//戴维·鲁法洛
//硬件开发：
//
//简·威尔金森
//戴本·伯恩
//黛德丽·艾尔
//艾米尔·赛义德
//工程师：
//
//格里 蓬佩奥
//史蒂夫·利托夫斯克
//步骤：
//
//准备Level 566。
//首先进入Level 566后，将所有碎片及其他物品将从工厂内部进行清理。工厂旁将设立一个永久性的BR前哨站。
//
//确认工厂的内部运行。
//利用之前BR对该层级的考察记录和额外研究后，我们将准确确认工厂的技术功能。
//
//设计一个WMP工人原型。
//我们将为大量生产工人的运行方式创造新的功能。这将会在确定工厂的规格和限度后进行。
//
//修理和增强工厂的技术。
//这一部分会基于原型的规格，包括修复工厂的破碎部分，以及添加BR技术以提供其工厂的能力。
//
//开始制造工人。
//这将是项目的最后一步以及最终目标。
//
//自：耶鲁，BR领导
//至：巴丁·戴勒，BR研究部
//时间：2014年6月26日
//主题：关于：项目建议
//
//接受提案。
//
//自：巴丁·戴勒，BR研究部
//至：耶鲁，BR领导
//时间：2014年11月15日
//主题：WMP进程
//
//我们在WMP项目上取得了很好的进展，我们现在对工厂的某些部分是如何运行的，已经有了很好的了解，我们能够通过修复我们能修复的部分，并且用类似的零件替换一些零件，是一台机器能够创建完整的有机生命体并运行起来。尽管如此，我们仍然还有很多工作要去做。我们很早就注意到，Level 566中的许多机器似乎最初是用于创造爬行生物而不是创造哺乳类动物，因此我们决定，最简单的方法是稍微改变我们现有的计划，而不是让机器比我们必须做的更多修改的工作。当设计到更改机器所创建的设置时，我们没有很大程度的控制，因此这将是我们的下一步。
//
//下面是我附上的一些选定的测试日志，用以进一步说明我们到目前为止所取得的成就。
//
//时间	测试	结果	笔记
//2014年7月13日	制造小型蜥蜴（默认设置）。	无结果	我们还没有修理机器，这项测试只是为了看看它的任何一部分是否仍在运行，似乎看起来并没有，我们还有很多工作要去完成。
//2014年9月2日	制造小型蜥蜴（默认设置）。	产生出了一个覆盖在一层厚厚的淡粉色斑点的薄膜，该薄膜在创造不久后破裂	我不确定这到底是怎么回事，但可以肯定是新的进展，我们将努力重新校准一些机器。
//2014年9月16日	制造小型蜥蜴（默认设置）。	一只畸形的浅粉色蜥蜴被制造出来，该生物在制造后7分钟左右失去生命体征。	这无疑是迈出前方的一大步，到目前为止，我们主要是在修复已经存在的机器，而不是制造任何新的东西，但我认为我们必须尽快增添现有的机器。
//2014年11月12日	制造小型蜥蜴（默认设置）。	一只浅粉色的小型蜥蜴被制造出来，在编写时（24小时后），该生物仍然活着并且很健康。	这是一次巨大的成功，但实际上它只是证明一个观念而已。我们的大量工作仍然摆在我们的面前。因为我们现在需要确定如何改变机器创造出的东西，这将不再是是一件容易的工作。
//Level 566的WMP音频日志，于2017年3月12日。
//<开始记录>
//
//戴勒：WMP的实验日志。记录于2017年3月3日，本实验的目的是根据WMP项目的规范而创建一个完全成型的仿生机器人。
//
//[停顿。]
//
//戴勒：开始实验。
//
//[在几分钟的背景中可以听到内各种机器的嗡嗡声和叮当声，以及远处传来的一些叽叽喳喳的声音。]
//
//[可以听到低沉的叹息声。]
//
//戴勒：我们这是——做到了吗？
//
//[可以听到周围有一声低沉的喉咙尖叫声在录音时传来。]
//
//戴勒：我们做到了！我们终于成功了！
//
//<结束记录>
//
//APBW项目规范
//项目名称：通用生物工人[APBW]
//
//描述：APBWs是WMP创造出的生命体，是为BR做体力劳动的最佳工人。APBWs的设计是考虑约束WMP项目。
//
//问题：
//
//APBWs在设计时没有考虑任何作战能力。这意味着他们可能难以在敌对实体对该层级构成重大危险时的工作。我们在目前该层级的技术发展上，这是不可能解决的，但不会对项目的可用性造成很大的影响。
//由于其爬行动物的需求上，APBWs在极低的温度下是不可运行的。如果没有对WMP项目中所使用的机械设备进行大量更改的话，那么这是无法补救的，但不会对项目的可用性造成很大的影响。
//APBWs需要一定程度上的智力开发才能完成分配给他们的任务。这意味着他们也有反抗BR的心理作用。通过“关闭开关”的安装设计来关闭它们，那么可以在这种情况下远程将其终止。
//我们无法在APBW设计中完全消除不必要的情绪，但有了“关闭开关”的设计下，这应该不是一个重大的问题。
//特征：
//
//增强体力：APBWs被设计成比人类和其他实体更加强大，正常的情况下，这使得他们在一些困难的建筑项目中起到很大的作用。
//增强耐力：APBWs经过专门设计后，不会因反复运行而产生身体上的疲劳。这使得他们能够长时间工作。
//可反抗指令：APBWs做了很多的工作，这使得其能与人类的工作方式相同，这意味着他们不会对需要灵活性工作产生疑问。
//智能：APBWs的智能几乎接近于人类，这使得他们能够完全理解并且完成困难的工作。
//语言：APBWs擅长学习各种语言，这意味着他们只需要几个月的教育就可以充分理解英语。也能在外语的基础上取得很大的结果，少数课程显示出也基本理解意大利语、西班牙语和阿拉伯语等语言。
//提高控制力：APBWs能提高自身控制力，与上述的生物增强性能一共运行，使其能更高效运行。
//关闭开关：位于每个APBW的胸部都有一个“关闭开关”的功能，可以远程触发，一旦按下，他们的心脏将会停止跳动，这可以用于控制任何形式上的叛变行为，以及对不服从命令行为起到很大的威慑力。
//位于Level 566内部的BR事件日志，于2019年7月19日
//2019年7月19日，在Level 566的工厂内部的主厂房墙壁上发现一块涂鸦，并被用绿色喷漆写下“7/24/29”。关于肇事者的搜查工作正在进行当中，在工厂工作的BR成员被吩咐在24号可能发生的叛变活动中做好准备。
//
//位于Level 9内部的M.E.G.事件日志，于2019年7月24日
//2019年7月24日，位于迈克尔车站附近的9-11单轨上工作的13台APBW，其中有12台突然倒下，后来他们被宣布死于心脏骤停，其他在各种BR施工现场也出现类似的事件报告，M.E.G.认为这是由于BR意外触发APBW的“关闭开关”所导致的。很快调查报告将在之后发送给BR。
//
//位于Level 566内部的BR音频日志，于2019年7月19日
//<开始记录>
//
//[伴随着巨大的碰撞声，可以听到很响的警报声。]
//
//戴勒：耶鲁，如果你能听到我说的话，这是非常紧急的情况。
//
//[麦克风中可以听到沉重的呼吸声。]
//
//戴勒：这里——这里发生了一场叛变。
//
//[停顿。]
//
//戴勒：我们试图关闭大批的APBWs，但我们在制造过程中犯了某种错误，因为在这其中一些——都没有死。
//
//[可以听到更加沉重的呼吸声，以及远处传来的尖叫声和门被打开的声音。]
//
//戴勒：耶鲁。我们已经丢失了Level 566了，别再派支援过来了。我现在能做的就是想办法找到逃出去的路。
//
//<结束记录>
//
//后续：巴丁·戴勒在Level 123中被发现，虽然看上去有些害怕，但最后并没有受伤，位于Level 566的前哨站已被视为放弃，并且终止了WMP项目，7名BR成员在Level 566的暴动中死亡。
//
// 
//
//生存难度：
//等级 4
//
// 
// 
// 
//factory.png
//位于Level 566中心的工厂。
//
//描述：
//Level 566是位于一大片的牧场中心的一座废弃的工厂。尽管该层级的面积看起来是无法测量的，但若有一个人试图离开工厂，那么就会发现，在离开一段时间后，他们将保持相对于周围环境的同一位置，实际上，无论他们走多远，都不会离该层级更远。需要触发该效应的距离尚未能精确测量，但流浪者所需触发效应的距离大约有1英里左右。
//
//位于Level 566中心处的工厂建筑风格类似于前厅的工厂，尤其是在20世纪中期的美国所使用过的工厂。该工厂的结构有砖块构成，并且有两个烟囱从房屋屋顶处伸出。工厂内部明显比外部更大，而且似乎比外部可能要先进得多，有很大一部分的结构由生锈的钢材和一些无法识别的材料所制成。大多数的机械设备已被居住在该层级的实体所摧毁。
//
//基地、前哨与社区：
//APBW团体：
//该工厂所拥有着由BR在“WMP”计划中所创造的80-100个实体。他们对外来人员展现出极端敌对意识，这意味着目前不可能对该群体进行交流和调查。
//
//入口与出口：
//出入口在以下层级的各个区域中都不可预测地出现和消失，这些出入口都通向Level 566中工厂内部的不同地方，并且被认为是入口和出口。目前该层级还未出现其他已知入口或出口。
//
//Level 522
//Level 123
//Level 56
//Level 150
//必然之囿
package lvls5x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl566{}