//Level 563
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//erkY
//Level 563中一条永无止境的道路的图像。
//
//Level 563是后室第564层。
//
//描述
//Level 563的外观是一条永无止境的道路，道路两边长满了许多树木，其中布满了岩石。本层级内不存在昼夜循环，其永远处于白天。此外，本层级闻名的原因还在于其物资种类丰富，在Level 563内，会刷新许多珍贵的物资，如打火机、子弹、杏仁水、智能手机等。
//
//流浪者在本层级行进大约25英里后，远处的摩天大楼将会在靠路的左边出现。向这些摩天大楼的方向走去，即可到达Level 11。
//
//当流浪者行进大约50英里后，其可以发现一座废弃的工厂。工厂年代久远，生锈的金属斑驳的分布在其中。通常该工厂的内部空空如也，但在某些罕见情况下，工厂会处于光洁如新的状态，其中有许多可供流浪者生存的物资。
//
//当流浪者行进大约75英里后，地面开始变得潮湿。此时，流浪者可以从地面上发现一些奇怪的绿色液体，这种液体不可饮用。并且，此前流浪者发现的工厂都会神秘消失。
//
//当流浪者行进大约100英里后，一些来源不明的浓雾会挡住流浪者前进的道路，这使得继续探索本层级的难度将大幅提高。因此，浓雾后的景观成为了至今还未解开的谜团。目前，M.E.G.正准备设立一座铁质路障，以防止任何人进入100英里后的道路。
//
//补充信息
//无尽之地
//进入无尽之地的方法是走入道路的左侧并尽可能的远离主干道。当流浪者进入无尽之地后，其将无法回到主干道。之后，流浪者必须行进100英里，最后才能到达Level 10。在无尽之地里，存在一种奇怪的特性，当流浪者进入时，这里的植被会开始干枯，气温将愈发干燥。虽然这种变化对流浪者来说似乎是无害的，但若流浪者稍不注意，其眼部仍然将会被这种现象所影响而变得干涩。
//
//工厂
//除上文提到的特点以外，无论工厂状态如何，其顶部管道均不会排放废气。
//
//基地、前哨与社区
//M.E.G.前哨“森林贸易者”
//大约生活15人，它们非常友好，对外开放贸易，也愿意为有需要的人提供帮助。
//
//入口与出口
//入口
//从Level 220的一颗寒冷的树上切出，即可来到本层级。
//出口
//在本层级行进大约25英里后，远处的摩天大楼将会在靠路的左边出现。向这些摩天大楼的方向走去，即可到达Level 11。
//进入无尽之地，行走100英里后到达 Level 10。
//有时，你可能会在此层级遇到一个茅屋。走入其中将到达Level 280。
package lvls5x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl563{}