//Level 522
//设定中心 » 工业革命设定中心 » Level 522
// 
//
//生存难度：
//等级 3
//
// 
// 
// 
//wire-room
//Level 522中一个较不混乱的房间的一张照片。
//
//Level 522是后室的第523层。它是一座大而复杂的摩天大楼，充满许多独特的装置。
//
//描述
//Level 522是一座高度复杂的摩天大楼，由许多以未知模式格式化的单独房间组成。Level 522以非常复杂的导航而闻名，这只有后室机器人科技的某些成员才完全了解。Level 522有许多独立的区域，目前没有区域被完全导航。目前，人们正致力于开发与该层级的安全连接，以利用该层级各处的许多独立装置。
//
//Level 522是一座在外部不可见的无限摩天大楼。透过外层的任何窗户都只能看到无限的空间，而不能看到摩天大楼本身的顶部或底部。摩天大楼似乎是用一种成分与钢相似的未知金属建造的。在整个层级中，有从镶板到地毯的地板种类，也有时是木地板。Level 522的所有房间总是有三个主要组件，为：
//
//大量裸露的电线，达到了形成侵扰的地步。
//遍布房间的大量闲置电子产品，通常是主板和墨盒。
//至少一项未完成的科技产品，其用途有简要概述。
//由于Level 522一直显示着这些特性，所以从房间中拿走任何补给都是安全的。在一些房间中还注意到其他特征，包括：
//
//偶尔有高度开发过的原型机械，具有独特的性能。
//一堆有智慧的电线，会试图攻击你。
//非常罕见的，具有智慧、像是实体的粉碎机，无论在哪里都会攻击你。
//Level 522目前由后室机器人科技控制，该团体似乎具有对在Level 522中导航方式的基本理解。他们的全部工作似乎严重依赖于Level 522，主要因为该层级有丰富、易于获取的对科技发展的补给。已注意到后室机器人科技有多个关键位置，例如CEO办公室，而它是目前Level 522中唯一完全没有多余电线线路的房间。
//
//在Level 522，已经发现并记录了某些重要物品。有时，后室机器人科技允许从他们的开发中选出某些物品供M.E.G.使用，并且已经注意到后室机器人科技可以量产一些物品，如小台灯。由于Level 522中人员的不可预测性，只有在通常由CEO监视的公开提供时，才应接受这些提供的物品。该层级实体非常少，但仍应视为危险。
//
//基地、前哨和社区
//后室机器人科技
//整个后室机器人科技的团队都可以在该层级中找到，因为他们认为该层级是他们的主要基地。他们是友好、愿意交易的，但是他们的秘密必须得到尊重，因为众所周知，他们的机器被破坏时他们就会使用暴力。如果你尊重他们，他们就不会对你造成威胁，并且可以视为愿意提供帮助的。
//
//M.E.G. LVL-522 前哨1
//一个标准的M.E.G前哨，为了在Level 522收集补给而建立。他们愿意帮助意外来到该层级的走失流浪者，并且不会对任何人造成伤害。
//
//入口与出口
//入口
//Level 522是独特的，因为它可以从一个标准层级进入，而不像进入大多数负层级2那样麻烦。目前通往Level 522的最佳入口通道是单轨列车。你可以跳下单轨列车，这会导致你切入Level 522。或者，通过Level 178，可以找到一块特定的地板镶板，与Level 522的镶板对齐。如果你跟着这块镶板，你就会出现在Level 522。该入口最近才被发现。
//
//出口
//随机地，可以在Level 522找到一扇门，有一个出口的标志。如果你通过这个媒介离开，你将出现在一个随机的量子稳定层级，最常见的是Level 3。或者，进入这个层级的任何电线线路太深会导致你掉进去，重新出现在Level 2。
//
//作者们！
//Footnotes
//1. 译注：LVL即Level的简写。
//2. 译注：原文如此。
package lvls5x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl522{}