//Level 501
// 
//
//生存难度：
// 
// 
// 
//描述
//恰到好处的温暖沙土，呼啸的阵风，笼罩在未知中的宏伟之地。月光照耀之下的Level 501是一片生态死区，孤寂的沙丘内唯有窒息感会伴随穿行者左右。沙尘在贫瘠的土地上堆叠成峰，纵使天穹中已没有烈日翻滚，它们依旧温暖而和煦；在旅行者们屈服于此地艰险卓绝的环境之前，这将是他们眼中的最后一抹倒影。
//
//据推测，Level 501之宽广已经到了难以量化的地步。即便在这辽阔的沙尘之间穿行千百里，也难以遇见任何变数。倘若运气好，你或许能在宏伟的沙丘之间看到零散的巨石，但在这样一片死境之中，这些久经风沙的巨砾又会有什么用呢？无论抱着怎样的目的与追求，进入该层级的流浪者们都将彻底身陷孤独。
//
//在旅程之中，狂风吹响的号角将是旅行者唯一的伴侣。细小沙砾组成的热浪随风翻卷，无孔不入，为旅行者带来远超想象的痛苦与磨难；同样令人饱受折磨的是风向，无论旅行者面朝何方，都只能感到扑面而来的灼热。比起一次长途跋涉，这艰苦的旅程反倒更像一场战争。对于在这场战争中拼搏之人而言，休息将再也不是一个值得考虑的选择；即使是片刻的放松，也会让流浪者被炎热的风尘吞噬殆尽，葬身沙海。
//
//尽管大部分时间里，能见度似乎都不受影响，但Level 501内旋动的狂风依旧会让视野模糊不清。没有眼部防护的情况下，旅行者会感到几乎与失明无异；而纵使眼部的防护准备充足，可见范围将依旧狭窄无比。在该层级内唯一的向导就是你的直觉，以及不断向前进军的坚毅；但几乎没有人可以在渡过这一切之后，依旧安然无恙。
//
//对于任何试图勇敢翻越Level 501的旅行者，我们都建议带上大量轻装、头盔、坚固的紧身靴子，以及眼部防具。食物与饮品毫无必要，肆虐的狂沙将摧垮任何珍贵的补给，使它们再难以下咽。同样不必说的是，诸如帐篷一类的临时栖处完全没有意义，除非旅行者已经做好了迷失在沙底的准备。
//
//实体
//在那些口耳相传、有关Level 501的传闻中，提及了某个未记录的实体。流浪者们之间会说起一个披着亚麻布衣的身影，如若视野短暂清明，便能看到那身影在远处默默注视。有人说那身影在风尘中早已虚弱不堪，因此倚靠在一根长棍旁；也有人说这些高大的身影总是昂首挺胸，端坐于巨大的猫科生物之上，而那些坐骑们又以可怕的力量牢牢嵌入了地表。
//
//可惜的是，对于相关现象的报告极度稀缺，因而这些流言究竟为空穴来风，还是确有其事，我们尚且无法判断。然而无论真假与否，这些故事所造成的影响都已经扩散开来：后室中所有不满足于安定的冒险者们都备受鼓舞，争相前去查证那些未知的身影是否存在。
//
//基地、前哨与社区
//毫无疑问，在这片焦灼的废土之上，几乎不可能建立任何形式的聚居点。当你在Level 501的沙地上摆放一块砖后，它将会缓慢地沉没在沙海之内，再也难觅踪迹。
//
//入口与出口
//入口
//阿拉伯沙漠可能是唯一通向Level 501的入口。淹没在那些异常的流沙之中，倾听风沙中难得的狂热，你将最终身陷Level 501。
//
//出口
//同样，在Level 501中那些风沙渐缓之地，让沙尘包裹全身，便能回到你来时之处。然而流浪者应当铭记的是，无论是进入Level 501还是从中离开，或许都比想象之中的更加困难。
package lvls5x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl501{}