//Level 571
// 
//
//生存难度：
//等级 4
//
// 
// 
// 
//8c3b67f31da53c3eb2a385063d838acd.jpg
//图片展示了最初发现 Level 571 时它走廊的样子
//
//598ceca0373436023662c74d8a636828.jpg
//“黑暗迁移”后Level 571的走廊
//
//78ee48d42fdd55635e3aa0cbe068a268.jpg
//Level 571通往被淹没的地下室的入口。
//
//Level 571 是后室的第572层，于2020/11/17被发现。它最初被呈现为一个现代风格的设施，并通常处于清洁、正确的状态。
//
//描述：
//Level 571 为一大约六层楼的现代风格急救中心。楼层的真实数字由于每隔2.5小时出现的数个建筑结构上的迁移而无法确定1。 这些转移似乎并不遵循任何已知的规律，并且会对内部产生较大的改造。 然而，要注意的是1楼 ( 三级护理处 ) 和3楼 ( 急救处 ) 似乎完全不受这些迁移的影响。
//
//类似于常规的迁移，这一层级偶尔会经历一场“黑暗迁移”。 目前仍未测量出这种黑暗迁移发生的频率，它们似乎是完全随机的。在发生黑暗迁移时，这一层级将会暂时性突变为一个残破得多的环境，直到下一次的“常规迁移”到来。 在此期间，某些楼层会有额外的，或者是与以往完全不同的实体出没。这些实体将会随着每个黑暗迁移终焉的到来而消失2。
//
//1楼
//“三级护理处”安置着常规的医疗器械与设施。 除这些设备以外，这一楼层也遍布着多个饮水器。这种水（？）呈现一种浅淡的蓝色，微微回甜，在喝下后会让你产生恢复活力的体感。目前为止，只在该楼层发现过这样的饮水设施。这一层没有已知实体存在。 一个娃娃脸被人听到在位于该楼层中心一扇坚不可摧的大门后窃窃私语3。除此之外该层的其他门都能够正常开关。
//
//2楼
//“确定性护理处”疑似安置着外科手术用的器械设施。一些诸如手术刀和外科口罩的医疗用具似乎已出现老化，开始生锈发霉。这种霉变的真菌能够烧伤皮肤与毛发。在这层楼的西部，有一团这种霉菌所组成的，飘忽不散的“云朵”。其不受常规迁移所影响，但它的腐蚀性曾在一次黑暗迁移中被大幅度增强。目前没有发现栖息于该楼层的实体。
//
//3楼
//“急救处”有些像2楼的一个先进得多的版本。在此滞留半小时以上后，有可能在里面听到有流水的声音。此声音来源不明。这层楼同样是第一个在Level 571中有敌对实体公开出现的地方，例如钩头和“疫疾”同时在此出没。
//
//4楼
//“生命维持与重度创伤中心”安置着生命维持系统与治疗“更高级创伤”用的医疗设备。最好尽你所能地避免进入该楼层，因为有警告风筝，窃皮者，和无面灵于此出没
//
//经历一次黑暗迁移后，将只有影和六臂栖息在该楼层。另外，似乎有一个六臂组成的集群栖息于4楼的北边（？）。
//
//5楼
//“门诊与中转处”似乎是为诊断疾病和将病患转移至更高级护理而设置的房屋设施。 5楼的大部分似乎都被笼罩在一片不受任何迁移撼动存在的黑雾之中。在一次黑暗迁移期间，雾似乎随着迁移的进行相较以往显著变薄了许多。一只悲尸单独地在本层游荡，体型与成年男性相近，手中抓着一把手术刀和一床枕头。
//经历一次黑暗迁移后，绽放之眼也开始在此出现(4) 。之前提到的悲尸仍旧存在。
//一扇铁门在此楼层随机出现，它通往一条怪异的通道。这条通道连接一个尚不确定的层级，或许是一系列完全随机的层级中的一个5。
//
//地下室
//地下室是迄今为止Level 571中最不稳定的一个楼层。由于各个楼层都会随机生成通往地下室的楼梯，它可以从任何楼层进入。由于其近乎无限的面积，该楼层的整体仍有待探索。地下室已经探索过的部分全部被一种不明成分的腐臭液体所淹没。虽然液体本身似乎无害，然而，却有一只牧蛇潜伏其中。
//
//朝着地下室深处继续探索，你可能会看见岛屿一样的结构漂浮于这片腐烂的海洋。这预示着它将会随前进变得越发深邃。同样，这里有奇怪的，类似小屋的建筑立于多个岛屿之上。其中的岛屿之一栖息着一个洛特卡的小型群落。
//
//仍未观测出黑暗迁移对地下室的影响，然而，它所拥有的危险程度很可能与第五层相当。
//
//补充信息:
//下述讯息被发现写在房间L1-7 (楼层1， 房间7)的左墙上。(发现于20/11/17)6
//
//她被叩响门扉的嘈杂声所唤醒。
//她崇爱着月光随影被拉伸而见长的柔美。
//品尝空气的甘饴，它们睁开了阖闭已久的双眼。
//害怕黑暗。
//
//这条讯息发现于房间L2-1 (楼层2, 房间15)，是在一个金属文件柜的表面被刮出的痕迹。（发现于20/11/18）7
//
//他翻过这张书页，沉醉于故事中。
//钟磬敲打的声音轰如雷鸣，回声响彻暗影。
//界限开始变得模糊，是与非都被扭曲了。
//恐惧黑暗。
//
//第三张潦草的“纸条”被发现夹在第五层的一件破旧的医生外套中。 (发现于20/11/21)8
//
//她用流露着炽热欲望的双眼目视着。
//它们是暴怒的巨涛，猩红与荫影，交合化一。
//它们被自己极端的狂乱变得扭曲，在伟大的虚无之中，融为一体。
//敬畏黑暗。
//~ J.S.
//
//基地、前哨和社区：
//该层级目前不存在已知的人类前哨和社区。 然而，在一楼建设前哨站点是可能的。
//
//已知实体
//在1-2楼没有已知实体存在
//
//3楼
//钩头
//“疫疾”
//4楼
//警告风筝
//窃皮者
//无面灵
//影 (经历一场暗影迁移后)
//六臂 (经历一场暗影迁移后)
//5楼
//悲尸
//绽放之眼 (经历一场暗影迁移后)
//地下室
//牧蛇
//入口和出口：
//入口
//有两种进入Level 571的方式。第一种是冲破Level-143-3东面的墙，这会让你切入进来。第二种方法是在一间Level 401的清洁室橱柜陷入沉睡。传送花费的时间截至目前为止仍未知。
//
//出口
//一扇5楼的异常金属门是离开 Level 571的唯一出口。
//
//注:
//我准备将来再回来探索一次，我在离开时总有种这地方在求着我发现些某些东西（或某人）的感觉，我得把它弄清楚。
//
//四层的六臂群落已按要求报告给M.E.G.。
//
//作者信息
//« Level 570 | Level 571 | Level 572 »
//
//脚注
//1. 由于这些迁移，Level 571确切的规模与范围同样未知。
//2. 就像是两个不同层级的融合？这莫非是后室之中的一个平行世界吗？
//3. 我都快忘记我为摧毁这扇门花了多少时间了。但就好像，这个层级本身不想让这扇门被打开一样…
//4. 译注：原名为Blossoming Eyes，并非官方wik的37号实体Curabitur Bird。
//5. 有待证实。
//6. 这房间的什么有些…不太对？没办法明确指出那是什么，但那真的很令人不适。
//7. 地板的旁边有一坨黑色的污渍，说不准是不是血，但最好还是别多猜了。
//8. 作者身份不详，第五层游荡的悲尸是一个可能的嫌疑人。
package lvls5x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl571{}