//Level C-140
//评分: 
//+34
//+
//–
//X
//
// 
// 
//
//生存难度：
//等级 1
//
// 
// 
//大量无威胁实体city
//Level C-140中“后室娱乐”大厦旁的一个街道。
//
//Level C-140是后室C层群的第140层。
//
//描述
//环境
//Level C-140是一片永夜且面积无限的城市，城市中心有一座具有合成器风格1的高达200米的46层大厦，大厦大门金碧辉煌且顶部挂着由霓虹光带组成的“后室娱乐”标牌，这里是“后室娱乐”的其中一个副基地。
//
//Level C-140中除“后室娱乐”大厦以外的楼房都为简陋的混凝土框架，高度为50米左右，且楼房内部无任何内饰和家具。
//
//Level C-140内的光源所发出的光会因其位置与“后室娱乐”大厦相距距离增大而变弱，且与“后室娱乐”大厦相距越远，周围环境就越发黑暗，直至变为与Level 6相似的一片黑暗，不存在任何光亮。相反，越接近于“后室娱乐”大厦，周围环境就越发明亮且地面和周围街道会出现许多各色的霓虹光带，并随与“后室娱乐”大厦的距离缩短而增加。
//
//实体
//Level C-140中的实体众多，包含笑魇、猎犬、无面灵、骇笑者、死亡飞蛾以及大量的新品推荐员。
//
//层级中的实体越接近于“后室娱乐”大厦，其攻击性就会越低，直至对人类毫无威胁且友善。所有层级中接近大厦的实体都在此影响下戴上霓虹眼镜成为了后室娱乐的员工并负责接待层级中的流浪者。
//
//“后室娱乐”Level C-140大厦员工名单（节选）
//由M.E.G.整理
//
//Peter，骇笑者，男性，身高175cm，身着绿色制服且身体附着紫色霓虹光带，负责大厦中的前台接待。
//Bill，无面灵，男性，身高182cm，身着绿色制服且身体附着红色霓虹光带，负责大厦中的前台接待。
//以Sarah为首的多个身高165-167cm的女性无面灵，身着红色制服且身体附着蓝色霓虹光带，负责大厦中的环境清洁。
//Jessica，死亡飞蛾，女性，身长2米左右，身着红色制服且身体附着蓝色霓虹光带，负责在大厦外飞行巡逻与住客的居住问题。
//以Bella为首的多个身高165-167cm的女性无面灵，身着紫色制服且身体附着蓝色霓虹光带，为赌场的荷官和服务员。
//Anthony，笑魇，男性，身高未知，面部散发紫色霓虹亮光，为大厦1层的DJ，负责1层的气氛。
//以Gary、Evan和Eddie为首的9位男性死亡飞蛾，以及以Anne和Jill为首的8位女性无面灵，总共17位实体为大厦中的厨师，负责在餐厅后厨中制作食物。
//以Aarn为首的众多新品推荐员在大厦1层以及市场里推销后室娱乐的新产品。
//以Ivan为首的众多身高189cm，身着黑衣且身体附着白色霓虹光带的无面灵保镖，装备绿色霓虹发射器，负责维持大厦的秩序。
//
//“后室娱乐”大厦
//“后室娱乐”大厦内到处都充斥着各色霓虹彩线，楼层之间可通过电梯到达。几乎每层的电梯门口都贴着保罗·西蒙斯的海报。
//
//“后室娱乐”大厦的46层中的第1层为大厅，即接待流浪者和后室娱乐员工的地方，所有人和实体都可以在这里饮酒、跳舞以及享受后室娱乐开发的娱乐产品。
//2-3层为餐厅，这里可通过杏仁水从后室娱乐的员工处购买富有特点的食物，包括一种被叫做“霓虹汉堡”的带有霓虹彩线的汉堡，一种被叫做“霓虹披萨”的带有霓虹彩线的披萨，还有轻松可乐和瀑布酒精。
//4-7层为赌场，无论流浪者或实体都可在此处进行体验，但任何出千或出格的行为一旦被发现都会立即被赌场内的无面灵员工杀死。
//8-38层可供实体和流浪者住宿，每层约20个双人房或大床房，只要支付500ml的杏仁水，任何阵营的流浪者或实体都可在这里住一晚并舒服地睡一觉。
//39-45层为市场，后室娱乐为众多商人和团体提供了一个能进行交易活动的场所，只要每月支付足够的杏仁水，不管是谁，什么阵营的人都可以在这里做生意，只有一个要求，那就是不能违反规定，包括动手、盗窃或抢劫。一旦以上行为被发现，后室娱乐的无面灵员工会立即将违反者杀死并将与其同行的人和物丢出层级。
//46层仅允许后室娱乐员工进入，且保罗·西蒙斯每次进入层级时都会直奔46层，疑似其为后室娱乐的内部交流地点。
//Paul%20Simmons2.jpg
//保罗-西蒙斯的海报。
//
//外围
//虽然层级内的实体大多没有敌意，但以“后室娱乐”大厦为圆心500米外藏匿着大量敌对笑魇，尽量不要靠近。
//
//
//基地、前哨与社区
//“后室娱乐”大厦
//这里是后室娱乐的一个副基地
//提供娱乐服务给任何人和实体
//可使用杏仁水在此处购买食物
//可在此处与他人进行公平交易
//可通过支付杏仁水在此处留宿
//其他团体的交易站点
//这里有几乎所有团体设立的交易用站点和人员留宿
//可与他们进行交易
//入口与出口
//入口
//进入Level C-70中日落都市中心的一个写着“娱乐中心”字样的通道可到达Level C-140的大厦门口。
//在Level C-67中找到一扇轮廓有着红色霓虹光带的门可到达Level C-140中“后室娱乐”大厦附近的街道。
//跳入Level C-45中的一个合成器风格的洞口会掉入Level C-140中的大厦门口。
//在Level C-18中找到并喝下一瓶瀑布酒精可在Level C-140的大厦大厅沙发上醒来。
//
//出口
//进入层级街道上一个顶部标有“安全出口”的绿色标牌的防火门可进入Level C-67。
//在层级中距“后室娱乐”大厦600米以外的街道中，找到一扇标有“核辐射危害”的门进入并到达Level C-144.
//找到层级中唯一的一片草地进行切入并到达Level C-194的中心建筑旁。
//作者信息
//« Level C-139 | Level C-140 | Level C-141 »
//
//Footnotes
//1. 合成器风格是一种艺术派系，紫红色调下的异形车、激光网格、霓虹落日是合成器风格的典型符号特征。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1140{}