//Level C-101
//评分: 
//+45
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//Level C-101是后室C层群的第101层。
//
//描述
//Level C-101表现为一个高4米，面积无限的服务器机房。整个层级表现为向四周无限延伸的，一个个如同方块一样排列整齐，并装有服务器相关黑色硬件与颜色各异橡胶配线的黑色服务器机架，单个机架的长宽均为5米，高度为4米，两个机架间预留了约2米宽的过道，能容纳两个人并排行走。Level C-101中及其黑暗，光源仅有服务器上时不时闪烁的红色、黄色或绿色灯光，以及一颗位于层级中心的40瓦白炽灯。在人员进入Level C-101时，总会出现在该枚电灯泡的下方。
//
//ethernet.jpg
//对服务器的近距离拍摄
//
//Level C-101已由M.E.G.（探险者总署）派出的兵团Omega-癸亥“监督者之眼”分若干次对以电灯泡为圆心，半径10公里的区域进行探索。除在距离电灯泡向东150米处发现一处向下的，大概率通往Level C-102的楼梯以外，其他区域均为排列整齐的服务器。对服务器中数据的提取表明，服务器内没有任何数据，因此，该层级不具备任何的探索价值。
//
//为确保进入该层级的人员不会在该层级浪费时间进行无意义的探索，M.E.G.决定使用轻钢与塑料板建立一条由灯泡处（即人员进入Level C-101）的地方通往进入Level C-102的楼梯处的，带有光源与补给的通道。5名兵团Omega-癸亥“监督者之眼”的士兵将在灯泡处附近驻扎，以随时帮助并引导进入Level C-101的人员从楼梯处离开。
//
//以下内容为Omega-癸亥“监督者之眼”第1分队对该区域的第一次探索记录：
//
//- 收起文件C-101-A
//文件C-101-A：Omega-癸亥“监督者之眼”第1分队对该区域的第一次探索记录（节选）
//探索时间：2017-07-08 15:29:58
//探索队伍：Omega-癸亥“监督者之眼”第1分队（8人）
//队伍人员：癸亥-Able（小队队长）、癸亥-Baker、癸亥-Charlie、癸亥-Dog、癸亥-Easy、癸亥-Fox、癸亥-George、癸亥-How
//以下内容为正文：
//
//[15:30:28] （第1分队8人已进入Level C-101，站在白炽灯下检查探索列表。）
//
//[15:30:29] Able：装备？
//
//[15:30:45] Baker、Charlie、Dog、Easy、Fox、George、How：齐全。
//
//[15:30:47] Able：无线电通讯？
//
//[15:30:56] Baker、Charlie、Dog、Easy、Fox、George、How：良好。
//
//[15:30:57] Able：音频记录已开启，总部？
//
//[15:31:01] 监督者办公室：（与周围的人交谈过后）开始吧。
//
//（小队打开手电筒向东行进约150米，期间无关交谈已略去）
//
//[15:31:36] Charlie：（指向楼梯）前面那里……
//
//[15:31:38] Able：一个楼梯。总部，我们要不要下去？
//
//[15:31:40] 监督者办公室：不需要。做好标记，继续探索该层级。
//
//（小队随后向东前进了1小时22分钟，期间无关对话已略去）
//
//[16:53:14] Fox：见鬼，这里除了服务器以外什么也没有。
//
//[16:53:17] Able：总部，我们已经行进了一个多小时了，这里除了周围的服务器以外什么也没有发现。
//
//[16:53:26] 监督者办公室：可能是还没有走到足够远的地方，请继续前进。
//
//（小队随后向东前进了43分钟，期间无关对话已略去）
//
//[17:26:57] Baker：这里真的啥都没有啊，除了服务器还是服务器。
//
//[17:27:01] Able：总部，我们已经探索了约2个小时，除了刚才的楼梯外，没有其他发现。我们请求返回，或者走下楼梯进行探索。
//
//[17:27:11] 监督者办公室：（与周围的人交谈过后）允许，请前去对楼梯进行探索。
//
//（小队随后原路返回至楼梯处，期间无关对话已略去）
//
//[18:38:49] Able：总部，我们已经到达楼梯处。Baker，我和你先下楼梯，往下走10米确认无异常后再让其他人下来。
//
//[18:38:59] Baker：明白。
//
//（Able、Baker走下楼梯）
//
//[18:39:16] Able：下面没有异常，除了还是见了鬼的黑，你们也一起下来吧。
//
//[18:39:21] Charlie、Dog、Easy、Fox、George、How：明白。
//
//（其他队员走下楼梯）
//
//（小队队员在走下楼梯5分钟后被全部传送至Level C-102，对Level C-101的探索记录结束。）
//
//文件结束。
//
//基地、前哨和社区
//M.E.G.（探险者总署）——“引路人”
//5名来自Omega-癸亥“监督者之眼”的士兵驻扎在Level C-101的灯泡处（即人员进入Level C-101的地方）附近
//他们会引导进入Level C-101的人员沿着M.E.G.搭建好的通道前往进入Level C-102的楼梯处，并在有需要时提供补给。
//入口与出口
//入口
//在Level 0切出时，有一定概率（≈15‰）来到Level C-101。
//在Level 999完成所有的忏悔后，有一定概率（≈9‰）被传送至Level C-101。
//在C层群内的任何层级，在与电脑有关的地方切出时，有极小的概率（＜3‰）会被传送至Level C-101
//出口
//在Level C-101的灯泡处向东前进150米后，走下楼梯通常会使你被传送至Level C-102，但也有小概率（≈5%）会使你传送至C层群的其他层级。（更新于2018-12-25，引导人员从Level C-101离开的通道已经建设完成，圣诞快乐。）
//
//Level C-101
//评分: 
//+45
//+
//–
//X
//隐藏信息对我们没有任何好处，对我们的流浪者更是雪上加霜。然而，对于Level C-101，它的真相却不得不被伪造并隐藏。倘若Level C-101的真相被泄露，整个后室中的所有流浪者将遭受灭顶之灾。
//请接着往下看吧，我们必须守住这一条线。
//现在，Level C-101的生存难度将被重新分级。
//
//——监督者A
//Level C-101
// 
//
//生存难度：
// 
// 
//受保护的信息
//（备注：新增的信息已被加亮为蓝色）
//Level C-101是后室C层群的第101层。
//
//描述
//Level C-101表现为一个高4米，面积无限的服务器机房。整个层级表现为向四周无限延伸的，一个个如同方块一样排列整齐，并装有服务器相关黑色硬件与颜色各异橡胶配线的黑色服务器机架，单个机架的长宽均为5米，高度为4米，两个机架间预留了约2米宽的过道，能容纳两个人并排行走。层级的天花板上悬挂着标注各个方块服务器所管理区域的标识牌。Level C-101中极其黑暗，光源仅有服务器上时不时闪烁的红色、黄色或绿色灯光，以及一颗位于层级中心的40瓦白炽灯。在人员进入Level C-101时，总会出现在该枚电灯泡的下方。
//
//ethernet.jpg
//对服务器的近距离拍摄
//
//Level C-101已由M.E.G.（探险者总署）派出的兵团Omega-癸亥“监督者之眼”分若干次对以电灯泡为圆心，半径10公里的区域进行探索。除在距离电灯泡向东150米处发现一处向下的，大概率通往Level C-102的楼梯以外，其他区域均为排列整齐的服务器。对服务器中数据的提取表明，服务器似乎正在运行包括前厅、后室等的各个区域的进程。数次对服务器进程的干涉及相关代码的修改的实验导致了被干涉层级的无规律改变及其中人员的死亡，因此，该层级的真相不应该向公众公开，更不应该被探索。
//
//为确保进入该层级的人员不会发现该层级的真相，M.E.G.决定使用3层厚度为1cm的高强度合金板与1层伪装用不透明塑料板建立一条由灯泡处（即人员进入Level C-101）的地方通往进入Level C-102的楼梯处的，带有光源与补给的通道。5名兵团Omega-癸亥“监督者之眼”的士兵将在灯泡处附近驻扎，以随时帮助并引导进入Level C-101的人员从楼梯处离开。
//
//以下内容为Omega-癸亥“监督者之眼”第1分队对该区域的第一次探索记录：
//
//- 收起文件C-101-A
//文件C-101-A：Omega-癸亥“监督者之眼”第1分队对该区域的第一次探索记录（节选）
//探索时间：2017-07-08 15:29:58
//探索队伍：Omega-癸亥“监督者之眼”第1分队（8人）
//队伍人员：癸亥-Able（小队队长）、癸亥-Baker、癸亥-Charlie、癸亥-Dog、癸亥-Easy、癸亥-Fox、癸亥-George、癸亥-How
//以下内容为正文：
//
//[15:30:28] （第1分队8人已进入Level C-101，站在白炽灯下检查探索列表。）
//
//[15:30:29] Able：装备？
//
//[15:30:45] Baker、Charlie、Dog、Easy、Fox、George、How：齐全。
//
//[15:30:47] Able：无线电通讯？
//
//[15:30:56] Baker、Charlie、Dog、Easy、Fox、George、How：良好。
//
//[15:30:57] Able：音频记录已开启，总部？
//
//[15:31:01] 监督者办公室：（与周围的人交谈过后）开始吧。
//
//（小队打开手电筒向东行进约150米，期间无关交谈已略去）
//
//[15:31:36] Charlie：（指向楼梯）前面那里……
//
//[15:31:38] Able：一个楼梯。总部，我们要不要下去？
//
//[15:31:40] 监督者办公室：不需要。做好标记，继续探索该层级。
//
//（小队随后向东前进了1小时22分钟，期间无关对话已略去）
//
//[16:53:14] Fox：见鬼，这里除了服务器以外什么也没有。
//
//[16:53:17] Able：总部，我们已经行进了一个多小时了，这里除了周围的服务器以外什么也没有发现。
//
//[16:53:26] 监督者办公室：可能是还没有走到足够远的地方，请继续前进。
//
//（小队随后向东前进了43分钟，期间无关对话已略去）
//
//[17:26:57] Baker：这里真的啥都没有啊，除了服务器还是服务器。
//
//[17:27:01] Able：总部，我们已经探索了约2个小时，除了刚才的楼梯外，没有其他发现。我们请求返回，或者走下楼梯进行探索。
//
//[17:27:11] 监督者办公室：（与周围的人交谈过后）允许，请前去对楼梯进行探索。
//
//（小队随后原路返回至楼梯处，期间无关对话已略去）
//
//[18:38:49] Able：总部，我们已经到达楼梯处。Baker，我和你先下楼梯，往下走10米确认无异常后再让其他人下来。
//
//[18:38:59] Baker：明白。
//
//（Able、Baker走下楼梯）
//
//[18:39:16] Able：下面没有异常，除了还是见了鬼的黑，你们也一起下来吧。
//
//[18:39:21] Charlie、Dog、Easy、Fox、George、How：明白。
//
//（其他队员走下楼梯）
//
//（小队队员在走下楼梯5分钟后被全部传送至Level C-102，对Level C-101的探索记录结束。）
//
//文件结束。
//
//以下为新增附件：
//- 收起文件C-101-B
//文件C-101-B：在Level C-101中标记为Level C-96的服务器中提取出的数据（节选）
//48275    c96++5kiami
//48276        lavae c101|c2|c3
//48277        icmn c95|c97|c101|c99
//48278    set +fac +dor +din +off
//48279    f=c96_fac
//48280        f ++line ++set
//48281    all 996+extreme
//48282        f -r c101_X572_R8790
//48283        f -c c96-dor|c96-din
//48284        f -cu c96-off
//
//备注：目前尚代码无法辨识出由何种语言所编写，建议建立实验去探究。
//文件结束。
//
//- 收起文件C-101-C
//文件C-101-C：人事档案——“监督者Z”
//职员：“监督者Z”
//真实姓名：███ ██████
//描述：
//███ ██████，男，白人，38岁，自称第一批进入后室的人员之一，在初期以惊人的速度得到大量层级的资料，并在利用电子器械和计算机进行志愿方面颇有造诣。随后与其他数人一起创立探险者总署The M.E.G.（探险者总署），成为一名监督者。作为一个领取监督者编号的他，他并没有选择最大的编号A，而是选择编号Z，成为“监督者Z”。
//“监督者Z”并不像其他监督者一样在Level 1的“Alpha基地”或Level 4的“Omega基地”活动，而是常常不知所踪，仅有在有重要会议需要出席时才出现。自Level C-101在2017-07-15被广泛探索后，他便常常携带着手提电脑在Level C-101以研究为名进行活动。由于“监督者Z”身份的特殊性，他可以选择不透露透露自己的活动内容与活动目的，且其他监督者无权过问。
//所作贡献：
//
//提供大量未发现或已发现层级、物品或实体的一手资料，这些资料有98%的部分以上是准确的，资料中未被探索的部分也在之后被证实是正确的。
//发明多种层级定位方法、层级导航方法等。
//发明多种使用物品，包括██、███、████等。
//协助建设M.E.G.（探险者总署）数据库。
//文件结束。
//
//- 收起文件C-101-D
//文件C-101-D：监督者办公室20171002-1号会议记录（节选）
//节选议题：有关在Level C-101中服务器的处理问题
//与会人员：监督者A、监督者B、监督者C、监督者Z
//会议内容：
//
//监督者A：我们直接进入正题吧。相信你们都已经看过那份提前发放的材料了，你们也应该能感受到，Level C-101中的服务器并不一般，尤其它有可能还会涉及到“前厅”的部分。我们应该谨慎处理，处理好了可能能让所有人都从后室里逃出去，相反则可能让整个后室乃至前厅陷入无法预测的危机。那么你们有什么关于处理这些服务器的建议吗？
//
//监督者C：虽然这种做法可能会过于激进，但我认为可以炸毁除前厅以外的所有服务器，或者使用程序破坏里面的所有数据。这种方法也许会导致整个后室的消失，导致所有在后室中的流浪者的死亡，但这应该会防止更多前厅中的人误入后室，深陷其中。用十几万条命换几十亿条命，这是一笔划得来的买卖。
//
//监督者Z：（神情突然变得激动，似乎想站起身来，但被监督者B的发言打断了。）
//
//监督者B：这样还是过于冒进了。目前尚不清楚对服务器中的数据进行更改到底会造成后果，也不清楚摧毁服务器中的数据是否就能摧毁整个后室。可能白白牺牲了十几万流浪者的性命，却依然没有办法阻止其他前厅中的人误入后室，这样反而得不偿失。我认为，应该先选取一小区域的服务器进行试验，首先观测一下对服务器数据进行更改的后果，之后再逐步推进试验，再去决定是否要摧毁这些服务器。
//
//监督者A：我认为这个提议挺好的，另外两位有什么别的异议吗？
//
//监督者C、监督者Z：没有异议。
//
//监督者A：好，那么接下来便安排拥有计算机科学相关的高层人员去对这些服务器进行试验。███，你来跟进他们好吗？你也是计算机科学方面的专家了。
//
//监督者Z：好。
//
//监督者A：好，那么这个问题我们暂时先处理到这里。下一个问题。
//
//文件结束。
//
//- 收起文件C-101-E
//文件C-101-E：对Level C-101中代表Level C-96的服务器内的数据进行修改的实验
//时间：2017-10-05
//地点：Level C-101中代表Level C-96的服务器
//实验人员：由“监督者Z”委派的Dr. B██████
//
//实验1
//修改内容：删去内容“dw -c -off-din --9817 74631 472 --80019”
//结果：一条从“办公区”通往“饭堂”的非欧几里得通道消失了，但它的“贴图”依然存在，周围的少许墙壁脱落，透过墙壁仅能看到无尽的黑色。
//备注：可能是一条连接区域通道的指令。
//
//——Dr. B██████
//
//实验2
//修改内容：新增内容“create exit to c-101”
//结果：预期的结果并没有发生。在Level C-96的其他区域出现多处崩坏，如地板、墙壁、天花板破裂（并露出和上个实验一样的黑色），办公桌或传送带被竖直放置或倒立在天花板上。
//备注：额……
//
//——Dr. B██████
//
//实验3
//修改内容：往数据中大量添加随机字母或数字。
//结果：Level C-96内发生大面积崩坏，在里面观测的人员全部死亡。并且无法再次进入Level C-96。
//备注：“监督者Z”！您去哪了！我需要您的帮助！
//
//——Dr. B██████
//
//文件结束。
//
//- 收起文件C-101-F
//文件C-101-F：监督者办公室20171006-2号会议记录（节选）
//节选议题：有关监督者Z在对昨日实验的失职问题
//与会人员：监督者A、监督者B、监督者C、监督者Z
//会议内容：
//
//监督者A：昨天……在对Level C-101进行的实验，导致了Level C-96的完全崩塌与消失，几位高级别士兵就此离我们而去。所以今天我们要讨论一下这个实验……（把头转向了监督者Z），以及你的失职问题，███，你昨天本应该监视着整个实验过程的。
//
//监督者Z：我想是我高估了那帮蠢货的智力。我本以为他们能搞定这一切的，在不损坏数据的情况下。我会对此负责的。
//
//监督者C：（略带嘲讽的口吻）哦？这么说他们一个团队的计算机专业的高级人员还比不过你一个人的头脑吗？以及对此负责？他们一整个团队通宵了一整晚的都修不回来的Level C-96你能弄回来？
//
//监督者Z：怎么不能？那里的一整层都是我的……（突然停止）
//
//监督者B：你的什么？
//
//监督者A：你这么一说……在Level C-101被发现之前，你一直不知所踪。在Level C-101被发现以后，其他高级人员非常频繁地报告你在Level C-101出现。你是不是隐藏了什么？
//
//监督者Z：（短暂的沉默）我无可奉告。
//
//监督者B：你这样显得非常的可疑，我劝你还是如实招来，否则我们可能会动用监督者的权利撤除你监督者的职位。
//
//监督者Z：请，如果你可以的话。
//
//监督者A：（拿出对讲机）Omega-癸亥，马上前来监督者办公室，包围这里。
//
//（监控画面显示，一大群M.E.G.士兵匆匆赶来，包围了整个监督者办公室）
//
//监督者Z：我很抱歉的是，他们可能要牺牲了。（打开了随身的笔记本电脑，编写了几行未知代码。）
//
//（监控画面显示，外面走廊的灯突然失去了电力供应。同时，数百只具有敌意的“笑魇”、“猎犬”、“无面灵”、“窃皮者”、“爆酸者”等实体在黑暗中以未知方式突然出现）
//
//监督者C：（激动地拍了一下桌子站了起来）你果然！……
//
//监督者Z：事到如今也没办法了。（看向会议室的摄像头）我，███ ██████，在我承担完我的失责后，我将辞去“监督者Z”的职务。（重新看向监督者C）再见了。
//
//（监督者Z随后使用便携式“赫尔墨斯装置”离开该层级，至今仍未找到。）
//
//（备注：在监督者Z离开以后，本来与士兵交战的实体全部消失了，电力也恢复了供应。在数小时后，Level C-96被报告重新出现并可以进入，且其与在实验之前完全一致。）
//文件结束。
//
//- 收起文件C-101-G
//文件C-101-G：监督者办公室20171007-1号公告
//监督者办公室20171007-1号公告
//
//各位流浪者们：
//我很抱歉我要带来一个悲痛的消息。监督者Z永远离开了我们，以一种大家都不愿意接受的方式——背叛。他的离开不仅是对M.E.G.的背叛，还是对整个后室的背叛。他的逃脱不仅是M.E.G.的损失，更是放虎归山的隐患。没错，在昨天的会议中，我们找到了一些关于他可能是创造整个后室的始作俑者的线索，在事情败露以后，他便直接逃离。希望其他流浪者们在发现他后，尽可能地将其活捉，带来监督者办公室，亦或者向我们提供线索。这不仅是为了M.E.G.，更是为了整个后室的安危。
//愿上帝保佑后室中的每一个人。
//——监督者A
//
//文件结束。
//
//基地、前哨和社区
//M.E.G.（探险者总署）——“引路人”
//5名来自Omega-癸亥“监督者之眼”的士兵驻扎在Level C-101的灯泡处（即人员进入Level C-101的地方）附近
//他们会引导进入Level C-101的人员沿着M.E.G.搭建好的通道前往进入Level C-102的楼梯处，并在有需要时提供补给。
//他们将警告尝试离开通道的人员。在警告无用以后，他们将被允许击毙尝试突破封锁的人员。
//他们是保险。
//M.E.G.（探险者总署）——“葬歌”
//45名来自Omega-癸亥“监督者之眼”的士兵驻扎在Level C-101的通道附近。
//他们将时刻警惕，击毙任何闯入Level C-101通道外区域的非授权人员。
//他们是防线。
//M.E.G.（探险者总署）——“弑君”
//20名来自Omega-癸亥“监督者之眼”的士兵组成的小分队在Level C-101内搜寻，10名士兵将分散在其他层级搜寻。
//他们将仔细搜寻，捕获“监督者Z”。
//他们是疫苗。
//入口与出口
//入口
//在Level 0切出时，有一定概率（≈15‰）来到Level C-101。
//在Level 999完成所有的忏悔后，有一定概率（≈9‰）被传送至Level C-101。
//在C层群内的任何层级，在与电脑有关的地方切出时，有极小的概率（＜3‰）会被传送至Level C-101。
//出口
//在Level C-101的灯泡处向东前进150米后，走下楼梯通常会使你被传送至Level C-102，但也有小概率（≈5%）会使你传送至C层群的其他层级。（更新于2018-12-25，引导人员从Level C-101离开的通道已经建设完成，圣诞快乐。）
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1101{}