//Level C-105
//评分: 
//+16
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//一起赏月吧，就像从前一样。
//
//Level C-105是后室C层群的第105层。
//
//描述
//Level C-105的主体是一片湖泊。湖泊深度约20米，水体呈浅蓝色。该层级常有微风，致使水面产生波纹，据观察，波纹会产生轻微的荧光现象1。
//
//在湖泊上有一座木制的浮桥码头，码头规模很小，可以确定是个人所用，其上木板大多已经受潮，在上面行走时会发出声音，奇怪的是，这种声音不会显得刺耳，反而具有某种节奏，浮桥下的浮子浮力似乎有些不足，在桥上蹦跳时，桥面会微微上下浮动，可以确定的是，浮桥并不会因为承担太大的重量而沉没。
//
//Level C-105的太阳不会升起，大多的光源来自月亮，也正因如此，整个Level C-105被银色的月光完全覆盖。当月光照在身上时，被照到的部分会感到微微的凉意，精神也随之放松，直到离开Level C-105。月像不会发生变化，始终保持满月的状态，可以确定的是月亮本身没有任何特殊属性，但大多流浪者都表示愿意在闲暇时来此层级赏月。
//
//芯草园
//芯草园并不是一座花园，是除Level C-105中湖泊外的全部区域。
//
//这些地方都生长有一种长有圆球状花朵细茎植物，这种植物被流浪者们叫做芯草，芯草植株内没有叶绿体故无法进行光合作用，又因其特殊的结构导致只能在Level C-105中生长。目前暂无发现芯草有其他功能，所以仅作为观赏性植物收录。
//
//荧月沙
//荧月沙又称忘忧沙2，这种沙子首次发现是在Level C-105的湖底。
//
//这种沙子呈现莹白色，在夜里会反射光线，像一小块月亮碎片，故得名荧月沙。荧月沙也是很好的酒曲，用荧月沙酿制的酒水会带有一股淡淡的夜来香的气息，味道独特，深受流浪者喜爱。
//
//两个片段
//前言：浮桥吱吖，月光洒下。或是呢喃，或是畅想，月光会带着游子思念，回到家乡。
//
//流浪者A：你想过未来的生活吗？
//
//流浪者B：想过,当然想过。可有什么用呢？
//
//流浪者B：我曾经想过的生活没有能力实现，现在在这里连从前也回不到了。
//
//流浪者A：是啊，我曾坐在屋檐下，就像现在这样看着天，看着圆月。
//。
//流浪者A：不同的是我可以吃着自家种的杏儿，喝着奶奶酿的米酒….
//
//流浪者B：谁又不是这样呢？我想念那个我生长的地方，我想念那里的人，那里的风，那里的每一颗树，每一朵花….
//
//流浪者A：我无时无刻不想离开这个荒诞的世界。我那时想离开家乡，去我所谓想往的地方，去闯荡，忙于奔波…我以为我很孝顺（掏出一部旧手机）….母亲每天都给我发消息，怕我吃不饱，睡不暖…..不幸福…现在我再也回不了她的消息了…
//
//流浪者A：我只想再看看他们，哪怕是一眼….
//
//流浪者B：看看月亮吧，我每次想家都会来这。他们是否也在看着那伦明月呢？
//
//流浪者B：我小时候一到晚上就喜欢跑出去，跑进家门口的芦苇荡里，踩着水，听着虫鸣。直到奶奶叫我去吃饭才回去….
//
//流浪者A：人生就是如此，事事无常，我要活下去，离开这里，回到家人身边….
//
//流浪者B：回到家乡的路就是最遥远的旅途，是每一位背井离乡之人埋在心底的梦…
//
//流浪者A：是啊，生活还要继续，只有活下去，才可回能去，见到想见的人，看到想看的风景。
//
//前言：看过最美的风景，去过最大的城邦。可是，我还是最爱我的家乡。
//
//流浪者：很美，蔚蓝的湖和安静的夜，天上还有一轮月，就像老屋后的那眼泉…有些想家了。
//
//流浪者：如果他们还在，兴许也会这么想吧。
//
//流浪者：我又在自言自语了么？
//
//流浪者：算了，听说这儿的酒不错，去尝尝吧。
//
//一篇报刊杂志
//看报就看李斯特，美景趣事全在这
//李斯特先生的个人杂志专刊
//
//我曾在老胡克的酒馆3里听说过月亮湾，都说那儿是真正的无忧之地，湖里全是美酒，地上长出来的全是香烟，还是茄蓝牌4的。如今看来他们定然是没来过的，也不知这些消息经过几个人的嘴巴。
//
//月亮湾的景色是无可挑剔的。光是那月亮就不是能在其他地方所得见的，不夸张的说，在这儿拍月亮不需要任何专业设备，就是吧门锁改成相机来拍，也不比在外面用大家伙拍的差多少。
//
//月亮湾环境倒是很静谧，但来这儿幽会可不是什么好主意，可不只有你觉得这儿美，不信可以问问浮桥上坐在的那些人。
//
//如果真让我说月亮湾什么东西最令人着迷，不是这儿的月亮和芯草，而是湖里那些沙子。就是荧月沙，我一开始听这东西以为是蝙蝠屎的别称，毕竟和夜明砂太相似了，后来有个流浪者和我说它又叫忘忧沙，我可以确定它一定不是蝙蝠屎，毕竟没人会觉得蝙蝠屎很美味。
//
//不得不说用荧月沙酿制的酒味道很独特，本人有幸喝过一次，问起来有一股淡淡的夜来香的味道，轻轻抿一小口，各种各样的果味伴着酒精独特的风味在口腔中流转，真是妙不可言。
//
//Level C-105 “月亮湾”
//
//李斯特推荐指数：5颗星
//强烈推荐去看看，相信你一定会爱上那儿。
//
//一首诗
//前言：一叶扁舟卧在水上，涟漪荡漾，在湖面绽放出淡淡的光，是思念，是梦想。
//作者：一位吟游诗人
//
//《望月》
//踏碎月光，
//拾起碎片，
//抛向远方。
//黑夜便有了光。
//坐在桥边，
//像从前一样。
//月似乎更亮了，
//银辉盖过了别的色彩。
//这是它的舞台。
//望着月，
//欣赏着它的美。
//像从前一样。
//思绪飘向天空，
//飘进月的怀抱。
//小雨淅沥，
//炊烟袅袅，
//水洼里映出莹白的月光。
//风儿混着草香吹拂在脸上，
//草丛里有虫儿在鸣叫。
//屋檐下的孩童在玩闹，
//大人在说笑，
//我知道，
//这是我生长的地方。
//想要触摸，
//却无法前进分毫。
//我多么希望月光带着我的思念
//回到那遥远的家乡。
//
//但愿人长久，千里共婵娟。
//
//入口与出口
//入口
//将荧月沙暴露在月光下，将切入Level C-105
//当在月下思念某个地方时，有小概率来到Level C-105
//出口
//喝一口Level C-105的湖水将切入Level C-8
//有些芯草会发出微光，有人说那是吸收了月光，拔下它将进入Level C-11
//作者信息
//« Level C-104 | Level C-105 | Level C-106 »
//
//脚注
//1. 荧光现象：少部分混有杂质的荧月沙悬浮在浅水区域内，产生的波纹让其暴露在水面并反射月光产生的一种现象·。
//2. 忘忧沙：因使用荧月沙酿制的酒十分美味并且度数较高，喝上一小杯就会导致醉酒，故得名忘忧沙
//3. 老胡克酒馆：很多酒馆的名字都叫这个，也许他们的老板也叫这个名字。
//4. 茄蓝牌香烟：一种中高端香烟，在普通流浪者眼中是不可多得的好东西
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1105{}