//Level C-147
//评分: 
//+13
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
// 
// 
//实体绝迹
//Level C-147是后室C层群的第147层。
//
//描述
//Level C-147的是一处高度不足40cm的夹层空间。大部分情况下，进入本层的人员会出现在一条宽度略窄于其肩宽的通道之中。由于层级的高度限制，人员在本层中仅能够通过爬行移动且无法在不造成身体伤害的前提下调转方向。目前，共计有137条通道被发现。由于未知影响，尽管能够有多位人员处于同一通道之中，彼此之间却无法互相接触。
//
//层级内部的能见度较低，考虑到层级的性质，尚不知晓其内部的光源来自何处。组成层级的材质在体感上近似于混凝土砖，但任何的破坏行为均以失败告终。由于层级内部过于狭窄，不建议人员再尝试任何破坏行为，否则将有大概率造成人员伤亡。
//
//Level C-147内部的空气质量不佳，长期身处本层的人员在临床中出现了明显的肺部损伤。同时由于其内部逼仄的环境，这将造成人员的紧张/抑郁/焦虑情绪，即使对那些在心理测试中表现出色的人员而言也是如此。身处本层的人员将会在记忆中虚构一段相关的创伤经历（通常是遭到来自家庭中的暴力，并被强制封锁在某一狭窄空间中）
//
//ventiliation
//　由流浪者拍摄的本层照片。
//
//Level C-147的通道长度不定，但因为人员的心理影响，在其中的路程通常被认知为“漫无止境且折磨”的。同时，人员的心理压力也造成了超乎寻常的体力消耗。一般而言，在人员爬行50-100公里后就能够看到一处高亮光源，并能够从其中离开本层。
//
//本层中没有任何实体存在，同时，也缺乏可以获取的资源，仅在极少数情况下，本层中的某些位置会出现凹陷的缺口，能够在其中发现大量被人为储存的杏仁水和食物。值得注意的是，在本层中死亡的人员尸体将会以异常缓慢的速度腐烂，其随身携带的物品也是如此。这意味着人员在紧急情况下可以通过[数据删除]的方式维生。
//
//基地、前哨和社区
//由于本层的精神影响以及对人员的健康影响，不建议建立任何基地或社区。
//
//入口与出口
//入口
//进入任何层级中存在的通风管或狭小夹层结构均有概率会出现在Level C-147中。
//少数情况下，人员在某些层级的墙壁/地板上切出的时候有概率进入到Level C-147。
//出口
//仅建议通过本层的光源离开本层，在通过光源离开后人员将会以安全的方式出现在某个低风险层级的衣柜/储物柜/地下室/地铁中。
//值得注意的是，在本层中切出将有极高的概率出现在同一层的另一条通道之中，多次切出将导致人员在至多5条通道间来回循环。
//请注意，对于本层的风险重新评估正在进行中
//
//
//由于大量的人员伤亡，本层137条通道中的124条已被[数据删除]堵塞。由于本层的性质，安排人员进行疏通被认为是不可能的，且已经进行的行为造成了不必要的人员牺牲。因此建议所有人员应尽量远离任何能够进入本层的入口，如果因意外原因切入到本层之中，我们希望你能够使用携带的火源尽可能清除本层内的[数据删除]。
//惋惜您的不幸，感谢您的牺牲。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1147{}