//Level C-170
//评分: 
//+7
//+
//–
//X
//请注意，本文部分内容可能会引起读者不适，在就餐时段请谨慎阅读
//
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//Level C-170是后室C层群的第170层。
//
//fc42cafe15763893.jpeg
//Level C-170航拍画面
//
//描述
//Level C-170表现为一片无边无际的开放空间，地表地质不平坦且富有弹性，其材质类似于角质层，大量沟壑纵横交错在地表上，使地表呈块状分布。层级表面温度在35～37摄氏度不等，偶尔会到达38甚至40摄氏度，在这样的温度下流浪者易中暑或脱水，应注意及时降温和补水。尽管层级中的天空一片黑暗，但依旧存在来源未知的光照。
//
//Level C-170的地表生长有大量平均高度约10~15米、直径约1米的黑色柱状物。流浪者普遍称其为“毛树”，“毛树”排列相对稀疏，大量“毛树”组成了“毛林”。“毛树”成分主要为角质蛋白和碳、氢粒子等，因此具有可燃性，燃点大概在70～90摄氏度1，“毛树”同样具有较强韧性和一定硬度，故此“毛树”作为可开采的燃料具有较高利用价值，被砍伐的“毛树”会在短时间内重新生长。
//
//- 关闭文段
//地表上同样分布有大小不一的孔状结构，部分孔洞生长有“树毛”，孔洞会不定期地喷涌出一种浑浊的液体，其主要成分为杏仁水、氯化钠、尿素及各类毒素。尽管该液体富含杏仁水但依旧不可饮用。
//
//在地表以下约7米左右的位置埋藏有丰富的一种富含营养的液体，温度大概在38~40摄氏度。该液体成分主要为杏仁水、治愈水晶、蛋白质、无机盐、酶、氧等营养物质，可直接饮用，但由于未知原因液体成血红色，因此流浪者称这种液体为“血水”。“血水”暴露在空气中较易凝固，需要进行妥当保存。由于“血水”的开采和收集具有一定难度，目前主要由M.E.G.“油田”基地通过类似抽油机2的设备进行采集。
//
//基地、前哨与社区
//探险者总署（M.E.G.） - “油田”Level C-170资源采集基地
//据点位于一座突兀的黑色圆形山包周围
//常驻人员53人
//大面积采集“毛树”和“血水”，并将资源输送致其他层级的基地与社区
//愿意为流浪者提供本地资源和降温物资
//友好且开放贸易
//无羁探险者联盟（U.E.C.） - Level C-170一号殖民地及各处前哨站
//据点位于高挂有U.E.C.旗帜的“毛树”附近
//常驻人员20~24人
//采集“毛树”和“血水”，并将资源输送致其他层级的殖民地
//不友好且不开放贸易
//入口与出口
//入口
//在Level C-113中将一条胶带贴在腿部有腿毛处，并迅速扯下。
//身患外伤在Level C-114中反抗医生治疗有概率进入Level C-170。
//长时间接触Level C-182的墙壁有较小概率进入Level C-170。
//出口
//身体浸没在“血水”中将切入Level C-341。
//尝试从地表切出将进入Level C-88。
//作者信息
//« Level C-169 | Level C-170 | Level C-171 »
//
//Footnotes
//1. 前提本应是在一个标准大气压下，但由于不明原因，“毛树”可在包括无氧环境等几乎任何环境下燃烧，仅需温度达到燃点即可
//2. 前厅一种用于开采石油的机器设备
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1170{}