//Level C-110
//评分: 
//+17
//+
//–
//X
// 
//
//生存难度：
//等级 5
//
//不安全
//不稳定
//危险实体paper-573095_1920.jpg
//Level C-110内的一角。
//
//Level C-110是后室C层群的第110层。
//
//描述
//Level C-110是由无数本报刊杂志组成的层级，许多杂志如同山一般堆在一起，形成茫茫多的书山。由于杂志堆积的深度过深，其底部的海拔位置无从考证。在Level C-110拍摄的所有图像都会加上一层灰色滤镜，有时图像还会产生令人奇怪的失真感，暂不清楚其产生的原因。
//
//本层级没有时间循环，天气始终维持在早晨9点左右，平均气温13℃。进入该层级会出现高原反应，阅读里面的书籍则会加重这种现象。据离开本层的流浪者所说，此处的太阳似乎发出使人异常不适的光，似乎只有站在书山底下躲避光线才能缓解这种症状。
//
//本层级内经常会发生强烈大风天气，此时乌云密布，气温骤降至1℃，威力达到9级的大风会将书山卷上高空，再砸向地面，整个层级的书本如同暴风雨中的海洋不断飘动。此时层级内将极其危险，成堆的书本将有极大可能掩埋流浪者。
//
//（我知道你想干什么，别费劲点燃这里了，没用的）
//
//本层级的报刊杂志大多来自前厅，且印刷日期均在2000年之前。
//
//在本层级已探明的报刊种类：
//
//科学杂志
//新闻周刊
//不知名的日记
//挂历
//某些教科书
//以上所有书籍的封面和内容均被涂抹了各种无法辨认的符号和类似于儿童随手画的涂鸦，且风格十分诡异。
//
//diary-6967765_1920.jpg
//Level C-110的一张失真照片。
//
//实体
//一种名为“吃书之书”的实体，这种实体遍布Level C-110，其长相类似于一本普通书籍，但会不断的将周围的书卷入自己的书页内，并将其中的内容选择性的变成自己的一部分。“吃书之书”会将其碰到的流浪者吞入自己口中，该流浪者会变为书上的插画。“吃书之书”排泄时，会将对其无用的文章打包成册，然后与身体分离，成为一本新的书。
//
//基地、前哨与社区
//“说书人”书本养殖会
//由10人组成的团体，居住在某处书山的一个深处的洞穴内，它们会收集一种彩色的书，然后将这些书喂给它们圈养的“吃书之书”，在此之后，“吃书之书”会排泄出一种彩色的纸。据他们所说，这种纸拥有奇异的味道，食用后让人感觉神清气爽。因此喂养“吃书之书”是他们主要的食物来源方法。
//
//入口与出口
//入口
//在Level C-143找到一个彩色的瓷砖，踩上去即可到达Level C-110。
//在Level C-40上找到一个彩色的门，进入即可到达Level C-110。
//出口
//拾起一本纯黑色的书，使流浪者传送至Level C-6。
//找到一本印有“阿尔伯特•爱因斯坦”的画像，将其撕毁，即可到达Level C-16。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1110{}