//Level C-125
//评分: 
//+87
//+
//–
//X
//
//
//
//
//
//我出身于普鲁士王国波恩市的一个贫苦家庭，父亲在普法战争中牺牲，母亲无力抚养，将我托付给了一位好心的老钢琴家抚养。在艰苦的日子里，音乐成为了我唯一的寄托和乐趣。我的养父，也是我的老师，倾其毕生精力，把他毕生的学识传给了我。我这辈子最大的希望，便是登上那 金色的殿堂
//维也纳金色大厅
// 演奏一曲，圆了他的夙愿。如今我终于站在了这个金色大厅的中央，他却已不在人世……
//今日为君奏一曲，请君为我倾耳听。
//
//——Franz Sebastian
//
//
//
//Level C-125是后室C层群的第125层。最初由M.E.G.成员███从Level C-141切出后发现。
//
// 
//
//生存难度：
// 
// 
// 
//- 隐藏
// 
//
//层级属性：
//量子波动
// 
//待观测1photo-1607817359832-19a6a93c5f23.jpg
//层级内的一张写真。
//
//描述
//Level C-125似乎是一个狭小灰暗的区域，被四周的高墙所包围，抬头可看见外部昏暗但相对集中的未知光源。
//
//Level C-125的地面崎岖不平，由软木组成，每隔相等的距离有一段缝隙。流浪者应注意避免掉入缝隙中，多数缝隙是极其危险的。高墙的墙壁呈现深色，同时附有软木、毛毡与粗金属弦组成的规律结构，但目的和用途尚且不明。
//
//IMG_20220617_175509.jpg
//地面与前方的墙壁的图片。
//
//层级的地面并不稳定，似乎会因流浪者在上面进行弹跳等剧烈运动而发生摇晃。
//
//据到达该层级的流浪者叙述，出于未知原因，层级内所看的一切都是黑白色的。此效应同样适用于拍摄的照片。
//
//M.E.G.尝试使用弹射装置撞击墙壁上的金属弦，金属弦会发生特定频率的振动。离初始切入位置最近的一根弦的固有频率为440Hz2左右。对所有88根金属弦的试验表明其振动频率介于约27.5Hz至4186Hz之间。
//
//更多信息有待进一步探索。
//
//
//实体
//目前尚未发现实体，层级安全性有待评估。
//
//基地、前哨与社区
//介于本层级狭小而欠稳定的空间条件，M.E.G.难以长期在此驻扎或建立基地。
//
//入口和出口(待补充)
//目前已确认的出入口：
//
//入口
//钻进Level C-141钢琴房里的一台19世纪60年代的钢琴会来到此层级。
//出口
//以最左边（频率27.5Hz对应弦的一边）开始计算，掉入第29个缝隙会回到Level C-141。
//掉入第56个缝隙会回到Level C-299。
//
//
//
//
//
//
//
//
//
//一场台上成功的表演，背后是艰苦的练习。狭小简陋的琴房里，我的手指不知疲倦地在黑白键之间奔跑、跳跃，试图完美地演绎出那个美丽的梦。终究还是难以做到……
//黑白键的背后是什么？当我按下一个琴键，与之相连的木槌联动起来，击打在粗细不一的金属弦上，再经共鸣扩大，一个美妙的音符就这样出来了。当一个个美妙的音符串联在一起，就织成了一个美丽的梦。
//
//
//
//——Franz Sebastian
//
//
//
//
//
//
//经过第二次探索和一位匿名音乐家的指导，M.E.G.重新撰写了这篇档案。
//
//
//
//
//Level C-125是后室C层群的第125层。最初由M.E.G.成员███从Level C-141切出后发现。
//
// 
//
//生存难度：
//等级 1
//
// 
//亚稳定
//未知实体
//- 隐藏
// 
//
//层级属性：
// 
// 
// 
//描述
//Level C-125似乎是一个19世纪后期巨大化的立式钢琴的内部，尚且不知道是流浪者被缩小还是层级本身的尺寸造成的。四周是高耸的木质隔板，抬头可看见外部昏暗但相对集中的光源，疑似为舞台吊灯发出的灯光。Level C-125的上层地面由88个软木材质的琴槌3组成，与其他结构一同构成击弦机4。
//
//琴槌分为3组，每两组之间有一个极宽的大缝隙，分别位于第29和第30个琴槌之间、第56和第57个琴槌之间。每两个琴槌之间也有一段较小的缝隙。流浪者应注意避免掉入缝隙中，因除少数情况会通往一个新的层级外，更多情况会使其使直接摔落至钢琴底部而死。隔板的墙壁呈现深色，同时附有软木、毛毡与粗金属弦组成的规律结构——弦列、音板及支架。
//
//初始进入时，流浪者会位于第40个琴槌上5。
//
//层级的地面并不稳定，似乎会因流浪者在上面进行弹跳等剧烈运动而发生摇晃。
//
//出于未知原因，层级内所看的一切都是黑白色的。此效应同样适用于拍摄的照片。
//
//M.E.G.尝试使用弹射装置撞击墙壁上的金属弦，金属弦会发生特定频率的振动。离初始切入位置最近的一根弦的固有频率为440Hz左右。对所有88根金属弦的试验表明其振动频率介于约27.5Hz至4186Hz之间。
//
//M.E.G.派遣人员试图爬出钢琴进行勘探，鉴于勘测的困难性，目前仅摄得一张照片。推测照片内容可能是远处舞台的幕布。
//
//IMG_20220618_170100.jpg
//幕布？
//
//实体
//目前尚未发现实体。
//
//基地、前哨与社区
//介于本层级狭小而欠稳定的空间条件，M.E.G.难以长期在此驻扎或建立基地。
//
//入口和出口(待补充)
//目前已确认的出入口：
//
//入口
//钻进Level C-141钢琴房里的一台19世纪60年代的钢琴会来到此层级。
//从Level C-299的幕布切出有概率来到此层级。
//出口
//掉入最左边琴槌（对应弦频率为27.5Hz）以左的空隙会来到Level C-205。
//掉入第29和第30个琴槌之间的缝隙会回到Level C-141。
//掉入第56和第57个琴槌之间的缝隙会回到Level C-299。
//掉入最右边琴槌（对应弦频率为4186Hz）以右的空隙会来到Level 48。
//切入隔板会来到一个随机的宜居层级。
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
// 
//
//>>当琴键击响的那一刻，会发生什么呢……<<
//
//
//
//
//脚注
//1. “层级属性”详见层级属性分类系统。
//2. 这是多种乐器中音A(la)的频率。
//3. 琴槌（Hammer）是钢琴内部用来击打琴弦使其振动发音的组件。钢琴实际发声是琴弦振动带动音板共振，音板传出声音。
//4. 钢琴的核心部分。
//5. 即中音A（la）所对应的位置。
//
//Level C-125
//评分: 
//+87
//+
//–
//X
//
//
//
//
//
//【语音记录开始】
//……都他妈的给我离开这个层级！快！封锁所有入口！——这个层级已经不是人能待的地方了！整个空间都在剧烈地摇晃，还有令人几乎疯掉的噪音……我想，至少有120分贝1！我快被震昏了……还有剧烈颠簸的 地面
//琴槌
// ——当心那些沟壑！……
//
//【信号中断】
//
//——M.E.G.调查员███
//
//
//
//警告：
//关于Level C-125的上一版文档现已作废。M.E.G.督促所有流浪者远离该层级。
//
//
//Level C-125是后室C层群的第125层。这是一个充斥着颠簸与噪音的死亡之地。
//
// 
//
//生存难度：
//等级 5
//
//共振危害
//极不稳定
//重度噪声污染
//- 隐藏
// 
//
//层级属性：
// 
// 
//物理危害IMG_20220619_001343.jpg
//一位M.E.G.探员在剧烈颠簸中冒死拍下的一张照片。
//
//描述
//Level C-125是一个充斥着破坏性共振、毁灭性颠簸与杀伤性噪声的禁区，建议避开。出于未知原因（可能是流浪者被缩小导致），流浪者体内器官的共振频率2从通常情况的几赫兹提升到了数十赫兹乃至更高，因此钢琴某些音所发出的振动会使流浪者器官发生共振，乃至破裂致死。
//
//同时琴槌剧烈的颠簸极易将流浪者震到深不见底的缝隙中，且原本通向一些宜居层级的出口已经失效。
//
//在钢琴开始演奏时，狭小的空间内的声音强度可达到120dB乃至更高。若不佩戴耳塞等防护装置，流浪者的听力将受到不可逆伤害，且其他身体机能也会受到严重损害。
//
//将Level C-125的录音经降噪处理后，可听出音频为十九世纪的某些高难度钢琴名曲，包括但不限于《钟》(La Campanella)3、《c小调革命练习曲》(Étude Revolutionary in c Minor)4和《爱之梦》(Liebestraum)等。
//
//对于一个已身处该层级内的流浪者而言，最有可能活命的方法是爬上隔板来到钢琴外部。尽管目前仅有2名流浪者成功做到。
//
//我们知道这种做法十分困难，但这样做至少比待在下面那种该死的地方要好得多。
//
//
//出于安全性考虑，截至目前，M.E.G.封锁了所有该层级的入口。
//
//
//实体
//“四爪鱼”5
//据两名成功爬出钢琴内部空间的流浪者报告，在钢琴正前方坐着一个巨大的人形实体。其装束为十九世纪后期普鲁士风格，拥有面部特征，但由于距离原因导致无法辨认。除其拥有四只手6和巨大的身形外，其余特征与一般人类无异。多种证据表明，该实体的演奏导致了该层级的混乱。
//
//（更新于2022/1/3）
//“四爪鱼”
//该层级钢琴区前方坐有一个巨大的人形实体。其面部特征无法辨认。尚未知晓该实体是否存在智力。
//
//该实体持续做着弹奏钢琴的行为。目前已经证实，该实体所进行的这种行为会对本层级乃至少数其他层级造成极大威胁。
//
//IMG_20220619_122924.jpg
//实体“四爪鱼”正在演奏。
//
//基地、前哨与社区
//鉴于本层级的特性，不可能在钢琴内部建立任何基地。
//
//
//入口和出口
//入口
//钻进Level C-141钢琴房里的一台19世纪60年代的钢琴会来到此层级。（已封锁）
//从Level C-299的幕布切出有概率来到此层级。（已封锁）
//出口
//除下列两个出口外，其余出口已因不明原因失效。然而，由于偏离初始位置过远，下列两个出口极难到达。
//
//掉入最左边琴槌（对应弦频率为27.5Hz）以左的空隙会来到Level C-205。
//掉入最右边琴槌（对应弦频率为4186Hz）以右的空隙会来到Level 48。
//
//
//
//
//
//
//
//
//
//
//
//我们原以为把Level C-125的入口封锁住就万事大吉了，可是事情远没有我们想的那么简单……
//
//
//
//
//
//
//
//
//
//
//关闭
//发件人：immersemyself@backmail.com
//收件人：meg.seniorarchivist@backmail.com
//主题：Level 48海啸
//M.E.G.吗？你们给我解释下这是怎么回事！刚刚，我的海景房……它被接踵而至的海啸冲毁了！我费了好大劲才跑到一块高地上……你们的档案里明明写着Level 48是“宜居”层级！！
//
//～吴██（IP属地：Level 48）
//
//发件人：meg.seniorarchivist@backmail.com
//收件人：immersemyself@backmail.com
//主题：回复：Level 48海啸
//您好。M.E.G.今天已收到了数封这样的信件。具体原因仍在排查中，请放心。我们将尽快联系驻Level 48基地，尽力保障层级内流浪者生命财产安全。
//～M.E.G. 档案部（IP属地：Level 11）
//
//发件人：immersemyself@backmail.com
//收件人：meg.seniorarchivist@backmail.com
//主题：这似乎只是开端
//看，该死的海啸！它还是照着规律扑来的……某种急促的节拍？
//
//IMG_20220620_112937.jpg
//
//～吴██（IP属地：Level 48）
//发件人：meg.seniorarchivist@backmail.com
//收件人：immersemyself@backmail.com
//主题：回复：这似乎只是开端
//收到。我们将尽力解决。
//～M.E.G. 档案部（IP属地：Level 11）
//
//
//
//
//
//关闭
//关于敦促流浪者远离Level C-205的警告
//近日，由于不明原因影响，Level C-205内雪崩、暴风雪发生频率显著提升，且遵循某种规律，已对中心宜居区域北极山地区造成严重威胁。M.E.G.已通知流浪者远离该层级，M.E.G.冰海基地将协助层级内流浪者撤离。具体原因仍在调查中。
//
//IMG_20220620_110452.jpg
//雪崩到来时的场景。
//
//
//
//
//
//关闭
//
//
//我是一名数年前从前厅切入后室的钢琴家，曾任职于前厅的波士顿交响乐团。现在是为数不多常居在Level C-141的流浪者——你知道的，“管家”会赶走你，除非你能用琴声打动他7。我原以为我可以忘却一切，在“科林利诺房间”里安身半辈子，直到……最近的一场“地震”打破了这一切的宁静。
//
//那天早晨，我从睡梦中被剧烈而规律的晃动摇醒。我走出房间，看见“管家”正在清扫“地震”留下的狼藉。他看见我，眼睛里突然闪过一道光，停下手中的工作，将我拉到了钢琴房的一架19世纪80年代的钢琴旁（这个层级内的钢琴无法以任何方式损坏），然后递给我一份乐谱。这时候，整个个层级仍然在按照某种特定的规律振动着，只是没有那么显著了。
//
//“拿着，对着谱子上面弹。”管家对我说。
//
//我接过乐谱，上面写着：Étude in G# Minor, "La Campanella" S.140/38。
//
//“记住，跟着地面振动的节奏来；不能有错音——否则振动会更剧烈，搞不好层级就毁了。”
//
//我的左手颤抖地按下了第一个升Re音。
//
//……
//
//
//【无关信息已省略】
//
//
//
//
//后续补充记录（来自M.E.G.）：我们发现，该钢琴家演奏时，“四爪鱼”的乐音明显降低。但是，该钢琴家在演奏后，进入了长达两日的昏迷。
//
//
//
//
//风险清除类文档 文档代号：“四爪鱼”清除记录 一，二，三
//
//文档简介：为彻底杀死实体“四爪鱼”，清除其对Level C-125及其他层级的影响。M.E.G.在“相对弦音理论”的理论前提下，对该实体进行的首次清除，第二次清除和第三次清除。因均已失败，故将三个文档合并。
//
//以下为具体内容：
//
//“四爪鱼”清除记录 一
//文档记录时间：2022/2/9
//
//行动目标：杀死Level C-125中的实体“四爪鱼”。
//
//行动时间：2022/2/9
//
//行动地点：Level C-125，Level C-141
//
//参与行动的人员：流浪者钢琴家Vesent.M.E.G.武装部特工10名。
//
//行动概述：本次行动为清除“四爪鱼”的第一次行动。M.E.G.应聘了两位在前厅时的世界级钢琴家，演奏李斯特《第二号匈牙利狂想曲》、贝多芬《月光奏鸣曲》（第三乐章）等曲目来对抗“四爪鱼”。在数十分钟的演奏后，振动非但没有减轻，反而愈演愈烈。钢琴家Vesent也因此重伤。M.E.G.推测是曲目不匹配导致。本次行动宣告失败。
//
//“四爪鱼”清除记录 二
//文档记录时间：2022/3/13
//
//行动目标：杀死Level C-125中的实体“四爪鱼”。
//
//行动时间：2022/3/12
//
//行动地点：Level C-125，Level C-141
//
//参与行动的人员：流浪者钢琴家Mark.M.E.G.武装部特工10名。
//
//行动概述：本次行动为清除“四爪鱼”的第二次行动。在上一次的经验下，M.E.G.重新应聘了一位钢琴家。弹奏“四爪鱼”所弹奏曲子相同的曲子。演奏25分钟后，钢琴家Mark出血过量晕倒。M.E.G.将其抢救下后，Mark终不治身亡。
//行动具体记录如下：
//
//[视频记录开始]
//
//（Mark走到钢琴前，坐下，弹出了第一个音符。随后，其身体开始晃动。Mark调整状态后继续弹奏。）
//
//开始5分钟：“四爪鱼”的琴声已经压过了Mark。Mark自此时开始吐血。
//
//开始12分钟：“四爪鱼”的琴声越来越大。Mark已经出血严重。
//
//开始25分钟：Mark向后倒去。武装部的一名特工立刻将其救下，发现其已经因大出血晕倒。M.E.G.随即宣布离开该层级。
//
//行动后续补充：非常抱歉且悲痛，Mark最终不治，在基地内的医疗室中去世。
//
//这次行动的失败让我们意识到，单人的力量可能永远无法打败“四爪鱼”。我们会开始尝试应聘更多钢琴家来参加行动。
//
//“四爪鱼”清除记录 三
//文档记录时间：2022/3/29
//
//行动目标：杀死Level C-125中的实体“四爪鱼”。
//
//行动时间：2022/3/28
//
//行动地点：Level C-125，Level C-141
//
//参与行动的人员：流浪者钢琴家Winson，流浪者钢琴家Robert。M.E.G.武装部特工20名。
//
//行动概述：本次行动为清除“四爪鱼”的第三次行动。在上一次的经验下，我们再次发布了紧急应聘通告，但由于行动危险性已被公布，仅有两人前来报名，所幸，其中的Robert为前厅时的世界级钢琴家。两人与“四爪鱼”进行了长达40分钟的对抗。“四爪鱼”的琴声在演奏时出现了数次起落。但最终，Winson体内器官破裂，当场死亡。Robert一人无法对抗“四爪鱼”，也陷入了昏迷。M.E.G.撤离，行动再次失败。
//
//行动具体记录如下：
//
//[视频记录开始]
//
//（两人走至两架钢琴前坐下，开始演奏。“两人一起演奏时，四爪鱼”的琴声瞬间出现明显降低。）
//
//开始3分钟：“四爪鱼”的琴声逐渐降低。并且降低到了迄今为止的最低值。两位钢琴家的状态持续上升，合音近乎完美。
//
//开始8分钟：“四爪鱼”的琴声已经仅能听见少许。两位钢琴家的状态也达到了此次行动的顶峰。
//
//开始20分钟：“四爪鱼”的琴声大小猛然上升。使得两位钢琴家都表现出了明显不适。“四爪鱼”的琴声从此刻开始明显上升。
//
//开始35分钟：“四爪鱼”的琴声大小达到了迄今为止的顶峰。Winson已经开始摇晃身体。Robert也出现了四肢颤抖现象。合音已经走调。
//
//开始39分钟：Robert晕倒，Winson的琴声恢复，且频率极高。使得“四爪鱼”的琴声再次出现下降。
//
//开始40分钟：Winson吐血，倒在了钢琴上。M.E.G.将二位钢琴家救下后，发现Winson已经断气。M.E.G.也只能再次撤离。
//
//行动后续补充：通过检查Winson的尸体，我们发现，其为肝脏破裂而亡，由此可见，在最后的一分钟，其忍受了巨大痛苦。
//
//到目前为止，已经有两位流浪者死于这场保护人类的战争。我们在此，向两位以及其他参与行动的人员表达最诚挚的敬意。
//
//谢谢你们为了人类而负重前行。
//
//
//
//
//警告：
//该文档已过期，点此处查看最新版本。
//
//
//脚注
//1. 相当于飞机起飞时的声音的水平。在这种情况下待1分钟以上便会导致暂时性耳聋。
//2. 共振频率是指一物理系统在特定频率和波长下，比其他频率和波长以更大的振幅做振动的情形；这些特定频率和波长称之为共振频率和共振波长。在共振频率和共振波长下，很小的周期振动便可产生很大的振动。
//3. 由匈牙利作曲家弗朗兹·李斯特(Franz Liszt)创作，下文《爱之梦》同为他的作品。
//4. 由波兰作曲家弗朗索瓦·肖邦(F.F.Chopin)创作。
//5. 流浪者对该人形实体的戏称。
//6. 尚且不清楚是否为流浪者眼花而判断错误。
//7. “管家”会将任何在本层级滞留超过4个小时的流浪者请出本层级，除非你能够用弹奏钢琴的方式打动“管家”，并说服他让你留在本层级。鉴于M.E.G.内部的钢琴家数量微乎其微，因此直至目前，本层级仍然没有发展出任何前哨站或社区。（见Level C-141）
//8. 即前文提及的李斯特的作品《钟》，不过是1848年版的。
//
//Level C-125
//评分: 
//+87
//+
//–
//X
//
//
//
//
//
//一曲未终，我的双手便停了下来。这还是我人生中的第一次，也是最后一次。
//
//弦不再由我拨动了。我不后悔。
//
//只有这次，我是为自己而演奏的。
//
//
//
//——Franz Sebastian
//
//
//
// 
//
//生存难度：
//等级 1
//
//安全
//亚稳定
//威胁清除
//[+ 层级属性]
//		- 隐藏
//		 
//
//		层级属性：
//		安全周期
//		亚稳态
//		实体移除
//		描述
//描述
//Level C-125似乎是一个19世纪后期巨大化的立式钢琴的内部，尚且不知道是流浪者被缩小还是层级本身的尺寸造成的。四周是高耸的木质隔板，抬头可看见外部昏暗但相对集中的光源，疑似为舞台吊灯发出的灯光。Level C-125的上层地面由88个软木材质的琴槌组成，与其他结构一同构成击弦机。
//
//photo-1607817359832-19a6a93c5f23.jpg
//层级内的一张写真。
//
//琴槌分为3组，每两组之间有一个极宽的大缝隙，分别位于第29和第30个琴槌之间、第56和第57个琴槌之间。每两个琴槌之间也有一段较小的缝隙。流浪者应注意避免掉入缝隙中，因除少数情况会通往一个新的层级外，更多情况会使其使直接摔落至钢琴底部而死。隔板的墙壁呈现深色，同时附有软木、毛毡与粗金属弦组成的规律结构——弦列、音板及支架。
//
//IMG_20220617_175509.jpg
//地面与前方的墙壁的图片。
//
//初始进入时，流浪者会位于第40个琴槌上。
//
//
//
//层级的地面并不稳定，似乎会因流浪者在上面进行弹跳等剧烈运动而发生摇晃。
//
//出于未知原因，层级内所看的一切都是黑白色的。此效应同样适用于拍摄的照片。
//
//M.E.G.尝试使用弹射装置撞击墙壁上的金属弦，金属弦会发生特定频率的振动。离初始切入位置最近的一根弦的固有频率为440Hz左右。对所有88根金属弦的试验表明其振动频率介于约27.5Hz至4186Hz之间。
//
//实体：
//[第一次记录]
//
//据两名成功爬出钢琴内部空间的流浪者报告，在钢琴正前方坐着一个巨大的人形实体。其装束为十九世纪后期普鲁士风格，拥有面部特征，但由于距离原因导致无法辨认。除其拥有四只手和巨大的身形外，其余特征与一般人类无异。多种证据表明，该实体的演奏导致了该层级的混乱。
//
//[第二次记录]
//
//该层级钢琴区前方坐有一个巨大的人形实体。其面部特征无法辨认。尚未知晓该实体是否存在智力。
//
//该实体持续做着弹奏钢琴的行为。目前已经证实，该实体所进行的这种行为会对本层级乃至少数其他层级造成极大威胁。
//
//（更新于2022/1/5）
//目前已经发现对抗该实体所造成影响的手段：与其弹奏同一首曲子，可以在一定程度上降低共振，噪音和“超弦理论”的破坏程度。这种手段被称为“相对弦音理论”。
//
//在降低影响的前提下，M.E.G.进行了数次杀死该实体的尝试，均以失败告终。物理手段似乎无法对该实体造成伤害。
//
//[第三次记录]
//
//该实体已经死亡。层级已恢复正常。具体清除记录详见下。
//
//基地、前哨与社区
//鉴于本层级的特性，不可能在钢琴内部建立任何基地。
//
//但为了防止实体再次出现。M.E.G.每日需派遣数名特工进入内部巡逻。
//
//
//入口和出口(待补充)
//目前已确认的出入口：
//
//入口
//钻进Level C-141钢琴房里的一台19世纪60年代的钢琴会来到此层级。
//从Level C-299的幕布切出有概率来到此层级。
//出口
//掉入最左边琴槌（对应弦频率为27.5Hz）以左的空隙会来到Level C-205。
//掉入第29和第30个琴槌之间的缝隙会回到Level C-141。
//掉入第56和第57个琴槌之间的缝隙会回到Level C-299。
//掉入最右边琴槌（对应弦频率为4186Hz）以右的空隙会来到Level 48。
//切入隔板会来到一个随机的宜居层级。
//风险清除类文档 文档代号：“四爪鱼”清除记录 四
//
//文档简介：为彻底杀死实体“四爪鱼”，清除其对Level C-125及其他层级的影响。M.E.G.在“相对弦音理论”的理论前提下，对该实体进行了一二三四次清除。前三次均失败，此次（第四次）成功。
//
//以下为具体内容：
//
//“四爪鱼”清除记录 四
//文档记录时间：2022/5/5
//
//文档概述：2021年8月，Level C-125的威胁性突然大幅度提升。据资料显示，威胁来源为一个巨大人形实体。M.E.G.随即封锁了该层级入口。2021年年末，作为其切出点的Level 48频繁发生海啸。约数天后，作为其另一个切出点的Level C-205发生了雪崩。在M.E.G.的调查与排查后发现，上述两个层级的事故来源均指向Level C-125。2022年年初，M.E.G.的一名特工在Level 48的又一次海啸时，听到了和Level C-125的琴声频率曲子均相同的琴声。又不久后，在Level C-205同样出现了此等情况。因此，M.E.G.推断，以上两个层级的异常也均为Level C-125中的实体所导致。在短暂观察期后，M.E.G.确定了推断，并将该情况称之为“超弦理论”。
//
//由于Level 48与Level C-205均为宜居层级，且有大量流浪者定居。并且我们无法估量未来会不会有其他层级被影响。所以，在短暂的会议后，M.E.G.即刻决定尝试杀死该实体。初始，M.E.G.试图派遣武装部员工进行强攻，但伤亡惨重。
//
//一筹莫展之际。M.E.G.于2022年1月5日在Level C-141发现一位正在弹钢琴的流浪者。其演奏的曲子与“四爪鱼”所演奏的曲子相同。在该流浪者演奏时，Level C-141中所听到的“四爪鱼”演奏频率明显降低。发现这种特性并经过实验后，M.E.G.正式将其作为对抗“四爪鱼”的方式。并将其命名为“相对弦音理论”。
//
//在此次文档修订之前，M.E.G.已经进行过三次杀死“四爪鱼”的尝试，均以失败告终。在吸取教训后，M.E.G.在做足了充分准备的条件下进行了该次（第四次）尝试。
//
//以下为具体内容：
//
//行动目标：杀死Level C-125中的实体“四爪鱼”。
//
//行动时间：2022/5/4
//
//行动地点：Level C-125，Level C-141
//
//参与行动的人员：钢琴家Robert，钢琴家Delcis，M.E.G.武装部特工20名。
//
//行动概述：本次行动为清除“四爪鱼”的第四次行动。M.E.G.应聘了两位在前厅时的世界级钢琴家，演奏《爱之梦》等曲目来对抗“四爪鱼”。在长达一个小时的演奏后，“四爪鱼”的乐声停止。M.E.G.进入层级内部。发现“四爪鱼”已经死亡。
//
//行动具体记录如下：
//
//[视频记录开始]
//
//（Robert和Delcis坐在了Level C-141的两个钢琴前。放好琴谱。开始演奏。）
//
//开始5分钟：两人开始演奏后，“四爪鱼”的琴声频率出现低程度降低。同时，两位钢琴家所表现出的状态良好。两人的演奏合拍完美。但目前频率仍然偏高，武装部特工也只能暂时待命。
//
//开始8分钟：随着两位钢琴家渐入佳境。“四爪鱼”的琴声频率得到了极大降低。两位钢琴家所表现出的状态良好。虽说如此，“四爪鱼”的琴声仍未被磨灭。所以，武装部特工仍处于待命状态。
//
//开始15分钟：“四爪鱼”的琴声基本上已经不存在。只剩下若有若无的弦音。两位钢琴家的状态良好。但由于第三次的教训。并未立刻派遣武装部特工进入Level C-125。
//
//开始19分钟：“四爪鱼”的琴声消失。M.E.G.立刻派遣武装部的一名特工进入Level C-125查看情况。
//
//开始21分钟：一名M.E.G.武装部特工进入Level C-125.据其称，“四爪鱼”头往下低，已经停止演奏。
//
//开始26分钟：该特工称，“四爪鱼”抬起了头。
//
//开始27分钟：琴声再度传来。频率相较于刚开始时强了数十倍，在强烈的冲击下，Robert明显表现出了不适。Robert的演奏明显放慢。其吐出一大口血晕倒。Delcis同样表现出了明显不适。其浑身颤抖，但其演奏速度并未减慢，相反，Delcis加重了旋律。另一边，进入层级内部的武装部特工发出了一条讯息后其心脏起搏器停止，该特工死亡。
//
//讯息内容：我已经没有力气了，照顾好我的妻儿。
//
//开始35分钟：琴声频率到达顶峰。Delcis似乎已经神志不清。但幸运的是，其弹奏的速度和旋律仍无任何变化。
//
//开始40分钟：Robert起身。重新坐在了钢琴前，再次开始了弹奏。
//
//开始43分钟：“四爪鱼”的琴声频率出现了低程度降低。从这时开始，其弹奏频率开始逐渐降低。两位钢琴家情况稍作好转，Robert很快进入了状态。两人的演奏恢复正常。
//
//开始49分钟：“四爪鱼”的琴声频率猛地降低。琴声开始断断续续。
//
//开始58分钟：“四爪鱼”的琴声已经偏离原曲调。同时，武装部也已准备切入层级内部。
//
//开始60分钟：突然，传来了迄今为止最为强烈的琴声。不过仅持续了一秒。随后，琴声停止。这声琴音传来后，Robert趴在了钢琴之上。Delcis也停止了演奏。武装部再次派遣了一名特工切入层级内部。
//
//该特工称，“四爪鱼”倒在了地上。双眼紧闭。推测其已经死亡。随后，武装部全员切入层级内部。在对“四爪鱼”进行观察后，发现其的确已经死亡。
//
//视频记录结束
//
//至此，行动成功。“四爪鱼”死亡，所有受影响层级的琴声也在此刻全部消失。
//
//行动后续记录：很遗憾，当我们前去查看Robert的情况之时，发现他已经去世了。不幸中的万幸，我们抢救回了Delcis。
//
//我们在Robert的口袋里发现了一张写有字的纸条。
//
//纸条内容如下：
//
//可能，这是我的遗书。
//
//我并不确定我是否会死，但是我深知，我接下来的行动风险重重。在参与第三次除掉那个实体的行动，Winson凄惨的死在我旁边时，我便无比清楚，这个行动是会送命的。但是我不得不去做。报名这个行动的人只有五个，已经有两人成了先例。如果我不去做，往后，这个家伙也会威胁到我和我的家人。如果我做了，并除掉了它，那么即使我死了，也是值得的。
//
//上次，Winson死在了我身边。在行动之前，我就问过他：“听说这个行动会死人，你怕吗？”Winson点了点头，接着开口说：“怕，也没有办法。”这句话在当时，我听起来并无感。但现在，我终于明白了它的含义。
//
//我小时候，总是想做一个英雄，做一个超人。保护人类，拯救世界。这种想法，是不是很俗？但是它就是我最纯真的梦想。
//
//我可以圆梦了。
//
//时间已不多，M.E.G.已经给我发邮件了。要走了。
//
//这张纸条，我会放在口袋里，如果我死了，请M.E.G.照顾我的家人。我的儿子已经18岁，可以为M.E.G.贡献出自己的力量了，请帮我培养他。无比感谢。
//
//2022年5月4日 Allen Robert
//
//见到此书，我们无比悲痛。Robert，谢谢你，好好睡一觉吧。
//
//
//-
//-
//-
//-
//-
//-
//-
//-
//-
//
//
//在“四爪鱼”死亡后数月，Level C-125再也没有传来任何琴声。M.E.G.解封了它的入口。
//一日下午，M.E.G.总部接到一封邮件。是驻扎在Level C-125的特工发来的。邮件称，在一个琴键上发现了刻字。该特工将刻字内容发回。
//
//刻字内容如下：
//
//
//具体时间我已经记不清楚，大概是普法战争将近之日，我出生了。我的父亲在我出生后不久参战，在战场上战死。因为家境贫寒，母亲万念俱灰，将我托付给一位老钢琴家后自杀。从此，我唯一的家人只剩下了那位老钢琴家，也就是我的养父。
//
//我的养父极其喜爱音乐。在他的熏陶和教导下，我也爱上了音乐。阴云密布，战火纷飞的年代，人能够活着，就是一大幸运。但我不想这样活下去，我每天努力的练习钢琴。我尤其喜爱弗朗兹·李斯特的《钟》，《爱之梦》与肖邦的《c小调革命练习曲》。我也将这三首曲子演奏的颇为熟练，在我们的城市也小有名气。
//
//1892年5月22日，我的养父身体情况急转直下。在三天后，他便去世了。在卧铺上，他缓缓拉住我的手，用尽力气说：
//
//“我毕生的梦想，便是在维也纳金色大厅演奏。现在我做不到了，我把这个梦想托付给你了。”
//
//养父下葬那天，我没有哭。
//
//从此之后，这便成了我终生的梦想。我日复一日，不停的练习，一次又一次的坐在钢琴前。慢慢的，我的身影活跃在了各大剧院。终于，有一天，我接到了维也纳金色大厅的邀请函。我无比激动，当晚，我翻来覆去难以入睡。为了保证第二天的状态，我强迫自己睡了下去。
//
//不知过了多久，我睁开双眼，但眼前并非宾馆的床铺，而是一个我从来没见过的地方。我仔细观察了一番，发现，这里竟是一个巨大的钢琴。这显然不符合常理。我尝试爬上最高处，但脚下一滑，我跌入了琴键之间的缝隙。
//
//缝隙很深，在下落的过程中，我觉得，我是要死了。
//
//但，我不甘。我即将完成我的梦想，即将告慰我养父的在天之灵，我不甘。
//
//终于，我的躯体落在了地上，剧烈疼痛后，我闭上了双眼。
//
//我不甘。
//
//又不知多久，我又睁开了双眼。我环顾四周，看到了令我震惊的一幕。
//
//我坐在一架钢琴前，下面是成群的观众，我的脚下，正是那金色大厅。
//
//但我不是死了么？
//
//不，我没有死，刚才那些只是我的梦境。我在心里对自己说。同时，我迅速调整好状态。
//
//《C小调革命练习曲》就它了，我敲动了第一个琴键。
//
//演出很顺利。我不断收到掌声，我也已经沉醉其中了，我已经不知将那三首曲子弹奏了多少遍。演出始终没有结束。我也感受不到任何倦意，我相信，这是我的信仰使然。
//
//在又一次演奏《爱之梦》时，我听见了不属于我的乐音，同时，我的胸口开始出现微微疼痛。我明白，这是我内心在作祟，我需要打败它，我再次调整状态。果然，在我把状态调整好后，那个乐音逐渐降低，直至消失。
//
//我继续演奏，谁知不久后，又一阵不属于我的乐音来袭。这次乐音比上次的明显更为强烈。它甚至让我开始颤抖，我再次调整状态，使自己意识清醒。同时加重了弹奏。在一首曲终后，那个乐音已经模糊。趁热打铁，我立刻弹奏了下一首曲子，果不其然，乐音在我弹奏到一半时，也消失了。
//
//接着，又出现了两次这种情况，这两次乐音都对我造成了不同程度的伤害。第三次乐音来袭时，我差一些就挺不住了。我意识到，乐音还是会到来的，但我没有走下舞台，如果我走下来，我的养父，我的母亲，我的父亲都会对我失望的。我这样想。
//
//我依然在不停的演奏。
//
//和我预想的一样，第四次乐音在不久后来袭。这次的乐音程度比前几次都要强。它让我出现了极强烈的头晕。我稳定好自己，不让自己从座位上掉下来，同时重新开始了演奏，我加重了力量，那个乐音也降低了，但仍很强烈。过了一会儿，乐音突然又恢复至了刚开始的力度。
//
//可是，我已经没有力气了
//
//我的演奏开始断断续续，到最后，甚至偏离了原曲。
//
//我已经无法控制我的身体了。我的身体剧烈的颤动着。
//
//我的眼前出现了我的养父。他微笑着看着我。
//
//我终于是没有力气了，身体开始摇晃，我用尽最后一丝力气，弹出了我有生以来弹过最重的一个音符。然后倒了下去。
//
//大厅里响起了热烈的掌声。
//
//我微笑着，闭上了双眼。
//
//曲子还没演奏完毕。
//
//但演出，
//
//是时候结束了。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1125{}