//Level C-165
//评分: 
//+25
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//Archives2
//Level C-165的一隅
//
//Level C-165是后室C层群的第165层。
//
//描述
//Level C-165是一个无限大的档案馆，由四周环形的门厅和中心的圆形档案室组成。前厅设有用以对进入这一层级的流浪者进行检疫和消毒的房间，离开消毒房后是一处环形的大厅，存在无法计数的猫科动物在这里生活，其毛发似乎均得到了很好的护理，且这里会定期提供猫粮和三文鱼肉；墙壁和地板和各种家具均来自前厅中不同时期的装饰风格，其中包括但不限于巴洛克风格、地中海风格、新中式风格和极简主义设计风格等。
//
//档案室内为几乎无限大的空间，由摆满了书籍的书架分割。每间隔数量不定的书架后会出现一个供休息和坐着阅读的区域，这些区域总是设有摆放整齐的皮质座椅和鹅绒内衬的布制座椅，正对着一张10米长的木制长桌，材质通常是梨木和红楝木，上面摆着点燃的烛火、用来翻页的塑胶手套和猫薄荷香薰，有时候会设有电脑，但仅能浏览进行档案管理的系统。任何意图前往最中心深处位置的尝试都没有成功，朝向中心前进总会感觉有近乎无限的书架在前方出现，并将流浪者隔绝在最外层进行活动。
//
//这里的书籍多数为已归档的应用文书，其中包括启事、会议记录、通告、批复、指示、决定、命令、请示、公函等，但上面的发文字号、文字符号、批复单位和审批表格式均与前厅已知的绝大多数情况不符，仅有极少数情况下能够找到使用前厅文字书写的文书。值得注意的一点是，寻猫启事的发文字号多为“找不到喵[1997]165号”，讣告的发文字号多为“再见喵[1999]165号”；当前未发现其他年份的文书，下方的印章均为猫爪。
//
//每一个进入此处的流浪者都会有一只口衔着一张保密协议的纸张和钢笔的猫出现在他面前，保密协议的背后是一系列关于档案馆内的禁止事项，但由于内容过于潦草，当前仅有标题的“禁止事项”四个字被被成功破译。流浪者需要在保密协议上签上自己的名字，拒绝签字或冒充他人签名的流浪者会被立即送回进入这一层级前的位置，且再无法进入。
//
//数据采集
//每间隔72小时，会有超过数百只猫从入口处涌入档案馆，这些猫总是根据其品种的不同而划分为不同的队伍，且每一只猫进入时总是口中衔着信封或背着装满纸张的背包，它们似乎都向着同一个目标前进。当有流浪者意图跟随它们的踪迹时，总会被察觉且绕路甩开跟踪，以至于目前仍未可知它们的目的地为何处，据部分流浪者推测它们的目标是档案库房或管理员室。
//
//经过1到3个小时后，这些猫会从档案馆深处涌出，身上携带的纸制品均已消失，并经由入口处的特殊管道离开这一层级。无法确认它们的去向和目的，使用无人机沿着猫出入口进入的尝试均以失败告终，唯一回收到的视频信息是一只快速挥向无人机摄像头的猫爪。
//
//档案管理
//在档案馆内广泛存在一些戴着白色手套的猫，它们会在各个档案分区间移动，并不时取出档案并翻开文件，有时候会使用打码器将档案进行编号，抑或是使用订书机对文件进行装订。
//
//大部分情况那只猫会将未装订的档案取走，经过10到20分钟后重新放回原处，那个档案使用丝线进行重新装订，且穿线孔传出一股类似燃烧木屑或烤核桃的味道。
//
//编研管理
//在一些大型休息区内，偶尔会聚集超过20只猫坐在长桌上，一旁摆放着大量未被归档确认的档案和新的档案盒，为首的几只猫会围绕着若干张写着大字样的纸张和便签，并不间断地叫喊。有时会将档案推下长桌，在桌子下方会有一只猫接住档案并将档案放回书架内。在此期间，流浪者会被几只体型稍大的橘猫阻挡靠近的道路，执意靠近的流浪者会被驱逐出这一层级。
//
//档案质检
//当流浪者获取一本档案进行阅读时，在他主观视角内除了档案以外的区域都会变得漆黑一片，并且面前会出现一个浮空的电子屏幕，屏幕内会显示当前持有的档案内容；这种情况会在合上档案或停止接触档案后消失。在这期间，流浪者需要对档案内出现的页码错误、页面倒置、挂接错误和实体缺失等情况进行提交，若挂接数据与实体档案一致或提交问题不存在，则不会出现任何情况。若提交问题经计算机证实存在，流浪者身边将会出现一定量的食物和杏仁水，这些食物通常是是新鲜且在后室极其罕有的前厅美食。在提交问题后的3到5天内，重新对该档案进行检查会发现问题均被纠正。
//
//在此期间，流浪者对档案进行毁坏、涂鸦，故意倒置、错挂、漏挂和删除电子档案附件通常会导致对其进行不同程度的惩罚，通常是流浪者与档案实体发生错位并穿透彼此，被融入档案内的身体部位会在边缘处完整的切开，且不会造成失血，但伴随着相应的痛觉，在之后的生活在也会表现出严重的幻肢痛；消失的身体部位可以在该档案的末尾处出现，其以照片或素描的形式作为附录被贴在档案内，并写有“损坏原因与器具”的字样。在错位期间及时将重叠部位取出将不会造成进一步伤害，仅会在档案末尾处添加一张写有“档案损坏，肇事者逃逸”字样和该流浪者大拇指指纹的便签纸。
//
//咨询室
//咨询室是一间位于大厅内的房间，上方挂着一个写有“咨询室”的铭牌，正面是一个有孔洞的玻璃，其他方面没有可见的出入口，内部时常有一只橘猫趴在玻璃后的木桌上，桌子上摆放着一台老式电脑显示器和键盘，电脑旁放着一袋敞开的猫粮和一杯牛奶。当有路过的流浪者经过此处对其进行交流时，那只橘猫会有气无力地叫几声，之后不再作出回应。
//
//Archives4
//档案库房
//
//档案库房
//档案库房位于较接近档案馆中部的房间，用以存放机密档案和隔绝外层档案和内部档案。库房内部一直保持温度不低于14℃，相对湿度45%左右，且不时会有一些猫会在档案柜内投放干燥剂和除螨剂。当前此处禁止任何流浪者靠近和进入，在每一个仅能容纳一只猫进出的门口处都设有安保系统，非猫的生物靠近时会引起安保系统的警报，并会被随后到达的档案管理员驱逐出层级。
//
//管理员室
//在一些传言中，管理员室位于整个Level C-165的正中心。沿着档案室正中心前进有一定几率可以到达管理员室，有时候也会出现在入口处附近，通常是第一次进入层级的流浪者在跟随一只黑色英国短尾猫的踪迹后到达，但却会在转身以后消失在视野里。
//
//据传此为档案管理员进行档案管理、录入档案、删除档案和扫描档案的房间，也作为档案管理员日常休息和居住的场所。在管理员室的电脑内可以对自己进入后室后在前厅的情况进行查询和收集相关数据，此情报未被证实。
//
//档案管理员
//Archives1
//档案管理员，由流浪者偶然接近后抓拍
//
//档案管理员是Level C-165内唯一的实体，生有黑色的顺滑毛发，大致是具有猫科的外貌。他总是身穿深色格子衫和浅色长袖衬衫，下身为黑色长裤，偶尔会背着双肩包。每次出现时手上总是抱着档案盒，有时也会推着装满了档案的手推车，此时他表现得非常急迫和匆忙。
//
//档案管理员总是在Level C-165的书架间游荡，不时会取出或放回档案。被流浪者观察到他不时会在没人的休息区内使用电脑、翻看档案、用丝线装订散落的档案和趴在桌子上闭目休息。
//
//一般情况下，任何试图接近档案管理员的尝试都会招致他的躲避，他会低着头快步走开，如果当时手上拿着档案也会用档案挡住脸部；他似乎很忌讳被流浪者直接看到他的长相，但并不会主动攻击和表现敌意。杏仁水的气味似乎会让他更加远离你；他排斥一切逗猫棒、激光笔和猫粮，频繁使用这些东西与其互动会严重激怒他。
//
//Archives3
//档案管理员
//
//当流浪者存在如下情况时，将会被赶到的档案管理员驱逐出层级：
//
//在档案室内大声喧哗。
//损毁和涂鸦档案实体。
//将档案带离档案室。
//对档案进行拍照和录影。
//将档案胡乱摆放。
//在档案室内进食，且在地上、桌上、档案上留下污渍。
//对档案室内的猫表现出敌意。
//使用逗猫棒、激光笔和猫粮挑逗档案室内的猫和档案管理员。
//在档案室内使用电子设备。
//追上并抚摸档案管理员。
//打扰档案管理员的工作。
//若有流浪者做出了损坏档案或不文明的事情，档案管理员会迅速来到他附近并将其驱逐出这一层级，此过程几乎无法被察觉，也无法确认具体驱逐的过程和方式——随后开始收拾那名流浪者留下的痕迹，包括对那名流浪者的东西进行清理，包括将取出的档案放回原位、对接触过的地方进行清洗并涂抹酒精和将垃圾打包带离档案室等，有时候也会高声呼喊一声“喵”，之后会有10到20只猫从档案室各处涌来帮忙清理工作，其中一只会站在长桌上伸手示意那名流浪者的位置并对着一旁的其它流浪者不停地叫喊等；清理完成后档案管理员会自行离开此处，似乎总是会回到管理员室。
//
//基地、前哨与社区
//尽管有一些进入这一层级的流浪者在靠近入口处的休息区内存在小规模的集散点，但仍无法形成一个完整的社区。
//
//入口与出口
//入口
//你可以在大部分层级内找到并揭下一张寻猫启事，即可传送进入。
//在极少数层级内找到一只极度胆小的孟买猫，轻抚并竖抱后会进入层级。
//在Level 153内找到一本标注借书时间到期且封皮标题被使用油性笔涂鸦的档案盒，打开即可传送进入；进入时会出现在表现出愤怒情绪的档案管理员周围，随后将你驱逐出层级。
//在Level 409内找到一本装在档案盒，档案盒内为使用牛皮纸裁成的书册，打开并完整阅读即可进入层级；进入后会被提醒前往附近的休息区清洗手上的油渍。
//在Level 906内找到一本儿童读物，内容是关于如何梳理一只猫的毛发；完整阅读后会被传送至档案管理员附近。
//在Level 974内找到一本名为《如何变得更可爱》的说明书，将其放入房间内的一个档案盒里即可进入层级；进入层级后身上的穿着会变成一件粉蓝色的甜美系洛丽塔。
//将Level C-22地上的一本书本上面沾染的血渍擦除即可进入层级。
//在Level C-67内找到一本泛黄的村志，掸掉上面的灰尘并露出标题后即可进入层级。
//从Level C-110可进入层级，具体方式暂不明晰。
//在Level C-240的图书馆建筑内进行数据挂接时有一定概率进入层级。
//出口
//损坏档案或伤害档案室内的猫会被档案管理员驱逐出层级，通常是C层群内的随机层级。
//完成10本档案的校对工作且没有出错后，可以提出离开这一层群的要求，通常会被传送至宜居或生存难度0到1的层级。
//试图将自己创作的小说放进书架时，会连同小说草稿一起被送往Level C-114的羁押病房内。
//与档案管理员进行过多互动也可能被传送出层级。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1165{}