//Level C-159
//评分: 
//+10
//+
//–
//X
// 
//
//生存难度：
//等级 2
//
// 
// 
// 
//Level C-159是后室C层群的第159层。
//
//描述
//Level C-159为一大型工厂建筑，其装修风格与前厅中20世纪90年代的装修风格类似，该层级内部包含大量车间。目前仍未知该层级的具体面积，有流浪者报告称该层级大约为500000平方公里。
//
//在Level C-159，流浪者们可以在多个车间找到大量可利用的物品。目前在该层级已被确认包含的车间包括：
//
//纺织车间：在此类车间的入口处包含一铁质的告示牌，并包含“纺织第X号车间”等字样。流浪者们可以在此找到大量衣物，通常为西服、衬衫等，在极其罕见的情况下可以找到一些做工精良的防护服。
//食品加工车间：在此类车间的入口处通常包含一写有“FOOD”字样的橘色喷漆痕迹。在这里流浪者们可以找到大量食物1。在此类车间靠近墙壁处有一些保险柜，在打开这些保险柜后可发现少许皇家口粮。
//钢铁加工车间：此类车间入口处不包含任何标识。在此类车间包含大量器械、铁矿石等。经检测，这些铁矿石经加工可以转化为铁锭。
//家居生产车间：此类车间包含大量完好的，可利用的家居生产设备。流浪者们可以在此该车间找到大量可利用的物品。目前B.F.P.F.已占据部分家居生产车间并将其改造为临时据点。
//玩具加工车间：此类车间内包含大量生产设备以及大量被人为破坏过的毛绒玩具。此类车间地面撒落着大量彩色纸屑，在其棚顶处飘浮着大量气球 =)。
//化工车间：此类车间入口处及其内部均被一种粘稠的、深绿色的腐蚀性液体2所覆盖，此类液体对人体危害极大。M.E.G.不建议流浪者探索此车间。
//Level C-159中的Wi-Fi信号较好，可以在聊天区保持较为顺畅的信息传递。但在部分车间表现出了不稳定性以及流量劫持现象，推测该现象为某种潜在效应。
//
//在Level C-159的正南方向包含一被木板封锁的铁大门，目前该铁门已被人为破坏。穿过该铁门，流浪者们会来到一极度黑暗且缺乏光照的区域，该区域呈现为一长期弃用的长廊，被流浪者们称作“ 暗室
//Dark Room
// ”。暗室包含数种危险的实体。此外，暗室处于严重失修状态，其地面包含大量坑洞，墙壁大面积掉漆。因极度危险已不建议流浪者探索。
//
//实体
//在Level C-159的主体部分以及大多数车间包含少量实体，其中包括但不限于“啪嗒”、悲尸、笑魇以及极少数的虫群。其中以悲尸的生成频率最高。
//在玩具加工车间有过娃娃脸存在过的痕迹以及少许派对客，其中派对客的数量似乎在不断增加。
//暗室内部包含大量笑魇，有时可以发现恐惧怪兽的存在，偶尔会有1～2只穿着工装的无面灵。
//在本层级包含一种仅会在本层级生成的实体，该实体被流浪者们俗称为“ 工人
//Worker
// ”。在大多数情况下，工人会在位于Level C-159且携带物资严重不足的流浪者身边出现。流浪者报告称工人与欧裔白人男性的外貌特征相似，通常戴着灰色头盔并穿着深蓝色工装。
//工人会尝试与流浪者进行交流并向流浪者提供物资，在罕见的情况下有过工人与流浪者以物易物的记录。通常情况下工人是友善的，它们会在向流浪者提供足够的物资后消失。
//基地、前哨与社区
//B.F.P.F.临时据点
//由B.F.P.F.占据并改造的家居生产车间，入口处包含B.F.P.F.的标志。
//人数通常保持在7～10人。通常会派遣成员在此生产或获取物品。
//部分已被M.E.G.捣毁。
//M.E.G. - C159号前哨站
//M.E.G.占据的部分车间。主要目的为采集Level C-159内部的可利用资源。
//部分前哨站兼任对流浪者进行该层级的科普工作。
//暗室探索小队
//由一些流浪者自发组织的小型团体，负责对暗室的探索工作。
//已与M.E.G.达成友好关系。目前M.E.G.对暗室的绝大多数资料均由该团体提供。
//入口与出口
//入口
//试着穿过Level C-345内的警戒线，则有概率切入Level C-159。
//在Level C-158的海洋中潜入约350米～500米的深度会直接切入Level C-159。
//在Level C-165阅读一本名为《工厂前传》的小说，阅读7～10分钟后会直接切入Level C-159。
//出口
//前往暗室并跳入一个坑洞，有概率随机切入一个层级。
//有流浪者报告称与工人发生争执并在争执中死亡则有概率在Level 0重生。
//尝试食用食品加工车间角落处的蘑菇，食用蘑菇后的流浪者们会立即昏迷。在昏迷后的27～30分钟后会在Level C-27醒来。
//前往玩具加工车间并跟着派对客走，它们会带你去享乐层 =)！
//⚠如果您做出了错误的抉择，那么您将会被切入Level C-440⚠。
//作者信息
//« Level C-158 | Level C-159 | Level C-160 »
//
//Footnotes
//1. 尽管大部分食物已经发霉或腐烂。
//2. 分析中发现了硫酸的痕迹。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1159{}