//Level C-117
//评分: 
//+40
//+
//–
//X
// 
//
//生存难度：
//等级 健康生活
//
//部分情况安全
//层级专属法律
//中立组织主导
//Level C-117是后室C层群的第117层。
//
//描述
//Level C-117是一座面积约为9000平方公里的现代城市，拥有复杂的立体交通系统、覆盖整个层级范围的网络信号和约400万人口。该层级拥有体量较大且完善的武装力量和政府管理体系，并有3个高等学校，但没有民用客运飞机站与列车站，取而代之的是当地的近地面飞行器。
//
//architecture-1868667_640.jpg
//近地面飞行管制期间流浪者社区上空拍摄的Level C-117
//
//
//Level C-117内社会的科技水平显著高于2022年的前厅社会，例如全面民用化的全息影像、个人低空飞行器，军事科技方面则能够生产能量立场护盾并进行小规模商用化，多数武器仍属于化学动能武器，但火药性能有所提升。
//值得注意的是，该层级内部并没有任何类似农场的自然食品作物繁育基地，只观察到存在一个食品加工厂。目前该层级的食物来源未知。
//
//当地政府对流浪者的态度较为温和，在城市边缘开辟了一块区域供进入Level C-117的流浪者生活，但不提供食物与任何社会救济福利。在该层级生活的流浪者被要求遵守当地法律，并且当地政府拒绝M.E.G.与其他团体进行正式交涉，这意味着如果有流浪者在该层级违反了当地法律，则无法受到M.E.G.组织的保护。因此，在进入该层级之前，我们建议先阅读该层级政府出版的《民法典》。我们不推荐流浪者在该层级产生任何冲突，当地警察普遍配备武器，并且对流浪者态度并不友好。
//
//注意事项：
//该层级政府所颁布的法律与前厅社会有所不同，需要各位注意
//
//不要将杏仁水带入Level C-117， 任何甜品或味觉感受为甜味的可食用物体在该层级均属于违禁物品，被发现将遭到被送往食品加工厂服役的处罚。Level C-117内部有免费提供的纯净水。
//我们建议进入Level C-117的流浪者尽快找到一份工作，定期的清理房间和社区和帮助特殊人群也被视为一种“工作”并能得到酬劳。
//如果有人向你提供食物，尤其是甜品，无论是否免费都不要接受。如果条件允许，可以前往最近的警局以“提供甜食罪”向其举报，作为报酬，你会得到那份食物，但不建议立刻食用。
//不要试图在商店内购买糖、非全麦面粉、饮料以及水果。
//每天早上出现在房间门口的面包可以选择不吃或者丢掉，但别让其他人拿走并食用，否则会受到处罚。
//保持身材，不要发胖。如果你的身体在进入Level C-117就有肥胖现象，则不建议进入该层级。
//如果你进入了当地政府，特别是在健康生活委员会内工作后，不要向同在Level C-117的流浪者或当地居民讲述你的工作内容或是你在政府机构内了解到的信息。如果你实在感觉难受，建议离开Level C-117。
//不要靠近位于城市边缘的食品生产工厂，最好也不要打听相关信息。
//你和你的终端设备会被监视，但这是正常的，并且不影响生活。但建议不要就当地政府的行为发表意见，否则你在离开Level C-117时可能会遇到一定困难。
//不要犯罪，Level C-117内部没有监狱或看守所存在。
//在这里活下去不难，但对大多数人来说可能会有些不适应。
//通常来说，Level C-117被流浪者称为“难得赛博朋克风的层级”，在这里生活并不需要时刻警惕实体威胁，但相对的你可能会需要找回在前厅生活时所锻炼出的现代社会交际能力。M.E.G.支持并建议“出生在后室的一代”进入Level C-117生活一段时间去学习知识和增进社交能力。
//
//令人庆幸的是，Level C-117内部的原住民之间没有被发现能够离开该层级。
//
//打开附录
//基地、前哨和社区
//Sweet Croissants&Pizzas甜品店
//gedung-209563_640.jpg
//Sweet Croissants&Pizzas甜品店总部正门摄像
//
//Sweet Croissants&Pizzas甜品店总部位于Level C-117的中心，是除了军事设施之外防御最森严的地区，同时也是整个Level C-117的心脏和层级内最大的一家公司。
//Sweet Croissants&Pizzas甜品店是整个Level C-117唯一的食品供销商，他们掌控并强行垄断了所有居民的食物供给。同时，由SC&P甜品店全资支持建立的健康生活委员会作为Level C-117政府的首脑机构和甜品店的外事代表活动，对整个层级社会实行专制。同时，甜品店也负责了整个层级政府机构、公安系统、军队的人员工资和其他资金支持，并由其总部分设部分全权负责Level C-117的司法工作。M.E.G.目前尚不明确该公司的内部情况，但有情报显示该公司由一人控制，此人是否为某种实体尚未知。
//Sweet Croissants&Pizzas甜品店对M.E.G.组织持友好中立态度，他们为进入Level C-117的流浪者提供住宿和工作机会，并借此向M.E.G.换取一些物资——作为非正式性交易，M.E.G.向Level C-117政府输出人口，而后者则为M.E.G.提供部分武装与科学技术，层级内部的教育机构也对外开放。但甜品店以维护健康生活为由拒绝M.E.G.特工与武装人员进入Level C-117。
//尽管M.E.G.与甜品店处于非正式合作关系，但由于以上原因，流浪者在该层级的生存状况实际由甜品店负责。
//学院都市
//涵盖了从幼儿园到高等院校的完整教育体系社区，作为专门的教育机构向整个Level C-117与其居民提供教育服务。
//层级政府允许并鼓励流浪者在此工作，目前约有500名流浪者作为志工或零工在此工作并接受再教育。
//流浪者社区
//位于Level C-117东部贫民窟旁，目前共有约900人居住，是所有进入该层级的流浪者的生存保留地。
//流浪者社区为流浪者提供工作中介，并有专人负责食物补给。初入此处的流浪者会被发放一本由该层级社会出版的《民法典》。
//曾经来到Level C-117的流浪者会被强制没收可供联络M.E.G.数据库的终端，在总署相关负责人提出抗议后改为网络活动监控。
//入口与出口
//入口
//在任意层级内高举一块面包并大喊“定量补给，健康生活！”1，随后你会在现流浪者社区（原Level C-117公共墓场）内部醒来。
//出口
//一次性吃下三块面包、一块黄油。
//持续性暴饮暴食。
//任何反对“健康生活”或类似的言论、行动。
//所有出口都会随机通往任意一个层级。
//作者信息
//« Level C-116 | Level C-117 | Level C-118 »
//
//Footnotes
//1. 这句口号曾在某一层级的流浪者群体当中作为公共宣传而流行，导致了一次共有6人的Level C-117集体进入事件，这也是Level C-117首次被发现。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1117{}