//Level C-145
//评分: 
//+28
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//Level C-145是后室C层群的第145层。
//
//描述
//Level C-145由一栋房子和附属于房子的后花园组成，透过花园的铁栏杆和房子的窗户可以看到房子外面围绕着一个宁静美丽的小区，但目前没有关于流浪者成功翻过栏杆或开启房子的门窗以到达外部的记录。
//
//房子的内部有一沓白纸，但在离开Level C-145后这些白纸上无论如何都无法留下除了破损以外的任何印迹。在白纸的旁边摆放着一台电脑，可以直接链接M.E.G.数据库并可以直接越过权限进行文档创建和编辑1，只要流浪者有自己的M.E.G.数据库账号。由于每次进入该层级时，该层级内部的全部物质均会“重置”到一开始毫无改动的状态2，因此锁定这台电脑是不可能的。
//
//Level C-145一个主要特性在于，身处其内部的流浪者的大脑会不由自主地想象出一个层级的特性和相应层级某处的景象，也有想象出某个物品、实体、房间、事件甚至是相关人士或团体的具体信息的记录。这些信息有的是M.E.G.已知的，有些则是从来没有记录过的、无法确认真伪的信息。在流浪者想象出这些信息后，又会产生一种要将这些信息写在某个信息载体上的强烈想法，包括M.E.G.数据库等电子载体。
//
//在开始写作后，流浪者自身的自控力会大幅度下降。很多流浪者表示，自己在写作时出现了“过了很久才意识到自己已经画了好久画”、“总是写了一会就去开一盘扫雷3玩玩”、“过一会就盯着窗外那棵树上的鸟巢好久”等等情况。即使流浪者的自控力足够强大以控制自己专注于写作，脑内的想象总是会突然消失一段时间，使得流浪者无法继续写作，直到回想起原先的想象才能继续。
//
//在写作完毕后，流浪者会因为自己写作时所用的载体采取一些行为。使用电子载体以外的载体写作的流浪者不会有其他行为；若流浪者使用电脑或自身携带的数据库终端作为写作载体，大部分流浪者会在写作完毕将自己创建和写作的页面投入M.E.G.数据库内置的民间论坛以“看看反响如何”，而有些流浪者则直接将其上传数据库，这给数据库的管理造成了一些麻烦。M.E.G.在此建议来到这个层级的流浪者尽量忍住创建和编辑页面的想法，如果实在无法忍受这种想法，可以将其投入数据库论坛中一个已经专门创建的版块。因为胡乱编辑数据库文档引起混乱的行为将遭到惩罚。
//
//基地、前哨与社区
//该层级通常同时仅能进入一人，因此无法建立基地、前哨站与社区。
//
//入口与出口
//入口
//当一个流浪者抱有“想要自己写一个文档”的想法时，切入一台装有M.E.G.数据库的终端或电脑/一本笔记簿/一张白纸会有一定概率来到这里，想法愈强烈则切入该层级的概率愈高。
//
//出口
//在写作完毕后，流浪者带着自己写作时使用的载体切入该层级的任意固体即可回到原先的层级。若使用电子载体，则流浪者在将文档上传后的五秒钟内便会自动切入原先的层级。
//
//在极其罕见的情况下，该层级房屋外的区域将会下起大雨。在下雨时尝试来到户外可以前往Level C-952。
//
//关闭邮件预览。
//发件人：ihatebackrooms@backmail.com
//收件人：meg.tonysmith@backmail.com
//主题：关于Level C-78
//嘿…您好，我是之前上传的199层文档的作者。
//我想问一下，这个层级里想象出来的东西，只要是之前没被发现过的东西都是假的吗？我是说……199层就是我在这层躺在地板上想到的啊，结果那层之后还真被发现了不是？也没人注意到我早在有人真正发现这层前已经写好了详细信息。不过还是抱歉之前直接上传了meg数据库……那时候我真的忍不住。
//那篇被很多流浪者——包括我的朋友们——当做一篇优秀的层级文档，所以我之后经常到这里来……之后我都发在论坛了，嗯，没有占用数据库空间。可我之后想象到的层级和物品要么被当做不懂事的小孩子往论坛里灌垃圾被删掉，要么就是反响一般——至少不如199层那篇的反响好得多。
//也许您可能不太理解我为什么这样关心文档的反响吧……我在后室里也算是一个比较内向的人，朋友出去玩我也很少陪着的那种，但我真的很在乎我能不能受到大家的赏识，哪怕它对我的生活没有什么特别大的意义——毕竟我也不会因为文档多好收到杏仁水什么的。
//额……我好像跑题了。
//抱歉抱歉抱歉……我想问的就那么多了。祝您生活愉快。
//
//~ Zadkiel
//
//是否将此前写好的草稿作为回复发送？
//隐藏
//本文作者为
//ThisUserDoesntExist
//ThisUserDoesntExist
//
//
//本人此前一直被lc199高昂的评分搞的压力山大……于是写了这篇。
//虽然也没人说我必须得写很多好文，但我真的觉得如果我写了篇神风我就会被万众唾弃。
//说真的，我无论是在ec33上还是在lc144上下的功夫都比c199多得多。
//但是lc199就是有个该死的+66。ec33和lc44的评分连lc199的二分之一都摸不到。
//为什么我再也没写出过那么好的文？我这样问自己。没有回复，因为我自己当然是不知道的。而别人又怎么可能知道我技术下滑的原因？我自己都不知道，怎么跟别人说嘛。
//但在写这篇的过程中……我想明白了，写作重要的并非是评分，也不是文能活。
//读者的观感固然重要，但更重要的是作者本人的感受。虽然这句话好像有点自私，但……我自己都不喜欢的文档，读者怎么会喜欢呢？
//我很喜欢一句话：“守护他人，最重要的还是决意。”
//同样的……“写好文档，最重要的还是自己。”
//
//« Level C-144 | Level C-145 | Level C-146 »
//
//脚注
//1. 所幸的是这台电脑无法跨权限阅读某些加密文档。
//2. 如在墙上写字后，下一次进入该层级时墙上的字会消失不见。因为这个原因，上文提到的纸张也可以无限取用。
//3. 一种前厅中Windows系统内置的电子游戏，通过确定所有地雷的位置并清空所有除地雷以外的地块获胜。上文提到的电脑中也内置了这款小游戏。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1145{}