//Antrum C-156
//躯 中心页 » Antrum C-156
//评分: 
//+27
//+
//–
//X
//血肉引领我们向未来
//
//加入我们，获得光荣的进化
//
// 
//
//生存难度：
// 
// 
// 
//Antrum C-156是后室C层群的第156层。该层级内长期处于潮湿环境中。
//
//描述
//Antrum C-156由一座城市构成。其四周被血肉包裹。据目前已知信息表明，除城市外，该层级没有其他文明存在。
//
//城市面积共两万平方公里。主要由商业区，居民区，实验区域三部分组成。其中，商业区面积约占了城市总面积的二分之一，居民区共七千五百平方公里，其余部分为实验区域。
//
//城市内所有建筑物的大致框架均由骨头构成，少许轻型构造由软组织或者血肉构成。值得一提的是，为防止居民和外来者感到恐慌，“躯”已使用全息投影技术将外部建筑物和外层血肉投影为正常建材样貌与色彩。
//
//商业区围绕城市四周分布，每处供以交易的地点均为高4-6米，宽7-10米的平房，平房数量未知。目前，商业交流仅支持以物易物。
//
//以下是交易记录取样：
//
//交易记录1：
//交易者所出之物：两瓶杏仁水
//所易之物：Flesh C-54
//
//交易记录2：
//交易者所出之物：一罐罐装龙肉
//所易之物：一瓶500毫升杏仁水
//
//交易记录3：
//交易者所出之物：加入“躯”
//所易之物：肺部改造
//
//交易记录4：
//交易者所出之物：加入“躯”
//所易之物：腿部改造
//
//pexels-photo-50859.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1
//一条商业街的摄影
//
//除商业区外，只要非商业区商人带领，外来流浪者均无法凭借个人意愿进入居民区和实验区，居民区及实验区入口均有少量市民把守。如果流浪者想进入居民区和实验区，只需要向任何一个商人说出想法即可，在商人与“躯”成员取得联络并经过其同意后，便会带领流浪者进入居民区及实验区。
//
//居民区为数百座高楼构成，其内部共居住了约5000流浪者。这些居民均为“躯”的成员。若流浪者想要在此常住，需先在商业区告知一名商人。在商人与总基地取得联系，并带领流浪者进行必须活动（使用过一次截肢器，并进行基础身体改造）后便可成为居民之一。
//
//实验区域共有两层，分别为地上层及地下层。地上层有两座高约十五米的大楼，一座工厂及一个医院。大楼主要负责给“躯”的团体会议提供场地。
//
//工厂负责提供轻型设备批量制作（例如Flesh C-54，Flesh C-82）。工厂外有数名流浪者负责接应每隔一段时间前来取物品并予以销售的流浪商人。
//
//医院负责进行人体改造手术。由数百名经验丰富，资历颇深的成员主刀。基础人体改造手术不收取费用。主要是给想要加入“躯”的流浪者以及对人体改造有需求的流浪者进行手术。在流浪者进行完人体改造手术后，其便成为“躯”的成员。
//
//地下层主要为实验区。负责研发新型物品和开发更高级的人体改造手术。共分为A区和B区。
//
//A区主要负责研发偏小的新型物品和开发较为简单的人体改造手术（例如移植，更换等）。该区共拥有数十个小型实验室。且分工各有不同。
//
//B区主要负责研发大型物品和开发难度较高或规模较大的人体改造手术（例如全身改造，心脏改造等）。该区有两个大型实验室，分别负责人体改造和物品研发。此外，负责指导维护整个“躯”运行的基地核心“指挥部”也位于B区。
//
//基地、前哨与社区
//商人协会
//所有在Antrum C-156商业区经商的“躯”成员均为协会会员。
//由Body-01负责。
//和位于市中心的“躯”总基地始终保持联系，负责引进流浪者。
//其一切行动均听从Body-01的指令。
//医学部
//由医院内所有医生组成。
//负责给流浪者进行人体改造手术。
//其一切行动均听从Body-01的指令。
//城防队
//由数百名配备基础武装力量的“躯”成员组成，负责维护城内治安及外来侵略。
//其一切行动均听从Body-01的指令。
//“躯” Body-01
//“躯”的主要基地。位于Antrum C-156城市内部，Antrum C-156内的整座城市均可以视作基地本身。
//医学部及商人协会均为Body-01的下属部门。
//城市内的居民均为基地成员，约5000人。内部存在一个由投票选举的10人管理团，每10年一次更换。
//成员内部拥有明确分工。
//指挥部
//由“躯”中最为聪颖的十名成员组成。
//负责对“躯”的行动作出规划。同时负责大部分“躯”内部的事宜。
//其建筑位于实验区域地下层B区，人体大型工程实验室旁的一座亭类建筑内。
//其一切行动均听从Body-01的指令。
//有识血肉连接巢
//城市附近的大型活体建筑，风格上与层级常见建筑有一定差异。
//由盟友种族有识血肉建立及管理，是该实体文明与“躯”交流科研和生活的主要区域。
//驻扎有大量负责学术交流的学者氏族和进行维护的技工氏族，总人口在500人左右。
//向当地探索者提供医疗和改造服务。
//经常观察到“躯”负责技术工作的成员进入。
//入口与出口
//入口
//从位于Level C-117的Sweet Croissants&Pizzas甜品店正门跪行离开后有几率切入该层级的任意一条商业街。
//在Level C-28处于暴雨状态下时使自己流血。便可在数秒后切入居民区入口处。
//出口
//沿着封闭层级四周的血肉向上爬便可有几率切入任一一个宜居层级。
//进入实验区域地下层A区的人体小型工程实验室内部。使用手术刀在墙上画上“X”，便会在5—10秒后切入一个生存难度三及以下的层级。
//已确认有识血肉连接巢的核心区域存在通向其母层级Level C-309的通道，但是有识血肉拒绝让未经过改造的探索者进入。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1156{}