//Level C-182
//评分: 
//+26
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
//不稳定
// 
//Level C-182是后室C层群的第182层。
//
//描述
//20220416
//据多名流浪者描述所制作的层级图像
//
//Level C-182是一个潮湿黏腻的封闭空间，面积未知。氧气水平良好，无物资。该层级内温度长期维持在36~38℃，遵循前厅24小时昼夜循环，下午13点和傍晚19点会出现两个温度高峰，第二天凌晨2～3点回落至最低点。
//
//在该层级偶尔可见被包裹在透明薄膜中的实体，无一例外皮肤透明发红，身上连接着一根未知长度的管状组织。
//
//离开Level C-182的唯一方法是终止生命。由于该层级的特性，M.E.G.强烈建议您使用管状组织缠绕脖子自缢。切勿陷入无尽的后悔和自责，导致失去行动能力。任何试图帮助其他实体自缢的尝试均以失败告终。
//
//特性
//Level C-182通常被描述为“舒适”，“温暖”。流浪者在该层级会回忆起过去的未尽之事，由此产生强烈的悔意。随着时间推移，流浪者的意识也会逐渐消失，包括遗忘在后室的记忆以及丧失基本的行动能力。
//
//在该层级，任何伤口都会快速愈合，流浪者不会进入饥饿状态。
//
//切入该层级第八天，墙壁会逐渐分泌出无色透明的液体，直到充斥整个空间。其由大量水，少量无机盐、有机物、荷尔蒙和部分人体细胞组成。流浪者的肚脐处会长出形如绳索，表面光滑透明的管状结缔组织，从此时起，流浪者不必呼吸。听觉减弱，仅保留简单的光感和味觉。随身物品（包括衣物）将会缓慢溶解消失，直至光洁如婴儿。
//
//发现
//202█年█月█日，一名意外切出Level C-182的流浪者上交了该层级的液体样本，以及与其同时切出的一枚猎犬生物卵（已死亡）。
//
//基地、前哨与社区
//由于Level C-182的性质，该层级目前没有已知的基地或社区。
//
//入口与出口
//入口
//Level C-182的入口仅在特定的时间段开启，一般为每年的7~9月份，开放之后入口会关闭1~2年。每位流浪者仅有一次切入该层级的机会。
//
//掉入Level C-34中的一个小型储水塔。
//在Level C-167中被无色透明的碱性液体淹没。
//进入位于蜂巢墙壁上的随机隧道。
//遭遇Entity C-58后仍存活。
//出口
//绕颈自尽，你会来到Level 0。
//极小概率你会被血水包围，这会带你到Level C-114。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1182{}