//Level C-164
//评分: 
//+43
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
//基本安全
//基本稳定
//实体绝迹
//Level C-164是后室C层群的第164层。该层级由草原与一片森林组成。且其边界尚未探明。该层级无昼夜交替，长时间处于黑夜。
//
//描述
//Level C-164经常不定时的出现流星雨。流星雨举起颜色分为红色，蓝色，白色三个类型。三种流星雨的出现频率，持续时间和规模各不相同，其所带来的效应也不一。
//
//meteor-shower-7009453_960_720.jpg
//一张广为人知的白色流星雨的照片
//
//白色流星雨：最常出现的流星雨。据现有记录，在Level C-164出现过的流星雨百分之九十都为白色流星雨。每次白色流星雨的持续时间通常在五到十分钟。白色流星雨的规模极大，其持续时间内通常可以覆盖整个天空。其到来前往往伴随着强光。白色流星雨结束后通常伴随着持续约一小时的暴雨，这些雨水都为杏仁水。
//
//蓝色流星雨：出现次数最少的流星雨，大致概率仅为0.03％。其持续时间通常在15到40秒。
//
//蓝色流星雨通常只有10到20颗流星，出现前无任何征兆。
//
//目睹蓝色流星雨全过程的流浪者会出现严重的失忆症状及多种心理疾病。大部分受影响者都失去了自进入后室以来全部的记忆。小部分受影响者失去了自身所有现存记忆。该影响不可逆。
//
//红色流星雨：在三种流星雨中出现次数居中，其持续时间通常在30到60分钟。
//
//被红色流星雨的光线照射到50％及以上的流浪者会立刻死亡。被红色流星雨的光线照射到的流浪者会出现骨折，瘫痪等症状。
//
//红色流星雨无法穿过任何固体介质。躲入遮蔽物便可有效的防范其危害。
//
//草原
//Level C-164的大部分区块均为草原。草原表面无任何地形起伏。
//
//草原上有五处杏仁水湖泊，其占地面积均为2平方千米，深度未知。
//
//草原的已探明区域有八千五百栋占地面积200平方米的房屋。这些房屋内部构造完整，有大量的基础生活用品及物资。值得一提的是，每一栋房屋（包括新发现的房屋）内均发现了人类生存过的痕迹。
//
//森林
//森林位于已探明区块的中央。据现有资料表明，其面积随着已探明区块的增多而增大。但其面积始终保持在总体面积的2％。
//
//森林中央有一根高约三米的石柱。石柱上通体遍布从无记载的文字。目前任何已知方法都无法摧毁石柱。
//
//据诸多事实表明，石柱会在流星雨到来前的第24小时预示下一次的流星雨种类。预言方式为其通体发出与流星雨颜色一致的光。发光时间持续15分钟。
//
//基地、前哨与社区
//M.E.G.前哨"流星通讯部"
//该前哨的建立是为了及时向位于Level C-164的流浪者通报下一次的流星雨种类。用来预防流星雨的危害。
//该前哨建立在位于森林的石柱旁。前哨上方有四个大型信号弹发射器，可以发射出能够照亮Level C-164全境的信号弹。
//由二十名特工和三名研究人员组成。特工负责全天制轮流站岗。一旦发现石柱发出蓝/红光，立刻前往前哨上方发射信号弹。
//社区"草原居委会"
//其总部位于森林内部。领导者是一位名叫Allen Amanda的中年女子。大部分位于Level C-164的流浪者均加入了该社区。
//和M.E.G.为合作关系，负责维护Level C-164的治安和房屋的分配。
//入口与出口
//入口
//详细进入方法未知。据称，大部分流浪者都是在进入一个生存难度为4及以上的层级后突然进入这里。
//出口
//未找到任何出口。
//- 关闭
//Level C-164调查组 Level C-164调查组
//
//新文档于此处。 新文档于此处。此文档对您的生命安全来说极为重要，请务必查看。
//
//— 研究人员埃里克博士
//
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1164{}