//Level C-169
//评分: 
//+20
//+
//–
//X
// 
//
//生存难度：
//等级 3
//
//不安全
//不稳定
//少量实体
//Level C-169是后室C层群的第169层。
//
//描述：
//Level C-169是一个占地约40km²的丘陵山地区域，此层级的时间变化与前厅相近，并且气候呈现出温带海洋性季风气候。据原住民描述，该层级四季分明，但因此层级的空间与时间的流动并不稳定，目前还未被观测到这点。
//
//大部分情况下，流浪者进入这个此层级都会来到一座神社内1，目前神社是整个层级勘探最完全的区域，可以用于作为流浪者的避险地。神社整体结构与前厅的神社没有太大区别，但似乎已经被杂草植物侵占，只能够根据还未被杂草占据的石板路分辨曾经神社的样貌。
//
//顺着参道穿过鸟居向山下走去便可来到森林，该森林被当地原住民称之为丰原千五百秋林。这里的树木高大且林间阴森潮湿，并生有多种菌类，但目前确认只有少有几种可以食用，具体相关内容可在和风民俗文化研究结社内查询。由于该林内可能会遭遇实体团体，所以不建议在此逗留，顺着一条杂草最少的道路可以前往此层级唯一已知的原住民聚落。
//
//関村是一个从神社走出丰原千五百秋林后遇到的村落，这里是原住民的主要居住地点。该村坐落在一条自一片高山流下并被村民称为苇原河的河流下游，并主要以纯木质结构构建房屋，这个村庄的房屋建筑风格类似于和式风格但又更加的古老。值得注意的一点是，関村似乎原本的大小要比现在大很多，现在的村庄似乎只有过去的1/5大小。其他原村庄只剩下了一片由腐朽的木料组成的废墟，在废墟的最中央有一个类似石像的残骸，但已经无法分辨。関村的建筑年龄似乎在任何时间段都有几百年之久。不过，流浪者需要注意的一点是，関村的原住民极度排外，与之接触需要极度的小心谨慎。如果被对方询问诸如“没有得到我们的允许你为何要做出XX行为？”的话语时，流浪者可以回答自己是和风民俗文化研究结社的成员，否则将会被村民群起而围攻之并最终被烧死或者吊死。以及，此层级内的原住民似乎普遍学识不高，大部分均不识字，为此建议流浪者与之交谈时切勿使用过于复杂的语句，以免引起对方的反感。
//
//目前在関村附近还发现了诸如类似竹林与河流尽头的巨大湖泊等区域，但由于时空乱流现象与当地原住民的阻挠以及这些区域都伴随着浓密的浓雾，导致探索这些区域十分困难。但据传言说，在这些类似竹林与湖泊内似乎存在着其他建筑，但目前还未证实，因为去探索相关区域的流浪者目前都处于失踪状态。
//
//在此层级可以找到很多零散的残骸，诸如関村附近的一处通过残垣断壁而推断的寺庙遗址与森林内倒塌的锈铁残骸堆，以及从関村一直向山上延伸的钢缆与倒塌的支撑架。这些与层级本身风格不搭的残骸是何时建造的暂且无从确认，但根据风化程度可以确定比関村的建筑残骸要新一些。由于这些建筑残骸不会发现任何资源，并且容易在发生事件时暴露在空旷的场地，所以不推荐流浪者到访这些地方。
//
//时空乱流现象是此层级经常遇到的一种时空异常效应，每一两天便会发生一次。当现象发生时流浪者将会发觉自己会来到所谓的“彼时”，是一个类似関村的地方，但这里更加的整洁。流浪者似乎无法对这个时期的其他事物进行干扰，通常流浪者将会看到很多被报告为“奇形怪状”的人们正背着行囊离开了这里。随后流浪者将很快会回到“此时”，但回到的时间段通常与发生现象前的时间段不同，这期间通常会出现几天到几十年甚至百年的差距。大部分情况下流浪者回到“此时”都会回到神社内。
//
//附录Ⅰ
//在和风民俗文化研究结社最初被関村町内会通过并安排地点建筑为一个废弃的读书屋后，负责整理杂物的流浪者发现一个房间的桌子上放着一卷被匆忙书写的卷轴，上面写到：
//
//而今放下书与笔，自此沦为失乐园。
//
//附录Ⅱ
//一次流浪者偷偷趁原住民没有察觉的情况下放飞了一架无人机，并赶在时空乱流发生前记录下了一段影像。这段影像显示，此层级不断向远处看去，将会在几十公里外变成一片现代城市。但城市与森林的分割显得如此强硬，就好像森林是直接切开了城市一般。
//
//实体
//由于这一层级内的空间与时间的流动并不稳定，且仍有较大一部分区域未能完全探明，加之当地居民对探索活动的阻挠和干扰，以至于仍存在较大一部分的实体未能完全了解其性质。以下仅列举部分已确悉和应对的实体种类。
//
//Osc2nI.jpg
//鸟居
//
//鸟居「とりい」
//Osc4N8.jpg
//进入鸟居内
//
//鸟居是一种在这一层级内广泛出现的实体，在民俗传说中穿过鸟居即是进入了神域，这被用来在世俗界宙观区别神居住的场所。每一个鸟居尺寸不一，且均设有注连绳、额束和龟腹，这些实体出现时总是在流浪者视野以外悄无声息地出现，也会在脱离流浪者视野后消失；鸟居总是出现在一片茂密的森林或竹林边缘，除此之外它出现与消失没有任何已知的规律。
//
//除了入口处必经之路上的一个大型鸟居不会移动以外，其它鸟居都会随机出现任何宽阔的位置。若一个鸟居出现层级内时，所在区域的天气将会迅速发生变化，通常是变为连绵的糙面云、雷暴雨和浓雾天气，这通常被原住民描述为“一场灾厄的开始”，意味着这一层级内将会发生严重的惨剧或流血事件，故此鸟居也时常被视为不详和厄运的象征。
//
//尽管无法确认鸟居是否存在意志，但它总是出现在人群的视野盲区里。根据当地记载，曾发生过原住民进入鸟居后消失不见的情况。
//
//距今最久远的记录则描述了一种进入鸟居后的光景：进入鸟居后将是连绵不绝的鸟居整齐排序在一起，并且通向一座山的高处；借此得以找到进入高天原「たかまがはら」的真正入口，并且能够得到可以使人长寿和返老还童的变若水。
//
//曾有关于在笠木或贯上发现站立和坐下的白色身影的目击记录。
//
//稻草人/案山子「かかし」
//稻草人是一种身体正在逐渐木质化的实体，均已无法发出声音和移动。这些实体总被发现时总是位于独居的家中或远离人群的藏匿处，并维持着双手抱膝或双手抱胸蜷缩姿势，似乎在尚能移动时就一直保持着这些姿态，它们的表情是一种释怀或解脱般的微笑。
//
//每一例被发现的稻草人均无任何已知的血缘亲属和好友，在生前经常独来独往，仅依靠着町内会发放的资助金维持生存。这些稻草人在生前最后一次被目击时被描述为正在卖力逃离某处或正在被某物追逐的情况。
//
//值得注意的一点是，当地原住民会有意收集稻草人并将其用于农田驱赶鸟类。
//
//无面灵/无颜「カオナシ」
//这些被当地居民称之为「无颜」的无面灵总是在夜间出没，他们会躲在一些已废弃的房屋或久置的阁楼房间内，总是呈现出在衣柜床底处躲避或者攻击位于低处某人的姿态。当有原住民接近时，它们会在逐渐靠近并意图与之接触，这表现为在阴影中向人伸手和突然抓住目标的脚踝，但等目标因惊吓而逃离时，它们并不会追上去，也不会继续对目标造成伤害，而是回到原先的位置。
//
//OscHjs.jpg
//常被用于指认猎犬的画像，出自由鸟山石燕创作的《今昔画図続百鬼》。
//
//猎犬/毛娼妓「けじょうろう」
//在较远处的田野或郊外经常会有猎犬出现，总是在夜晚和临近日出时出没，经常会前往一些开启的窗户或院外的墙角处，并长时间驻留和注视着屋内的情况，有时候也能在一些空房间的被褥和围炉处发现有长头发的痕迹。
//
//在这一层级内出现的猎犬均表现出一些独有的特质，它们在出现在原住民视野内时总是站立的，离开其视野后会恢复四肢着地的姿态进行移动，且会收集废弃的长衫和袍子穿在身上，而且特别喜好在远处注视着男性原住民和流浪者。这些猎犬移动时总是慢慢地行走有时候会跑进田地里偷食蔬果，当被发现并驱赶时，又总是迈着不协调的步伐逃离，似乎它们并不擅于直立行走。
//
//当地原住民相信所有猎犬均系同一个实体，并且根据民俗传说将其称呼为毛娼妓「けじょうろう」，传言中它因怨念而生，总在夜里会诱惑并杀死男性，故此也时常与当地的失踪事件联系在一起。尽管存在多次目击记录，但到目前为止仍未有任何一起被证实由猎犬所为的伤害和失踪事件。
//
//大部分情况下，猎犬不会主动与流浪者进行接触，通常会在原处驻足一段时间后自行离开，保持眼神接触反而会使其继续逗留。
//
//OscLBq.jpg
//逢魔时的民居室内
//
//逢魔时「おうまがとき」
//逢魔时通常指当地时间在黄昏（17点-19点）或黎明（3点-5点）时出现的现象，通常呈现出遍布整个天空的霄色和乌云，颜色的饱和度逐渐增强，并伴随着强风和轻微地震。据说在此时，会有未知的存在敲响每一个居民的门扉。不得在此时为敲门声开门。
//
//当逢魔时出现时，这一层级内的所有实体均会变得急躁且充满敌意，并且开始在人流密集处汇集，然后漫无目的地游荡。大部分原住民会一直躲在家里，裹着厚厚的棉被；仅有一小部分未及时回家的原住民会像其他实体一样在街上游荡，他们总是倾向于聚集在参道上，围绕在玉垣和鸟居旁边。值得注意的是，此时原住民的瞳孔会变成霄色。
//
//逢魔时总是呈现出类人的表情，通常是大片乌云内的凹陷或天空背景下的少数乌云构成，因上方两处呈拱形和下方为倒拱形而被描述为在看着地上的人微笑，故此当地原住民都将逢魔时视为一个具有思想和因怨恨而生的妖怪。
//
//基地、前哨与社区
//探险者总署-和风民俗文化研究结社
//和风民俗文化研究结社是一座非探险者总署官方设立的前哨站，其由不同时期进入这一层级的探险者总署成员建立，主要作为探险者总署成员在这一层级内的集中性地，对外掩盖为专门研究本土民俗文化传说故事与起源的民间爱好者组织，在関村町内会注册的会社名称为「和风民俗文化研究结社」。
//
//和风民俗文化研究结社是目前唯一被批准在関村内活动的流浪者组织。
//
//関村町内会
//関村町内会是负责管理整个関村大小事务的自治组织，由関村村民自发组成。在関村内的任何事务、纠纷和交易均需得到関村町内会的内部投票决议才可以进行，任何越过関村町内会私下开展事务和违反规则的行为都会被由関村町内会进行裁决和审判。每周日会在関村村口举行对上周村内事务的总结和汇报，也会在这一天对违规者进行私刑处罚，他们会一边高声咏唱着“淡路島かよふ千鸟の鳴く声に，幾夜ねざめぬ须磨の関守”一边行刑，通常是活活烧死或吊死。
//
//流浪者在関村内进行任何活动都需要向関村町内会进行申请，包括但不限于在此过夜、进食、饮水、持灯、直立行走、与原住民对话和交易等。需注意関村町内会成员均极度排外，任何接触都需要足够审慎。
//
//丰原千五百秋林
//丰原千五百秋林是原住民对関村周围所有森林的总称，有时候也特指在森林深处出没的无面灵团体。它们会在森林深处活动，通常是戴着龙面和能面，一边哼唱着《兰陵王入阵曲》一边使用粗制木矛狩猎野生动物。有时候它们也被发现在与一些体型特别巨大且通体白色的动物对峙。
//
//由于丰原千五百秋林皆擅长棒術「ぼうじゅつ」，故此不建议与之接触。
//
//原住民
//原住民是一群长期生活在这一层级内的人类，他们祖上至今未有人离开过层级，世世代代在此生活，也对其他层级和整个后室的存在并不知情。大部分原住民聚集在苇原河的下游生活，并将聚落命名为「関村」，同时「関」也是大多数原住民的姓氏；他们在这里从事耕种河畜牧，偶尔会制作竹制品在内部以物易物。
//
//在関村外存在若干少数人聚集的浪人会在竹林边缘和沙滩上游荡，有时也会主动攻击路过的其他实体，并自称为「任侠」。目前发现的大多数原住民仍会主动避免与流浪者进行接触，并且会对任何外来者表现出敌意。
//
//入口与出口
//入口
//进入在室外空地上随机出现的鸟居，会被传送到这一层级的大型鸟居内。
//使用币束对自己完成驱魔仪式，期间会陷入昏迷且身体会逐渐消失，在苏醒后躺在神社参道上。
//在类似神社的建筑外木架挂上写有“我希望回家”字样的绘马，会被立即传送到手水舍前。
//佩戴龙面完成《兰陵王入阵曲》舞蹈，即可到达神乐殿。
//揭开其他层级贴在某个个建筑物或房间外的厌胜符，并被封印在其中的某物杀死后，即可到达币殿；进入这一层级后，身上会出现一张御朱印。
//完成全身舍利仪式并成为即身佛，即可以当前姿态传送至拜殿供奉位上。
//出口
//在这一层级内按照进入时所使用的方式即可返回原处，找到能面佩戴在脸上会被传送到抑或是穿过鸟居时有极小概率会被传送至Level 0处。
//作者信息
//« Level C-168 | Level C-169 | Level C-170 »
//
//脚注
//1. 根据方式不同，所来到的神社位置也不同。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1169{}