//Level C-144
//评分: 
//+80
//+
//–
//X
//
//警告
//本文的内容涉及关于尸体残骸的一些轻度描写。若您在阅读时感到不适，请立即关闭页面。
//
// 
//
//生存难度：
//等级 死区-放射
//
//放射性物质/尘埃
//极度危险环境
//变异实体危害
//Level C-144是后室C层群的第144层。
//描述
//
//Level C-144的最初环境为一个面积约为400平方公里的社区，其包含公共设施、友善实体、餐厅等，并被M.E.G.认定为宜居层级。但在2020年2月21日，层级中央突然凭空发生了一起核爆炸，该层级原有建筑因此遭到重大破坏，整个层级陷入核冬天效应1。有关Level C-144在核爆炸前的情况请查看文件levelc144archived.pdf。
//目前，Level C-144已不再适宜人类居住，并被M.E.G.重新评估为死区层级。在诺克利普贴被证实已经失效的情况下，外界已失去对Level C-144内部的所有联系，唯一的信息来源仅有从Level C-144中成功逃脱的寥寥无几的流浪者。这些流浪者报告称，原先Level C-144内存在的所有物资生成地点均已失去作用，城市中大部分水源也已被污染而无法饮用。
//
//层级当中弥漫着浓厚的雾气，使得能见度大幅度下降。这种雾的成分无法鉴定，但其对人类没有直接性的伤害。
//
//实体
//
//Level C-144内部在核爆炸后出现了许多变异的敌对实体，原有的许多友善实体也产生了变异并对人类抱有极大仇恨。诸如巨型尸鼠、两头巨人无面灵攻击人类的传闻接连不断。
//变异实体的感官十分敏感，能够轻易地发现人类；更致命的是，变异实体通常三两成群地集体行动，且速度极为敏捷。这些因素使得被变异实体追杀的流浪者几乎不可能幸存。变异实体似乎具有一定的作画能力，会使用实体或人类遗骸的血液和器官在墙壁上作画，其内容大部分无法识别，但在部分样品中能够看到人类语言。
//
//下面列出已经发现且能够识别或能够阅读的涂鸦：
//
//1.你好？（Hello？）
//（备注：被发现于城市外围的一处街道。在涂鸦正下方有一具被剖腹的尸体。）
//2.救命（help）
//（备注：在该处涂鸦附近发现了数具血肉模糊的无头儿童尸体。）
//3.人类人类人类人类人类人类人类人类人类人类人类人类人类人类人类人类人类人类人类人类人类人类人类人类人类人类人类人类人类人类（不断重复“人类”一词）
//（备注：该涂鸦从城中心向东延绵了将近7公里，目前已成为逃出Level C-144的流浪者聊天时常提到的一个段子。无法统计该涂鸦具体涉及了多少具尸体的血液。）
//4.再见！（Goodbye!）
//（备注：被发现于城市外围。该涂鸦较为模糊，似乎前后由多个不同的人的血液反复涂画。在涂鸦附近发现了几具从头劈为两段的人类残骸。）
//5.为仕么要过么对我门
//（备注：被发现于城中心核爆炸发生处。在涂鸦附近发现了因重物打击而死的数具尸体，血肉模糊。）
//6.我爱你（iloveyou）
//（备注：在该涂鸦附近发现了一男一女两具无头尸体。女方尸体已被剖腹。）
//7。(一副图案，上面画着的是核爆炸产生的蘑菇云。）
//（备注：发现于城中心的一处墙壁上。值得一提的是，该涂鸦使用核尘埃而非血液作画。）
//8.我早你码
//（备注：无法考证这句话的位置和真实性。）
//
//部分理论认为某些变异实体可以理解人类语言。目前尚不知道为什么变异实体会写下和画下这些内容，但许多人认为，在变异实体眼中，核爆炸事件由人类所导致。
//
//
//奇怪的是，经过M.E.G.“测验者”部门对几项珍贵样本的研究发现，变异实体的DNA序列等基因学特征与其同类正常实体没有任何区别，这意味着实体的变异或许并非由核辐射导致。与之相对的，该层级内的残留核辐射也对人类没有明显影响。有关残留的核辐射为何不会影响生物的原因的调查正在筹备。
//据悉，一个被称为“指挥家”的实体及其带领的“后室交响乐团”已经进入Level C-144。该实体组织具有强大而危害性的精神控制能力，请任何处在该层级的流浪者对未知来源的音乐声保持警戒。
//
//心理扭曲
//
//在Level C-144内，“悲尸循环”效应会被替换为另一种效应，这种效应被极少数见证过这一效应的全部过程的流浪者称为“心理扭曲”效应，简称“扭曲”效应。当流浪者遭受到巨大的心理打击或自身信仰遭到彻底毁灭时便会进入“扭曲”效应的过程。“扭曲”过程大致分为2个阶段。
//关于第一阶段，唯一已知的信息是正处于“扭曲”效应中的流浪者会“听到一个空灵而优美的声音”，随后这名流浪者会进入极度自卑的心理状态。如果有其他流浪者在此时对其进行劝说并成功，则“扭曲”效应会解除并使该流浪者的心理状态变得极为坚定。杏仁水虽然无法彻底解除”扭曲“状态，但可以减小陷入”扭曲“状态的流浪者的心理负担，使对其进行的劝说工作难度减少。
//
//倘若第一阶段中没有流浪者劝说或劝说失败，则陷入“扭曲”效应的流浪者会进入第二阶段。此时，该流浪者的样貌会开始大幅度地变化，在变化完成后这名流浪者将彻底“扭曲”，这个过程无法打断，也无法挽回。这种情况下的流浪者也被称为“扭曲”，被归类为一种实体。不同的人以及不同的情况下诞生的“扭曲”的生物学特征与行为均不同，但通常会与成为“扭曲”的流浪者进入“扭曲”效应第一阶段时的原因有关。2
//
//建议在Level C-144遭遇“扭曲”时远离，并在探索时携带杏仁水以备不时之需。而更重要的则是时刻保持自己的信念与目标。
//
//在逃离Level C-144前一直居住于其中的流浪者表示，在核爆炸发生之前，“扭曲”效应和由其产生的“扭曲”从未发生或出现过。因此有人认为“扭曲”效应可能才是核爆炸产生的主要副作用之一，而非此前提到的核辐射。
//
//地形
//
//成功逃生的流浪者中有一支由前M.E.G.“罗经点”团队队员与前M.E.G.“踪迹制图者”团队队员领导的小队，奇迹般地在逃出Level C-144的同时大致测绘了该层级现在的大致地形和其撤离路线上大部分流浪者避难所。得益于此，M.E.G.在询问了其他逃出Level C-144的流浪者的经历后成功绘制了Level C-144的地图。
//Level C-144分为三大区域，危险程度由内到外依次递减：
//
//城中心
//该区域是核爆炸的中心地带，大量变异实体驻扎于此，且没有任何生活用资源。该区域的流浪者大多已经死于核爆炸或变异实体，但仍有少数流浪者游荡于此。这些流浪者可能对变异实体和扭曲有合适的应对策略，并掌握有极其重要的情报。
//
//岌岌可危的破败建筑物也是导致该区域极为危险的要素之一。变异实体似乎将尚未坍塌的较高建筑残骸作为某种陷阱，据传言称，变异实体会在流浪者路过时将建筑物推倒以杀死流浪者。
//
//社区外围
//该区域中的变异实体数相对较少，同时受核爆炸的伤害也较少。该区域也是绝大部分幸存者滞留的地方，但创伤后应激综合症（PTSD）、“心理扭曲”效应的生效条件与较大的人口基数也导致该区域的扭曲数量众多。
//
//扭曲是该区域的主要威胁。在大部分案例中，扭曲都会以各种手段无差别攻击附近的一切生命体，并因此造成更多扭曲产生。在扭曲后不会对流浪者造成任何威胁的案例屈指可数。
//
//社区郊区
//该区域中几乎没有变异实体和流浪者，受核爆炸影响程度也最轻。位于该区域的变异实体一般聚集在Level C-144位于这个区域的出口旁侧，而流浪者则全部留在该层级的入口处等待救援，并组成了一个名为“引路人”的小型组织。
//
//基地、前哨站与社区
//
//目前，Level C-144中的大部分流浪者都零散地困在社区中的避难所里，目前已知仍有人留守的避难所就有57处。此处仅列举其中的数个规模较大的组织。
//M.E.G.驻Level C-144基地
//该基地最初的设立目的是获取该层级中原本充足的食物资源，并将其运输至食物种类相对较少的位于其他层级的基地。在核爆炸后，该基地全体人员迁入基地内的避难所设施。
//该基地仍有相对较为充足的食物和杏仁水资源，并拥有足够的抵抗实体的能力，但原本建立的交通设施已被变异实体破坏。
//其收容广大流浪者进入，但有严格的纪律规定以防止发生事故；其内部实行配给制，以减少资源消耗。
//其拥有Level C-144中目前唯一能够使用的Wi-Fi信号点，但缺乏相应设备。
//B.N.T.G. 144号前哨站
//略微缺乏食物资源，但拥有大量杏仁水资源。
//其仍开放贸易。因其对于食物的需求，其在交换食物时通常会将出价打折扣。
//其与M.E.G.驻Level C-144基地关系较融洽，但因为该层级的危险性及缺乏设备，两边交流极少。
//其不收容外来流浪者，但会向缺水的外人提供少量杏仁水。
//U.E.C.避难所
//对其掌握信息极少，包括避难所名称在内的信息完全缺失。
//其与所有已知避难所关系不融洽，有传言称其甚至会攻击其他避难所以掠夺资源。
//其与M.E.G.驻Level C-144基地为公开敌对关系。
//关于其唯一已知的装备情况是没有赫尔墨斯装置。
//引路人
//该组织驻扎在Level C-144的入口处。
//缺乏其相关信息，但据传言这个小社区找到了一条未被污染的河流，并将其用于小范围耕种以解决生计。
//根据少量曾经与该组织进行过交流的流浪者的证词，该组织驻扎在入口是为了给后续到达Level C-144的救援部队带路。
//入口与出口
//入口
//由Level 6.1的一幅巨大的风景画可以切入该层级，随后会来到该层级位于郊区东面的一个固定的点，可以通过一条公路进入城区。3
//
//出口
//Level C-144目前唯一可用的出口在郊区的西面。在郊区西面的山峦屏障前有一处山洞，经由这处山洞便可以到达Level C-192，且可由此返回——尽管目前来说并没有人会这么做。山洞口有数十只变异实体留守着4，但与城区全天清醒的变异实体不同，这些变异实体会在夜间进入休眠。因此，想要进入山洞只有夜间潜行和歼灭全部敌对实体两种办法，但由于变异实体令人恐惧的攻击性，不推荐采用后者。
//
//
//和爱社区在核爆炸事件前进行的最后一次人口普查数据显示，共有10580名流浪者生活在Level C-144中。根据M.E.G.相关部门推测，目前仍有4000余名流浪者幸存并困守在Level C-144当中。
//M.E.G.正在准备与B.N.T.G.等友好组织共同对Level C-144中的受困流浪者实施救援行动。他们的父母、爱人和孩子正在苦苦地等待他们的归来。
//如果看到这行文字的你有意向加入援救这些流浪者的行动，请前往位于Level 1的Alpha基地报到。
//为人类的未来而战。
//
//
//近日，Level C-144因一起核爆炸导致环境条件急剧下降，经M.E.G.重新评估，Level C-144的生存难度现已改为死区。Level C-144在此前曾是一个拥有万数人口的宜居层级，经过估计，目前尚有6000名以上的流浪者仍在Level C-144中滞留。
//
//“他妈的！”罗森堡看了看手里的文件往地上吐了口唾沫，“里面还有千把人还在等待救援，B.F.P.F.却在这个时候大肆造谣核爆是我们的实验事故导致的！”
//
//“冷静点，哥们。”麦拉停下了手里正在写的新闻稿，“那群人怎么说跟我们可没关系。听说Andrew这几天觉都没睡，一直在忙动员的事情。”
//
//“没关系？那群精神后室人会害得我们没一个普通民众可以招来帮忙！真是一群神经病……还说自己才是保护人民的那个，见鬼去吧，一个人都不肯派来……”罗森堡在房间里来回踱步，气呼呼地将那张带有B.F.P.F.的徽标的纸摔在地上。
//
//“至少B.N.T.G.那边是谈妥了。C-144里面有他们的人，所以跟我们一起进去找人符合他们的利益。”麦拉又开始写起稿子来。“以及，老兄，别在朝着我大吼了，写文也很费劲的。”
//
//关于Level C-144内滞留的这些流浪者，M.E.G.已决定发起救援行动。“我们不能对这几千个活生生的人坐视不管。”监督者Andrew对此发言道。若看到这里的您愿意参加这起行动，请在仔细阅读过Level C-144的层级档案后前往Level 1的Alpha基地报名并了解更多情况。
//
//“罗经点”兵团的3个小队首先进入了这片地狱。
//
//“我嘞个皇家口粮……这他妈是啥？”一个队员看着山坡下的断壁残垣惊呼道。想从这些废墟中看出“和爱社区”的原貌完全不可能，破损的墙壁挂满了骇人的血迹和人类器官的碎片。
//
//从郊区依稀能看到一条长长的血迹从城中心蔓延到城市外围。“那就是‘人类’。”队长显然指的是这条血迹。“这一长条全都是用血写的‘人类’两个字，是那些玩意搞出来的恐怖创作。”他指了指“人类”血字旁边的骇人怪物。
//
//“不管怎么说……我们都得救里面的人，并画出这鬼地方的地图。每耽搁一秒就可能会有一个人被撕碎。另外，诸位……”他有些颤抖地继续往下说，显然他也很明白进入这片死区可能的后果。“这可能是我最后一次带你们探索了。祝我们好运吧，为人类的未来而战！”他以这句话结了尾。
//
//“为人类的未来而战！”全队一起喊出了这句口号，随后沿着公路向着城区急速行进过去。
//
//M.E.G.针对Level C-144内被困流浪者的救援行动目前仍在进行。此外，本报代表M.E.G.再次强调，M.E.G.对Level C-144环境的转变不负任何责任，Level C-144的转变属于层级自身的效应，与M.E.G.毫无关系。若造谣者仍继续发表不实言论，M.E.G.将展开调查并对相关人士与组织实施制裁。
//
//针对U.E.C.人员在Level C-144杀害救援人员与抢夺物资等种种令人发指的反人类行为，本报在此表示强烈谴责。
//
//麦拉写到这，愤怒地将自己的笔拍在桌上。“U.E.C.你全家不得好死！好心救你命你还想倒打一耙！全喝object-44腰果水去吧！”
//
//“你也忍不住了，嗯？”罗森堡疲惫地从门外走进来，瘫到旁边的沙发上。“我不想火上浇油，不过你隔壁那位也去参加救援行动了。”
//
//“阿鹏那笨蛋去那鬼地方了？”麦拉几乎是跳起来的。“……也能理解，他就喜欢帮——”
//
//“他给U.E.C.那帮脑残毙了。”罗森堡痛心地锤了一下墙。“记得吗？那些混蛋就打我们的人。有几个他们的傻逼躲在一个停车场废墟的楼上，看到人就打。那哥们把队友推到掩体后面，脊椎给狙击手打穿了。”
//
//麦拉愣了几秒。他的脸在抽动。“我写完这篇稿子就辞职，然后报名。”
//
//“干啥？你想进兵团去给他报仇？”罗森堡望着天花板。“我也想……阿鹏啊，多好的一个小伙子。可惜那群傻逼已经躲在自己的乌龟壳里不肯出来了，到时候我逮着他们必须得给他们脑子挖出来，做他们的那个什么狗屁装置。这群傻逼死了也别想安生。”
//
//“我支持。这可太他妈解气了。”麦拉又拿起笔开始写，笔尖近乎要把纸给戳穿。
//
//今天已是Level C-144搜救行动的第5日。经不完全统计，目前已被救出人数1437名，死亡人数7732名，失踪人数1758名。M.E.G.及参与行动的其他组织已投入搜救行动总人数4750名，其中已死亡960名。4478名流浪者民众参与搜救行动，其中已死亡1345名。
//
//致敬。
//
//在亲手揍死了最后一个U.E.C.混蛋后，麦拉将尸体丢进了他们那黑暗的避难所。他走出来，望着不断掉落核尘埃的天空。
//
//“这鬼地方，还有这些鬼东西，杀掉了我们多少人？”他恨恨地想着，“这里曾是万千个人的家园，结果这万千个人转眼就变成了报纸上冷冰冰的死亡数字。后室啊后室，你到底他妈的想怎样啊？”
//
//一声怪物的嘶吼将他从脑海里拉了回来。他躲到旁边的避难所里，猛地关紧铁闸门。变异实体愤怒的撞击让铁闸门凹陷了一点，所幸没有撞开。等了好久都没动静后，麦拉放松了一口气，打开铁闸门去拿外面的食物——
//
//铁闸门打不开。开关被变异实体撞坏了。
//
//“麦拉啊……唉。”罗森堡习惯性地来到了麦拉以前的工作地点，看到的只有空荡荡的桌子。“饿死绝对很不好受吧，抱歉，老弟。”
//
//他走到外面的报摊上买了份报纸，然后用双手把它放到麦拉以前的桌子上。“可惜了，不是你写的……”
//
//在长达14天的搜救后，M.E.G.宣布救援行动结束。共有1520名流浪者被救出Level C-144。对于一个生存难度为死区的层级来说，能够救出这么多人实属不易。M.E.G.将为在救援行动中做出贡献的流浪者表彰，同时在行动中牺牲的流浪者的家属将收到抚恤金。
//
//向赴死以换他人生者致敬。
//
//
//
//Meglogo
//M.E.G. - 为了人类更好的未来
// 
//由于救援行动已经完成，Level C-144的所有出口均已被封闭，任何针对Level C-144的探索行动皆予以否决。根据传言，在救援行动后期，一未知实体被多次目击到正在埋葬该层级中的人类尸体。该实体的档案已经建立完毕，点此查看。
//
//作者信息
//« Level C-143 | Level C-144 | Level C-145 »
//
//脚注
//1. 即因核爆炸产生的放射性尘埃遮蔽阳光导致地面生命无法获得光照并由此带来的一系列效应的总称。另外，Level C-144的核冬天效应似乎并不会停止。
//2. 在大部分案例当中，扭曲的原因是家破人亡的伤心欲绝、对于变异实体的恐惧，以及不认为自己及其他人能够得到救援。
//3. 风景画的内容原为一个风景优美的社区，在核爆炸事件后变成了一副描绘蘑菇云下的断壁残垣的战争画作。是什么导致了画内容的变化尚且未知。
//4. 这些变异实体似乎并不会尝试进入Level C-192。尽管如此，但在M.E.G.的建议下，Level C-192方面已对该出口实施封锁，仅允许正常人类出入。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1144{}