//Level C-149
//评分: 
//+15
//+
//–
//X
// 
//
//生存难度：
//不存在
//不适用
//请勿前往
//Level C-149是后室C层群的第149层。
//
//描述
//本层级已被龙血族毁灭，其中只有一座黑色的长方体，其比例为完美的1:3:5。方碑上记载了由龙语写成的，关于龙血族毁灭此地的历史。
//
//基地、前哨与社区
//本层级无基地、前哨或社区
//入口与出口
//入口
//进入当前的Level C-77有极小的概率来到本层级。
//出口
//暂未发现除从方碑内切出以外的任何出口。
//该资料属于一级机密文件，请输入您的管理者账号以访问
//ID	
//<你的账号>
//密码	
//•••••••••
//登出
// 
//
//生存难度：
//隐藏档案
//受保护的层级
//存在机密实体
//Level C-149是后室C层群的第149层。
//
//描述
//此处为M.E.G.实体监狱，拥有许多由特殊合成材料组成的隔间，关押了大部分极其危险的实体，用于对救治流浪者进行的医学研究。
//
//military-1442303_960_720.jpg
//Level C-149内一处空牢房的角落。
//
//在本层级中，存在由意识被克西上传自计算机网络，用于对“后室白鼠”人格研究的龙血族成员“缪”（μ）。
//
//目前，缪已被M.E.G.组织完全控制，其在战斗中严重受伤的身体已不可修复，因此其思维移植至“后室白鼠”终端。为将其控制，其记忆已不可逆转的被清除，但其人格仍然可以用于实验。缪在“后室白鼠”中的代号为人格“M”。
//
//基地、前哨与社区
//M.E.G. “MJU”基地
//生活了约100名特种军人、20名科学家以及监督者Andrew（监督者-C）。
//
//入口与出口
//Level C-77不可来到本层级。
//由监督者-A审批通过的人员，通过其发放的限时通行证，从M.E.G.Level 1基地中的一个地下室进入。
//由“狂野战士”军团清理实体，在M.E.G.Level 11基地的监狱入口进入。该入口只能由持有“狂野战士”军团第一特派军令的军长，在通过监督者-C的审核后进入。
//以上入口与出口均可双向通行。
//以下是克西与德尔塔的第二次交流记录。
//机密交流记录
//
//交流对象：“克西”、“德尔塔”（龙血族成员）
//
//交流地点：Level C-149办公室，双方沟通方式为面谈。
//
//监督人员：Andrew（监督者-C）
//
//[记录开始]
//
//
//德尔塔：（看见克西进入了房间）克西，你好。
//克西：（面无表情）你好。
//
//德尔塔：很高兴你终于能同意与我再见一面。
//
//克西：你应该是料到我需要什么东西，所以才来联系我吧。（坐在椅子上，脸色沉重）
//
//德尔塔：你想要的是关于“缪”的资料吧。
//
//克西：（抬起头来）没错，这方面你确实比我更敏感。
//
//德尔塔：后室白鼠之类的，我之前已经了解过了，不过我约你来此处，还有一事。
//
//克西：是什么？
//
//德尔塔： “奥密克戎”拜托“约塔”来找我们了。
//
//克西：是“约塔”？他来找你做什么？“奥密克戎”又要说什么？
//
//德尔塔： “奥密克戎”是通灵者，他来找我只有一种可能，那就是告诉所有人，新的“大洪水”即将降临C层级。
//
//克西：（脸色沉重）“大洪水”……难道那种事情真的又要发生了吗？
//
//德尔塔：既然他这么说了，我当然会无条件的相信他。
//
//克西：难道，你的意思是……？
//
//德尔塔：龙血族最先进的计算机就在你们那里，只有那个机器才能验证“大洪水”的真伪。而验证的人格，就是……
//
//克西：（点头）我懂你的意思。
//
//德尔塔：这也是为什么我认为你可能需要我的原因。
//
//克西：不过，关于“缪”的事情，我要问的太多了，在这里一时半会儿讲不完。
//
//德尔塔：那我们线上讲。
//
//克西：好，我先回去把问题整理一下，然后发给你。
//
//德尔塔：祝你好运，克西。
//
//克西：祝我们大家好运。
//
//[记录结束]
//
//事后，监督者Andrew对克西进行了询问。
//Andrew：冒昧的问一下，你们口中所说的“大洪水”，到底是什么？
//
//克西：哦，你们不懂吗？可能德尔塔没有告诉你们。
//
//Andrew：她虽然对我们忠诚，但有些资料，她仍然守口如瓶。
//
//克西：这样吗……我来给你打个比方吧，大洪水其实类似于《圣经》里灭世的灾难。事实上，据我离开前龙血族所掌握的资料显示，在后室诞生之初，所有的层级都是宜居的。但是不知为何，从某一天开始，“大洪水”降临了，它并不是物理意义上的洪水，而是一种恶化的体现。每次“大洪水”的到来，都会将一些层级的环境变得更加恶劣，直到该层级完全消失。你们没有注意到近几年来，被标注生存等级为“不适用”的层级增加了吗？那就是上一次，乃至更上一次“大洪水”所带来的产物。虽然两次之间的时间间隔一般会很久，但是这一次，我想可能离我们不远了……
//
//Andrew：可是，“大洪水”的原因是什么？我们又应该怎么办呢？
//
//克西：不知道，但我知道的是，后室的熵正在增加，一切都正在从有序慢慢变为无序。我们现在能做的，就是尽可能的躲避这些灾难。
//
//Andrew：感谢你的信息，我会尽快组织一场监督者会议，与你们更详细讨论“后室白鼠”和“大洪水”相关事宜。
//
//克西：好，先告辞。
//
// 
//
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1149{}