//Level C-175
//评分: 
//+124
//+
//–
//X
//归档档案
//随着对Level C-175调查的日渐深入，该层级的许多新特性被逐渐发觉，旧时的档案已无法准确对该层级的特性进行描写。现已将具有参考意义的旧文档归档陈列，以此纪念流浪者们对该层级探索所付出的努力与牺牲。
//
//【关闭记录】
// 
//
//生存难度：
//等级 0
//
//探索中
// 
// 
//Level C-175是后室C层群的第175层。
//
//描述
//Level C-175被记录的历史起始于西元前，自失落一族吟游诗人的三弦琴中传颂歌咏1，这是一座满富危机与机遇的生命天堂——一颗适宜前厅生物居住的星球，壮丽的景观遍布人迹未踏的大地，异状的实体于生态间昂首阔步，彳亍漫行2。记录的终结亦停留在公元前，自天而降的光绽裂了星球的大地，将宜居的天堂化作破碎的诗文与过喉的烈酒3。自此，无人再能够进入Level C-175的领域，唯有壮美大地与那大地之上的英雄儿女，时至今日仍为人津津乐道。 ;这段似乎有些矫揉造作了，没办法，望着眼前这片足以使任何溢美之词褪去颜色的瑰丽景观，难以抑制的激动止息不住的向外喷涌！不过说是这么说，附庸风雅什么的还是在后续的撰写中注意些吧。
//
//1280px-Chinese_lock.jpg
//自远古时期流传的层级秘钥。
//
//注：除少数传说外，可证实此传说真实性的只有一把被认为是Level C-175层级秘钥的古钥匙（见右图），且该钥匙并未在Level C-175再度出现时重新生效，应并非该层级的秘钥。
//更正：该层级秘钥于Level C-175重新出现22日22小时22分后，即2022年3月17日20时44分再度生效。已完全确认该物品层级秘钥特性的恢复，且证实其与流浪者迎曦所持的层级秘钥表现出相同的震动频率。旧Level C-175的存在被证实。
//
//nature-6899991_1920.jpg
//白山黑水、碧日苍穹。
//
//现Level C-175是一片未知大小的自然环境，笼罩于些微失真的蓝色光照之下。已探索的层级区域皆存在高强度的Wi-Fi。该层级的环境风貌与前厅相近，目力所及之处，平原、高原、群山、河流、湖泊、海洋，诸多自然环境皆似前厅，却又多了几分万物竞发的勃勃生机。层级环境应数温带/亚热带季风性气候，在阔叶林中跋涉时，可明显感受到海洋气团对陆地的强对流效果影响——在蓝绿色的蒸笼之中感受倾盆落雨将一切浸透的灾难性景象，感觉自己简直就跟被妖怪架起来蒸的玄奘大师一般。
//
//层级之中暂未见到活物，树木、灌木与真菌则于松软肥沃的湿成土间郁郁葱葱，长势喜人4。Level C-175层级中的植物与前厅近似，与江汉平原、鄱阳湖平原或洞庭湖平原的植被类型几近一致，暂时无法确定该层级中的植物与前厅的关系，但可确定有数种近似于野莓的灌木，其上结出的红色小实无毒且可以食用，清香怡人、甜而不腻、食之神清气爽，相较前厅经过人工选育的草莓也不遑多让。
//
//Level C-175中的湖泊皆由淡水组成，湖水碧波泛滥、清澈见底，饮之爽口，且带有些许山泉的清甜，猜测应为水中融入的矿物质所致。因层级光照过于强烈，吾人无法长时间直视水面，但我似是在一瞥之间见到一尾金鳞破水而出，自炫目的日光之下展露身姿。我曾试着守株待兔，在湖泊旁静候其再度出现，却再也无幸得见它的身姿。
//
//自流浪者踏入Level C-175的第一刻，碧蓝似璞玉、广阔如北溟的静海便足以勾起每一位后室流浪者于Level 7漫游之时的糟糕回忆。暂可确认的是Level C-175的海洋似是没有尽头，且该层级的海水尝之咸苦，没有杏仁水的味道，构成应与前厅海水相近。暂未确认海中是否存在实体，期待后续对此的调查与补充。
//
//Level C-175中的昼夜循环相较前厅更长，一昼夜约为36小时（精准的测定时间与置闰还是让专家来做吧），由24小时的白昼与12小时的黑夜组成。异于常态的，该层级中的太阳并不会移动，自黑夜将临时，太阳将逐渐失去光芒并淡出天空，而一轮满月则自东方升起，直至黎明时分至西方落下。
//
//目前，对Level C-175的探索仍未结束，而该层级已经表现出与古籍记载相合的宜居性。若能够在后室这一吃起人来从不挑食的险恶世界中寻得一方足以承载生命发展的宜居乐土，后室人类的生活方式将会被永远改变。而吾人相信这一层级绝对拥有如此的潜质，我愿为这个想法奉献一切，即使是我的生命。
//
//基地、前哨与社区
//暂无任何相关发现。
//
//入口与出口
//入口
//spaceship-2057420_1280.jpg
//Level C-175的层级秘钥，火箭飞行器具备点火功能。
//
//Level 11中有概率出现一把未来风造型的层级秘钥，用该秘钥打开Level 11的一扇房门，房门将通向Level C-175。 ;我通过这个方式来到了Level C-175，不确定这把秘钥是由Level 11生成的，还是有人故意将它放在了这里。
//出口
//未知。 ;我还在继续探索这个美妙的地方，若是真的没有出口，在这个层级永远的生活下去感觉也不是糟糕的选择。
//在第四次修正Level C-175的文档后，迎曦与所有人失去了联系。于她失联的140小时后，被证实为属于她的手机在Level C-175被发现，该手机已遭到不明穿透性攻击的永久破坏，且其上的血迹被证实与迎曦的DNA相合。流浪者迎曦具体情况仍未知，但应是凶多吉少。
//
//【关闭记录】
// 
//
//生存难度：
// 
//现实杂变
// 
//Level C-175是后室C层群的第175层地狱。
//
//walk-445272_1920.jpg
//洛蕾塔·马丁所上传的实体图像，可见人形实体旁扭曲的光线。
//
//描述
//好吧，这群见鬼的层级编写者终于在阿尔茨海默症的道路上走到了尽头。很难想象，究竟是怎样扭曲光线的小白才会将这狗娘养的层级生存难度设定为0级。面对现实好吧！只要在进入这一层级的第一刻，如果你不是一头搁浅而死的蓝鲸，都能够感觉到这层级中空气的异样。轻微的鼻炎伴我已经两年了，鼻子中士在我的旅程中兢兢业业坚守岗位，从未趴窝，但就在我进入这鬼层级不过半分钟，空气中弥漫的气溶胶就使我的鼻腔和癫痫浣熊的老窝一样堵的死死的。见鬼，我不确定这气溶胶会起到什么作用，但以我探索这个和佛罗里达一样操蛋的鬼地方的经验来看，这绝对不会是什么好东西。
//
//不过我也没什么机会和一群白痴三明治讨论什么气溶胶了，要不是在这个“没有已发现实体”的鬼地方接连遇到了整整三个见鬼的实体，我喝上一碗字母谷物麦片都能拉出一篇比原作品更好的层级描述。而现在呢，我背运到只能孤零零的窝在这个见鬼的山洞里，等着那群怪物找上门来。
//
//实体
//stroller-486583_1920.jpg
//正在浓雾中搜索洛蕾塔的实体。
//
//就是这群怪物，我很确定它们不是无面灵，无面灵谁都见过，那些怪物带给我的感觉和那些小东西完全不同。那些家伙看着像人类，但仔细看就像是你烤出来的姜饼人一样怪异而扭曲。那帮怪物的吼叫声和一只淹死在麦片中的水牛一样，看不清它们的攻击动作与武器，当我注意到它们时，身体就已经被一羽不知从哪出现的简易羽箭贯穿了。是的，那帮该死的怪物会使用制作的武器，但我从没见过它们拿起弓或者搭上弦。
//
//真是见鬼，就在我写“实体”这部分的同时，我出去探索了一下周边的环境，然后就在没多远的地方发现了空气墙！是的，你们没有看错！空·气·墙！一个物品能够过去，但我自己过不去的无形墙壁就见鬼的摆在我的面前。操！操！操！这个屎乎层的太阳不会动，而月亮永远是个贴图样的盘子，这鬼地方就是个该死的陷阱！那种用虚拟现实哄骗流浪者进入，然后把他们开瓢做成人肉罐头的血肉工厂！如果还有哪个蠢货还呆在这个层级的，快把你的屁股挪到另一个安全的层级，这鬼地方不是家！！这鬼地方不是家！！
//
//基地、前哨与社区
//鬼知道，说不定那帮实体有它们的基地和前哨，或者这就是某个会用探针捅你屁股的邪恶组织的老巢，而我就要被捅了。
//
//月光照耀这个层级，将庇护我远离那些怪物的浓雾驱散，见鬼，我应该去看看他们走了没有。我的头越发昏沉，天气闷热，但我的身体却在发冷，或许是箭羽上被喂了毒，又或许是气溶胶中的毒素终于发作了，我不觉得自己能够逃离这个鬼层级了，我好害怕。
//
//nature-3194001_1920.jpg
//洛蕾塔·马丁拍摄的月下景色，据编辑痕迹分析，该月亮可能存在对人类的精神影响
//
//月色浓郁，万物清朗，多美的月光疯狂分立器件服务器噢IG发价格哦扒鸡个IQ平将供大家给Pro金黄色的开发教科文哦派克服色鬼叫哦我姜厚朴的神经反射个我见个面危改户不仅能热胸怀国际我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全我在光里很安全
//
//入口与出口
//入口
//乘坐Level C-19城市中出现的电梯，选择负18层。
//出口
//未知。
//流浪者洛蕾塔·马丁在Level 11被发现并救助，出现于该层级的原因不明。她中了提取自箭毒蛙5的神经毒素，但身体并无明显伤痕。此外，她的精神状态极其糟糕，常出现妄想、幻觉、蜡样屈曲、紧张性木僵等症状，现正于Level 11进行精神治疗，但恢复神智的可能性不高。
//
// 
//
//生存难度：
//等级 5
//
// 
//模拟现实
// 
//Level C-175是后室C层群的第175层。
//
//【M.E.G.警告】流浪者，若你的移动设备弹出本0级短信，代表你现已身处于Level C-175极端危险的虚拟世界。尽速输入*#78480384588466#以离开该层级。欲了解该层级详细情况请点击链接。
//
//描述
//经M.E.G.科研团队证实，该层级为 模拟现实
//Simulated Reality
// 技术模拟的现实世界。
//
//Ringworld_%283178736098%29.jpg
//不要被海岸的景色所迷惑，广阔而空旷的区域永远是危机四伏的死地。
//
//看看Level C-175，看看它那溢满眼帘的壮美景观，这看起来就像一个普通的0级层级？或是说它另有隐情？当你一度又一度跨越后室中满覆危机的层级、自那唯有人中之龙得以回还的困境中求得生存之后，饱受试炼的神经又怎不会在你的大脑沉湎于那不应坠于人间的稀世美景之时，向你昭示这个虚幻而脱俗的层级似乎并不像你所想象的那样无辜？
//
//真相是，你的确不知道，而这也不应怪罪于你。这个层级从来都不是无辜的，未知结构的气溶胶充斥着整个层级的大气之中，它会使你感到轻松，让你认为自己才思敏捷甚于平常，然后将你的大脑对虚幻的异状感消弭至无形。唯有最神经质的流浪者才会在第一时间发觉层级的异常，而他们则不是这一层级所捕食的对象——众所周知，一个成功骗术的准备之一，便是筛除能够看穿骗术的聪明人。它们不为他们而来，它为你们而来。
//
//自这一层级再度归还于层级列表中时，M.E.G.便致力于揭露这一层级隐藏的阴谋，但我们却总是空手而归，因为它将我们在第一时间便塞入了这个虚幻的盒子。而悲伤的是，即使我们中最好的探索者与研究者致力于此，至今我们也并未找到脱离“矩阵”，前往“锡安”的那座电话亭。为了保证Level C-25的事件不再发生，我们将在本层级设立通讯基站，以确保每一位误入该层级的流浪者在这模拟现实的创造者阴谋得逞之前得以安全脱身。
//
//blue-259458_1920.jpg
//繁星月夜，但是虚拟世界
//
//阅读者，若你在阅读本文之前读过【洛蕾塔·马丁的记录】，你应当会对其中“空气墙”与“月球”的部分印象深刻。再加上前面便提过的“气溶胶”，便是哈尔西博士与洛博士确认这一层级为模拟现实的证据。若你想要寻求更多关于本层级的知识，请向下继续阅读。记住：我们知道的越多，我们应恐惧的就越少。
//
//空气墙
//“空气墙”是一个游戏术语，指代那些仅对玩家具有碰撞体积、防止游戏玩家离开游戏既定区域的“上层叙事”设置。而于Level C-175之中，半球形的空气墙笼罩了这片虚拟的大地，将每一位进入层级的“玩家”困在既定的“游戏区域”之中，不让他们接触空气墙外未被编程的代码世界。
//
//洛博士，一位在M.E.G.中广受爱戴的逆向工程学博士，在多次试图穿越空气墙无果之后，通过一次成功的切出越过了这一虚幻的界限。但虚拟世界的主人捕捉了她的越格行为，并将她传离了Level C-175，使得穿越空气墙的探索之旅以无缘实现草草收场。
//
//planets-1956031_1280.jpg
//图片中较大的是月球，一颗随机出现于天空中的错误行星突兀的出现在了它的身旁
//
//月球
//高悬于天空之上，将一切事物渲染至失真的蓝色炽日；伴着天象移动，令胆敢与之对视者陷入疯狂的永圆之月；还有那不时随机出现于天空之中，完全无视天文学物理定律的小小恒星。这时长36小时的诡异昼夜循环，其间的异状真的还需要我们说些什么吗？
//请记住，如果你处于这个层级，永远不要长时间直视月亮，如果你不想落得与马丁女士同样下场的话。
//
//气溶胶
//“气溶胶”其实并不是真正的气溶胶。该层级黑幕所使用的模拟现实技术并非完美，该技术无法完全模仿人类感受器官传导至脑部的讯号，从而会使大脑产生持续性的异样感。为了将这种异样感对模拟现实的影响降至最低，他们会使用精神类药物舒缓进入者的神经系统，从而令进入的流浪者感到精神舒畅且舒缓。
//
//顺带一提，由于维生设备的影响，流浪者在进入本层后会逐渐感受到伤口正在逐渐恢复，且不用食用食物也不会感到饥饿。这的确是真实的、可以被利用的正面现象，但除非伤口或饥饿已危及到你的生命，在此层级中逗留仍是不应选择的危险选项。
//
//fog-3914967_1920.jpg
//清晰的实体图像，更多图像见【洛蕾塔·马丁的记录】
//
//实体
//实体Entity L-C-175（暂定）“ 镜影
//The Mirror
// ”，是常见于Level C-175的危险实体。
//
//“镜影”表现为人类形状的黑影，与成年无面灵近似，但全身的所有细节皆被扭曲且模糊化，并通常表现为黑色。“镜影”出没于任何Level C-175中可支持人类行走的地区，会对发现的人类第一时间发动攻击（也有报告称少数“镜影”会保持敌性中立的状态，但不要把你的生命寄托在这个上），他们的攻击方式与人类近似，会使用近战、射弹武器乃至于枪械。但极为致命的是，你无法从“镜影”的身影与动作中察觉到对方的行动与使用的武器，一个处于远方的“镜影”可能只是背对着你站着，但下一秒，你的胸口便已碎成一道爆碎的血花。
//
//据哈尔西博士研究推定，“镜影”可能是进入本层级的人类扭曲的倒影，它们在流浪者进入该层级时被创造为那位流浪者异质的复制品，作为这个猎奇虚拟游戏的一部分。他们近似人类、使用着人类的武器，不惧怕杏仁水，但却与人类相差甚远。若你遇到了一个“镜影”，尽可能的逃出它的视线，或者使用你最强力的武器进行还击，这将是拯救你生命的唯一办法。
//
//但请不要让自己落入如此境地，好吗。为了你自己，也为了等着你归来的人们，保持冷静、保持安全。
//
//基地、前哨与社区
//M.E.G.泰拉发信基站
//这是M.E.G.在本层级设立的通信基站，以通知所有误入本层级的流浪者Level C-175的危险之处。
//基站通常由3人小组驻扎，他们受命向所有会动的实体开火，不要试图接近他们！
//该层级的广播讯号频段中存在一个播放乡村音乐的电台，此电台与基站无关，且极有可能为陷阱，请各位流浪者不要上当。
//入口与出口
//入口
//未知，暂无可复现的进入方式。
//出口
//在移动输入设备或脑中输入*#78480384588466#将使你回到你曾在的层级。
//
//«————————⊰۞⊱————————»
//
//typewriter-5516924_1920.jpg
//† 这·个· 世·界
//Level
// ·亟·待·真·相 †
//
//⚠️ 安保通知 ⚠️
//鉴于Level C-175的自然环境与野生动物对人类种群的巨大益处，考虑到Level C-175效应对生物产生的影响，M.E.G.现已将有关Level C-175的文件档案设为机密，并以具指导性的假档案覆盖。请输入欧米茄级准入许可证以继续浏览。
//
//请输入欧米茄级准入许可证以继续
//帐号	
//CheckerWilson
//密码	
//•••••••••
//注销
// 
//
//生存难度：
//不安全
// 
//无后室实体
//Level C-175是后室C层群的第175层。
//
//描述
//Level C-175是一个以Star C-175为星系中心，受Star C-175引力约束的稳定恒星系统。该系统包含恒星Star C-175、3颗恒星、1个 巨型建筑
//Megastructure
// 与数量众多的小行星、彗星及行星际物质组成。Star C-175A、Star C-175B与Star C-175C皆逆时针围绕Star C-175公转。此外还有较小的天体位于Star C-175B与Star C-175C间的小行星带。
//
//本层级中不存在任何后室实体，任何携带进入本层级的后室实体——如体内的疫疾——将会凭空消失。不具有思考能力及威胁性的后室物品可被容许带入该层级，即使它在生理上拥有生命6。任何来自前厅的生物与物体都不会在进入Level C-175时因此效果而被筛选消失。在本层级中极难使用切出，且切出失败可能造成身体卡入物体中并直接导致死亡。
//
//O-type_star.png
//Star C-175的天文学图像，炽烈的蓝色太阳。
//
//Star C-175
//Star C-175 “ 苍日
//Cyanosol
// ”，是Level C-175恒星系统的中心天体，占有恒星系统总体质量的92.73%。
//
//Star C-175是一颗位于系统中心的O型主序星7，绝对星等-6.00，光谱分类为O9V。它的半径为20.25R☉，恒星质量约为34M☉8，是一颗巨大而明亮的O型星。
//
//奇异的，Star C-175的质量似乎并未成为其迈向死亡的推手，与前厅短命的O型恒星不同，现阶段仍在主序带的Star C-175，紫外线波段的光照较同类恒星较少，光度似乎并未因内部反应而缓慢改变，且该星体并不存在明显的质量消耗。换而言之，似乎在Level C-175中，有什么正向该天体补充质量，维持其主序星的状态。因而，只要该效应仍旧存在，这颗本应短命9的蓝色巨星将仍旧保持现有状态，继续为Star C-175B提供宜居的生存环境。
//
//planet-2967684_1920.jpg
//Star C-175A，天堂不再。
//
//Star C-175A
//Star C-175A “ 崦嵫
//Nightfall
// ”，是一颗毁灭于大灾难，又在引力的牵引下勉强拼合的石质星球。
//
//Star C-175A，据信为失落一族叙事史诗中提及的旧Level C-175。在往昔的记载之中，它常被描述为一颗形似地球的宜居行星，被黄矮星10明亮柔和的光芒所笼罩。这颗行星据信在一次自天而降的光芒下完全碎裂，并使得Star C-175A直至22/2/2022前无法访问。现今可观察到该行星的星核破碎散落于星球表面，星体因引力作用而再度拼合，但永久变貌的环境，以及此时位于恒星系统中心的O型主序星Star C-175光度的更迭，该星球早已不再存在半分宜居的迹象。
//
//日辰既定，月曜生兮。
//晨宵往复，罔有停息。
//彼皆以使，寰宇终成。
//置之首兮，以为斗枢。
//浚其五内，始成五州。
//乳为崇山，膝为北岳，
//股为八裔，尻……11，
//（中略）
//依兹新土，作乐其中。
//生息安乐，得无所惧。
//
//——《述异·开辟》，失落帝国Level C-175A创世史诗，篆刻于未知实体的甲壳上
//
//
//在旧Level C-175的历史史诗记录中，Level C-175A时期的失落帝国正处于自然崇拜向祖先崇拜转变的时期。代表自然的原始信仰神明在与祖先神的战斗中失落，被化作天地与世间万物护佑子民成长，这种“人定胜天”的乐观情绪成为了当时已成为部落国家的失落帝国最好的写照。鉴于史诗记载中旧时本层级的实体大多与前厅的动物战斗力相近，这一乐观情绪的兴起可以说并非空穴来风。
//暂对于旧Level C-175时期的异常现象未有太多资料流传，唯一已知的资料证实了在该旧层级中第四维度的裂缝会随机开启，通过一个简单的切出，便可以进入四维空间，从中抵达本不能抵达的地点（除此之外无分新旧，Level C-175似乎很难使用切出）。史料记载中，多位部落领袖因裂缝的偶尔洞开而遭到刺杀，而这些死亡的部落领袖通常因而被认为德不配位，触怒了上天。该异常现象并未出现于新Level C-175中。
//
//现今的Star C-175A是最靠近Star C-175的行星，轨道周期约为82天。它的大气层极为稀薄，这使得这颗星球的昼夜温差极为巨大，再加上它从未停止的地质活动，任何试图登陆该星球的行为仅会导致灾难性的结果（见“入口”一栏）。
//
//Star C-175B
//ring-world-4605013_1920.jpg
//无人机高空拍摄的环形世界Star C-175B，图中可见Star C-175D奇异的出现在了近 Star C-175B 轨道上。
//
//Star C-175B“ 后土
//Terra
// ”是一座 环形世界
//Ringworld
// ，也是本层级中人类活动的主要区域。
//
//Star C-175B是一座距离恒星约400A.U.12的环形 巨型建筑
//Megastructure
// ，圆环周长约为3.758e11km，宜居带宽度约为4e5km，与Star C-175的轨道倾角约为0度。在宜居带中，重力加速度g维持在0.9m/s²，略轻于地球与后室的部分层级。该巨型环带被设计于构建一个任何生命形态都能宜居于此的超级生态系统，Star C-175B拥有强韧的氮氧大气层、自我修复的生态系统、高强度的Wi-Fi与大量的液态地表水，可供给几乎所有拥有正常生命形式的前厅与后室实体极为舒适的生活。
//
//宜居带的大气组成与地球近似，但氮氧化物浓度更高，且因本地植物与生态影响13，在大气中广泛存在一种富含营养物质的气溶胶成分，该气溶胶可使已知的所有前厅生物获得营养、快速恢复伤口14，使厌氧生物在氧气中保持活性，并使智慧生物感到心情愉悦、精神充沛。气溶胶也会使所有植物，包括所有前厅与可带入本层级的后室植物，生长迅速而繁茂，并在成熟后释放与之相近的气溶胶成分。该气溶胶基本对人类无害，已被证实其对鼻炎患者有加重病情的负面效果，但暂无因此致死的报告，且气溶胶中的活性物质会在数日内将其治愈。
//
//fantasy-6203744_1920.jpg
//哈尔西博士、静海、“镜月”与抢镜的“太恒”
//
//Star C-175在宜居带中的光照通常表现为蓝色的眩光，较前厅太阳直射光通量高出20%左右，且在弥漫大气的气溶胶影响下产生漫反射，营造出一种超现实的恍惚感。宜居带约68.2%的表面积由水覆盖，大部分地壳表面在海平面以下。在宜居带中，生态环境由该处大气的平均透光强度决定。在不同光照强度的影响下，不同区域大致被分类为“干旱型”、“寒冷型”、“潮湿型”与“深海型”，温度与降水皆不同，但皆保持在生物适宜的范围之内，以支撑不同生活习性的物种于此宜居。因光照、生态与环境的影响，Star C-175B的自然景观处处秀美怡人，巧夺天工的自然奇迹总能于探索中发现，留下许多描绘其美景的摄像记录。
//
//宜居带中绝大多数水源皆为富含营养成分的矿物质水，口感清甜，但也有少数湖泊由杏仁水组成。环境的自净能力使得绝大多数流动的水源皆可以直接饮用，但仍旧不建议啜饮积水与死水，可能会导致急性肠胃疾病与腹泻的发生。
//
//在大气、土壤、温度与水源的共同作用下，Star C-175B于字面意义上的支持任何生命的生存，甚至包含几乎所有曾被证实无法于原环境以外的环境生存的植物，如Level 302与Level C-194中存在的植物。籍此，任何将危险植物带入本层级的行为都是极为危险的15。自22/2/2022该层级恢复通行以来，已有记录的所有层级原生植物皆为前厅存在的植物，且多为常绿乔木、落叶乔木、灌木、苔藓与真菌。
//
//Star C-175B中的人类可以说是其环境中最危险的因素，因异常效应作用（见下表），该层级充斥着大量具有敌意的掠夺者，试图杀人越货、从路人与掠夺者同僚中获取利益，将整个层级化作一方互相猎取的黑暗森林。任何过路的流浪者应避免前往Level C-175，若已处于该层级，为了您的生命安全，请尽快使用短信中提到的方式离开本层级。
//
//鉴于宜居带中极为适宜的生态环境，M.E.G.致力于与其他友好团体一同将本层级建设为人类后室文明的坚实后盾与物资产出点。但因普遍存在于Star C-175B的异常效应，任何在本层级建立大型组织的想法都是极难实施的。M.E.G.在此呼吁所有存在于Level C-175的团体，在此层级放下仇恨，一同为人类种群的未来保留一份宜居的土地。
//
//Level C-175的异常效应
//暂不能确定部分效应是否局限于Star C-175B，鉴于人类的活动范围局限于Star C-175B的空气墙内，在未获得更多资讯前将其视为于本层级皆生效，并列于Star C-175B一栏下。
//
//⒈除物种特征外，任何可能指向生物个体的信息将被隐藏。
//一项对于除自身外一切高等智慧生物生效的效应。以人类为例，当你看向他人时，该人类全身的细节、服装与携带物、倒影/阴影、乃至于摄像头的摄录内容都将会扭曲至完全无法分辨，其周身的光线将不自然的扭曲，隐藏其一切行为方式与行动。除通过实体精神影响造成的连接及大范围的肌肤相亲16外，暂无法通过任何直接方式从非自身的生命体中获取任何除物种特征的信息。与此同时，其周身1m内的所有装置也会一定程度受到该效应影响，任何采集生命体信息的装置将失效，任何人都可以通过提供受该效应保护的模糊信息以通过这些装置。但间接的限制，如密码与使用员工卡的磁力锁等则仍可正常生效。
//
//该效应会作用于言语，任何他人的言语听来都会产生类似高湿度+小空间混响+波形压缩的效果，从而使言语的内容与音调一同无法分辨。但这一效应并不会影响书写与编写的内容，只要写下该内容的载体与身体没有接触，就可以直接展示于任何人。特别的是，这一效应会对残留的生物痕迹产生影响17，擦除血迹、生物痕迹等痕量物证上可指向个人信息的内容。
//
//正是这一效应，使得分辨处于Level C-175人类的敌意变得十分艰难，在目击另一个人类出现时，除非对方先行表达善意，你将没有任何方式得知对方对你的态度——即使对方手上正拿着一柄锯断的双管霰弹枪。在这一效应的隔断下，道德的失范使得人类不得不为了自己的性命投身于囚徒困境创造的对立之中，将一切出现在视野中的人类视为敌对生物，造成了无数痛彻心扉的惨剧。这即是本层级被评定为“不安全”，并需以假文档掩盖真实情况的原因。M.E.G.正致力于消除这一效应产生的影响，但直至今日仍旧收效甚微。
//
//
//M.E.G.正使用一种名为“滤镜化直播”的方式规避该效应的影响。即采用自我直播+二次元滤镜+变声器的方式，通过自我修正图像与语音的方式避开该效应的影响，并从并未完全失真的图像与语音中分辨敌我。该方式在最初施行时受到了多数M.E.G.员工的一致反对，但于本层级的实践则证明了该效应的实用性，并逐渐在层级中开始流行。
//⒉层级中存在一种特有代币“₠”。当一个生物使另一个具有高等智慧的生物完全失能时，它将获得基于失能者种族数量的₠，并得到失能者留存的所有₠。₠可用于在本层级交易该生物所知的任何物体。
//当一位流浪者进入本层级时，其所持有的智能移动设备将会自动安装一个名为“EList”的交易软件。当此流浪者在脑中召唤“EList”时，也可以看到投影于眼中的交易软件画面。该交易网站使用一种特有的代币“₠”，通过支付数额不等的代币，该流浪者可以在该网站中购买绝大多数其所知晓的非生命物品，无论其属于前厅还是后室。通过EList购买的物品将会在瞬间安全抵达该流浪者所在的位置，不存在时间上的延迟，但可被他人抢夺。
//
//该代币仅能由杀死其他具有高等智慧的生物取得，无法和平转让，也无法代为支付。人类生命的代币价值为10₠，1₠可兑换为1kg黄金代表的前厅货币数量并购买前厅的网售物品18，或用于直接购买后室物品。后室物品的物价基础不明，且偶尔后室物品的价格会进行调整，调整原因亦不明。
//
//后室物品价格表（29/3/2022）
//杏仁水	3打/1₠
//糖果	1罐（约3磅）/1₠
//记忆罐（空）	2个/1₠
//皇家口粮	1盒/1₠
//现实清新剂	1瓶/1₠
//终极后室食谱	1本/2₠
//瑞撒毒气	1罐（液化）/2₠
//The Backrooms TCG	1套/5₠
//万物机器（复制品）	1体/699₠
//若第1效应使得本应持有善良的人类化作囚徒，那这项第2效应则几乎抹去了狱窗之外闪烁的星空。它给予了行凶者们一种强大的动力，一种依靠牺牲他人攫取巨大利益的动力，一种以生命作为赌注换取暴富的淘金者之乡——而后室之中从不缺乏看淡生命之人。正是这两个效应，它们将这座天堂般的层级刹那间化作了地狱。
//
//注：“杀死”一词意味着该生物最后一个对死亡生物造成了致死影响。如流浪者1~10按顺序对流浪者0发动致命攻击，在流浪者10发动攻击后流浪者0死亡，此时将算作“流浪者10杀死了流浪者0”
//
//⒊本层级中存在仅阻止生物穿越的空气墙，空气墙围成的空间是以Star C-175B宜居带中心一点为中心的球体。空气墙同时会阻止0.01~750μm波长范围外19的光波传播。当空气墙内的生物杀死高等智慧生物时，空气墙的直径将会随之扩张。
//当一个高等智慧生物死亡时，空气墙的半径将会扩张约1m的距离。鉴于Star C-175B的体量，可能需要数代人的牺牲才能使空气墙抵达宜居环带的边缘。任何试图加速空气墙扩张的行为都是无意义且得不偿失的。
//
//将人类困在这个血腥竞技场中的第3效应。无形的空气墙分割了内与外的世界，也使得流浪者中的浮想联翩之人误将壁外的世界认作某种未知的宝藏，其中藏有结束这一层级苦难的奥秘——然后将这一一见便知的愚痴的托词化作他们杀戮的借口。除此之外，这就只是个不允许人类穿过的空气墙罢了。
//
//
//
//Star C-175B-1
//Star C-175B “ 镜月
//Lunette
// ”是环绕在环形世界上的附属 巨型建筑
//Megastructure
// 。
//
//Star C-175B-1为与Star C-175B内环相接的环形巨型建筑，通常被旅行者认为是环形世界“泰拉”的球体天然卫星。暂无法理解该巨型建筑的制作方式、制成技术与完全功用，已知Star C-175B-1具有维持Star C-175B大气层、过滤恒星过强的光照转化为能量，及模拟日夜循环的功用。在Star C-175B-1的影响下，Star C-175B的昼夜循环约为36小时，其中24小时为白昼，12小时为黑夜，且这一循环不因Star C-175B的公转周期而改变。
//
//Van_Gogh_-_Starry_Night_-_Google_Art_Project.jpg
//前厅艺术作品。文森特·梵高的《星月夜》，月亮在画作中占据了重要的地位。
//
//Star C-175B-1的能量过滤/收集设备似乎采用了某种可改变大气光散射的分布式柔性纳米装置，实验性飞行器可轻易穿过过滤/收集层抵达层级限制的顶端，且过滤/收集层功用未受到任何影响。但由该技术模拟的月球光照已被证实会对人类的精神产生一定的负面影响，通常表现为形似 温迪戈精神病
//Wendigo psychosis
// 20的、文化导向的 文化束缚综合征
//Culture-bound syndrome
// ，且症状与其所认同的文化中对月的描述存在强关联。明显例证为在欧美文化的影响下，对“ 月球效应
//Lunar effect
// 21”这一伪科学传说深信不疑的群体，有极大可能会在直视月球时受到精神影响，乃至于陷入难以恢复的永久性疯狂（例见归档档案“洛蕾塔·马丁的记录”）22。而对于C层群中较为常见的中华文化人群，通常影响为幻视月球上存在“嫦娥”、“吴刚”、“兔儿爷”等实体，或幻视空中存在飞天女神与十二颗月球23等症状。
//
//planet-5480790_1920.jpg
//“岁星”掠过环形世界的背面时拍下的影像。
//
//Star C-175C
//Star C-175C “ 岁星
//Sui
// ”是一颗气态行星，也是Star C-175恒星系统中体积最大的自然行星。
//
//Star C-175C是一颗处于Star C-175B外部的气态行星，拥有一个明显的行星环与为数众多的卫星。鉴于其轨道位置所致，对该星体的观察暂处于停滞状态。
//
//这似乎是这片诡异的深空中唯一一颗正常的星球了，不是吗？
//
//又或者...？
//energy-5973476_1920.jpg
//Star C-175D“太恒”，无法理解的量子行星
//
//Star C-175D
//Star C-175D “ 太恒
//Quantus
// ”是一颗轨道未知的行星。
//
//如果你在这一层级仰望天空，这颗未知的青灰色星辰极有可能就在那湛蓝天空的一角等候着你的目光，仿佛这颗诡谲的星辰本就属于那一方苍穹般。那就是Star C-175D“太恒”，你总能在Level C-175的影像资料中找到它，它的表现就像一颗无视重力影响的石质行星，总是突兀的出现或消失于某片虚无的天空之中。
//
//自影像资料中可以辨别，Star C-175D的大气层极厚且透光度低，这使得该星球内部的环境无法被探知。星球的高层大气常见释放能量的等离子团，时常出现爆闪性的放电现象，且在与Star C-175B极近时会对宜居带的通讯产生一定的负面影响，使得以人类现有的技术即使突破了空气墙的阻隔，想要对该星球进行探索仍是几乎不可能的行为。
//
//M.E.G.对于Star C-175D的资料几乎与Star C-175C的研究资料一样稀少，仅存在大量包含了该星球的映像资料、对该星球诡异行为的初步了解，以及几个可谓是空穴来风的猜测。一部分流浪者坚称这颗星球是活着的，另一部分则认为中原皇清国试图创造子层级的行为造就了这颗只要不去注视便会消失的星球，还有一些人将马弗尔山电台的神秘与它联系在了一起，认为那便是电台主持“九狗”注视大地、播报新闻之处……我们不愿记录无端的传言，但除非对该星球的研究获得重大突破，我们就只剩这些传言可看了。
//
//基地、前哨与社区
//报告中的团体众多且难以统计，在此只列出生活在Level C-175的重要团体。因Level C-175效应与宜居性对生存环境的限制，若无额外说明，则默认该团体处于Star C-175B。
//
//M.E.G.泰拉基地：
//因U.E.C.与掠夺者的袭击，主要聚居区正处于重建状态。
//约300名战斗人员驻扎于此，以及相当数量的非战斗人员、定居者、不结盟贸易团体的转运点成员与前来交易的流浪者。
//友好，愿意交易——在你证实自己不是掠夺者后
//经常受到大批掠夺者袭击。
//U.E.C.启明前哨站：
//未知成员数，估计约有220~280名战斗人员。
//目的是为了占领本层级，但他们正逐渐失去优势，无法确认其下一步的作战动向。
//不友好，不开放贸易。
//不应该接近。
//万福杰瑞慈悲教堂：
//由杰瑞的信徒组成。
//驻扎人数不定，约45~115人不等，均为未受专业训练的战斗人员。
//因Entity 7造成的精神影响，他们似乎可以无视部分Level C-175的限制，从而在影响下分辨敌我。
//对流浪者中立友好，且愿意交易，但需忍受他们无休止的传教行为。
//任何对Entity 7的侮辱性行为将导致敌对。
//失落帝国安土大都护府：
//失落帝国由中华文化组的东亚裔人士组成，仍保持着形似明朝的内阁官僚体系、年号与卫所制度。
//约50名禁军、220名卫所兵，以及相当数量的管理人员、定居者与流浪者。
//聚居区曾遭到数次袭击与毁坏，但都倚靠强大的国力得以恢复。有军士在聚居区周边巡逻，驱逐掠夺者，指引可信任的流浪者前往聚居区。
//对能够流畅使用中文的流浪者友好且愿意交易，其他流浪者则保持中立且不予理会。
//似乎使用打更的梆子作为分辨敌我的方式，具体情况不明。
//失落帝国中原皇清国：
//由失落帝国中错误的信徒与部分后室装修公司的成员组成的势力，试图“装修”本层级并创造一个独立存在的子层级。
//他们相信被精心装修的层级将令他们的神明喜悦，为他们的敌人降下刀风黑雨。而当他们的神明获得足够强大的力量之后，祂将会打穿后室与前厅的间隔，让他们重返前厅的世界。
//在对层级进行施工的途中，他们受到了图基的突然袭击。一场血战之后，不稳定的新子层级失控爆炸，将图基的军团与中原皇清国的计划一并付之一炬。皇清国就此覆灭，而图基也受到了不小的损伤。
//阿尔戈斯之眼中立设营地：
//由阿尔戈斯之眼建立的聚居点，试图在本层级建立一个“无罪”的安全区。
//因Level C-175效应影响，“罪人”皆无法被分别，而没有对罪恶的惩罚，律法亦毫无意义。
//在多次损失惨重的袭击后，阿尔戈斯之眼于21/3/2022放弃了在这一层级设立营地的设想。
//少数派：
//由Level 6.1的“少数派”与Level 11的M.E.G.反对者组成。
//敌对任何与M.E.G.结盟的流浪者，战斗力较弱，人员纷杂。
//于25/2/2022宣告成立，同日因组织中的内鬼导致内讧而宣告瓦解。
//红星建筑队泰拉生产建设兵团：
//兵团鼎盛时期曾下辖4个团市（其中包含雁门市与1个建筑工程团）、35个农牧团场
//在与失落帝国的理念冲突中失利，随后于由图基率领的掠夺者袭击中放弃了屯垦的根据地，暂时放弃对本层级的争夺。
//据传，红星建筑队似乎正在重整队伍，实验全新的敌我识别方案，对本层级肥沃的土地虎视眈眈。
//图基
//Thuggee
// ：
//结合了印度教性力派迦梨信仰的掠夺者组织，信奉血祭会为他们带来力量与好运。
//作为最为有名且组织化的掠夺者组织，该组织曾一度攻破“中原皇清国”，完全摧毁其在Level C-175的存在，并在数次对各组织的偷袭中获取了极大的利益。
//该组织于15/3/2022对中原皇清国的袭击中遭受重创，随后在21/3/2022因上层内讧而覆灭。
//该组织使用智能手机作为敌我识别方式，该组织特殊的精神活性药物可使他们发出常人无法发出的音调，从而在间接交流中区分敌我。
//FM.101.42 马弗尔山24电台：
//播音范围仅限于Star C-175B的电台，主持人自称为“九狗”。
//24小时播报。“九狗”会讲述Star C-175B中近来发生的新鲜事情，信息来源不明，但皆为对真实情况的复述。其余时间则播放20世纪70年代及之前的欧美前厅音乐，通常为乡村音乐与流行音乐。
//此外，关于该电台的一切消息皆不明。
//+ 电台播放的部分音乐
//掠夺者营地：
//并非个体性的组织，而是大量由一或数名流浪者组成的无名小型团队。
//大多数掠夺者的生存时间不超过3日，但在后室的暗网中，总会有在此处捞金而归的掠夺者传说流传，不断诱引着新的淘金客于此殒命。
//通常以掠夺此层级的流浪者，或互相讨伐维生。曾有数次由一个掠夺者于网上提起，大量掠夺者自发对势力营地发动总攻击的去中心化袭击行为，对存在于本层级的各个组织造成了毁灭性的影响。
//黑星
//Blackstar
// “夜莺”基地
//该组织与M.E.G.处于结盟状态，并在本层级不明位置存在一个基地。
//马弗尔山电台与该组织存在联系。
//其余一切皆为不明。
//入口与出口
//入口
//使用本层级的层级秘钥打开任何一扇大门，门后将会通向Level C-175。
//在C层群探索时，手机有几率接收到一条写有“想明白生命的意义吗？想真正的……活着吗？”的垃圾短信。回复Y将使你进入Level C-175，通过保存该短信，流浪者将可以重复抵达本层级。
//非高等智慧生物，也就是人们常说的动物，可以从前厅或Level 81切入以抵达本层级，这也是自22/2/2022本层级再度开放后大量流浪者于本层级目睹到前厅动物的原因。
//乘坐Level C-19城市中出现的电梯，选择负22层将使你抵达本层级。
//需注意，若使用特殊方式进入Level C-175，该流浪者将会抵达Star C-175A的表面，而非Star C-175B。这是唯一已知的抵达Level C-175空气墙外的方法。
//出口
//从Level C-175的边境切出将使你抵达Level 11。
//在移动输入设备或脑中输入*#78480384588466#（= *#quit0evilution#）将使你回到你曾在的层级。
//试图向地下切入可能将流浪者送入Level C-188，但更有可能因卡入地面窒息而死。
//在本层级自戕将使你抵达Level 101，以死者的形式。
//附录
//«————————⊰【洛怀英博士的猜想】⊱————————»
//«————————⊰【蕾丽安娜·威尔逊博士的笔记】⊱————————»
//«————————⊰【TAS_ANY%_RNGM_C_175】⊱————————»
//Footnotes
//1. 以诗歌的形式传承，通常对被歌颂的故事存在大量失真的美化。
//2. 事实上，失落一族流传的史诗在神话学分析中与前厅中的史诗，如《诗体埃达》、《摩诃婆罗多》或《格萨尔王传》等具有相似的叙述节奏，即重人物、重故事、重象征色彩。自始至终，失落一族诗人与学者的描述重点永远是勇者与敌对者（如其他部落、实体或层级效应）间的争斗而非环境，除非该层级的环境危害程度足以成为故事的主角。
//3. 在C层群的失落一族中，流传着一种名为“后土地动锤”的异常物品，据传由大地迸裂、星球焚灭之时的地核之心所塑造，可以锤击招地震之能，可能与此事件相关，故于此列出。
//4. “长势喜人”可以说是十分保守的称呼了，该层级中植物的尺寸通常是前厅相同品种的1.2至1.5倍，且可食用的部分通常极富营养。
//5. 箭毒蛙，如果你不知道的话，是一种来自前厅的生物。该生物属于无尾目箭毒蛙科箭毒蛙属，拥有分泌影响人类神经的甾体类毒素的能力。
//6. 大部分后室特有的植物种子与有益真菌孢子都属于此类型。
//7.  耶基斯光谱系统
//Yerkes Classification System
// 中分类为光谱类型O的蓝白色炽热恒星，巨大、炽热且明亮，且大部分辐射输出在紫外线光谱范围内。
//8. R⊙为太阳半径，M☉为太阳质量。
//9. 在主序带的时间约为300~500万年。
//10. 光谱型态为G，发光度为V的主序星，前厅的太阳就是一颗标准的黄矮星。
//11. 原文缺失
//12. 天文单位，数值取自地球与太阳的平均距离，1A.U.=149,597,870,700m。
//13. 具体影响物不明，也存在该气溶胶大气为环形世界释放的假设。
//14. 甚至包括部分现代医学无法恢复的损伤，如系统性器官衰竭。
//15. 事实上，因气溶胶可为植物提供足够的营养，所有通过层级效应筛查的危险植物在本层级都似乎“不那么危险”了。但仍需时刻防止“黑天鹅”事件的发生。
//16. 如裸身拥抱，该行为将提供给肌肤相亲的两人一段时间的效应失效期。
//17. 存疑，可能是环境造成的影响。
//18. 兑换受金价调整影响，网络售卖物品表摘自世界各地的网络销售网站（包含前厅搜索引擎无法找到的网站内容），物品的真伪与质量以原链接为准。
//19. 从红外光至紫外光。
//20. 一种曾在美国与加拿大的阿尔冈昆文化群体中传播的疾病，通常表现为对食人有强烈的欲望。
//21. 月球效应理论认为月相的变化会对人类产生影响，特别是对于人类疯狂的影响。英语中的“lunatic”一词源自拉丁语 lunaticus，最初主要指癫痫和疯狂，被认为是由月球引起的疾病。
//22. 顺带一提，欧美文化的文化束缚综合征中，另一种极为常见的疾病是“月球是由绿乳酪做的”综合征，症状为将“镜月”视为绿乳酪或起司，该症状表现基本是无害的。
//23. 《山海经·大荒西经》：“有女子方浴月。帝俊妻常羲，生月十有二，此始浴之。
//24. Mount Marvel (78°45′S 159°22′E)，前厅南极洲的一座山峰。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1175{}