//Level C-100
//
//评分: 
//+378
//+
//–
//X
// 
//
//生存难度：
// 
// 
// 
//photo-1615729947596-a598e5de0ab3?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=987&q=80
//Level C-100。
//
//Level C-100是后室C层群的第100层。
//
//描述：
//Level C-100的主体是一座漂浮在天空里的巨山。山体的体积极为庞大，且自行形成了一套稳定、宜居的生态环境。
//
//身处Level C-100的边缘时，能够向下望见深不见底、光线昏暗、大雾弥漫的虚空。虚空内隐隐约约地回荡着与瀑布轰鸣类似的声响，现推测Level C-100以下的空间或许存在某种形式的水体1。
//
//根据该层级目前已有的出入记录，可以确认Level C-100属于“单向层级”：具体而言，即每位个体只能通过常规方法进入Level C-100一次。在离开Level C-100后试图二度进入该层级的尝试至今未能成功。除此之外，Level C-100内不存在任何形式的Wi-Fi。
//
//但是M.E.G.并不甘愿就此放弃Level C-100那安全稳定的环境、以及该层级内存在的多种特殊物品。为了发掘（甚至创造）连接Level C-100的双向通道，M.E.G.特地筹备并开展了“破门项目”。有关该项目的更多信息可详见下文。
//
//附录A：
//Level C-100在M.E.G.数据库内有着一个半官方性质的名称，名为“员峤”；该名称由Level C-100的主要研究人员伊妍2提出。“员峤”一词出自中国神话，乃一仙山之名。更多相关资料请见下方报告：
//
//请允许我以下面这则传说作为我的开头。
//
//中国古代神话里，在距离“归墟”并不遥远的海面上漂浮有五座仙山，分别唤做岱舆、员峤、方壶、瀛洲与蓬莱。它们风景优美、景色宜人，是传说中的众仙居住与娱乐之地。但是让仙人们苦恼的是这五座大山一直在往那无日无月、又黑又冷的“北极”方向漂去。为了阻止仙山的移动，海神禺强命令十五只巨龟前去驮住它们：三龟负责一山、其中一龟驮山、六万年进行一次轮换。
//
//仙山们果真停止了移动。但可惜的是，负责岱舆和员峤的六只巨龟被巨人抓走吃掉了；于是五大仙山仅剩三座，岱舆和员峤就此远远漂走，不知去向。
//
//而我为何要给Level C-100取名为“员峤”呢？自然是很简单很清晰的一个原因：它们太像了。
//
//当前线小队带着那些情报与物品自Level C-100归来后，我当即就像是被冥冥之中的什么东西重击了一把——对于正面描写“员峤山”的古籍，我所能忆起的仅有东晋人士王嘉所编纂的一本《拾遗记》——而偏偏就是《拾遗记》中的《员峤山》一文，竟与Level C-100的诸多特点表现出了诡异的类似。
//
//例如“衔不周之粟”的“一丈大鹊”、东边“驳骆如锦”的“云石”、西边“星池”内的“八足六眼”神龟……Level C-100在多个细节层面上的特征都和《拾遗记》所描述的员峤山出现了匪夷所思的对应。
//
//当然，我并不是就此坚信Level C-100即为员峤；《拾遗记》本身只是志怪小说，荒诞不经的内容不在少数。我意在阐明的是我选用此名称的原因、以及提醒诸位这个层级与神话传说那堪称恐怖的相似性。甚至是，这种“巧合”所蕴藏的某种可能性……
//
//——伊妍
//
//附录B：
//以下是由M.E.G.前线探索兵团“罗经点”多次派遣不同的队员进入Level C-100并归来后所采集的部分地理信息。为呼应伊妍在上文中提及的发现，特将《拾遗记》之《员峤山》的文本附入，以作参考。
//
//《员峤山》原文：多大鹊，高一丈，衔不周之粟。粟穗高三丈，粒皎如玉。鹊衔粟飞于中国，故世俗间往往有之。其粟，食之历月不饥。
//
//发现的对应情况：Level C-100内生活有一种体长约3米的大型鸟类，不过与鹊类并不相似。它们集群生活在位于Level C-100山脚处的一片粟米地附近，并以此地的粟米为食。调查人员发现食用该种粟米之后可以保持至少九天的饱腹感。
//
//《员峤山》原文：“东有云石，广五百里，驳骆如锦”；“有木名猗桑，煎椹以为蜜”；“有冰蚕长七寸，黑色……然后作茧……织为文锦，入水不濡，以之投火，经宿不燎”。
//
//发现的对应情况：没有在Level C-100的东边发现所谓“云石”，但山体的颜色确是颇为斑驳，以及的确找到了一片桑树林和一种生活在桑树上的黑蚕；而该实体的蚕丝是否真能用以织锦尚待试验。
//
//《员峤山》原文：“西有星池千里，池中有神龟，八足六眼，背负七星、日、月、八方之图，腹有五岳、四渎之象”。
//
//发现的对应情况：Level C-100的西边有一个巨大的湖泊，湖内生活有一种长有六足的乌龟，龟壳的颜色杂乱而斑驳，而面部纹路颇似多余的眼睛。
//
//《员峤山》原文：“南有移池国，人长三尺……人皆双瞳，修眉长耳”；“北有浣肠之国，甜水绕之，味甜如蜜，而水强流迅急……其国人常行于水上，逍遥于绝岳之岭”。
//
//发现的对应情况：Level C-100的南部是一个巨大的缺口，呈现出明显的山崩痕迹。
//北部亦然，但在其高处有着一个超巨型的瀑布，直接泻入下方虚空；可以望见瀑布源是一处狭隘的山洞，但由于山势奇险以及水流过于湍急而无从靠近，更无从探明水体为何能够源源不断。液体被证实为杏仁水。
//
//附录C：
//以下是一份关于破门项目的介绍。
//
//“破门项目”概述
//项目编号：A30-2
//
//前言：“破门项目”事实上隶属于另外一个更为大型的企划；该企划的目的在于百分百地利用好每一个被判定为“宜居”的层级。企划的更多有关具体事项尚在讨论与计划之中，破门项目多少都在起着实验与示范的作用，需谨慎对待。
//
//概要：破门项目围绕Level C-100（代号：员峤）展开。在经过前线小队多次的探索之后，现已确认Level C-100乃宜居层级，甚至拥有诸如“可以保持长期饱腹感的粟米”3这类神奇物品。
//
//可是除此之外，Level C-100还具有一个相当之大的缺点：一名人类仅能进出一次。尽管Level C-100的空间非常巨大，但也不可能容纳下每一位流浪者，所以最为理想的情况是在该层级内建起一个规模稳定的聚居地。
//
//我们有理由相信，在后室这种并不稳定的维度里，定然存在某种来回出入该层级的方式。Level C-100是不可多得、尤为珍贵的宜居层级，所以我们即使只有一丝一毫的希望，也要紧紧地把握它，以彻底克服进出Level C-100的不易，为广大流浪者同胞们开辟出一方能够平安生存的天地。这便是“破门项目”的初衷。
//
//执行过程：M.E.G.将甄选来自各个领域的数名人员以组成一支特殊团队，令其在Level C-100内建立基地并长期驻扎。允许该团队带入诸如紫钥石等特殊物品作为研究材料/手段。
//
//在此期间，M.E.G.也会定期派遣专员进入Level C-100，以向团队下达进一步指示或是补充特定物资、同时该专员也要负责跟进团队的研究进度，并回到外界后完成对接与同步。
//
//若团队成员出于各种因素地需要退出/替补等，也交由专员进行传达，并在外界讨论后进行讨论与解决。
//
//务必找出无障碍来回Level C-100的方式。
//
//基地、前哨和社区
//M.E.G. - “天枢”基地：
//由“破门项目”执行团队在Level C-100内建立的基地。
//位于该层级山脚处的粟米田附近。
//在多次针对人力资源进行的补充与投入后，现其常驻人数为260名。
//入口与出口：
//入口：
//在Level C-1的一座木屋内独处5分钟即可切入Level C-100。注意，木屋内的所有物品也会一同切入。
//更多入口尚待探查。
//出口：
//跳入Level C-100下方的虚空。你将无限下落，永不坠底；直到你就那么在半空中因为头晕/饥饿/甚至入睡等某种方式暂时失去意识之后（仅需一瞬），你就会在Level C-1内苏醒。
//更多出口尚待探查。
// 
// 
// 
// 
// 
// 
//
//有新增的文件。点击此处以更新。
//EagleSD.png
//附录D - 意外情况
//
//经过反复试验，现在初步判断进入Level C-100的方式已经失效。原因不明。
//
//今天本是派出第79名专员与天枢基地对接的日子：专员随后尝试进入Level C-100，但失败了。专员立刻向负责部门反映情况；在经过多种手段（例如动用紫钥石等）破解却仍未成功之后，目前正式宣布入口失效、及天枢基地失联。
//
//诸位不必为天枢基地的同事们担忧，他们如今已能够在Level C-100内做到自给自足。有关部门也将持续跟进此事，并于第一时间通告相关情况。
//
// 
// 
//
//2022年3月25日（入口失效后的第2天），Level C-100的入口再次无故恢复。当时正有一名调查员滞留于Level C-1的木屋内进行研究；5分钟之后，该人员如期被传送至Level C-100。
//
//然而，该调查员在返回Level C-1之后立刻报告称Level C-100内已经发生了翻天覆地的变化，例如天枢基地扩展为大型部落、人口增加、以及出现了另一个不知来源的敌对人类（被天枢基地称为“伪人”）集群等等。天枢基地自称已经和伪人部族进行了“长达百年”的对峙。调查员在与天枢基地负责人再三比对之后，已初步确认：Level C-100内的时光已经流逝了约两百年。
//
//显而易见，在入口失效的这两天里，Level C-100内的时间流速与外界相比完全不同。所幸天枢基地在长达两百年的失联时光里始终没有遗忘自身的使命，依然在数代人的接替中保证了自身的生存与团结。他们表示自己也猜到了入口发生了失效一类的事故，表示自己在百年的时光里已经接受并理解。
//
//不过，根据调查员采集的信息可知，天枢基地近代以来一直在忙于和伪人进行斗争，以阻止自身资源损失；这直接导致破门项目被搁置，数十年没有获得任何实质性进展。
//
//以下是由天枢基地编写的“伪人”实体文档；由调查员返回Level C-1时一并带回。
// 
//
//实体编号：TS-01
//
//栖息地：Level C-100
//
//描述：
//伪人是一种不知于何时出现在Level C-100内的人形实体。他们拥有着和人类相匹配的智力，并已经在Level C-100的另一端建起了自己的基地，和天枢基地对峙了百年之久。
//
//行为：
//伪人会在Level C-100内采集自然资源，以扩大自己的势力。虽然Level C-100的空间非常巨大、但毕竟还是存在着局限，所以伪人的扩张势必会招致生存危机。为了从伪人们手里争取资源，天枢基地已经和伪人发生了多次摩擦、乃至于流血冲突。
//
//生物学特征：
//伪人的生理特征与人类一致。关于这种诡异的相同性可详见下文的“镜像理论”。
//
//发现：
//员峤纪年01年3月23日，天枢基地的初代前线小队在前往层级中部地区执行勘探任务时首次遭遇一支来自层级另一端的伪人部队。双方在试探性接触后发生冲突。
//
//此后的岁月里，天枢基地所目击的伪人越来越多，并发现他们在层级的另一端建起了属于自己的基地。
//
//行为准则：
//应当：
//击败他们。
//不应：
//手下留情。
//》附录《
//关于伪人来源的猜想：“镜像理论”
//由于年代久远以及缺少可靠的记录，初代前线小队与伪人的首次接触之细节现已不可考。如今在进行了多方信息的综合整理之后，将过程大体还原如下：
//
//初代小队正在朝着山顶前进，以期执行规划内的探索任务。在到达半山腰时，初代小队迎面撞上一支正在下山的“人类”队伍。两方都在发现对方与自己的穿着和装备十分类似后而表现出疑惑与愕然。
//
//我方相当肯定天枢基地没有再派出第二支队伍，于是当即判断对方有可能是某类伪装型实体；在确认语言共通后，我方开始谨慎地与其交涉，要求互报身份。
//
//结果是，双方同时自称“M.E.G.成员”，并各自报出了一串在对方眼里并不存在的队伍代码。短暂的迷惑与猜忌之后双方决定继续以“自己所知的M.E.G.”为主题进行验伪。在数轮的交涉之后我方终于发现，他们虽然报出了非常广泛的M.E.G.信息，但绝大多数都完全错误，连“M.E.G.的创始人是三位监督者”、“M.E.G.于2014年军事化”、甚至“M.E.G.的全称是‘探险者总署’”都一概不知/否认。最终在提及最为基本的“层级资料”时双方再次出现严重分歧，局面逐渐变得焦灼并演化为肢体冲突，最终发生了战斗。
//
//在撤回各自的基地以后，我方针对小队的报告初次提出了“镜像理论”的雏形：简单来讲，即Level C-100会根据进入的人类主体而在自己的另一端生成另一个对应的主体；而碍于此种能力的局限，它只能捏造出一个拙劣的模仿品，而非完美的“镜像复制”。天枢基地也在此初步将该实体称为“伪人”。
//
//尽管该理论的猜想性与空白区都非常明显，但在后续漫长的情报刺探与反复接触中，我方已经可以断定对方的存在的确可以理解为通俗意义上的“M.E.G.镜像”。
//
//由于初次接触时发生的冲突以及数代人以来的积怨，天枢基地至今仍和伪人处于对立关系，无时不刻的和他们争夺着层级内的生存空间。
//
//此外，天枢基地忙于生存、碍于技术，其所设立的初衷“破门项目”不得不长期搁置。
//
// 
//Level C-100的研究团队在初步了解情况后显得对此颇感兴趣，尤其是伊妍。伊妍在经由申请之后，获准亲自作为下一名进入Level C-100的专员。伊妍表示希望此行能够更加近距离地去了解Level C-100如今的局势，并就天枢基地和伪人的关系而言和负责人进行一些谈话。
//
//2022年3月30日，伊妍回到Level C-1。令人讶异的是，她称自己在这几天内让天枢基地对伪人的态度发生了改观，并有望就此消除“无意义的”对立关系。以下是伊妍提交的与天枢基地现任负责人的接待官李唯的对话：
//
//[记录开始]
//
//（去除与主题无关的对接性话题。）
//
//伊妍：……那么，这就是你们对伪人的全部了解么？
//
//李唯：目前而言，是的。他们也在一天天变得壮大了，速度简直和我们不相上下。
//
//伊妍：（翻阅资料）嗯……他们还是对我们抱有敌意么？一直都这样？
//
//李唯：是。虽然我接手工作还没有多久，但是对于伪人这东西，我还是从小听到大的。
//
//伊妍：这样的话……我记得你们和伪人是语言共通的，为什么不能试着好好交流一次呢？
//
//李唯：老实说，不是没有试过。可惜我也不知道究竟是他们有问题还是我们有问题，总是能闹得不欢而散甚至是再起冲突。唉。
//
//伊妍：（拿开资料）你们应该不会在交涉时公然叫他们“伪人”吧？
//
//李唯：那当然不会。这个称呼多少有些不尊重人……
//
//伊妍：你也知道那个不尊重人？
//
//李唯：但毕竟我们才是正统的人类，他们是复制品啊！只是有什么必要在交流时弄出那么多不必要的隔阂呢？
//
//伊妍：你同意“镜像理论”？
//
//李唯：唔，毕竟是前几代的人们传下来的嘛……虽然还在论证阶段，但根据目前采集到的伪……咳，对方的情报，他们还真就觉得自己也是M.E.G.。但是要他们讲点什么组织信息呢，就开始满嘴胡言。
//
//伊妍：我突然想起一个问题哈。当初那支小队和对方起的第一次冲突，是谁先动的手？
//
//李唯：这个……这重要吗？
//
//伊妍：对呀，不重要。
//
//李唯：啊？您是想说什么？我有点被您搞糊涂了。
//
//伊妍：且不论那边究竟是不是所谓的“镜像人”罢，我其实一直很好奇你们究竟在和他们争什么？你刚刚也说了，他们“只是另一个M.E.G.”，对么？除了和天枢基地抢占生存空间这一件事，他们还有做过什么恶事么？
//
//李唯：您要这么说的话，那还真就没有了。
//
//伊妍：甚至于，“占领生存空间”本身也只是活下去的必要——这有错吗？算是恶吗？
//
//李唯：嗯……
//
//伊妍：我不想说的太绝对，但是我要说，以我目前接触到的信息而言，我实在看不出所谓的“伪人”哪里“伪”了。他们就是另一群活生生的人类，另一个鲜明的M.E.G.。我甚至看不出他们和你们的立场有什么分歧。若是我忽略了什么方面，你可以纠正我。
//
//李唯：……
//
//伊妍：所以我想，你们可以重新审问一下自己与他们的关系了。我们都只是在后室这个混账地方求生存的可怜人而已，有什么必要互相树敌、彼此对立？在过去的岁月里可能只是没有人迈出那一步，但我想，我们完全能够一起进步、一同生存。
//
//李唯：你说的这些，我会向负责人传达的。我会让他好好思考。
//
//伊妍：谢谢你。麻烦了。
//
//[记录结束]
//
//两百年的光阴或许确实太过漫长，漫长到已经让你们再也无法记清当年的冲突之细节。但是，这也正是我处于现在这个时间节点之上的优势。我得以跳出对立、站在局面之外审视你们与他们的关系：我是真的想不明白——
//
//你们到底在争什么？
//
//——伊妍
//
//经过伊妍此次的调节，后续我方再次进入Level C-100时惊喜的发现，尽管天枢基地和所谓“伪人”的关系还有待改善，但双方已经能够进行初步的友善交涉与信息交流，有望进一步沟通。虽然不至于短期内联合，但确是结束了无意义的冲突。
//
//值得注意的是，对方这次得以将自身的来源和盘托出。虽然依然是一个完全不同的M.E.G.甚至是大相庭径的层级知识，但我方却据此联系到了另一个理论：平行宇宙切入。
//
//即，所谓的“伪人”们可能确是来自另一宇宙的正常人类，也只不过同样来到了Level C-100并与我们相遇而已。若验证属实，这将成为“平行宇宙切入论”的一大论据、以及有望从对方那里取得更多与后室相关的情报与信息。
//
//若情况理想，Level C-100将成为第一个由跨维度的人类们进行合作的大型基地。我们由衷期待那天的到来。
//
//脚注
//1. 尽管并没有人员发现过。
//2. 伊妍在进入后室之前从事文学与艺术行业。
//3. 根据《员峤山》的描述而将其暂时命名为“不周粟”。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1100{}