//Level C-163
//评分: 
//+11
//+
//–
//X
// 
//
//生存难度：
//色彩斑斓
//往日浮现
//感官剥夺C163.jpg
//Level C-163内部房间的相片。
//
//Level C-163是后室C层群的第163层。
//
//描述
//Level C-163仅由两个相通房间构成，房间墙壁和天花板似乎采用了某种特殊的白色材质来制作，这种材料可以说是“完全”光滑，它将把受到的力量无声地分散到房间的每一处。它的触感摸起来像陶瓷，仔细触摸后可以感觉到凹凸感，但这些摸起来有感觉的裂缝并不会成像在大脑中。而且它并非是绝对密闭的，甚至可以说只有薄薄一层，所以氧气能从墙壁外部透入。这样的墙壁能反射出桌子和电脑的倒影，但却不会反射出人的影子。天花板上挂了一只老式吊灯，没有开关，它发出的光造成了墙壁反射出光线这一现象。连接通的电线似乎藏在房间天花板的内壁中，但却不会断电，无法知道电灯所连接的另一端在哪里，那里可能有几近无限的能量供给。
//
//为了保障人的行走正常，地面被刷上了一层有着隔音功能的暗红色油漆，这种油漆将发出的光线吸收，使得房间不会保持绝对的光亮。你通常不会感受到这些油漆发出的味道，但它们却是实实在在存在的人造油漆所散发而出的味道。
//
//Level C-163的角落通常摆放着一张配备着电脑的桌子，电脑会一直连接着无法被其他电子设备发现的Wi-Fi。但因其配备着一个旧操作系统，所以只能用来发布电子邮件。邮箱内既无已发送的邮件，也无接收到的邮件。
//
//关于Level C-163的外部，有人认为它的外部在后室的某一处，但没有人见过它的外部的全貌。它似乎连接着另外一个房间，调查组将其称为“办公室”，那里是独属于 Level C-163的一个神秘组织的房间，没有入口。
//
//特殊现象
//房间内部暂未发现任何物资，但进入Level C-163的流浪者在此处将会减慢身体内部的新陈代谢。当然，这可能对于进入者来说并非好事，因为这个房间通过多种方式来尝试抹除人的五官所传达的感觉，引用调查者的话说便是：房间想要把人的心灵“吃干抹净”。
//
//虽然Level C-163没有实体，但其内部具有未知的危险。在进入房间数小时后，墙壁的颜色将从原先的白色变为另一种颜色，并将这种颜色 定义
//Define
// 为一个或多个符合形容这种颜色的词语，同时还会在进入者的记忆中寻找符合形容这个词语的记忆，之后会将这些记忆重现在进入者眼前。
//
//如果进入者沉沦在这些记忆中，那么他们将会“完全融入”这个房间之中。
//
//所以，一旦看见房间变色，请立即在脑中呈现出与其相反的颜色，或是跟从一种独属于这个房间的声音的指导来思考、行事，这种声音被众人称为“神启”。跟随这种声音指导而思考的流浪者，还会有极小的概率进入者将看见上一个进入者在房间内某段时间的影像。这两种现象的出现毫无规律，但是如果流浪者在该层中经历过上述现象，那么房间内部下一次发生的现象将带有致命性。
//
//基地、前哨和社区
//未知基地：
//人数未知，内容未知的一个组织。
//组织成员居住在连接着房间主体的“办公室”中，通过某种方式监视并负责清理在致命性危机后存活或者死亡的进入者。
//它们偶尔会发出“神启”来帮助在经历变色现象的进入者渡过危机，其目的未知。
//入口与出口
//该层级并未发现物理意义上的入口与出口。
//
//入口只存在于梦中，该种梦境出现规律完全随机。只有进入者在出现的梦中进入到一栋奇怪的大楼外部将其打开后，才能在梦醒时出现 Level C-163内部。
//
//出口无法以真正的方式找到。
//
//你不会在这里找到任何出去的手段和方法，但是如果你的意志力强大到能够击破房间中的“致命性危机”，那么你也许可以与“办公室”中的成员见面并成为他们的一部分，加入帮助Level C-163中的流浪者的队伍。如果不能，就请祈祷真正的神来拯救你吧
//
//附录
//关于Level C-163的唯一的记录来自于一位M.E.G.成员，他为我们提供了数份珍贵的调查资料。
//
//- 收起记录
//一个好长的梦。
//
//梦中，它是个彻头彻尾的理想之地。淡蓝的天空中漂浮着洁白的云彩，原本地上什么也没有，然后草和树苗以极其快的速度从地底下破开土层而出，树苗生长着，树苗摇摆着。
//
//正当我全身心的投入在静穆、自然的环境中时，一栋大楼拔地而起，打破了这样的绝对的宁静。大楼的外部并无特别之处，与平常所见的写字楼无异，但是它的顶部直插云霄，使人难以望到尽头。
//
//接着大楼的门便出现在我的眼前。不知为何，我的心里突然冒出了打开它的冲动，于是我走上前去并将其打开，接着在一片黑暗之后，我进入了这里。
//
//万幸的是，这里的角落摆放着一台电脑，我将用这台电脑与组织进行联系，可惜它所配备的系统太过老久，以及信号也不怎么样，所以我将在以后的时间里用这台电脑与组织联系。
//
//上帝啊，请祝我好运。
//
//- 收起记录
//在这两小时里，我细细地观察了关于这个房间的一切。墙壁是由一种特殊的材料组成的，白得令人难以置信。摸起来……就像是有着大量裂痕的碎玻璃，但它看起来又是如此光滑。我用全力破坏也不会在墙体上留下一丝一毫的痕迹，它们仍然光滑如新，而且它们不是镜子，倒射不出人的影子，我只能看见那台电脑倒映在墙体中。
//
//房间顶部有一个吊灯，它是全房间的光线的来源，尽管看着亮度不高，但由于房间四面白色的原因，房间内部保持着高度的光亮，但少数射向地面的光线会被地面上涂的油漆吸收。油漆是淡红色的，铺得不均匀，似乎是人铺上去的，可能这里原来也是用与墙面相同材料制成的，但因过于光滑，难以行走所有才有人铺上油漆，它们是从哪里来的？是哪一个进入者带进来的吗？
//
//出不去！完全出不去！房间把关于门、外界的一切接触与感知全部断掉，如果我在这里死去或是消失的话，请帮我向我的同僚们道声歉意。
//
//
//- 收起记录
//去他妈的，这个房间想杀了我！
//
//看不见自己，听不见声音，闻不到一丝味道，吃不到一点东西。尽管身上配备着杏仁水来保持味觉，但它们迟早会用光的！而且新陈代谢似乎变得很慢，我甚至连撒泡尿照照我的影子的能力和欲望都没有，我需要的是阳光，哪怕只是一缕也好！
//
//身边充斥着无处不在的绝望感。它将人的五感剥夺，尽管陈新代谢减慢在其他广阔的大陆上探索时会起到巨大的作用，但在这个几近完全封闭的空间中，这就不是一件好事了。人，一旦丧失掉关于兽性的饥饿感就会变得温驯、乃至退化，我可不想在这里疯掉，抹除着人的所有感觉，它在试着把人吃干抹净！
//
//还有一件事，或许这件事才是关于这个房间的最恐怖的事实。
//
//在半小时前，这个房间的墙体忽然间从原先的白色变成了蓝色。那种蓝色是我这辈子都不曾见过的，没有一丝杂质，甚至从那一刻起，我所认定的真正的蓝色就是这样的了。
//
//沙滩的味道。海洋的味道。阳光照射在我的身体上，它是落日，它把我的魂灵引到别处，那里是我极度渴望的、梦寐以求的，关于身处在前厅的自由。
//
//接着，我看见了我那死去的妻子、儿子，他们嘴中呓语着什么，召唤着些什么。我看见了，有些什么喷涌而出。那是他们的灵魂，我的身体不由自主地向前迈步，我感到了无比的宁静、舒适，因为他们就在那里。
//
//“红色。”
//
//几乎是一刹那，就在我即将融入这个房间时，一个声音在我脑中响起，那是个中性音。接着无数的使我亢奋的、激动的记忆如同后浪般冲击上岸，冲入我的脑中，冲淡了极度虚无的由蓝色调色盘画出的空间。
//
//接着，墙壁上的蓝色变成液体滑落到地面上，尽管我想接住它们，但却无能为力，我早已因极度的恐慌与劫后余生的喜悦而瘫倒在地。这鬼地方又差点要了我的命。
//
//后室，我踏马谢谢你。
//
//
//- 收起记录
//一个身着浅色衬衫，面容憔悴、头发蓬松的男人忽然出现在我的眼前，他正站在地上呼喊。我凑到他身旁，清清楚楚地听清了这个“来访者”说的话。
//
//：“这里不只有神启。
//
//变色！就如同响雷那样“啪”的一声，整个房间忽然变色。看见了吧…这里是天堂，有纯色的、组合色的，多么美丽、多么干净的颜色。接着再看，死神就在它们身后！
//
//喂喂，那些躲在背后的家伙们也应该出来见回答回答我了呐！这个房间作为死神的代言词存在着，那么你们又是什么？那种无用的帮助又有何用，你们仍然无法拯救这个房间存在的事实，当然还会有人进来的！尽管你们往地上涂上油漆的做法确实不错。
//
//‘神启’？暂且那么称呼它吧，那些家伙们在颜色后面发号施令，帮助着每一个将死之人续上生命的痕迹…但是，它们真的意识到了吗？融入自己的记忆中可比被这个该死的房间杀掉好玩的多。”
//
//他忽然扭头看向我。就在那一瞬间，我看见了对方眼中所充斥着的恐惧，恐惧后面藏有着一个人影，那是死神，真正的隐藏在背后的死神！接着房间恢复了原来的平静。不难推断，对方口中所说的那些颜色应该是房间的变色现象，那么“神启”就应该是那句忽然间冲进脑子里的话语了吧。
//
//那踏马到底是“神启”还是“死神的宽恕”？
//
//
//- 收起？
//一片宁静。
//
//我害怕我将永远无法离开这个地方了。那么上帝，这是我的最后一个愿望。那些所有的与我有过交集的人，我的魂灵将永远保佑着你们的生命与安全。我真希望这是一场梦。
//
//地狱是黑色的啊。
//
//[撞击声。指甲与墙面的摩擦声。雷声和雨声。镰刀挥动的声音。]
//
//[约5分钟的寂静。]
//
//[开锁声。推门声。]
//
//“嘿！这个家伙算不错的了…竟然撑了这么久，不过也真是可惜啊，在最后的五秒里，这家伙倒下了。喂，别动那台电脑，我们可没有被允许触碰这台电脑。”
//
//“他似乎在录着音…或许我们可以把它发出去，好歹也让外界知晓知晓我们这的信息吧。”
//
//“什么？那好吧，两分钟之内你把它弄好，接着过来帮我处理这个人的尸体，这么一个健壮的成年人我可搬不动。”
//
//[录音结束]
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1163{}