//Ground C-180
//评分: 
//+64
//+
//–
//X
//阿尔戈斯之眼档案馆属于高度机密,
//任何未经所需许可的进入尝试都将被起诉。
//
//总部
//The Headquarters
// ：报到。
//
//守望者
//The Watcher
//  蒲1：收到。
//
//总部：是否已逃离Ground 87？
//
//蒲：我已经在这里待了不知道多久了……不过，我打开了一扇门，一扇有着圆形窗户的方形的门。我想它通往一个新的Ground。
//
//
//
//蒲：报告总部，我终于从那个该死的Ground 87逃出来了。这里是……这里的景象我好像没见过……需要发张图片过来吗？
//
//总部：好的，发吧。
//
//蒲：eaadc6db486375b3.png
//看起来这里还是蛮宜居的。这是一片正义的土地……我觉得，如果有机会的话，在这里设立基地是没问题的。
//
//总部：老兄，那还蛮不错的。
//
//蒲：我还挺喜欢这个地方，景色不错。这让我想起了我的家乡。
//
//总部：人之常情……不过，兄弟，现在要紧的任务是完成勘探。
//【不，你什么也没看见！】
//080cdad43b9ff5aa.jpg
//
//再会，一路顺风……
//
//总部：怎么了？
//
//蒲：啊……头晕了一下。不用担心我，我无大碍。
//
//总部：保护好自己，兄弟。抓住那些罪犯……如果这里存在罪恶的话。
//
//蒲：不过，至少目前，这里没有其他异常。无论如何，我还是先把它归档为Class Mitis。
//
//总部：好的，愿阿尔戈斯之光照耀你。
//
// 
//
//生存难度：
//等级 缓和(Mitis)
//
//宁静(Tranquil)
//已勘探完全
//低生物量
//Ground C-180是后室C阶群的第180 阶
//Ground
// 。
//
//描述
//Ground C-180是一个大小约16km×16km×8km的有限长方体空间，地面大约位于3.2km的高度，表现为起伏的山峦，有少量平原、河流和谷地分布。在海拔较低的地方，植被比较茂密，但仅发现了少量生物存在，且它们是无害的。
//在Ground C-180中心平原有一座小镇。小镇的居民通常被认为是无罪的。
//
//
//进一步的探索表明，在地面以下约100m的地方，存在一个巨型环状结构，直径约8公里，总周长约50公里。猜测与 前世
//The past life
// 2中的 大型强子对撞机
//LHC
// 3类似。但当地人称它为“正负粒子对撞机”。
//
//dac4718c4d3c3628.png
//Ground C-180中对撞机内部的景象。
//
//关注区域4
//“芳源镇”
//这里的居民都是这样称呼它的。这是一个宁静的小镇。镇上的居民对外来者友好，也会进行一些交易或在必要时候提供一些物资补给。他们通常被认为是无罪的。
//
//“高能物理学家”协会
//该团体分布于小镇上的高能物理研究所，以及大型正负粒子对撞机内部。负责大型正负粒子对撞机的管理和运行。
//与小镇居民一样，他们通常被认为是无罪的。
//如果提出参观要求，他们会将守望者带到地下的对撞机内部。
//
//入口和逃生地点
//在Ground 87中打开一扇有着圆形窗户的方形的门会来到此Ground。为了离开此Ground，可以随机地从对撞机内部的墙壁切出，这会导致来到Ground 2。
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//【冒用权限的罪恶之人，你终将受到法律(The law)的惩罚。】
//收起
//记录者：“真理裁决人”蒲██
//
//我在小镇上住了一晚。镇上的人们很友好，我留宿在一户人家的房子里，准备第二天到地下的对撞机去看看。
//
//这里的主人听说我是文化人，请我帮忙看看他们孩子写的作文。我觉得写得还不错，就摘录了几段：
//
//难忘的一天
//
//
//今天是高兴的一天。我早早的(地)从学校回到了家中。爸爸妈妈们还没有回来。我不知道他们什么时候才会回来。但是我想玩。
//
//我跟着伙伴们来到了镇子外山上的sēn(森)林里。我看到了陈爷爷，他在镇上的████严(研)究所上班。那地方好神奇啊！听他给我们讲，在我们镇子地下，有一个好大好大的甜甜quān(圈)！
//
//“陈爷爷，我要到那个甜甜quān里玩！”
//
//“好孩子不要随便去那种地方哦！那里是大人们上班的地方。”
//
//
//陈爷爷带我到了地下的“甜甜quān”里。我虫(从)来没有见过那么大的甜甜quān(圈)。我开心的(地)在里面夲(奔)跑，和小伙伴玩起了躲猫猫。
//
//
//我看见前面来了一个人。他长得好像我啊！说不定是我的弟弟呢。我一直想要一个弟弟。
//
//“你好啊！”我向他打招呼。可是他看到我迎上去，就惊荒(慌)失错(措)的跑开了。
//
//为什么我不能和他一起愉快的玩要(耍)呢？=(
//
//收起
//记录者：“真理裁决人”蒲██
//我进入了“正负粒子对撞机”内部。
//
//这里的科学家说它还在完好无损地工作，看上去，它的确是崭新的。
//a7d6e7889876c592.png
//
//
//
//我在对撞机管道内部走动，因为我本来也无事可做。至少这样可以消磨时光。略显弧度的管道一眼望不到尽头。我仿佛置身于Ground 2，但是这里不一样，这里没有罪恶，它十分的安全。
//
//
//我听到附近机器在嘀嘀作响，余音在空旷的地下回荡。
//
//
//究竟是什么样的团体才会在后室里造出这样科技含量的东西？我希望阿尔戈斯能给我答案。
//
//
//即使在 前世
//The past life
// ，作为粒子物理专业出身的我，也没有机会亲眼目睹欧洲的LHC。我为自己能在后室中完成自己的夙愿感到高兴。
//
//
//
//我有点冷。
//
//
//
//不知道已经走了多久了，我没有找到出口。我应该原路返回吗？但是那样或许会花费更多的时间。
//
//我的视野模糊了……？
//429962457fdbc272.png
//再会。
//
//
//谁？谁在说话？
//
//
//你确定要对你自己下手吗？
//
//
//你……有本事出来！别给我玩阴的！阿尔戈斯终将审判你的罪恶！
//
//
//我即是你。
//
//
//我看到一个人走了出来。他有着和我一模一样一样的脸庞，一致的步态，但是……他居然他妈的穿的是U.E.C.的制服！！！
//
//你是谁？！
//
//
//
//
//我举起了武器。
//
//请示总部。在Ground C-180发现了罪犯。我将狩猎。
//
//
//
//
//总部没有答复。我的通讯器里只有不断的杂音。
//U.E.C.刃岭游击队成员，蒲██，报道。请放下你的武器。提供有关阿尔戈斯的更多信息，我将考虑放你一马。
//
//
//
//
//他居然上报的是我的名字？
//
//
//他会是窃皮者吗？但是我还活着……或者他是另外某种 生物
//Creature
// ？
//
//披着我的皮囊的罪孽，我将把你绳之以法！
//
//
//
//
//他站着不动。
//
//
//我们的距离越来越近。我径直冲到了他跟前，和他撞了个满怀。
//
//
//一瞬间，我感觉我的身体仿佛在消融。耀眼的白光掩盖了一切……
//
//
//【记录中断】
//收起
//【严重警告】将访问一个被认定为**罪恶的**机密页面。任何冒用权限访问者都将受到阿尔戈斯的惩罚。
//
//[数据删除]
//
//
//我发现我站在正负粒子对撞机的隧道里。我的面前是一个该死的和我长得一模一样的阿尔戈斯之眼组织的成员。他几乎要贴上我了。我打了个寒颤。
//
//
//好在他很老实地退开了。
//
//
//刚才发生的一切让我愣在了原地。我看着他愤怒的眼神，一时不知道该做什么。
//
//
//披着我的皮囊的罪孽，我将把你绳之以法！
//
//
//
//
//我似乎明白了什么。可是我立即意识到，自己是光荣的U.E.C.的一员。
//U.E.C.刃岭游击队成员，蒲██，报道。请放下你的武器。提供有关阿尔戈斯的更多信息，我将考虑放你一马。
//
//
//
//
//他又朝我喊着什么。
//
//请示总部。在Ground C-180发现了罪犯。我将狩猎。
//
//
//
//
//他高举武器的手放下了。
//
//你是谁？！
//
//
//
//我即是你。
//
//
//我对他如是说道。
//
//
//我慢慢地朝身后退去。他在我的视野中开始缩小。直到我看不到他了。
//
//你……有本事出来！别给我玩阴的！阿尔戈斯终将审判你的罪恶！
//
//
//你确定要对你自己下手吗？
//
//
//谁？谁在说话？
//
//
//
//他看不见我了。
//再会。
//
//
//我从正负粒子对撞机回到了地面。重新审视这片褪色的大地。
//f1530158b510ffbd.png
//
//
//我知道，他就要离开Level C-180了。可我不能。我将永远留在这里。
//再会，一路顺风……
//
//
//
//何方圜之能周兮，夫孰异道而相安？
//
//
//方圜之能周兮，夫异道而相安。
//
//Ground C-180
//评分: 
//+64
//+
//–
//X
//本文档部分内容由正电子™️后室有限公司(E.P.B.)1档案部记录。
//
// 
//
//层级属性：
// 悖论
// 
// 
//Level C-180是后室C层群的第180层。是一个大小约16km×16km×8km的有限长方体虚空。
//
//描述
//层级中唯一的结构是一个悬浮于虚空中的环形正负粒子对撞机。其内部的空间是非线性/五维的，当流浪者在其中行走时，可能遇到来自其他不同时间线的自己，包括流浪者自认为从未被选择的时间线。从对撞机的不同位置离开会导致该层级的场景被刷新。但地面总会维持在3.2km左右的高度。
//
//[更多信息待完善]
//
//E.P.B.干员███：你读过这一层数据库里阿尔戈斯之眼和U.E.C.撰写的那两篇档案了吗？我完全不敢想象两个对立组织的档案居然在这一层级的特殊效应下衔接得那么自然……
//
//“何方圜之能周兮，夫孰异道而相安？”——《离骚》
//
//“方圜之能周兮，夫异道而相安。”——《？？？》
//
//实体
//也许有。
//
//基地，前哨与社区
//如果你愿意不断在对撞机中从不同出口出去尝试，你可能会找到很多。
//
//入口和出口
//在Level 87中打开一扇有着圆形窗户的方形的门会来到此层级。
//有报告提到Level C-24存在入口，但未证实。
//
//为了离开此层级，可以随机地从对撞机内部的墙壁切出，这会导致来到Level 2。
//存在通往Level C-194的出口，但具体信息属于保密内容。
//
//脚注
//1. Electron Positive™ Particle Technology Co.,Ltd. of Backrooms，正电子™后室粒子科技有限公司，对外宣称目的是从微观视角探寻后室的本质。同时致力于特种工业产品制造与贩卖，分子科学、原子能、量子技术研究，资源探索与层级勘探工作等。目前成员人数不明。
//“见微知著。”
//
//脚注
//1. 真名蒲██，来自中国，阿尔戈斯之眼“真理裁决人”成员，作为C层群特派人员之一。
//2. 阿尔戈斯之眼对“前厅”（the Frontrooms）的称呼。见Ground -7。
//3. 欧洲大型强子对撞机是现在前厅中最大、能量最高的粒子加速器。大型强子对撞机坐落于日内瓦附近瑞士和法国的交界侏罗山地下100米深，总长27公里（含环形隧道）的隧道内。
//4. 译自“Areas of Interest”(见Ground 48.1)。另可译为“相关区域”（参考“相关团体”-Groups of Interest）。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1180{}