//Level C-109
//评分: 
//+7
//+
//–
//X
// 
// 
//
//目前，有关Level C-109的信息仍旧所知甚少，如果有对此层级信息补充的信息，请联系M.E.G.档案部
//
//有关发现Level C-109的邮件。
//
//
//返回上一页
//发件人：almondwaterlove@backmail.com
//收件人：MEG_463176@backmail.com
//主题：我想提交一个关于一个从没有被提及过的层级的信息。
//2020年6月24日 11:48
//呃……你们知道最近的那个网购APP吗？？？我在里面似乎看到了一个从未被记录过的层级啊。
//
//发件人：MEG_463176@backmail.com
//收件人：almondwaterlove@backmail.com
//主题：Re：我想提交一个关于一个从没有被提及过的层级的信息。
//2020年6月24日 14:05
//请提供详细的细节，我们将对这个层级进行详尽的探索。
//
//发件人：almondwaterlove@backmail.com
//收件人：MEG_463176@backmail.com
//主题：这些大概是我们发现这个层级的经历。
//2020年6月24日 16:38
//就是我们在一个很多后室人聚集的前厅建立的论坛里突然看到了一个浮动广告，图片上赫然标着杏仁水的照片，我们就很奇怪。向论坛管理员询问情况，对方说没有遇到过这个广告，所以我们觉得点击这个广告看看内容是什么。
//
//点击之后我们发现这似乎是一个文件下载链接并且自动下载了一个APK，当自动安装好之后我们发现这个应用叫“后室通”。打开应用发现似乎是一个网购软件，里面似乎售卖很多东西，我们尝试过在不透露的情况下让前厅的人访问这个链接，但他们都说链接无法访问，无论有没有使用VPN等手段。
//
//回到软件，我们尝试购买一部前厅才推出没有多久的手机，但没有想到它让我输入我认为值得的物品数量，他们似乎有他们的一套物价系统，我最后用了一百瓶杏仁水才博得了店家的同意。
//
//最后软件的物流信息告诉我让我将那100瓶杏仁水放在了一个我们这个层级的指定位置，并且发货地正是Level C-109。不过我们几人抬着几箱杏仁水到达指定位置后，哪里居然是一个哨点，看起来……就很像前厅的快递运输点，有很多的箱子以及有一些人在哪里，我们也没敢多问把杏仁水留下之后就走了，之后没几天我住处的门口就有一个盒子，里面正是那部手机，还是全新的。
//
//大概这就是我们的遭遇了。
//
//发件人：MEG_463176@backmail.com
//收件人：almondwaterlove@backmail.com
//主题：Re：这些大概是我们发现这个层级的经历。
//2020年6月24日 20:05
//已了解您提供的信息，M.E.G.会派遣特工对那个快递点进行调查的。
//
//有关快递点的访问记录摘要。
//
//
//返回上一页
//受访者：孙██
//
//采访者：特工李
//
//前言：此次记录是对邮件内所提到的快递点的尝试性访问记录。
//
//<记录开始>
//
//特工李：正在接近此层级的快递点。
//
//M.E.G.监督员：收到，请小心行事。
//
//特工李：正在靠近，即将接触人性实体。
//
//孙██：实体？什么实体，你再说什么啊，我就住在不远处的营地里啊。
//
//（特工李检查了孙██的身份信息并确认核实，对方是人类无误。）
//
//特工李：所以你为什么要在这里工作？
//
//孙██：当然是他们给的多啊，还有别的理由吗？
//
//特工李：他们？他们是谁，你是怎么来这里工作的？
//
//孙██：他们我就见过一次，一个个都西装革履的，自称是自己是什么后室贸易无限公司的人，我也是网上看到招聘信息的。
//
//特工李：那你见过有快递员来过这里送货取货吗？
//
//孙██：从来没有，这里的货物都是凭空出现又凭空消失的，我的任务只是确保不丢东西和接收那些来付款的人的物品的。
//
//特工李：好的，我明白了。你继续在这里工作吧，注意安全，有什么异常请立刻联系M.E.G.。
//
//（访问结束）
//
//一段有关后室贸易无限公司的招聘广告，目前已被删除。
//
//
//返回上一页
//你还在为了生存而探索那些危险的层级吗？你还在为了生活而对你所在聚落的负责人而点头哈腰吗？来到我们后室贸易无限公司吧！在这里我们会给予你充足的补给，我们会给你安逸的环境，你只需要清点货物，没有任何工作门槛。还在等什么，赶快加入到我们的大家庭吧！！！
//
//（此处地址根据不同提供者称，根据层级不同地点也会改变）
//
//目前已知信息总结，但所得信息仍非常的少。
//
//
//返回上一页
// 
//
//生存难度：
//未知安全等级
//不明朗稳定性
//不确定实体数
//Level C-109是后室C层群的第109层，这里的很多信息仍不明朗。
//
//描述：
//Level C-109是一个据几名流浪者通过邮件的形式通知M.E.G.后所得知的层级，目前该层级内的环境情况与实体数量等要素一概不明。目前只知道这个层级是一个只能在后室内下载的应用后室通内购买物品的发货地点，并且由一个名为后室贸易无限公司的组织所控制。
//
//目前，每一个拥有大量流浪者聚集居住的层级都会出现一个名为快递中转点的地方，这里一般由几名通过网络招聘所聘得工作的流浪者管理。中转站内会根据此层级内流浪者的购买物品而凭空出现包裹，这些包裹出现在中转站后，购买者将购买物品对应的物资带到中转站后，包裹将会直接出现在购买者的住处内。
//
//后室通是一款网购应用，在内可以购买到前厅所能购买的一切物品1，并且还能够购买后室内才会出现的物品。购买物品遵循以物易物的规则，但该应用似乎有一个由它定制的算法，通常认为这个算法是互相都公平的。
//
//基地、前哨与社区
//该层级不存在已知的基地、前哨和社区。
//
//入口与出口
//该层级目前所掌握的的信息非常少，目前没有掌握进入此层级的方式。
//
//您有一封新邮件，请查收。
//
//
//返回上一页
//发件人：B_R_T_I_C@backmail.com
//收件人：MEG_B@backmail.com
//主题：尊敬的监督者阁下。
//2020年7月12日 00:00
//尊敬的监督者阁下，想必您已经知晓了我们的存在，我的公司后室贸易无限公司。这个公司很年轻，很有生命力，也是我的全部。我只不过是一届商人，对那些派系争斗丝毫不感兴趣，但似乎有些家伙们正在破坏我的中转站……
//
//早就有所以听闻贵组织的庞大实力，我们能否达成合作呢？只要您高抬贵手保护我……不，我们的中转站，我一定会给一个让大家双赢的方案，比如针对贵组织控制区的物价下调等，希望阁下能够考虑一番。
//
//——后室贸易无限公司CEO █████
//
//作者信息
//« Level C-108 | Level C-109 | Level C-110 »
//
//脚注
//1. 不包括不动产。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1109{}