//Level C-194
//评分: 
//+53
//+
//–
//X
//本层级档案由正电子后室有限公司(E.P.B)1环境资源部提供。
//
//
//E.P.B.推荐的生存难度评级：
// 
//
//生存难度：
//等级 -1
//
//宜居
//脆弱
//需呵护
//M.E.G.推荐的生存难度评级：
// 
//
//生存难度：
//潜在宜居性
//隐藏的档案
//受保护的实体/物种
//Level C-194是后室C层群的第194层。
//
//Notepad_202203200006_45484.png
//层级中心建筑“生物圈III号”内部生活区的景象。
//
//描述
//E.P.B.环境资源部干员弗洛伦丝·坎布兰(Florence Cumberland)的记录：
//我从未想象过某个层级会成为我们的保护对象。是的，这听起来非常不可思议。我们得明白，美好的东西往往也是脆弱的，而守护这份不可多得的美好，不论是在前厅还是后室，都是任何一个有良知的人类的义务。
//
//Level C-194是一个多彩而脆弱的生态系统。层级中心建筑是一个外墙由未知材料的透明物质建成的封闭舱室结构，其外观类似前厅中的“生物圈II号”2，但规模更大，粗略估计占地面积达到了20平方千米。出于此因，来到该层级的旅行者通常会将其称作“生物圈III号”(Biosphere III)。
//
//主体建筑内部可分为生活区、农业区、绿色工业区、雨林区、草原区、沙漠区、海洋区、湖沼湿地区、肺区(气体交换区)、基因仓库、实验室和总控中心等区域。现将各区域大致面积大小列举如下：
//
//- 点击隐藏资料
//区域	面积(k㎡)(约)
//生活区	1.2
//农业区	2.4
//绿色工业区	0.8
//雨林区	2.8
//草原区	2.5
//沙漠区	1.7
//海洋区	3.2
//湖沼湿地区	2.5
//肺区	2.4
//基因仓库	0.03
//实验室	0.04
//总控中心	0.1
//总计	19.67
//主体建筑之外是一片广袤的土地。据最早来到该层级的旅行者报告，它曾是一片繁茂的森林，但出于某种原因，它逐渐演替成了一片沙漠。
//
//qVsk0e.jpg
//主体建筑外部的沙漠。(摄于本页面创建前五年)
//
//+ 勘探记录1
//
//+ 勘探记录2
//
//+ 修复记录
//
//经过E.P.B.环境资源部、M.E.G.等组织的不懈努力，Level C-194的外部不再是一片炙热荒芜的沙漠，她正在逐步恢复生机。请时刻铭记，任何时候都切勿放松警惕，否则从前的一切努力都可能付之东流。
//
//barley-g861e49ccb_1920.jpg
//“希望”(摄于农业区)。
//
//oilseed-rape-g5f98c0c50_1920.jpg
//“明天”(摄于建筑外部)。
//
//实体/物种
//本层级无除1号实体以外的有害实体。
//
//层级内部的基因仓库有多种极具研究和实用价值的物种。出于保护目的，现仅公开少部分内容：(请注意，所有名称都非正式名称)
//
//任何未经允许私自采摘/狩猎行为都将面临严重后果。
//
//植物
//“火熔棉”
//系针叶棉经基因工程改造后的产物，拥有优异的耐火、耐热性能。被E.P.B.用作生产耐火防具的内衬。
//
//“炽沙棘”
//系赤沙棘经基因工程改造后的产物，可食，味甘而烈。亦可用作榨汁或酿酒。功效包括(尤其在极端环境下)有助于保持理智、恢复体力，其余功效有待进一步研究。
//
//“雪胶树”
//类似于橡胶树，但其产生的树脂凝固后有类似气凝胶的优良性能：质轻，绝热效果好，韧性强。被E.P.B.用作生产宇航服等高级防护设备的原料之一。
//
//“维多利亚黄杏”
//(已灭绝)
//该种植物的树汁、果实中富含杏仁水，来到这层的旅行者争相食之。(也许正是因此遭来了灭身之祸。)
//
//“御膳果”
//(已灭绝)
//该种植物的果实中疑似含有皇家口粮，来到这层的旅行者争相食之。(可以肯定正是因此遭来了灭身之祸。)
//
//他们甚至没有放过基因仓库里的种子。
//
//动物
//暂不予公开。
//
//出于某种原因，本层级的绝大部分物种无法在该层级及其子层级5外的其他地方生存。目前任何将物种引种到其他层级的尝试都是失败的。
//
//基地、前哨与社区
//E.P.B.™e³基地
//E.P.B.第三重要的基地，人数125人。基地主要位于“生物圈III号”生活区与实验室内。包括武装部30人、勘探部15人、环境资源部20人、科技部7人、研发部5人、工务部45人、销售部3人。致力于层级研究、环境呵护与特殊产品研发。与M.E.G.合作关系融洽。
//
//M.E.G. BioIII基地
//人数约100人。基地主要位于“生物圈III号”生活区内。致力于层级研究与环境维护。与E.P.B合作关系融洽。
//
//卡拉格灵协会档案室
//仅有一名档案员。档案室位于生活区。
//她负责记录这里每一种生灵的存亡。
//
//入口与出口
//入口
//鉴于本层级的脆弱性，为避免过大的人口压力使层级生态再度崩溃，除下列最后两个入口外，均有M.E.G.成员或E.P.B.干员值守。
//进入Level 302的一片森林并穿行一段时间可来到本层级。
//在Level 499的某些隧道或森林中穿行可来到本层级。
//向Level C-194.1的市郊走去可容易地回到本层级。
//在Level C-180通过[数据删除]可来到本层级。
//从Level C-140唯一的一片草地切出可来到本层级中心建筑旁。
//在后室咖啡厅点一杯维多黄杏冷萃美式咖啡并饮用会来到此层级。但由于制作咖啡的维多利亚黄杏几近灭绝，此方法较为困难。
//在Level 48.1迎着太阳的光芒走去有小概率到本层级，而不是Level 48。
//第二次或以后进入Level C-5时触碰“绿色”有极其微小的概率6来到本层级。
//
//出口
//在农业区的麦田中睡着会来到Level 10。
//在海洋区中溺水有概率来到Level C-83或Level 83。
//在雨林区中爬上一棵树的树梢并跌落有概率来到Level 37。
//在肺区屏住呼吸冥想2分钟以上会来到Level 63。
//向外部广袤的土地走去，直到看到一座被植物环抱的城市的剪影，继续向前走，直到进入城市，旅行者会来到Level C-194.1。
//
//Footnotes
//1. Electron Positive™ Particle Technology Co.,Ltd. of Backrooms，正电子™后室粒子科技有限公司，对外宣称目的是从微观视角探寻后室的本质。同时致力于特种工业产品制造与贩卖，分子科学、原子能、量子技术研究，资源探索与层级勘探工作等。目前成员人数不明。
//“整体大于部分之和。”
//2. 生物圈II号是前厅中美国建于亚利桑那州沙漠中的一座微型人工生态循环系统、人造封闭循环系统，占地1.28公顷，容积约18万m³。1991年~1996年科学家在此进行了密闭人造生态系统生存实验，但最终实验以失败告终。
//3. 目前大多数物种只有在“生物圈III号”内部的基因仓库才能找到了。
//4. 截止20██/2/12。
//5. 原子层级Level C-194.1编号现已更新为Level C-███。此外，该层级物种可在少数特殊层级(如Level C-175)生存。
//6. 据信是十亿分之一。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1194{}