//Level C-114
//评分: 
//+34
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//Level C-114是后室C层群的第114层，是一所无限大的医院。
//
//photo-1519494026892-80bbd2d6fd0d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1753&q=80
//一张该层级一楼的照片。
//
//描述
//当流浪者进入Level C-114的时候，会在该层级一楼中的随机一张随机躺椅上醒来。流浪者若为初次进入该层级，将会产生一种强烈的不适感，同时将伴有惊慌和恐惧。目前产生这种感觉的原因未知，但可以通过饮用杏仁水来有效的减轻这种感觉。
//
//无面灵是Level C-114中唯一存在的实体，但其被该层级扭曲成了三个种类，并可以和流浪者正常交流。以下为无面灵的三个种类：
//
//photo-1516841273335-e39b37888115?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=2294&q=80
//一张该层级中医生与护士的照片。
//
//医生
//医生通常为身着白色大褂，戴着听诊器和蓝色医生帽的友好无面灵。其会尝试对病人进行诊断和治疗，它们在一般情况下会快速地诊断出病人的病因，并制定出一套科学可行的治疗方式，治疗方式包括且不限于：
//
//药物疗法（药物通常为治愈水晶和杏仁水，以及层级内特有的无标签药品）
//手术疗法（成功率最高的疗法）
//物理疗法（但目前没有成功的案例）
//在医生进行手术时，其白色大褂将会变为浅绿色。
//
//当医生治疗的病人死去后，其心情将变得十分失落，故建议流浪者在碰到失落的医生时对其进行安慰。
//
//护士
//护士通常为身着蓝色护士服的友好无面灵，它们通常会对病人进行日常的照顾和看护。有时，也会换上浅绿色护士服辅助医生进行手术。
//
//病人
//病人为该层级中唯一的不稳定因素，通常为身着蓝白交间的病服的无面灵，病人在该层级中出现时，通常会带着不同的伤势，同时将会表现出不同的行为，有时，它们将会十分配合医生和护士的治疗；有时，其会对医生、护士以及其他病人展现出攻击性。
//
//当病人表现出攻击性后，医生和护士会对其进行控制，并将其送至9至10层。若流浪者帮助了医生和护士制服病人，其将会得到一些物资作为谢礼，物资类型有：
//
//杏仁水
//火盐
//寂静汁液1
//治愈水晶
//被治愈后的病人将会在Level C-114的1层中游荡。
//
//进入了Level C-114的流浪者将会统一被视作病人，尽管大部分流浪者的身体并无任何问题。
//
//护士会先将病人转移到2层进行诊断，在医生对病人进行诊断后，护士会根据病人的伤势，将其转移到不同的楼层。
//
//在Level C-114中，有着不同作用的房间，这些房间的分类为下：
//
//photo-1538108149393-fbbd81895907?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=2428&q=80
//一间位于该层级5层的病房
//
//病房
//病房为病人所居住的地方，在病人的治疗进行结束后，便会被送至这里。
//
//一间病房内有八张病床，每张病床对应着一名病人。
//
//在病床边的床头柜中，可能会出现一些物资，比如杏仁水、治愈水晶和一些没有标签的药物，可以通过礼貌地询问护士或医生来知道药物的具体作用，但该层级中所有没有标签的药物都将会在切出该层级时消失。
//
//手术室
//photo-1551076805-e1869033e561?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=2232&q=80
//一张未进行手术时手术室的照片
//
//手术室为进行手术的房间，该房间在未进行手术时可以进入，但进入前需要进行消毒，并穿戴上医生的白大褂和蓝色医生帽。在进行手术时，手术室不允许任何人进入，但流浪者可以选择协助医生进行手术。在手术完成后，将会获得和制服病人相同的物资作为谢礼。
//
//Level C-114有着10个楼层，可以通过电梯在楼层间进行转移，其分别的作用为下：
//
//1层：为接受病人的楼层，同时也用做仓库。若病人的身体没有任何问题，或被治疗至正常后，将会被送往该层。
//2层：为诊断病人的楼层，同时也是16层中，唯一拥有手术室的一层。
//3至4层：该层的病人被诊断为轻微伤，通常，该层的病人的伤口会在进行简单的消毒及缝合后送至1层。
//5至6层：该层的病人被诊断为轻伤，通常，该层的病人会被外敷治愈药水后被送至1层。
//7至8层：该层的病人被诊断为重伤，通常，该层的病人会先送至2层进行手术后，再送至该层进行观察。
//9至10层：该层的病人通常有着心理问题，由于医生没有治疗心理疾病的能力，故只能将其控制住后，送往该层。在病人的心理问题减轻后，将会被转移至其他楼层进行治疗。
//基地，前哨站和社区
//“医者们”
//该团体由7名医者组成，他们热衷于向该层中的医生学习医疗知识，并且通过制服病人和协助医生手术而积累了大量杏仁水和治愈水晶，他们十分友善，且愿意与他人交易。
//
//入口和出口
//入口
//在后室C层群中进入任何一间医院都有几率进入该层级。
//
//出口
//在被医生确认痊愈后，可以向护士提出离开，护士会引导流浪者到医院的大门，走出大门后，便会回到原先的层级。
//
//作者
//« Level C-113 | Level C-114 | Level C-115 »
//
//Footnotes
//1. 得到寂静汁液的几率极小，目前只有一次获得寂静汁液的记录
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1114{}