//Level C-171
//评分: 
//+20
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
// 
// 
//中量实体
//Level C-171是后室C层群的第171层。
//
//描述
//Level C-171内部是一个游乐园，所有游乐设施均可正常运行，有电及自来水供应，目前暂未发现安全隐患。内部气温维持在15-25之间，天气恒为阴天。
//流浪者在进入此层级时总是会出现在游乐园的大门外，且任何设备显示的时间均会变为统一的时间，门外表现为一片无限延伸水泥地面，远处可隐约看到高楼一般的建筑物。朝大门外前进5-10米会使流浪者回到初始位置，进入大门后尝试从大门出去会使流浪者在大门处撞到一面看不见的屏障，试图翻墙则会使流浪者传送至大门处。游乐园内部约200平方千米，大门附近的公告牌上印有游乐园内部的地图，纸质地图可在旁边的门卫室找“工作人员”领取。
//游乐园内的游乐设施可以自由使用，“工作人员”会维持秩序，根据游乐园地图反面的“乐园任务”的指引完成任务可得到“游乐星”，“游乐星”可用于与特定建筑内的“工作人员”进行交易。
//目前记录到的任务如下：
//
//乘坐过山车不发出尖叫，可获得10个游乐星。
//在水族馆的水枪射击赛中战胜工作人员，可获得6个游乐星。
//在摩天轮的最高处打开门并站在门口5秒，可获得10个游乐星。
//在“动感街舞”游戏中连续打出10个perfect，可获得5个游乐星。
//通关鬼屋，可获得20个游乐星。
//10分钟内通关镜子迷宫，可获得12个游乐星。
//在射气球项目中射爆所有气球，可获得5个游乐星。
//更多任务待补充……
//建筑物
//前厅的任意一种游乐设施均存在于在该层级内部，且均被描述为“世界上最好玩的”，因此本档案对游乐设施不再赘述，仅记录非游乐设施的建筑。
//
//报刊亭
//外形与前厅报刊亭一致，部分报刊亭内部存在“工作人员”。无人报刊亭可以随意进入，在内部可以找到少量杏仁水、纸质的其它层级资料、游乐园地图和一些书籍。有“工作人员”的报刊亭不可进入，但能与“工作人员”使用“游乐星”进行交易，可交易物品有杏仁水、游乐园地图和糖果
//
//小卖铺
//咱开在这个游乐园的小卖铺内部居住小卖铺老板，可以购买商品。
//
//纪念品商店
//由“工作人员”进行管理的商店，可以用“游乐星”兑换一些作用不明的物品和物资。
//
//补给
//在任意建筑物及游乐设施内部均可找到杏仁水、龙肉罐头等物资，物资一般散落在角落里，需要细心寻找
//
//实体
//除了咱和那个工作人员之外这里好像没别的层级内部仅存在了小卖铺老板和“工作人员”。
//“工作人员”是一种人形实体，外形看上去类似于穿着蓝色工作服、戴着面具的人类，但其衣物疑似为其皮肤，“工作人员”是友善的，目前暂未表现出暴力行为，但即使这样，也不要试图挑衅“工作人员”。“工作人员”有问必答，但在向“工作人员”提出想要离开层级的想法时，“工作人员”均会告诉你“晚上有一场大型活动，请务必留下来参加”
//
//基地、前哨与社区
//本层暂未发现任何社区
//
//入口与出口
//入口
//在Level C-89内找到一张游乐园的门票后打开任意一扇门即可进入Level C-171
//在Level C-444内找到一个滑梯并从上面滑下来即可进入Level C-171
//在Level C-91内找到一个水车进行切出即可来到Level C-171
//出口
//出口正在寻找
//
//随着时间推移，晚上到了
//
//随着夜幕降临，你听到一个广播，“‘大逃杀’游戏即将开始，请各位游客做好准备，该活动是我园最大的活动，每天晚上都会举办，历史悠久，赢得游戏的玩家会获得巨大的奖励哦”
//你感到浑身发凉。
//
// 
//
//生存难度：
//等级 5
//
// 
// 
//大量实体
//Level C-171是后室C层群的第171层。
//
//描述
//Level C-171内部是一个游乐园，所有游乐设施均可正常运行，有电及自来水供应，目前暂未发现安全隐患。昼夜循环为24小时左右内部气温维持在15-25之间白天气温维持在15-25度左右，天气恒为阴天。进入夜晚后，气温会下降至10度左右，此时，流浪者的视野及任何能拍摄的设备显示都会变得模糊
//流浪者在进入此层级时总是会出现在游乐园的大门外，且任何设备显示的时间均会变为统一的时间，门外表现为一片无限延伸水泥地面，远处可隐约看到高楼一般的建筑物。朝大门外前进5-10米会使流浪者回到初始位置，进入大门后尝试从大门出去会使流浪者在大门处撞到一面看不见的屏障，试图翻墙则会使流浪者传送至大门处。游乐园内部约200平方千米，大门附近的公告牌上印有游乐园内部的地图纸质地图可在旁边的门卫室找“工作人员”领取 纸质地图请自行寻找
//
//backrooms1.jpg
//一张照片
//
//游乐园内的游乐设施可以自由使用，“工作人员”会维持秩序，根据纸质地图反面的“乐园任务”的指引完成任务可得到“游乐星”，“游乐星”可用于与特定建筑内的“工作人员”进行交易。请勿靠近游乐设施！
//目前记录到的任务如下：
//
//乘坐过山车不发出尖叫，可获得10个游乐星。
//在水族馆的水枪射击赛中战胜工作人员，可获得6个游乐星。
//在摩天轮的最高处打开门并站在门口5秒，可获得10个游乐星。
//在“动感街舞”游戏中连续打出10个perfect，可获得5个游乐星。
//通关鬼屋，可获得20个游乐星。
//10分钟内通关镜子迷宫，可获得12个游乐星。
//在射气球项目中射爆所有气球，可获得5个游乐星。
//更多任务待补充……
//在游戏中取得胜利
//建筑物
//前厅的任意一种游乐设施均存在于在该层级内部，且均被描述为“世界上最好玩的”，因此本档案对游乐设施不再赘述，仅记录非游乐设施的建筑。
//游乐设施会对流浪者发动攻击，且攻击往往是致命的，本档案仅记录已观察到的攻击方式与其它建筑。
//
//backrooms2.jpg
//一张停止攻击的游乐设施的照片
//
//过山车
//过山车会脱离轨道追逐设施内的流浪者，移动极快且极其灵活，每次击杀一名流浪者后过山车会回到轨道正常运行一圈，此时过山车可以被认为是安全的，但是请勿乘坐。
//
//任意射击项目
//射击项目的枪会以不明方式射出子弹攻击流浪者致命部位，射击精度极高，但任意项目在射击10次后均会停止射击1-2分钟。
//
//摩天轮
//摩天轮的攻击方式不明，但位于最高舱室的流浪者总是会从上面掉下来，因此乘坐摩天轮躲避攻击的提议已被否决
//
//报刊亭
//外形与前厅报刊亭一致，部分报刊亭内部存在“工作人员”。无人报刊亭可以随意进入，在内部可以找到少量杏仁水、纸质的其它层级资料、游乐园地图和一些书籍。有“工作人员”的报刊亭不可进入，但能与“工作人员”使用“游乐星”进行交易，可交易物品有杏仁水、游乐园地图和糖果
//所有报刊亭均变为无人，但出入口均被锁死无法进入。
//
//因不明原因，其它建筑已消失，包括地图也不显示位置。
//
//补给
//在任意建筑物及游乐设施内部均可找到杏仁水、龙肉罐头等物资，物资一般散落在角落里，需要细心寻找
//无
//
//实体
//“工作人员”是一种人形实体，外形看上去类似于穿着蓝色工作服、戴着动物面具的人类，但其衣物疑似为其皮肤，“工作人员”是友善的，目前暂未表现出暴力行为，但即使这样，也不要试图挑衅“工作人员”。“工作人员”有问必答，但在向“工作人员”提出想要离开层级的想法时，“工作人员”均会告诉你“晚上有一场大型活动，请务必留下来参加”
//层级内部仅存在“工作人员”，“工作人员”跟据面具样式的不同行为模式划分为两种。戴着食草类动物面具的“工作人员”会寻找躲藏在暗处的流浪者并暴力驱赶他们，被驱赶的流浪者会被告知“这不符合游戏规则”，戴着食肉类动物面具的工作人员则会手持利器以各种方法攻击流浪者，其造成的伤害往往是致命的。
//
//基地、前哨与社区
//本层暂未发现任何社区
//
//入口与出口
//入口
//在Level C-89内找到一张游乐园的门票后打开任意一扇门即可进入Level C-171
//在Level C-444内找到一个滑梯并从上面滑下来即可进入Level C-171
//在Level C-91内找到一个水车进行切出即可来到Level C-171
//出口
//也许活过一个晚上就能出去吧，但我应该撑不到那时候……
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1171{}