//Level C-185
//评分: 
//+11
//+
//–
//X
// 
//
//生存难度：
// 
// 
// 
//f992fbae4283089d.jpg
//Level C-185内的景象，摄于1921年1月
//
//Level C-185是后室C层群的第185层。
//
//描述：
//原初状态
//在红星建筑队踏足这片土地之前，Level C-185是一个极度荒凉的存在。该层级，该大部分区域都被黑雾包裹，不适宜人类生存，仅有相对较少的区域未被黑雾覆盖，人类可以生存。
//
//该层级气候寒冷，温度常年在-15到-40摄氏度之间。该层级不存在自然光源，永远处于黑暗之中。Level C-185中可供人类生存的区域是一片面积在1000平方公里左右的平原，土壤较为贫瘠，仅有的水源是几个已经冻结的小湖泊。在这一层级，时常可以听到来源不明的窃窃私语声和惨叫声，也有大量的报告证实黑雾中偶尔会出现微弱的闪光。尽管该层级几乎没有实体存在，但总体上该层级是不宜居住的。
//
//建设时期
//1920年4月，红星建筑队第一支队来到了Level C-185，发现该层级的可居区域与黑雾部分可以发生杏仁水蒸气的交换，可以维持湿度和热量的稳定，于是开始对Level C-185的自然环境进行改造。
//
//1921年9月，红星建筑队在Level C-185发射了人造太阳β-16，使Level C-185的气温在七个月后升高到可供人类生存的程度。
//1922年11月，红星建筑队利用已经融化的杏仁水开始种植植物，并安置了一些动物。
//从1940年6月开始，红星建筑队加快了引入动植物的进程，同时扩大了Level C-185中居民点的规模，开始种植粮食作物。
//1950年12月，人造太阳β-16发生爆炸，在该层级驻扎的2000余名工作人员无一生还，Level C-185的建设陷入了停顿。
//1960年1月，红星建筑队发射了人造太阳γ-3，建设重新开始。
//1970年-1999年，红星建筑队陆续建设了农场、养殖场、指挥中心、军训基地、营房等。
//2000年8月，Level C-185遭到了未知力量的入侵，超过1000名战士阵亡，但红星建筑队最终成功保卫了该层级。
//2010年9月，红星建筑队允许其他流浪者进入Level C-185，允许他们在Level C-185定居并从事生产任务。
//2012年1月1日，红星建筑队宣布已经实现了粮食自给，自2012年2月1日起开始向12个流浪者组织低价供给粮食。
//c864aef0b8f894c5.jpg
//Level C-185内正在建设的职员活动中心，远处的红星建筑队第一支队总部大楼清晰可见
//
//新貌
//Level C-185目前年平均气温13℃，年平均降水量391毫米，森林覆盖率71%，已开发约100平方公里。截至2018年，Level C-185共有超过10000人定居，其中前来投靠的流浪者有2880人，各式建筑109座。每年输出粮食80吨，肉类110吨。
//
//目前，已有7718人在建设Level C-185的事业中牺牲。
//
//基地、前哨站和社区：
//红星建筑队第一支队总部
//该基地自1978年建设完毕，占地面积约1100亩，有中央大楼、地下掩蔽室、职员宿舍、通讯站、警备室等建筑，2018年，基地职员超过1500人。
//
//胜利农场
//截至2018年，该基地占地约5000公顷，主要种植玉米、小麦、大麦、水稻等作物，生产所得除满足该层级人类需要外，还低价出售给其他组织。工作人员约800人。该农场还下属养殖场和屠宰厂，每年可生产大量肉类。
//
//第18防卫团团部
//这是于2020年Level C-185遭到入侵后成立的部队，主要任务是驻扎在Level C-185及其入口附近，负责该层级的警备工作，偶尔也会协助流浪者组织清剿一些实体。
//
//入口和出口：
//应红星建筑队的请求，暂不公开该层级的入口和出口，欲进入者请联络居住在Level 3的D.E先生。在您获悉相关信息后，请不要将其传播。
//
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1185{}