//Level C-172
//评分: 
//+23
//+
//–
//X
// 
//
//生存难度：
//等级 5
//
// 
// 
// 
//Level C-172是后室C层群的第172层。
//
//描述
//labyrinth-3207046_1280.jpg
//Level C-172日出期间摄下的照片
//
//Level C-172表现为一个巨大的迷宫。
//迷宫的墙壁由石砖构成，有时布满藤曼与苔藓。迷宫的天空常年处于午夜，迷宫中漆黑一片。在每约100小时会迎来约3小时的日出，光照强度类似于傍晚，然后再次陷入黑暗。日出期间，实体的敌对性会大大减弱。翻越迷宫墙壁被证明可行，但100%会引起实体注意并让你陷入危险。与在前室的迷宫的最大的不同处在于，此层级似乎是以一种非欧几里得的形式展开。当你走出一定范围后再走回你之前所在的位置，你会发现这里的布局完全发生了变化。正因为这个原因，试图效仿“米诺陶迷宫”使用毛线团标记方向的努力将是徒劳的，因为当你顺着毛线返程时，你可能会发现自己的毛线被以某种方式切断了，或毛线跟随迷宫本身而变化，导致其将你引导向了一个不同的地方甚至将你引向危险。
//
//一切试图破坏墙壁的举动都失败了，似乎墙壁本身坚不可摧。迷宫具有一定的危险性。当流浪者进入此层级，他们会来到一个10米x10米x3米的四壁均为布满苔藓的砖墙的房间，四壁上均有一道开口通向迷宫，中央有一喷泉。此房间以及周围方圆1公里是安全的。在方圆一公里外，实体会开始出现，主要为笑魇以及猎犬。实体数量以及迷宫的复杂程度随着离迷宫中心（即初始房间）的距离变远而增大，WIFI强度与离中心的距离成反比，这也是M.E.G.无法探测迷宫边缘的原因之一，或者其根本没有边缘。
//
//然而，离中心房间越远，物资就越丰厚，稀有物资的出现概率也越多，因为不明原因，持有杏仁水可以避免被攻击，但仅有此层级的杏仁水起作用并且仅限于此层级的实体且当杏仁水进入中心房间后其将不再起作用。因此这里一直吸引着探险者探索。在一次严重的实体入侵事件后此层级被标为5级。
//
//-权限通过，欢迎，管理员。
//探险记录#791
//在一名存活的流浪者口中，这名“未知实体”外观为一名人形生物，通体纯黑。这个实体凭空出现在这名流浪者身后的墙壁中，并试图将他拖入一团黑暗。流浪者成功逃脱后向M.E.G.报告了此事。
//
//”我当时正在距离中心约3公里的地方收集物资，想办法甩掉了身后的猎犬，躲入了一个拐角处。我探头向外面看了看，随即听到了身后的悉悉索索声。我还以为是猎犬追了上来，转头一看，根本不是！是一个他*的纯黑的实体，直接从墙里走了出来，拽住我的胳膊就往它出来的地方拖！“
//”你是怎么逃出来的？“
//”我踹了那货一脚就跑，我也不知道拐了多少个弯，跌了一跤，摔在一面墙上。还好进入了Level 0。”
//”你在逃脱时有遇到之前的猎犬吗？“
//”没有……？“
//”我们会继续深入调查。感谢你的参与。“
//记录结束
//不确定是否有多个“影子”。
//因为未知原因，其他层级也出现了此种实体。
//
//- 明智的选择
//一段破损的录音
//我们是“爱琴海”科研所。我们不知道它是否会发现这里，只能祈祷它对代码不感兴趣。
//我们一直以来都在研究这些所谓“影子”，但从未成功。它们总是可以在我们抓捕它们前躲入镜子。更让我们感到蹊跷的是，每当我们试图抓捕时，迷宫中总会飘荡起极浓的雾气扰乱判断。我们一开始以为这是“影子”的能力，但这无法解释为什么它们只在我们试图抓捕时才出现。
//
//枪声，叫喊声
//直到一名探险者从实体手里回来。
//我们发现这是一场天杀的█​̴̫͋͝​̶̡́​̸̛̹̭​̷̬̹̟̄͆‍̷͔̫̎​̴̜͇̥̋̄​̸͍͇̣̉█​̷͓̏̕​̷̧̏͌​̴͓͇̀͛​̶̓̂ͅ‍̵̝̏​̶̨̤̇​̶̳̘̍̽█​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕。
//“快点！它们冲过来了！”
//我们试图从这个探险者嘴里问出些什么。要知道我们之前试图送进去的相机无一不失去了联系。可惜这个探险者一直处于精神错乱的状态。我们几近放弃了，直到实体开始大规模进攻。
//█​̴̫͋͝​̶̡́​̸̛̹̭​̷̬̹̟̄͆‍̷͔̫̎​̴̜͇̥̋̄​̸͍͇̣̉█​̷͓̏̕​̷̧̏͌​̴͓͇̀͛​̶̓̂ͅ‍̵̝̏​̶̨̤̇​̶̳̘̍̽█​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕█​̴̫͋͝​̶̡́​̸̛̹̭​̷̬̹̟̄͆‍̷͔̫̎​̴̜͇̥̋̄​̸͍͇̣̉█​̷͓̏̕​̷̧̏͌​̴͓͇̀͛​̶̓̂ͅ‍̵̝̏​̶̨̤̇​̶̳̘̍̽█​̴̫͋͝​̶̡́​̸̛̹̭​̷̬̹̟̄͆‍̷͔̫̎​̴̜͇̥̋̄​̸͍͇̣̉█​̷͓̏̕​̷̧̏͌​̴͓͇̀͛​̶̓̂ͅ‍̵̝̏​̶̨̤̇​̶̳̘̍̽██​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕开始出现在方圆一公里内，并离中心越来越近。他们自2019.4.25开始对中心房间进攻。我们当然明白他们的意图——杀死那个探险者。
//我们意识到那个探险者知道些什么，重启了█​̴̫͋͝​̶̡́​̸̛̹̭​̷̬̹̟̄͆‍̷͔̫̎​̴̜͇̥̋̄​̸͍͇̣̉█​̷͓̏̕​̷̧̏͌​̴͓͇̀͛​̶̓̂ͅ‍̵̝̏​̶̨̤̇​̶̳̘̍̽██​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕，同时向MEG总部求援。2019.5.6，它们攻入了中心房间。
//
//密集的枪声以及实体的嘶吼
//我们一边疯狂地开火，一边央求那个探险者有什么反应。
//终于，在那群猎犬冲进实验室前，他猛然惊醒，瞪大双眼，叫道：
//“杏​̷͓̏̕​̷̧̏͌​̴͓͇̀͛​̶̓̂ͅ‍̵̝̏​̶̨̤̇​̶̳̘̍̽█​̴̫͋͝​̶̡́​̸̛̹̭​̷̬̹̟̄͆‍̷͔̫̎​̴̜͇̥̋̄​̸͍͇̣̉█​̷͓̏̕​̷̧̏͌​̴͓͇̀͛​̶̓̂ͅ‍̵̝̏​̶̨̤̇​̶̳̘̍̽██​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕！是█​̴̫͋͝​̶̡́​̸̛̹̭​̷̬̹̟̄͆‍̷͔̫̎​̴̜͇̥̋̄​̸͍͇̣̉█​̷͓̏̕​̷̧̏͌​̴͓͇̀͛​̶̓̂ͅ‍̵̝̏​̶̨̤̇​̶̳̘̍̽█​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕殖​̸̡̫̣̊͛̀̿͜​̸̗͌͌̓͒​̵̨̗̻͓̕​̴͍͑‍̶̼̲͔̦̒̔̇͝​̶̬̍͜͝​̷̡͕̅民！有█​̴̫͋͝​̶̡́​̸̛̹̭​̷̬̹̟̄͆‍̷͔̫̎​̴̜͇̥̋̄​̸͍͇̣̉！”
//
//实体的嘶吼，枪声，叫声
//一切都清楚了，其他层级也出现了影子的原因找到了！丰厚的物资是它繁衍或征服的方式！这与我们的猜想一致——“影子”不是实体，是一种工具，和那些实体一样……它在试图通过杏█​̴̫͋͝​̶̡́​̸̛̹̭​̷̬̹̟̄͆‍̷͔̫̎​̴̜͇̥̋̄​̸͍͇̣̉█征服后室或者什么，我们也不知道它是什么，█​̴̫͋͝​̶̡́​̸̛̹̭​̷̬̹̟̄͆‍̷͔̫̎​̴̜͇̥̋̄​̸͍͇̣̉█​̷͓̏̕​̷̧̏͌​̴͓͇̀͛​̶̓̂ͅ‍̵̝̏​̶̨̤̇​̶̳̘̍̽█​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕█​̴̫͋͝​̶̡́​̸̛̹̭​̷̬̹̟̄͆‍̷͔̫̎​̴̜͇̥̋̄​̸͍͇̣̉█​̷͓̏̕​̷̧̏͌​̴͓͇̀͛​̶̓̂ͅ‍̵̝̏​̶̨̤̇​̶̳̘̍̽█​̴̫͋͝​̶̡́​̸̛̹̭​̷̬̹̟̄͆‍̷͔̫̎​̴̜͇̥̋̄​̸͍͇̣̉█​̷͓̏̕​̷̧̏͌​̴͓͇̀͛​̶̓̂ͅ‍̵̝̏​̶̨̤̇​̶̳̘̍̽██​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕或者其他的鬼东西！我们已无法进入水池了，现在只能留下这份录音并期望有人看见。
//
//东西翻到的声音，更密集的枪声以及惨叫
//[略轻的]该死的，录音机！拿回来！
//“淦，好了没？我们撑不了多久了！他们太多了！”
//Level C-172的杏仁水已经流入多个层级，请务必清理它们！并阻止杏█​̴̫͋͝​̶̡́​̸̛̹̭​̷̬̹̟̄͆‍̷͔̫̎​̴̜͇̥̋̄​̸͍͇̣̉█​̷͓̏̕​̷̧̏͌​̴͓͇̀͛​̶̓̂ͅ‍̵̝̏​̶̨̤̇​̶̳̘̍̽以及​̷͓̏̕​̷̧̏͌​̴͓͇̀͛​̶̓̂ͅ‍̵̝̏​̶̨̤̇​̶̳̘̍̽█​̴̫͋͝​̶̡́​̸̛̹̭​̷̬̹̟̄͆‍̷͔̫̎​̴̜͇̥̋̄​̸͍͇̣̉█​̷͓̏̕​̷̧̏͌​̴͓͇̀͛​̶̓̂ͅ‍̵̝̏​̶̨̤̇​̶̳̘̍̽██​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕从这里流出！
//
//“淦，那是什么！ ”
//
//撕裂声，惨叫声
//你阻​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕止不​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕了​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕我​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕的，​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕这​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕将是​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕必然​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕，这将​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕是后​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕室一切​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕混乱​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕秩序的终​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕结
//
//那么，朋友，再见。
//
//嘶嘶嘶……嘶嘶嘶……嘶嘶我会​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕找到​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕你们
//
//​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹́́͒̐这是熵​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕增导致​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕的规​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕律
//
//一切​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕混乱​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕将跌向秩​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕序
//
//我将​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕是唯​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕一的神​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕明
//
//基地，前哨与社区
//M.E.G.“弥诺陶洛斯”前哨基地
//这个前哨位于中心基地
//M.E.G.成员会在这里给流浪者分发收集到的物资
//在2019.5.6的一次实体入侵事件后M.E.G.不再分发物资。
//M.E.G.会帮助探险者探索。
//“爱琴海”科研所
//“弥诺陶洛斯”基地的附属科研所
//专门研究此层级的异常实体&异常性质
//于2019.5.6的一次实体入侵事件中被摧毁
//出口与入口
//入口
//在任意Level卡入一面长有藤曼与苔藓的墙面时有30%的几率被传送进来。
//未经允许进入此层级将在中心房间被M.E.G.遣返。
//违抗命令将被M.E.G.射杀。
//出口
//在Level C-172内入睡即可在Level C-173随机一层的走廊上醒来。
//在墙壁中切出有50%的几率前往任意一个安全层级。
//跳入中心房间中央的水池会来到一个安全层级。
//- 没错
//想必​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕你已经看​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕过前面的录​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕音了吧。
//
//你以为我​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕真的没看见​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕吗？
//
//- 可笑
//我只不​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕过是懒​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕得管罢了。
//
//或​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕者说，​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕我存心​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕让你们看​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕见了。
//
//因为​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕你们根本做不​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕了什么。
//
//- 哈哈。
//你以为这​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕个曝光​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕就可以阻止我​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕吗？
//
//你们只​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕能感受这什么​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕也不能做的绝​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕望。
//
//我的宠​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕物们可不是只能通过​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕杏仁水繁殖。
//
//- 你什么也不能做
//你要怎么才​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕可以打败死由者组​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕成的军团？
//
//我甚至​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕不屑于直接​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕获取​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕你的个人信息。
//
//我们会全力以赴！你们这帮恶心的怪物会被永远封锁在迷宫里！
//
//可是你们​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕连中心房间​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕都没守住。
//
//我们后来夺回来了……
//
//哈……哈…​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕…可代价是​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕什么？
//
//这至少证明你们不是无敌的……
//
//哈……我将是​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕唯一的神​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕明……
//
//- 呵呵。
//看看吧​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕……人类可悲​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕的好奇心……连M.E.G.的警告​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕也熟视无睹……
//
//屏幕​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕外的人，对​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕吧？
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//- 权限通过。欢迎，管理员。
//中心房间已被夺回
//Time：2019.5.3
//From：Clay Hygik
//To：监督者A
//
//我们在苦战后夺回了Level C-172的中心房间。我们本以为“爱琴海”科研所留下的设备和科研结果已经全部被摧毁了———事实上几乎确实是这样。然而，我们找到了一件对当前战局至关重要的东西———从影子状态恢复的幸存者的血清。Anderson博士（也就是留下最终音频资料的英雄）在实体闯入研究室的最终时刻将他锁在了保险箱里。这项资料会彻底扭转战局。在此，谨以对Anderson博士以及所有牺牲在Level C-172的战士的最高敬意。另外，我希望原Level C-172文档中关于这个事件的部分加上权限锁以防引发恐慌。还有，关于流出此层级的杏仁水已经被编号为172杏仁水，然而现在市场上仍有大量172杏仁水未处理。望知晓。
//
//
//
//批准
//Time：2019.5.4
//From：监督者A
//To：Clay Hygik
//
//你的提议已被批准。一旦此事被曝光将造成极其恶劣的影响。你们的工作已被调至最高优先级并把安全性调至绝密。希望你们成功。关于172杏仁水我们正在讨论对策。
//
//
//
//Re：批准
//Time：2019.5.4
//From：Clay Hygik
//To：监督者A
//感谢！我相信我们很快就可以战胜它们！
//
//
//
//有进展了！
//Time：2019.5.26
//From：Clay Hygik
//To：监督者A
//
//还记得我之前和你说的血清吗？我们成功用它提取出了一些抗体，并制备了疫苗！生物体实验已宣告成功，临床试验也在筹备中！量产很快就可以实现了！
//Tips：最近实体的进攻愈发频繁了，能不能多派遣些部队来？
//
//
//
//Re：有进展了！
//Time：2019.5.27
//From：监督者A
//To：Clay Hygik
//
//批准。
//
//
//
//成功了！
//Time：2019.6.4
//From：Clay Hygik
//To：监督者A
//
//临床试验成功了！与此同时，我们也给出了量产疫苗的方法。而且，这个疫苗可以直接溶解在杏仁水中口服。这对推广有很大的好处！望批准！
//Tips：把已经感染“影子”的受害者治愈已被证明不可能。他们在转化完成后就已经失去了实体。
//
//
//
//Re：成功了！
//Time：2019.6.4
//From：监督者A
//To：Clay Hygik
//
//很好!你们的方案已投入量产，我们对外宣称将对现有的杏仁水进行质检以防含有一种新型病毒，与此同时，我们在市场上大批量投放了混合有疫苗的杏仁水。现在172杏仁水的回收率达到了87%，疫苗接种率达到了94%。一举两得。
//
//
//
//对抗“影子”的方法
//Time：2019.6.10
//From：Clay Hygik
//To：监督者A
//
//这个结果其实并不是我们预期到的——然而确实极其有效。是这样的：我们在尝试通过调配不同比例的杏仁水以让疫苗更大地发挥功效。然而，一名研究员使用了172杏仁水。即可我们便发现它不同寻常，我们把溶液喂给了感染了“影子”的小鼠。即刻，小鼠便表现得极为痛苦并在数分钟后死亡。随后我们又进行了一系列测试，并发现这种溶液可以不同程度的伤害。大部分情况下，这同时导致“影子”接受物理攻击。看来我们囤积的172杏仁水有用处了。
//
//
//
//Re：对抗“影子”的方法
//Time：2019.6.10
//From：监督者A
//To：Clay Hygik
//
//不敢置信我们在如此短的时间内就取得了如此之多的进展。然而，虽然此个意外发现振奋人心，研究依然要加倍谨慎。我们不知道下一次的后果是另一个重大发现还是一次毁灭性的灾难。还有，关于你们新的发现，同样不能怠慢。对于一个极其危险的病毒的武器化必须谨慎再谨慎，直到你们确定它没有副作用为止。
//
//
//
//请求批准
//Time: 2019.6.20
//From：Clay Hygik
//To：监督者A
//
//经过一系列的改良与试验,我们已经得到了可以装在水枪中发射的喷雾——只需要喷洒到感染者身上即可使其可以通过物理手段伤害,要是喷得恰到好处还可以直接致死。并且，它还可以使此层级内的实体的皮肤强度大大减弱至可以用普通武器击杀。我们已确认这种喷雾无副作用,实体对采集172杏仁水的阻拦也更让我们坚信这点。我们把这种喷雾命名为172喷雾以方便记忆。希望您可以批准172喷雾投入使用。
//
//
//
//Re: 请求批准
//Time: 2019.6.20
//From：监督者A
//To：Clay Hygik
//
//如果真如你所说的没有副作用,我很乐意让他尽快投入使用。
//
//
//
//棘手的问题
//Time: 2019.7.3
//From：Clay Hygik
//To：监督者A
//
//我想我们出现了另一个除了“影子”之外的棘手问题。还记得Anderson博士留下的音频的结尾吗？我想它又来了。我们的一个资源采集小组彻底失去了联系。附件里放了他们最后传回的录音。
//附件 »
//
//嘿，看！那里有几听罐装龙肉！
//你去捡一下吧。
//哈，172杏仁水……数量还不少！谁过来帮个忙……
//我听到附近有猎犬的声音，我们最好快点。
//
//嗨​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕，你​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕们好​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕啊。
//
//什么东西?!
//
//别那​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕么让​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕人​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕扫兴……
//
//尖叫、枪声。
//什么?!!快开火！
//它在哪？我看不见它了！
//
//喊叫声，枪声
//擦！什么东西！
//
//别激​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕动，你​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕们的录​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕音设​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕备开​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕着吧，我​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕让你们传​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕个话。
//
//喷雾呢？给我 ！
//
//惨叫
//你们就​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕是用这个​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕杀死我​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕的宠物的吗​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕……
//
//枪声
//够了…​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕…我是​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕来让你们​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕传话​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕的。
//
//尖叫，而后寂静
//不​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕必再作​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕无谓的抵​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕抗。
//
//只要​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕我想，随时​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕可以捏死你们这​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕些蝼蚁​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕。
//
//加入光​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕荣的进​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕化。
//
//我​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕们将成为​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕一体，成为这​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕个混乱世​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕界的神。
//
//去死吧！为了人类的生存！为了M.E.G.！！
//
//短暂的爆炸声，麦克风损坏，信号中断。
//
//
//尽快调查
//Time: 2019.6.20
//From：监督者A
//To：Clay Hygik
//
//我已了解。尽快调查，找出对策，减少伤亡。
//永远记住：只有人类存在，意义才存在。只有我们齐心协力，才能战胜地狱。1
//
//
//
//已全面进入战备状态
//Time: 2020.1.25
//From：Clay Hygik
//To：监督者A
//
//很抱歉隔了那么久才再次发送邮件。在前厅，今天应该是新年了吧……听说前厅也出现了一种病毒，叫新冠病毒……真巧啊，是不是？可惜，前厅的医护人员可以收到无上的光荣，而我们……当然，不是说他们不好，他们配得上这光荣，只是……算了，不谈这些了。实体的进攻已经越来越频繁了，我们在储备了足够的172喷雾后停止了资源采集活动——目前足够使用至少5个月了——并进入了战备状态。迷宫对我们似乎越来越富有恶意了。它至今没有再次出现，我们已经制定了多个方案以应对不时之需。不用担心我和其他人的精神状态，他们士气都很高，刚刚还在举办小型新年庆祝会呢。
//
//
//
//Re：已全面进入战备状态
//Time: 2020.1.26
//From：监督者A
//To：Clay Hygik
//
//很高兴听到你这么说。祝你们好运。
//
//
//
//紧急
//Time: 2020.2.17
//From：Clay Hygik
//To：监督者A
//
//实体￥%&%大举进%&攻！我们%￥#…&需要支#&…%援！
//
//
//
//坚持住！
//Time: 2020.2.17
//From：监督者A
//To：Clay Hygik
//
//增援会在3小时内到达！坚持住！
//
//
//
//不要过来！
//Time: 2020.2.17
//From：Clay Hygik
//To：监督者A
//
//不要过来！不要过来！不要过来！请撤出增援！
//
//
//
//Re：不要过来！
//Time: 2020.2.17
//From：监督者A
//To：Clay Hygik
//
//发生什么了？Hygik？是你在说话吗？为什么撤出增援?
//
//
//
//1
//Time: 2020.2.17
//From：Clay Hygik
//To：监督者A
//
//它来了！所有对策失效！不要徒增伤亡！它不吃这套！请让增援在层级外待命！
//
//
//
//Re：1
//Time: 2020.2.17
//From：监督者A
//To：Clay Hygik
//
//如你所说！你那边怎么样了？
//
//
//
//1
//Time: 2020.2.17
//From：Clay Hygik
//To：监督者A
//
//我们已经暂时击退了实体，但它们随时可能卷土重来。以防万一，我们还是用录音设备实时通话吧。
//
//
//
//
//
//录音已开始
//喂，听得见吗？我是Clay Higik。
//
//在那些实体到来之前……我先聊聊我自己的故事。
//
//我在前厅，有一个……喜欢的人。但是，我一直没能找到机会向她表露心意。在大学毕业那天，我下定了决心，带着我的情书，走向了她的教室。途中……我看到了一只陷入地板的小鸟。正当我上前一看究竟时……我来到了这个……人间炼狱。很经典的故事，对吧。我很后悔，不是后悔去递情书，而是没有早递。那是我终身的遗憾。
//
//这次行动，多半也是九死一生了。如果你遇到了她，请把这个录音放给她听。她叫█​̴█​̴█​̴。
//
//他们过来了！
//
//哈哈，看来我要步前人的后尘了。
//
//
//枪声，喊叫
//
//
//好​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕久不见​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕啊，Clay​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕ Hygik？
//
//我想我以前没见过你。
//
//但我见​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕过你。
//
//我们直入正题吧。
//
//我想……​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕你为什么不接受​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕我的邀​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕请呢？
//
//我们明明​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕可以成为​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕一个整体，像蜂群​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕一样用集体​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕思考。你的加入将使​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕我们如虎​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕添翼
//
//但你知道，蜂群没有成为高级文明，而人类成为了。
//
//那是​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕君主的​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕无能。我​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕保证我们可​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕以称霸这​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕里……
//
//你现在有​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕两种选择：加入光​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕荣的进化​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕，或者……像地​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕上的那些尸​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕体一样，恐惧而​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕痛苦的死​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕去。
//
//你杀了他们。
//
//是的。他​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕们是顽固不化​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕的败类。所以……你的选​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕择是……？
//
//够了！
//玻璃破碎声，重物落地声
//
//你觉得​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕我会被杏仁水​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕伤害吗？
//
//你确定？
//
//等​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕等……你洒的是​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕什么？
//
//没事，只是把你自己的杏仁水还给你罢了。
//
//自动消毒程序开启，请无关人员带好面具并撤离。
//
//不！你做​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕了什​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕么！让我出​̵̭̥̠̩͚̃͊̚͜͝​̵̡̛̹͛͗̆͘ͅ​̶̡̠̰̮̲̬̅̒̎̆̚​̸͓̩̭̼̼̇́́̈́̆̃‍̸̢͍̯̃​̴̨͕̯̹͕́́͒̐​̷̻̰̙̪̦̬̏̓̅́̕去！
//
//你TM给我去SPA！
//枪响
//
//
//
//
//
//
//
//他在那里！
//
//快！把他抬出去！
//
//喂！Hygik！醒醒！
//
//那里有个录音机！
//录音结束
//
//M.E.G.报告
//M.E.G.导火索小队于2020.2.17成功将Clay Hygik博士从Level C-172救出，并及时注射了疫苗。Level C-172的层级意识已被证明被彻底杀死。
//
//看来Hygik的遗嘱得让他亲自实现了。
//
//我听说过一句话，让人在极度恐惧的情况下会激发出无穷的潜能，恐惧会成为愤怒与智慧，对家庭，爱人，朋友的情感是梦魇的梦魇。
//
//——监督者A
//
//作者信息
//« Level C-171 | Level C-172 | Level C-173 »
//
//脚注
//1. 节选自
//the Jotaro
//the Jotaro
//所作的你应当知晓的理念——关于The M.E.G.
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1172{}