//Level C-189
//评分: 
//+15
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
// 
//介稳定
//实体藏匿C189-1.jpg
//Level C-189中一张手术室的照片。
//
//Level C-189是后室C层群的第189层。
//
//描述
//Level C-189是一座处于凌晨十分的医院，其特点是“白色”占据了大部分空间，导致整个医院看起来透露着一种光洁如新的诡异感。外部的昼夜循环停止，内部的许多房间也停止了时间的流动，具体表现为：摆放在铁柜或保险箱内的药剂和化学用品即使暴露在空气中，也不会挥发或受潮凝结；许多仪器即使通电，也无法运转甚至是启动。由于本层级对探险队员似乎有一种无形的压迫感，因此匆忙撤离的探险队并未带来更多有价值的信息。
//
//即使携带了各类探路设施和位置标记，在这座非欧几里得空间医院内迷路仍然是十分高发的事件。许多走廊连接极其诡异，有时上下楼梯可能会跨越数米高，一个大厅内连接这数百扇门；有时会出现拐进一个走廊，身后的回路变成墙壁，或者本来是死胡同的病房，在下一次打开门后又变为两端通透的过道等。但由于本层级并未出现大面积的“地震”、“地形转变”等空间高度破坏行为，其稳定性尚且不能达到完全不稳定的标准。
//
//值得注意的是，这些房间虽然主色调基本为白色，但其装修风格却不能完全统一。有时地板使用瓷砖进行拼贴，有时是一整块胶贴，有时则是一种白色的木制结构。甚至一些在抽屉里发现的未开封手术器具也呈现出完全不同的样式和类型。因此，通过推测可知，也许此地是由多个空间通过统一化转换又经历粗略的拼接以后生成的。
//
//实体
//处于该层级内部的这种实体似乎极其避讳出现在探险队面前，无论是录像机还是照片都只能记录下它们模糊的身影，它们一般会在楼道和走廊里穿梭，或者是在无法破坏的外窗上掠过。但可以确定的是，它们体型矮小、运动速度极快且经常单独行动1，因此无法确定其危险性。
//
//C189-2.jpg
//这个通道的拐角出现过那个神秘的实体。
//
//基地、前哨与社区
//由于恶劣的空间结构环境，本层级无法创立任何基地、前哨或社区。
//入口与出口
//入口
//从Level C-378中的圣诞树中切出可以到达本层级。
//在Level 5中找到一扇白色铁门，进入即可到达本层级。
//更多入口尚待探查。
//出口
//走到地下室，地下室总会出现一扇白色铁门，走出去即可到达Level C-122。
//暂未发现更多出口。
//作者信息
//« Level C-188 | Level C-189 | Level C-190 »
//
//Footnotes
//1. 最近的一次探索任务当中，获得了捕捉到它们的照片140余张。探险队员用余光瞟到它们高速躲藏的次数更是不计其数。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1189{}