//Level C-162
//评分: 
//+27
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//XopHZYVbuvwSkLF.jpg
//Level C-162的照片，图中的钢琴正在演奏。
//
//Level C-162是后室层群C的第162层。
//
//描述：
//Level C-162是一个有限的层级，外貌类似一间破损的孤儿院，推测其的大小超过了百万公里。
//Level C-162中有着微弱的光芒，该层级的一些走廊中有着一台钢琴，有时钢琴的琴键会自动落下，就像是在被一双无形的手弹奏着，然而通常在弹奏到一半时演奏便会被来源未知的孩童笑声打断。
//一些狭小的房间会有着许多破损的纺织玩具，一些玩具里寄宿着以类似布料的形态生活的拟态昆虫，玩具中有时会混杂着红色的发条玩具熊，它会在被触碰时直接自爆。
//
//万圣节该结束了，奶奶要休息了，你能帮奶奶赶走吵闹的孩子们吗？
//
//你可以在Level C-162的一些角落看到一颗糖果，当你靠近它时它便会消失，随后一颗新的糖果便会出现在离你不远的地方，跟随糖果行走一段时间通常会让你到达一扇白色的木门前。敲击木门并静候几分钟，你身上的口袋与容器（如果你有的话）便会被凭空出现的糖果填满，这种事件似乎在24小时内只能触发一次。
//尽管任何打开或破坏此门的方式都以失败告终了，但经常有人报告称听到此门后面有人在说话。
//
//基地，前哨和社区
//讨糖人
//由一群流浪者组成，他们会收集该层级的糖果资源并以此对外交易。几名M.E.G.成员为研究该层级以特殊形态生存的拟态昆虫而加入了他们。他们对其他来到Level C-162的流浪者十分友好，但不允许其他人在该层级获取糖果。
//
//奶奶对电子产品不大在行，只要你轻轻按一下，就能帮我打开门上的电子锁哟。
//
//入口和出口
//入口
//在Level C-126的164号车厢切出会让你到达该层级。
//在Level C-36进入一扇老旧的门会让你到达该层级。
//快点按吧，好孩子，奶奶会给你烤小甜饼喔。
//
//出口
//找到并开启一台破损的电视机会让你到达Level 104。
//试图损坏该层级中的钢琴会把你传送至Level C-141。
//切入地面会让你到达Level C-143。
// 
//
//生存难度：
// 
// 死区
// 
//
//
//
//
//
//乖孩子。
//
//
//
//
//
//
//
//
//
//
//
//
//
//
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1162{}