//Level C-186
//评分: 
//+20
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
//安全
//稳定
//早安
//Level C-186是后室C层群的第186层。每次仅可一名流浪者进入。
//
//d97402f2a850b659.jpeg
//据多名流浪者描述拼凑出的Level C-186图像
//
//描述
//Level C-186表现为一间10平方米左右的卧室，内饰包括一张单人床、一个床头桌、一扇百叶窗等。
//
//切入该层级的流浪者无一例外的都以各种姿势躺在层级内唯一的单人床上，以平躺为主。
//
//该层级中的重力约为前厅地球重力的2～3倍，在这样的重力环境下，流浪者无法起身或移动肢体。仅可通过转动眼球观察周围环境。
//
//Level C-186中的光照亮度及声音分贝高于常态。任何光亮和声音都有可能使流浪者心情异常暴躁。
//
//829e91ef79ef68aa.jpeg
//层级中的闹钟
//
//据报告，层级内唯一的光源来自一道从窗口射入的白光，亮度与角度类似于清晨的阳光。但因光线过于刺眼，至今仍无法观察到窗外景象。床头桌上摆放有一个闹钟，闹钟具体显示的时间并不统一，取决于流浪者在前厅的日常起床时间1。闹钟本身会持续响起高分贝且有规律的铃声，铃声会使流浪者焦躁无比，但流浪者却因重力而无法触碰并关闭闹钟。
//
//流浪者可以将头部缩入单人床上的被褥来躲避刺眼的光线及刺耳的声响。头部处在被褥中时，突如其来的强烈困意将促使流浪者闭眼并陷入昏睡2。随着昏睡的时间流逝，流浪者将逐渐遗忘一切记忆，并产生一种“主观记忆”，表现为：
//
//流浪者关闭了闹钟，从床上坐起并穿戴整理衣物
//离开单人床并通过唯一的一扇木门离开了Level C-186
//在存在水池内随机安全层级中洗漱
//在存在桌椅的随机安全层级中进食
//进行曾经最熟悉的工作或其他日常任务
//“主观记忆”结束后流浪者会从单人床上惊醒并在其意识到所谓“主观记忆”并未真实发生后切出Level C-186。
//
//Level C-186内的时间相较于其他层级慢2～3倍。值得一提的是，无论流浪者沉睡多久，在其清醒后均称自己“只睡了5分钟”，实际上通过其他层级与Level C-186的时差判断，这些流浪者层级内的昏睡时间短则30分钟，长则2小时。
//
//基地、前哨与社区
//该层级不存在任何已知的基地、前哨和社区。
//
//入口与出口
//入口
//在任意层级内入睡均有一定的概率在Level C-186中醒来。
//将Level C-113中一个闹钟塞入口中3。
//在Level C-233中飞向一座钟楼，并在即将撞击表盘时会从Level C-186的单人床上惊醒。
//出口
//“主观记忆”结束后将切入Level C-29。
//脑中循环播放任意一首快节奏的电子音乐将切入Level C-460。
//躺在床上大声哭闹将随单人床一齐切入Level 11一人口稠密区域，此后Level C-186中的单人床将重置。
//作者信息
//« Level C-185 | Level C-186 | Level C-187 »
//
//Footnotes
//1. 通常为5:30-7:15am不等
//2. 当然，这种困意仍然是可抗拒的
//3. 基于Level C-113的特性，该闹钟会随流浪者进入Level C-186，进而导致流浪者无法及时从口中取出闹钟，使流浪者口腔遭受严重伤害。故不建议流浪者采取该方法进入Level C-186
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1186{}