//Level C-199
//评分: 
//+72
//+
//–
//X
// 
//
//生存难度：
// 
// 
// 
//RMpkuDNqKGoVH8C.jpg
//Level C-199的厨房。
//
//Level C-199是后室C层群的第199层。
//
//描述：
//Level C-199的主要部分是一个老旧的住宅，其内部布局类似于中国乡下的建筑。住宅共有三层，均有水电供应。一楼由餐厅、一个厨房、楼梯间和庭院组成。该层级的时间恒定在下午三点至五点左右，且没有任何实体。该层级具有类似于Level 12的特性，所有有关于该层级的照片都会看起来像加上了一层滤镜，使其变得令人感到怀念起来。
//
//进入Level C-199后，流浪者根据其经历和性格会对环境产生不同的感觉。大多数流浪者会对此层级感到一股强大的既视感与熟悉感，即使他们从来没有来到过这个层级。这些流浪者中的一部分会对此地产生迷恋，但依然会同意离开，并在离开后产生一种依依不舍的情绪。这种情绪只会持续约一个星期左右，之后便会消失。少部分流浪者会对该层级感到厌烦，并立刻离开该层级。
//
//同时进入Level C-199的人数似乎是有限制的，一般为三个。如果尝试进入该层级的流浪者中其中两个人是其他人的父母，则该层最多可以同时进入五人。流浪者在此驻留的时间也是有限的，在此驻留的时间越长，流浪者就越是有一种想要离开的情绪，即使他们并不讨厌留在这个地方。该层级在有流浪者驻留时任何人都无法进入该层级。
//
//一楼的地面为石质，上面布有少许小裂痕，似乎是因为冷热骤变导致的，不过有报告称注视裂痕会产生想要触摸裂痕的感觉，注视的越久这种感觉就更强烈。触摸裂痕即可消除这种感觉，且不会带来除此以外的任何后果。餐厅中央有一张餐桌和数只椅子。椅子的数量似乎会根据进入该层的流浪者数量变化，且总是会比流浪者总数多出两只，目前尚不知道为什么会产生这种情况。
//
//厨房中有油烟机、煤气灶等设备与砧板、菜刀等物品，也会生成米、蔬菜、肉类等食物，以及小米辣、醋、酱油等各种调味料。煤气灶旁有一扇窗户，会发出白色的阳光，但无法透过玻璃看到任何东西。食物生成的数量同样会根据进入该层级的流浪者的人数变化，且种类会符合每个人的喜好。将从厨房中已有或生成的物品带出该层级是不可能的，因为这种尝试会使人产生无法忍受的巨大的罪恶感，并因此立刻将原先试图带走的物品放回原处。使用完毕物品后没有将其放回原处不会产生后果，且下一次进入该层级时物品会回到原处，就像没有使用过一样。如果上一次使用砧板和菜刀后没有清洗，则下一次进入该层级时用砧板和菜刀处理的食物会带有上一次使用时处理的食物的味道，这种效果产生后不会持续至第三次进入该层级。
//
//楼梯间的光线较为黯淡，但仍可看清楼梯本身。除此之外，楼梯间底部还有一扇门，穿过它可以到达Level 189，且到达后仍可由此返回Level C-199。由于Level 189为一系列卫生间组成的层级，因此推断这扇门原本通向的是住宅的卫生间，但目前尚不知道这扇门为什么会通向Level 189。如果在Level C-199逗留的流浪者全部由此离开，则门会在所有人走出后关上并无法打开，且不能强行破开。反之，若离开的流浪者并不是逗留该层级的所有人员，则门将可以打开。1由楼梯间可以来到二楼。
//
//aedtKLgmICSUn1y.jpg
//卧室中的其中一个。
//
//二楼有两个房间和一个阳台，其中通往阳台的门无法打开，强行破开的尝试均以失败告终。两个房间中，一个布置有一张双人床、一个衣柜以及两个床头柜，另一个布置有两张单人床和一个柜子。衣柜、床头柜与柜子通常是空的，且流浪者放在里面的物品会在所有流浪者离开该层后以未知方式回到流浪者身上。物品回到流浪者身边的位置不定，从流浪者的背包到衣服口袋均有可能。2所有床均盖有一条被子和两个枕头，据报告称躺在上面“会有一种极度舒适的感觉”，但目前关于床垫使用的材料没有任何已知信息。
//
//在二楼的楼梯口的天花板有一个通往三楼的入口。由于[数据丢失]，目前无法进入三楼，且不建议尝试进入三楼。
//
//穿过一楼的大门可以到达庭院。照射到庭院的阳光使这个区域热到几乎无法停留，因此无法对这个区域进行更多研究。庭院有一口井，可以打捞到井水，但由于庭院的温度，目前没有办法一次打捞大量井水。目前打捞水量的最多记录为一升。井水具有杏仁水的功效，其他方面基本与前厅的纯净水相同。不知为何，井中的井水似乎可以自行补充，且不会因为高温而蒸发或沸腾，而在打捞后这种特性将会消失。庭院的墙壁似乎与住宅一楼的地面材质相同，但由于温度无法对其进行检测。庭院还有一个与墙壁等高的铁栅栏门，透过门可以看到外面种植有玉米的农田，但不能看到别的景物。庭院也是Level C-199为数不多能够看到外部景色的地方。由于庭院的温度，尝试打开铁栅栏门会立刻导致烫伤，因此不建议也无法探索外部环境。不知为何，庭院的高温并不会影响到住宅内部。
//
//基地，前哨站与社区：
//由于Level C-199的性质，目前该层级没有已知的基地或社区。
//
//入口与出口：
//入口
//该层级可以通过Level 11的一扇较为隐蔽的门进入。门的位置和样貌会不断变化，但其上总会一块写有“回家吧”的蓝色牌子。由于描述中提到的特性，该层级同样可以通过Level 189进入。
//
//出口
//可以通过楼梯间的一扇门从该层级进入Level 189，也可以通过跳入庭院的井中来到Level 7。
//
//躲在二楼卧室的衣柜中三分钟可以来到Level 974。
//在卧室的隐秘处（如床底下）有时能找到一个八音盒，转动它可以来到Level C-198。
//
//翻出庭院墙壁的行为将使流浪者到达Level C-199.5。
//
//+ 作者页面
//« Level C-198 | Level C-199 | Level C-200 »
//
//脚注
//1. 除了此次逗留该层级的流浪者以外的人员均无法从Level 189打开这扇门。若门已经是打开状态则外来人员可以进入，但由于Level C-199的性质，最多只有一个人能够由此进入该层级。在这个人进入后，门将会快速关上，此后除了此前由此离开Level C-199的人员以外任何人都不能打开这扇门。
//2. 如果所有流浪者离开Level C-199时物品所属的流浪者身上没有任何能够储存物品的地方，则物品会出现在流浪者的同伴身上。如果所有流浪者的身上均无法储存物品，留在衣柜与床头柜的物品会直接消失。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1199{}