//Level C-154
//评分: 
//+13
//+
//–
//X
// 
//
//生存难度：
//等级 2
//
// 
// 
//无实体
//Level C-154是后室C层群的第154层。
//
//qAY8j1.jpg
//由佚名艺术家创作的关于该层级的艺术描绘
//
//描述
//此处大致为一个非欧几里得的无限矿脉区域，表层几乎全部被金刚石覆盖，有稀疏的泥土和岩石层，但大量的金刚石裸露在空气中，深层模糊地可看到一些黄色矿物。昼夜循环和四季循环（根据气温推测，存在类似于四季循环的变化）与前厅一致，降水时间和降水量均随机，但晴天的概率较大。其中设置了多个废弃/已被摧毁的采矿站点，这些站点均由未知组织建造，M.E.G.人员发现了此层级后占领了采矿站点。但其中只有进入该层级时的总站点目前设施完好。
//
//如果您想查看任何一个站点记录，请点击下方文档。
//
//正在录入信息…..
//…..
//…..
//…..
//…..
//
//
//
//隐藏 总站点
//总站点
//简介与第一事项：该采矿站点占地约四平方公里，拥有综合办公楼、钻井和紧急隔离室。其余地带为岩石地带空置区域。该站点负责采集矿脉中的钻石，且仅采集钻石，不采集其他矿物。若您在钻井处发现并且直视了黄色晶矿（NCC-10 晶矿）请在二十四小时内将其丢到矿坑中并进入紧急隔离室，切勿私自藏有该矿石或自行销毁，也请配合进入紧急隔离室，将晶矿丢进矿坑是最好的销毁方式。
//
//qAxQg0.jpg
//机器维护通道
//
//综合办公楼介绍：此建筑占地一平方公里，共有六层，其中一到五层可自由出入。而地下一层不允许进入，楼层功能大致如下——
//
//第一层——接待处，切入该层级的位置。
//第二至第三层——综合办公楼层——文书处理，文职休息处与生活区域，配套设施齐全。
//第四层——运输层，有直连矿场的吊车，此处是已知唯一可以切出此层级的地方。
//第五层——M.E.G.综合处理室层——原本是空房间，M.E.G.切入后为了方便管理新增的地点。
//此外，地下一层不允许进入只是因为其中某些房间拥有大量的NCC-10晶矿，危险程度较高，并没有任何特殊。请不要对此处拥有过多的好奇心。
//
//钻井：一个大型自动化设施，占地一平方千米。用于开采钻石，只有岗哨和机器维护通道可以进入，其它区域禁止未授权入内，因为同样含有大量的NCC-10晶体。
//
//紧急隔离室：此处占地一平方千米，用于隔离有接触过NCC-10晶体的人员，此处拥有72个隔离房间，早在M.E.G.占领该层级时，该设施就已经出现，此外，此处是唯一能够获得食物与水源的地方，拥有大量的泥土覆盖和前厅常见家畜。
//
//该站点为M.E.G.提供金刚石矿产。
//
//
//
//
//
//隐藏 其他站点记录
//请稍后……
//存取信息完成！
//
//qEZ4tP.jpg
//第一站点门内景象
//
//
//
//
//
//第一站点：此站点只有一扇门完好无损，门上刻着希伯来语的“地狱”。其余部分全部被外力摧毁，最好不要打开第一站点的门，打开了也请勿入内，打开后的景象如下右图所示。
//
//第二站点：此站点与总站点类似，似乎被用来采集NCC-10晶矿，但是其中人员已经全部死亡，只有大量的血迹和有严重外伤痕迹、腐烂程度不一的尸体，尸体的身份和信息均不明；在该站点类似于总站点接待处的地点墙面上用血液书写了几段话——
//
//Selbstverschuldet.【德语：自作自受】
//こうなることは分かっていた【日语：我早知道会发生这种情况】
//Maman, je veux rentrer à la maison.【法语：妈妈，我想回家】
//因得果报【中文：因得果报】
//
//M.E.G.人员本想清理其中的尸体，但其中的NCC-10晶矿过多，故彻底废弃此站点。
//第三站点：该站点似乎曾遭遇严重炮击，有大量腐烂程度不一的尸块和人类骨骼碎块。其余只是一些没用的瓦砾和碎石，此处透过金刚石层可模糊看见大量的黄色矿物。
//
//
//
//
//
//隐藏 NCC-10
//qE3T54.jpg
//佚名艺术家关于该晶体的艺术创作
//
//晶体简述：该晶体的晶体属性如下——
//
//斜方晶系；浅黄色颜色；晶体习性为三向等长、放射状；硬度莫氏硬度10级1；晶体断口贝壳状；光泽为玻璃光泽；折射率未知；化学成分未知；透明度（0.03mm）较差。
//该晶体具有特殊精神影响，直视晶体、观看太长时间的该晶体照片或直接触摸晶体会在24小时后对此种晶体产生强烈的占有欲望，并会使用各种手段试图取得该晶体和使其他人远离这些晶体——包括极端暴力手段。由于该晶体的种种异常性质，该晶体的具体性质无法准确了解。但通过艺术创作媒介保存的该晶体信息和透过金刚石观察则不会带有异常性质——但任何数据视觉媒介记录艺术品或晶矿本身图片都会产生模糊的噪点。
//
//> 后记文件
//
//
//基地、前哨与社区
//M.E.G.采矿站管理处
//负责管理总站点的矿物开采时间、数据记录收集、总站点人员生活管理等。
//入口与出口
//入口
//在Level 11墙壁上画一个钻石图案（只要你觉得它是钻石），然后用头撞上去，感觉到疼痛后闭眼就会被传送到此层级。
//出口
//通过此层级的总站点里的“运输层”传送回你在Level 11画的图案处。
//作者信息
//« Level C-153 | Level C-154 | Level C-155 »
//
//Footnotes
//1. 与钻石相当
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1154{}