//Level C-198
//评分: 
//+16
//+
//–
//X
// 
//
//生存难度：
//等级 2
//
//不安全
//不稳定
//实体绝迹c198
//由一名名为阿尔布森的流浪者绘制的Level C-198的风车群落。
//
//Level C-198是后室C层群的198层。
//
//描述：
//C-198是一个巨大的拥有白炽灯光的木质构造的房间，并由三个区域构成，分别是风车群落，游乐园，镜面平原。所有试图拍摄记录的方式均以失败告终。
//
//风车群落
//此区域有着如同孩童玩具一样的木质房屋，地面会有很多均匀的宽度为五厘米的垂直裂隙雕刻。大部分流浪者最初会出现在这个区域，大部分房屋在上面看到很多小孩子用黑笔画的花纹。这些房间大部分都拥有风车以及水车，但它们并不自主旋转，但是可以推动。
//
//一些房屋缺失门窗或者只是雕刻出来的窗户，少数看到的木质房屋靠近才能发现它只是一堵墙，里面通常一片黑暗并且有一股灰尘味，里面有时候能找到有发条的木质钢琴以及木质留声机的房间，通常存在这两样物件的房间里会有杏仁水和一些廉价的零食以及瓶装的糖果，据证实可以食用并且没有副作用。
//
//抬头能看到上方有明显的金属构造物件，它们会在流浪者们试图推动风车和水车到一定程度并松手的时候里开始运作并发出音乐声，同时推动的风车和水车也会缓慢旋转，音乐长度取决于流浪者推动的时间长度，越久它能发出的音乐时间越长，但是总会短于流浪者的推动时长。
//
//大部分的音乐盒的曲子来源于上世纪60年代至70年代，但是也有一些近代曲子，曲调十分舒缓。
//
//极少数的风车水车屋存在玻璃制的沙漏，里面的沙子的颜色大部分为粉色和蓝色，玻璃似乎十分牢固且无法徒手击碎，它们会在风车转动时主动颠倒开始让里面的沙子倒出来，当沙子重新填满沙漏的时候转动风车或水车的流浪者会进入一种恍惚状态并会随机唤醒童年时期与音乐盒相关的一小段记忆。
//
//当其中一位流浪者进入恍惚状态时沙漏会卡住并不会继续填满沙子，当周围进入恍惚状态的流浪者过多沙漏有可能会破裂并惊醒恍惚中的流浪者们。这些沙子被收集进玻璃瓶之后持有玻璃瓶的流浪者会感觉到一种平静而柔和的感觉，并且在此层会听到玻璃瓶发出的音乐声持续回荡在耳边。
//
//游乐园
//向着风车群落随意某个方向直走一英里就会感觉到坡度明显的上升，从坡底到坡顶由大量钉死在地面上的木质物件构成的游乐园。
//
//这个区域地面存在数个扁平的金属柱，高度约为30厘米且分布不平均，每个金属柱附近随机存在着零至一个的纪念品商店或刨冰车。
//
//纪念品商店摆放着各式的八音盒并被玻璃柜阻隔，每个商品面前都会摆放着一个篮子一样的容器，其底部可以活动，将任意金属物件投入到一定量篮子底部就会打开将里面的金属物件收纳进去，以此交换对应玻璃柜里的八音盒，强制破坏设施会导致地面发出奇怪的振动和低沉的发条拧动声。
//
//刨冰车的样式多变，但必定会挂有牌子以及侧面存在一个手柄,转动手柄三十秒后会提供随机口味的刨冰，但提供到一定数量就会停止并发出长达两个小时拧动发条的声音，结束后能继续提供刨冰。刨冰可以食用，并检测出冰里有杏仁水成分。
//
//此区域的游乐设施为数个摩天轮，旋转木马以及跷跷板，并被一个木制玩具火车贯穿整个游乐园。大部分游乐设施都有各种程度的褪色迹象，当游乐设施上面有人的时会发出拧动发条的声音，并在一分钟后开始启动并同时响起欢快的八音盒旋律，在发条拧动时下去并不会取消其启动。
//
//游乐园的摩天轮并没有安全措施，很容易导致摔伤，因此不建议乘坐。
//
//玩具火车可以乘坐，本身行进时会重复单曲八音盒声音。会在随机站点停止振动并发出拧动发条声，在两分钟后启动继续前往下一站。不管火车行进哪一站，终点站必定会前往下一个区域。
//
//镜面平原
//乘坐玩具火车到终点站或在游乐园中心向左（向右）拐直走七百米就能到达此区域。此区域并不存在实体，只有大量木制的人偶存在。大部分为单个芭蕾舞或圆舞曲姿势，少数为单人交际舞，每个人偶都混有少量血肉的成分，脚底存在磁铁。除非人为挪动或发生“合奏”事件，否则人偶不会挪动。
//地面为光滑的镜面，无法被弄脏且无法投影出人类的影子，向着前方（或后方）直走一英里将会回到风车群落。
//
//关于“合奏”事件
//来自阿尔布森，Level C-198风车郊区的绘制者，其它区域的绘制均在“合奏”时丢失，同时也有一队的流浪者在此事件里死亡。
//
//采访者：所以，那时候发生了什么？
//
//阿尔布森：我想想，有什么声音…我确信那是很低沉的拧动发条的声音，地面也在微微振动着。那种振动害的我绘制时不少的直线歪掉。
//
//采访者：那东西持续了多久？
//
//阿尔布森：我记得我之前坐在屋顶上的时候那种拧动的声音和振动持续了……额额，我怎么可能记得，我没带手表。但是我记得在我刚绘制完第三个区域的时候就感觉到震动短暂的停止一会。
//
//采访者：之后发生了什么？
//
//阿尔布森：就是那件事情，当时我在那个镜子的地方坐着，突然地面开始剧烈摇晃。那些木质的东西仿佛是感觉到了什么开始缓缓的旋转，随之而来的就是震耳欲聋的音乐声。我感觉到一股强烈的推力把我往游乐园的方向快速推动着，那让我…很害怕，我几乎是巴不得多长出一只胳膊去抓住附近的东西，虽然我的大部分手稿也因此掉的到处都是。但是至少我碰到了一个人偶，那种拉扯和推动的感觉才终于消失。
//
//采访者：放松点，这里很安全，您看到了什么？
//
//阿尔布森：我…我看到远处那一整个游乐园开始转动，就像是音乐盒的转轴一样，我猜那些全是风车的地方也是一样的，对吧？我之前看到那些人就逗留在那里，他们还活着吗？
//
//采访者：抱歉，和您猜测的一样，全员失踪。
//
//阿尔布森：……
//
//阿尔布森：（叹息声）那或许就说的通了，我能听到很远的地方传来呼喊声和八音盒的声音，很多很多的八音盒，虽然杂乱但是却仿佛各自扮演着对应的音调。我脑子里仿佛被强制灌入一种想法一般，如果我不抱着木偶跳舞到音乐结束之时，我就会死。
//
//阿尔布森：于是我那么做了，我抱着木偶旋转着，我能听到远处血肉被碾压而发出的惨叫声…·建筑因为挤压变形而发出的嘎吱声，加上地面震动而歌唱着的古老嗡鸣声以及那些不知道为什么开始自己发出声音的八音盒…它们，它们居然真的成了一整首的乐曲，那些人偶就像是为了响应音乐一样在镜子上开始旋转和舞蹈。
//
//采访者：你还好吗…？你的脸色很难看的样子
//
//阿尔布森：没事的…没事的，即使我不想想起来那些旋律还是不断的嗡鸣着。在我几乎要晕厥的时候，我才感觉到那种仿佛要震碎我的骨肉的声音才停了下来。然后…就是你们发现了我，我不知道是演奏结束导致的还是我们在意识恍惚间做了什么才到了那里。我真的记不清了…
//
//基地，前哨站与社区：
//由于此地不稳定的性质，该层级暂时没有已知的基地或社区。
//
//入口与出口：
//入口：
//在Level C-199找到一个老旧的八音盒并转动它。
//在Level 11进入八音盒纪念品商店有概率进入。
//在黑暗处循着八音盒的声音走动将会到达Level C-198。
//出口：
//找到位于某个随机车站被沙丁鱼木雕包围的八音盒1并转动它就可以到达Level 924。
//在坍塌的木质废墟附近找到上面雕刻着麦田和玉米的八音盒2并转动它就能到达Level C-199。
//在“合奏”事件跳完整个舞蹈后会被传送至随机安全楼层。
//试图在风车切出会使你到达Level C-198.2。
//作者信息
//« Level C-197 | Level C-198 | Level C-199 »
//
//Footnotes
//1. 八音盒上面写有文字，内容为：“昨天记忆已经消逝，但何为‘消逝’早已无法知晓”。
//2. 八音盒上面写有文字，内容为：“回家吧，回到最初的美好”。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1198{}