//Level C-191
//评分: 
//+15
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
// 
// 
//实体绝迹
//Level C-191是后室C层群的第191层，有着绚烂且不间断的烟花。
//
//描述：
//Level C-191为一块直径为6.749千米的球状物体，温度在17℃-22℃之间浮动，无风，本身具有与月球相似的引力。整个球体呈现一片浅绿的景象，其表面被微微发光的狗尾草覆盖，其种子与正常的狗尾草相比更大且可加工食用，狗尾草的茎叶在被采下后会迅速风干，可以拿来编制物品。
//
//Level C-191的草地里时常存在瓶装纯净水和军粮等能长期保存的食物以及竹篓，军用铲类的工具，曾经有人试图往下挖掘，只挖到了更多的狗尾草和水泥碎屑。
//
//Level C-191的周围处于夜晚状态，无法观测到任何行星。其上空会不断出现大小不一的各色烟花，最大直径可达100米，相对正常的烟花其炸开的声音略大，目前无法找到烟花发射的源头。大部分目击烟花的人只是感觉烟花声音过大但是依旧能在此入眠，而有经历战争的目击者声称看到烟花会有种非常不安的感觉，甚至会在目睹烟花后陷入精神崩溃。
//
//据在Level C-191陷入睡眠并惊醒的人声称他们在梦里都梦到了和爆炸相关的场景，且无一例外称是被烟火的巨响而吵醒的。
//
//基地，前哨站与社区：
//即使Level C-191的烟花很嘈杂，但因为其环境安全依旧有数量超过100的人入驻此地。
//
//M.E.G. 光明草小组
//数量为19人的小组，专门在Level C-191活动，负责治安与物资的收集
//会向误入此地的人士提供帮助以及心理治疗。
//入口与出口：
//入口：
//在任意层级向着空中的烟花前进并摔倒会有概率到达该层级。
//进入任何与烟花有关的的商铺，不论完整或荒废都会到达该层级。
//在除小卖部外的地区点燃小卖部的摔炮将会在摔炮爆炸后到达该层级。
//出口：
//背对着烟花反方向奔跑一段时间将会到达Level C-199。
//将身上带有火药成分的物品埋进地面的狗尾草堆里将会到达Level C-77。
//进入存在于Level C-191的淡黄色帐篷将会到达小卖部。
//嘿哥们，这是在帮我做宣传吗？这小破店可没那么热闹的。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1191{}