//Level C-166
//评分: 
//+15
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//Leve C-166是后室C层群的第166层。
//
//描述
//该层级环境是一片没有边境的黄色麦田，
//
//Irrigated_Wheat_fi eld.JPG
//Leve C-166一望无际的麦田
//
//麦田的中央有一栋两室一厅的民居房，内部有wifi信号强度一般，房子内部的一切都表现为梵高画作风格的模样，
//
//ad 2eb94c7a960e97.jpg
//拍摄的房子内部
//
//家具可以正常使用，厨房有冰箱和洗碗槽以及各种烹饪用厨具，洗碗槽的水龙头流出的有些时候是杏仁水，也有时候是纯净水（Leve C-166也是后室中为数不多能取得纯净水的地方），冰箱里的食物也是呈现梵高画作的模样，可以正常食用且不会出现异常，冰箱里的食物被食用完之后关上再打开食物就会以未知的方式重新补充满，墙上挂着许多梵高的画作无法取下，书架上是关于梵高的画作介绍和梵高的传记，客厅有一台老实胶片放映机并且无法关掉，放映机对着沙发对面的墙上重复播放梵高画作风格的视频并配有舒缓安逸的音乐。
//
//附加
//经过数次实验得出结果，任何物品在房子内待的时间过久会逐渐同化为梵高画作风格的模样
//
//2b ad18d2a87697ab.jpg
//被完全同化的一瓶杏仁水
//
//，转变时间为30分钟到两小时不等，转变时间完全随机与物品大小无关，将同化物品拿出屋子也无法恢复原状，实验表明这种转变是不可逆的。
//
//基地、前哨和社区
//梵高爱好者
//是由一批梵高的爱好者组建的团体，共有十个人（原本有十二人，但其中有两人死于未知疾病），他们定居在此学着梵高的风格创作画作，享受着这个层级平静安逸的生活，他们讨厌其他不懂得欣赏的流浪者，但如果有流浪者欣赏梵高的画作，那么他们就很乐意免费提供一些资源，也可以与他们进行贸易，他们能接受的交易品包括但不限于医药品、调味料、各种罕见的食品饮品等等。
//入口与出口
//入口:
//在Level 10朝东北方向一直跑，有机会切入Level C-166
//在Level C-114的9至10层的每个垃圾桶里都有可能找到一只被割掉的耳朵（一定得是左耳），带上它，会在你下一次切入其他层级时切入Level C-166
//在Level 57切入一张麦田画可以进入Level C-166
//出口:
//朝麦田的西南方向一直跑，有机会切入Level 10
//尝试破坏房子客厅的放映机或撕毁画作，会被强制切出Level C-166，并随机切入任意一个已探索过的层级
//去画架那里，任意完成一副画作，会切入任意一个安全层级
//在厨房连续吃下3个生土豆也可以让你回到你来到Level C-166时的层级
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1166{}