//Level C-102
//评分: +131+–x
//欢迎来到B.F.P.F.的数据库。
//你可能会疑惑，明明自己正在查看M.E.G.数据库的文档，
//为什么会来到B.F.P.F.的数据库？
//请先不要急着离开，您仅会在查阅Level C-102的文档时被链接到这里。
//我们将我们的Level C-102文档与M.E.G.的Level C-102文档连接了起来，
//使得流浪者在访问Level C-102的文档时有概率会跳转到这个页面。
//我们只是希望让尽可能多的流浪者看清楚关于Level C-102的真相，
//以及M.E.G.所做的事。
//希望您能阅读完这篇文档再做判断。
//按此跳转到M.E.G.数据库的版本。
//——B.F.P.F.首席工程师 Donald Claud
//
//
//Level C-102
// 
//
//生存难度：
//安全可保障
//环境可改造
//实体可驱逐
//Level C-102是后室C层群的第102层。
//
//描述
//c-102
//图片C-102-1
//Level C-102内拍摄的一栋建筑物的照片
//似乎属于Level 11的部分
//
//Level C-102是一个由若干个层级1的部分杂糅而成的复合层级。连接数个层级环境间的白色通道有时为非欧几里得空间，不同层级环境之间有时候则粗暴地糅合叠加在一起。粗暴的糅合通常会导致地形环境的边界会产生错乱，如一些违和的结构镶嵌在地面或者一些建筑物上。截止至2019/11/18，流浪者在Level C-102内的主要活动地区已经被B.F.P.F.探索完毕，Level C-102的地理环境及非欧几里得通道等信息的图片与文字资料已被上传至B.F.P.F.的数据库并向所有流浪者开放。这些资料使得探索和定居Level C-102变得适宜。
//
//需要注意的是，糅合进入该层级的不仅只有环境部分，还有实体部分，且这些实体也会随处移动。这意味着，你能看见成群的笑魇、死亡飞蛾、肢团、猎犬、具有攻击性的无面灵以及窃皮者、爆酸者等实体在Level C-102中横行。但除了使用大型火器直接击杀实体外，这些实体是可以被“驱逐”的，只要按照一定方式行动，这些实体便会被自动离开，这使得实体对流浪者的威胁大大减少。B.F.P.F.强烈建议流浪者在并未威胁到生命安全的情况下使用“驱逐”的方法对付实体，这不仅能最大程度地减少伤亡，也能减少实体对流浪者的敌意程度2。详细资料已被放置在B.F.P.F.数据库的首页。
//
//Level C-102内存有大量的物资，包括但不限于杏仁水、罐装龙肉、火盐、皇家口粮及治愈水晶等。这些资源也可以在Level C-102的主要入口处——B.F.P.F.的基地内获取，B.F.P.F.将会免费为有需要的流浪者提供这些在Level C-102内收集到的物资。
//
//在Level C-102的各个层级环境的边界，会产生一种危险的物品——“错误方块”。“错误方块”被火盐激发时，会使一定范围内的空间的现实“被扭曲”，大量“错误方块”的使用可能会导致后室变得不再宜居，甚至威胁到流浪者的生命。因此，“错误方块”的收集被命令禁止，并由B.F.P.F.的士兵进行管控。违规收集“错误方块”的行为，不论是否B.F.P.F.内部成员，都将会受到B.F.P.F.的惩罚与制裁。
//
//实体本就居住在后室，而只因我们的到来，我们便要将后室占为己有，并肆意屠杀这里的原住民。作为入侵者的我们，只设立一个所谓的“感恩节”就能弥补我们的罪恶吗？
//
//M.E.G.到现在的所作所为，已经造成了上万人的死亡，他们还有底气说自己是一个保护流浪者的组织吗？流浪者在他们眼里只是一颗用来寻找出口的棋子罢了。
//
//——B.F.P.F.首席工程师 Donald Claud
//
//基地、前哨与社区
//在文件“M.E.G.与B.F.P.F.关于112事件的协定”签署后，Level C-102中不再允许M.E.G.建立基地、前哨或社区，仅允许B.F.P.F.及B.F.P.F.所同意的组织建立基地。目前已知的B.F.P.F.基地如下：
//
//B.F.P.F.（后室家居生产厂）——“遣返者”
//该系列基地一共有若干个，遍布在各大层级环境的固定入口处
//每个基地都驻扎有10名B.F.P.F.成员
//这些基地的成员会将来到这里的流浪者劝回，并给予杏仁水、罐装龙肉等必要资源。
//B.F.P.F.（后室家居生产厂）——“守望者”
//该系列基地一共有12个，遍布给各大层级环境的交界处
//每个基地都驻扎有20名B.F.P.F.武装人员
//他们将在各个层级的边界巡逻，阻止流浪者收集“错误方块”
//B.F.P.F.（后室家居生产厂）——“管理者”
//该系列基地一共有若干个
//首席工程师将会驻扎在其中一个（并非固定）
//其余B.F.P.F.成员的日常生活与培训也会在这系列基地中进行
//入口与出口
//入口
//在任意层级内昏迷，将有1.02%的概率被传送至Level C-102中该层级的对应层级环境。需要注意的是，每个对应层级环境的传送点只有一个。（即，若你在Level 11中昏迷，你会在Level C-102中与Level 11相同的层级环境中的一个固定点醒来）
//走下Level C-101的楼梯将会在一栋高楼内的一个楼梯里出现。
//出口
//在Level C-102的大部分层级环境中，能找到向下且被遮盖的通道，进入通道一段时间后将会被传送至对应层级。（即，在Level C-102内对应Level 11的层级环境中会有被盖住的井盖，打开井盖并往下跳将会被传送至Level 11）
//附件
//我们希望您看的就是以下内容。
//希望您能认认真真地看完，再选择你的立场。
//希望您能认识到一个残酷的事实：
//M.E.G.不会主动保护所有的流浪者，
//因为流浪者只是他们逃出后室的工具。
//为什么我会知道的那么清楚？
//因为我曾经是他们的一员——原监督者D。
//——B.F.P.F.首席工程师 Donald Claud
//
//按此前往查看附件。
//
//文件C-102-α：人事档案M000005——Donald Claud
//pexels-photo-6973179.jpeg?auto=compress&cs=tinysrgb&h=750&w=1260
//图片C-102-2
//Donald Claud，拍摄于2019年
//Donald Claud
//所属组织：M.E.G.（探险者总署）
//职位：监督者D
//描述：
//Donald Claud，白人男性，生于1964年█月██日，美国███州。Claud是最早一批进入后室的人之一，也是M.E.G.的创始人之一。最初，Claud在探索Level C-███时，不慎跌落到地面的一个大洞里。据Claud所述，他在坑中掉落了约15分钟后因缺氧而昏迷，醒来后发现自身处在Level 4的地板上，同时脑内突然出现了一套制作简单小型异常物品的知识体系。但也因为这次遭遇，Claud对待任何事从此变得十分谨慎，不愿意轻易行动。
//
//由于在M.E.G.建立初期，Claud为M.E.G.作出过巨大贡献，在制造简单的异常物品方面也小有成就，故Claud被任命为一名监督者。Claud按顺序选择了编号D，成为监督者D。
//
//Donald Claud对M.E.G.作出的贡献有：
//
//在创立初期，直到跌落大洞之前，为M.E.G.探索了数十个新层级，提供大量一手资料。
//在创立初期，为新生的M.E.G.收集资源、建立基地等。
//为M.E.G.制作小型异常的物品。
//我有一个很多人都习以为常的习惯——写日记，将特别重要的事情记录下来。
//
//这个习惯并不特殊，很多M.E.G.的士兵都会写日记。
//
//但如果结合上我原监督者D的身份呢？
//
//请看看我在M.E.G.时记录的日记吧。
//
//文件C-102-β：日记本副本
//2019/07/09               星期二
//
//今天，监督者议会里传来了一个好消息，和一个坏消息。
//
//好消息是，我们发现了一样新物质，蓝砂，这种物质似乎具有“传送”或者“空间折叠”之类的能力，听起来很厉害，但具有轻微毒性。
//
//但坏消息是，Stretch、Kat还有Andrew他们执意要M.E.G.的士兵和其他的流浪者一起去采集这种具有毒性的东西，还是在它的性质仍未探索完全的情况下！
//
//幸好我劝住了他们，最后还是只让M.E.G.的士兵的士兵上了。
//
//希望明天的采砂活动不会出事吧，愿主保佑我们。
//
//2019/07/12               星期五
//
//还真出事了。
//
//那些去采集蓝砂的士兵，好像是因为与“融化”的蓝砂接触，手全都烂掉了。
//
//今天在办公室走廊见到了其中一位伤员，腐烂过的地方看着很恶心。
//
//太可怕了。
//
//但Kat直接让“监督者之眼”处决了那些伤员。
//
//这种做法也太恶心了，M.E.G.就是这样保护流浪者的吗？
//
//抱歉容我插一句嘴。
//
//之后有人和我说这种做法是为了稳定军心，嘲笑我没有见识。
//
//我认真思考了一下，但还是坚持原来的看法。
//
//这种不人道的处理方法迟早有一天会被捅穿，然后被所有人所唾弃。
//
//我们不妨换位思考一下。
//
//你被你服务的组织用完之后就抛弃，你高兴得起来吗？
//
//2019/09/30               星期一
//
//我快要控制不住自己的情绪了。
//
//这什么玩意？规定每个M.E.G.基层人员必须完成相应KPI？普通流浪者兑换物资要用绩点来兑换？这还是个强制规定？
//
//这不是在保护流浪者，这是在把流浪者往火坑里推，让流浪者去送死啊！
//
//你妈的，M.E.G.怎么变成了这样？
//
//这还是我熟悉的那个保护流浪者的M.E.G.吗？
//
//……
//
//令人作呕。
//
//2019/10/04               星期五
//
//今天我见到了一件很奇葩而无法理喻的事情。
//
//一位曾经为M.E.G.抛头颅洒热血的士兵，就因为写了一篇文章抨击那个不合理的规定，就被抓起来丢到Level 790里自生自灭。
//
//我的脑子里还萦绕着那位士兵在被“监督者之眼”的士兵拖着丢进Level 790的大门时，发出的惨叫声。
//
//还有Kat在旁边冷漠不仁的表情。
//
//我受够了，我真的受够了。
//
//在我离开之前，我要帮帮他们。
//
//文件C-102-γ：M.E.G.（探险者总署）KPI及绩点制度（节选）
//M.E.G.基层人员部分
//普通流浪者部分
//M.E.G.的基层人员的积分采用每月扣除制。人员通过完成任务获得相应证明可以兑换相应数量的积分，每个月需要扣除500积分以维持M.E.G.人员身份，未被扣除或扣除剩余的积分可以顺延到下月。人员可以选择每月额外扣除250积分来获得当月“优秀成员”称号，“优秀成员”将会被贴至公告栏进行表彰。超过3个月没有足够积分扣除的人员将被踢出M.E.G.并无法再次加入M.E.G.。
//
//以下为任务与积分对应表：
//任务	积分
//发现一个未被发现过的层级	（1200÷探索人数）点积分
//发现一个已发现层级的未知性质	（800×重要系数÷探索人数）点积分
//发现一个未被发现过的实体	（1000÷发现人数）点积分
//发现一个已发现实体的未知性质	（700×重要系数÷探索人数）点积分
//发现一个未被发现过的物品	（600÷发现人数）点积分
//发现一个已发现物品的未知性质	（400×重要系数÷探索人数）点积分
//参与一次军事行动	（250×难度系数）点积分
//研发或制作层级路线图	（200×难度系数）点积分
//参与一次运输行动	（150×难度系数）点积分
//参与一次守卫行动	（100×难度系数）点积分
//参与一次援助行动	（60×难度系数）点积分
//采集并上交物资	视上交物品数量与珍稀程度决定
//更多任务正在加入中
//随后，我动用了作为监督者紧急召开会议的权力，以及发起提案的权力。
//
//以自己辞去监督者职务为代价，废弃了那个吸血的狗屎KPI。
//
//我觉得这是值得的，我也很庆幸自己离开了这么个吸血组织。
//
//之后加我便加入了一个更符合我价值观的组织，也就是你现在见到的。
//
//B.F.P.F.——后室家居生产厂
//
//文件C-102-δ：B.F.P.F.（后室家居生产厂）公告
//各位流浪者们：
//
//原监督者D——Donald Claud于2019年10月7日加入B.F.P.F.（后室家居生产厂）并成为首席工程师。B.F.P.F.注重于改造层级环境，将后室变为更适宜流浪者居住的家园，驱逐实体，保障流浪者的人身安全。希望加入B.F.P.F.的流浪者可以来到Level C-102寻找我们，我们竭诚欢迎每一位志同道合的流浪者。
//
//——B.F.P.F.首席工程师 Donald Claud
//2019年10月7日
//
//我很高兴我和其他志同道合的，同样是M.E.G.出身的流浪者在这么个组织共事。
//
//一切都在向好的方面发展。
//
//我们拥有在M.E.G.时的管理经验，深知我们的势力无法掌控太多基地，于是我们就只在3个层级建立最初的基地，并围绕他们做大做强。
//
//第一个层级便是Level C-102，我们在10月9日便建成了第一个基地，拥有一定的抵御与驱逐实体的能力，还能有一定的生活设施。
//
//随后就是Level C-45还有Level C-30.k，这3个层级的基地到现在都依然存在。
//
//但是M.E.G.在我走后也没有停止作妖。
//
//你看看这玩意，他们又鼓捣出新东西来了。
//
//文件C-102-ε：监督者议会20191018-01号公告
//各位流浪者们、M.E.G.成员们：
//
//由于研究需要，M.E.G.将开始大批量收购一种名为“错误方块”的物体。“错误方块”出产于Level C-102层级环境交界处，较容易获取但分布较为分散，故发布收购令，对外收购“错误方块”。
//
//“错误方块”的收购价格为：60g火盐或其他等价物。有意者可到Level 1的Alpha基地或Level 4的Omega基地详细咨询。
//
//M.E.G.将竭尽全力保护所有流浪者。
//
//然后呢，你猜我收到了一份什么报告？
//
//文件C-102-ζ：B.F.P.F.内部邮件
//寄件人：lp-luyees-015@@backrooms.bfpf
//收件人：donald-claud-1966@@backrooms.bfpf
//邮寄时间：2020/01/01 20:36:03
//邮件主题：关于在Level C-102发现的新型奇怪类人实体
//
//Claud：
//
//最近我在Level C-102里面看见了很多……很奇怪的人。他们的肢体……产生了像bug一样的错位。比方说，手臂像是被一把很锋利的刀砍下来以后再歪着接回去的，又或者一只耳朵完好地镶嵌在了小腿上。这太奇怪了，感觉像一种新的实体，我们需要调查一下吗？
//
//——Louis
//
//本来我还以为是什么新发现的实体，就找人一起去调查了。
//
//结果，那些不是实体，那些他妈的是流浪者！
//
//我们采访了他们之中的其中一个。
//
//文件C-102-η：B.F.P.F.成员Louis与被“错误方块”影响的流浪者接触的录像视频文件。
//（Louis拿枪谨慎地靠近那名流浪者的背后，那名流浪者回过头来的时候被吓了一跳）
//
//流浪者：哇哦！！大哥别别！我都给你，我都给你！
//
//Louis：（被惊到了）你不是异常实体？
//
//流浪者：当然不是啊大哥，你先把枪收起来，有话好好说。
//
//Louis：（把枪收了起来）那你身上这些是怎么回事？
//
//流浪者：（举起错位而能清晰看到截面的肌肉的手臂）你说这个？我猜测应该是“错误方块”害的吧。
//
//Louis：“错误方块”？这是怎么一回事？
//
//流浪者：你没听说吗？M.E.G.最近在大批量地收购这玩意，整整60g火盐一个呢。
//
//流浪者：“错误方块”，正如其名，像“错误”一样的立方体。可能接触时间长了，或者接触的量多了，就会导致身体变成这样吧。
//
//Louis：M.E.G.有告诉你这个叫“错误方块”的东西有这样的副作用吗？
//
//流浪者：没有，他们从头到尾都没告诉过我，还是我后来发现的。所以我都劝其他人不要碰这玩意。
//
//Louis：那你为什么还在收集它？
//
//流浪者：没办法啊，谁叫我加入了M.E.G.呢？而且他们给的太多了。
//
//Louis：那你有找过他们索要收集这玩意造成的工伤赔偿吗？
//
//流浪者：（悲哀的语气）没有，他们直接跟我说没有任何赔偿，还说M.E.G.不养废人。我还得趁现在还能动，多赚一点物资。不然等以后“错误方块”的影响扩散到全身，我就真的被抛弃了。
//
//Louis：啊……你跟我们来一趟吧。
//
//随后，Louis将这位流浪者带回了B.F.P.F.的基地，这位流浪者在基地里得到了一定的包扎和其他的医疗措施、足够的杏仁水和罐装龙肉，以及一个安全的住处。
//
//一位曾经为M.E.G.尽心尽力付出的人，
//
//在失去行动能力后会被当做废弃的棋子一脚踢开。
//
//现在再看看上面那篇收购公告的最后一句，
//
//真的是太讽刺了。
//
//
//
//
//我们为此跟M.E.G.的人稍微谈判了一下，
//
//M.E.G.的人承诺说会好好地对待伤员的。
//
//我不知道他们最终会不会这样做，但我们也没有监督他们的权力。
//
//我们只能尽自己的能力，把一些伤员劝回来。
//
//说起来，M.E.G.还邀请我们见证第一次有关“错误方块”的大型试验。
//
//为了表示我们的尊重，我们就派人去了。
//
//然后，他们……再也没有回来。
//
//我们只得到了这么一份报告。
//
//文件C-102-θ：事故报告20191215-01
//事故时间：2019/12/15 13:00
//事故地点：Level C-30
//事故内容：
//
//由M.E.G.、Backrooms Robotics、B.N.T.G.、B.F.P.F.等组织组成的共50名试验人员在Level C-30内进行关于“错误方块”的试验。被按照10*10*10的方式摆放的共计1000个“错误方块”在13:00准时用火盐引燃。这次引燃造成中心点半径数千米范围内出现严重的、类似Bug的现实扭曲现象。许多不属于Level C-30的建筑结构与Level C-30内的沙子互相交错、碰撞并坍塌，导致80%的试验人员窒息致死。在试验开始的3个小时后，Level C-30“崩溃”，无法进入。此次试验一共造成45名人员死亡，5名人员重伤。
//
//你说说，这个“错误方块”，还有那些蓝砂，
//
//这些东西造成了那么多人的死亡，是不是名副其实的“害人精”？！
//
//而M.E.G.不好好想着怎么保证流浪者的安全，
//
//而是消耗大量的人力财力物力，甚至牺牲流浪者的生命，
//
//就为了所谓的“离开后室”？！
//
//“离开后室”的目标没有错，错的是M.E.G.拿这个做挡箭牌，
//
//堂而皇之地拿这个借口干一些伤害流浪者的事，只为了自己逃出去。
//
//他们为什么不宁愿减少伤亡呢？就算出不去，我们还可以好好地活在这里的啊！
//
//
//
//
//所以最终，我们做了一个冒险的决定。
//
//我们和M.E.G.决裂了。
//
//我们开始拒绝和他们接触，并将他们的基地赶出Level C-102。
//
//我们封锁了Level C-102，为了让流浪者不再受到“错误方块”的伤害。
//
//这种像放射性元素的东西就应该被关起来才对。
//
//但我们疏忽了一样东西。
//
//不知道从什么时候，Level C-30从崩溃中恢复了，可以重新进入了。
//
//而M.E.G.开始了第二轮的蓝砂采集活动，地点是Level C-30.k。
//
//这次他们做地更过分了，他们鼓励流浪者“自杀式”地去收集蓝砂。
//
//“自杀式”
//
//文件C-102-ι：监督者议会20200103-01号公告
//各位流浪者们、M.E.G.成员们：
//
//由于研究需要，M.E.G.将开始大批量收购一种名为蓝砂的物品，该物品的采集地点是Level C-30.k。
//
//每100g蓝砂可以兑换1g火盐或其他等价物。有意者可到Level 1的Alpha基地或Level 4的Omega基地详细咨询。
//
//由于蓝砂所需数量过于庞大，M.E.G.鼓励流浪者们不惜一切代价去收集蓝砂。无论该过程中受到了什么损害，M.E.G.将会为您承担相应风险。
//
//收集蓝砂活动的危险等级被鉴定为：等级0——绝对安全。
//
//M.E.G.将竭尽全力保护所有流浪者。
//
//于是我们开战了。
//
//我们千方百计地阻止流浪者进入Level C-102和Level C-30.k，
//
//为的是防止流浪者受到更大的伤害。
//
//几天过去，流浪者们也开始觉醒了。
//
//那些因为采集蓝砂而差点丢掉性命的幸存者感觉到自己被骗，
//
//于是他们组织起其他流浪者，攻击M.E.G.的各个设施和人员，
//
//群众的力量是很强大的，所以这场战争进行地很快，虽然还是死了人。
//
//1月12日，M.E.G.在C层群最大的基地被攻陷，M.E.G.最终决定妥协。
//
//他们发了一份道歉公告，并与参与战争的组织和流浪者个体签了一些协定。
//
//文件C-102-κ：M.E.G.20200113-01号公告
//各位流浪者们、M.E.G.成员们：
//
//在此，我们监督者团队将向广大流浪者与信任我们的M.E.G.成员诚挚地道歉。我很抱歉我们因一时的疏忽，而向收集蓝砂的各位隐瞒了蓝砂的毒性，这导致多数前往Level C-30.k收集蓝砂的采集队员英勇牺牲。我们向大家保证，以后再也不会有这样的事情发生。作为补偿，M.E.G.将会照顾所有幸存者、以及牺牲者的所有家属，直到他们老去。同时，监督者议会自我停职15天，以深刻反省自身。
//
//再次对所有遇难者致以崇高的敬意与诚挚的歉意。
//
//——监督者议会
//
//文件C-102-λ：M.E.G.与B.F.P.F.在“112”事件后关于Level C-30.k、Level C-102及蓝砂的协定
//协议日期：2020/01/13
//协议双方：M.E.G.（探险者总署）、B.F.P.F.（后室家居生产厂）
//担保签名：
//M.E.G.（探险者总署）：监督者A——Stretch
//B.F.P.F.（后室家居生产厂）：首席工程师——Donald Claud
//协议内容：
//
//Level C-30.k与蓝砂部分：
//
//1.Level C-30.k中不再允许M.E.G.设立任何前哨、基地或社区，原有前哨、基地或社区所有人员与设施需要在7日内撤离，B.F.P.F.将会在2020/01/20 08:00派遣队员接管所有设施。
//
//2.所有在Level C-30.k中采集蓝砂的行为在保证人员安全的情况下运行，并被B.F.P.F.所监管。M.E.G.不得再以任何形式收集、收购或怂恿他人出售蓝砂。
//
//3.在30日内，M.E.G.的所有蓝砂库存均不能被用于试验。必须试验者，需要在B.F.P.F.的审核和监管下进行。
//
//Level C-102部分：
//
//1.Level C-102中不再允许M.E.G.设立任何前哨、基地或社区，原有前哨、基地或社区所有人员与设施需要在7日内撤离，B.F.P.F.将会在2020/01/20 08:00派遣队员接管所有设施。
//
//2.任何人不再被允许在Level C-102中采集“错误方块”，M.E.G.不得再以任何形式收集、收购或怂恿他人出售“错误方块”。
//
//3.M.E.G.在7日内上交或自行销毁目前现存的所有“错误方块”库存。
//
//我们收缴并保管了他们用来做实验的蓝砂和“错误方块”，
//
//以免他们又整出什么幺蛾子来，造成大量流浪者伤亡。
//
//在之后一个月里，那段日子过得还真的挺好的。
//
//不会收到流浪者又因为M.E.G.的什么什么政策死掉的报告，也没有蓝砂和“错误方块”这样的“害人精”。
//
//流浪者在后室里有序地进行着自己的生活：收集必要的资源、驱逐实体、建立设施保证自己的安全。
//
//一切都在向好的方面发展。
//
//但是一个月刚出头，那帮老狐狸又开始作妖了。
//
//那个时候开始，就不断有人鬼鬼祟祟地进入Level C-102，不知道要干什么。
//
//我们选了其中一个去跟踪，发现他们在收集“错误方块”。
//
//好家伙。
//
//文件C-102-μ：B.F.P.F.内部职员20200216-01号公告
//请各位驻守在Level 2、Level 4、Level 5、Level 6.1的成员，改为在Level C-30.k回防，防止流浪者因为采集蓝砂而死亡；
//
//驻守在Level 11、Level 52、Level C-96、Level C-195、Level C-199的成员，改为在Level C-102回防，绝对阻止流浪者收集“错误方块”。
//
//以上指令请尽快执行。
//
//——B.F.P.F.首席工程师 Donald Claud
//
//我们回防了，防止M.E.G.又整出幺蛾子，
//
//防止他们又干那些伤天害理的事。
//
//然而，他们果然又卷土重来了。
//
//文件C-102-v：M.E.G.20200220-01号公告
//各位流浪者们、M.E.G.成员们：
//
//鉴于对蓝砂与“错误方块”的研究产生的喜人成果，我们决定重启相关材料的高价收购与收集，希望各位流浪者能积极响应，为探求离开后室的方法贡献自己的一丝力量。
//
//M.E.G.将永远保护所有流浪者的生命安全，并带流浪者们离开后室。这永远是我们的第一目标，不会改变。
//
//——监督者议会
//
//
//
//
//这场斗争永远不会结束，我们终将让流浪者安全地在后室定居，将流浪者的伤亡减少到最小。
//保 护 所 有 人Cares Everyone
//
//——B.F.P.F.首席工程师 Donald Claud
//
//
//
//
//我要说的说完了，现在您可以在去看看M.E.G.数据库的版本，看看对于同一件事，他们告诉了你什么，又隐瞒了什么。
//按此跳转到M.E.G.数据库的版本。
//——B.F.P.F.首席工程师 Donald Claud
//
//作者信息
//脚注
//1. 目前已发现组成Level C-102的层级环境占全部已发现层级的85%。
//2. 摘自 Donald Claud，《与实体共存》（后室：B.F.P.F.出版社，2017），3-5
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1102{}