//Level C-161
//评分: 
//+31
//+
//–
//X
// 
//
//生存难度：
// 
// 
// 
//Quercus2
//Level C-161内的大部分环境
//
//Level C-161是后室C层群的第161层。
//
//描述
//Level C-161是一片始终笼罩在浓雾中的栎树林，没有可见的昼夜循环，而是一直保持在深夜。在森林里没有任何可见的动物，也没有任何形式的淡水资源。尽管树木和苔藓都看上去没有异样但其内部均已沤烂腐朽，且在表面呈现明显的水锈痕迹，一些岩石和树木表面覆盖着一层盐。
//
//自进入这一层级开始，发出任何声音都可能招致攻击，这些伤害通常来自广泛分布在层级内各处的循声和静默，在出现时总署伴随着嘘声和周围环境的扭曲与失色。一种类似老式电视机雪花屏幕的视觉影响始终呈现在流浪者的视野内，这种影响会随着进入这一层级的时间而逐渐增强，同时伴随着雪花屏白噪声也会出现并不断增强，这种影响无法以任何形式免除和减轻。当这种影响到达一定程度后，流浪者的视野完全被雪花屏覆盖，且只能听到白噪音，此时的流浪者将会完全失去所有可能发出的声音，与任何物体进行互动也不会发出声响，其体表的颜色将会逐渐加深，杂色会浮在身体表面，直至颜色彻底与周围环境融为一体，然后失去踪影。
//
//在森林深处有一栋大型综合性建筑，样式类似于19世纪在上海、福建广泛出现的老式花园洋房。洋房内部存在大量痕迹表明这里曾被用于某些大型的商务活动和容纳外来者的场所，虽然有证据表明洋房内部曾有过人类活动，但该建筑似乎已被遗弃了相当长的一段时间——也可能因为这些缘故，在这一层级内地板和墙上均可以找到一些陈旧的血迹和人体器官碎片。
//
//当前在洋房内存在大量从内部封锁的房间，内部家具都覆盖一层不厚的灰，存在至少不过一年时间内曾有人使用过的痕迹，在一些无法轻易触及的位置还可以发现类似指纹的灰尘印记。目前在一些靠外围的房间里发现若干与周围环境格格不入的设备，包括但不限于：在一层左手边第一个房间内放有一台始终打开的生物医学实验室冷柜、每一张桌子和床底下都有一个音频记录器、被移除了踏板的管风琴、二层所有窗户均为拉开式金属柜（开启时总会发出刺耳的声音）、被摔碎的铜管乐器和撕碎的乐谱碎片等，无法确认这些物品设于此处的缘由。
//
//在洋房内遭遇实体的几率远高于其他区域，确信这可能与洋房曾经的历史价值或此前的居住者有关。
//
//实体
//嘘声
//嘘声是一种会在突然出现在流浪者身边的实体，它没有形体和体积，无法被直接观察和接触。尽管如此，仍有部分流浪者因在嘘声出现前在环境白噪音中发现了类似脚踩枯叶变形的声音和摩挲树干的声音，并以此为依据推断嘘声存在的可能实体。
//
//当在这一层级内的声音超过某个阈值时，嘘声将会出现在声源附近，并发出示意其安静的“嘘——”的一声。若在此时立即保持安静，则不会发送异常现象，否则静默和循声将会立即出现在声源周围。
//
//静默
//静默通常指在层级内某处持续保持较大的声源产生时有概率出现的现象，一般会在声源及周围数米范围内出现一处纯黑色的区域，在区域内的任何声音都无法发出，也没法接收区域外的声音。
//
//与此同时，身处影响区域内的流浪者身体将会发生一定程度的变化，其中包括覆盖全身的色素沉积和染色，体表颜色会逐渐趋同并且饱和度增加，该区域会一直维持至流浪者体表完全变为纯色且没有阴影和色差为止。大部分流浪者在此期间保持沉默可以免受伤害，但少部分情况下流浪者被覆盖的部分将会消失。
//
//大部分情况下，静默的出现通常伴随着噪声和覆盖环境白噪声的声音出现，由此确信实体同样具备可以分辨噪声和声源的听觉。
//
//循声
//目前仅能确认循声与流浪者在这一层级内发出声音直接相关，但目前为止仍未收集到任何相关信息，确信其与流浪者在层级内失踪的情况直接相关。为避免损失，请流浪者在这一层级内尽量保持安静。
//
//回收记录
//以下内容是在此前被标记为失踪的探险者总署成员在一周前使用其内部账号陆续向各大宜居层级基地发送的信息，确系由部分受困在这一层级内的流浪者使用Wi-Fi向外大规模发送的相关情报，其内容与一名无法确认身份的流浪者在这一层级内的遭遇，确信这是首次对这一层级的探索记录。
//
//第一天
//
//Quercus1
//栎林的上空
//
//当我们重新醒来的时候，发现周围都是陌生的环境。灰绿色的草地和树林，赭石色的天空和云，我们站在这个地方可以看见不远处山脚下有一栋开着灯的蓝绿洋房。这种色温的影响似乎存在于层级的每个角落，包括我们这些刚刚进入这里的人。我们的衣服和肤色感觉上饱和度降低，就好像有一层杂色的滤镜漂浮在视线里。
//
//森林始终被一层浓雾笼罩着，这里没有虫鸣，没有鸟叫声，更没有溪流，湿度计没有任何反应，这雾气不似真实的，但我们呼吸可以感受到其中的土腥味和水气，地上长着密密麻麻的苔藓和新鲜腐殖质，我们发现这里的树木靠近根部的位置都有明显的水锈痕迹，而且还有一部分已经沤烂发臭了，可就是没有水；远处的近处的都没有，偶尔有风吹过，树叶婆娑却没有任何声音，这非常奇怪，在森林里长着白色的山茶花苞，低着头。有人说听到了下雪的声音，悉悉索索的声音。
//
//在集合确认信息后不久，我们决定向山脚下的那栋洋房进发。
//
//第三天
//
//情况很糟糕，由于进入得匆忙，我们的补给都没有准备长期多人份的。尽管我们身处于森林里，但没有发现任何动物，也不见任何可见的淡水资源，这在最开始的时候被我们忽视但现在不得不重视起来。我们一致认为这可能是某些层级效应，就像11效应里之于大部分实体，我觉得这里也有某些作用在所有事物之上的规则，故此我们认为这可能跟声音有关。
//
//有时候我总是很难不去胡思乱想，这层级里可能有什么奇怪的人或实体存在。虽然没有声音，但我们可以听见彼此说话的声音，衣服摩擦和肢体接触带来的响动几乎震撼我的耳朵，但其他人却没有任何影响，就好像那些声音只是稀疏平常的，可事实也确实如此，一直是悉悉索索的。
//
//有一次我们在休息的时候，我摸到在一颗倒下的栎树底下有一摊散发着恶臭的透明胶质粘液，上面沾着一些白色的垢，没有任何人发现。我总感觉有什么东西在我们的视野外，这里一定有什么在游荡，或是在远处注视着我们——我没有把这个情况告诉其他人，我们已经没法承受更多坏消息了。
//
//虽然那栋建筑看起来不远，但我们行进了一定路程以后依然没有达到。实际上我们中负责观察的方海一直声称我们距离那个建筑一直没有靠近。我们似乎在原地踏步。
//
//第七天
//
//食物几乎耗尽，水也喝完了。
//
//不过万幸我们终于到达了这个建筑。这里看上去非常老旧，也没有得到很好的保养和维护，感觉来说已经很久没有人在此活动了，但我们都非常清楚地记得在我们进入这个层级的第一天发现这个建筑的时候，那分明灯火通明，而且还可以看见人影印在窗帘上走动——我们决定先有两个人进去看看情况。
//
//我们似乎找到了一个前哨站，很显然来自其它层级的流浪者，我推测可能是D.P.P.O。可惜这里没有任何物资，似乎他们走得非常匆忙，导致这里非常的杂乱。但这依旧没有什么有用的情报和物资——或许有，我找到了一张写有“去找调音室”和“不要听他的”字条，地上还有很多用来装寂静汁液的容器，但都是空的——他们遭遇了什么？
//
//队长问我们有没有听到搞什么奇怪的声音，类似于一种持续的白噪声，我们都没有听见。也许是在这个层级里诸事不顺带来的紧张，也可能是我们精神过敏了，这些乱七八糟的想法被抛到脑后。雾也更加浓了，山茶花也支起了身。
//
//现在最重要的是食物和水，现在只剩下备用的…..
//
//…之后呢？我们该怎么办？我该怎么办？我有些眼花，耳鸣更严重了-
//
//第十一天
//
//Quercus3
//花园洋房
//
//我们终于进来了这里，但这里什么都没有。我是说，这里有很多器具，有桌椅床，有餐具厨具，还有一些看上去很不协调的东西，但唯独没有食物。所有东西上面都积了一层灰，但不是很明显，盆栽都很有活力——这里有好几层，有一些房间是进不去的，而且站在房门前面总有一种不安的感觉。
//
//有人在一些角落里发现了不是很明显的血渍。我们所有人都必须抱团一起行动，哪怕上厕所也是一起。基于过往的经验，我们都尽量避免发出声响，生怕惊动了这里的“原住民”。可我们依旧能感受到有一种受注视感，自从进入了房子里以后更加强烈了。
//
//还有，我们每个人都察觉到有一种持续低频的白噪声一直围绕在周围，我们每个人都没法忽视它的存在，所以在夜晚我们都没法入睡，背靠背盯着房间周围的各个出入口和孔洞，就好像正有人站在那里，我们感觉每一处阴影里都站着一个人。
//
//今天有一个人死了，我们又可以撑几天了……
//
//我在走廊里遇到了那个实体，另一个队友看见它的模样忍不住叫出了声，于是立即在我面前被刺穿，而我怔住发不出声，它却好似没有发现我一般走开了。可我还能去哪儿呢？
//
//第十二天
//
//一名队员失踪了，就在他憋不住一个人上厕所时，随着一声尖叫。我们感到现场时，那里什么都没有。于是，我们开始搜查整个建筑，每一个房间，每一个角落，如此我们才更加细致的了解了这里，大部分房间就好像临时拼凑出来的一样，或者干脆就是空无一物的。这里什么都没有。
//
//人没有找到，后来还有人遭遇了一些实体，他说那个实体有着格外修长的四肢，不协调的服饰，没有人看见了五官，发出了嘎啦嘎啦的声音。我们始终没有在组团时碰见他说所的实体，抑或是说，我们开始怀疑这层级里是否真的有其它实体存在。
//
//一部分人开始放松了一些，并且不再刻意地注意自己的动作，偶尔一些大动作或者一不小心就会碰到桌角床脚，开关门时也会随手摔门，不属于这里的声音越来越多，他们越漫不经心我越害怕，我感觉好像有某些存在注意到我们了。
//
//我们中开始有人看不清了。
//
//又有两个人离开了。
//
//我们终于通过窗户翻进了那些没有开启的房间里，实质上那里是更糟糕的，那里什么都没有，就好像刚刚建成的房子在看不见的地方随意堆砌的边角料。在这里那个悉悉索索的声音愈加明显，以至于我们再没法去忽视它。
//
//我们轮着任何可以拿在手里的东西砸向墙壁，那里竟然像纸糊的一般破开了口子，里面有很多人的骨头，看上去都蜷缩着身体，婴儿姿势团在一起，待墙壁破开了周围也变得安静了下来——那声音竟只是我们的幻想。
//
//于是我们分离跑开，这府邸开始整个的颤抖，明明周围除了我们以外没有任何活物，但我却能感受到一种在人群中遭受灾难的慌乱感，好似我会随时被这无物踩踏，浓雾涌入了房子里，无物和无物扭打在一起，我们只能慌忙的向外跑，周围的家具房间开始沤烂腐坏，白噪声像是嗅见腐臭的苍蝇一样萦绕耳边。不断有人倒在身后，但我没法顾及他们，只能不停下来。
//
//我们终于到了外面，回头时那府邸却再次安静下来。这里无事发生。
//
//我们再次遇到了它，队长终于压抑不住想要冲上去和那个实体拼了，我拼命捂住他的嘴，不让他们发出一点声音，队长就在我怀里不断挣扎，伸手抓挠我的手，使我更加用力捂住。那个实体只是偶尔回过头，看上去只是路过。
//
//等它彻底走开了，我才松开了队长，可再也没有了回应。我们其他人都心照不宣的继续前进，没有人再提起这件事。
//
//第十几天
//
//Quercus4
//最后回收到的影像
//
//其他人不断发出声音，然后戛然而止。
//
//眼前的事物越来越模糊，起先是颜色，色弱色盲抑或是干脆黑白配色的，接下来是一些物体远近距离的把控，就好像失去了一只眼睛一样，没法分辨它们距离我们的距离，于是还有方位，我们甚至没办法分辨东西的上下左右，也没法描述一个物体在另一个物体的左边还是右边，就好像被打乱了又重新在脑子里排序了一样，到最后，我们会彻底盲目。
//
//白色雪花不断充斥在我们的视野里。之前队伍里有人说这个洋房和整个森林都是虚幻的，我们真实情况是身处于一片茫茫雪地里，因为雪盲症而出现了幻觉，我们一直在水中找水；也有人说，那是某个存在赐予的硝酸盐，慢慢从我们缺水的身体里结晶，然后逐渐蔓延至整个层级，我们清楚如何延续，如此才能保证我们不被这雪花沤烂在这里，所以我们体内有盐的。那该死的山茶花竟然在卧室窗外盛开来，白里透着红。
//
//那个实体更加频繁被我们目击到了。或者说它更加漫不经心了，不想最开始我们的视力和思绪都还算正常的时候，它小心翼翼的在我们的视野范围外徘徊，默默注视着我们的一举一动，等我们中有人发出了声音，它就会循着声音找到我们，然后将我们带走，杀死，消失。我看着它将两个尖叫着逃跑的同伴抓住，而我只能咬着牙关强忍着不发出声音。只要我不发出声音。
//
//有时候它就在我的跟前，我只能卖力地掐自己的手臂，尽可能的不让我叫出声来。它似乎同样没有视野，只能跟随着一些声音寻找猎物。我趁着理智还在时写下这份报告，那个挪威海怪要把我们拉下海，白鲸会吃了我们的身体，利维坦会钻开我们的脑子，从杏仁核里逃走，然后由它将我们的声音带走，然后变成遍布整个层级的白噪声。那声音本就是由无数的前者留下来的声音。
//
//只要我不发出声音。只要我不发出声音。
//
//第不知道多少天
//
//去他妈的-
//
//我的视力在减少，能看见的东西也越来越少，到现在只能分辨出一些模糊不清的轮廓，只有阴影的地方我才可以知道那里有什么东西在那儿，即便如此我也没法分辨出它的远近，只能一点点靠近，趴在地上向前爬。
//
//依靠着仅剩下的一点点视力，我写下着可能是最后的日志，我知道我必须把这一切都写下来，假如有其他不幸的流浪者有幸在视觉彻底失去前找到这些笔记，也不至于沦落到我现在的地步。
//
//今天我找到了一间与众不同的房间，还有一些在我之前来到这里的流浪者的笔记，也唯有那个地方才可以离开，只是目前还找不到方法。
//
//现在就剩我了。
//
//基地、前哨与社区
//“寂静者”（已撤销）
//由D.P.P.O中18位成员组成。
//此前哨可以保证此层级流浪者的安全且无需报酬。
//此前哨拥有大量寂静汁液来保证不会于此层级发出声音，后因为寂静汁液的严重短缺而于2003年撤销。
//入口与出口
//入口
//进入Level 6一件隔音室样式的房间后可来到此层级。
//在Level 2中走入一间标“安静”的门后可来到此层级。
//出口
//于此层级中发现一间调音室样式的房间并走入可来到Level 11。
//…这几天我尝试去哭，张开了嘴巴，没有声音发出来；我想要冲着它喊叫，吸引它杀死我，但我的声带在震动撕裂，没有声音发出；我几乎没法忍受继续活着，不断殴打和割开自己，依旧没有声音发出。我能感受到我逐渐适应了这里的环境，我不再会因为负分贝而感受到孤寂和烦躁，甚至可以在一片寂静中听到了那些细微且不易察觉的声音——我为自己感到羞愧。
//
//我现在身处于调音室里，我知道这里藏着离开这个层级的方法，但我看不见，我的视野一片雪白，我只能一点点摸索，被一些不知道是的东西绊倒又站起来，磕到墙角撞出伤口，我就站在出口前，可我却不能离开。我能感受到它就在我附近——就现在，它从没走远，一直注视着我，在我看不见的边缘。它知道我在哪，但好似想要我继续挣扎，就好像它玩弄其它人一样。在这片恒古的寂静里，这里无事发生。
//
//在那股声音中，我逐渐可以分辨出哪一个是我的心跳，哪一个是它的心跳。我们的心跳频率慢慢同步，就好像我们本就是一体的，我和这个层级是一体的。最后留我一个人看着这一切，而我什么都做不了，而我也几乎失去了我的视觉。世界里只剩下雪花屏。
//
//于是我才知道，它能听到的，我也能够听到，直到我终于想明白了-
//
//-它知道，一直都知道。它可以听得到我：我的心跳、我的呼吸、我的脉搏、我在脑子里像狗一样吠叫和我的一切，它一直都可以听得到，它不过只是装作找不到我在哪儿的样子，在我身边徘徊，将我的队友一个又一个带走，就在我的面前。
//
//也许我可以顺利逃离这个层级，可雪花屏反映在我视野里的影响会就此消退吗，以及我所能听到的一切是否都会被那股持续而稳定的白噪声完全覆盖？等我失去了视觉和听觉，其它感官也正逐渐被钝化，我还可以相信什么？也许我可以依靠着摸索苟活，但这一切都会有终止，而我又该如何自处？
//
//假如现在，我彻底看不见了-
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1161{}