//Level C-128
//评分: 
//+19
//+
//–
//X
//本层级档案经历共三个阶段的变化，现已根据历史文件进行整理汇总。
//]- 关闭
// 
//
//生存难度：
// 
// 
// 
//Level C-128是后室C层群的第128层。
//
//描述
//很难用一种形象的语言去描述Level C-128，因为这里似乎是一片四维或者是更高维度的空间。任何录像设备在此处都无法使用，摄像机没有办法记录任何数据。
//
//科学家和心理学家在讨论后一致认为，Level C-128内的图像变化之快，以至于任何范围的细节都被进入了记忆当中，即使这些数据已经超越了人脑接受的适度值。
//
//由于进入Level C-128会对生物体的大脑产生不可逆转的损伤，故M.E.G.已禁止任何人进入此层级。所有去过此层级的人都将终身与正常人隔离。
//
//基地、前哨与社区
//该层级不存在任何基地、前哨与社区。
//入口与出口
//入口
//在Level C-117使用至少四种不同颜色的喷漆将写有“健康生活”四个字的牌子完全遮住并将牌子扔进下水道，即可到达Level C-128。截至目前，M.E.G.组织队员已严加管控Level C-117内的所有喷漆。
//最早发现Level C-128的探险者来自Level √2的任意一扇门，这位探险者在回到C层群的基地后不久便因为精神问题自尽。
//出口
//保持闭上眼睛至少12小时，将会被传送至Level C-166。
//]- 关闭
// 
//
//生存难度：
//等级 Sigma
//
//不安全且不稳定
//高维空间
//无可辩识实体
//Level C-128是后室C层群的第128层。
//
//警告：这张图片会使人产生不适
//点击查看第一张图
//
//描述
//很难用一种形象的语言去描述Level C-128，因为这里似乎是一片四维或者是更高维度的空间。这里没有重力、没有寻常意义上的景观，只有茫茫多的分形图形和奇奇怪怪的线和平面，还有看似立体几何的框架，但实则无碰撞体积的虚拟物体。除了在Level C-128内找到一个房间，里面有一个控制Level C-128数学模型的计算机库，否则任何录像设备在此处都无法使用，摄像机没有办法记录任何数据，截至目前，只有一些光怪陆离的照片和探险者的录音证明能这个层级的存在。奇怪的是，所有进入该层级的人都会认为自己看破了宇宙，他们说自己所处的三维世界是如此的狭窄拥挤，而Level C-128才是宇宙终极开阔之地。尽管他们的交谈以及行动能力未出现任何问题，但他们仍然会在三维层级中患上严重的幽闭恐惧症，以至于不得不接受强制精神治疗。
//
//尽管如此，人们还是根据传回的信息在计算机内模拟了Level C-128的场景。那些从Level C-128回来的人都坚定的认为这些模拟出来的每一帧画面都是他们亲眼所见的景象，科学家和心理学家在讨论后一致认为，Level C-128内的图像变化之快，以至于任何范围的细节都被进入了记忆当中，即使这些数据已经超越了人脑接受的适度值。因此，专家们推测可能是由于短暂时间内大量的数据不加以节制的涌入大脑，而导致他们患上了“幽闭恐惧症”这种用于“自我防卫”的症状。
//
//有人设想这一层级是由于C层群的拓展中出现的漏洞而导致的，但这种观点被后来的调查否决了。某些数学家依然在对模拟图像的形成进行更深层的探索，终于在系统全面的分析了探险者的口述和模拟数据后，得出了这片空间存在的原因。
//
//由于进入Level C-128会对生物体的大脑产生不可逆转的损伤，故M.E.G.已禁止任何人进入此层级，包括一切科研，或是所谓“探索宇宙最开阔之地”的理由。所有去过此层级的人都将终身与正常人隔离。
//
//警告：这张图片会使人产生不适
//点击查看第二张图
//
//基地、前哨与社区
//该层级不存在任何基地、前哨与社区。
//入口与出口
//入口
//在Level C-117使用至少四种不同颜色的喷漆将写有“健康生活”四个字的牌子完全遮住并将牌子扔进下水道，即可到达Level C-128。截至目前，M.E.G.组织队员已严加管控Level C-117内的所有喷漆。
//最早发现Level C-128的探险者来自Level √2的任意一扇门，这位探险者在回到C层群的基地后不久便因为精神问题自尽。
//一位回到基地的探险者坚称他在Level C-5即将被颜色吞噬时到达了Level C-128。但没有任何证据表明这位探险者的话是真实的。
//出口
//保持闭上眼睛至少12小时，将会被传送至Level C-166。
//到达Level C-128的卡勒巴格房间。
//]- 关闭
// 
//
//生存难度：
//不存在物质
//抽象空间
//危险已清除Level C-128是后室C层群的第128层。
//C1283.jpg
//描述
//Level C-128是由许多互相平行和垂直的彩色直线组成的抽象空间。本层级内无重力，无物质，彩色直线无碰撞体积，除了卡勒巴格房间，本层级中没有任何物理意义上的出口。
//
//由于本层级的危险性已被清除，故不再列入M.E.G.管控层级之内。
//
//基地、前哨与社区
//该层级不存在任何基地、前哨与社区。
//入口与出口
//入口
//在Level C-117使用至少四种不同颜色的喷漆将写有“健康生活”四个字的牌子完全遮住并将牌子扔进下水道，即可到达Level C-128。
//最早发现Level C-128的探险者来自Level √2的任意一扇门，这位探险者在回到C层群的基地后不久便因为精神问题自尽。
//出口
//保持闭上眼睛至少12小时，将会被传送至Level C-166。
//到达Level C-128的卡勒巴格房间。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1128{}