//Level C-192
//评分: 
//+26
//+
//–
//X
// 
//
//生存难度：
// 
// 
// 
//Level C-192是后室C层群的第192层，它是我们的天堂，是完美的伊甸之园，我们祖祖辈辈都生活于此。
//
//i9rHk8VxMO2uXeS.jpg
//在森林的某处拍摄的照片
//
//Nq8VD3MdPRY7jKQ.jpg
//祖先为我们开辟的道路
//
//fbY2tO9SJI1zrFw.jpg
//它秋天时的样子
//
//描述
//多年前，由欧米伽带领的龙血族残忍地杀害了这片圣地的生灵，并将这片圣地摧毁殆尽。但我们的祖先踏上了这片圣地，他们带来了众多树种，并在此地植树。现在，这里是一片繁茂的森林，是一片宜居之地。
//
//我们的太阳照耀着这片土地，它让这片土地有着充足的阳光光照，使树木茁壮成长。到了晚上，明亮的月光照着这片土地，让我们在晚上也有充足的光照。雨天，雨水从天空落下，灌溉着土地，使土地适宜耕种，也让树木长得更繁茂。
//
//自从此处变为森林，其他层级的生灵也来到了此处。我们的圣地只允许和平的生灵来到这片土地，截止至本篇文档撰写之时，也仅有无足鸟与狸花猫这两种生灵居住于此。有时，一些来自家乡的动物也会在此处突然出现，我们认为，它们就是这片圣地赐予我们的“礼物”。这里也有一些奇异的原生生灵居住在此，我们对它们知之甚少，建议你不要打扰它们。
//
//pIlivRPA1jGyCLo.jpg
//奔腾不息的河流，也是我们重要的水源
//
//在森林的河中奔流的水很多是能喝的，但是气味苦涩；尽管如此，仍然建议将水烧开再饮用。我们正在尝试减轻这令人不安的口感，把水收集到容器中，让其沉淀，这样就可以把在容器底部形成的淤泥移除。
//
//多年来，我们一直在维护这片森林，让它不受外人侵绕。一些外来的不怀好意的团队妄想侵占这片土地，皆被我们赶了出去。如今，只有The M.E.G.的成员居住在此处。如果你想来此处居住，我们也非常欢迎你，只要你不污染这片土地。
//
//动植物
//此地存在着一些原生的奇异生灵和植被，我们对此知之甚少，但为来到此处的流浪者的安全，我们还是把我们目前所掌握的资料告诉你们。
//
//折叠
//红牛1
//这种牛通体皆为红色，因此常遭受来自前厅的牛攻击。这种牛喜吃叶，肉质鲜美，能与小牛肉媲美，但建议不要滥杀，它们已因其他组织的过度捕杀而濒临灭绝。
//
//蓝狐
//这种狐狸通体皆为蓝色，它们喜吃肉，为群居动物，常常与同伴一起捕猎。目前已有关于蓝狐袭击人的目击报告，因此建议你在单独行动时携带武器，以免被蓝狐袭击。
//
//折叠
//红叶树
//这种树的叶子为血红色，令人不安，但它们其实并不危险。它们的果实我们称之为“血果”，“血果”汁水饱满，果肉酸甜，吃下后疲劳感就会立刻消失，很适合作为旅途中的补给。
//
//
//其他生灵与植被的详细资料我们还没有掌握，如果你有了这些生灵的详细资料，请第一时间报告给我们。
//基地、前哨与社区
//我们
//我们在此地自给自足，主要以农业为主
//当然，开放交易
//The M.E.G.研究所
//他们的团队专门研究此地的奇异生灵
//不开放交易，但较为友好
//入口与出口
//入口
//在任何有关森林的层级切入一棵红色叶子的树2都有可能来到此处，如Level 37，深红森林
//进入Level C-144郊区西面中的一处山洞可以到达此层级。但我们不建议你以此种方式来到此处，这样做是极其危险的，除非特殊情况。
//出口
//切入“红叶树”可能会使你来到任意一个宜居的层级。
//« Level C-191 | Level C-192 | Level C-193 »
//
//
//作者信息
//Footnotes
//1. 请勿将它与前厅中一种功能饮料联系在一起，两者毫不相干。
//2. 此树并非“红叶树”
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1192{}