//M. E. G. 数据处理系统
//\> srch LVL C 104
//
//错误：无效的层级编码
//
//\> srch LVL C 104 clearance 4
//
//错误：无效的层级编码
//
//\> srch LVL C 104 execute /storage/0/emulated/sc.dll
//
//错误：无效的层级编码
//
//需认证管理员密码：
//
//认证成功！
//
//\> opn doc LVL C 104
//
//正在为您读取文件 Level C-104 ……
//
///.../LVL_C_104_DEV_1.bdoc
//
//Level C-104
//
//Level C-104 是后室层群C的第一百零四层。当前的探索表明 Level C-104 内实体绝迹，适合作为探索中的临时据点。
//
//描述
//inside.png
//从 Level C-104 内部拍摄的图像。注意背景中的地球与明显的图像干扰。
//
//Level C-104 表现为一座大型空间站的内部，其所有已探明部分均处于完全失重状态。Level C-104 包含多个相连通的舱室。舱室内壁主要由一种无法分析、已知手段无法损坏的银灰色金属构成，部分位置安装有通风口、推测为辅助人员移动的金属握把、作用未知的管道及机械设备等物件。这些物件中的一部分可被拆毁，但与舱壁的连接处同样无法破坏。
//
//Level C-104 的部分舱壁上有舷窗，从中可观察到与前厅一致的星空，部分时段可观测到地球本身；然而，由于 Level C-104 没有通往外部空间的出口，且当前缺少破坏 Level C-104 结构的手段，尚不知晓舷窗中的场景是 Level C-104 空间站外存在的结构、或舷窗本身制造的幻象。
//
//Level C-104 的所有舱室通风口似乎均与一个空气循环系统相连接，该循环系统提供了 Level C-104 内部充足的氧气，并将 Level C-104 内的温度大致保持在25℃左右。但除了已知的通风口与通风管道外，该循环系统的主要工作部分与 Level C-104 的氧气储备来源均未被找到。由于通风口上覆盖的栅网为与舱壁相同的金属材质，当前无法通过通风管道追溯循环系统的中心；被放入通风口的小型机器人均在20秒至2分钟后失去信号。
//
//Level C-104 内的任何图像记录设备都被干扰，这主要表现为记录的图像均被覆盖一层绿色调，且产生了大量噪点。此效应的原理尚不明确，但当前认为这是无害的。
//
//Level C-104 的大部分舱室内安装了计算机终端，这些设备均可以正常使用以访问M.E.G.数据库。鉴于潜在的信息污染风险，如非紧急情况，请使用这些计算机终端访问网络，不要接入 Level C-104 的局域网。
//
//基地、前哨和社区
//无。
//
//入口与出口
//抵达 Level C-104 的方式尚不明确。
//
//[文件结束]
//\> opn doc LVL C 104 clearance 6
//
//需验证管理员密码：DOES THE BLACK MOON HOWL?
//
//\> test
//
//认证失败！剩余次数： 2
//
//\> ONLY WHEN ITSELF NOCLIPS
//
//认证失败！剩余次数： 1
//
//\> ONLY WHEN ITSLEF NOCLIPS.
//
//认证成功！
//
//正在为您读取文件 Level C-104 ……
//
//警告
//数据库拒绝了您的访问
//发生了致命的数据错误：访问信息非法。请检查您的网络连接是否正常，并确认您拥有存取此文件的权限。若您发现您正在试图存取超出权限的文件，请立即停止访问尝试并将错误信息上报至数据库管理员。
//
//监督者团队
//M. E. G. 最高决策委员会
//验证访问信息……
//
//欢迎，监督者 (null)。
//
//文件 Level C-104 是最高机密文件，当前已为您加载一份只读副本，这份副本将在稍后自动删除。剩余阅读时间：NaN
//
///.../LVL_C_104_DEV_6_oR.bdoc
//
//Ŀěv̆ệļ Ç-104
//
//LEVEL  C-104
//机密/5
//仅限监督者查阅
//生存难度：
//MAHDI
//风险等级：
//安全
//层级状态：
//稳定
//实体数量：
//绝迹
//结构
//map.svg
//Level C-104 已探索部分的平面图。
//
//Level C-104 至今未被完全探索。当前，Level C-104 已被探索的区域被分为10个分区：
//
//H1 区域是 Level C-104 的主厅，为一多功能连接舱。已知出入 Level C-104 的方式均需通过 H1 区域完成。H1 区域边缘有数个冷藏柜，其中有丰富的食物与饮品储备，包含压缩饼干、多种口味的压缩肉干（鸡肉、猪肉、牛肉均有）、瓶装纯净水、能量饮料、瓶装杏仁水等。H1 区域有4条通道连接。
//H2 区域是 Level C-104 的第二个连接舱。H2 区域内没有资源或特殊仪器设备，但其中央有一扇大型圆形舷窗，是已知 Level C-104 内最适宜观测星空与地球景象的区域。H2 区域有5条通道连接。
//1 区域是 Level C-104 的宿舍区域。该区域通道两侧共计8个舱室，这些舱室内设置有完善的生活起居设备，每个舱室允许至多4名人员同时居住。舱室内有稳定供水，卫生间内似乎存在人工重力场。尚未明确住宿设施内的水源与生活污水循环系统通向何处。
//2 区域是 Level C-104 的冬眠区域。该区域通道两侧共计8个舱室，均为冬眠用舱。冬眠舱均保存完好，可供人员进行上百年的长期休眠。被发现时，部分冬眠舱内存在无法辨识的人员尸体，由于冬眠舱功能齐全，尚不知晓这些尸体存在的原因。鉴于此，目前应谨慎使用冬眠舱。
//3 区域是 Level C-104 的储藏区域，推测 H1 区域的部分物资是从 3 区域移动至现在位置的。该区域通道两侧共计8个舱室。
//4 区域是 Level C-104 的功能区域，同时也是 H1 区域和 H2 区域之间的连接通道。该区域通道两侧共计8个舱室，分别为餐厅、医务室、健身房、各类娱乐场所等。
//5 区域与 7 区域均为 Level C-104 的研究区域，其通道两侧分别计9个舱室。这两个区域设置有大量实验设备与监测设施，包括用于测量材料物理化学性质、用于监控外界宇宙环境、用于生物实验的精密仪器。大部分仪器都镶嵌在舱壁中，可移动的设备当前作为公有资产留存于原位。
//6 区域可能是 Level C-104 的控制区域，其通道两侧共计8个舱室。8 区域内设置有多台终端与空间站内部相关仪表。然而，所有交互设备都无法操作，当前的所有证据似乎都表明 Level C-104 是完全自动控制的。
//8 区域是 Level C-104 的主要研究区域，延伸至尚未知晓的距离，其通道两侧舱室数量未被完全统计。与 5 区域与 7 区域的功能性设施不同，8 区域内的设施似乎都无法与前厅中的设备对应。有关 8 区域的相关探索尚未完成。
//基地、前哨和社区
//Level C-104 内没有相关团体建立的基地、前哨或社区。当前，Level C-104 的已探明部分整体处于M.E.G.控制之下，用作应急基地。
//
//入口与出口
//Level C-104 的入口与出口均为机密。在进入 Level C-104 前，流浪者应向M.E.G.监督者团队申请。申请通过后，流浪者将被进行全身麻醉，并在M.E.G.舱室安全保卫团队护送下前往 Level C-104 。
//
//Team - "CABIN SECURITY PROTECTION"
//
//舱室安全保卫团队
//
//CSP.svg
//舱室安全保卫团队行动用旗帜
//
//概述：舱室安全保卫团队是M.E.G.探索指挥部直属的综合小组，主要负责针对 Level C-104 的探索、研究与安保工作。舱室安全保卫团队被监督者团队特许使用M.E.G.军事部门掌握的重型武器，以支持其探索任务。舱室安全保卫团队的一切任务细节均为机密。
//
//人员名录（部分）：
//
//主管：Cpt. Aliana "Ally" Reed
//
//研究主管：Melisa Andrews → Katherine Corena
//
//安保主管：Anna Lang
//
//外勤主管：Olega Mikhailovna Kuznetsov
//
//自：研究员Saboria
//至：研究员Corena
//主题：关于 Level C-104
//
//最近我们都被调到这个层级的研究任务上来了。你应该读过现有的文件，不长，但很详尽。上头没有分配具体任务事项，一开始我还以为他们把人派到这个基本研究完成、就差一个探索任务的层级来实质上是安排带薪休假。
//
//但我仔细读过了这份文件，发现了一些无法解释的细节。你应该不会注意不到，这个层级的出入口都被隐去、就连团队内的我们都没有权限查看；一支针对特定层级的专门小组竟然被允许配备重武器，一切迹象都表明上头对我们隐瞒了什么。
//
//自：研究员Corena
//至：研究员Saboria
//主题：Re：关于 Level C-104
//
//你最近压力太大了。层级出入口的问题有外勤小组负责，或许配备重武器也是为了对付潜在的实体。别再关系这些问题，专心研究吧。
//
//自：研究员Saboria
//至：研究员Corena
//主题：我会进行调查
//
//不管怎么说，我不能放着这个问题不管。我会专心工作的，调查原有文件的细节问题是对 Level C-104 的研究的一部分。昨天你给我回复之前，我在这里的局域网里翻了一遍，找到一个开着的主机。我感觉我需要的信息就在那里面。
//
//自：研究员Saboria
//至：研究员Corena
//主题：发现
//
//层级内部局域网里的主机有加密，但并非无法破解。它的目录下有一个按M.E.G.标准格式编码的文件和其他几个文件夹。我只看了M.E.G.格式的文件，结果发现了半份层级文件——显然是被团队自己藏起来的，内容是 Level C-104 的出入口部分，结尾是乱码。
//
//ftp://.../LVL_C_104_E_O.ftm.bdoc
//
//入口与出口
//入口
//Level C-104 可通过层群C较后的层级中随机产生的金属气闸门进入；其中Level C-[数据丢失]西侧有一扇稳定存在的闸门，这是目前主要的进入方式。
//
//Level C-104 可通过在枢纽进行以下仪式进入：
//
//手持任意一把层级密钥，面向通向该层级的门站立。
//在门前生起一个火堆，应注意阻止火焰蔓延。将一只不论年龄的雌性耳廓狐（Vulpes zerda，广泛存在于Level [数据丢失]）、一只幼年雌性索马里狮（Panthera leo somaliensis，广泛存在于Level [数据丢失]）、一只江豚（Neophocaena，广泛存在于Level [数据丢失]）的骨粉混合投入火中。
//将层级密钥淋满杏仁水并投入火中。
//向火中投入三根死亡飞蛾的触须，并等待火焰上方冒出白色烟雾。
//如果火焰开始发声，不要对其作出任何回应，等待声音结束。
//此时，火焰将自动熄灭，你前方的门变成了一扇通向 Level C-104 的金属气闸门。这扇门可以直接手动打开。
//由于仪式耗费过大，一般不建议如此操作。
//
//出口
//Level C-104 的 H1 区域一侧有一扇姘旈椄闂紝鐩存帴閫氬悜鍓嶅巺
//自：研究员Corena
//至：研究员Saboria
//主题：Re：发现
//
//请你不要再纠结于这个了。关于没有指派工作的问题，分区领导小组已经把文件发给我了，我们的任务是调查科研区域的实验设备。至于你发现的那些文件，应该是其他研究员的恶作剧。我会帮你报上去的。
//
//自：研究员Saboria
//至：研究员Corena
//主题：Re：Re：发现
//
//我不明白你为什么一直在用重复的说辞搪塞我。这个层级肯定有问题——不论如何你都无法改变事实。最近你一直像在逃避问题、逃避麻烦，不愿相信组织内部存在管理问题，然而事实摆在这里——几份按标准格式撰写的文件，存储在层级内部的加密服务器上，分区小组却并不知晓。显然，驻守在这里的团队并没有将最新成果上报，这其中一定有原因，我们还不知道是什么。
//
//还记得十一年前，我们在那家便利店收银台旁卡进了墙里——几秒后便发现自己身在这个与便利店仓库无比相似却无穷无尽的地方。我们在扭曲的走廊与房间中穿行，用指甲扣开发霉的地毯充饥，祈祷这只是个噩梦。不管多大的苦我们都承受住了，两名女高中生，经过几个月艰难求生，极度疲劳、饥饿、缺水，倒在那个组织的据点前。 探险者总署
//Major Explorer Group
// 给了我们这里——“ 后室
//The Backrooms
// ”的基本生存指南、带领我们寻找物资和避难所、甚至给了我们接受高等教育的机会。
//
//这里本该是失足落入这里的流浪者们团结起来、齐心协力寻找出路的地方。但 Level C-104 并非如此——研究小组隐瞒了成果，把信息封锁起来。监督者们也许知道些什么，但并不打算公开。如今我们是研究小组的成员，我们难道不该查明原因、公布事实真相吗？
//
//……对不起，有些失态。但你应该看看我在这里找到的其他文件。我无法理解为什么研究小组会选择把它们藏在这里——这些文件，无论是真是假，都有被公开录入数据库、列为重点项目的理由。我不是在说研究小组或者监督者们做了错误的决策，但至少我应该有权利知晓为什么这些文件会被掩盖，为什么 Level C-104 的一切都像个谜，为什么监督者们采取如此决策。
//
//我真心希望我们的组织不会欺瞒。
//
//ftp://.../BRH/itembr.bdoc
//
//工程编号：███-075
//
//分级：初级-辅助-液体-无威胁
//
//传送目标位置：广泛
//
//描述：███-075是标准外勤人员功能饮料的衍生产品，配方经过微调。███-075主要添加必要的水、电解质、维生素，亦包含调节口味的杏仁味香精、香草提取物或玫瑰香精。███-075内含有微量███-275成分，这使得其具有一定药用价值。
//
//预计影响：███-075将成为人员生存的需求物资之一，这将支持其更远的探索。
//
//备注：目前生产了███-075的多个变体版本，将被随机投放以干扰人员的活动。
//
//███-075-A是不添加███-275成分的███-075变体，其中含有多种不同的毒性成分，亦含有多种神经兴奋物质。一般情况下，这些物质的效应会被███-075-A中的毒素所抑制，但这些毒性成分并不影响[已编辑]项目的生物性工程。
//███-075-B是添加指向性化合物███的███-075变体。███-080被设计自动远离指向性化合物███，███-075-B将作为有效驱离███-080的手段被发现。
//工程编号：███-080
//
//分级：初级-敌意-光影响-中威胁
//
//传送目标位置：Level 2与Level 3
//
//描述：███-080是一类经改造的标准战术无人机，主要由悬浮移动机构、武器系统与前部探照灯构成，探照灯被改造为类似人类面部的图样。███-080被启动后将自动寻找黑暗环境并前往待机，接下来任何进入黑暗区域的光源都将导致███-080的追逐与攻击。若识别到指向性化合物███，███-080将立即远离。
//
//███-080预留了远程控制系统，以在实验时将人员向指定方向引导。
//
//预计影响：███-080将大大提升黑暗空间的危险性。
//
//备注：██/██/██，███-080的识别模块发生严重程序错误，这导致指向性化合物███的驱离作用失效。
//
//工程编号：███-090-1
//
//分级：初级-敌意-生物危害-中威胁
//
//传送目标位置：Level 2
//
//描述：███-090-1是███-090的变体。其为一种朊病毒，一个静态时间锁定使其能在保持自身结构稳定的情况下于开放空间内广泛传播、复制。███-090-1能被正常人体免疫系统清除，但若人员失血过多、食物缺失、缺水、长期睡眠质量不足，则易被███-090-1感染。感染后，███-090-1将首先破坏患者上皮组织，这将导致数种皮肤病症状的产生；这之后███-090-1将先后攻击患者的肌肉、周围神经与中枢神经，最终使得这些组织被分解吸收。患者完全失去意识后，其代谢被终止，前期被分解的组织将在其皮肤上被频繁再生，复制的███-090-1将随患者体液一同流出。
//
//预计影响：███-090-1将在区域内不断传播并迫使人员改变其生存方式。
//
//工程编号：███-094
//
//分级：初级-敌意-生物危害-低威胁
//
//传送目标位置：Level 2、Level 3与Level 5
//
//描述：███-094是取自一次ARBH事件的异常蛾类昆虫。其具有极强的繁殖能力，具体表现为只要一对性别不同的███-094个体摄入足够食物后相聚，它们将融为一体并分裂为5~8个子代个体。这种繁殖方式被认为是███-094基因组内混入了来自Chortoicetes terminifera genghis的部分基因所致。雌性███-094具有强烈敌意，并能分泌毒液。投放至Level 5以下的███-094大多数为雌性并被人为避免相遇，这使得这一群体的个体大小普遍更大。
//
//预计影响：███-094将模拟一次小型的ARBH事件并促进人员开发对应的武器与防具。
//
//自：研究员Corena
//至：研究员Saboria
//主题：Re：Re：Re：发现
//
//算我求你了，Sue，别再翻这些文件了。它们都是研究员的恶作剧。相信我。
//
//自：研究员Saboria
//至：研究员Corena
//主题：Re：Re：Re：Re：发现
//
//你和他们一样，也在隐瞒着。为什么？
//
//我想信任你，Kat，但我做不到。
//
//事故处理公报
//
//昨日，舱室安全保卫团队研究小组成员Susanna Saboria试图向后室档案库上传共计5份违规文件，所有文件均含有大量未经确认的虚假信息与恶意嵌入程序。S. Saboria在办公处被当场抓获，处无限期禁闭。针对类似恶意破坏行为，探险者总署将高度重视、严肃处理。
//
//探险者总署纪律委员会
//
//自：研究员Corena
//至：研究员Saboria
//主题：对不起
//
//我想保护你，但你还是一意孤行——其实我一开始就想到会是这种情况。
//
//Sue，这些文件的存在，我们的所有直属上级都清楚不过，但他们都签了保密协议，——包括作为特派研究员的我。我不能对研究小组成员透露这些，但泄密受到的处罚，不论是否知晓文件的机密性……都是一样的。
//
//听说记忆控制技术已经取得了突破，你的最好结局就是接受记忆清除、调离这里了吧——我们永远也不可能再度共事了。
//
//\> mark (doc LVL C 104 clearance 6) '' public
//
//文件 Level C-104 已被标记为 Public 。
//
//\> opn doc LVL C 104 further_research clearance 4
//
//正在为您读取文件 Level C-104（进一步研究记录）……
//
//主管级会议记录
//
//[记录开始]
//
//Reed：首先，我想向大家报告的是……前任研究主管Andrews的尸体已经找到。这次探索任务的失败是彻底的，我们永远失去了一位好同事、好同伴。
//
//与会者默哀三分钟。会议室的屏幕上显示了任务简报。
//
//Lang：我也需要致以歉意。应该说，保卫同事们的人身安全本应是安保部的职责。
//
//Reed：命运在我们之中留下了伤痕，但前进的道路仍会不断延伸。我们应该铭记Andrews的贡献，不过我们也不应轻视她的接班人——Corena研究员。
//
//稀疏的掌声。Corena神情严肃，缓缓起身。
//
//Corena：感谢，Reed主管。我们的工作仍在继续。Level C-104的探索工作尚未完成，只要这种状态持续一天，人员安全就一天得不到保障。目前，我们的主要研究任务是弄清楚这里科学设备的运作方式，但缺乏明确的方向导致进展十分缓慢。我提议继续组织探索，——在保障人员安全的前提下。
//
//Reed：十分同意。我想我们无需继续组织武装队伍进行探索，人数太多容易互相影响、酿成上次那样的悲剧。我们可以每次只派出一名外勤特工进行探索，这样的话即使出现变故，也能减少损失。有什么异议吗？
//
//Lang：没有异议。
//
//Corena：没有异议。
//
//Kuznetsov：对于探索任务本身没有异议，但Reed主管，你刚刚的说辞让我感到不快。“减少损失”——人命对你来说只是数字吗？
//
//Reed：我承认我的表达有问题。既然没有异议，可以散会了。
//
//Kuznetsov：不，Reed。研究员Saboria的事情我还没找你算账呢。你拿保密协议上的内容去管根本没签过的人？
//
//Corena：别说了，我相信Reed是出于信息管控的——
//
//Kuznetsov：我还以为你和Saboria有十几年的友谊，会尽可能帮助她——没想到你早就变得和这帮人一样了。
//
//Corena：你不知道你在说什么。
//
//Kuznetsov：我明确一下我的意见。我同意继续进行探索任务，——反正探索任务不是你们负责的部门承担，不论任务怎样都不会对你们造成影响——但我同意的条件是，只要有一名特工因为你们的决策失误而失去生命，我要Reed女士立即辞职。
//
//Reed：表决已经通过了，没有什么可谈的。
//
//[记录结束]
//
//关于团体“后室控股”的后续报告
//
//logo2.svg
//后室控股
//概述：“后室控股”是于 Level C-104 局域网内发现文件中多处提及的团体，尚无证据表明其真实存在。根据发现的文件，“后室控股”是后室内大部分超常现象的制造者、也是后室本身的创造者。当前，这些信息均无法被证实或证伪。以下为部分相关文件摘录。
//
//安保设施档案
//Sector-OγB
//官方名称：深空特殊研究设施 Sector-OγB
//
//识别码：OXYTOCIN-Sector-O-Gamma-B
//
//简介：Sector-OγB是一个位于地球同步轨道的机密设施，主要作为基于[已编辑]项目的研究、监测工作平台使用；其他相关信息均属高度机密。
//
//位置：地球同步轨道，相对地面[已编辑]°E，0°N同步运行。
//
//详细信息：Sector-OγB改造自原██████████-γ的空间站自组平台，于20██年正式竣工投入使用。Sector-OγB以原空间站组件的中轴线为核心扩建，增加了5个侧翼及相关舱室。目前安装完成的循环系统与生活物资储备可供站点内所有人员断绝外界联系的情况下生存10年以上。
//
//后室项目时间线
//技术支持：███-██
//1982年
//
//时空技术研究开始。
//
//1984年
//
//重大事故发生，实验中的传送系统发生爆炸，整个实验设施被拖入意外制造的口袋宇宙中。经过数月恢复与重建，时空技术研究最终被无限期暂停；该口袋宇宙被作为后续项目的基础。
//
//1987年
//
//███-██初步确认时间点-Ω与其后发生的灾难性事件，后室项目被提出。
//
//1991年
//
//后室项目建设开始。
//
//2017年
//
//后室项目基础设施基本完成，相关人工智能操作员测试开始。开始于内部招募志愿者。
//
//2021年
//
//人工智能技术取得重大突破，满足了指标要求。代号“噎鸣”的附加项目被提出，旨在增加后室内部生存难度。
//
//2022年
//
//全部文件撰写完成、全部相关设施建造完成、人工智能操作员安排完毕，后室项目正式开始运行。
//
//
//
//
//
//
//
//
//
//
//
//2035年
//
//将到达时间点Ω。后室一切设施出口将按计划打开。
//
//探索记录 LC104R01
//
//时间：██/██/██
//
//指派人员：M.E.G.外勤特工，Dzhonna Valtez
//
//[记录开始]
//
//特工Valtez：我准备好了。
//
//联络员：好。你的任务是前往上次探索到达的最远距离，从那里开始继续前进，并且记录观察到的信息。这次任务很可能有去无回，你确定你的心理状态正常吗？
//
//特工Valtez：没有问题。
//
//联络员：现在请开始前进。
//
//特工Valtez从H2区域出发，利用舱壁上的握把快速移动。约4分钟后，她抵达上一次探索的最远距离。特工Valtez在通道中央稳住身体，靠近一侧的舱门。
//
//特工Valtez特别指出了舱门上的一道铭牌。这块铭牌使用螺栓固定在舱门中央，有明显的氧化锈蚀痕迹与擦痕。铭牌上的字迹模糊不清，但能勉强辨认出“后室控股”、“Backrooms Holding”。
//
//特工Valtez：后室控股……听起来像个团体的名字。总署有相关记录吗？
//
//联络员：这是首次记录。请进入这个舱室。
//
//特工Valtez开始操纵舱门。尽管所有锁定均被解除，舱门仍未打开，似乎被某种力量吸住；但舱门气压计显示内外气压正常。Valtez借助舱壁发力，舱门最终被拉开，伴随着大量白雾自内涌出。
//
//特工Valtez：这里面很湿。
//
//特工Valtez进入舱室。充满舱室内部的白雾逐渐消散，可见其内部与 Level C-104 标准化的舱室结构没有区别。舱室内中央放置有一台无法辩识的仪器，大量缆线接入舱壁中。仪器顶端是一个玻璃筒，顶端有明显的撞击痕迹，推测其曾被小型钝器击打。筒身有一块金属铭牌，锈蚀痕迹与舱门上铭牌相类似。特工Valtez靠近仪器，可见铭牌上刻有数种语言书写的“遗忘”。
//
//特工Valtez：这是什么？
//
//特工Valtez绕到仪器另一面，注意到一个连接在仪器主题部分的显示屏。屏幕上显示了这台仪器的摄影图像，与实际状态不同的是，玻璃筒内充满液体，其中悬浮着一枚有节律搏动的人类心脏。屏幕下方显示有中文、英文、希腊文书写的“隐藏”一词。
//
//联络员：试试操纵这台仪器。
//
//特工Valtez：明白。
//
//特工Valtez围绕仪器移动几圈，并未找到交互设备。她尝试轻触显示屏，图像随后消失，屏幕上显示出后室数据库的标记。
//
//主管Corena：这些信息很可能至关重要，因此现在由我来指挥。Sa——Valtez，请继续检查这个屏幕。
//
//屏幕上显示出大量无意义字符，并快速闪动。特工Valtez尝试点击屏幕，但没有效果。屏幕上的字符继续变化，其疏密变化逐渐构成一副图像：一个边缘模糊的等边三角形。
//
//特工Valtez：这……不对劲。
//
//舱室内的灯光开始有节律地闪烁。稍后，特工Valtez的信号开始同灯光闪烁同频率波动，最终消失。
//
//[记录结束]
//
//当前，尚不知晓特工Valtez是否存活。后续探索任务正在讨论中。
//
//自：外勤主管Kuznetsov
//至：主管Reed
//主题：（无主题）
//
//你是认真的？把一位研究员洗了脑派过来做外勤任务？我早该知道你们为达目的会做出什么。
//
//自：主管Reed
//至：外勤主管Kuznetsov
//主题：Re：（无主题）
//
//完全控制住 Level C-104 是目前我们的第一任务。让违反规定的研究员来承担危险指数较高的任务是最符合我们当前情况的选择。
//
//自：外勤主管Kuznetsov
//至：主管Reed，抄送：全体小组成员
//主题：Re：Re：（无主题）
//
//为我们的工作作出卓越贡献的研究员Saboria被进行记忆清除后违规指派外勤任务，现在生死不明。我已经查阅过所有相关记录，现在我将继续Saboria未完成的调查。我将亲自前往 Level C-104 的 8 区域。
//
//警告
//致命的数据错误
//鍙戠敓浜嗚嚧鍛界殑鏁版嵁閿欒锛氳闂俊鎭潪娉曘
//
//.hovertip { max-width: 400px; }
//鏌ユ偍鐨勭綉缁滆繛鎺ユ槸鍚︽甯革紝骞剁‘璁ゆ偍鎷ユ湁瀛樺彇姝ゆ枃浠剁殑鏉冮檺銆傝嫢鎮ㄥ彂鐜版偍姝ｅ湪璇曞浘瀛樺彇瓒呭嚭鏉冮檺鐨勬枃浠讹紝璇风珛鍗冲仠姝㈣闂皾璇曞苟灏嗛敊璇俊鎭笂鎶ヨ嚦鏁版嵁搴撶鐞嗗憳銆
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1104{}