//Level C-113
//评分: 
//+28
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//Level C-113是后室C层群的第113层。
//
//描述
//Level C-113表现为一座无边无际的非线性空间，外观类似于前厅的大型纪念品商店内部。该层级主要照明来自屋顶的LED灯管、射灯及霓虹灯。
//
//尽管通过温度计精确测量出该层级的温度仅有-7.3摄氏度，但体感温度仍为舒适宜人的20摄氏度左右，且人类的正常身体机能及物质与温度相关的基本性质同样受该种异常特性影响。1
//
//e23acd6b2a9d2643.jpeg
//付款区
//
//层级结构主要分为付款区和商品区。
//
//付款区
//付款区中部为收银台，收银台上的设备均无法使用。收银台外侧10米处为玻璃正门、砖墙及镶于墙体的玻璃窗，玻璃正门与玻璃窗外均为高亮度的白色未知区域。
//
//流浪者以正门为中心，向除正门外的任意方向运动，无论去程的路程有多长，返程路程2总比去程路程长9倍。
//
//付款区墙体上粘贴有巨型“后室旅游集团”3图案与字样，以及一段文字：
//
//-关闭标语
//3cc32fdb24d8a488.png
//后室旅游集团
//欢迎来到后室旅游集团旗下的忘返纪念品商店！
//也许当您来到这里时，您的旅程可能即将结束，不过没有关系，如果您依然对后室的美景充满不舍，不妨挑选几件心仪的纪念品带回家，与您的家人分享您在后室的欢乐时光，或许有朝一日也能与他们一同畅游后室。
//无论何时我们都再次期待您光临后室，请记住，这里永远对您开放，永远是您的家。
//最后，感谢您光顾忘返纪念品商店，祝您旅途愉快！
//
//商品区
//商品区主要由不规则放置的货架及软木地板过道组成。该区域中照明光线转为暖色光，照射出温馨的橙黄色。
//
//尽管Level C-113内无明显的音响设备，但依然可以听到类似于爵士乐4的乐曲，乐曲速率相对柔缓、平静，在整座层级内循环播放。尚未找到与之对应的前厅歌曲。
//
//木质货架上摆满各式的纪念品，纪念品底部或包装上除印有“后室制造”外无任何其他标识。纪念品类型与前厅大体相当，常见纪念品包括但不限于冰箱贴、雪花玻璃球5、玩偶公仔、模型等。
//
//XF4Y8A.jpg
//外观为雪花玻璃球的纪念品
//
//Level C-113内的大部分纪念品的外观风格来自各个已知层级6，具有层级特色。任何纪念品都有可能是离开该层级7过程的必要部分，且前往的层级往往与纪念品本身有关。
//
//流浪者需要与相关纪念品进行特定的交互方式，方可切入相关层级。
//
//为保障流浪者安全，M.E.G.列出下列可切出该层级的纪念品清单8供流浪者参考，目前仍在更新中。请仔细阅读，以免误入危险层级。
//
//- 关闭清单
//编号：C113-000
//纪念品：一张暗黄色潮湿地毯
//交互方式：平躺在地毯上入睡
//切入层级：Level 0
//备注：欢迎回到梦开始的地方
//
//编号：C113-001
//纪念品：一把斧子
//交互方式：利用斧子劈砍任意木质结构，待缺口大小合适后，将面部伸入缺口
//切入层级：Level 5
//备注：Here's Johnny！
//
//编号：C113-002
//纪念品：一把高脚椅
//交互方式：坐在高脚椅上口述至少一个调侃他人的冷笑话，并使自身面部遭到较大的冲击力
//切入层级：Level 74
//备注：/
//
//编号：C113-003
//纪念品：一副滑雪镜及滑雪面罩
//交互方式：正确佩戴后呼出热空气使滑雪镜上出现白雾，直至无法看清前方
//切入层级：Level C-183
//备注：/
//
//编号：C113-004
//纪念品：一扇屏风
//交互方式：推倒屏风，在其倒地后面向屏风鞠躬9并用日语说出“对不起”
//切入层级：Level 178
//备注：/
//
//编号：C113-005
//纪念品：一个内部装饰有古典英伦式建筑的雪花玻璃球
//交互方式：将雪花玻璃球抛向空中并在下落时精准撞击流浪者头部
//切入层级：Level 790
//备注：疼吗不建议尝试
//
//编号：C113-006
//纪念品：一台手持式扩音器
//交互方式：通过扩音器发表抗议或者具有激进性质的言论
//切入层级：Level C-29
//备注：/
//
//编号：C113-007
//纪念品：一个兵俑手办
//交互方式：面向兵俑手办大声辱骂皇帝
//切入层级：Level C-196
//备注：你再骂
//
//编号：C113-008
//纪念品：N/A
//交互方式：双眼直视地板上一点超过30分钟
//切入层级：Level C-31
//备注：/
//
//编号：C113-009
//纪念品：一箱彩色积木
//交互方式：搭建一座模型城市
//切入层级：Level 11
//备注：/
//
//编号：C113-010
//纪念品：多座微型铜制骆驼雕像
//交互方式：将大于等于5座的骆驼雕像摆成一排，并使其成多米诺骨牌状10依次倒下
//切入层级：Level C-37
//备注：不建议尝试除非你想想尝尝红荨麻的滋味
//
//编号：C113-011
//纪念品：N/A
//交互方式：未携带任何纪念品，从正门离开该层级
//切入层级：Level 36或终点
//备注：流浪者会受到长达12小时的怀念与不舍的精神影响，该影响会促使流浪者在12小时内不惜一切代价再次返回Level C-113真的不留点儿纪念就空手回家吗（失落）
//
//编号：C113-012
//纪念品：一块红色的圆柱体橡皮
//交互方式：在任意平面上摩擦使橡皮与平面接触点温度超过40摄氏度
//切入层级：Level C-77
//备注：已失效
//
//编号：C113-013
//纪念品：一个外观为风车的八音盒
//交互方式：转动风车扇叶11，在八音盒播放音乐时食用由实体烹制的食物
//切入层级：Level C-198
//备注：/
//
//编号：C113-014
//纪念品：一个表面受磨损的蓝色口琴
//交互方式：使用口琴吹奏一首与自然有关的古典轻音乐
//切入层级：Level C-33
//备注：/
//
//编号：C113-015
//纪念品：一张绘有现代城市的明信片
//交互方式：用明信片切割面包使明信片与任意甜品接触
//切入层级：Level C-117
//备注：/
//
//编号：C113-016
//纪念品：一卷绘有保罗-西蒙斯的霓虹海报
//交互方式：将海报的正面贴在地面或墙体上，并使其在表面上反复摩擦
//切入层级：Level C-70
//备注：/
//
//编号：C113-017
//纪念品：一个已充满气的气球
//交互方式：放出气球内的气体，并在此过程中发出类似“排矢气12”的声音
//切入层级：Level FUN
//备注：和我们一起开派对吧=）不建议尝试
//
//编号：C113-018
//纪念品：一个内部装饰有小木屋的雪花玻璃球
//交互方式：摇晃雪花玻璃球致球内雪花纷飞
//切入层级：Level C-93
//备注：/
//
//编号：C113-019
//纪念品：一架钢琴13
//交互方式：弹奏《猪八戒背媳妇》14
//切入层级：Level C-141
//备注：非常高雅
//
//编号：C113-020
//纪念品：一桶爆米花及其纸桶
//交互方式：将爆米花纸桶倒扣在头部
//切入层级：Level C-53
//备注：/
//
//编号：C113-021
//纪念品：一把折扇
//交互方式：手持折扇敲击其他流浪者头部
//切入层级：Level C-90
//备注：/
//
//编号：C113-022
//纪念品：一个刻有“捷列夫”的门把手
//交互方式：将门把手抵在任意木质平面上，口中念出非正常声调的“氢、氧、碳、氯、铀”五种元素，随后转动门把手，做出开门动作
//切入层级：Level C-146
//备注：“qìng、yāng、tán、lǖ、yòu”——这是第一位发现该交互方式的流浪者所念出的读音
//
//编号：C113-023
//纪念品：一面镜子
//交互方式：需两人同时出现在可观察到的镜内，两人与镜子中的对方对视5秒
//切入层级：Level C-78
//备注：/
//
//编号：C113-024
//纪念品：一个猫食盆15、一个狗食盆、一袋猫粮及一袋狗粮
//交互方式：将猫粮倒入狗食盆至溢出，狗粮同理
//切入层级：Level C-84
//备注：要不要自己先尝尝
//
//编号：C113-025
//纪念品：一桶紫色颜料
//交互方式：将身体任意器官完全浸没在颜料中
//切入层级：Level C-136
//备注：/
//
//编号：C113-026
//纪念品：一个栓有红绳的葫芦
//交互方式：从葫芦嘴猛吸其内部的含酒精气体并挥舞拳头
//切入层级：Level C-79
//备注：/
//
//编号：C113-027
//纪念品：一张硬盘
//交互方式：用超过3000N16的压力压在硬盘上
//切入层级：Level 404
//备注：/
//
//编号：C113-028
//纪念品：一张黑色纸片
//交互方式：用任意颜色的笔在纸片上画出一个完整圆形及一条不规则曲线
//切入层级：Level C-86
//备注：这是通往我们集团最著名主题乐园的捷径哦！
//
//编号：C113-029
//纪念品：一罐任意颜色的水墨
//交互方式：将水墨泼在任意白色表面17上，并试图抹匀
//切入层级：Level C-81
//备注：/
//
//编号：C113-030
//纪念品：多本书籍或杂志
//交互方式：将大于等于5本书籍或杂志的书页叠放在一起后抛向天空
//切入层级：Level C-110
//备注：不建议尝试
//
//编号：C113-031
//纪念品：一个实体毛绒玩偶18
//交互方式：用力挤压或踩踏玩偶
//切入层级：Level C-195
//备注：实体那么可爱为什么要伤害实体
//
//编号：C113-032
//纪念品：一辆沾满泥土和草屑的独轮车
//交互方式：将大于等于15件可交互的纪念品装入独轮车，在推行一段路程后一并倾倒出来
//切入层级：Level C-8
//备注：条条大路通C8
//
//编号：C113-033
//纪念品：一个麦克风
//交互方式：手持麦克风随层级内播放的爵士乐进行即兴填词演唱，填词内容没有要求，演唱过程中演唱者心率需到达140
//切入层级：Level C-299
//备注：据悉第一位发现该方式的流浪者的填词为《纤夫的爱》19中的歌词
//
//编号：C113-034
//纪念品：一个地球仪
//交互方式：拥抱并亲吻地球仪
//切入层级：未知
//备注：据报告，完成上述交互方式的流浪者均当场消失，M.E.G.正在对此进行调查。出于保护流浪者的安全，M.E.G.提醒流浪者切勿因好奇而与该纪念品进行交互。
//
//编号：C113-035
//纪念品：一个内有两名儿童的雪景球
//交互方式：以任意方式摧毁雪景球
//切入层级：Level C-❅
//备注：贴合现实，不是吗？
//
//编号：C113-036
//纪念品：一个太阳系模型
//交互方式：用任何塑料制品放在太阳系模型中月球的位置24秒以上
//切入层级：Level 24
//备注：该交互方式目前已经成为采集塑料的主要渠道
//
//编号：C113-037
//纪念品：一张由一次成像相机拍摄的Level C-490公园中黄昏的照片
//交互方式：把照片斜放入任何的相册最后一页
//切入层级：Level C-490
//备注：由于Level C-490的毁灭，目前此纪念品已失效。
//
//编号：C113-038
//纪念品：一个闹钟
//交互方式：大喊“我要开动喽！”20，并将闹钟塞入口中
//切入层级：Level C-186
//备注：/
//
//编号：C113-039
//纪念品：一个蓝色沙盘，以及旁边用于摆放玩具的三层木柜
//交互方式：用木柜最下层左手边的老旧建筑模型在沙盘中搭建城市模型，然后将木柜最顶层的悲尸玩具放入城市模型中，并指着悲尸玩具说“这个就是我”。有传言称在城市模型上洒水可以提高切入成功率。
//切入层级：Level C-284
//备注：为什么别的层级交互方式这么简单，我的就这么复杂？复杂就算了还带成功率的？我不能接受！我不能接受！
//
//编号：C113-040
//纪念品：一幅画有彭罗斯三角的画作，一个莫比乌斯环纸带
//交互方式：在莫比乌斯环上描摹彭罗斯三角
//切入层级：静谧地带
//备注：/
//
//编号：C113-041
//纪念品：一台老旧九寸电视机
//交互方式：大喊“我要穿越！”，并用头部撞击电视机屏幕
//切入层级：Level C-399
//备注：/
//
//编号：C113-042
//纪念品：一卷透明胶带
//交互方式：将胶带粘贴在腿部并快速撕下
//切入层级：Level C-170
//备注：很痛对吧
//
//编号：C113-043
//纪念品：一双跳绳
//交互方式：进行跳绳运动并在过程中反复改变跳跃方式
//切入层级：Level C-208
//备注：/
//
//编号：C113-044
//纪念品：一桶鱼饵
//交互方式：嘴中咀嚼鱼饵并称赞其味道极佳
//切入层级：Level C-293
//备注：/
//
//编号：C113-045
//纪念品：一根白桦木柴
//交互方式：使木柴在地面上滚动，并使移动总路程达到19.2米左右
//切入层级：Level C-236
//备注：/
//
//编号：C113-046
//纪念品：一把玩具左轮手枪
//交互方式：在玩具左轮手枪装入一颗玩具子弹。将手枪在任意水平面上自由转动，并在旋转即将停止时迅速举起手枪对准包括自己在内的任意生命体，扣动扳机。
//切入层级：Level C-237
//备注：午时已到
//
//编号：C113-047
//纪念品：一盒火柴
//交互方式：点燃一根火柴并在空中反复挥舞
//切入层级：Level C-416
//备注：/
//
//编号：C113-048
//纪念品：一只水色为蓝色，油色为淡蓝色的入油摆件，内有漂浮的树脂“冰山”和冰山上方的“破损船只”，底座刻有汉字行书“大海航行靠舵手”
//交互方式：拿起摆件，用力摇晃至少三下后切入
//切入层级：未知Level C-524
//备注：这个摆件和Level C-524中的景象惊人的相似。死者尸体被资料库#000000的成员送到了Level 48。M.E.G.提醒流浪者，为了生命安全，切勿用力摇晃该摆件。
//
//编号：C113-049
//纪念品：一个用于探险活动的双肩背包
//交互方式：背上背包，用食指指向货架间的远处
//切入层级：Level C-408
//备注：向着远方出发！
//
//编号：C113-050
//纪念品：一个底部刻有“BASA”的球形玻璃鱼缸
//交互方式：将鱼缸倒扣在头部，并说出“休斯顿，我们有麻烦了”
//切入层级：Level C-335
//备注：/
//
//编号：C113-051
//纪念品：一袋外表类似水泥砖块的华夫饼
//交互方式：不间断食用至少十二块华夫饼
//切入层级：Level 170
//备注：你要噎死我
//
//编号：C113-114
//纪念品：一卷沾满深红色颜料的绷带
//交互方式：将绷带缠到任意手臂上，然后做出任意主观动作，比如“摆造型”
//切入层级：Level C-114
//备注：/
//
//编号：C113-477
//纪念品：一包闪光彩条，内含粉色、紫色和黑色的彩条。
//交互方式：挥洒彩条，保持仰视并闭上双眼
//切入层级：Level C-633
//备注：/
//
//编号：C113-514
//纪念品：一个依山而建的中式南方村落形象的冰箱贴
//交互方式：使冰箱贴附着在任意金属表面上，并逆时针旋转冰箱贴数圈
//切入层级：Level C-514
//备注：/
//
//编号：C113-517
//纪念品：一个杯壁外侧绘有黄色笑脸的咖啡杯
//交互方式：表情平淡地用咖啡杯盛接任意液体并一饮而尽
//切入层级：空白房
//备注：平平淡淡才是真
//
//编号：C113-525
//纪念品：一台超级玛丽手持游戏机
//交互方式：在超级玛丽的第1关连续死亡二十五次
//切入层级：Level 25
//备注：一跪不起
//
//编号：C113-810
//纪念品：一大盘螺旋状巧克力冰淇淋的橡皮泥制模型和一条在货架上被其压住的巧克力色的地毯
//交互方式：呈“大”字形躺在地毯上，将模型放在地毯上，对着天花板张开嘴，眨一下眼睛。
//切入层级：Level 226
//备注：会员制餐厅特供
//
//编号：C113-909
//纪念品：一大堆塑料制的人体面部器官
//交互方式：将这些全部人体面部器官放入黑色袋子并扎紧袋口
//切入层级：Level 909
//备注：有点恶趣味，但不多
//
//更多纪念品正在发现中……
//
//- 关闭清单
//当流浪者通过纪念品离开Level C-113后，所携带的纪念品并不会随之消失。部分纪念品的可切入其他层级的特性仍能保留，但成功概率大幅下降，且极易损坏。使完好的纪念品再次处于Level C-113中，方可恢复其特性。
//
//曾出入Level C-113的流浪者均反映在该层级感受到对后室前所未有的留恋，对后室的焦虑与恐惧等负面情绪情感将大幅消减。从而导致流浪者对潜在威胁的警惕度和重视程度下降，造成生命危险。
//
//- 关闭通知
//M.E.G.在此敬告出入Level C-113的流浪者：
//不管你有多爱这里，旅途终将结束，这里并非是我们最后的归宿，最终都是应该回家的——回到我们真正的家园。
//
//层级内的纪念品均无法被破坏，位于货架上的纪念品及被破坏的结构以6小时为周期刷新，无随机变动。值得一提的是，刷新时全部区域将出现短暂停电，一般为32秒。在该时段内会出现以下现象：
//
//层级内所有光源毫无征兆的熄灭
//任何与纪念品的交互方式都将失效。
//通过任何方式恢复或创造光照均不可行。
//上文中的温度异常将消失，体感温度骤降至0度以下。
//爵士乐暂停播放，届时整个Level C-113将陷入寂静。
//流浪者普遍反应会感到突如其来的恐惧和紧张，即使黑暗中不存在实质性的威胁。
//刷新时段结束后，一切将恢复正常，恐惧与紧张的感受也将被更加强烈的安心与轻松所取代。
//
//基地、前哨与社区
//探险者总署（M.E.G.） - “旅行社”Level C-113层级中转站
//据点位于付款区收银台处
//常驻人员10～13人
//愿意为流浪者提供杏仁水等补给与纪念品清单
//友好且开放贸易
//在此研究纪念品交互方式和引导流浪者
//不结盟贸易集团（B.N.T.G.） - “免税店”Asset 113-C贸易中心
//据点位于付款区正门附近
//常驻人员25人
//友好且开放贸易，主要交易纪念品
//与M.E.G.“旅行社”前哨站因控制纪念品合理交易问题意见不合而关系不佳，但未发展为冲突
//收藏家
//无固定据点
//由5名爱好旅行和收藏的流浪者组成
//接受其他流浪者的加入，前提是该名流浪者需要讲述一段自己真实的旅行经历
//不提供任何物资，但会向无敌意的流浪者提供纪念品
//友好但不接受除纪念品换取物资外的其他贸易
//入口与出口
//入口
//在Level C-110找到一本被损坏的后室旅游指南，用手指完整勾勒指南上“后室旅游集团”图案，将切入Level C-113正门前。
//更多入口正在探索中。
//出口
//详见上表。
//更多纪念品交互等待着您的发现
//如果您有意要为Level C-113的纪念品交互清单作出贡献，请按照以下步骤添加您的纪念品：
//
//请选择一个您想交互的层级21
//思考一个合适的纪念品
//给予它一个符合“C113-XXX”格式的编号，编号可以不遵循排列顺序，但不可重复或超出三位
//为它编写一个光怪陆离的交互方式
//您也可以选择填写有意义的备注或直接在备注栏输入“/”
//请将以上内容代入以下格式：
//[[div class="styled-quote"]]
//**编号**：C113-XXX
//**纪念品**：（注意纪念品字体要加粗）
//**交互方式**：（此处要求同上）
//**切入层级**：（需要链接）
//**备注**：
//[[/div]]
//
//代入并检查无误后，复制粘贴至清单末尾（注意空行）
//请在作者展示里用“C113-XXX来自[[*user 你的用户名]]”的格式加上您的姓名，并列出您贡献的纪念品编号
//原作者可能对您的纪念品交互做适当完善，请见谅。同样地，原作者会对描写不合适的、内容极其无趣或格式错误的纪念品进行大改或清除
//未经允许请勿对其他内容进行改动，违者必究
//感谢您为后室旅游集团与M.E.G.做出的贡献
//作者信息
//« Level C-112 | Level C-113 | Level C-114 »
//
//脚注
//1. 仍符合20摄氏度时的情况
//2. 原路返回
//3. 未知组织，已对其展开调查
//4. 前厅一音乐类型
//5. 又称“水晶球”
//6. 不仅限于C层群
//7. 指Level C-113
//8. 所有切出方式来自流浪者报告，全部为意外发现，其中部分的发现过程至今无从得知
//9. 呈90度
//10. 前厅的一种骨牌游戏，原理与蝴蝶效应相似
//11. 即发条
//12. 也称放屁
//13. 不处在货架上，通常位于货架之间
//14. 前厅电视剧《西游记》相关曲目
//15. 该纪念品表面有明显标识，下同
//16. 约0.306吨
//17. 可为非平面
//18. 包括无面灵、派对客、肢团、猎犬等形象
//19. 前厅上世纪九十年代的普通话歌曲
//20. 日语同样适用
//21. 层级、子层级、隐藏层级、房间皆可
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1113{}