//Level C-120
//评分: 
//+10
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
//安全
//稳定
//无有害实体
//Level C-120在2019年3月15日被“后室娱乐”发现并管理，
//
//800px-Study_room.jpeg?2 0120830103717
//Level C-120的一张照片
//
//描述
//Level C-120表现为一间面积较大的房间，外观类似于图书馆或自习室，房间内有30张桌子，每张桌子都有编号，桌子固定在地板上且无法移动，每张桌子旁都有一把椅子，层级中的Wi-Fi信号较好。
//层级的墙边靠着一些透明玻璃柜，墙上贴有各类桌游的广告和介绍，玻璃柜里只存在各种类型的桌游和其说明书，层级中有一个冰箱，但是冰箱里只有一些速冻食品，当冰箱里的食物消耗殆尽时会以未知的方式被再次补满，冰箱旁边配有一个微波炉给速冻食物加热。层级中还有一台会出售杏仁水，轻松可乐，瀑布酒精等饮品的自动贩卖机，其货物由后室娱乐工作人员进行补充。
//
//800px-Pandemic_board_g ame.jpg?201607200156047
//一款不知名的桌游
//
//如果想要玩某个桌游需先跟管理人员进行登记，包括流浪者的姓名，借走的桌游，以及在几号桌玩，并使用自己随身携带的物品进行抵押，登记完毕后即可将游戏借走玩耍，但必须在规定时间内归还。
//
//实体
//Level C-120中存在卡牌贩子（推销后室TCG卡牌游戏卡牌的小贩），和新品推荐员，他们会在层级中游荡并向层级中的流浪者推销自己的物品。
//
//基地，前哨和社区
//跑团同好会
//由一批友好的桌游爱好者组成
//共有12人，他们定居于此
//接受交易
//有时他们会邀请来到这里的流浪者一起玩桌游
//“后室娱乐”桌游管理团
//一群后室娱乐的员工
//管理着Level C-120
//共有6人，负责管理层级的秩序，以及服务来层级游玩的流浪者。
//入口与出口
//入口
//在Level C-70或Level C-140进入一个门口挂着桌游室牌子的门
//在任意层级用三颗骰子掷出三个相同的点数，之后你会晕过去，当你苏醒时，你会坐在Level-C-120的任意一张椅子上。
//在Level C-166的书架上有一本《龙与地下城》的游戏说明手册，直接翻开最后一页会切入Level-C-120。
//出口
//直接从大门走出去会进入随机一个与后室娱乐有关的层级。
//在不玩桌游的情况下掷骰子5次以上，你会昏迷，并随机出现在Level C-99到Level C-199之间的任意一个层级。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1120{}