//Level C-152
//评分: 
//+35
//+
//–
//X
//来自M.E.G信息安全管理部的通知
//您正在查看的是Level C-152的档案。
//Level C-152一共有4个提案，其中有且仅有1个提案是真实的。
//由于M.E.G（探险者总署）尚未有派遣队伍前往Level C-152的计划，故暂时无法验证各个提案的真实性，
//请自行辨别信息，去选择1篇您相信的提案。
//在进入Level C-152前，熟读你所相信的那份提案。
//
//Level C-152 - Dr. B██████的提案
//Level C-152 - Dr. M██████的提案
//Level C-152 - █████的提案
//Level C-152 - 士兵P███████的提案
//Level C-152
//Dr. B██████的提案
//
// 
//
//生存难度：
//等级 1
//
// 
// 
//实体威胁性低
//Level C-152是后室C层群的第152层。
//
//描述
//Level C-152是一个面积无限的室外屠宰场。该层级没有正常的昼夜交替，也没有四季的区分，其太阳常年悬挂在早上10点的位置，且温度总为26℃。Level C-152有三个区域，分别为“小径”、“动物圈”与“屠宰场”，其中每个区域都有数量不等的，身穿红色工作服的成年无面灵存在。然而在不主动招惹刺激这些无面灵的情况下，这些无面灵并不会主动攻击进入Level C-152的人员。
//
//小径
//小径表现为一条铺在草地上的一条小鹅卵石路。经检验，草地中的泥土、草地上的草与路面所铺的鹅卵石并没有异常性质。小径的拐弯总为直角，并总将人员导向“动物圈”、“屠宰场”或另一条小径上。小径似乎并没有尽头，沿着小径一直走下去的尝试并没有导致任何其他事件发生。小径上有时可以看见身穿红色工作服的无面灵，他们可能正在前往“动物圈”，或从“动物圈”中拖着一只正在挣扎的动物前往“屠宰场”。帮助这些正在拖拽动物的无面灵没有任何的坏处，且鼓励人员帮助这些无面灵。
//
//动物圈
//动物圈表现为一个个用钢管、铁皮搭建的棚子，高度约为2米，长宽不等，但形状大部分为长方形。棚子的外圈是由水泥浇筑的矮墙，矮墙间装有木制栅栏门用作动物圈的入口，其入口会有小径连接。棚子内部的地板为水泥浇筑，并有以水泥矮墙和钢管为材料围蔽动物的单元。单个动物圈内的动物种类的单一的，整个层级内的动物圈的动物种类也仅有固定几种，分别为：鸡、鸭、鹅、猪和牛，目前尚未知晓各个种类的动物圈在整个层级中的分布规律，也尚未清楚动物圈中缺少的动物从何补充。在动物圈中，人员有时可以看见无面灵正在试图将动物从围蔽动物的单元中抓出，并拖到“屠宰场”去。帮助这些无面灵是被允许并鼓励的。
//
//屠宰场
//屠宰场表现为一间间用水泥作外墙，铁皮作屋顶的建筑。建筑通常高4~5米，内部空间的形状和大小与从外部观察所得的消息相匹配。建筑内有一个个由铁皮和钢管加工而成的屠宰台，上面通常放有一块木质砧板、一把屠宰用的铁质道具与一个装有用于洗去血水的杏仁水的铁盆（非危急情况下并不建议饮用）。除屠宰台以外，建筑内仍有一间水泥建成的小房间以存放解剖好的肉品。在这些小房间内并未观测到有任何的制冷设备，但其中的温度总能保持在-20℃，以保证肉品不会腐败，且小房间中的寒冷并不会传到室外的地方。在小房间内的肉品放满以后，一部分肉品总会在人员挪开视线或注意力转移时以未知的方式消失，以存放新的肉品，为避免浪费，最好的办法是在装满之前运走一部分肉品，层级内的无面灵并不会因此而攻击你。在屠宰场内，有时能看到无面灵拖拽着挣扎的动物从门外进来，并开始对动物进行屠宰解剖。在解剖完成后，这些无面灵会将肉品放置在上述小房间中，然后离开屠宰场，前往“动物圈”捕捉下一只动物。
//
//实体
//员工无面灵
//在Level C-152内有数量庞大，身穿红色工作服的无面灵，这些无面灵在你不主动刺激或寻衅滋事的情况下并没有攻击性，并专心致志地重复“捕捉”、“运送”和“屠宰”的流程。在“捕捉”或“运送”的过程中，若人员帮助了这些无面灵，则他们会在“屠宰”结束以后对人员鞠躬表示感谢，并从刚解剖好的新鲜肉品中取下一部分交给人员以表报酬。因此，在不主动寻衅滋事的情况下帮助这些无面灵的行为是鼓励的。
//
//附件
//以下为对Dr. B██████的访谈记录：
//
//- 收起文件C-152-A
//文件C-152-A：对Dr. B██████的访谈记录
//访谈时间：2020-01-09
//访谈地点：Level 1 Alpha基地
//访谈人员：████、Dr. B██████
//访谈主题：Level C-152
//
//████：你好，B██████博士。
//
//Dr. B██████：你好。
//
//████：听说你到Level C-152完整地探索了一圈？
//
//Dr. B██████：是的，我已经把我的所见所闻写到文档里并提交到数据库上了。
//
//████：你确定你所看到的都是真实无误的？而不是幻觉或者睡梦中的内容？
//
//Dr. B██████：是真的，我敢保证，我所写的一切都是真实无误的，都是我看到的，摸到的，有感觉的。
//
//████：那……我们的数据库同样接收到了另外几篇关于Level C-152的文档，这些文档所描述的Level C-152与你所描述的完全不同，你知道这是怎么一回事吗？
//
//Dr. B██████：啊？完全不知道有重复的文档这回事呢
//
//文件结束。
//
//基地、前哨与社区
//截至目前，尚未发现有基地在Level C-152内建成，但其有建造基地并获取资源的潜力。
//
//入口与出口
//入口
//在一张纸上写下有关Level C-152的内容（只要有“Level C-152”的字符出现即可）并写下数字“1524”，就会被传送到Level C-152。
//将一块重量精准为152.4克的任何生肉制品与身体保持接触152.4秒，便会被传送到Level C-152。
//出口
//穿过一扇标号为“1524”的深色木质房门便可以回到来时的层级（在本提案中木门可能会出现在“屠宰场”内），将视线移开可能会导致该房门消失。
//
//Level C-152
//Dr. M██████的提案
//
// 
//
//生存难度：
//等级 1
//
// 
// 
//实体威胁性低
//Level C-152是后室C层群的第152层。
//
//描述
//Level C-152是一个面积无限的室外公交总站站场。该层级没有正常的昼夜交替，也没有四季的区分，其太阳常年悬挂在早上10点的位置，且温度总为26℃。Level C-152的区域可大致分为停车场，上客/落客点，站场办公室。
//
//停车场
//停车场大约占整个公交站场面积的90%以上，表现为沥青地面，并附有使用黄色油漆画的停车位，这些停车位上有时候会停着公交车。在停车位上停有公交车时，边线处有时候会喷出大量具有异常的腰果水，以清洗车辆。这些腰果水在被溅到人体身上时，会引起被溅到的部位变得红肿并异常瘙痒，推测这些腰果水中混有其他杂质。在腰果水被喷出后，很快将会滑过车体，并滑到地面上，以未知的原因迅速消失。但在此过程中可以用容器来收集这些腰果水，收集到的容器内的腰果水即便再倒回地面上也不会迅速消失。
//
//上客/落客点
//上客点和落客点随机分布在Level C-152的各个位置，是乘客上下公交车的地方。其地面高于沥青路面20cm，为水泥建造，水泥地面上方拥有不锈钢管制造的栏杆、站牌。站牌中张贴着由塑料纸制成的线路图，其中的线路编号信息与总站信息被证实是正确匹配的，其余途径站点的部分无法被证实。站牌中还标注有当前车站的名字，但每个站牌中的车站名字并非完全相同，目前已记录的包括有“天河客运站总站”、“黄沙总站”、“水秀一路总站”等，目前尚不清楚其生成机制。部分上客点拥有以不锈钢管和绿色玻璃制成的透光挡雨棚。公交车只会在上客点和落客点停靠并打开或关闭车门。
//
//站场办公室
//站场办公室随机分布在Level C-152中的各个位置，但通常离落客点的位置不远。其表现为用铁皮或塑料板制造成的简易板房。板房的门口处标识着当前站点的名字（同上）和一个或数个线路的编号。板房的内部通常有一张盖着玻璃板的木制桌子，两张扶手椅，一顶带吊扇的条形日光灯以及一台装有杏仁水的饮水机。在Level C-152中并未看到有任何发电设施，但所有站场办公室的供电都是正常的。
//
//实体
//公交车
//公交车在没有人员驾驶的情况下可以按照既定路线前进，目前猜测公交车可能具有智能，故划分为一个无威胁实体。但需要注意的是，公交车无视一切挡在其面前的实体，即公交车会直接撞过去并碾过去。公交车的出车流程为：从停车场开出，前往上客点打开车门，若干秒后关闭车门，并驶离车站。在一段时间后，公交车将回到落客点，打开车门，并在若干秒后关闭车门，回到停车场的一个随机的停车位。值得注意的是，公交车上的各个部件都是可以被拆卸的，包括LED灯牌、塑料椅子、不锈钢扶手，甚至包括车辆的引擎与油箱。但需要注意的是，一旦其被拆卸，则上述的自动驾驶异常功能将会失效，且在人员的视线离开后，被拆卸的公交车将以未知的方式原地消失。
//
//以下为Dr. M██████在Level C-152进行的实验节选文件：
//
//- 收起文件C-152-A
//文件C-152-A：Dr. M██████在Level C-152的实验记录（节选）
//实验一
//实验内容：坐上74号公交车，并记录前方的视角。
//实验结果：
//在Dr. M██████上车后，车门关闭，公交车开始往远处行驶。但在15秒后，Dr. M██████突然昏迷，且摄像机的视频画面突然变黑。在此后的1小时46分钟内，仅能听到公交车行驶、刹车与开关门的声音。随后，摄像机的画面恢复，Dr. M██████醒来，此时公交车已经回到公交站场，在落客点处打开了门。Dr. M██████拿回摄像机并下车。
//备注：看来无法经历和记录到其他站点的信息呢。
//
//——Dr. M██████
//
//实验二
//实验内容：坐上101号公交车，并记录前方的视角。
//实验结果：
//在Dr. M██████上车后，车门关闭，公交车开始往远处行驶。但在28秒后，Dr. M██████突然昏迷。在47分钟后，Dr. M██████与他的摄像机被M.E.G Omega-癸亥“监督者之眼”的士兵发现出现在Level C-101的灯泡下，摄像机中关于这次录制的内容已经损坏，而Dr. M██████在15分钟后苏醒过来。
//备注：这公交车还能当做枢纽使用吗？。
//
//——Dr. M██████
//
//实验三
//实验内容：再次坐上101号公交车，并记录前方的视角。
//实验结果：
//在Dr. M██████上车后，车门关闭，公交车开始往远处行驶。但在28秒后，Dr. M██████突然昏迷，且摄像机的视频画面突然变黑。在此后的2小时13分钟内，仅能听到公交车行驶、刹车与开关门的声音。随后，摄像机的画面恢复，Dr. M██████醒来，此时公交车已经回到公交站场，在落客点处打开了门。Dr. M██████拿回摄像机并下车。
//备注：看来这是一个概率性事件。
//
//——Dr. M██████
//
//备注：随后更进一步的测试标明，公交车将人运送到对应编号的C层群层级的概率约为15.24%。
//
//文件结束。
//
//以下为对Dr. M██████的访谈记录：
//
//- 收起文件C-152-B
//文件C-152-A：对Dr. M██████的访谈记录
//访谈时间：2020-01-09
//访谈地点：Level 1 Alpha基地
//访谈人员：████、Dr. M██████
//访谈主题：Level C-152
//
//████：你好，M██████博士。
//
//Dr. M██████：你好。
//
//████：你在Level C-152转了一圈，还做了不少实验对吧。
//
//Dr. M██████：是的，那些实验都是我亲自上阵的，我认为该层级是一个很有用的层级
//
//████：你确定你所看到的都是真实无误的？而不是幻觉或者睡梦中的内容？
//
//Dr. B██████：准确无误，第二次实验时，我确实是在Level C-101醒来的，那些士兵认为我是从Level 0或别的什么普通层群进来的，就把我送到Level C-102了。
//
//████：那……我们的数据库同样接收到了另外几篇关于Level C-152的文档，这些文档所描述的Level C-152与你所描述的完全不同，你知道这是怎么一回事吗？
//
//Dr. B██████：（停顿了一下）抱歉，，没听说过。
//
//文件结束。
//
//基地、前哨与社区
//截至目前，尚未发现有基地在Level C-152内建成，但其有建造基地并获取资源的潜力。
//
//入口与出口
//入口
//在一张纸上写下有关Level C-152的内容（只要有“Level C-152”的字符出现即可）并写下数字“1524”，就会被传送到Level C-152。
//在C层群的任何层级中遇到一辆编号为该层级的公交车，上车后人员会陷入昏迷，醒来后便会来到Level C-152。
//出口
//穿过一扇标号为“1524”的深色木质房门便可以回到来时的层级（在本提案中木门可能会出现在“站场办公室”内），将视线移开可能会导致该房门消失。
//搭乘一辆公交车，会有15.24%的概率被传送到到公交车的编号所对应的C层群层级。
//
//Level C-152
//█████的提案
//
// 
//
//生存难度：
//等级 1
//
// 
//稳定程度较高
//实体绝迹
//Level C-152是后室C层群的第152层。
//
//描述
//Level C-152是一个面积无限的室内空间，表现为一间补习机构。在所有区域内，体感温度总是维持在宜人的26℃，且墙上的机械钟表或电子钟表标明，该区域的时间总停留在上午10:00的位置。Level C-152似乎是一非欧几里得空间，即各种本应重叠交错而不可能正常共存的房间或通道，在实际表现及人员进入时并没有产生异常，其区域可以大致划分为走廊、教室与仓库。
//
//走廊
//走廊为连接各个教室、仓库的通道。通道高3米，宽2米，能容纳两人并排通行。地板被瓷砖覆盖，瓷砖的下方为厚度未知的水泥。墙壁表现为被批荡过后刷上了1米高的绿色油漆的水泥墙壁。天花板顶安装着通风管口和吊灯。部分走廊上的吊灯时不时会因为电压不稳而闪烁，但得益于其吊灯密度较高，在探索时从未遇到过灯光全灭导致完全陷入漆黑的地方。通风管道上常常会往里输送新风，但在进入通风管道后发现它内部为完全密闭的，且内部的钢板无法以任何方式被摧毁，故尚不清楚其行使通风功能的方式。
//
//教室
//教室会出现在走廊的两端，由一栋标有房号木门相隔。教室内部的空间多数在10m2到20m2之间，少数情况会出现5m2以下或30m2以上的超小型或大型科室。科室内由一块黑板，一个木质讲台，一个投影仪（所有教室内的投影仪都无法使用），以及若干张带有小桌板的塑料靠背椅子。木质讲台和黑板的钢槽上通常放有数量不定、长度不定的粉笔，塑料椅子和木质讲台上有时会出现数量不等的教材，教材内容涵盖各个学科，其教材难度从小学到博士后均有出现（但出现频率最高的仍为小学和初中教材）。值得注意的是，在地上有时候会出现被撕碎的教材以及被拆毁的塑料桌板和椅子，纸质教材不会对人员造成伤害，但损坏的桌板及椅子的锋利表面可能会造成划伤，且这种划伤大概率会伴随着细菌感染。
//
//仓库
//仓库和教室一样，会出现在走廊两端，由一栋标有房号木门相隔。但仓库的面积相比于教室会小得多，内部摆放有铁架子，以及成叠摆放的带有小桌板的塑料靠背椅子。在铁架子上摆有成盒的粉笔，以及数量不定的，由纸皮和塑料带子包装好的教材，有时也会出现几本散装的教材，出现的粉笔和教材与教室中收集的无异。需要注意的是，这里的铁架子似乎会因为未知的原因倒下（不管是否有人经过），因此，在探索仓库时一定要小心，做好防护在进入仓库，以免被铁片划伤或被架子砸伤。
//
//附件
//以下为█████在提交层级档案时留下的笔记：
//
//- 收起文件C-152-A
//文件C-152-A：█████的笔记
//是，我也留意到了。
//数据库中还有许多篇Level C-152的文档。
//而且这些文档与我提交的这篇文档大相径庭。
//但我也只是把我看到的内容记录下来罢了。
//我猜████也会来找我，问我知不知道这是怎么一回事的。
//我就直说了吧，我也不知道。
//嗯，就这样吧。
//
//——█████
//
//备注：嗯，看来他也不知道，而且他也预判到了我会去找他，那看来那我也不用去找他了。
//
//——████
//
//文件结束。
//
//基地、前哨与社区
//截至目前，尚未发现有基地在Level C-152内建成，但其有建造基地并获取资源的潜力。
//
//入口与出口
//入口
//在一张纸上写下有关Level C-152的内容（只要有“Level C-152”的字符出现即可）并写下数字“1524”，就会被传送到Level C-152。
//在任何层级内捡到一本奇怪的教材，便会被传送到Level C-152。
//出口
//穿过一扇标号为“1524”的深色木质房门便可以回到来时的层级（在本提案中木门可能就是把走廊与教室、仓库间隔开的门）。
//在教室或仓库中找到一本1年级的教材（可以为小学1年级、初中1年级、高中1年级或大学1年级），并翻开到第524页，会被传送回来时的层级。
//
//Level C-152
//P███████的提案
//
// 
//
//生存难度：
//等级 1
//
//安全系数较高
// 
//实体绝迹
//Level C-152是后室C层群的第152层。
//
//描述
//Level C-152是一个面积无限的室外施工工地。该层级没有正常的昼夜交替，也没有四季的区分，其太阳常年悬挂在早上10点的位置，且温度总为26℃。
//
//Level C-152中有无限座仅由水泥和钢筋框架构成的建筑，占地约在400m2到3000m2之间。建筑的外侧没有墙壁，内侧仅有承重墙的位置拥有粗糙的水泥墙壁。建筑的高度在1层到6层之间，内部的各层由水泥浇筑的粗糙楼梯连接。建筑内有时会出现成堆的砂石、水泥袋，以及一些木桌，木桌上通常摆放着蓝图、记号笔、粉笔、各类施工工具（如冲击钻、锤子等）。需要注意的是，尽管在这些建筑内没有实体存在，但一些物品（如施工工具，甚至水泥袋等）总会因为不明原因从高层建筑上落下，砸到在附近路过的人员头上。因此，请不要在高层建筑的外侧停留太久，并戴上安全帽，以防高空坠物。
//
//在每座建筑之间的空地上也表现出在施工的状态，地面由泥土、沙子或水泥构成，且地面有概率是湿的。空地上也和建筑内一样，摆满了砂石、水泥袋、施工工具等。不同的是，空地上有时会出现一些巨大的坑洞，里面装有尚未凝固的水泥，且附近没有警示标志，这导致人员容易落入其中死亡。这些水泥坑洞的旁边通常有1~2台水泥搅拌设备，或有1台水泥搅拌车。水泥搅拌设备和搅拌车因不明原因持续运作，即使其没有连接电源或油箱内没有任何汽油。在对这些设备进行拆卸的一瞬间，这些设备停止了运作，随后的拆卸检查发现里面的元件基本处于报废状态。
//
//数小时的探测表明，Level C-152内没有任何实体，也没有其他组织建立的基地。因此，在做好适当保护措施的前提下，Level C-152被认为一个宜居且获取建筑资源的层级。
//
//附件
//以下为对士兵P███████的访谈记录：
//
//- 收起文件C-152-A
//文件C-152-A：对P███████的访谈记录
//访谈时间：2020-01-11
//访谈地点：Level 4 Omega基地
//访谈人员：████、P███████
//访谈主题：Level C-152
//
//████：你好，P███████。
//
//P███████：你好，███大人，请问找我有什么事呢？
//
//████：（轻笑）不用这么见外，P███████。在后室里，我和你都是一样的，都只是为了更好地生存并离开后室而斗争的人罢了。
//
//████：那么回归正题，你去过Level C-152对吧？
//
//P███████：是的。Level C-152是我新发现的层级。
//
//████：是这样的，我们收到了很多份有关Level C-152的报告，然而这些报告所描述的内容都和你提交的文档大相径庭，你真的确定你发现的是Level C-152吗？
//
//P███████：我很肯定，大人。我用████大人所发明的层级定位方法计算过了，那里就是Level C-152，没有错。以及，我敢肯定，那些都是真的。你看，我衣服的袖子上还沾着当时不小心沾到的水泥呢。
//
//（P███████向████展示了他的衣袖，上面有一小块已经凝结固化的水泥。）
//
//████：啊……原来如此，你对这件事有什么头绪吗？
//
//P███████：我不知道，大人，我这个权限等级也不该知道的吧。
//
//████：是这样啊……感谢你的配合。
//
//文件结束。
//
//基地、前哨与社区
//截至目前，尚未发现有基地在Level C-152内建成，但其有建造基地并获取资源的潜力。
//
//入口与出口
//入口
//在一张纸上写下有关Level C-152的内容（只要有“Level C-152”的字符出现即可）并写下数字“1524”，就会被传送到Level C-152。
//在任何层级中发现一个奇怪的，包装袋上用红色油漆写着“1524”字符的水泥袋，触碰该水泥袋将会被传送到该层级。
//出口
//穿过一扇标号为“1524”的深色木质房门便可以回到来时的层级（在本提案中木门可能会出现在建筑内），将视线移开可能会导致该房门消失。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1152{}