//Level C-123
//评分: 
//+66
//+
//–
//X
// 
//
//生存难度：
// 
// 
// 
//Level C-123是后室C层群的第123层。
//
//描述：
//该层级是一明亮的密闭空间，面积大约0.003平方英里，很像前室的自助餐厅。地板似乎是木质的，且十分坚硬。该层级有许多长长的大理石桌，其上摆放着琳琅满目的食品，这些食品都盛放在一个白瓷盘中，食品的种类已知但不限于：
//
//西冷牛排
//鸡腿汉堡
//西红柿炒鸡蛋
//糖醋鲤鱼
//墨西哥玉米卷
//奶油柚子
//日本寿司（种类繁多）
//该层级中的食品被检测为可食用，且口味与前室的同类食品别无二致，异常性在于这些食品被取走后会自动补充至原数量，且没有水成分，食品内类水成分未知，但对人体无有害影响。
//
//该层级无实体，同在该层级的人类能够遇到彼此，且拥有WI-FI信号，通讯效果佳。
//
//基地、前哨和社区：
//该层级没有已知基地、前哨和社区，但其性质证明适宜人类居住。
//
//入口与出口：
//入口
//可在所有建筑物类型层级通过一扇白色且挂有“食堂”字样硬质牌的门进入。
//
//出口
//原路返回即可离开该层级。
//
//
//一阵刺耳的噪音伴随着剧烈的头痛使你清醒过来。
//
//+ 语音通话请求（1）
//
//
//
//餐桌上多了一盘西冷牛排。
//
//
//
//注意⚠️以下文档已受到KVZ数据库保护
// 
//
//生存难度：
// 
// 
// 
//Level C-123是后室C层群的第123层。
//
//描述：
//该层级是一明亮的密闭空间，面积大约0.003平方英里，很像前室的自助餐厅。该层级有许多长方形的大理石桌，其上摆放各种食品，这些食品都被盛放在一个白瓷盘中，食品的种类已知但不限于：
//
//西冷牛排
//鸡腿汉堡
//西红柿炒鸡蛋
//糖醋鲤鱼
//墨西哥玉米卷
//奶油柚子
//日本寿司（种类繁多）
//该层级中的食品被取走后会自动补充至原数量，且没有水成分，食品内类水成分检测结果为人体细胞组织液。
//
//该层级藏匿有未知数量危险实体，经报告已知该类型实体会将进入该层级的人类变为食品中的类水成分，且会对人类产生精神影响，使其产生该层级“安全”的错觉，该影响随时间加深。
//
//基地、前哨和社区：
//该层级没有已知基地、前哨和社区。因该层级藏匿有危险实体，进入该层级人员将直接被认定死亡。
//
//入口与出口：
//入口
//可在所有建筑物类型层级通过一扇白色且挂有“食堂”字样硬质牌的门进入。
//
//出口
//没有出口。
//
//别浪费精力出去了，好好享受最后的时光吧。
//向你致敬。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1123{}