//Level C-137
//评分: 
//+7
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
//安全
//稳定
//少量实体
//Level C-137是后室C层群的第137层。
//
//描述：
//Level C-137是一个长约20km的狭长空间。其具体表现为一个宽度为4m的走廊，两侧各有一面高达约7m的墙壁。地板与墙壁的材质都是纯白色的光滑材料制成，天空则呈现成类似扫描线一样的黑底绿线的网格天空。
//
//进入该层级时，流浪者将会发现自己正处于一个由数量极多的无面灵组成的队列中，并站在此层级的左侧，中间有一条一直延伸整个层级的隔离伸缩带，隔离带右侧时不时会出现穿戴保安制服的无面灵。
//
//通常流浪者最初都会排在第5000-6000名左右，并且会随着队列的前进发生不同程度的事件，具体如下：
//
//距离队列终点距离	事件类型	建议
//20km-10km	队列前方会经常出现插队现象，队列缓慢。	流浪者在这个距离可以选择插队，但势必会引起与其他无面灵发生争执，因为这个距离不会出现保安无面灵的巡逻所以可以直接制服无面灵随后插队。
//10km-5000m	天空上将出现一个淡绿色的“太阳”并发出微弱阳光照射整个层级，并且将出现保安无面灵的少量巡逻，队列依旧会偶尔出现插队或者代排现象。	流浪者可以选择插队或者代排，但如果与无面灵发生争执需尽快解决，如果被保安无面灵发现将会被强制带到队尾。
//5000m-1000m	“太阳”的阳光变得强烈，并且将出现保安无面灵的大量巡逻，队列会出现代排现象但很少。	不建议流浪者插队，但可以选择代排，建议行动迅速不要被发现。
//1000m-终点	此时的太阳光将达到暴晒级别，并且每隔10m将出现一个站岗的保安无面灵，至此队伍不会出现任何状况，但经常会被呵斥与前后保持距离。	此阶段只需排队即可。
//排队抵达终点之后，流浪者将会随着队伍每10人一组的进入尽头的大门中，并以此离开次层级1。
//
//实体
//该层级算上排队与保安的无面灵大约数量在20000只左右。
//
//基地、前哨与社区
//排队救助俱乐部
//由一群放弃排队的流浪者组成的公益性小组，他们会给正在排队的流浪者提供杏仁水与其他资源的支持，并会帮助流浪者插队或者帮其代排，目前有20人左右。
//
//入口与出口
//入口
//在任意层级走入一个带有隔离伸缩带的走廊，将有几率来到该层级。
//出口
//据说排完队通过尽头的大门将会前往一个资源丰富的建筑层级。
//切出该层级将会前往Level C-43、Level C-71、Level C-192、Level C-240以及Level C-360这五个安全层级的其中一个。
//作者信息
//« Level C-136 | Level C-137 | Level C-138 »
//
//Footnotes
//1. 但目前有关成功排完队并离开的次层级的记录很少，仅有的几例的真实性也存疑。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1137{}