//Level C-131
//评分: 
//+21
//+
//–
//X
// 
//
//生存难度：
//等级 2
//
//安全
// 
//潜在实体危害photo-1556056504-5c7696c4c28d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=976&q=80
//Level C-131的球场俯视图。
//
//Level C-131是后室C层群的第131层。
//
//描述：
//Level C-131是一座露天足球场。当前并未找到通向场外的门口或是其他途径。
//
//在所有的时段里，Level C-131的观众席上总是坐满了服饰各异的无面灵，以及极其少量的派对客。该层级内还存在有相当数量的清道夫，它们分布在各个位置进行着清洁工作；同时，也存在有大量负责维护现场秩序的鬼警。
//
//Level C-131一般处于“非赛”状态。此种状态下的全场实体全部呆若木鸡，不会回应任何外界刺激。而当身处Level C-131的人类数量大于7而小于或等于11时，赛场广播就将高声询问“人类准备好了吗”1，人类若达成“准备好了”的共识便会当即激活“开赛”状态。
//
//“开赛”状态下的Level C-131将会有一支“敌方球队”进场2。人类必须与它们完成一场正规的足球竞赛，方能离开Level C-131。观众席上的无面灵与派对客等实体也将“苏醒”过来，为双方球队呐喊助威。但是由于无面灵们并没有口部，所以实际呈现出的效果是一阵又一阵的沉闷轰鸣3。与此同时，观众席上将会出现多只四处兜售商品的鸦商。
//
//值得注意的是，每一次出现的“敌方队员”种族都不一致。目前已经发现了由肢团、猎犬、窃皮者、迷彩爬行者、扼杀者等多种实体4组成的队伍；当前记录在案的最为特殊的情况为一只独自出场的巨型蜈蚣。
//
//尽管所有实体都不会在比赛中有意伤害我方，但它们固有的身体结构或是异常性质等等都或多或少会对人类甚至场地造成巨大的伤害/破坏。同时，Level C-131内并没有“裁判”——这使得双方几乎可以不择手段地5进攻。所有针对场地造成的毁坏都会在半场结束之后凭空恢复。
//
//完成球赛是离开Level C-131的唯一方式。根据球赛的最终结果，人类将得到不同的层级出口。
//
//基地、前哨和社区
//该层级不存在已知的基地、前哨和社区。
//
//入口与出口：
//入口：
//在C层群内，你有可能在各种奇怪的位置发现一个崭新的足球。触碰该足球将被传送至Level C-1316。
//更多入口尚待探查。
//photo-1616514169928-a1e40c6f791c?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8Mzh8fGZvb3RiYWxsfGVufDB8fDB8fA%3D%3D&w=1000&q=80
//一个入口实例。
//
//出口：
//球赛结束之后，敌方的球门门框将转化为一个空间隧道，走入其中即可抵达其他层级。针对人类在比赛中取得的结果，隧道的另一端将随机通向以下层级之一：
//
//胜出：此类层级与此类层级。
//平局，但有进球：此类层级。
//平局，无人进球：此类层级与此类层级。
//失败：此类层级。
//作者信息
//« Level C-130 | Level C-131 | Level C-132 »
//
//Footnotes
//1. 已经有人类试图找到广播室的位置，未果。
//2. 试图从敌方球队入场的通道离开Level C-131的行为将会招致鬼警的锁定。其余所有违规行为亦然。
//3. 部分流浪者将该氛围形容为“略显压抑”、但又被部分其他流浪者形容为“令人振奋”。
//4. 记录仍在新增。
//5. 但这仅限于某种“可以接受”的程度。包括试图杀死实体在内的多种严重行为都会导致鬼警介入。
//6. 强烈建议闲人勿入。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1131{}