//Level C-141
//评分: 
//+24
//+
//–
//X
// 
//
//生存难度：
//安全且稳定
//无危害性实体
//位于思维内
//Level C-141是后室C层群的第141层。
//
//描述
//在开始描述之前，我代表M.E.G.组织向贾米尔·莫拉莱斯先生和她的女儿表示感谢。
//
//——监督者-A
//
//sirmione-944038_1280.jpg
//Level C-141的大厅。
//
//Level C-141是一个充满着各式各样的钢琴的欧式单层建筑和一个花园的草原。本层级内除了无边的草原以外，仅有该房屋和花园以及将前两者围起来形成一个庄园的小型松树。其占地面积约为1000平方米。本层级内的天气环境常年处于多云和阴天的叠加状态，空气湿度明显大于其他普通层级。气温维持在20℃，似乎永远处于春夏交接时期，不存在四季变换。
//
//钢琴房
//占地面积最大，达到了700平方米，内部有各式各样的钢琴，大部分钢琴风格接近一个世纪前的古典钢琴，风格最老的钢琴经过分析，其出现时间不超过19世纪60年代。这些钢琴无一例外都能弹奏出钢琴声，且无法以任何方式损坏。1
//
//cat-1248012_1280.jpg
//钢琴上的一只小动物。
//
//当流浪者弹奏这些钢琴产生优美的旋律时，总会有一些在前厅可以见到的小型动物从不知名的角落出现，并围在钢琴面前，似乎欣赏着流浪者所弹奏的音乐。这些小型动物会在被抓捕后10分钟内自行消失。有时，一位人类实体“管家”也会来到演奏者的身边，并在其演奏结束后表示赞赏。
//
//“管家”是本层级的唯一人形实体，与无面灵不同，他有着正常的人类五官和情绪，以至于第一次流浪者见到他时，以为他也是被困在这里的另一名流浪者。据“管家”称，这个庄园的所有事务由他打理，包括清理地面、修剪树枝、招揽“客人”2，以及“清理”任何不速之客。
//
//如果流浪者提出要在本层级中久居的申请，“管家”会提出一条让流浪者很难接受的条件，通常这与他们的感情有关（详见附录），若流浪者满足了“管家”提出的所有前提，则它们会被安排至“科林利诺”房间3居住。如果流浪者从未体验过亲情，或者“科林利诺”房间已满，则“管家”会拒绝它的申请。
//
//portrait-3316389_1280_old.jpg
//“管家”的相片。
//
// 
// 
//
//以下是M.E.G.士兵长木合亚提对“管家”的采访：
//采访记录
//
//[记录开始]
//
//木合亚提：你好，请问怎么称呼？
//
//“管家”：先生您好，叫我管家就可以了。
//
//木合亚提：好，请问管家，你是怎么来到这个地方呢？
//
//“管家”：从思维诞生开始，我就已经在这里了。
//
//木合亚提：思维？抱歉，请问这指的是什么？
//
//“管家”：就是这个庄园啊，这里是一片思维的世界。
//
//木合亚提：（若有所思）呃……好吧，请问你在这里已经工作多久了？
//
//“管家”：这里每一天都一样，我这个老者又怎么能记得过去了多久呢。
//
//木合亚提：那这里就没有一些能用来计时的机器吗？
//
//“管家”：没有，这里有的机器只有这一架架钢琴，哦，你想去弹弹琴吗？
//
//木合亚提：不了，除了弹钢琴以外，我更想听听你的故事。
//
//“管家”：我的故事？我没什么可以说的，我整天忙着呢，我还要打扫这个庄园，让它看起来至少不像以前那样凌乱不堪。
//
//木合亚提：也就是说，你以前不在这里吗？
//
//“管家”：严谨的讲，确实如此。
//
//木合亚提：那这里……？
//
//“管家”：先生，我知道您想问什么，您想知道这里是如何产生的对吗？已经有无数先前来到这里的人问过我这个问题了，但我每一次都确定的告诉他们，我不知道也不想知道这里是如何产生的，我只知道我必须要把这里收拾的井井有条。
//
//木合亚提：那好吧，我认为我们的谈话可以结束了。
//
//“管家”：祝您拥有愉快的一天。
//
//[记录结束]
//
//基地、前哨与社区
//“管家”会将任何在本层级滞留超过4个小时的流浪者请出本层级，除非你能够用弹奏钢琴的方式打动“管家”，并说服他让你留在本层级。鉴于M.E.G.内部的钢琴家数量微乎其微，因此直至目前，本层级仍然没有发展出任何前哨站或社区。
//入口与出口
//入口
//从Level C-71的中转枢纽进入本层级。
//从Level 1中“阿尔法”基地西侧的一个拥有二级管理权限的门进入本层级。
//从Level 399中苏醒有可能能来到本层级。
//出口
//从“科林利诺”房间坠入Level 250。
//从花园旁的大门走出去，去往Level C-23。
//忘记一切，回到Level 0。不要这么做
//附录一：管家的条件
//关闭
// 
//
//条件一：在此居住时，忘掉和你一起探索的小队里的每一名成员。
//条件二：在此居住时，不要向任何人提及你的组织，即使他们问你也不行。
//条件三：在此居住时，忘掉你来到前厅前的一切回忆。
//条件四：在此居住时，你可能会受到歧视和偏见，但你要忘掉它们，不要做出任何出格的事情。
//条件五：在此居住时，忘掉你一路上所交往的一切朋友。
//直到你想离开这里。
//你忘却的东西并不会永远离开你，它们只是被储存在了记忆深处，直到你需要的时候，它们才会苏醒。
//
//附录二：可能的真相
//关闭
//调查记录
//往事
//我是库珀教授，这是我在本层级生活三年内得到的结果，我相信这一切总会有一个真相。
//
//为了不被“管家”所厌恶，我每天只在Level C-141待2个小时，在此期间，我经常检查着大厅和花园的一切，但一年过去了，我仍然一无所获。为此，我苦练钢琴技术，终于在第二年年初能弹奏简单的曲子，我的琴声会吸引许多小动物来我的身边弹奏，而当它们来到我身边弹奏时，我注意到我的琴声与平常有些许不同。
//
//于是，我随身携带了一只录音笔，并将每一次弹奏发出的声音记录下来，反复比对。终于，在几百条录音文件中，我发现了一些端倪——一些不属于钢琴的、细碎的声音，夹杂在了我弹奏的曲子当中。这种声音很小很轻，用耳朵几乎听不出来。多亏了克西的帮助，经过了计算机的后期处理，我终于听见了那声音的内容，并将这些话整理成了文章。
//
//那也许就是这里被称为思维之内的原因。
//
//作者信息
//« Level C-140 | Level C-141 | Level C-142 »
//
//Footnotes
//1. 包括普通钢琴长期弹奏所导致的音色不准，在此也不会发生。
//2. 事实上大部分是友好的流浪者。
//3. 世界语的音译，译为“感情”。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1141{}