//Level C-153
//评分: 
//+14
//+
//–
//X
// 
//
//生存难度：
//等级 4
//
// 
// 
// 
//Level C-153是后室C层群的第153层。本层级最初由一支小队在穿越Level 9时意外发现。
//
//描述
//Dk
//Level C-153
//
//Level C-153看起来像是由无数房间组合而成的空间，因目前为止未发现任何可以被称作边界的存在，故认为本层级是无限大的。
//
//组成Level C-153的房间基本表现为居民房里各种房间的布局，如客厅，卧室，厕所等。每个房间里的具体布局都不一样，没有两个相同的房间。房间里可能有灯光，也可能笼罩在黑暗之中。少数情况下，房间里即使没有看到任何灯具，也会在某一角落出现不明来源的一块光芒，且看起来很自然，与环境几乎没有违和感。
//
//Level C-153内的房间之间可能正常地以门相互连接，这些门几乎都是紧闭的，即使流浪者打开它们，也会在视线注意不到时关上。且层级本身存在明显的非欧几里得属性，以可辨识的单个房间为基本空间单位，同一间门可能在关上后再次打开便会通往其他不同的房间。而还有相当一部分房间以一种奇怪的方式连接，通过一些窄小但狭长的缝隙，如衣柜之间的缝隙，床板与地面的空隙，以及出现在墙角的本不应存在的缝隙可以通往其他房间，即使它们看起来并不是能通过一个人的大小，但流浪者确实能穿过它们，原因不明，流浪者对穿过缝隙时身体的感觉都很模糊，即便有人在旁边观测也不会对其人穿过缝隙的画面感到任何违和。除此之外也存在有通过违和感强烈的楼梯连接的房间，但极少。
//
//Level C-153的大多数柜子、抽屉、箱子里不存在资源，少数情况下可以找到一两瓶杏仁水，或是一些正常的，但缺乏其应有的味道的食物。一些时钟可能出现在本层级，但上面的数字都被模糊了，指针的运行也很混乱。
//
//极少数情况下，流浪者会突然听到倾盆的雨声，同时会伴随有强烈的恐惧感让他们感觉自己正在被什么威胁，通过躲进衣柜等密闭无光的狭窄空间可以缓解这种现象及恐惧感，但若此时尝试钻入连接不同房间的缝隙会加剧恐惧感。
//
//实体
//Dl
//黑暗的一方
//
//窗户会出现在Lecel C-153的许多房间里，但不是全部的窗户都是有害的，窗户后普遍会显示出类似于夜晚的Level 11的景象。尽管窗外可以看到一些建筑灯火通明且离流浪者所在之处很接近，但其灯光绝不会照亮到房间里，原因不明。窗户无法被破坏或切出。
//
//Lecel C-153里存在着相当数目的笑魇、肢团、猎犬，想在层级中探索而不遭遇它们是不可能的。它们的感知似乎比在其他层级中的同类更敏锐一些，且可能长期追逐流浪者不放。
//
//除上述实体外，Level C-153里还可能出现一些人类实体，他们的面容模糊到难以辨认，并且会在房间里做着自己的事情，如看电视或是做饭等。他们都表现出与流浪者很熟的样子，有的甚至会主动向流浪者搭话，但他们似乎无法意识到其他实体的存在，在对话中其亦如此表现。某些时候，他们会声称自己要「出门」或是「上厕所」之类并离开自己所在的房间，而即使流浪者跟着他们离开，也会到达与其不同的房间。我们对此种实体仍知之甚少。
//
//基地、前哨和社区
//鉴于Level C-153的危险性，目前没有基地、前哨和社区在此处建立。只有一些小团体隐藏在本层级内。
//
//入口与出口
//入口
//在Level 9打碎映出本层级景色的窗户会使流浪者昏倒并出现在本层级。
//Level 94中的动画屋在少有的情况下会把流浪者带到本层级。
//Level 21中编号为174的门会通往本层级。
//出口
//在某间房间里可能找到一个阳台，流浪者在阳台上回望会发现自己所在的地方只是一栋普通的公寓楼，从阳台上跳下去会到达Level 11。
//若坚持探索相当一段时间，流浪者会发现一扇半掩的铁门，门后是混凝土的公寓楼梯的样子，顺着楼梯走向楼底会发现通往外面的门口，走出门会到达Level 1。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1153{}