//Level C-173
//评分: 
//+25
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//1.jpg
//Level C-173的其中一楼。
//
//Level C-173是后室C层群的第173层。
//
//描述
//Level C-173在外观上呈现为一座公寓楼的内部。当前普遍认为该空间是无限的，因为任何上楼或是下楼的探索活动都没能找到Level C-173的顶楼或是一楼（若二者存在），而是无限延伸。没有可供识别的楼层标记。
//
//无从得知Level C-173的外部是何模样；尽管Level C-173的每一楼层以及楼道内部都有装修窗口1，但所有的窗口外部都罩有一张严实的窗帘，且所有打开窗口或是破坏玻璃的行为都以失败告终。
//
//2.jpg
//Level C-173的楼道。
//
//Level C-173每一楼层的布局都完全相同，即每层十所房间。除了极少一部分的房门会无法开启之外2，绝大多数房间都能够进入探索。房间内部通常一片空荡（偶尔甚至没有阳台），且无法开启电灯。有时在房间内能够发现陈旧的家具（例如木柜、塑胶凳等），则在其内部必然存在可以回收的物资，例如杏仁水。
//
//在Level C-173内滞留愈久，无端的窒息感与昏厥感就会愈强。鉴于进入此层级的流浪者们一般都已在后室拥有阅历，所以当前排除心理因素影响，认为此为Level C-173的固有性质。因此虽然该层级的危险性并不高，但依然不建议在Level C-173内停留过久。
//
//室内存在两种需要注意的特殊情况：
//
//房间内部是配置齐全的卧室，各种生活用品包括床铺一应俱全。万不可在此类房间内休息甚至入睡。
//房间一片漆黑，但是位于尽头方向的阳台会有照明。这种情况下会有一畸形人形黑影缓慢地自位于阳台盲区内的洗手间走出。在其未完全走出阴影的情况下保持视线接触并关门离开即可。
//基地、前哨和社区
//该层级不存在已知的基地、前哨和社区。
//
//入口与出口
//入口
//在Level C-172内入睡即可在Level C-173随机一层的走廊上醒来。在多人同时于Level C-172内入睡的案例中，他们从未在Level C-173内成功相遇。
//更多入口尚待探查。
//出口
//部分房间的墙壁上会出现巨大的缺口（出现概率约2%），走入缺口即可抵达Level C-174。
//据传走进“△”门牌号3的房门将会抵达[已编辑]。
//切入墙壁可以到达Level C-143。
//或者你也可以尝试找到一扇彩色的门，然后走进去参加一场来者不拒的派对！=）
//更多出口尚待探查。
//作者信息
//« Level C-172 | Level C-173 | Level C-174 »
//
//Footnotes
//1. 已经确认与2号实体无关。可以安全互动。
//2. 此种房间的内部有时会发出各种杂音，例如搬动器具声、流水声、走动声等。极少一部分此种房间内部会有光照，并往往可以从门底缝隙透出的光影中看到有一个不明物体紧贴着房门。
//3. 所有房门的门牌号皆为“X01”至“X10”格式。未知“△”门牌号的传闻起源于何时何地。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1173{}