//Level C-193
//评分: 
//+12
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//Level C-193是后室C层群的第193层。
//
//（更新于2022-03-04 请keki不要再添加脚注了，我们的脚注已经够多了！1）
//描述
//photo-1576669801838-1b1c52121e6a?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1506&q=80
//图片C-193-1
//Level C-193（即keki的实验室）内的实验桌的图片
//
//Level C-193是一间隶属于超常药理学家“keki”的实验室。整座实验室均由钢板制成，且表面上涂有白色油漆。在人员进入Level C-193时，总会在一个气密消毒室内出现，一些不明白色气雾将会喷洒约3秒2，喷洒完成后，气密门将会被开启，人员可以进入实验室的主体。实验室的主体大小仅为约50平方米3，光源为头顶的25盏长条形LED灯光管，其供电原理不明但电力异常充足4。
//
//photo-1554475900-0a0350e3fc7b?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=417&q=80
//图片C-193-2
//keki的部分药剂
//
//实验室的3面墙边各摆放着一整列高约1米，带水龙头5的实验桌，实验桌靠墙侧均摆有一个宽约30厘米，高约2米的木柜子，里面摆有数量不等的不明试剂6，以及一些空的化学仪器。实验桌上方摆放着巨量用途不明的仪器，实验桌最中间的位置是一台常年打开的计算机，通过该计算机可以远程联系上keki7。
//
//实验室的中央摆放着一排排与天花板固定的钢制书架，里面存放了大量书籍。书籍封面通常为绿色背景中的一片叶子，少数书籍封面为黄色、红色、紫色或黑色。8书中的内容并非任何一种已知的人类语言，向keki询问书籍内容的请求被拒绝了9。根据书中出现的淮山、蝉蜕、决明子等草药的图片，推测这些书本的用途为辅助keki制药。
//
//实体
//超常药理学家keki
//keki为一名超常药理学家，无敌意，人形生物，女，外貌与身材为[因尊重本人要求而被隐藏]10。keki拥有高超的制药技术，其知识来源推测为实验室中央的书籍11。但keki以“不希望掺和派系斗争”为由，拒绝了M.E.G.希望长期供药的请求12。
//
//根据keki自述，keki在非常早的时候便来到了后室13，并依靠超常药理学取代了原先的Level C-193，并将其创造成自己的实验室。但出于未知原因，keki一直未能找到前往前厅的方式14。
//
//鉴于keki笨手笨脚的特征15，M.E.G.提议派出人员对keki进行保护，但keki已回绝该提议。
//
//附件
//以下为M.E.G.（探险者总署）探索小队队长J███初次发现Level C-193时的探索记录：
//
//- 收起文件C-193-A
//文件C-193-A：探索小队队长J███初次发现Level C-193时的探索记录
//探索时间：2021-02-28 09:05:52
//探索人员：J███
//
//（J███在Level C-96触碰了一个带有不明液体的锥形瓶后被传送到Level C-193）
//
//[09:05:53] J███：卧槽！这啥玩意！
//
//（J███用手臂抵挡烟雾，但烟雾在3秒后便停止喷洒并散去。消毒室气闸门开启。）
//
//（keki此时正好在气闸门附近。因为气闸门突然打开，keki被吓了一跳，手中带有红色试剂的锥形瓶摔到地上，红色的液体流了一地！）
//
//[09:05:09] keki：啊！我的药！16
//
//[09:05:12] J███：（处于保护流浪者的本能，他连忙过去向扶起keki）啊！你没事吧！
//
//[09:05:16] keki：你……你别过来……啊！（挣扎着站起来的过程中又一次滑倒了）
//
//[09:05:22] J███：啊……好……我就站在一边……
//
//[09:05:25] keki：（缓缓站起来）你怎么进来的啊！这里不准外人进来！快回去！不然我就发火了！（后退的一瞬间又碰到了几瓶药剂）啊！都怪你！
//
//[09:05:33] J███：啊……那我怎么回去呢？
//
//[09:05:36] keki：（手势驱赶）进消毒室，和AI说“我要回去”!
//
//[09:05:33] J███：啊……好，那再见？
//
//（J███随后离开了Level C-193并向M.E.G.报告了该层级的发现。）
//
//文件结束。
//
//以下为Level C-193（keki实验室）紧急事件发生记录17：
//
//- 收起文件C-193-B
//文件C-193-B：Level C-193（keki实验室）紧急事件发生记录
//时间	事件	后续
//2021-03-07	不明原因的短路导致实验仪器失火18	M.E.G.派遣人员前来将火扑灭并收拾残局
//2021-04-21	keki在与M.E.G.人员会谈期间，不慎将装有试剂的木柜撞倒，引起连锁反应，导致其他木柜也开始倒塌	M.E.G.人员用身体阻止了木柜的继续倒塌19，但仍有40%的木柜已经倒塌，M.E.G.人员帮助keki继续收拾残局
//2021-04-21	收拾残局的过程中keki因没有注意地滑，摔到地上导致盆骨受损（初步判断为骨折）	在要求M.E.G.队员帮其拿了一瓶架子上的试剂后没再需要其他帮助20
//2021-06-12	研发新药的过程中因操作失误被药物蒸汽迷晕	M.E.G.队员正好在此时准备拜访keki，这使得他们能够对keki进行抢救
//更多事故记录请联系M.E.G.信息安全管理部查看。21
//文件结束。
//
//基地、前哨与社区
//应keki要求，Level C-193仅有keki常驻，所有其他组织不允许在Level C-193内建立任何的基地或前哨22。
//
//入口与出口
//入口
//在任意一个层级内，找到一个装有不明但颜色鲜艳的液体的锥形瓶、烧杯、量筒或容量瓶，触摸后将会被传送到Level C-19323。
//出口
//对消毒室内的AI说“我要回去了”等话语，可以将进入Level C-193的人员传送回来时的层级24。25
//作者信息
//« Level C-192 | Level C-193 | Level C-194 »
//
//脚注
//1. 啊啊啊对不起对不起！非常抱歉！ ——keki
//2. 是消毒喷雾！ ——keki
//3. 因为弟弟不在，没能力创造更大的了…… ——keki
//4. 是弟弟以前教给我的新技术！ ——keki
//5. 水龙头内流出的均为可饮用的杏仁水。
//6. 那些都是半成品，千万别喝！我忘记标注哪些是有毒的了！别喝就对了！ ——keki
//7. 在我出去找药材同时又有人要找我的时候就很有用了，不准乱翻我电脑里的东西！ ——keki
//8. 我弟弟d███可是能把这些倒背如流呢！ ——keki
//9. 家族秘密！我和弟弟赖以生存的东西，怎么能给你们看呢！ ——keki
//10. 女孩子的身高外貌年龄都是秘密啊！ ——keki
//11. 还有一些我和弟弟自主研发的东西！
//12. 你们打来打去的别扯上我啊！ ——keki
//13. 当时d███外出买东西了，我一个人在实验室研发新药，然后就……唉…… ——keki
//14. 我也希望想回去和d███在一起…… ——keki
//15. 你说谁笨手笨脚呢！ ——keki
//16. 都是他的错！他要是不突然进来这么吓我一跳！会这样吗！ ——keki
//17. 每一次都麻烦你们，真的很抱歉！ ——keki
//18. 其实只是不小心把水打翻了…… ——keki
//19. 明明我自己就能搞定的，还是谢谢你们了啦…… ——keki
//20. 这至少证明我和弟弟共同研发的疗伤药水很管用。 ——keki
//21. 不！准！看！了！ ——keki
//22. 你们为什么要在一个实验室里建家啊，还是一个女孩子的实验室！ ——keki
//23. 我也不知道这是怎么回事，大概是我以前制造的一些超常药剂的副作用吧。 ——keki
//24. 是弟弟d███教我的技术！好怀念弟弟啊…… ——keki
//25. 来自M.E.G.研究人员的备注：keki拥有一同样为超常药理学家的弟弟，名为d███，但他们在keki不小心切入后室时分开了。我们曾经问过keki关于d███的样貌，但她似乎并不愿意多提。提议人员留意新进入的人员是否有名为d███的对象。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1193{}