//Level C-151
//评分: 
//+13
//+
//–
//X
// 
//
//生存难度：
//资源不尽
//设施完备
//实体绝迹
//Level C-151是C层群的第151层。
//
//描述：
//Level C-151是一个城市的屋顶区域，由大量的高度相近的建筑屋顶组成并由脚手架相连。每一座建筑的风格都接近于上世纪80年代的装修风格并且都悬挂着霓虹灯，其内部装饰与设施也与其风格相符。
//
//j2HvQS.png
//此层级内奇怪的太阳以及无法解释的类似扫描线一般的阴影
//
//因不明原因，所有建筑都只能向下至多两层，随后就会被无法破坏的木板与路障挡住去路，这导致流浪者无法继续向下探索。无法继续向下的原因，可能是因为建筑下方弥漫的紫色雾状气体，这些气体被检测出含有大量的重金属元素，但这些气体目前无须担心。
//
//此层级的时间流逝与标准的时间略有差异，根据统计后发现，此层级的一天仅有15个小时1。此层级的太阳似乎有些不同，并且太阳自西边从地平线上升起，东边落下。伺候也陆续统计出了此层级的其他不同如：此层级一年为351天，13个月一个月27天，并分为三个季节，即春季、夏季与秋季，虽然日照时间非常短，但因不明原因气温十分温和。春季时，平均气温较低为15摄氏度左右，并经常会发生小雨；夏季时，平均气温较高为24摄氏度左右，时常会下起时长接近四分之一个夏天的梅雨；秋季时，平均气温较低为6摄氏度左右。三季并没有详细的划分，并且每次各个季节的持续时间都是不一样的。
//
//j2Hqit.jpg
//流浪者们在娱乐厅内活动的照片
//
//层级内的大部分建筑为居民楼，其内部家电齐全但都是老款式2，冰箱内总是能够找到冰镇的汽水，但这些汽水的有几种品牌并不属于前厅的任何一家已知的公司。楼顶也通常布置了很多盆栽植物并总是伴随着湿润的泥土的气味，以及躺椅遮雨棚以及冰箱，收音机也总能收到此层级专有的频道节目3，外侧的墙壁上也都悬挂着各式各样的霓虹灯，但大部分内容都无法理解。除此之外也拥有一些功能性建筑，列如：便利店、碟片店、影像店、电器店以及娱乐厅等，内部的功能都十分完备并且资源会定期恢复。
//
//在整个建筑区的中央，有一条自东向西的“沟壑”，这是两方建筑间距过大导致的。“沟壑”内有一条发出黯淡光芒的类似“道路”一般的透明结构并不断向两个方向延伸。而向西侧延伸方向看去，可以看到一座由高大围墙阻隔的城市，这座城市灯火辉煌。目前无论使用什么方式都无法抵达那里，并且每年都会有10天不停地释放烟火。每天夜里都能看到那座城市的上空有由光线组成的话语“欢迎来到，维C城。”
//
//基地、前哨与社区
//M.E.G.层群C“梦靡”基地
//M.E.G.在C层群规模最大的基地之一，用来安顿在探索新层级时发现的无家可归的流浪者，需要黑暗环境的研究部门也安置于此。友善且提供住宿与基础物资，开放交易。
//
//B.F.P.F.哨所
//B.F.P.F.在此层级建立的与流浪者贸易与层级勘察的哨所，目前正在派往人员来考量如何将此层级改造的更加适合人类居住4。
//
//“后室娱乐”组织休息点
//属于“后室娱乐”成员的休息站。据其成员称：这里简直和日落之城一样令人舒适。此处开放交易“后室娱乐”的新品，并尝试吸纳新成员。
//
//入口与出口
//入口
//听着上世纪80年代的歌曲入眠有概率在此层级醒来。
//在Level C-70跌倒可能会来到此层级。
//正在听磁带时，磁带发生卡壳并且发出失真的声音有极大概率会来到此层级。
//出口
//直接跳入弥漫在下方的紫色雾气内会抵达Level C-71。
//淋着雨而浑身湿透的情况下入眠会抵达Level C-239。
//作者信息
//« Level C-150 | Level C-151 | Level C-152 »
//
//脚注
//1. 以此归总此层级每天不同的阶段为：清晨（3:01-5:59）、傍晚（6:01-8:59）、晚上（9:01-14:59）与凌晨（15:00-3:00）。
//2. 并且不知为何绝大部分电灯发出的光都偏向粉紫色。
//3. 一般为某些上世纪风格的音乐，但是不知为何有些失真。
//4. 目前已经将其管辖区域内的灯泡换成了白灯，但似乎随着时间影响会再次发紫。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1151{}