//Level C-118
//
//评分: 
//+24
//+
//–
//X
// 
//
//生存难度：
//等级 5
//
// 
// 
// 
//photo-1542309174-d33b34ce6ea7?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=988&q=80
//一张由[数据隐藏]提供的Level C-118相片。此位置为Level C-118的西海岸。
//
//Level C-118是后室C层群的第118层。
//
//描述：
//Level C-118是一座巨大的岛屿，并已确认为敌对团体“龙血族”的主要基地之一。
//
//碍于龙血族的存在，我方无从深入该层级。这导致无法直接获取更多有关Level C-118的具体信息。
//
//附录：
//以下是通过机密情报源获取到的部分Level C-118防御部署/地理信息。
//
//守岛巨鳗 - 实体
//方位：Level C-118南北两岸的近海区
//概述：在南北两侧岛体浸没于海的位置各有一个巨型洞穴、洞穴内部各有一条巨型异种鳗鱼。鳗鱼的前端与数根巨型锁链融为一体 、锁链的另一端则死死连接在岩壁上；但它们庞大的身躯依然能让自己的攻击范围基本覆盖南北近海。巨鳗无需进食、性情暴戾、体表被甲壳覆盖，近乎刀枪不入。它们会摧毁一切自南北两侧靠近Level C-118的外来者。
//被龙血族称为“低级血裔”、“看门狗”。
//奥密克戎（o） - 实体
//方位：Level C-118东侧
//概述：龙血族成员之一，蛟龙外形。速度未知、体型未知，但是据称“行事毒辣”、“做事极端”，危险程度甚于智商低下的守岛巨鳗。
//负责看守Level C-118的东侧。
//艾普西隆（ε） - 实体
//方位：Level C-118西侧
//概述：龙血族成员之一，人类外形。
//负责看守Level C-118的西侧。
//瞳石 - 物品
//方位：Level C-118多地
//概述：“瞳石”是一种形如龙瞳的圆形水晶。经由未知的特殊手段处理之后，瞳石能够与指定的个体“共享视觉”。
//龙鳞驹 - 实体
//方位：Level C-118多地
//概述：龙血族的实验产物，代号β-36。更多信息未知，但已知已经达到实验目的。
//作用是作为不具备飞行能力的“龙裔”之坐骑。
//根据“β”一名猜测此生物实验系列与龙血族成员贝塔关系密切。
//龙裔 - 实体
//方位：Level C-118（多地）
//概述：信息未知、数量未知。可能是龙血族统治之下的平民/士兵。
//罡山 - 地点
//方位：Level C-118中部地区
//概述：信息未知。但猜测是龙血族在Level C-118内的主要居住区。
//神音 - 技术
//方位：N/A
//概述：仅知此名。
//龙神祭坛 - 地点
//方位：未知
//概述：龙血族的宗教场所。宗教内容未知。
//“涛沃” - 实体
//方位：Level C-118各处
//概述：一种未知实体，仅知体型巨大。被龙血族用于建筑工程以及必要时期的兵力。
//天魁殿 - 地点
//方位：罡山内部
//概述：信息未知。但猜测是“岛主”的住所。
//“岛主 ”身份未知。
//基地、前哨和社区
//该层级不存在已知的人类基地、前哨和社区。
//
//入口与出口：
//入口：
//由于该层级被危险敌对团体占据，所以进入方式不予公开。
//
//出口：
//切出即可原路返回，但须尽快；龙血族似乎有能力断绝该层级的“可切出性”。
// 
// 
// 
//
//检测到特殊权限。是否展开加密附录？
//加密附录：
//以下是M.E.G.前线探索小队初次进入Level C-118后所经历的特殊遭遇。
//
//探索小队“芦苇”：
//
//Reed-0：林篁（队长）
//Reed-5：时冲
//Reed-6：宋阳
//[记录开始]
//
//（切入过程已删节。小队目前位于Level C-118[彼时未编号]的海岸。）
//
//Reed-5：嚯，队长，果真有用！
//
//Reed-6：真进来了！
//
//Reed-0：检查周边环境。
//
//Reed-5、-6：是。
//
//（三人飞速地观察了一遍层级环境。）
//
//Reed-6：开放性层级，环境稳定，未发现实体踪迹。目前。
//
//Reed-5：目测是岛屿，但不排除是大陆海岸线的可能性。
//
//Reed-0：（示意）保持队列，谨慎前进。务必找到一片合适的高地对这个层级进行俯瞰。
//
//Reed-5、-6：是。
//
//（三人开始列队，沿着一条蜿蜒的山路往高处前进，尝试登上矗立于海岸线的山丘以从高处观察层级环境。）
//
//Reed-6：话说咱们在C层群里发现过几个宜居了？
//
//Reed-5：不知道。不过大概两个巴掌就能数清吧。
//
//Reed-6：不是，我是问具体哪几层。
//
//Reed-0：老宋他没事记这些做甚？你得去问档案部才是。
//
//Reed-6：咳，咱就是寻思能不能在后室里找到个真正意义上的容身之所，哪怕孤独终老呢。总比活活饿死或者被实体弄死要舒服。
//
//Reed-0：其实孤独终老或许不比你说的那两个要舒适……（皱眉，捂头）啧。
//
//Reed-5：怎么了队长？
//
//Reed-0：我忽然不大自在……甚至，好像有点战逃反应……
//
//Reed-6：啊？别吧，我还指望这里是个宜居……
//
//？？：确实是宜居噢！
//
//（小队后方突然传来一句人声。三人立刻回身列阵、作出防御姿态。）
//
//（队员们发现就在自己身后不足10米的位置竟然不知何时多出了一个男人：男人上身赤裸、身材健壮、看上去颇为年轻。Reed-0后期回忆称，自己的不适感在看到他的同时大幅上升。）
//
//？？：（笑嘻嘻地抬起双手）诶诶，各位别激动！
//
//Reed-5：你是谁？从哪里冒出来的？在这里做什么？
//
//？？：做什么？（示意自己赤裸的上身）晒太阳啊……今天天气多好。
//
//Reed-0：（低声）他很危险。
//
//Reed-6：你是人类么？为什么我们没有发觉你的靠近？
//
//？？：（笑）这不就说明我不是了嘛。
//
//（队员们飞速地对视一眼，然后开始缓慢拉开距离。）
//
//？？：别紧张，我是来好心提醒你们：别再前进了，请回吧。现在离开还来得及。这里确实宜居，不过已经有主了哦。
//
//Reed-0：谁？
//
//？？ ：呃，说了怕你们不认识。你们隶属哪个人类组织？
//
//（队员们短暂地交流了一会儿。）
//
//Reed-0：探险者总署。
//
//（男子闻言略显惊讶，原本轻佻的眼神里飞快地闪过一丝复杂。）
//
//？？：探险者总署？那你们认识德尔塔？
//
//Reed-5：（看向-6和-0）呃？他问的是……龙姐？
//
//Reed-0：你问她？你知道龙血族？……嘶，难道你口中的“主人”就是？
//
//？？：咳，不，他老人家本人不常住这儿。但是既然你知道龙血族那就好办了——对，这里是龙血族的领地。该不该继续走，就不用我说了吧？
//
//Reed-0：那你又是？
//
//艾普西隆：（笑）行不更名坐不改姓，龙血族的艾普西隆是也！回去之后，记得代我向我那位小妹问好啊。
//
//Reed-5：我干，这怎么整？
//
//Reed-6：别慌，他不是说让我们走么？
//
//Reed-0：你就是艾普西隆？而且你还要放我们回去？
//
//艾普西隆：正是，你们还得为你们是从西海岸上来的而感到庆幸。假如你们是在东海岸，那边的奥密克戎可就不像我这么好说话了啊，呵呵。
//
//Reed-0：……你为什么要放了我们？
//
//艾普西隆：（挠头）我有必要抓你们甚至杀你们么？虽说我确实负责这一带吧……但是，别把我和欧米伽那种人混为一谈。
//
//（艾普西隆后半句的语气极其冷淡。）
//
//艾普西隆：（缓和，耸肩）更别说你们还属于我妹妹选择的那边，那我就更没理由动手了。不然等以后见面啊，她说不定会手撕了我。
//
//（小队成员开始低声讨论。）
//
//艾普西隆：（耐心地等待着）等你们回去之后可以找她打听打听我。嗯。
//
//Reed-6：请问，我们可以问些问题么？
//
//艾普西隆：请便。
//
//Reed-6：我们是你放走的第一批外来者么？
//
//艾普西隆：当然不是，我能放的全放了。反正放掉他们也对龙血族没有一丝一毫的威胁。当然！偶尔被“瞳石”监工的那几次除外……呃，你们好像不知道瞳石是什么来着？
//
//Reed-5：确实不知道。
//
//艾普西隆：算了，你们也没必要知道。还有其他要问的么？
//
//Reed-0：恰恰相反，这正是我们接下来想问的。还请我们斗胆一回：我想让你，透露一些关于这里的情报。
//
//艾普西隆：（微愣，随后发笑）我说，这算不算得寸进尺？
//
//Reed-0：确实能算。而我之所以这么说，也只是顺带为你的妹妹着想。
//
//（艾普西隆挑了挑眉，示意Reed-0接着说。）
//
//Reed-0：龙血族在扩张，M.E.G.在探索。在此种双向奔赴下，我毫不怀疑双方在将来必有一战。而德尔塔在我们这边。等真的到了那一天，对龙血族几乎零了解的M.E.G.必然讨不到好。对吧？
//
//（艾普西隆没有回应。）
//
//Reed-0：即使是知道了龙血族有多恐怖而让M.E.G.主动逃远也好——起码不会发生血流成河的冲突，甚至只是龙血族对我们进行单方面的碾压与屠杀。现在的德尔塔对他来说已经是叛徒了对吧？敢问他会如何处置一个叛徒？
//
//（艾普西隆移开视线，陷入思考。）
//
//Reed-0：我不清楚高层那边从德尔塔那里获知了关于龙血族的什么信息，但依然留在这边的你肯定知道更多她不知道的事情。挑明了说吧，根据你刚刚的那些描述而言，我能够感知到你的立场和龙血族并不一致。甚至，当初德尔塔是独自来到M.E.G.，而你没有；选择留在他身边的你，是否有什么……特殊原因？
//
//（艾普西隆看向Reed-0。）
//
//Reed-0：如有冒犯还请见谅。您当然可以选择拒绝。
//
//艾普西隆：事先声明，我不可能会说的很详尽。不然岛主很容易就能追查到我头上。
//
//Reed-0：您是……答应了？
//
//（艾普西隆颔首。）
//
//Reed-0：万分感谢！
//
//艾普西隆：也别这么高兴。就算你们全都知道了，也只会更加认清自己是巨龙面前的虫豸之事实。就像我刚刚所说：反正这对龙血族没有一丝一毫的威胁。他不在乎。
//
//Reed-6：他是岛主吗？
//
//艾普西隆：不是，我都说了他不住这儿。岛主的话……嗯，你们可以叫他天魁。
//
//Reed-0：等等，“天魁”？
//
//艾普西隆：嗯。怎么？
//
//Reed-0：不该是……阿尔法贝塔什么的吗？
//
//艾普西隆：什么意思？……啊，你们总不能真以为龙血族直属成员就那二十几个吧？
//
//[记录结束]
//
//
//芦苇小队通过艾普西隆获取了部分关于Level C-118以及龙血族自身的初级情报。在可预见的未来里，M.E.G.会争取与艾普西隆进行更多良性接触。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1118{}