//Level C-160
//评分: 
//+32
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//
//
//
//
//
//Level C-160是后室C层群的第160层，是一座无限延伸的藏传佛教寺院。
//
//描述
//
//Level C-160是一座无限延伸的藏传佛教风格寺院，层级内有现代化供水、电系统，对于其源头的探查没有结果。Level C-160内部各处都有稳定的Wi-Fi，但值得注意的是，这个Wi-Fi拥有正常的名称和密码，
//- 存储文件
//Wi-Fi：Śākyamuni
//密码：f565-f485
//
//faa3945120be5.jpg
//Level C-160的一张照片
//
//这个层级的温度常年保持在20℃到-35℃左右，但是在以大殿为首的室内区域气温要高出不少；尤其是禅房区域，因为藏式火塘和供暖设施的存在，室温稳定在20℃-36℃；十分舒适，这也是该区域成为定居点的原因。
//
//层级为多层结构，最高处有8层；在层级的天台处可以看见寺院代表性的金顶，和延伸到视野尽头的建筑群。天空碧蓝，可以看见一轮太阳高挂日头（层级内有昼夜循环，白昼24h，黑夜8h）；有时还有淡白色的云朵，还会听到由鹰笛吹奏的悠扬曲调。
//
//流浪者在该区域时会有舒适的空灵感。
//
//- 点击存储图片文件
//ba9edee1eee4a.jpg
//M.E.G.检测者部门拍摄的天台一角
//
//大殿
//层级本身也由多种区域构成，首先是供奉着藏传佛教佛陀塑像的大殿，根据规模分为：
//
//主殿
//次殿
//附殿
//小殿
//而供奉的佛像包括（但不限于）：
//
//释迦摩尼
//格萨尔王
//莲花生大师
//弥勒菩萨
//地藏菩萨
//阎魔护法
//流浪者不能对这些佛像产生不敬的行为，“触怒”不同的佛陀会产生不同的结果，但是向这些佛陀上贡将会获得祝福或特殊物品，以下是部分“触怒”或上贡佛陀的信息：
//
//- 存储文件
//触怒：
//触怒释迦摩尼后，流浪者将会被传送到一个只有一棵毕钵罗树的层级内，这个层级除了毕钵罗树外没有任何物资，实体，和物质；但流浪者却能呼吸，在“地上”行走：并且在这个层级时流浪者不会感到饥饿和疲乏。
//想要离开本层级，要先在毕钵罗树下打坐参悟，参透觉悟之道后就会被传离本层级回到Level C-160。
//
//上贡：
//上贡释迦摩尼后，流浪者将会有1%的概率被祝福，祝福的效果为：在被实体攻击时，将会有一层淡黄色的半透明薄幕包裹流浪者，绝大部分实体将无法攻击到流浪者。
//
//不要把所得的估计过高,也不要嫉妒别人、羡慕别人,就得不到宁静的心灵。--释迦摩尼
//
//- 存储文件
//触怒：
//触怒格萨尔王后，流浪者将会被传送到一个类似于高原的场景，紧接着将会听到一声悠扬的号角声，伴随着号角声的还有数以万计的古藏族士兵装束的实体骑着马向流浪者冲来；然后攻击流浪者。值得一提的是，这种攻击并不会杀死流浪者，而是会施加痛苦，在这个层级待上两天，就会被传送回Level C-160。
//
//上贡：
//上贡格萨尔王后，流浪者会有0.0001%-0.1%的概率（该概率取决于贡品的珍贵程度和诚心）被传送到一座名叫“珠牡马圈”的独立层级1。据流浪者反映，在这个层级里，可以捡到一些箭头、铠甲上的铁片等物。人们分析这里很可能是一个古战场，在本层级内部会有一个（或数个）突起的石台，其上通常有以下几种物品：
//
//可以有效杀伤绝大部分实体的藏刀
//可以无限使用且射出初速大于音速的弓箭
//一套可以免疫绝大部分实体攻击和精神影响的藏式盔甲
//胜利幢：一把宝伞，已确定是藏八宝中的其中一件。
//在石台上取走任意一件物品后将被传送到Level C-67。
//
//英雄诗篇，字两千万，举世无双。
//写古时西藏，灾临祸降，黎民百姓，妖虐魔猖。
//神遣格王，降魑伏鬼，拯庶民扶弱抑强。
//虽遭陷，却自强天佑，妖灭魔亡。--《格萨尔王传》
//
//- 存储文件
//触怒：
//莲花生大师无法被触怒。
//
//上贡：
//莲花生大师无法被上贡。
//
//普度众生：
//莲花生大师虽然无法被上贡和触怒，但是当流浪者在莲花生大师面前祈祷时将有10%的概率被以未知方式授予“莲花生大师请佛术”2,流浪者在掌握这种术法后，可以在大多数层级内使用；使用时莲花生大师的虚影将会显现，并以未知方式“超度”附近100米内的实体。但是这种术法的准备十分复杂，并且有可能会在特殊层级或特殊实体前失效并引起“冲突效应”（BUG Effect ）3，这通常会引发灾难性后果，所以建议在没有十全把握的情况下，不要使用此术法。
//
//
//ॐ आः हूँ वज्र गुरु पद्मा सिद्धि हूँ！
//--《莲花生大师心咒》
//- 信息暂缺
//- 信息暂缺
//“都说了别催了，知不知道我们检测者有多忙啊？”-Maukth博士
//
//- 存储文件
//触怒：
//触怒阎魔护法后流浪者会被随机传送到任意层群的一个死区层级内，最通常是Level C-144。
//
//上贡：
//上贡阎魔护法后流浪者将有0.1%的概率进入一个类似地狱的场景，但根据对此区域的探索及测定发现，这个区域依然位于Level C-160内部，但在本层级其它区域进入它的的尝试都失败了。
//在这个区域内会有大量的有益物资，如指向之石、治愈水晶、原初之石、紫钥石、枇杷果、杏仁水。这个区域待上1天就会回到大殿区域。
//
//འཆི་བདག་ནག་པོ་ལྷོ་ཕྱོགས་ཀྱི།།，རིམ་པ་བདུན་གྱི་ས་འོག་ན།།。
//--《阎魔护法心咒》
//
//
//
//
//走廊
//c59ede36c0e7f.jpg
//在走廊拍摄的一张照片
//
//走廊是泛指连接各个区域的非欧几里得空间，跟区域连接时造成的空间异常几乎不可辨别，但存在一定的休谟指数异常。经由M.E.G.测定，休谟指数高于正常值22.56个公用单位
//- 存储文件
//Normal image Hume index：100.00ж4
//At present Hume index: 122.56ж
//
//d86fa2d1fae56.jpg
//M.E.G.检测者部门测得的扫描图片
//
//
//
//
//庭院‖天井
//庭院或天井经常出现于走廊尽头或大殿内，表现为正方体空间，装修和传统藏式建筑中的同类建筑一致；在某些情况下还会有杏仁水井。待在本区域的流浪者会自然地放松心灵，在天台处可以观察到庭院和天井。
//
//庭院或天井顶部通常横挂着经幡，上面书写着藏传佛教的经文，一般是光明八字真言：“嗡嘛智牟耶萨林德”，但也有例外，偶然情况下，经幡上会有《金刚经》、《甘珠尔》、《维摩诘经》、《六祖坛经》，《佛说阿弥陀经》等内容，但是在藏传佛教内并不会在经幡上印制这些内容，这种现象值得注意。
//
//这些区域内通常摆放着盆栽或有成条的花坛，其中种植着蔷薇科植物（已被证明为玫瑰）但是其种植所需环境跟层级内环境不同；后经测验者部门验证后发现其基因已经改变（但不排除其为本层级特有物种）。
//
//
//
//经堂
//藏传佛教称藏经之堂和诵经、做佛事之堂；一般分布在大殿附近或走廊两侧，其内有大量藏传佛教经书及其印制工具；靠墙处存放着相关法器。
//
//由于这些特征，后室中的佛教信徒经常光顾这里；无意间切入本层级的流浪者可以尝试前往这些区域求助，出没在这种区域的流浪者通常非常友善，他们还在这些区域设立了几个前哨，以此来帮助其他流浪者。
//
//
//
//禅房
//禅房在佛寺中是供喇嘛5居住的区域，通常在走廊或经堂附近。其内部有大量的食物及杏仁水供给，这些物资除藏药外都会在被拿走24h后被补充；但不能全部拿走，全部拿走的物资的存放位置将不会再次刷新物资。物资常见于壁橱或厨房里，包括但不限于：
//
//酥油（饼装）
//青稞面
//青稞酒
//青稞
//鸡爪谷
//少量大米
//少量面粉
//藏药（由硝石、青金石、塔黄、水母雪莲花、凝花杜鹃，藏红花和几种未知植物的药粉调制的药丸，有小拇指大小），可以治疗后室常见的疾病，以及快速疗伤
//Level C-160大部分的基地及前哨都驻扎于此。
//
//
//
//
//实体
//
//
//本层级没有传统意义上的实体，对于“佛像”是否属于实体还在研究探讨中。
//当研究获得突破性发展时，本条目将会更新。
//
//- 条目不存在
//
//
//
//
//
//
//
//
//
//
//
//基地、前哨与社区
//
//M.E.G.C-160前哨
//由那里驻扎的人数决定
//驻扎在禅房区域
//友好，开放交易
//向 M.E.G.C-160-T研究实验前哨提供补给
//M.E.G.C-160-T研究实验前哨
//常驻12名M.E.G.测验者部门的成员
//驻扎在一处供奉着释迦摩尼像的大殿内
//友好，会帮助其他在此层级的流浪者
//负责探索层级和进行实验
//“次第”
//有1200名成员，这是这个组织在Level C-160的前哨，常驻14名成员，总部在Level 11
//拥有5个前哨，4个在经堂区域（用于帮助其他流浪者或收集经书法器），一个在禅房区域
//友好，开放交易
//是一个佛教团体
//
//
//
//
//
//
//
//
//入口和出口
//
//入口：
//在Level C-67中打开一扇藏式建筑风格的门即可进入Level C-160
//在Level C-1中切出有10%的概率进入Level C-160
//在Level C-435中“天守阁”里切入一幅唐卡可到达一处大殿
//出口：
//在走廊区域意外切出可以到达Level C-1
//掉入杏仁水井后会从Level C-12的一处水井掉出
//在触怒阎魔护法后会被传送到任意层群的任意一个死区层级
//作者信息
//« Level C-159 | Level C-160 | Level C-161 »
//
//Footnotes
//1. 指没有入口和出口，也不能通过特殊物品（如“赫尔墨斯装置”）只能通过特殊手段进出的层级。
//2. 但是藏传佛教却没有记载这种术法
//3. 指引起小范围层级崩溃、意外切出、时间“卡顿”或其它异常现象的效应
//4. 休谟指数计量单位
//5. 藏传佛教中对僧人的称呼
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1160{}