//Level C-142
//评分: 
//+15
//+
//–
//X
// 
//
//生存难度：
// 
// 
// 
//Level C-142是后室C层群的第142层。
//
//描述
//Level C-142的外观为一条无限延伸，老旧风格的昏暗走廊，笼罩在一层成分未知刺激性味道的暗红雾气之中。任何功率的发光设备在Level C-142仅能维持两至三米的可见度。事实上，Level C-142的可视距似乎是保持不变的。
//
//而该层浅层构造与Level 2极为相似，譬如墙壁上扭曲而嗡嗡作响充斥未知液体的管道，令人烦躁的高温与幽暗狭窄的环境，潮湿的地面。Level C-142的墙面与地板上总是覆盖一层未知成分的暗红色膏状物，据推测，其与笼罩走廊的雾气，管道中的液体所属一种成分。
//
//一旦流浪者以任何方式进入Level C-142，将随机传送于"走廊"的某一个安全的点位，在Level C-142的"走廊"中，流浪者的神志会提升到相当敏锐的地步，体能也被提升到顶峰，以对可能的威胁保持足够的警惕。
//
//随流浪者随走廊深入18-30km后，走廊由起初1.5m~2m较为宽阔的直径逐渐愈发狭窄低矮，以至流浪者仅能弓背弯腰前进，而流浪者继续前行10km左右，走廊的形状逐渐坎坷不平而扭曲弯折，正如一根巨大的水泥管内部；令流浪者仅能匍匐前行。管道中物资极其匮乏，不过与此同时，流浪者的生理需求似乎凝固了，身体机能维持在顶峰，并不再感受到饥饿，口渴，疲乏，衰老——管道中的时间似乎是相对静止的。而一旦进入管道，流浪者将无法返回“走廊”，也无法晕厥或是死去。
//
//在"走廊"每行进20m~1km，流浪者总会随机遇见一些物资，可能是一根断裂且脱垂在地面的橡胶软管，涌出源源不断安全而可饮用的杏仁水；小包装的火盐晶体；一些散落在地的皇家口粮；基础的医疗措施包；以液态痛苦制成的投掷弹，弓弩等粗制武器。极少见的情况下， "走廊"脱垂的软管可能涌出致命浓度的腰果水；请确保液体安全后饮用。
//
//实体
//随着对Level C-142的深入探索，除物资以外，流浪者可能遭遇所有已知或未知的实体，如猎犬，成年与幼年无面灵，死亡飞蛾，笑魇等等——最为常见是便是悲尸。它们的行为与其他层级别无二致，但受到Level C-142未知的影响，它们总是充满敌意；但同样由于该层级未知的特性，它们被大幅度削弱至以一般流浪者体能可对付的程度；但流浪者并不能对此掉以轻心。而据目击者报道，随在该层级的不断深入，实体数量逐渐减少以至绝迹；偶尔出现的少量实体也表现为中立甚至友好。
//
//极少见的情况下，流浪者可能在“走廊”遇见腐烂程度不一，外貌形似自己的尸体。出于Level C-142的影响，排除产生幻觉的可能。
//
//基地、前哨与社区
//本层级没有已知的基地、前哨站和社区。
//
//入口与出口
//入口
//极少见的，在流浪者进入后室时间超过一年，枢纽可能出现一扇黑红色写着问号的门，可以从中切出可进入Level C-142
//出口
//偶尔，"走廊"粘稠的墙壁上会出现一扇暗红色的门。切出其中的流浪者会随机传送至一安全层级，但是均在一周至两个月后死于多器官衰竭。
//除此之外，没有方法可以离开Level C-142
//隐藏
//不要害怕，请听我说，孩子，如果你能看到这张纸条，你已经没有退路，幸而管道是安全的，时间也并不重要。请听我说几句话。
//
//Level C-142的空间是非线性且被扭曲的，即使是在最为狭窄难以喘息仅能匍匐前进的管道，你依旧有掉头更改前进方向的能力，而每当你尝试转身回头，你的背后总会被新的管道代替，这听上去匪夷所思对吧？至于出口，孩子，这段管道的一端是无穷无尽的，而另一端——在它数以亿计长度单位的尽头，连接着唯一一条去往前厅的道路。穿越它可能需要几周（如果你足够幸运的话，我想）几月，几年，甚至上百年。但是它总会有尽头的，请相信我，孩子！如果你一直朝着正确的方向行进，你一定能到达前室。亦或是，向着无边的死寂梦魇奔赴。
//“我的前面是什么？我匍匐前进的方向是什么？是我贪恋已久的前厅？还是无穷无尽的永恒梦魇？”
//
//“我，需要掉头吗？”
//千百年来…坠入后室的不幸之人求生的同时…总在找寻回家的方法…而我亦是其中一员。我尝试使用过数以万计的方法…而他们无一例外走向失败。
//在无穷无尽的管道中，我曾被诸如此类痛苦念头折磨至窒息，也无数次的后悔来到Level C-142——甚至想到不可能的死亡。但我很幸运，我仅仅花了十余年的功夫便穿越了这段梦魇，逃离无数实体，做出了正确而重要的选择。——相信自己的选择，孩子。然后，将一切交给命运。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1142{}