//Level C-133
//评分: 
//+21
//+
//–
//X
// 
//
//生存难度：
// 
// 
// 
//等下，死区？
//嗯…或许终结或已修正会更有创意一些？或者来个原创生存等级？
//嘿，什么？把平板还我。
//别那么急，我的记录可是很专业的。
//
//4QBRrg32L6szPAm.jpg
//Level C-133的照片。
//
//Level C-133是后室层群C的第133层。
//
//描述：
//Level C-133表现为一座无边无际的原野，该层级中四处生长着花草。
//
//哪里有花草？
//你看看你四周，不都是花草吗？
//唉？真的，可是这刚刚不还是片荒原吗？
//
//Level C-133中的植物会散发出一种花粉，这种花粉会让闻到它的生物暂时忽视掉植物自身的存在，这大概是它们保护自己的一种方式。
//
//啊，这样就说得通了。
//既然是死区，那当然有着不少危险的实体了。
//
//Level C-133中存在着大量有敌意的实体，包括但不限于猎犬，迷彩爬行者，派对客，记忆蠕虫和Blanche。
//
//什——Blanche？Blanche只有一个，而且她是友善的，哥们，别乱搞了，我要负责记录这个层级的！
//为什么她不能是敌对的呢？有点创意好不好。一群Blanche听起来多有意思啊？
//不对，你到底是不是M.E.G.档案部的人？你是谁？
//啧，真烦，构思一个好的层级是需要给人点清净的。
//
//基地，前哨和社区
//宝宝乐园
//由一群Blanche组成。
//一切流浪者都会不自觉的进入宝宝乐园。
//Blanche们会教会那些讨厌又幼稚的流浪者不要在其他人工作的时候打扰他们！
//啊，现在清净多了。
//我们刚刚进行到哪了？嗯…描述部分。
//该死，我已经写到基地部分了，不能接着写描述了。
//
//食人花
//Level C-133有很多变异了的植物，它们会四处寻找流浪者并吃掉他们。
//我本想写一个看起来生机盎然实则暗藏杀机的层级的，我有点后悔随便添加那么多实体了。
//“会吃人的花”听起来也是个没啥新意的点子…
//都怪那个流浪者，打断了我的思路。
//算了，直接到出入口部分吧。
//
//入口和出口
//还是不要让别人看到这个失败的草稿好了。
//
//入口
//当前没有通往此层级的任何途径。
//入口
//当前没有离开此层级的已知途径，只有“层级记录员”可以离开该层级。
//是时候去找一个没有流浪者的地方安静地创造一个完美的层级了。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1133{}