//随着一阵强烈的头痛，你从一片水泥地上爬起来，环顾四周，发现这里一片空旷。
//
//“啊……他妈的……真要命……”
//
//“嗯……这里是哪？”
//
//你自顾自地说道。
//
//“我到底是怎么来到这里的……”
//
//“空无一物。”
//
//你迈开步子，试图去探索这个层级。
//
//“好奇怪，这里似乎所有房间都倒置了。”
//
//“没有实体……”
//
//“至少不用被一群怪物追着跑了。”
//
//此时，你的脑海中开始重复起了两个字。
//
//“赎罪……”
//
//“我什么都没有做。”
//
//你不去继续在意脑海中的声音，开始观察起每个房间的布局，貌似想在这里找到些什么。
//
//“除了一些画和空柜子，就没有什么东西了。”
//
//……
//
//已经过去半个小时，你什么有用的东西都没有找到。
//
//你站在最空旷的一个房间中大吼：
//
//“这里有人吗！”
//
//你很快就得到了回应。
//
//他也大吼：
//
//“这里有人吗！”
//
//哦，抱歉，那个是回声。
//
//你只好拿出手机，拍摄了一张这里的照片。
//
//咔嚓。
//
//随着快门声的响起，那阵头痛似乎再次归来。
//
//你开始变得焦虑，试图找到方法去缓解这该死的头痛。
//
//“操操操操操操操为什么头越来越疼了……”
//
//“我究竟做错了什么？我的脑海中一直重复着赎罪两个字……”
//
//你的大脑如被液压机蹂躏一般，疼痛的无法忍受。
//
//你再一次痛苦地趴在地上，用自己的关节撞击着地面，试图用其他部位的疼痛来分散头痛。
//
//……
//
//这并没有什么用。
//
//……
//
//……
//
//
//
//已不知过去多久，你再次从水泥地上爬起，同样伴随着强烈头痛。
//
//但片刻，疼痛便完全缓解，不过你似乎又忘记了什么。
//
//“啊……他妈的……真要命……”
//
//“嗯……这里是哪？”
//
//……
//
//……
//
//
//你再次痛苦地趴在地上，用自己的关节撞击着地面。这次，你的肘关节切入了地面，整个身体伴随着肘关节穿过了水泥地，摔落到一片潮湿的地毯上。
//
//“操……好疼……”
//
//你终于回到了最初的原点，但不知为何，有一种如释重负的感觉。
//
//
//
// 
//
//生存难度：
//
//等级 更多信息待补充
//
//无
//无
//无
//level.png
//照片，已损坏。
//
//Level C-127为后室C层群的第127层。
//
//描述
//Level C-127由无数间类似客厅倒置的相同房间组成，由于其异常性质，其面积完全未知。客厅中于“天花板”上摆放有一些简单的家具，如柜子和画，而柜子中没有任何物体，也不会产生任何物品。同时，流浪者无法在该层级遇到其他流浪者。
//
//根据一些流浪者身上携带的电子设备所录制的音像资料可得知，在进入这个层级之时所有流浪者便会失去其所有记忆，这些记忆将无法恢复。
//
//在Level C-127该层级中，流浪者在苏醒和即将昏迷之时都会感受到头痛，大多数流浪者描述在该层级感受到的头痛“无法忍受”、“脑子要炸裂了”等语言形容此疼痛十分剧烈，且从该层级中离开的流浪者大脑均有不同程度的萎缩、损伤、缺失，但并不会过多影响流浪者的大脑功能，仅是会使记忆丢失。而当流浪者在将要昏迷时便会通过自残的方式来转移大脑的疼痛，包括但不限于使用关节撞击地面或墙壁、利用随身携带的利器刺击自己、钝击自己的骨骼等，所以从该层级离开的流浪者还会有重则器官衰竭，轻则骨裂等不同程度的伤害。
//
//目前尚且未知昏迷是否与因疼痛引发的休克有关，但当流浪者昏迷后其便会与其携带的物品回到最初来到该层级时的位置，并且会重复刚才流浪者所做的所有行为。
//
//有关该层级的更多消息等待补充。
//
//实体
//暂时未知。
//
//基地，前哨和组织
//鉴于该层级异常特性，无任何基地，前哨和组织。
//
//入口与出口
//入口
//暂时未知。
//出口
//暂时未知，但大多数流浪者声称其通过切入“地板”来到了Level 0。
//
//
//“我见证了你从进入后室起到达这里所做的一切。”
//
//“我想说，”
//
//“人的本性，或许是不会改的吧？”
//
//“你这种人，”
//
//“就应该死在这里。”
//
//
//“看来……我下手还是轻了点。”
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1127{}