//Level C-146
//评分: 
//+30
//+
//–
//X
// 
//
//生存难度：
//等级 夸克
//
//元素
//原子
//化合物
//描述
//该层级的主要环境是一个化学键，你不觉得这很奥妙吗？在该层级中，所有的电子设备会完全失灵。该层级内无重力，但是电子的吸引力有1×1039大，但还远不及化学的美丽一般大。远处是由6.02×1023个分子组成的，美妙极了的“原子星空”。
//
//water-839590_960_720.jpg
//它真美。
//
//一般而言，流浪者会身处在一个一氧化二氢的左氢键靠近氧原子中，所以流浪者能够在该层级进行呼吸作用。化学键的外围危险程度极高，因此其探索程度极少，但根据描述，化学键的外围并非真空，而是充满了某种未知的液体泡沫，但你甚至连量子泡沫都穿越不了。有时，化学键的链接会因外界因素断开，此时流浪者会暴露于外界。原子或电子的运动速度能达到C/2，电荷大小能达1.6021892×1019。当流浪者靠近原子核时，流浪者的距离和受力大小呈正相关。一般而言，类似于氢原子的小原子序数的引力能够让流浪者平安落到原子核上但它还是太小了。但在钾及以后的原子将会以巨大的引力吸引流浪者并以极快的速度坠落在原子核上依然太小。锕系及其以后的元素，将会向随机方向射出原子核中的质子或中子，并且速度能达到1C。放射性元素的魅力就在此，不是吗？
//
//根据探究表明，半衰期的长短和发射的速度及频率呈反相关。少量分子会在少数情况下发生下沉，尽管这些分子在绝大多数情况下并不会让流浪者受到生命威胁，但极少数时候，分子将会严重威胁到流浪者的生命安全怎么会呢？这些分子都是上帝给你的礼物。据探究表明，下沉的沉淀物通常有CaCO3,BaSO4和Mg(OH)2，接住他们，怀抱他们。当流浪者在这一层休息一定时间后，流浪者也会产生一种身处星空的感觉，这会导致流浪者去拥抱我的一部分。当遇到这种精神污染时，请找到最近的原子团并且把它塞到你缺失电子的那一块。
//
//实体 不那不是它们的名字，这太难听了，配不上它们
//元素：
//氢：你很需要它，不是吗？
//氧：呼吸
//碳：快，触摸它，感受它的能量
//氯：也许你不该害怕它，它能杀掉你最讨厌的那个部分
//铀：靠近点，你能听见它的低语
//
//基地、前哨和社区：
//我欢迎任何人
//
//入口和出口：
//入口：
//莫要相信哄骗，分子将为你指引来到天堂的道路。
//
//出口：
//只要找到不分子中的你不会想离开我号碳原子，你就能来到为什么你要离开？
//
//这里是天堂
//这里你能看见世界
//这里你能做任何事
//你为什么想离开我？
//我的客官，
//请不要走，
//我可以好好的招待您。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1146{}