//Level C-107
//评分: 
//+19
//+
//–
//X
//等待分级
//
//
//安全性：待定
//
//
//环境：待定
//
//
//实体数量：待定
//
//
//
//tn.png
// 
//m.png
// 
//tsdm_0005_bl.png
// 
//tsdm_0004_sp.png
// 
//ls.png
//
//
//operation-theatre
//Level C-107内部场景，图片已经过修复。
//
//Level C-107为后室C层群的第107层，目前该层级所有信息都仅可根据流浪者在该层级内所拍摄的损坏音像资料修复后的内容获取，尚未知其录像内容是否受到该层级影响，所以以下内容暂且仅供参考。并且由于目前对该层级知之甚少，所以暂时不对此分级。
//
//描述
//Level C-107为一场景近似手术室的5米×3米房间，无任何可见出口，墙壁、地板及天花板无法切入。在该层级中央摆有手术台等医疗设施与一张不锈钢桌子，不锈钢桌子上摆有一台心电监护仪，其心电监护仪未接往任何能源，可持续运作，无法被破坏。在该层级边缘同样摆有一张1米×0.75米×0.4米的不锈钢桌子，其上散乱摆放着流浪者的个人衣物及物品，部分流浪者会发现其上会摆放着X光片或流淌着血液的器官，而器官经M.E.G.进行DNA鉴定后发现其属于发现该器官的流浪者，并且流浪者在经检查后可证实其X光片确实属于该流浪者。
//
//根据到达过该层级的流浪者称其在该层级苏醒时全身赤裸，身上覆盖着深绿色无菌手术单，胸口贴有电极片并与心电监护仪连通。部分并未有心脏病史的流浪者称从该监护仪观察到自己出现心跳漏拍、心跳微弱等心律失常现象，并且几乎所有流浪者在到达该层级后发现自己的躯干或头部出现不同程度的畸形现象，部分流浪者苏醒时其畸形部位拥有缝线痕迹。
//
//部分携带有电子设备的流浪者称其所携带的设备受到不同程度的损害。而部分设备虽遭受损害但仍可正常使用，不过所拍摄出的音像文件大多数已损坏，部分可修复。
//
//同时，不同流浪者无法在该Level C-107内相遇。并且目前为止，进入过该层级的流浪者没有任何再次进入该层级的记录。
//
//实体
//目前据推测该层级内不存在任何实体，但有小部分流浪者称其苏醒前在疑似梦境中看到自己躺在手推床上，并由三名面部模糊且拥有人类特征的生物将其从装满格栅灯的走廊推到手术室，其过程被描述为“感觉较为真实，但意识模糊”，所以目前关于该层级是否拥有实体仍未有明确结论。
//
//基地、前哨与社区
//该层级不存在任何基地、前哨和社区。
//
//附录
//以下为部分流浪者于该层级所受影响的案例，部分图片可能会引起不适，请谨慎观看。
//
//▼ 隐藏
//
//
//案例一
//姓名：███（根据流浪者要求已抹除）
//
//性别：男
//
//年龄：25周岁
//
//9CWXqAtj3LPgIDU.jpg
//所受影响：
//
//浮肋完全缺失，右侧肋骨多出一根真肋，左侧已完全畸形，无法辨别。
//严重C形脊柱侧弯与骨盆倾斜。
//臂部肌肉几乎完全萎缩。
//案例二
//姓名：████ ██████（根据流浪者要求已抹除）
//
//性别：男
//
//年龄：21周岁
//
//voYwmh3pzecyRAi.jpg
//所受影响：
//
//肱骨萎缩。
//桡骨与尺骨已完全分开。
//中度骨质疏松。
//案例三
//姓名：Sally Emmie
//
//性别：女
//
//年龄：30周岁
//
//5Z3DbVC47B2jEs1.jpg
//所受影响：
//
//右腿关节、股骨与胫骨缺失。
//大腿于小腿位置多出五根近似腓骨的骨头，其与原本腓骨在关节处连接。
//严重骨萎缩，两根骨头骨折，断裂面较为平滑，有疑似工具切割痕迹。
//案例四
//姓名：冯嘉佑
//
//性别：男
//
//年龄：18周岁
//
//1fep5AtKirckg8C.jpg
//所受影响：
//
//左手中指缺失，拇指延长。
//已完全浮肿，部分血管肉眼可见。
//部分皮肤与指甲缺失。
//案例五
//姓名：██（根据流浪者要求已抹除）
//
//性别：男
//
//年龄：29周岁
//
//F2vaW6PEh3kQGbA.jpg
//所受影响：
//
//面部严重畸形。
//右侧眼球萎缩，完全失明，并引发斜视。
//鼻部浮肿，右鼻孔完全堵塞。
//入口和出口
//入口
//所有可进入该层级的入口已被破坏。
//其余方式被M.E.G.档案部删除，无法查看。
//虽所有入口相关信息被隐藏并破坏，但至今为止仍不断有流浪者进入该层级的相关报告。
//出口
//离开该层级的流浪者称无相关记忆。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1107{}