//Level C-150
//评分: 
//+12
//+
//–
//X
// 
//
//生存难度：
//安全且极不稳定
//主观现实塑造
//未知实体数量
//Level C-150是后室C层群的第150层。
//
//描述
//一个思想可充满太空。
//One thought fills immensity.
// 
//
//——威廉·布莱克，《天堂与地狱的婚姻》
//
//但若是两个呢？两种无可调和的思想、两片击搏挽裂的天堂？总会有人的梦想碎裂满地，璀璨在这条虚无缥缈的碎梦大道之上。
//
//——洛怀英，Level C-150的“ 虚君
//King Nothing
// ”
//
//C-150-Darkness.png
//Level C-150无生命存在时的绝对黑暗
//
//当Level C-150不存在生命体时，该层级表现为半径9km1的连续空间正方体。正方体空间内部完全净空，不存在任何原生于该层级的物质与能量。一切抵达该层的非生命物质将于抵达后72小时被传送至Level C-98。
//
//若一个无思考与想象能力的生命体抵达Level C-150时，它将立即死亡并自我分解。在死亡的碳基生命体样本体内大量存在未被吞噬细胞吞噬的凋亡小体，推测死亡原因为自发性的细胞凋亡。任何因此效果死亡的生物将在5分钟后传送至Level C-88。
//
//自拥有想象能力的生命体抵达Level C-150时，此生物内含的记忆、想象与意志力将在该层级的效应下实体化，并字面意义的透体而出，以该生物为中心尽可能的辐射并占据该层级中足够广阔的区域。该能量被洛怀英博士命名为“意”。随着该生物的心意转动，被该生物的“意”辐射影响的所有层级区域将随该生物的心意转变为任何其希望的模样，就如同其为这片被辐射区域全知全能的神明一般。该效果无法影响空间的绝对尺寸，且在Level C-150中创造出的任何物质或能量，除与该生命体融合的部分外，在离开该层级时将凭空消失。
//
//风晨月夕、阶柳庭花、八街九陌、瑶台琼室，皆存乎旅者一念之间，随心而起，随意而动。虽这层中万象皆是黄粱一梦，踏出层中半步便仅余下片缕回忆，但在这后室恶土之上，我又有何德何能去希求更多。
//
//当存在于本层的智慧生命体数目大于1名时，生命体外显的“意”将互相竞争，试图占据更多Level C-150中的区域。生物也可选择通过调动自身“意”的创造物发动攻击争夺地盘，创造物的强度取决于生物的想象能力，持久力则取决于该生物的意志力。在争斗中获胜的一方将逐步侵蚀失败一方的“意”，并对其造成精神与大脑神经的永久性损伤。而当一方的“意”与空间都被侵蚀殆尽之时，失败方将如无想象能力的生命体般失去生命，并在5分钟后被传送至Level C-88。
//
//人类站定于大地之上，向着目力所及的尽头望去，天地的相交处便停留在约4500米远处，地球的曲度存乎每个思乡人的脑髓深处。当第二人出现于这阶层中时，无论如何收敛，那人与他的世界都将矗立于我的幻想之中，让我苦心经营的真实之感化作东去的逝水…让我想起自己不过是妄图做起一场大梦的粉墨丑角。
//
//⊱┄┄┄┄┄┄┄┄┄┄┄┄⊰◈⊱┄┄┄┄┄┄┄┄┄┄┄┄⊰
//
//基地、前哨与社区
//C-150-Jiuyuan.jpg
//九原仍存在时留存的图像资料，图为洛怀英博士的居所
//
//九原
//实际仅有1名流浪者的“政治实体”，领导者为洛怀英博士。
//该流浪者曾于12.6.20~23.2.22期间“统治”该层级，歼灭进入Level C-150的实体、界定流浪者的停留时间并驱逐任何试图威胁她统治的流浪者。
//2022年2月23日，Level C-150遭到未知实体侵入，2位歇脚中的M.E.G.探员 于行动中失踪
//M.I.A.
// ，洛怀英博士重伤逃离该层并接受M.E.G.庇护，九原覆灭。
//你们倒是清醒，将这一方乐土斥为虚妄之物，弄得自己好像看穿一切的清流贤士一般。倒是不见你们之中有多少人削尖了脑袋，只为了钻入那101层谣传的所谓入口，然后全喂给了猎犬、火焰和无面灵，把那帮实体养得脑满肠肥的。
//
//我想要的不过是一个归正守丘的美梦罢了，你们这帮乱嚼舌根的要是敢来Level C-150，我必把你们的舌头钳下来干炒了吃。
//
//⊱┄┄┄┄┄┄┄┄┄┄┄┄⊰◈⊱┄┄┄┄┄┄┄┄┄┄┄┄⊰
//
//入口与出口
//入口
//集中注意力思考事物2并跳入Level C-98的井口将有几率带你来到Level C-150。
//从Level C-50切出将有一定几率抵达Level C-1503。
//从Level C-24坠入黑洞的事件视界并存活的生命体将抵达Level C-150，不适用于人类。据猜测，该入口可能是部分实体抵达Level C-150的方式。
//出口
//想象一扇通向任意拥有“门”这一实体层级的门，敲三下门后打开，门后将是你所想像的楼层。
//想象一座通向任意拥有“桥”这一实体层级的石桥，沿着石桥走到尽头，你将被传送至那一层级的桥上。
//Footnotes
//1. 站立于0海拔地区的人类与可视地平线的距离约为4.5km
//2. 据统计，默背质数是成功率最高的进入方式。
//3. 仅有一次成功报告，真实性存疑
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1150{}