//Level C-108
//评分: 
//+18
//+
//–
//X
//该页面记录于 2013.12.26
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//Level C-108 是后室的第 108 层。
//
//描述
//Level C-108 的主要结构可分为主控室和外部空间两部分。
//
//主控室
//主控室是一长宽为 10.3m，高为 3m 的混凝土制房间，其内部装修风格与前厅的主控室类似，内部带有光源。
//
//主控室中央有一张半径为 0.36m 的圆形木制桌子，其上有一台老式收音机和一台节拍器。主控室的东1面墙壁上安装有 2 台监控电视。监控电视和老式收音机不需要电源，节拍器不需要上发条即可工作。目前未知老式收音机、节拍器和监控电视的出厂厂家。
//
//监控电视据观察分析其所监控的位置可能是 Level 11。
//
//老式收音机根据红面和蓝面的活跃状态播放不同的歌曲，红面活跃时播放的歌曲风格大多为重金属、摇滚和前苏联时代的歌曲。蓝面活跃时播放的歌曲风格大多为爵士和古典钢琴曲。有时老式收音机会播放 20 世纪后叶的乐队歌曲。
//
//节拍器的速度经过测试为 21.6 小时一拍，当节拍器的摆锤摆动至节拍器的一侧并发出“嗒”的节拍声后，Level C-108 内将发生一次“切换”事件。任何试图破坏或阻止节拍器工作的行为均告失败。
//
//房间的西部墙壁为一大型木制门，该木质门连接主控室和外部空间。可由该木制门可自由在主控室和活跃的外部空间之间移动。
//
//目前主控室已经被改造为 M.E.G 的采矿站点办公室。
//
//外部空间
//外部空间可分为两个部分：红面和蓝面。
//
//红面为完全开阔的空间，没有天花板和光源，地面随机分布大量柱状结构，未知开阔空间的面积和柱状结构的高度，其结构由红色的固态碳酸锂构成。
//
//蓝面为高度为 6m 的空间夹层，没有光源，天花板和地板随机分布大量的深坑，未知夹层的面积和深坑的深度，其结果由蓝色的固态盐酸氟西汀构成。
//
//值得注意的是，红面和蓝面不会同时处于活跃状态，处于沉寂模式的部分将完全与主控室失联，于其内部观测将发现主控室消失。
//
//“切换”事件
//完整的“切换”事件流程如下：
//
//节拍器的摆锤摆动至一侧，并发出“嗒”的节拍声。
//Level C-108 内所有电源自动关闭并无法启动。
//主控室内除了由流浪者带入的设备之外所有被损坏的设备恢复正常。
//红面和蓝面在活跃和沉寂模式之间切换。
//Level C-108 内所有电源恢复正常。
//整个“切换”事件将持续 6 分钟。
//
//基地、前哨与社区
//M.E.G. 108 号采矿基地
//目前已有工作人员 56 人。
//已经于红面设立碳酸锂采集站点。
//已经于蓝面设立氟西汀采集站点。
//采集资源用于心理疾病治疗。
//入口与出口
//入口
//从 Level 11 的任意一家药店的墙面中切出将进入 Level C-108 的主控室。
//出口
//于主控室内对南边和北边的墙壁切出将进入 Level 11 的随机一家药店中出现。
// 
// 
// 
// 
// 
//
//该文档已经归档，点击查看最新版本
//Level C-108
//评分: 
//+18
//+
//–
//X
//该页面记录于 2018.4.28
// 
//
//生存难度：
//等级 1
//
//安全
//重新恢复稳定
//实体绝迹
//Level C-108 是后室的第 108 层。
//
//描述
//Level C-108 的主要结构为一长宽为 10.3m，高为 3m 的混凝土制房间，其内部装修风格与前厅的主控室类似，但墙面上带有大量的抓痕和破坏痕迹。
//
//主控室中央有一张半径为 0.36m 的圆形木制桌子，其上有一台老式收音机和一台节拍器。主控室的东1面墙壁上安装有 2 台监控电视。目前未知老式收音机、节拍器和监控电视的出厂厂家。
//
//监控电视均已经完全损坏，屏幕碎裂，其内部的电子器件与正常的电视无异，红色的干涸油漆痕迹从监控电视内部蔓延至地面上并覆盖了一部分地板。
//
//节拍器已经完全损坏，其摆锤从根部断裂且完全消失。
//
//房间的西部墙壁为一大型木制门，该木质门已经完全卡死无法打开，使用紫钥石打开木制门后发现门后是黑色的岩层，任何破坏岩层的行为均告失败。
//
//外部空间
//外部空间可分为两个部分：红面和蓝面。
//目前未知进入红面与蓝面的方法。
//
//“切换”事件
//“切换”事件已经确定不会发生。
//
//基地、前哨与社区
//M.E.G. 108 号采矿基地（已失联）
//工作人员 56 人全部失踪。
//红面设立的碳酸锂采集站点已经失联。
//蓝面设立的氟西汀采集站点已经失联。
//M.E.G. XXX 号研究哨点
//工作人员 4 人。
//建立以研究 Level C-108 的性质，并尝试重新取得与采集站点的联系。
//入口与出口
//入口
//从 Level 11 的任意一家药店的墙面中切出将进入 Level C-108 的主控室。
//出口
//于主控室内对南边和北边的墙壁切出将进入 Level 11 的随机一家药店中出现。
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
//
//- 材料：Level C-108 层级崩溃事件以及原因研究 -
// 
// 
// 
//Event C-108 是导致 Level C-108 产生异常变化的事件。
//
//事件影响
//房间的墙壁内产生大量损坏痕迹，监控电视、节拍器被完全损坏。
//完全失去与红面和蓝面的联系，推测红面和蓝面均为沉寂状态。
//节拍器损坏，“切换”事件无法再发生。
//M.E.G. 失去碳酸锂和氟西汀资源来源。
//事件发生原因
//推测是由于不明实体进入 Level C-108 进行破坏导致 Level C-108 内部产生变化。但是目前没有关于该实体的任何线索。
// 
//
//（无用内容已经被删除）
//根据 Event C-108 发生之前 Level C-108 的描述，我认为 Event C-108 可能不是由其他实体进入 Level C-108 进行破坏产生，更像是 Level C-108 内部自发产生的。
// 
//关于 Event C-108 的产生机理，我暂时也毫无头绪，我需要联系其他对于心理疾病方面的专家进行讨论。
//（无用内容已经被删除）
//
//（无用内容已经被删除）
//碳酸锂和氟西汀是重要的心理疾病药物，尽快恢复与采集站点的联系，我们非常需要这些资源。
//
//（无用内容已经被删除）
//我反对立刻修复主控室，红面和蓝面的活跃状态同时激活可能会导致一些不可预料的情况。
//
//你不要一意孤行！
//
//
// 
// 
// 
// 
// 
//该文档已经归档，点击查看最新版本
//Level C-108
//评分: 
//+18
//+
//–
//X
//该页面记录于 2018.9.13
// 
//
//生存难度：
//等级 3
//
// 
//不稳定
//实体绝迹
//Level C-108 是后室的第 108 层。
//
//描述
//Level C-108 的主要结构可分为主控室和外部空间两部分。
//
//主控室
//主控室是一长宽为 10.3m，高为 3m 的混凝土制房间，其内部装修风格与前厅的主控室类似，但墙面上带有大量的抓痕和破坏痕迹。
//
//主控室中央有一张半径为 0.36m 的圆形木制桌子，其上有一台老式收音机和一台节拍器。主控室的东1面墙壁上安装有 2 台监控电视。老式收音机不需要电源，节拍器不需要上发条即可工作。目前未知老式收音机、节拍器和监控电视的出厂厂家。
//
//监控电视均已经完全损坏，屏幕碎裂，其内部的电子器件与正常的电视无异，红色的油漆正在不断从监控电视内部溢出至地面上。
//
//老式收音机仅会播放一首歌曲，根据对比确定是 AI Bowlly 的 Heartaches，但其音质非常差，播放速度比正常音乐版本慢。
//
//节拍器的速度经过测试为 216bpm，其摆锤上存在维修痕迹。任何试图破坏或阻止节拍器工作的行为均告失败。
//
//房间的西部墙壁为一大型木制门，该木质门连接主控室和外部空间。可由该木制门可自由在主控室和活跃的外部空间之间移动。
//
//外部空间
//外部空间目前被命名为紫面。
//
//紫面为开阔空间，其中分布有大量的空间夹层，没有天花板和光源，地面随机分布大量柱状和深坑，空间夹层的高度为 6m，未知开阔空间的面积、柱状结构的高度和深坑的深度，其整体结构由紫色的固态氯丙嗪构成。
//
//处于紫面中的流浪者的情绪将随着节拍器摆锤摆动转向暴怒和抑郁，紫面中也将随机产生震动并可能导致结构坍塌，因此不建议流浪者在紫面中进行探索。
//
//基地、前哨与社区
//M.E.G. 108 号采矿基地（已废弃）
//工作人员 56 人全部死亡。
//红面设立的碳酸锂采集站点已经完全废弃。
//蓝面设立的氟西汀采集站点已经完全废弃。
//M.E.G. 108 号研究哨点
//工作人员 3 人。
//建立以研究 Level C-108 的性质。
//入口与出口
//入口
//从 Level 11 的任意一家药店的墙面中切出将进入 Level C-108 的主控室。
//出口
//于主控室内对南边和北边的墙壁切出将进入 Level 11 的随机一家药店中出现。
//
//作者信息
//« Level C-107 | Level C-108 | Level C-109 »
//
//脚注
//1. 通过指南针测量，指南针没有失效
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1108{}