//Level C-136
//评分: 
//+18
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//owhYi3pFC6mOXxe.png
//大厅。
//
//自从来到这个被称为“后室”的地方后，我们一直致力于捍卫紫肤的高贵与唯一性。在数场战争后，我们终于攻占了此地。
//
//描述：
//这座美丽的宫殿曾被肮脏的红血种占据，但我们将它拯救了出来，现在它是我们的基地。
//
//它的建筑风格是我们从未见过的，但我们在尝试将它改建的更符合我们的审美。这座宫殿似乎是没有尽头的，奴隶们经常迷失在其中，它的其中一些走廊不知为何散发着刺眼的蓝光，这大概是神在眷顾我们的一种象征。我们在距离中心大厅不远的各处走廊与房间做了记号，只要你顺着记号前行，就可以到达大厅。
//
//我们通常在大厅接纳新的成员并为他们举行入团仪式，同时大厅也是连通居住区与地下室等房间的纽带。大厅的两旁有着许多扇门，通过它们可以到达其他可探索的层级，然而这些门的出现似乎是不固定的，有时它们会消失，然后在几天后重新出现。
//
//居住区
//大厅的左侧有一条通往二楼的楼梯，二楼是我们主要活动的地点。
//
//楼梯口的右侧走廊似乎没有尽头，它两旁的大部分房间已经被我们改建成了卧房，图书室，储藏室，厨房等房间。房间的门口通常会挂有名牌，请勿在未经允许的情况下擅闯他人卧房，我们会严肃处置。这条走廊有时会出现一些从未存在过的门，打开它们会让你回到大厅。
//
//楼梯口的左侧走廊通往一个圆形大厅，我们在此练习咒语与分享见闻。
//
//地下室
//AiB8RoOFSNmxg4U.jpg
//地下室。
//
//可以通过大厅右侧的楼梯到达地下室，这个没有尽头的地牢是我们关押奴隶的地方。
//
//俘虏来的红血种将会被关押在此，为了防止暴动，每个奴隶会被关押在单独的房间里，我们任命了五名金血侍在地下室巡逻。
//
//奴隶将负责打扫宫殿，或是在金血侍的监督下外出采集资源。为了不让肮脏的红血玷污这座宫殿，我们设立了专门的行刑室，违反规定的奴隶会在此被斩首。
//
//对于叛徒，我们会采取较保留尊严的刑罚，“吃糖果”是最常用的，他们会吃下一块包有指向树脂的糖果，然后被剥光衣物扔到其他层级自生自灭。目前只有一名红血种享受了这种死法，他生前诚心诚意的追随我们，并给我们提供了一部能查看数据库的手机，我们花了很长时间才弄明白了这些我们从未见过的东西和概念。
//
//基地，前哨和社区
//紫裔
//就是我们。我们致力于清除低贱的红血种并捍卫紫肤血统的纯正，我们欢迎一切和我们一样流着金血的紫肤同胞加入。
//
//入口和出口
//入口
//你可以在许多地方看到一扇金色的门，在它们上方有我们的记号，打开它你就可以来到此处，我们会迎接你的。为防止红血种闯入，我们设下了屏蔽法咒，只有紫肤者报出暗号方可开门。
//
//点击查看暗号
//出口
//可通过大厅离开，目前已记录的可到达的层级有：
//
//Level C-30
//Level C-20
//Level C-27
//Level C-158
//Level C-166
//Level C-15
//Level C-6
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1136{}