//Level C-138
//评分: 
//+13
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//Level C-138是后室C层群的第138层。
//
//描述
//Level C-138是一片由草原和乔木林地组成的层级，而在流浪者进入该层级的地点不远处有一个约三米高，长宽各一米的黛蓝色矩形石碑。该方碑表面有类似文字但不明意义的凹陷，而在方碑不同的侧面的凹陷则呈现出十分明显的风格差异。
//
//Level C-138除方碑外的整体地形略有起伏，但基本以平地与小土包为主，唯一的水源是树林外部的一处溪水，尚没有人能到达溪流的源头。
//
//该层级始终保持晴朗且伴有微风的天气。哪怕在树林深处抬头，也能看到透过斑驳的树叶之间照射下来的阳光，树林深处几乎都是这样光束间隔着树荫而构成的，流浪者称这里每时每刻都散发着“令人舒适的木质清香”。而即使在夜晚，Level C-138的天空也一样晴朗，很少看得到成片的云。这里的夜晚有和前厅一样的月亮，除了深蓝的天空之外偶尔也能看到几颗为数不多的星星。
//
//Level C-138的异常之处，即所有身处该层级内的人类，不论以各种语言都能实现无障碍交流。但交流的同时，流浪者之间的思维和任何主观感受都会进行相互“传递”，也正因如此，几乎没有流浪者愿意在这个层级长期居住。而留下的居住过一段时间的流浪者的报告中，几乎都提到了在Level C-138生活时几乎永远环绕在心中的“浅淡的悲伤感”，在与他人（尤其是单独两人时）交流并陷入沉默后这种感觉尤其强烈，以至于形成了十分明显的压抑感和抑郁情绪，但这种情绪一般不会上升至强烈的悲痛的程度或造成抑郁等心理疾病，而仅仅会“使人难受”。同时，这种情绪似乎会也随着流浪者离方碑距离的减小而增加。
//
//不过，值得注意的是，也有部分报告声称他们在Level C-138除了悲伤与压抑外还伴随着一些莫名的烦躁，这种情况的出现可能因人而异。
//
//社区
//没有任何一个组织打算驻扎在这个层级，这从某种程度上似乎也维持了这个层级的“纯净”。
//
//此处唯一的流浪者聚集地为放不远处的一个聚居点，位于一个小土包的山头。约有20人常期居住在这里。
//
//所有居住在这个社区的流浪者均为失语者，他们或为先天或后天事故失语，又或者是加入社区后主动放弃了语言沟通，从而成为失语者。
//
//据说树林的极深处生活着一群失落一族和异人，不过没有人能真正证实这点。
//
//出入口
//入口：
//
//当长时间保持压抑情绪的时候就有可能切入Level C-138。
//独自观赏夜景的时候有小概率切入Level C-138。
//出口：
//
//表现出狂躁或极端暴力倾向则会被送回原本所在的层级。
//试图伤害其他人时也会被送回原层级，也有可能会传送到Level 0
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1138{}