//Level C-187
//评分: 
//+10
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
//安全
//不稳定
//实体绝迹
//Level C-187是后室C层群的第187层。
//
//描述：
//Level C-187是外貌为现代城市的地方，由无数道路与建筑组成。但因为不明原因，所有前往过此层级的流浪者都报告称这里一直都是夜晚，并处于夏季。
//
//jFDCoF.jpg
//一名流浪者拍到的他在此层级遇到的场景。
//
//每名流浪者所活动的空间似乎都是不同的，因为他们报告称他们遇到的场景都是关于他们小的时候的回忆。但也能通过前往高处从远处看到其他他们没有见到过的建筑，推断每一名流浪者在这个层级内都被分配到了不同的区域。层级的内容具体为一座处于夜晚的城市，而城市的构造则取决于流浪者的记忆，通常都是这些流浪者记忆中的某个地方的投影。极少数情况下会有在后室内诞生的流浪者进入次层级，但遇到的内容也多半是他们曾去过的一些城市层级的样子，目前还没有出现过诞生于后室且没有去过城市层级的流浪者进入过此层级。
//
//此层级十分的“热闹”，似乎流浪者目光所及之处的城市仍在运作。并且能够看到远方有行人车辆；能够看到街边饭馆将塑料桌椅摆在人行道上，以及喝着啤酒滔滔不绝的食客；能够看到一些老年人们在蔬果店内抢购瓜果；还能看到路边有人摆摊，贩卖服装招揽到不少行人驻足……大部分情况下，流浪者都认为自己返回了前厅，但通常接下来的遭遇会很快让他们打消这个念头。
//
//只要流浪者接近这些地方，这些地方很快就会变得破旧不堪并且一切都将消失。行人会变得无影无踪，而荒废的汽车则没有规律的放在道路上；街边的饭馆的塑料桌椅将会被胡乱打翻，而食客们则消失的无影无踪只剩下桌上的腐烂食物；蔬果店内的水果全部都变得腐烂不堪，并且架上会现有几瓶杏仁水出现在那里；街边的摊贩也变成了一个个杂物堆，完全没有了之前的热闹氛围……而流浪者离开这些区域后，在此观察这些区域，则又会变成之前的样子。
//
//每一名流浪者只能在此层级内活动一个小时，当一个小时过去后，他们会被传送回他们进入这个层级时的地方。但大部分流浪者的精神状态都表现出了忧郁症的倾向，并且会保持自己处于有其他流浪者活动的区域停留，但这种状态一般不会持续太久流浪者便会恢复正常。
//
//实体
//无法接触到的行人与车辆目前无法判断是否是实体还只是某种幻象。
//
//基地、前哨与社区
//该层级不存在已知的基地、前哨和社区。
//
//入口与出口
//入口
//每当有在前厅生活经历的流浪者回忆起过去在城市中的经历时，都有可能会来到此层级，但只会发生一次。
//出口
//1个小时后，流浪者便会返回，并再也无法来到这里。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1187{}