//Level C-190
//评分: 
//+11
//+
//–
//X
// 
//
//生存难度：
//等级 2
//
//不安全
//不稳定
//精神影响
//Level C-190是后室C层群的第190层。
//
//描述
//Level C-190本体的外形是一座约六层楼高的旧居民楼，楼龄约在20年左右，该居民楼是一座独立的由混凝土、钢筋及橙色外墙砖构成的房屋，设有斜坡屋顶和装饰的圆柱尖顶，以及阁楼仓库。
//
//该居民楼共有18套居住用房，每套120平米，装修风格和内部环境各有差别，但标准的家用物品基本备齐，床单衣物整齐存放。
//
//Level%20C-190%20A.jpg
//一个位于503中的衣柜。
//
//Level%20C-190%20B.jpg
//探索者拍摄的内部景象
//
//在Level C-190中有一种空间扭曲现象，凡是距离502（即第五层二号房）越远的住房，其无论从视觉角度还是实际体验角度的混沌化的现象就越严重，除了在第一层有所缓解。
//
//此类空间扭曲现象伴随的是有些住房根本无法被探索，因为任何尝试进入的行为都有可能使探索者被卷入，曾有后室空间学家认为此类空间的本质是虚空。
//
//而在第五层，即与502号相邻的501和503则没有空间上的不稳定，但内部的环境仍有变形，例如地板存在弯曲、坡度。
//
//空间尚存稳定的住房内部都被观察到有窗户，但这些窗户无法被打开或是击破。
//
//在居民楼内部没有电梯，只有一条由第一层贯通至阁楼的楼梯，楼梯以饱经沧桑的灰色油漆覆盖，而有些脱落、生锈。
//
//常久暴露于Level C-190对不同的人员都会带来精神影响，其在女性人员身上表现为5-羟色胺合成失能，而在男性人员身上则是轻度的情绪低落、易怒。
//
//为防止潜在的精神障碍风险，M.E.G.在此的队员皆为男性，安城的卫生院会在每个月派发神经递质调节药物，有关Level C-190的临床心理学研究提案目前是不被接受的。
//
//502号住房内部有一座木质的刷有干净的黑色油漆的旋转楼梯，此楼梯的阶梯十分狭窄，但一般的探索者均有能力攀爬上去，此阶梯通向本层级的第二部分延伸空间，却非602。
//
//延伸空间是在深入探索后发现的一座独立的空间，但该空间没有另外的出入口与其他层级贯通，在外形上看也是一套住房的内部，气温相较502号高，有一处较大的窗户和一处较小的阳台，通过窗台和阳台对外的观测显示，外部的环境保持于阴雨天黑夜的恒定状态，缘由未知。
//
//与502号住房不同的是，延伸空间的房间多了许多带有生活痕迹的杂物，灰尘、纸、垃圾桶、冰箱、厨房、厕所、衣柜、书柜、写有各类内容的笔记本等，但带有手写痕迹的物件上的文字都因未知原因模糊了，而衣柜的衣物则以碳年代测量法显示为产自于2010年至2012年间的女士服装为主。
//
//书柜中的书籍各式各样，泛文学类作品放有加西亚·马尔克斯所作的西班牙语原版的《百年孤独》、《霍乱时期的爱情》、《没有人给他写信的上校》、《蓝狗的眼睛》，此外有以商科类或理科类为主的诸多英文书籍，另有东野圭吾、刘慈欣等前厅著名作家的作品。
//
//书籍经研究，并无任何异常，已运入Level C-73的联合图书馆。
//
//另有一处较小的书桌上，摆放着一台mac笔记本电脑，但任何打开和提取数据的尝试都失败了。
//
//延伸空间之外部的空旷环境，在视觉上是某座充满灯火人烟的现代都市，但实际上也是类似Level C-190的一些住房的混沌区域，无人机在进入后即刻失灵下落，后不见踪影。
//
//延伸空间对于进入人员的精神影响相比其他空间都要大，在延伸空间中滞留约72小时会对任何进入者的5-羟色胺合成系统造成永久性伤害，其导致的各类心境障碍谱系疾病难以推动痊愈。
//
//在Level C-190的阁楼中，藏有约20个不锈钢保险柜，每处保险柜共有两个藏匿口，部分的藏匿口会出现不定期补货的“苹果口味杏仁水”，其无害，且特性与杏仁水相差无几。
//
//在Level C-190里并没有任何的实体，除了常于502号房活动的2只仓鼠。
//
//发现
//在Level C-190被Level C-8的红星工程队于2018年发现时，所有住房的内部都没有人以及人的痕迹，在2019年，有探索者试图长期入住502号住房，但在数个月后落荒而逃。
//
//2021年，一名Level C-73的安城居民“张三”在中央公园的喷泉边无意间闯入了本层级，后上报了M.E.G.前来调查。
//
//基地、前哨与社区
//M.E.G.新和中转站
//设立此中转站的目的是控制和中转自Level C-73通向Level C-8的交通线，通常用于运输，其次是长期观测本层及附近的其他后室空间。
//目前共5人长期负责，备有一些设施和器械。
//入口与出口
//入口
//在Level C-73的安城中央公园处找到刻有“空思忆，柳依依，终是忆旧终还零”一行字的一处石碑，从其下的草丛里进入。
//在Level C-8中找到一处橙色的外形华丽的木质斜顶别墅进入。
//概率极小的自Level C-199中的地板里落入。
//通过在Level C-73.1中的天花板上找到一处通风口爬入。
//出口
//从正门走出，可抵达Level 11。
//通过发现一处泥土，扒开然后爬出去，可抵达Level C-73的安城中央公园。
//在本层的502号住房内部找到一处海报贴着的隐藏洞，爬入可抵达Level C-73.1。
//找到并触摸一个木鱼可切入Level C-147。
//在本层的403号住房的一处卧室间里找到写有“404”门牌的门，可进入Level 404，但我们不建议这么做。
//带着一件手电筒穿过101房间的门，可以进入Level C-100
//- 认证成功
//附属文件
//是这样的，我们新和中转站的小队，也就是新和小队在五分钟前于Level C-190的502号房找到了一连串的信封，发信人名叫“李洋”，还另外发现了一本笔记本。
//
//我们队长看了一会，半懂不懂的，于是跟我们说这些文件资料可以上报去专门研究。
//
//信封其一（是一张斑驳老旧的纸，碳年代测量法证明其为2005年所作）：
//
//《沁园春·此彼》
//自难又至，时日不见，枕夜难眠。
//似烬似风雨，扑人心房，而离亿丈，思绪万千。
//不与愚者，强争高下，只论青山依旧甜。
//曾经望，惟伊人可爱，余香绵绵。
//看窗风雪流连，从未见，隐遇再延年。
//久久不见日，词格却秉，负凛到夜，时至呈现。
//乐土而微，言稍感顿，何以观天俱变迁？
//惘天下，待花丛烂漫，此彼牵连。1
//
//信封其二：（一张相对崭新的纸，经碳年代测量法表明于2011年所作。）
//
//《鹧鸪天·柳逢啼》
//春花尽继付了谁，遥望江水正追随。舍心独救幽云处，谨记英风只有期。
//客舟里，尽相离，拂寒缘去若无衣。只将各度千阳月，留作行间几处凄。2
//
//信封其三：（最为崭新的一张纸，经碳年代测量法表明于2012年所作。）
//
//《临江仙·泊舟》
//江河雨下涟漪在，淌过傍水溪流。此长思忆似乘舟，尽思伊故未今留。
//昨夜西风凋落叶，看灯荧万家楼。凭阑相去弃凝眸，何知空负尽心忧。3
//
//神秘的笔记本
//《晚行言》
//浓郁的柴火，拂动着整个冬天。
//你呵了呵手，将光明传达至遥远的天边。
//脚下的路很潦草，无尽的思忆去不到你跟前。
//今朝今宵，度日如年。
//
//从未忘却，残影之间。
//我错了，可我必须承担一切牢笼之宴。
//我多么想回到你的眼前。
//
//风去了，可风又没有离去。
//花落了，但她们将焕发新生。
//雨停了，却没有彩虹。
//我哭了，泪已尽，一切都已经结束了。
//
//记得我们相识那年，我站在阳台上，夜晚繁星闪烁，刺骨的寒风总是推打着窗户，吹透了我的衣袖，可当我绝望之时，我想起了你。
//
//如今，我误入歧途，反悔只让周围的教徒将我关押，无尽的黑暗就在我身边，我依然想起了你。
//想当初你说的是对的。
//
//往日的事情还在不断闪过，曾经的我们无比的欢乐。
//
//我多么盼望你能来救我，M.E.G是个好组织，而你也是一个心地善良的人。
//
//这里的夜空没有亮丽的明月和星辰，这里的炬火只会散发出刀刺般的触手。
//
//我也已然不再觉得迷惘，亦望求生却不得。
//
//我想说再见了，可你一定要好好活着。
//
//我爱你。
//
//- 隐藏内容
//旧事
//君应尽覆七重月，醉更难为破晓天。几尽风沙阑与荡，今宵雨雾枉伤眠。
//
//“我看，来一碗凉拌米线吧”李长林说道。
//
//“好嘞”，安城小吃店的老板回答。
//
//“最近清明节，但是这探索者总署的政务部有职位分配和会议，我吃完了还得赶路。”
//
//老板道：“这安城越建越好了，我看，前个月市中心刚砌的公园喷泉，今天终于喷了。”
//
//“这个公园是目前装修公司做绿化的产物，以后绿化在工程项目里会成为不可或缺的一部分。”
//
//“不是我说组长您啊，我发现您总是一个人，俗话说猛虎总是独行啊。”
//
//李长林笑了笑。
//
//吃完招呼散去，走看街道上人来车往，只见一阵冷风吹度了人烟闹市，李长林顺着上班的路踏进了公园的小树林，走向了路口的喷泉旁的那只小石碑，上面刻着“空思忆，柳依依，终是忆旧终还零”，看罢，他从包里拿出了三支蜡烛，排成一排，一想安城的控火管理较严，故没点火。
//
//“你放心，一切都会好的”，他说。
//
//作者信息
//« Level C-189 | Level C-190 | Level C-191 »
//
//Footnotes
//1. 这首《沁园春·此彼》存在部分不符合一般此词牌的平仄，有大量出韵错误。从“曾经望，惟伊人可爱，余香绵绵。”来看，这是一封典型的情书，“词格却秉，负凛到夜”中的词格通常是近体诗初学者所用的平仄格式表，通过填写、照写等方式让平仄符合既定规则，“负凛到夜”可能表示作者为写这首《沁园春·此彼》而仿佛遗忘了环境的寒冷，为推敲内容而忙活，最后的两行：“乐土而微，言稍感顿，何以观天俱变迁？惘天下，待花丛烂漫，此彼牵连。”则以具有浪漫情怀和升华意义的文字收尾，表明了心中之志，指出了所在大环境“乐土微”的现状，并加以“待花丛烂漫，此彼牵连”的含蓄之句，本意应是“以后，和你共同努力”。
//2. 根据《词林正韵》，这首《鹧鸪天·柳逢啼》及后面的《临江仙·泊舟》的平仄及押韵水准都有极大的进步，从内容上来说，“舍心独救幽云处，谨记英风只有期。”应是作者曾至少某种意义上救过收信者。
//3. “此长思忆似乘舟，尽思伊故未今留。”表示对故人的思念之情，“凭阑相去弃凝眸，何知空负尽心忧”表示对方远去（可能是收信者）并辜负了自己的担忧。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1190{}