//Level C-103
//评分: 
//+5
//+
//–
//X
// 
//
//生存难度：
//等级 4
//
//不安全
//不稳定
//大量实体
//Level C-103是后室C层群的第103层。
//
//描述：
//Level C-103是一高度约30米的山峰，山上从山下望去可以看到很多土路，并夹杂着很多坟墓。该层级似乎一直保持着春天时的状态，此处的植物都处于刚刚长处嫩芽的状态，并且温度保持在15℃至20℃之间。
//
//进入该层级时，所处的位置通常都为山脚下，此时流浪者可在所处位置前方五六米的一张座子上获取离开这个层级必要的道具，这包括：四盒贡品糕点、两袋不同种类的应季水果1、两包纸钱2、一双筷子、一包香烟（非必定出现）、一罐沏好的茶（非必定出现）、开山刀（出现概率极低）。
//
//当流浪者获取这些道具之后，据报告称他们的脑海里就会闪现出一个坟墓的位置，并掌握通往这个地方的道路。但山路似乎因少有人来而导致杂草丛生，必须清除杂草才能前进。杂草丛中有很多长满倒的刺酸枣树，这非常容易刮破装着道具的塑料袋，而导致其物品散落一地。上坡路也有很多碎石，会导致流浪者滑倒。经过千辛万苦抵达目的地之后，流浪者的任务只有一个，那就是开始祭祀。通常这些坟墓的墓碑的内容都与流浪者本身有关，一般为该流浪者已故的长辈。一般的贡品摆放并不会出现障碍，但当祭祀进行到一定程度，山路上将会出现数量不少的无面灵，这些无面灵的右胳膊上都带着一个红袖标，并且腰间都别着一个扩音器并播放着有关森林防火的宣传语。而流浪者接下来要将两包纸钱统统挂在坟墓旁的树杈上，但这个举动不能被那些无面灵发现，一旦被发现并被这些无面者追过来且发生肢体接触，流浪者便会传送到一开始的位置并重新领取道具，再随机一处新的墓地进行祭祀，上一个坟墓前的贡品也将快速腐烂无法使用。
//
//如果流浪者在太阳落山前不能完成祭祀，那么流浪者将会被传送到一个山间公路上。此时流浪者的身后将出现数量难以估计的猎犬等行动迅速的实体，此时流浪者只能沿着公路向着反方向逃跑，并且将一直持续到天明。但据跑完过的流浪者称，这条公路并非一直是直线，到后面将会出现急转弯、大陡坡与坑洼地等不利地形。
//
//基地、前哨与社区
//该层级不存在已知的基地、前哨和社区。
//
//入口与出口
//入口
//在任意层级发现并食用一盒贡品糕点后将会被传送到此层级。
//进入后室第二年的流浪者将在本年的清明节来到此层级，并且离开后将不会在因清明节的原因来到此层级。
//出口
//祭祀成功将会被传送回原本的层级。
//祭祀失败并在山间公路上奔跑到天明也可以返回来的层级。
//作者信息
//« Level C-102 | Level C-103 | Level C-104 »
//
//Footnotes
//1. 包括梨、苹果以及橘子，每种三个一袋。
//2. 一包白色代表银元，一包黄色代表金元。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1103{}