//Level C-157
//评分: 
//+12
//+
//–
//X
// 
//
//生存难度：
//等级 5
//
// 
// 
// 
//Level C-157是后室C层群的第157层，外观为一座破败的现代城市，该层级的已知入口已被M.E.G.封锁
//
//描述
//jWElPx.jpg
//由B.A.G.人员拍摄的本层级照片
//
//Level C-157内部实体目前处于“交战”状态，层级内随处可见具有极强攻击性的无面灵，鬼警会与这些无面灵战斗且往往不会攻击人类。
//
//在该层级内，可以寻找到指向树脂、药品(包括治愈水晶)、火盐、武器等，这些物品会定时随机出现在层级的房屋内。由于没有食物出现，流浪者在本层级生存时应储备足够食物并迅速前往附近的前哨站。
//
//在Level C-157中所有建筑物都可以被破坏，它们都由正常的材料建造。有时，该层级内的无面灵会主动破坏这些建筑1。这些被破坏的建筑不会复原，也不会重新出现物资，所以目前有说法称，该层级最后会被夷为平地。
//
//实体
//在该层级出现最多的实体为鬼警和无面灵，无面灵行为如上文所述，且会携带各类武器。鬼警会无条件袭击无面灵，但也会对攻击自身的其他实体发起攻击。
//
//基地、前哨与社区
//B.A.G.公路前哨
//位于本层级通往Level C-28的出口处
//已被摧毁，成员全部阵亡
//B.A.G.避难所前哨
//位于本层级通往Level C-144的出口。
//成员为10名B.A.G.士兵以及2名枪手实体
//会帮助其他流浪者前往安全层级。
//入口与出口
//入口位置2
//Level C-28
//Level 11
//Level C-490(已失效)
//Level C-225
//Level C-144的一处标有“157号避难所”的防空洞
//出口
//走出一个外观类似城市收费站的建筑的大门可以来到Level C-28，但该出口已被鬼警封锁，这些鬼警会袭击任何实体和人类。
//走进一个标有“157号避难所”的防空洞可以前往Level C-144
//附录
//在Level C-157于2020年3月21日被发现后，M.E.G.迅速派遣人员进入，但所有人员全部失踪或死亡，由层级内有部分误入的流浪者以及M.E.G.人员，M.E.G.方面委托B.A.G.进入该层级实施援救。
//以下为B.A.G.战斗队成员通过终端发送的日志，该成员已经阵亡。
//
//- 点击收起
//2020/03/21
//这里是战斗队成员[[FI 1781]]，本次行动，我作为战斗小队队长进入Level C-157执行任务。
//
//以下为行动内容概括:
//
//本次行动中，我们将配合勘探队成员及搜救队成员，共25人及5名实体，帮助营救该层级内M.E.G.人员及迷途者，同时记录层级内部状况、出入口，实体情况等。在条件允许的情况下，在此处建立可长期运行的基地。
//
//生命之主在上，祝我们顺利。
//
//2020/3/22
//我们顺利营救了部分误入的迷途者，但是尚未发现M.E.G.人员。
//
//层级内部实体众多且极富攻击性，无面灵手持枪械并且会对人类开火。所幸，枪手们很善于对付这些家伙。
//
//我们仍在寻找出口，请等待回复。
//
//2020/3/23
//通过指向树脂，我们发现了一个出口，这个出口通向Level C-144，且为双向出口。
//
//这对于处于那里的迷途者来说是个好消息，医疗队员们将会驻扎于此。
//
//2020/3/24
//食物告急，这个层级虽然会刷新物资，但从未出现食物。
//
//另外，两名勘探队队员被鬼警带走了。
//
//指向树脂显示，这个层级或许还有其他出口，希望这个出口通向安全层级。
//
//2020/3/25
//我们发现了另一个出口，通向Level C-28,所有被援救人员已经被全部转移。
//
//另外，我们在此处建立了2号前哨，希望总部支援我们，务必迅速！
//
//2020/3/26
//求救！ 求救！
//
//我是随行的枪手[[EN 457]]，2号出口已经被实体封闭，原日志编写者已经阵亡，残余人员现已经撤离至1号入口处。
//
//请总部予以支援，迅速！
//
//目前，B.A.G.位于该层级的前哨站状况良好，M.E.G.方面会定时给予援助。
//M.E.G.将会与B.A.G.展开长期合作，确保误入的流浪者可以得到及时援助。
//
//作者信息
//« Level C-156 | Level C-157 | Level C-158 »
//
//脚注
//1. 包括但不限于使用爆炸物，车兽冲撞等方式
//2. 应B.A.G.要求，除前往Level C-144的入口外，以下列出的入口皆不说明具体外貌，防止流浪者误入，M.E.G.已经在以下区域设立前哨
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1157{}