//望乡台介绍及守则》
//
//
//
//
//亲爱的流浪者们，欢迎，欢迎来到望乡台!
//
//
//这里是唯一可以回顾您所向往之处的地方!
//
//
//这里是唯一能探望长久思念之故人的地方!
//
//
//这里是唯一让您不再那么寒心销志的地方!
//
//
//您还在思念着前厅吗?
//
//
//望乡台欢迎您!
//
//
//
//
//介绍
//
//
//
//望乡台是在后室的空旷层级中随处可见的一个层级！只要您正位于您所在层级的室外，那么在这个层级的空旷场地中将会有1%的几率遇到望乡台，既然您已经看到这篇守则了，那么想必您肯定就是那1%的幸运儿！望乡台随时欢迎您的到来！
//
//只要来到望乡台，您便可在这里探望您的家乡，探望下您那想念的家人们。虽然他们无法感知到您的存在，但我相信，他们心中一定会知道您此时正看望着他们。当您在这危险恐怖的后室之中充满绝望的时候，想必您的心中肯定很想念家人吧？快来这里，去看看您那思念已久的家人们吧，想必他们肯定也很想您！
//
//当然，您肯定想问，我们为什么要为您提供望乡台？当您在看望家人之时，您的莼鲈之思便会通过望乡台收集，并转化成能量为我们所用，这便是我们愿意为您提供望乡台的原因。
//
//
//
//守则
//
//
//
//
//流程
//
//
//
//1、进入方式：当您到达望乡台之下时，只需在心中默念您希望到达前厅中的时间及大概地点。随后望乡台楼梯旁的透明屏障便会消失，此时您就可通过楼梯登上望乡台。当您踏上楼梯时，透明屏障便会将楼梯封锁，随后望乡台将会从您进入的层级消失。
//
//2、选定地点：当您登上望乡台之后，您便可从望乡台上鸟瞰到您所选择的大概地点。此时您只需望向您想要去往的地点，并闭上双眼，在脑海中回忆。在心中默念三秒钟之后睁开双眼周遭环境便会是您所希望回到的地点。
//
//3、享受这段时光：此时您便可在十米乘十米的范围内自由活动，并且可以穿过除边界外任何物体和墙壁。在此期间不会有任何其他流浪者打扰您，这是属于您的时间。快看看您想念的家人吧，怀念下自己曾住过的房间，或是嬉戏过的公园，想必您一定非常怀念这些。
//
//4、结束：在三十分钟之后，您的视线会逐渐黑暗，周围环境便会慢慢回到望乡台之上，而望乡台之外的风景将会是任意生存难度五或死区的层级的室外。此时您便可顺着楼梯走下望乡台，随后望乡台便会消失于您现在所处的层级。当然，我们非常欢迎您下次光临。
//
//注意事项
//
//
//
//1、不要在望乡台长时间逗留，否则我们将会使用我们自己的手段将您驱赶。
//
//2、您可选定的区域范围仅包括前厅，且仅限于地球。
//
//3、当您在回忆时请记起尽量详细的人物形象和空间布局，否则人脸与场景可能会变得扭曲且错乱。
//
//4、请您放心，望乡台绝对安全，当您位于望乡台时绝对不会受到任何攻击和伤害。
//
//5、请不要试图翻越望乡台的护栏或在自由活动时试图切入边界，这可能会造成一些非常棘手的问题。
//
//6、若您在自由活动时感觉时间已超过三十分钟但环境仍未回到望乡台之上，请您放心，在自由活动时感到时间流动过快为正常现象，无需在意。
//
//7、请将个人物品随身携带，避免遗漏。
//
//
//撰写人：GaplouelPew
//图片来源
//介绍及守则 第 176 份复印件
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1176{}