//Level C-179
//评分: 
//+21
//+
//–
//X
// 
//
//生存难度：
//等级 变化
//
//变化的安全性
//不可长期居住
//可利用
//Level C-179 是后室C层群的第179层。在该层级中，对建筑物的破坏行为是危险的。但流浪者可以安心在此治疗因伤所致的残疾。
//
//YA9J7gUQm1b5kuC.jpg
//一名近视患者拍摄的Level C-179窗外的景象
//
//描述
//
//Level C-179 是一片独栋房屋建筑群，根据推测其是无限大的，但是流浪者无法离开其所身处的房子。另外，在该层级没有Wi-Fi信号。进入该层级的流浪者会出现在一房屋的玄关。该房屋的室内装饰与布局通常会符合流浪者对梦中情房的定义但其整洁程度却不尽相同。现有的研究表明该房屋的状态与流浪者的健康息息相关，对该房屋的修缮行为可以直接提升流浪者的健康状态，而对该房子的破坏行为则会同时伤害到流浪者本身。其中值得注意的是房屋的阁楼反应了流浪者的思想与知识，因此对阁楼的改动是极度危险的，这可能导致失忆，患精神疾病等后果。另外，在此层级长期居留是不可行的，当一位流浪在此逗留超过7小时，流浪者的脑中将会出现一个声音。其会重复提醒流浪者：“你该出去看看了。”之后，流浪者将会在下一次失去意识时被传送至一个安全Level。
//
//
//调查记录1
//1. 流浪者：H， 男性，26岁，有10年烟龄
//
//-收起调查记录1
//下面是一段录音日记：
//
//我发现了一个全新的层级，我现在在一栋房子中，刚才我正在一面镜子前研究我中午吃的蘑菇卡在了我的哪条牙缝中， 结果我扶镜子的手一空就卡到了这里。这是一间黑红配色的房子。。让我看看这里是什么。天啊，这里还有舞厅和迪斯科灯球！不得不说，这房子的设计还是很得我心的， 如果这里安全的话感觉住在这里也不错。咳咳……这里还有一个被栅栏围起来的火炉， 就是这火炉的灰有点大导致这个房间乌烟瘴气的，周围的家具都表明都落了一层灰烬，火炉的烟道也熏黑了……咳咳……窗外是一片别墅，他们每一栋的风格都相差挺大的。天气是没有云彩的蓝天。我去其他房间看看……
//
//这里还有一个阁楼，里面有一些……额……私人物品。总的来说这件房子是安全的， 现在我要去房子外面探索看看。
//[H 打开了房间的正门，然后出现在了Level 11的一个公寓走廊上。这是对Level C-179的第一次记录.]
//
//-收起调查记录1
//
//
//2. 调查员：J，男性，34岁， 常年坚持锻炼
//-收起调查记录2
//M. E. G. 在了解了该Level的存在后，派遣了一位调查员对该Level进行调查。下面是调查日志:
//
//我是进行‘进入Level C-179第5次实验’的调查员J，通过窗外的景色判断我应该已成功进入了这个暂定为Level C-179的层级。目前来看，通过镜子切入该层级的方式是不稳定的。与第一次发现该层级的描述不同的是，我现在正处在一间北欧风格的木屋中，并且这里的格局与我在前厅的家类似。由此可以推测进入该层级的人会进入符合其喜好的房子中。对房屋的探索进展顺利，该房屋是安全的，并且干净整洁得仿佛有人时常打扫。另外，在该房屋的阁楼存放着大量武器，以及……我与我妻子的巨幅结婚照。我拿了其中的两把枪，并尝试将其带出该层级。如果此方法可行，这将为我们的武器供应提供新来源。接下来是离开房间的尝试，所有的窗户都上锁了，我将尝试通过工兵铲打破窗户的形式尝试离开该房屋。
//[事后J 被发现晕倒在Level 1的M. E. G. Alpha基地外围，左眼失明。在其清醒后，他发现他忘记了两种常用枪械的使用方式。]
//
//-收起调查记录2
//
//
//3. 流浪者：B，男性，47岁，体脂率高于45%，有中度洁癖
//-收起调查记录3
//受访者：B 地点：Level 57的休息长椅
//M.E.G.记者：下午好，B先生。您比照片中要更加年轻帅气。
//
//B：下午好，先生。我想这正是你们来采访我的理由。
//
//M.E.G.记者：是的，我们听说您在Level 57找到了进入新被发现的层级的稳定入口，并且对该层级的特性有了新的推测。
//
//B：是的，那天我在画廊参观的时候刚巧遇到了画家在装裱作品。那是一面光滑平整的镜子。她很少用这种非常规的材料进行创作，于是我就与她多聊了几句。她说这面镜子是突然出现在她的工作室中的。当时她正在创作瓶颈期，每天的精神都不太好，焦虑、烦躁……但是在看到这面镜子中的自己后，她突然感到不再焦虑，并且感到发自内心的放松。于是她打算将其装裱起来放入画廊。我说：“看来让人内心平静的并非是这面镜子，而是镜中美丽的小姐呀。不如介绍就写‘镜子并非艺术品，镜中的你才是完美的艺术品 ’吧。“
//
//M.E.G.记者：看来您的意见被采纳了，我们的队员发现那面镜子下方的标语正是这句话。
//
//B：那是当然，我总能提出能够提升艺术品价值的意见。
//
//M.E.G.记者：那之后呢？我们听闻您进入了那面镜子。
//
//B：是的，当时我只是想要研究一下这面镜子的材质，但一下子切了进去。
//
//M.E.G.记者：您能详细描述一下您在该层级的经历吗？
//
//B：我出现在了一座装修为巴洛克风格的房子的前厅，里面装饰了大量我所经手的艺术品。事实上，就连我也辨别不出它们的真伪。而且它们都摆放在最适合它们的位置上。我觉得任何的改动都会破坏那里的美感。之后，我便对那里探查了一番。卧室之中拜访着我最喜欢的床品。在前厅的时候我只用这个牌子的床品，那才是真正的舒适。在卡入后室的头一年，我还一直因为找不到好床品而失眠。当然，现在我差不多习惯了。房子阁楼的部分则是一间书房，主要涉及艺术、历史、文化以及经济学，全都是我以前看过的书。整间房子基本上都是让人舒适的，除了厨房与餐厅。当我移步到餐厅的时候，我险些吐出来。黑褐色的油脂夹杂着一些食物的残渣从厨房漫出到餐厅，餐桌也是粘腻的。我本来还想在这里常住的，所以不得不小心得把地上的油脂处理一下。再我把地板重新打扫干净后，一阵好似吃坏肚子的腹痛袭来，使我不得不去方便一下。在那之后我便晕倒了，再醒来我就回到了画廊。不过我瘦了差不多三分之一，身上的衣服都只能勉强挂在身上。
//
//M. E. G.记者：如此看来，这个Level确实会影响进入者的身有着直接的联系。
//
//B：哈哈，你们不是有个调查员为此瞎了一只眼吗？不如让他去重新换一面窗户试试。额……我看时间也差不多了，我在之后还有约，不如本次采访就先到这吧。
//
//M.E.G.记者：好的，感谢您能接受我的采访。
//[随后，B拿出一封信件，用手划过封底的签名，在记者面前消失了]
//
//-收起调查记录3
//
//
//4.调查员：J，男性，35岁，左眼失明
//-收起调查记录4
//在采访了B之后，M. E. G. 的决策层听取了B的意见，派遣了调查员J 通过Level 57的镜子再次进入Level C-179, 并且此次他携带了一面可用作替换窗户的玻璃。在进入Level C-179 后，J 发现自己回到了之前的木屋之中。并且发现之前自己打破的窗户仍处于破损状态。在将手中的玻璃作为窗户换上后，他的眼睛感到强烈的刺痛，并使其条件反射式地紧闭双眼。在他再次睁开眼后，他被传送至了M. E. G. 位于Level 11的Omega基地附近并且恢复了左眼视力。
//
//-收起调查记录4
//
//
//另外，曾有报告指出在该层级观察到窗外有建筑'融化'了。M. E. G. 的研究团队推测这可能与'悲尸循环'有关，目前相关研究正在进行中。
//
//基地、前哨与社区
//房车巡游（M. E. G. & 速切玩家）(已废弃)
//该基地由速切玩家成员徐侠与徐克两兄弟组成，由M. E. G. 雇佣他们进行层级探索与实验。他们在速切玩家论坛上表示他们在进入该层级后分别进入了两辆相邻停靠的房车中。于是，M. E. G. 委托他们每天抽出2个小时的时间在该层级探索并记录。在行驶2个小时后房车的加油提示灯会亮起，然后他们会感到饥饿。目前记录的最长行驶时间为2小时27分钟，两人几乎同时饿晕并离开该层级。在事故A-167后该实验项目停止，并且之后二人未经许可不得擅自进入该层级。
//-收起事故A-167录音记录
//滋滋……<电流声>
//徐克：喂喂喂……能听到吗？
//徐侠：你吓我一跳，没想到这里还有车载电台。
//徐克：好无聊啊，这些房子也长得差不多嘛，也不知道他们能研究出个啥。这层连Wi-Fi也没有，要不是他们给的实在是多我才不会接这差事。
//徐侠：要不我唱歌给你听？
//徐克：千万不要，我宁愿被一群实体追着跑也不要听你唱歌！
//徐侠：你可真是没有品味……
//徐克：不说这个了，你快看不到我的尾灯啦吧，哈哈！
//徐侠：哦，想要和我比飙车，你还嫩了点。十秒后你就吃我的尾气吧！
//<引擎的轰鸣声>
//徐侠：嘿，看看那个房子上的天文台，像不像和我们对接的图斯博士的大光头……
//徐克：哈哈，我又超过你啦……
//徐侠：嘿，看路！！！
//<剧烈的碰撞声>
//[事故发生后，主管该实验项目的Dr.图斯面部突然出现了类似遭到剧烈撞击的伤口并损失了两颗门牙。在了解了事故经过后，他紧急叫停了该实验项目并表示不会再参与任何与速切玩家合作的项目。]
//
//-收起事故A-167录音记录
//这群横冲直撞的家伙根本不懂得什么叫做科研！——Dr.图思
//
//
//
//入口与出口
//入口
//在Level 57中找到一面简介为‘镜子并非艺术品，镜中的你才是完美的艺术品 ’的镜子，触摸后可进入Level C-179。
//在Level 906或任何你能找到 布兰奇女士
//Blanche
// 藏书的地方找到一本名为《健康的奥秘》的书翻到第179页可进入Level C-179。
//在Level 153找到一本名为《灵魂的居所》的书翻到第179页可进入Level C-179。
//在Level 4找到一面被装到墙上的镜子，触摸后可进入Level C-179。请注意你找到的镜子是绝对完整的，如果该镜面有任何裂痕，你可能被传送至其他层级。
//在任何情况下卡入一面镜子你都有20%的几率被传送至Level C-179。
//出口
//从你所处的房子正门离开可以被传送至一随机安全层级。
//打破房屋的部分结构离开可以被传送至一随机安全层级。但你的身体将一定程度受损。
//在该层级停留超过7小时，在下一次失去意识时将被传送至一随机安全层级。
//在该层级流浪者通常可以找到一块被称为“秘密基地”的区域。它的外观因人而异，如小帐篷、枕头磊起的堡垒、床或者桌子的底下。进入其中将被传送至心之长廊。
//作者信息
//« Level C-178 | Level C-179 | Level C-180 »
//
//脚注
//1. 本记录中人名均为化名
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1179{}