//《	
//C-174
//
//》
//Related Agreements:
//solitaryquick-passhide
//pseudo-closedmessyalertno-camp
//unknown
//协议总级	生存等级	层级等级	实体等级
//0	7	7	2
//无威胁（×0）	孤僻性（2）	伪开放（1）	未知（2）
//快速通过（2）	杂乱（2）	
//停止观测（3）	警惕（1）	
//无定居（3）	
//«基础层级描述»
//
//forest-3394066__340.jpg
//由流浪者Chris拍摄的图像，拟似Level C-174
//
//基于Level C-174的存在具备不稳定性，该层级被暂时定义为后室C层群的第174层。
//
//Level C-174因其层级中存在着 广大面积 完全覆盖的，进行着无间断且无规律运动的白色大雾，而在流浪者间被命名为“雾林”。
//
//据收到的多份探索记录表明，Level C-174表现出了层级环境的异常多样性；多个流浪者可能同时进入Level C-174，但其所在的Level C-174除可被明确感知的大雾结构外，层级内的生物群系可能并不相同——在部分极端可能性下，多个流浪者可能进入完全相同的Level C-174中，但在其内的流浪者无法观测到彼此的存在。
//
//forest-3877365__340.jpg
//由流浪者Leo拍摄的图像，拟似Level C-174
//
//即便如此，Level C-174的主体环境结构仍是森林环境，未曾发现有城市建筑群结构的Level C-174；同时亦未于Level C-174中发现任何可能由人类或其他具备高等智慧的生物建造的建筑结构，包括但不限于房屋、铁轨、地窖等。
//
//流浪者在Level C-174中表现出了生理上的永存性；流浪者无需进食，其所携带的设备亦无需充能；值得注意的是，这一性质仅作用在了流浪者及其所携带的物品，并不对Level C-174内的树木、微生物产生作用。
//
//在流浪者成功从Level C-174中离开后，流浪者的生命体征恢复正常，可观测的创口消失，相关疾病被治疗；从宏观方向上观察，流浪者的身体年龄会被回溯至疾病出现前或创口出现前，其在Level C-174中记忆亦会随着时间流逝而逐渐被遗忘，拍摄的相关图像在设备中呈现出无法修复的破碎状。
//
//因此除去流浪者对Level C-174的描述具有高度相似性外，无任何有效证据证明Level C-174真实存在；但Level C-174对流浪者的实际影响是有目共睹的，因此该层级被暂时性假定存在。
//
//«附属层级描述»
//
//层级环境 - 以“森林”与“大雾”作为层级主体结构，未见有人类生活的痕迹——即便曾有不少人进入过该层级中。
//水资源 - 基于该层级的环境随机性，流浪者有一定几率可以在该层级中观测到小溪、河流、湖泊等地理结构。
//野生动物 - 流浪者在该层级中会不时听到鸟类鸣叫声，但据回收的报告显示，该层级中并不存在野兽生活的痕迹。
//土壤微生物 - 土壤中的微生物含量随该层级中森林结构的种类变化而发生相对应的数量变化及种类变化；尽管如此，尚没有一例从该层级中回收的土壤样本。
//层级特点 - 该层级的真实结构尚未被完全证实，但其中有不少由流浪者提供的假说来证明该层级的空间性质。
//第一假说 - 该层级曾在最初被推定为占地总面积无理论数值的开放型空间；这一假说在之后被推翻。
//第二假说 - 第二次假说表明该层级因大雾的存在而展现出了拟无限的有限空间；这一假说亦很快被推翻。
//第三假说 - 第三次假说用标记法证伪了第二假说，该次假说表明了该层级在主观方向的空间上的唯一性；该层级的总体环境结构为单一结构不断重复生成的伪无限开放型空间，在单一方向上不断行进会导致该层级的空间在行进方向上的扩张，但总体环境并不会发生改变。
//生存特点 - 流浪者进入该层级的方式无一例外地均是突然性的被动型进入，不同的流浪者在进入该层级时会包含以下至少一项性质。
//臆想性 - 由于流浪者在该层级中为单人行动，幽暗的光线、不时的鸟鸣、遮目的大雾、重复的环境等不安因素会压迫流浪者的精神，缺乏有效的沟通环境。
//流浪者在离开该层级后依然会伴随有开放场所恐惧症等心理症状。
//迷茫性 - 由于事发突然，流浪者无法在第一时间了解自己所处的环境，对自身经历产生迷茫。
//流浪者在离开该层级后会在短时间内伴随有精神恍惚或失忆，但这一系列症状会随时间流逝而减轻至无。
//谨慎性 - 即便大部分流浪者在进入该层级时毫无准备，但仍有一部分流浪者会及时了解环境并作出针对性行动。
//流浪者在离开该层级后通常会阐述自己在该层级中的经历，该层级的大部分相关资料由此而来——此后流浪者会遗忘这段经历。
//偏执性 - 因为该层级的结构特点，流浪者会试图将该层级中的一些可用资源带离此处，与其他流浪者一同分享。
//流浪者在离开该层后无法带离任何从中采集的各类资源——至少至今为止没有。
//生存性 - 流浪者会试图在该层级中长时间的生存下去——这似乎是可行的，如果你能抵抗住睡眠的诱惑的话。
//基于该层级的出口特点，流浪者会在进入深度睡眠或昏迷后重新返回至随机且宜居的层级中。
//«层级驻扎营地»
//
//由于Level C-174的性质，无法在本层级建立基地、前哨或社区。
//
//«入口和出口»
//
//«入口»
//
//即便流浪者进入Level C-174时是突然的，但据大量的汇总报告总结出下述几条可能会进入Level C-174中的方式：
//
//在任意层级中出现不合时宜的大雾——流浪者会在反应过来时进入Level C-174。
//几率约为0.03%。
//流浪者在任意层级中陷入深度睡眠——流浪者会在苏醒后进入Level C-174。
//几率约为0.0014%。
//流浪者在任意层级中陷入休克昏迷——流浪者会在苏醒后进入Level C-174。
//几率约为31%。
//«出口»
//
//离开Level C-174的方式同样存在多样性，但在离开该层级后，流浪者均会进入随机且宜居的层级中，没有例外。下述几条为流浪者通用离开Level C-174的方式：
//
//进入深度睡眠或陷入昏迷——方式不限，包括但不限于自然睡眠、击晕、窒息等。
//流浪者会在苏醒后离开Level C-174。
//闭上双眼朝单一方向不断行进，并在不再感受到浓雾的存在后睁开双眼。
//流浪者会在睁开双眼后离开Level C-174。
//死亡。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1174{}