//Level C-115
//评分: 
//+14
//+
//–
//X
// 
//
//生存难度：
//高危环境
//极端天气肆虐
//实体绝迹
//Level C-115是是后室C层群的第115层。
//
//描述：
//thunderstorm-3430471_960_720.jpg
//天气无人机传回的Level C-115图像，相对平静时
//
//Level C-115是大气活动极端剧烈的空间层级，Level C-115似乎没有真正意义上的固态地表，其内的环境与前厅的太阳系气态行星有相近之处。层级拥有极厚重的云层，变化无常的温度，流浪者一旦踏入层级就会无尽的下落，几乎没有生还可能。
//
//目前对于Level C-115的环境了解甚少，仅有的几次探测也是通过无人设备进行，但由于层级的危险环境，无人设备能够回收的次数也是寥寥无几，根据仅有的数据证明，层级的气候变化极端剧烈，基本必然导致人员伤亡和设备损失，层级内不存在任何资源，且入口固定，不存在流浪者随机进入层级的可能，所以M.E.G.认为对Level C-115的探索是危险且无必要的，现层级入口已被M.E.G.武装小队封锁，并设置了阻拦物。由于此任务的低优先性，现只提供最小的额外资源准备。
//
//基地、前哨与社区
//此层级不存在已知的基地、前哨和社区。
//
//入口及出口
//入口
//Level C-28正东方公路1300公里处，有标志牌的公路尽头，越过整修好的公路即可切入Level C-115，同时，此公路也连接着Level C-28的公路网络
//出口
//原路返回即可切回公路，但此行为难以完成，通常只有航空器能够做到，且也面临极端天气威胁
//
//
//关闭M.E.G.高阶权限检视内容
//注意，冒充M.E.G.高阶权限人员将被立即处死，如果你是错误的打开了本页面，请在20秒内关闭页面，否则将导致M.E.G.安保部队派往你的位置
//
//请输入层级密钥
//
//DDAl-azingvmns-joxijgonvw-svioev-lijiuye
//
//身份确认，取消安保部队调动命令，请输入口令
//
//access LEVEL C-115
//
//感谢，你的访问记录将被上传至M.E.G.的中央处理器，欢迎，李玖夜主管
//
// 
//
//生存难度：
//等级 4
//
//极端气候隔离
//战略资源富集
//机密军事重地
//Level C-115是是后室C层群的第115层。
//
//描述：
//tree_star_night_light_sky-45125.jpg!d
//一名M.E.G.探员，注意天空大量聚集的星云气体
//
//Level C-115是一片至少700000平方公里的荒原区域。荒原的边缘被剧烈的风暴隔离，对风速的测距导致了大量无人设备的毁损，据测算风暴速度超过了每小时2000KM，甚至比一些气态行星的大气运动更为剧烈，但奇怪的是，风暴会摧毁一切触碰之物，但对层级内哪怕是距离很近的物体都没有任何影响。
//
//Level C-115内部有着简易的生态系统，一些森林、灌木和小片的草原。有小型的湖泊，一些植食性动物和小型肉食动物，品种类似于前厅，包括普通的兔子，鹿类和狐狸，以及一些相近、未知但无害的品种。层级十分昏暗，没有自然光源，需要照明设备才能保证视觉。天空保持在黑夜状态，但不清楚如此表述是否准确，夜空显露的浩瀚星宇被证明是星云气体的大量汇集。层级内部资源空前富集，基本为火盐和星云，这也让Level C-115成为了M.E.G.目前重要的资源区域。
//
//层级内山脉、丘陵和一些平原地形，到处都生长着火盐晶体，被开采后仍会重新生长，并重新覆盖之前被开采完成的区域，生长速度相对较快，在一个月左右的时间内完成自身的再生，在层级地下，同样有着由于温度较高，熔融成火油的火盐，可较为简易进行开采。Level C-115也拥有众多的通往地下的星云通道，并间歇性喷发星云气体，在其上建造收集设施就能定期采集数量可观的星云，地下在与火油相同深度的地层内同样蕴含着大量星云气体，或是由于压力原因，成为液态的星云，也可以进行相对简易的开采，由于进行了一段时间的开采，资源数量没有任何可见的减少，而且经观察层级显露的性质，目前认为Level C-115火盐和星云是可再生的。
//
//Level C-115曾短期为一队叛乱分子占据，但是他们没有相应开采的技术，只能采取最直接的方法在地表使用简单工具开采火盐和星云，尝试对外销售，得到信息的M.E.G.立即进行追踪，证实发现了新的层级，经过周密策划，M.E.G.突击部队经12小时激战，歼灭并俘虏了261名叛乱分子，并对残余敌对人员进行必要处置，以避免信息泄露的发生。
//
//M.E.G.监督者议会为所有高阶人员的通告
//相信各位已经知晓，这处层级绝不仅仅是什么大气活动剧烈的虚无之地，而是一片流淌着血脉的能源产区。
//
//在此之前，在这个暗无天日的后室里，M.E.G.组建的政府就像一个儿童游戏般的玩笑，一些能力出众的人，带领着一些可怜的误入的人，以原始而真切的愿望，在这片充满错误的房间，勉为其难搜集着零星的资源，在一些房间里建立那可怜的据点，为其他人提供帮助。寻找那几近不可能的出口。虽然值得称道，但也就像大孩子们带着小孩子们做些有益的游戏，难以对抗后室中蕴藏的众多危险。
//
//但现在，状况在逐渐转变，在我们掌握了一些城市层级之后，一些具有工业生产能力的层级之后，一些其他的资源层级之后，我们有了更多有能力的人，更多的设备，还有，我们有了生产它们的能力。
//
//更重要的是，这里，我们掌握了这片能源的稳定产区，这处层级是M.E.G.的力量源泉，有了这里，我们被注入源源不断的新鲜血液和氧气，
//
//现在，M.E.G.有了政府，有了军队，有了领土，有了公民，有了工农业，有了能源，M.E.G.成为了后室中真正的政府，才能更好的保护人类不受后室中危险的侵害，才能实现自己的计划，包括曾经不敢想象的计划。
//
//另外，M.E.G.不希望与任何其他组织，包括任何个人分享Level C-115，已禁止任何人员接近、进入Level C-115，阻止任何组织，包括友善或敌对组织，测探层级信息，如有，一律以表层信息告知，如果任何M.E.G.以外的组织成员或流浪者进入Level C-115，掩盖一切信息，立即授权处决，无论敌友。
//
//我们清楚自己的所为，这一切并非所愿。
//
//由于信息的机密性，目前层级信息只能由各位高阶主管知晓。M.E.G.由监督者议会，各阶层主管，基层辛勤工作的员工，英勇战斗的士兵而存在。
//
//为后室中人类的未来
//基地、前哨与社区
//M.E.G.（探险者总署）战略资源区
//层级核心区域建造一座大型军事要塞，内部以大型设备开采火盐和星云，及其熔融或冷凝的火油和液态星云
//环绕核心周边大量存在中型能源采集区域和小型采集设施
//2000名M.E.G.员工，包括900名武装士兵
//开采的能源定期运往各个M.E.G.基地和前哨
//建立了完备的防御体系，和人员生活设施，抵御可能的敌对势力
//入口及出口
//唯一的出入口连接着Level C-28-Level 11的公路网络，在Level C-28正东方公路1300公里处，被不明交通标志牌标识的公路尽头，越入或越出即可随意的切入切出，M.E.G.在出入口设置了自动闸门，让M.E.G.资源运输车辆通行和阻挡其他无关人员进入。
//
//
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1115{}