//Level C-111
//
//  83.3%16.6%
//评分: +24
//+
//–
//X
// 
//
//生存难度：
//等级 5
//
//不安全
//不稳定
//少量实体
//Level C-111后室C层群的第111层，于1987年被M.E.G.发现，此后进行了一系列探索任务，当前已被停止探索。
//
//%E8%8D%92%E8%8A%9C%E4%B9%8B%E5%9C%B0
//图上为601所建造的木屋
//
//描述
//Level C-111是一片面积未知的层级，该层级拥有绝大多数地形1，除一种侵略性植物2外未发现其他生物。
//
//当流浪者进入该层级时，将逐渐感染某种致死率极高的病症，以下称之为“荒症3”，该病症未发现治疗方法，以下为荒症的不同感染阶段。
//第一阶段
//感染者在感染该病症1~2周内会持续出现发烧，痛泻，头晕等。
//第二阶段
//感染者在经历一阶段后1~2天不等，出现皮肤出血，皮肤黏膜三红4，眼结膜充血，口腔黏膜、胸背、小腹出现大小不等的出血点，皆呈条索状。并在2~3天后进入第三阶段。
//第三阶段
//当感染者步入第三阶段时，体内细胞将在1~2天内转化为茂生藤细胞5，且DNA也将在1天内成为四螺旋结构。感染者在此阶段死亡。
//
//此外，由于该层级生存资源紧缺，已放弃该层级的设备与人员详情请查阅探索任务记录08/10/07
//
//-已展开 
//探索时间：8天
//接收：喂？这里有人病了，应急手册上没有关于该病症记录，我们应该怎么办？
//发送：请汇报临床反应，发病时间并送回病人的血液。
//
//探索时间：12天
//接收：你们收到报告和样本了吗，东西给你们发回去了，他状况不太好，他还有救吗？
//发送记录：无
//
//探索时间：21天
//接收：最开始那个人已经死了，现在又有人出现了症状，这到底是什么？你们为什么不告诉我们治疗方法？
//发送：请耐心等待，目前未发现该病症治疗方法，请你们将感染人员进行就地隔离。
//
//探索时间：31天
//接收：我已经按照你们的方法用我的血做成血清给他们注射了，但似乎没有什么用……我接下来该做什么？
//发送记录：无
//
//探索时间：48天
//接收：他们都死了，现在这里就剩我一个了，请你们派些人好吗，我一个人没法完成这么多工作的……
//发送：请送回感染者尸体样本与你的血液样本，增援我会向上级汇报的，暂时请你根据任务辅助手册进行探索。
//接收：谢谢你了。
//
//探索时间：56天
//发送：我送的植物样本你们收到了吗？这些植物好像是这里的全部生物了，我有这些植物命名权吗，叫601树怎么样？不行，这太不像个名字了，叫旅者树怎么样？对了你们要派人来了吗，你帮我催一下可以吗？我真的很孤独……
//发送：你没有对它的命名权，还有我无权催促上级的审批
//
//探索时间：81天
//接收：请你们再派些人好吗，这里什么都没有除了这些植物，什么都没有，我好怕，我好孤独。
//发送：根据你送回的植物样本所做实验，那些植物可能有毒。
//接收：什么？！有毒？那我都摸过了啊！还吃了几片叶子……
//发送：实验显示，该植物所分泌毒素仅对植物有效，正是因为该植物的存在，此层级才会出现如此极端的生物单调性。
//接收：那就好。
//
//探索时间：98天
//接收：求你们了，派点人好吗，哪怕一个人，这里有设备损坏了，我修不好，请你们派些人好吗？
//发送：由于荒症的治疗方式未发现，暂时不会派遣其他人员支援，请你自己修好设备。
//接收：你的意思是……只要有一天未发现治疗方法，你们就不会派人来？这些设备也很贵啊！
//发送：是的，虽然设备很贵但运送人员更贵。
//接收：操！你他妈的，你知道我在这里怎么过的吗？这里什么生物都没有，我每天吃复水食品6他妈吃到吐你明白吗？你他妈居然还不派人来，你他妈个混……
//强制挂断连接
//
//探索时间：348天
//接收：嘿！喂？你在吗？
//发送：你听起来心情不错。
//接收：那当然，我修好了一些设备，但是传送装置我还是启动不了，你们现在能派人来了吗？
//发送：还是不能。
//接收：可恶……算了，不能坏了今天的好心情！
//发送：你为什么这么开心？
//接收：我建出了一个屋子！用那些植物！
//发送：就这些？
//接收：嗯！这难道还不值得我开心吗？
//发送：你不觉得孤独了吗？
//接收：有时候才会觉得，可能我能把自己骗的不孤独吧……况且，我难道不是随时都可以和你对话吗？
//发送：……
//接收：你是真人吗？还是AI？
//发送：真人，AI的处理方式并不适用于探索任务。
//接受：哦。
//
//探索时间：436天
//接收：嘿，我发现了活着的生物啊！
//发送：请回报生物状况并发送生物样本。
//接收：啊？但是我已经吃了啊……
//发送：什么？！你……
//接收：哈哈哈哈哈哈，原来你也会生气啊，我还以为你只会发出冷冰冰的语气，说一些没有人道的话呢。
//发送：重复，请回报生物状况并发送生物样本。
//接收：逃避的样子很可爱哦~好了，我已经发送过去了，请查收哦~小姐~哦，对了，我发现你……
//强制挂断连接
//
//探索时间：567天
//接收：操，他妈的，这他妈，是什么？！
//发送：请发送你所发现的事物进行汇报。
//接收：操你妈的，还他妈汇报呢？我现在都他妈解释不清楚现在的情况！你们他妈派些人好吗？求……
//强制挂断连接
//
//探索时间：781天
//接收：嘿，我现在向你汇报，我感觉我现在状态不太妙。
//发送：请描述你现在的状态并送回血液样本。
//接收：还他妈要样本呢？！操！
//发送：请你不要情绪过激，如果你再这样，我会再次挂断连接。
//接收：好……好，你厉害！
//发送：重复，请描述你现在的状态并送回血液样本。
//接收：样本我已经送过去了，但我现在还有一些头晕，可能是昨晚没休息好，我发现了一些东西……
//发送：请汇报你的探索发现。
//接收：我……我发现……我发现那些树好像可以吃。
//发送：收到，我会根据你的发现进行实验。
//接收：好好好，你们快点！快点实验！活体最好！
//
//探索时间：895天
//发送：你到底发现了什么？我们做的实验全部失败了，我们的实验员无一例外全部死亡，因为你汇报的错误，上级决定不再派人增援，你知道因为你……
//接收：安啦安啦，不派人啊，真可惜，但有一点你说的不对，这里的树我确实吃了，从上次发现到现在一直在吃，而且我还发明了好几道菜式呢！
//发送：你能吃并不代表所有人……
//接收：都能吃~对吗？所以这就得靠你们自己研究了啊。我能怎么办呢，这是我的错吗？你们应该怪你们自己，不……
//强制挂断连接
//
//探索时间921天
//发送：请将生物细胞送回并汇报最近生物状态
//接收：什么？什么生物？
//发送：你曾经发现的活物。
//接收：那个啊，早就没了，从我有一次向你们请求支援的时候就没了
//发送：你知道那是多重要的生物样本吗？
//接收：知道啊，但是它确实死掉了。
//发送：汇报你所看见的它的死亡状态。
//接收：和那些人一样，不过……
//发送：不过什么？
//接收：不，没什么。
//发送：601请明白你的立场，你所签署的条例中地281条，你必须无条件汇报你所发现的事物特征与状态。
//接收：操？！老子就他妈不汇报怎么了？你也就只能挂断连接了，还有什么？而且，我一样能挂断连接不是吗？去你妈的！
//发送：你……
//强制挂断连接
//
//探索时间：987天
//接收：我感觉我好像适应了这里的生活，荒芜，却富有生机，两种矛盾的形态，在这里和平地相处着，融合着，看着那些茂生的植物，我感觉我内心的活力也渐渐地生长起来。
//发送：你……不再……想要人陪你了？
//接收：哈哈哈哈！被我骗到了吧？适应？适应个鬼啊！你们什么时候派人来啊？
//发送：上级说要放弃这里的资源。
//接收：什么？放弃这里？我可以回去了？哈哈哈哈！我可以回去了！
//发送：你没有听明白吗？放弃这里的“资源”，其中包括你。
//接收：……什……什么？你在说什么啊？我……你们要放弃我？我有探索经验啊！我也是人才啊！这里还有这么多价值高昂的设备，你们不能放弃这里！你们派人来啊！
//发送：根据上级决议，这里并不适合生存，而且设备的价值没有运人高，所以，我们选择放弃这里。
//接收：不……不……不！你们不能放弃我！你有朋友吗，我在外面也有啊，你能理解我的处境吗？让我回去好吗？求你了，求求你了……
//发送：这些是上层的决议我无权做出篡改。你可以在接下来1分钟内留下你的留言。
//接收：操你妈的！你们不能这样！我也是人！你们这样没有人权！接我回去！
//发送：还有50秒。
//接收：接我回去吧……求求你们了……（啜泣声）我在这鬼地方真的受够了……求求你们了……
//发送：还有30秒。
//
//啜泣声
//
//发送：你已经浪费了20秒。
//
//沉默
//
//10
//9
//8
//7
//6
//5
//4
//
//
//
//
//你们会后悔的！我将永远存在！
//
//基地、前哨和社区
//流浪者601所建造的木屋及M.E.G.的资源站点
//其内部有部分可利用资源，如医疗卫生、饮食生活、研究采样等，可以居住。
//
//入口与出口
//入口
//当前进入Level C-111的方法仅能利用定点转移设备进入，当前M.E.G.的该设备已经损毁，请自行设立坐标点。
//
//出口
//离开Level C-111的方法除通过定点转移设备外，未发现其它方式。
//
//作者信息
//« Level C-110 | Level C-111 | Level C-112 »
//
//脚注
//1. 包括海洋、山地、盆地。
//2. 以下称之为茂生藤
//3. 特别注明：当前仅有探索者601免疫该病症
//4. 即脸、颈和上胸部发红。
//5. 转化机制未知
//6. 复水食品（rehydratable food）是2005年公布的航天科学技术名词。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1111{}