//Level C-178
//评分: 
//+10
//+
//–
//X
// 
//
//生存难度：
// 
// 
// 
//Level C-178是后室C层群的第178层，为一处被放大数倍的前厅山脉。
//
//描述
//XKzCRO.md.jpg
//Level C-178的一角，于该层级的山上拍摄。
//
//Level C-178的气温常年保持在28-30摄氏度，没有昼夜交替，永远保持约下午两点的日照状态，有时会有降雨。该层级存在异常效应，任何实体和流浪者从该层级的任何区域坠落都不会受伤，这使得流浪者在该层级非常安全。
//Level C-178拥有大量在前厅中常见的树木(如橡木，枫树，松树等)以及其他可以在前厅和后室发现的植物，1同时，该层级的所有植物都异常巨大，仅杂草平均高度就达2-2.5米高。因此，流浪者在穿越该层级的树林时一定要警惕，避免被落叶或果实砸中导致伤亡。
//Level C-178的面积极大，仅被完全探索的区域已有57平方公里，同时该层级有大量自然资源可供开发。（如该层级树木自然掉落的树枝可作为木材来源，自然掉落的果实可提取糖分等。）巨大的面积与其安全性也使得Level C-178有作为大型聚居地的潜力。由于暂不知如何稳定进入该层级，M.E.G.正在积极寻找稳定的进入Level C-178的入口。
//
//实体
//除无足鸟2外，该层级没有任何常见实体，该层级的特殊实体被命名为“哈克”，从外观上看是一只巨大的美国白头鹰，高约12米，身长约800米，它可以用英语与人类交流，且对流浪者非常友善，流浪者可以委托它将自己运送到该层级的其他区域或离开该层级。此外，它似乎会以特殊方式切入其他拥有开发性区域的层级的高空，据它表示，这只是为了“旅行”。
//“哈克”的“巢”在该层级的最高峰上，如果它允许的话，流浪者可以在这里居住。“哈克”也会把自己猎取的无足鸟和其他猎物3
//放在这里。它似乎并不忌讳有人享用它的猎物。
//
//发现记录
//20XX050X日，Omega基地人员失踪事件录音(已归档)
//
//下士O314:报告，O314发现异常情况，请求处理。
//
//Omega基地:收到，有何情况。
//
//下士O314:今日，我与O254一同执勤时，发现了特殊的疑似窗户实体。
//
//Omega基地:请具体一些。
//
//下士O254:我来描述一下，这东西就好像普通窗户，但是没有低语声，窗后有一片蓝天，可以把手伸进去。
//
//Omega基地:请不要轻举妄动，等待基地的支援。
//
//下士O254:不行啊，这玩意好像要消失了，它在变透明。
//
//下士O314:别动啊，马克，出事怎么办。
//
//下士O254:这样，你拿着这根绳子，我进去的时候拎着它，它等不及基地的援兵了。
//
//(O254进入特殊窗户个体)
//
//下士O254:我操啊啊啊啊啊啊啊啊啊啊啊啊啊
//
//下士O314:我操好重，啊啊啊断了。
//
//Omega基地:O254请回答！
//
//(一声巨大的响声)
//
//下士O314:我操他妈的，马克你个傻逼。
//
//该窗户实体在支援赶到前3分钟时消失。截至目前，O254仍然处于失联状态，M.E.G.已经发出悬赏，四处征集与其类似的窗户个体。
//
//
//20XX年5月XX号，Oemga基地人员失踪事件后续报告
//
//在失踪人员马克失联后两天，其被发现于Level 11，由于马克声称自己发现了新的层级，Beta基地的人员对其进行了询问，以下为询问记录:
//
//(记录开始)
//
//询问人员:你好，下士O254，马克·史密斯。
//
//马克:嗯，你好。
//
//询问人员:马克，你声称自己发现了一个新的层级，是否属实?
//
//马克:嗯，是真的。
//
//询问人员:若你说的不属实，你会受到严重的处罚，甚至是处决，你很清楚吧。
//
//马克:我都知道，咱快点行不行。
//
//询问人员:嗯好的(翻页声)，请你具体
//描述你切入该层级后的经历。
//
//马克:好，是这样的，我在掉进那个破窗后就一脚踏空，然后就在空中自由落体，至少掉了五百米左右。然后掉在了。。。额，就是一个实体的背上，我没受伤，但是对讲机摔成渣了。
//
//询问人员:(记录)请问那是什么实体。
//
//马克:一开始我也不清楚，然后它把我带到了地面上，然后我才看清，那他妈是只大的离谱的鹰。
//
//马克:后来它还和我聊天，用英语聊天，它的英语很不流利，但是它还是尽力问了我的名字，它还告诉我它叫哈克。
//
//询问人员:你在那里待了多久，确认过时间吗。
//
//马克:没有，我的表摔坏了，并且那里一直是白天。所以我消失了多久啊？
//
//询问人员:两天。
//
//马克:哦哦哦
//
//询问人员:那你最后怎么离开的呢。
//
//马克:跟那个实体说了句“我挺想回家的”然后它就把我带回了这里，哦对了，这两天全靠它给我带来的巨大的鸟的肉，我才能活。
//
//询问人员:无足鸟?
//
//马克:是，并且特大，但是和那只鹰相比还是小了，并且竟然还能吃。
//
//询问人员:没有遇到其他实体吗？
//
//马克:是
//
//询问人员:行，我们了解情况了，之后我们会把你送回Omega基地，感谢你的配合。
//
//(记录结束)
//
//在证实了马克的描述属实后，马克回到原基地并获得晋升，M.E.G.将该层级命名为Level C-178，开始了对其的探索。
//
//
//Level C-178先遣队报告
//
//
//在该层级被确认存在后，M.E.G.“罗经点”兵团派遣先遣队进行初期调查，他们通过后室地铁成功切入该层级，尽管这导致了他们的失联，但4日后，先遣队发送了报告，证实了Level C-178完全宜居。以下是报告内容:
//
//致总部:
//非常抱歉，由于我们的疏忽，导致我们所有队员的对讲机损坏，原因是后室地铁停靠在了空中，使得我们不得不从空中跃下，几乎是一瞬间，我们就落到了那个被报告的特殊实体身上，事情很突然，所有队员的对讲机都因为过大的冲击力而损坏，幸好小保险柜里带了笔记本电脑，这个层级也恰好有不稳定的Wi-Fi存在，所以我可以上传这份报告，若总部看到它，请务必派遣增援与补给，因为这台电脑快要没电了。
//此外，我和我的小队成员还想向总部请求一件事：我们希望常驻在这里，因为我们热爱它。
//当我还在前厅时，我就爱好着探险与挑战，来到这里后，尽管我可以安逸的生活，但我不满于此，正因如此我才加入了组织，并在我的努力下成为了小队队长,有了可以推心置腹的战友们。
//在来到这个这个层级后，我们驻扎在了那只鹰的巢穴附近，我们建立住所，生起营火，这时，我们都感受到了创造与开拓的快乐，这里充满着资源与未知，所以我们所有人都想留下，将这里开拓出新的天地。
//如果支援前来，请告诉那只鹰前去篝火所在的地方，我们希望这个层级充满活力与希望，它也是那么想的。
//总之，希望总部能批准我的小小的请求，派遣更多人来到这里，和我们一起开拓这里的资源。我们也会尽快上传层级文档。方便更多人来到此地。
//——先遣队队长，龙青泉 ，20XX年X月X日
//
//
//基地、前哨与社区
//M.E.G.“山地农场”基地
//位于“哈克”的巢附近
//常驻人员有100人以上
//负责处理该层级的资源4，并会将它们运送到其他基地
//B.N.T.G. C178号资源提取站
//位于该层级最高峰的一处山洞，山洞口有特殊标识，以便于“哈克”带着流浪者来到这里。
//有三支巡逻队驻扎在此，维持秩序。
//300名以上的流浪者在此居住，并通过向B.N.T.G.提供资源以获得报酬。
//开放贸易。
//U.E.C. “死亡山谷”前哨站
//位于一处山谷，内部有大量无足鸟的残骸。
//试图驱逐该层级内的所有实体。
//已被“哈克”摧毁。5
//C-178的居民
//约500名常驻人口
//主要居住于M.E.G.和B.N.T.G.设置的基地中。
//大多从事收集并处理Level C-178内部自然资源的工作。
//入口与出口
//入口
//在任何层级的室内环境进入一扇背面有明亮天空的木窗或木门6，若你在进入后感受到明显的下坠感，说明你已经切入了该层级。
//M.E.G.已与“哈克”达成约定，每隔一段时间，哈克就会来到Level 11的一座高楼上，M.E.G.内部人员可以此前往Level C-178（该入口为机密，具体位置不予公开）7
//出口
//直接向“哈克”说明即可，它可能会将你带至一些具有开放性区域的层级，如Level 118
//感谢你看完我的烂作
//« Level C-177 | Level C-178 | Level C-179 »
//
//脚注
//1. 由于它们过于巨大，所以可能对人类造成伤害的植物都没有太大危害。
//2. 该层级内的无足鸟同样拥有异常体型，其平均高约5-6米，平均身长为80-90米，以层级内的巨大果实为食，可以食用。
//3. “哈克”有时会前往其他层级捕猎，对象往往是大型实体，如歌鲸等。
//4. 如无足鸟的肉，木材，果实中的糖分等。
//5. 其实这个山谷是“哈克”处理无足鸟尸骸的地方，“哈克”可能在丢弃它们的过程中误伤了该营地。
//6. 请务必慎之又慎的辨别此类出口，尽管其与一般的窗户实体有别，但仍有可能使人员跳出部分层级的高楼的正常窗户导致伤亡。
//7. 作为回报，M.E.G.在其上放置了一个巨大的杏仁水水池
//8. 也有人员被带到Level C-33，Level 7这类有海洋的层级的报告
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1178{}