//Level C-124
//评分: 
//+20
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
//温暧并安全
//舒适并稳定
//存在友善实体
//Level C-124是后室C层群的第124层。该层表现为一处餐厅，类似前厅中的西餐厅。该层级并不大，经测算该层级面积为[数据删除]㎡
//B.Q.I.已为该层级颁发许可证（编号B.Q.I.licence C-002），流浪者可放心在此层级交易。
//
//描述
//AQmNIX2RiDHW4Bt.jpg
//餐厅的一张照片。
//
//该层级的主要区域:就餐区摆放着数目不明的桌椅，每张桌椅上的天花板都会有几盏能量来源不明的白炽灯。该层级中的墙壁为混凝土所构成，而地板与天花板则皆为木板所构。坐上该层级的座椅的感觉被形容是“温暖且舒适”的。此层级的角落有一些冰柜，里面摆放着一些前厅常见的饮料，如可口可乐等。该层级中的厨房不可进入，因该层级中的实体“Maura”不允许流浪者进入。
//
//该层级窗口外的景象是一条街道，在餐厅的对面有着几座商店。有时可以看到一些由无面灵驾驶的汽车在街上行驶，有时可以看到一些无面灵在街上行走，然而这些无面灵从来没有试图走进餐厅。
//
//餐厅的外面时常会下雨，同时，该层级没有固定的日夜循环，在大多数流浪者的回忆中，层级的时间都会在下午时分。
//
//该层级中始终播放着一段轻柔的音乐1，据流浪者报告称，其能使之平静，而其播放来源至今未晓。
//
//进入该层级的流浪者总会在一张餐桌前醒来，且他们将被一股神秘的力量定在餐桌前无法动弹。大约两分钟后，该层级的唯一一位实体“Maura”会走到你的身旁，并给予流浪者一份菜单2，而此时流浪者也可以开始走动。流浪者点好菜后，“Maura”会来到厨房开始烹饪，无论菜品多么复杂，她总能在30分钟内制作完菜品。菜品制作完成后，她便会将菜品端出来供流浪者食用。
//
//该层的Wi-Fi名为“MAURAWIFI”，密码为“CODE”。此Wi-Fi信号极佳，可与其他层级的流浪者进行交流。
//
//实体
//该层级的唯一实体便是上文所提到的“Maura”。“Maura”从外观上看是一名皮肤白暂，拥有银色长发和金色眼睛的人类女性。她通常身着一件精致午茶袍，不过也被见到身穿其他的各种服饰，例如晚会礼服以及女佣服3，在流浪者吃完菜品后，“Maura”会尝试与流浪者聊天，其话题不固定。
//
//基地、前哨与社区
//此层级没有任何已知的基地、前哨与社区，因“Maura”不允许流浪者在此处滞留过久。
//
//入口与出口
//入口
//在Level C-83切出有可能来到此处，然而两者之间并没有任何联系。
//食用Level C-84中的宠物粮会让你到达此处。
//在流浪者进行长途跋涉并感到饥饿时，他们便会在下一次昏迷/睡眠时在此处苏醒。
//出口
//走出大门可以来到Level 11
//礼貌地请求“Maura”把你传送到一个安全的层级，她会将你传送至C层群中随机一个生存难度为0的层级。
//粗鲁地让“Maura”把你传送到其他层级，“Maura”会将你传送至一个随机的层级。
//B.Q.I. Inspection certificate展示区
//
//BmUdsXUz.svg
//经B.Q.I.检验，该层级各项指标均符合要求，为其颁发检验合格证书，
//
//B.Q.I. Inspection certificate编号：B.Q.I. Inspection certificate C-002
//
//检验项目：Level C-124	颁发日期：2021年9月27日
//颁发人员：TarTaR0S	截止日期：2022年9月27日
//« Level C-123 | Level C-124 | Level C-125 »
//
//
//作者信息
//Footnotes
//1. 不来自前厅
//2. 菜品的种类极多，故不列出
//3. 我的一个朋友也喜欢这样穿，不是吗
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1124{}