//Level C-184
//评分: 
//+7
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
//安全
//稳定
//极少量实体
//Level C-184是后室C层群的第184层
//
//描述
//Level C-184似乎是一片终年被积雪覆盖的森林，该层级具有稳定的昼夜更替和晴朗，阴，中至大雪等天气变化，且温度稳定在-10℃~-30℃之间。但由于该层级所具有的特殊效应，M.E.G.不建议身着常规保暖衣物探索该层级。
//
//4209167311-2094857e55-b.jpg
//一张在Level C-184中的清晨拍摄的照片。
//
//该层级没有任何已知的实体，个别流浪者有关于笑魇和无面灵的报告，目前尚未被证实。
//层级中的雪经检测显示为99.7%的水和0.3%的杂质，因此该层级被推断可能为一个安全、稳定的纯净水来源。
//
//该层级中似乎具有一些与常规认知相悖的效应，主要体现在以下几点：
//
//杏仁水和腰果水在0°C时会汽化，而在100℃时会凝固。
//任何物理和化学吸热与放热效应的效果会反转1
//人体神经对温度的感受不会产生变化，但低温对健康状态的影响似乎和衣物有关：
//穿着正常的防寒装备不能抵御寒冷，而且会加剧冻伤等因寒冷造成的健康问题，减少衣物似乎能削弱这一效果，在减少一定程度后甚至会转变为正效果2。
//
//一些流浪者认为完全除去衣物能够实现对低温的免疫——即使不会改变神经对温度的感知3。出于多方面因素考虑，M.E.G.不建议这么做4。
//
//此效应似乎对动物和实体也有效，但对植物无效。
//
//基地、前哨与社区
//B.N.T.G.冷藏品仓库
//由于该层级的特殊效应，B.N.T.G.在此处建立了数个占地约2000m2的仓库，以便通过最低成本保存大件冷藏品，不允许除B.N.T.G.成员以外的人员进入。
//氯铵商人
//由3名流浪者组成的小型团体，热衷于与其他流浪者交易，通常会使用杏仁水和氯化铵5等物资作为主要交易物品。
//入口与出口
//入口
//如果在Level 129等雪地层级中感受到了Level C-184的效应时，你就来到了Level C-184.
//在Level 11搭乘出租车时对司机说“我想去一个可以玩雪的地方”。
//一些流浪者声称自己从Level 790来到了Level C-184，但这一说法尚未被证实。
//出口
//切入Level C-184的雪地时，会进入一个随机的雪地层级。
//在Level C-184的木屋中切入墙壁会进入Level 11
//如果发现区域内的积雪逐渐消失可能代表你进入了深红森林，但这一说法尚未被证实。
//作者信息
//« Level C-183 | Level C-184 | Level C-185 »
//
//Footnotes
//1. 例如燃烧木材会不断吸热
//2. 即上述健康问题会被削弱
//3. 例如肌肉在寒冷时仍会产生痉挛
//4. 毕竟有一些…不太文明？
//——特工■■■
//5. 一种以其在溶解时吸热而著称的物质
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1184{}