//Level C-132
//评分: 
//+14
//+
//–
//X
// 
//
//生存难度：
//生存几率渺茫
//有害气体弥漫
//密集实体活动
//Level C-132是后室C层群的第132层，这里极度危险。
//
//描述：
//Level C-132是一个空间无限向外重复的空间，具体表现为一个露天种植园。种植园道路为宽两米的水泥石子路，道路两侧为边长二十米的种植区，边缘包围着高半米的白色篱笆。这些种植区有道路分隔并组成网状结构向外辐射。该层级内的温度始终保持在35℃不变，虽然极不建议流浪者进入探索，但如果尝试进入此层级，建议准备好消暑手段。
//
//该层级内的天空始终被一层厚厚的烟尘遮住了天空，导致浓见度极低以及光线严重不足，这也导致在此层级内遭遇笑魇是很正常的。除此之外该层级内还会遭遇：死亡飞蛾、肢团、钝人、猎犬、悲尸、迷彩爬行者以及不知因何而无故愤怒的车兽。并且因为这些实体过于密集导致它们经常互相厮杀而另这里堆尸如山，流浪者在这里相当容易因此感染各种疾病与外伤感染。
//
//种植区内每间隔三米种植一颗在前厅没有被确认过的树，这些树没有树叶，树枝类似藤蔓并生长着倒刺。这些树木每隔一小时将向四周扩散一种红色雾状气体，这些气体与人体肌肤接触将导致皮肤溃烂，吸入也将导致器官衰竭。尝试翻越白色篱笆时，篱笆尖锐部分将突然向上延伸并刺伤或划破流浪者，所以就算有相应防护设备也极不建议进入此层级。
//
//目前已知该层级内不会刷新任何补给品，所有层级入口都将被M.E.G.人员封锁并禁止进入。
//
//实体
//已知大部分敌意实体都将在次层级以平均两米一个的距离生成。
//
//基地、前哨与社区
//该层级不存在已知的基地、前哨和社区。
//
//入口与出口
//入口
//任何时候，你都不该知道如何进入此层级。
//出口
//目前没有已知出口。
//作者信息
//« Level C-131 | Level C-132 | Level C-133 »
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//希望……
// 
//
//生存难度：
//重要物种延续
//不应公开内容
//应受保护植株
//Level C-132是后室C层群的第132层，这里的资源十分宝贵。
//
//描述：
//Level C-132是一个空间无限向外重复的空间，具体表现为一个露天种植园。种植园道路为宽两米的水泥石子路，道路两侧为边长二十米的种植区，边缘包围着高半米的白色篱笆。这些种植区有道路分隔并组成网状结构向外辐射。该层级内的温度始终保持在20℃不变，但这个温度似乎并不会影响种植区内的植物生长。
//
//该层级内的天空云层稀薄，始终有阳光照射地面，但这些阳光对人体而言并不会产生危害。目前除了在种植区的泥土内发现生活在泥土内的昆虫外，没有发现其他实体的存在。
//
//种植区内每间隔三米种植一株植物，这些植物普遍为可以结出果实的植株。每一个种植区内种植的植株都不相同并且都有告示板介绍。该层级内的植株似乎可以无限制的经历开花结果的过程，每个种植区也有只活动在种植区内的蜜蜂负责授粉1，这些蜜蜂似乎怎么被流浪者骚扰都不会攻击对方，并且每死亡一只都会补充新的蜜蜂。但是否会受到外部细菌真菌等诱因生病，目前还不明确。
//
//该层级最令人注意的一点就是，这里的植株种类数量多的惊人，甚至包括没有黄叶病的大米七香蕉2，以及一些植株已经灭绝的古老种株，甚至包括被认为已经完全灭绝的[为保护不再灭绝以作保护处理]与[为保护不再灭绝以作保护处理]的后室品种植株。
//
//似乎前厅每培育出一个新的品种，层级内外围的空种植区就会长出对应的植株。这里的植物生长速度很快，大部分植株的果实在被摘取后都将在三到五天内经历开花结果并成熟，成熟的果实也将持续挂在植株上不会腐烂。
//
//我像看到这篇数据库内容的人都应该明白这个层级为何要被保护起来，这是我们作为人类应该做的事情。一些遗憾我希望不要再次发生了，这是我们仅有的最后一次机会了，请保护这些脆弱的植物吧，不要让他们再次步入前厅的悲剧当中……
//
//——监督者-A
//
//基地、前哨与社区
//M.E.G.科研研究基地
//M.E.G.在此处一片没有种植植株的种植区内建立的研究基地，用于记录这里的变化与研究一些前厅无法接触到的一些古代果实，常驻5人。
//
//入口与出口
//入口
//此信息被封锁。
//出口
//寻找一个在层级中央的一个白色木质邮箱，随意放入一个物品即可被传送到一个安全的层级。
//Footnotes
//1. 在每个种植区的东北方向角落离着一个蜂箱，蜜蜂会在此产蜜。
//2. 又称大麦克香蕉，因一种黄叶病导致在前厅濒临灭绝。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1132{}