//Level C-139
//评分: 
//+12
//+
//–
//X
//faultsd.PNG
//Level C-銝蓡銝匧銋是后室C层群的第銝蓡銝匧銋层。你能否接受另一个你？
//
//描述
//Level C-銝蓡銝匧銋是一个𨅯鞱蕙摰，该层级中面积十分摰賡，尽管很多的瘚瘚芾在该层级不断探索和行进中，而给出的䔝蝝Ｙ𤘪显示该层级的𨅯所组成的墙壁不断切换，且切换规律十分憸𤑳。
//
//储存Level C-銝蓡銝匧銋的所有记录文件霈啣閙辣都以銋梁形式呈现，并且该文档很可能遭到部分蝭⊥㺿，因此蝧餉工作十分𤌴𠗕。
//
//实体
//另一个自己
//该层级会频繁生成峕誩硺，这些你自己绝对笆，而且数量会跟据䔝蝝Ｙ𤘪的人数而增加，你自己毫不犹豫杀死你䔝蝝Ｙ𤘪在该层级唯一途径是尽快找到出口。
//
//基地、前哨与社区
//该层级没有已知的绀惧尯、抅𧑐和鍓嶅摠。这里是你的最终归属之地。
//
//入口
//入口
//在任何层级中找到𨅯，并直接穿破这个鐗╀綋就可到达该层级中。
//其他入口仍然在䔝蝝Ｙ＆霈当中。
//出口
//目前还没有已知的鍑哄彛方法。请不要再继续尝试，这里才是你的生命终点，你死后的灵魂将在此处安息。
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//欢迎使用探索者总署层级-文档存储系统数据库，流浪者！
//
//请输入关键词：
//
//>Level C-139
//
//请稍后…
//
//正在搜索Level C-139…
//
//检测到你之前已访问错误文档，这将会导致你在了解该层级后，并错误地判断该层级的真正意义。
//
//是否为你打开该文档的翻译最终版本？
//
//>Y
//
//正在为你打开Level C-139的翻译最终版本，请稍候…
//
//
// 
//
//生存难度：
//等级 5
//
// 
// 
//未知实体数量labyrinth-5696508_960_720.jpg
//一名探索者总署的人员拍摄到的唯一图片。
//
//Level C-139是后室C层群的第139层。
//
//描述
//Level C-139是由多个镜子排列组成的迷宫建筑，其面积范围十分广大，并且有些角落时常有积水出现。尽管有很多的流浪者在该层级不断探索和行进中，但给出的探索结果显示该层级的空间限制不断发生改变，且规律十分频繁。
//
//目前在Level C-139中还未发现任何迷宫的出口。在一些罕见的情况下，Level C-139会随机出现其他其它层级的投影，尽管流浪者想要进入投影出的其他层级，但也会被无形的钢化玻璃所隔离，据其他层级逗留的人员观察报告显示，他们经常在其他层级的某个墙壁上能看到巨大的镜子，并且能听到镜子里面所传出来的求救声，但镜子出现的时间是短暂的，据其他层级的流浪者声称，他们看到巨大的镜子所出现的时间频率最多不超过1个小时。
//
//储存Level C-139的记录文件中所有信息都以乱码形式呈现，并且该文档很可能会遭到其部分内容的篡改，因此翻译工作十分困难，目前还未得知存储任何Level C-139的记录文件以乱码形式呈现的原因。
//
//由于进入该层级后，所有人员的精神状态将受到很大程度的折磨，考虑到人员损失的风险，目前任何探索行动现已禁止，后续情况等待通知。
//
//实体
//由于Level C-139当前的特殊环境，还未在该层级中发现其它层级的实体，“镜鬼”是该层级唯一生成的实体，其特征是该实体会模仿流浪者的模样，“镜鬼”对人类展现极强的敌意，并试图将流浪者拽进镜子内部，若该行动失败，那么会将流浪者强行推到Level C-139的镜子上，并通过切出方式传送至其他较为宽阔层级的高空中。“镜鬼”的数量会根据探索人员的人数而改变，但也有特殊情况发生，例如数量会超过探索人员的人数、在极少数情况下，“点灯人”会在该层级中生成，并带领探索人员离开该层级，而“镜鬼”似乎很害怕“点灯人”的存在，因此，在“点灯人”出现后该实体就消失不见了。
//
//基地，前哨与社区
//到目前为止，发现唯一可以随意进出Level C-139的入口是位于Level 5内部的酒店主厅一个房间门口，该门口的墙面被贴上了一层镜子。
//
//目前Level C-139的内部还未发现其他已知的基地、前哨与社区。
//
//M.E.G.哨所“家政服务”（M.E.G. Outpost "HouseKeeping"）:
//该组织会在通往Level C-139的入口处派遣人员进行安保服务。
//为防止处于Level 5的流浪者因好奇而进入Level C-139内部，必要时可使用轻火力进行警告并驱逐。
//入口与出口
//入口
//在无知之慕中探索一时间后，将有几率达到该层级。
//在Level 5内部的酒店主厅内有一个被贴上一层镜子的房间门口中进入，就可以进入该层级。
//出口
//一定时间后流浪者将被自动传送至随机层级，但触发该方法的几率极为稀少。
//被“镜鬼”推向Level C-139的镜子表面上，通过切出方式传送至其他较为宽阔层级的高空中，例如Level C-8。
//其他出口正在探索确认中。
//
//
//
//
//
//
//
//
//逃吧，尽情逃吧，你永远都找不到出口。
//
//还不如和我们在一起。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1139{}