//Level C-195
//评分: 
//+22
//+
//–
//X
// 
//
//生存难度：
//等级 4
//
// 
//稳定
//实体横行L7Op2rRosGMgNwn.jpg
//Level C-195夜晚时的一张照片。
//
//7zNeMJIqVrXoTBG.jpg
//与上一张照片拍摄地点相同的，Level C-195白昼时的一张照片。两张照片均由该层的M.E.G.特工所摄。
//
//Level C-195是后室C层群的第195层。
//
//描述
//　　
//Level C-195似乎是前厅的中国南方某城市的复刻版，流浪者评价其复刻精度可以用“一模一样”形容；该层级内部的资源、自然环境和布局也与前厅相同，且拥有8小时为一周期的昼夜循环。但该层级内部包含大量敌对实体，使得长期开采该层级资源并用于其他层级的计划变得困难起来。
//　　
//Level C-195有一种奇怪的专属特性：所有敌对实体似乎都是该层级的“市民”，且都对彼此保持中立或友善态度，并遵守夜伏昼出的生活规律。在层级各处都能看到身着各式城市人类服装的无面灵；悲尸扮演着建筑工、环卫工人等前厅劳动者的形象，有的也以商店售卖员、餐厅服务员等形象出现；猎犬有时会以宠物狗的姿态在无面灵身旁出现，就像在Level 11中可能会出现的情况一样；死亡飞蛾通常会出现在植物旁边，就像前厅的昆虫给花授粉一样，无论雄雌。笑魇、窗户等其他实体也会出现，但其行为似乎不受该层级特性的影响。
//
//在没有注意到流浪者时，实体们都会按照上述的行为模式行动。但当一个实体注意到流浪者时，该实体将立刻开始对流浪者展开不择手段的攻击，且会在将流浪者杀死后恢复原来的行为模式。雄性死亡飞蛾同样受该特性影响并会攻击流浪者。
//
//该层级的部分区域有红荨麻正在生长，请务必不要靠近这些区域以避免感染。值得一提的是，该层级的实体在由红荨麻感染上气球病后，即使已经到达病症的第二、三阶段，仍然不会对其它实体产生敌意，但其它实体会尽可能地远离他——前提是这些实体没有发现人类。
//　　
//由于其环境与前厅城市相仿，Level C-195也有与前厅城市相似的商业区和居民区等区域，这些区域内有大量的受Level C-195的特性影响的实体居住和工作。商业区中的大部分品牌无法识别，但也出现了一些前厅中的品牌。每天9：001时，大量的实体会从居民区涌出进入商业区“工作”。从9：00到17：00的8个小时中，会有不是工作人员的未知来源的实体来到商业区“消费”。这些实体使用的货币种类与样式，以及它们之间是如何交流的无从得知。到了17：00后，商业区的实体会回到居民区休息，直到第二天的9：00。夜晚期间，室外区域仅有笑魇活动，是流浪者从商业区搜集资源的好时机。如果流浪者在此时造成破坏，到了凌晨4：00时被破坏的地方会自行复原。
//
//AEnltzRqmLJdZ2s.jpg
//Level C-195夜晚时的一处公路，拍摄者未知。
//
//　　
//Level C-195的公共设施等似乎均由实体维持运转，也能在公路上看到公共汽车、私家车和特种车，所有的车种的品牌及车牌号均无法识别。有些实体似乎会乘坐或驾驶这些车辆前往商业区的“工作”地点。曾有流浪者在白天冒险外出探索时目击到在一个十字路口发生了一起两辆私家车相撞的事件，并造成了一系列的交通堵塞。该流浪者报告说，自己“至少看到了几十几辆由悲尸和无面灵开着的车子堵在了红绿灯口”。在事故发生后约20分钟，一辆警车开到现场，从上面下来2个身穿警服的无面灵。此后，该流浪者选择在未被大量敌对实体发现时脱离现场，未能记录更多情况。这项目击记录表明，Level C-195中存在由实体组成的执法部门。
//　　
//Level C-195内也存在类似“学校”的地区，这些地方经常会出现未成年无面灵，且多半有成年或老年无面灵陪同。所有学校的门牌上均没有任何文字或信息。在6：00～7：15，学校的门口会有来自居民区的大量未成年无面灵涌入，这个时间段被称作“上学”；相对的，在17：00这些无面灵会从相同的大门走出并回到居民区，被称作“放学”。尚不知道未成年无面灵在学校内是否会开展“学习”，因为所有试图进入学校的举措都失败了。与商业区的情况不同的是，学校附近的区域在“非上下学”的时间段时没有任何实体，包括笑魇。
//　　
//在Level C-195的各处可以检测到较为稳定的Wi-Fi，但目前被成功破译密码的Wi-Fi信号源仅有16处。通过该层级的Wi-Fi可以访问前厅的部分网站，包括但不限于[数据丢失]等，但不能访问前厅国家的政府网站或前厅学校的官方网站等。该层级的实体并不会因为流浪者连接Wi-Fi或访问网页而得知流浪者位置，因此在各类网站上进行操作是安全的。
//　　
//下面的文件包含了对各类网站的操作实验：
//
//　　
//[-]收起附录-01
//在前厅购物网站上使用前厅货币消费：可行，且会在24～72小时后后代填写的收货地点收到购买的商品，但由于送达快递的快递员是无面灵，因此不建议当面领取快递以免遭受攻击。无法在网站上评论商品。
//备注：购物网站上的商品种类较少，但存货很多。商品一般都是后室中的物品，如杏仁水、寂静汁液等。杏仁水等日常用品的售价较为便宜，而寂静汁液等稀有物品的售价较为高昂。纯净水等一些前厅商品也有售卖，但售价极高。所有商品的评论均为好评，但具体内容无法识别。
//
//在前厅游戏网站上购买和游玩电子游戏：可行，且可以访问前厅的游戏账号，也可以在电脑设备上下载游戏并游玩，但无法游玩联网游戏，也无法在网站上对游戏进行评论。
//备注：所有游戏在商店的评价均为好评，但内容无法识别。值得一提的是可以使用本地局域网联机游戏，但使用局域网作为联机方式的各种线上“联机平台”无法使用。无法从模组社区中下载模组，也无法使用社区功能。
//
//在在线聊天网站或软件上聊天：不可行。所有在线聊天网站与软件均无法访问。
//
//在视频网站上上传视频：不可行，也无法观看其他视频。
//
//在博客网站上发布博客：不可行，也无法观看其他博客。
//
//在插画网站上上传图片：不可行，也无法观看其他图片。
//
//
//　　
//在试图访问前厅的钓鱼网站等非法网站时，访问者的手机会自动重启并消除访问痕迹。需要警告的是，试图在各类网站搜索任何类似于或有关于2“后室”的内容将会立刻导致[数据丢失]，而在浏览某些网页时也会导致[数据丢失]，因此强烈不建议流浪者进行搜索，并在浏览网页时万分谨慎。
//　　
//基地、前哨站与社区
//　　
//纵使Level C-195的敌对实体极为众多，由于其资源与能够访问前厅网址的特性，依然有流浪者选择在此长期驻扎。
//　　
//
//M.E.G. Level C-195探险小组
//　　
//这个小组没有固定的休息点，以在Level C-195探索以获取资源维持活动，Level C-195的许多资料就是由他们所提供的。目前，他们仍在Level C-195探索，提供许多有用的信息，并尽可能地帮助每一个来到该层级的人。
//　　
//
//反密码精英
//　　
//这是一个专门在Level C-195破译Wi-Fi信号源密码的流浪者团体，目前已知的16个信号源的密码中有12个便是他们破译的。他们中的大部分都是游戏宅，声称是为了“让流浪者们能在后室打电竞比赛”而奋斗。该团体驻扎在一处旅馆中，拥有许多从Level C-195搜集来的电子设备且不允许外来人员借用或购买，但允许与其一起游玩电子游戏。
//　　
//
//入口与出口
//　　
//
//入口
//　　
//通过在Level 11切入一个地球仪或一个城市微缩模型可以来到该层级。
//在Level C-199切入床铺可以在该层级的一栋旅馆中醒来。该旅馆不存在任何敌对实体，也是“反密码精英”的驻扎地点。
//　　
//
//出口
//　　
//穿着带口袋的衣服进入Level C-195的一处地铁站，到达检票口时你的口袋中将会凭空出现一枚蓝色金属硬币。将硬币塞入检票口使栅栏打开，站在站台等候30秒后，一辆后室地铁会停在你的面前。进入后，说出或在脑中思考你想要前往的层级，即可离开Level C-195并前往那个层级。
//
//作者页面
//« Level C-194 | Level C-195 | Level C-196 »
//
//脚注
//1. 本文当以前厅的24小时制为时间记录方式，Level C-195的实际时间流逝速度为前厅的3倍。
//2. 如Level 0“教学关卡”、Object 1“杏仁水”等。目前关于“哪些内容算是‘有关于‘后室’”尚无定论，也不建议流浪者进行相关实验。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1195{}