//Level C-177
//评分: 
//+18
//+
//–
//X
// 
//
//生存难度：
//等级 2
//
//环境危害
//稳定性待定
//无实体
//Level C-177是后室C层群的第177层。
//
//本档案已更新至编号为BKRC177-26探索日志。
//
//该层级曾经探索出的特征与目前的情况有很大的差别，因此留存了BKRC177-19探索日志之前编写的档案，并用删除线划去与目前不符的情况。
//
//为了即时制止流浪者做出错误的行为，我们已将曾经一次探索日志的录音穿插在描述中，以表警示。
//
//698e971d3e27924b.jpg
//Level C-177的一张图片，拍摄者未知。 拍摄者为MEG成员“账号已注销”。
//
//
//
//
//
//描述
//Level C-177是由无数个类似于弹簧形状的无限向上下方延伸的螺旋楼梯过道组成的，这些楼梯光洁如新，墙壁如同刚粉刷过般锃亮，整体环境类似于刚竣工的大厦内部。这些过道通过一个正方形的门连在一起，形成了无穷无尽的魔方型空间。每种楼道空间最小仅有1立方米，最大有500立方米，且被一个绿色标识发出的光照射。
//
//Level C-177是由许多小房间和楼梯间组成的一个无限大的空间，内部结构类似于小区公寓过道，主体结构由粉刷过，且无法破坏的混凝土墙壁组成，房间的大小不固定，变化范围在30~60立方米，这些墙壁有明显风蚀的痕迹，很多地方开始出现裂缝，有时甚至会成片脱落。
//
//在楼梯过道中，偶尔会刷新连接着房间的门，但大多数时候没有。然而根据回声判断，这些没有刷新门的楼层的内部并非没有房间，只是由于某种原因刷新“出错”。
//
//进入大部分具有门的房间进行探索后，我们得知房间内部基本上漆黑一片且空无一物，请勿进入探索，这不仅浪费时间，而且具有潜在的风险。
//
//房间外的楼梯过道由一段楼梯连接，这些楼梯也具有似乎被长期使用过产生的坑洼和开裂的痕迹。
//
//探险者根据其记忆绘制了一幅简陋的构造图。
//
//9374841781ce3d80.png
//Level C-177部分的构造图还原。
//
//
//
//
//
//“这种房间是干什么的？”
//“管这么多干什么，艾瑞克，先进去看看到底有什么东西。”
//
//Level C-177的某些楼道会随机刷新一扇正方形米黄色铁门，这些门一般都很危险，大部分时候会带流浪者前往另一条更危险的楼道，那些楼道更容易刷新实体，或者是拥有更高的台阶。因此，非紧急情况不要穿过这些未知的门。
//
//Level C-177的楼道墙壁上会时不时出现上锁的正方形米黄色铁门，门锁撬开的难度较低。
//
//进入门以后，流浪者将会到达另一个楼梯间，这些楼梯间差异较小，主要体现在墙壁的颜色不同，或者是墙壁的破损程度不同。当你用手电筒去照射这些墙壁时，墙壁总会反射出绿色的光。
//
//“见鬼！这里的绿色看久了真让人恶心。探索完成以后赶快离开这里，艾瑞克！这鬼地方我可一刻都不想待！”
//
//Level C-177的墙壁上会时不时的刷新出空的红色管道和亮着“安全出口”字样的绿色发光标识，并且标识指示的方向始终朝下。
//
//Level C-177里有时会在墙壁上刷新一种很粗的红色水管和会放出绿色光线的标识，所有水管的内部都是空的，而发光的标识上所显示的内容已经磨损至不可辨别，但个别能勉强看出有一个向楼道口下方指示的箭头。
//
//根据其他流浪者的口述进行分析可推测，在不刷新标识的楼层里逗留，亦或者向上走都是非常危险的行为，只有不停的往下走才有机会生还。
//
//目前为止，还并没有关于在本层级的某处逗留时间过长而造成的生命威胁的报告，不排除逗留时间过长导致的焦虑只是心理作用的可能性。为了防止造成不必要的体力浪费，请勿经常在楼道内移动。
//
//本层级里的重力达到了惊人的2G，这意味着你在行走中的动作将十分吃力，这对于逃跑来说是很不利的因素。
//
//本层级里的重力经过专业测量后，其数据为正常值的2.33倍，虽然行走起来比较吃力，但并没有需要流浪者快速奔跑的情况，因此，该异常情况无需重视。
//
//“往下走了不知道多久了……在这里休息一下吧。把你带的杏仁水给我，艾瑞克。”
//
//在Level C-177里，所有楼道和门都是非线性的，也就是说，你无法通过原路返回的方式回到出发点。一旦迷失方向，你将没有逃出去的希望。
//
//在Level C-177里，各个不同的楼道由一扇正方形米黄色铁门连接，但只有上锁的门能带你去到一个新的楼道，进入敞开的门会让流浪者在同一个楼道循环。如果流浪者能用其他办法打开门锁，并记住来时的路，就可以回到起点。在路上做的任何记号都会消失，请相信自己的记忆力。
//
//“你还记得我们穿过了几个门吗，艾瑞克？”
//“我当然知道了！每用开锁器打开一个门我都要消耗不少力气！你倒是总是在一边傻楞的看着我做，连搭把手都不情愿！”
//
//在本层级中不会刷新任何补给品，但流浪者仍然可以通过随机刷新在“安全出口”旁边的插座为电子设备充电以保证持续的照明，这些插座总会提供来源未知的电力供应。如果你看到了除上述以外的任何物品出现，请勿接触他们。
//
//在本层级中不会刷新常见的补给品，例如杏仁水，火盐，但是会偶尔出现可以饮用的淡水水塘，这些水塘的水不会蒸发。本层级具有微弱的WIFI信号，在绿色标识的旁边有时会刷新一个插座，但其内部的铜片已经生锈，无法使用。
//
//“我们已经不知道走了多久了，我们的电力快用尽了。”
//“闭嘴！如果现在就这样回去，那和前几批怂货来这转了一圈就走有什么区别！”
//
//本层级中除了实体发出的声音以外，流浪者有可能会听见墙壁脱落砸在地上的声音，有推测可能是墙体老化掉落产生的，也有可能是实体抓挠墙壁发出的声音，总之，如果你听到了这种声音，请一定要尽快远离声源地！
//
//本层级表现出异常的安静，一切发出的声音都会回荡到楼梯间很远的地方，如果你听到了来源不明的奇怪声音，是因为墙体老化而脱落并砸到地上发出的声音，不要恐慌。再重复一遍，无论你听到了多么奇怪的声音，都是由于墙体老化而脱落并砸到地上造成的，不要恐慌。
//
//“没事，别管那个声音。”
//
//在本层级所查明的实体有笑魇，无面灵，猎犬，窃皮者，和一种只在本层级刷新，且极为罕见的实体“巡逻者”（Patrollings），它们大多数都刷新在黑暗的地方，所以要尽可能的待在光线之中，而如果遇到了楼道中绿色标识闪烁的情况，这代表“巡逻者”很可能已经发现你了。
//
//在探险队编号BKRC177-21行动后，并未发现本层级有任何实体。
//
//“别管它，只是一个声音而已，胡思乱想会分散你的注意力！”
//
//有记录称“巡逻者”的形状是类人型的黏胶，会迅速的在楼道里移动，并在碰到探险者之后用强腐蚀性液体杀死他们。如果你不幸遇到了“巡逻者”，一定要记住，一切物理攻击对它们来说是无效的！最好的方法是使用能瞬间放出大量热量的物体融化它们，然后迅速逃离。
//
//根据后续三次探索BKRC177-22~BKRC177-24，进一步确认了本层级无任何实体，因此该层级的生存等级进行了再次评估和更新。
//
//“艾瑞克，答应我好吗，冷静点，冷静……”
//
//aa18f1ba0e301ef7.png
//一名MEG成员冒死拍下的“巡逻者”的背影。 该实体不存在。
//
//978e8e5691971dd4.jpg
//其他探险者带来的更清晰的Level C-177照片。 名叫“账号已注销”的用户提供的Level C-177的图片。
//
//
//
//
//
//基地、前哨和社区
//鉴于以上特征，在本层级建立任何组织都是不可能的，故不存在。
//
//请勿在本层级建立任何基地、前哨和社区。
//“好，冷静……我们这就回去……把绳子拉起来，你在前面跟着绳子走……”
//
//入口与出口
//入口
//在Level 502以上的层级的暗处，如果某处正好有一堵比较宽大的墙的话，则有可能会刷新出一扇米黄色正方形的铁门，并且门缝里会透出幽绿色光线，如果你穿过了这扇门，就会到达Level C-177。
//出口
//
//Level C-177的墙壁上有极小的概率会刷新铺满墙壁的一排红色管道，如果你能切开它们，则可以在管道背后发现一扇锁死的长方形门，这个门被认为是离开Level C-177的出口，然而由于这扇门封锁得太紧，至今并没有人能通过这个出口离开Level C-177，所有生还的MEG探险者是由于意外切出而离开Level C-177的。
//只能顺着来时的那条路回到之前的层级。除此之外，没有发现任何的出口。
//
//
//
//请流浪者在看到这篇档案以后，忽略被划去的内容，以最新的消息为准。按照本档案进行行动是绝对安全的，请勿做出本档案劝阻的行为。
//
//
//关闭
//
//BKRC177-1~BKRC177-18
//BKRC177-19
//BKRC177-20~24
//BKRC177-25调查留存录音片段
//BKRC177-26调查留存录音片段
//
//
//
//【该文档正在解密中】
//（197X-11-13）【已解密 相关信息已更新至正文】
//“该死！绳子断了！”
//“怎么回事，是绳子自己断的吗？”
//“不，我想是被某种东西割断的，也许是……某种实体？”
//“别说傻话！这里早就已经被证明没有实体了！”
//*大约两分钟的沉默*
//“呵呵……你知道，有一些东西是比实体更可怕的存在吗……呵呵……”
//“艾瑞克！”
//“呵呵……探员先生，你最好还是想想我们怎么出去吧……”
//“你还记得我们开过多少个门吗？!”
//“呵呵……很抱歉，由于你处处对我工作的轻视，这些东西我已经忘记了……呵呵……”
//“你这是在报复我！！！”
//*录音结束*
//
//（197X-12-10）【已解密 相关信息已更新至正文】
//“你能听见某种水声吗？”
//“什么水声？”
//“仔细听……”
//*随即，信号中断了三分钟左右*
//“是洪水！洪水从上面冲下来了！”
//“你在犯什么病，这里怎么会有洪水？”
//“洪水来了！快点逃啊！”
//“别往下跑！你会迷路的！”
//“放开我，你这个不要命的贱种！”
//“碰！”
//*录音结束*
//
//
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1177{}