//Level C-135
//评分: 
//+12
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
//安全
//稳定
//受保护的环境
//Level C-135是后室C层群的第135层。
//
//a97c6f1d096c1d88.jpg
//腐泉水面
//
//描述
//Level C-135是一处半径大约20m的石灰岩溶洞，层级自上而下辐射着光芒，其光照范围足以覆盖层级表面的每个角落，暂不清楚光照是如何产生的。开采墙壁只会导致等量的石灰岩填补空隙。层级中央有一口半径5m的深潭——腐泉。腐泉散发着异常难闻的气味，类似于腐烂的死水潭。腐泉水面覆盖着一层厚度约为30cm的水藻1。M.E.G.强烈建议任何人不要破环腐泉的生态环境，因为腐泉本身具有极大研究价值。此层级除了以腐泉为核心的微型生态系统，无任何实体与生物。有关上述内容，尤其腐泉内部细节的详细信息，详见下文。
//
//- 收起
//日期：2021.3.16
//探索人员：李杰，携带水下摄影机、绳索、铅垂、水下照明灯。将摄影机沉入水下探索，并用绳索连接地面。
//目的：初步探索腐泉。
//进程：
//深度	探索发现
//0~20cm	大量水藻，少量水蚤等水生生物。
//30cm~20m	鉴于摄像机较低的清晰度和画面抖动，并没有明显的发现，除了水藻逐步消失外，在20m左右的深度还在岩壁上发现了不明圆形结构。
//结果：由于绳索总长仅为22m,摄影机没有继续深入探索，但此次探索却激发了部分M.E.G.成员的兴趣，M.E.G.总部也已批准进行下次探索实验。
//
//这贼臭的破水池子里绝对有东西。————李杰
//- 收起
//日期：2021.4.2
//探索人员：刘华海，亲自下水，携带水下摄影机、氧气瓶、潜水服、压强计。此人坠入后室前为专业潜水员。
//目的：探索腐泉的具体深度和内部环境。
//进程：
//深度	探索发现
//0~30cm	极为密集的水藻，一些不明种类的枝角目甲壳动物，水藻的质感被描述为异常滑腻。
//30cm~2m	水藻逐步消失，水中散布着少量杂质。
//2m~20m	腐泉直径逐渐扩张，在岩壁上发现类似管道的结构。水中散布着大量的颗粒杂质
//20m~60m	腐泉直径扩张为原先的2倍，水中弥漫着大量纤维碎片2、类似人造垃圾的组织、甚至是难以辨别的尸体组织，推测为未知实体3。岩壁上排列大量管道排水口结构，大多为堵塞状态，管道向内部延伸。然而奇怪的是，在50m以下水压开始随深度降低。
//60m~100m	腐泉直径开始缩小，水中杂质密集程度明显降低。水的色泽在灯光照射下呈现淡白色。
//100m~1km？	腐泉直径缩小为开始时的一半左右，水中仅散布极少量杂质。水压在200米深度开始固定为0.07MPa左右，外加水中几乎毫无阻拦，这使得探索极为顺利。刘华海表示自己既不饥饿也不疲倦，只是意识略微模糊，摄影机画面同时开始轻微扭曲，在画面中断前，刘华海声称透过潜水服闻见了杏仁水的气味。
//结果：探索记录在水下1000m左右的深度意外中断，4天后，M.E.G.受遣成员在Level C-8的一处充满杏仁水的水井内发现了昏迷的刘华海。5天后，一位在Level 4的探险者在一处杏仁水喷泉内发现了刘华海的设备并上报M.E.G.基地。4
//
//所以，咱们一直喝的杏仁水有一部分是从哪来的？————刘华海
//- 收起
//日期：2021.5.12
//探索人员：以水下无人机代替人员下水，并携带容器收集水的样本。
//目的：重新探索腐泉的内部环境和底部。
//进程：
//深度	探索发现与对比
//0~20m	与深度探索记录1一致。
//20m~60m	对比深度探索记录1，水中杂质明显减少，纤维碎片的降解程度更低，同时发现了更多的尸体组织。岩壁上的管道排水口结构不断涌出上述杂质与垃圾。
//60m~100m	与深度探索记录1一致。
//100m~1100m	无人机画面逐渐扭曲，抖动，最终在水下1100m左右的深度，画面中断。
//结果：在Level C-8中的另外一个新发现的杏仁水井中发现了无人机和样本，无人机表面略有磨损。在样本分析中发现，腐泉深处的水域的确含有极为纯净的杏仁水。由此推测，腐泉拥有某种“转化”或“过滤”的能力，它足以“生产”杏仁水。
//
//现在我们可以初步推断，腐泉也许是一种类似滤水机器的结构，它可以转化杏仁水并配给其它层级！只是现在我们还对此细节知之甚少，那些杂质来源何处还有待探索与研究。————M.E.G.成员Marrjia
//- 收起
//在此提醒各位探险者，腐泉的“腐”不仅仅是“腐烂”的腐，更是“腐蚀”的腐。不要在没有准备的情况下探索腐泉内部，这太危险了…————M.E.G.成员Marrjia
//日期：2021.6.7.
//探索人员：同深度探索记录2，并且携带更多容器采集样本。
//目的：采集更多水下样本。
//进程：【已删除，其摄像画面情景会引起不适。】
//结果：无人机在水下30m左右的未知画面中断，所有打捞尝试均已失败，唯一的结果是在漂浮上水面的橡胶结构碎片上发现了类似酸性物质腐蚀的痕迹，以及浮上水面的“尸体组织”。
//
//没错，它现在已经全面进入“工作状态”了，之前的探索不过是掐在了腐泉温柔的“开机状态”————刘华海
//基地、前哨与社区
//此层级无任何基地、前哨与社区，有关把此层级作为开采石灰岩的基地的提议已经被M.E.G.驳回了。由于此层级的重要生态地位，M.E.G.已在此树立告示牌。
//
//入口与出口
//入口
//在C层群可以在随机石灰岩结构发现此层级入口，外形为向内塌陷的洞穴入口。所有已经记载的入口外都有M.E.G.成员值守，详见下表(仍需完善）。
//Level C-12的一处裸露的石灰岩壁
//Level C-34的一处石灰岩溶洞入口，“嵌”在一间公共洗手间外。
//如有发现其余出口，建议立即上报M.E.G.
//出口
//原路返回即可。
//由探索记录推测，深入腐泉水下1km左右，你可能会传送到随机level的杏仁水补给处，5但可能会导致你的随身物品与你分离，因为物品同样会被传送。这种行为在没有防护的情况下目前等于自杀。
//有关水下岩壁管道的出入口性质正在调查
//
//作者信息
//« Level C-134 | Level C-135 | Level C-136 »
//
//脚注
//1. 已经确认为前厅的藻类品种
//2. 推测为地毯之类
//3. 疑似人形
//4. 这些杏仁水补给点都是被新发现的。
//5. 包括上文提及的传送口。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1135{}