//Level C-112
//评分: 
//+10
//+
//–
//X
// 
//
//生存难度：
//高价值区域
//宜居聚集地
//无有害实体
//Level C-112是后室C层群的第112层。
//
//描述：
//Level C-112是一个类似盘山小路的地方，一条由被人工简略修整过的岩石所铺成的道路而围绕一座山而组成。岩石道路一边靠向山体，而另一边则是悬崖，并且山体上生长着很多黄山松（PinustaiwanensisHayata），且整体环境的湿度较高，气温也处于15℃-18℃之间。
//
//进入该层级时，所处的位置通常都为山脚下，此时流浪者向后转去会发现没有道路，从道路的尽头向下看去将看到与天空同色的虚空，似乎整个层级并没有连接到“地面”而是以一种未知的方式浮在空中。此层级的海拔高度似乎很高，从悬崖向外望去会发现云层通常都在此层级所能踏足区域的下方，层级内的气压很稳定，没有出现高原反应的报告。从下向上望去，此层级大概40-50米高并且上方的空间会越来越小，但实际上根据大量流浪者的报告称，此层级的高度绝对不止40-50米高，并且向上无论走了多少层，围绕山体实际走一圈的时间都没有变少。向远方望去，可以看到更低的地方有一些其他的山峰，但由于湿度问题导致经常起雾，远处山的山峰的细节无法确认辨别。此层级山脚Wi-Fi信号偏弱，但越接近山顶Wi-Fi越高。
//
//每绕半圈左右，流浪者便会发现整座山有一个向内的凹槽，岩石道路也会沿着凹槽向内延伸，并在内壁通过一个悬崖方向完全与外界裸露的山洞。山顶有一个湖并且顺着靠山体凹槽一侧的沟顺流而下，最终形成瀑布流向虚空。湖水全部都是杏仁水，但对疾病的救治效果十分微弱，通常需要加热后才会显现出来，其味道接近纯净水。
//
//岩石道路宽3米左右并且每上升20个台阶就会出现一个平台，随后继续向上的台阶的方向将会向山体靠拢，从而形成一个环形向上的道路。每个平台都会在靠向悬崖的一侧延伸出一座中式亭或者阁，这些亭阁造型不一，亭与通常的亭子无异，但内部较为干燥并且实际空间会比从外观测到的要大一些；阁与通常的小型阁楼也没有太大区别，内部同样干燥与宽阔。这些亭阁据统计大约有上千个。
//
//山顶是此层级的最顶端，这是是一个约500平方米的平坦区域，除了杏仁水池塘外，这里的土质养分充足，适合种植。山顶有一座整个层级占地最大装修最精致的阁楼，进入阁楼向下走可以前往区域书阁。
//
//此层级内用有一种名为“第C-112效应”的异常效应存在，在任何加入了某个团体组织1的流浪者有在此层级想要建立一个据点或者与其他人为了团体组织争夺利益的想法时，他们会经历剧烈的头痛，任何药物都无法缓解。如果流浪者强忍头痛继续打算施行想法，头痛将会变得更加剧烈，直到流浪者放弃这个想法为止。
//
//实体
//层级内出现了多种实体与动物，除去山顶池塘及靠山体溪流内的小型鱼类外，无足鸟与待救狸奴曾被多次目击。
//
//“仙人”
//一名身着中国古代风格服饰的白发老人，其踪迹难以判断。经常出现在流浪者附近给予自己的观点，大部分流浪者似乎都很喜欢接受它的论点并很少与之发生争执。
//
//基地、前哨与社区
//因“第C-112效应”的存在，目前此层级内只存在松散的流浪者社区，这些流浪者想要做出决定时一般通过投票决定。
//
//入口与出口
//入口
//在书阁内找到中央的楼梯并走上去，便可来到此层级。
//在书阁内找到与本层描述相似的竹简并在大门激活，通过大门可以来到此层级。
//在任意层级发现一个被雾气缭绕的亭子并进入，当转身离开时将来到此层级。
//在迷失在雾气中有概率会来到此层级。
//从Level C-1切出有概率来到此层级。
//在Level C-71内看到雾气中出现亭阁时，有概率在迈出下一步后直接切出层级并来到此层级。
//出口
//进入山顶的阁楼并顺着楼梯向下走去可以进入书阁。
//直接跳入虚空可以抵达Level C-1。
//在石台阶上睡着有极大概率会在Level C-71醒来。
//低着头只顾走台阶而忘记自己要去哪里时，抬起头将会被传送到Level C-244。
//附录
//特殊区域：书阁
//
//- 收起信息
// 
//
//生存难度：
//等级 0
//
//安全
//稳定
//中量实体
//书阁是Level C-112的一个相对独立的区域。
//
//描述：
//书阁是一个巨大近乎无限2的中式古代藏书馆，其内部拥有着大量木质书架。
//
//书架内放置了大量竹简，这些竹简多以隶书书写，但多数竹简内的文字都是毫无逻辑的胡乱排列，阅读它们无法得到有效的信息。但很小几率时，流浪者将发现文字排列正确的竹简，但大部分也都只是一些琐碎的文字，没有参考价值。在这些文字排列正确的竹简内，有的时候将会发现一些记录着某些环境的竹简，这些竹简内有一部分似乎与一些C层群内的层级环境相似。
//
//当流浪者进入该区域后，便可以看到一个放置于楼梯对侧的一扇关闭的木门，木门旁有一个书桌，而书桌上则有一个竹筒。该竹筒刚好可以放入一卷竹简，而如果放置的竹简是记载了那些类似C层群环境的竹简，那么木门将可以被打开。流浪者进入后便可以来到竹简所描述的层级，但这个传送是单向的，流浪者无法直接回到书阁内。
//
//竹简每24小时的摆放位置将会回到书架内，并且摆放顺序将会被无规则打乱。
//
//实体
//噬命之灵
//大量三阶段的噬命之灵出现在此区域内。它们通常都待在书架前，并“端”着一卷竹简阅读着，与之尝试交谈似乎都不会得到对方的理睬。唯独提出想要阅读对方的竹简时，它们才会犹豫一下后再将竹简交给流浪者。
//
//“仙人”
//会经常出没在此区域内，与Level C-112内的别无二致。经常走到噬命之灵身旁用一种难以理解的语言指导着对方什么。
//
//基地、前哨与社区
//因“第C-112效应”的存在，故没有基地与社区。
//
//入口与出口
//入口
//目前只能从Level C-112的山顶阁楼的楼梯进入。
//出口
//从楼梯上去即可返回Level C-112。
//只要找到对应层级描述的竹简，便可通过大门直接前往。
//作者信息
//« Level C-111 | Level C-112 | Level C-113 »
//
//Footnotes
//1. 家庭除外，但如果是因利益而组成名为“家庭”的组织同样会受到影响。
//2. 目前还未探索出该区域的尽头，故推测无限。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1112{}