//Level C-129
//评分: 
//+69
//+
//–
//X
//（因不明原因，M.E.G.档案部无法对层级名字进行修改。）
//（该层级信息的文档和通讯记录几乎对其他探索者无帮助，是在该层级居住民强烈要求下加入，可选择不查看。）
//
//Level C-129 版本1（于2017年1月29日记录，2019年1月29日记入档案）
//
//- 关闭档案
// 
//
//生存难度：
//等级 2
//
//不安全
//稳定
//无实体危害8d90376344032737.jpg
//雪域枯林内部（拍摄于2017年1月27日）
//
//Level C-129是后室C层群的第129层。
//
//描述
//Level C-129气候恶劣，白日最高气温约为-15°C，夜晚最低气温可达-30°C。Level C-129时常下雪，且平均一个星期会有两次暴风雪，此时温度会急剧下降至-45°C，持续3~4小时。该层级地势平坦，由雪域枯林和雪域废弃村庄组成。该层级无WiFi信号。
//
//雪域枯林
//雪域枯林为该层级的主要组成部分，由深达0.5米的积雪和无数枯树构成。未知是否有边界，无实体，除枯树枝外无有用物资。
//
//雪域废弃村庄
//坐落于雪域枯林中某处的平原上。面积约8.5平方千米，有129座木屋，每座木屋按数字顺序编号。除了第129号木屋居住着实体“老奶奶”，其他木屋估计至少有数十年无人居住，且里面除了简朴的家居和工具，无太多有用物资。
//
//实体
//“老奶奶”
//
//在雪域废弃村庄第129号小木屋中有实体“老奶奶”居住，对人和蔼热情，为友好实体。
//
//基地，前哨站和社区
//雪域废弃村庄似乎于数十年前曾有未知社区，现已荒废，目前只有一位探索者和实体“老奶奶”居住于此。
//
//+ 文档记录1
//
//Level C-129 版本2（于2017年6月28日记录，2019年1月29日记入档案）
//
//- 关闭档案
// 
//
//生存难度：
//等级 1
//
//较不安全
//稳定
//无实体危害
//Level C-129是后室C层群的第129层。
//
//描述
//Level C-129气候较为恶劣，白日最高气温约为-9°C，夜晚最低气温可达-20°C。Level C-129时常下雪，且平均三个星期会有两次暴风雪，此时温度会急剧下降至-32°C。该层级地势平坦，由雪域枯林和雪域废弃村庄组成。该层级无WiFi信号。
//
//雪域枯林
//雪域枯林为该层级的主要组成部分，由深达0.5米的积雪和无数枯树构成。置于雪域枯林中的探索者会有强烈的孤独感，驱使探索者向雪域废弃村庄方向行走。也正因此没有探索者能探索其是否有边界。无实体，除枯树枝外无有用物资。
//
//雪域废弃村庄
//坐落于雪域枯林中某处的平原上。面积约8.5平方千米，有129座木屋，每座木屋按数字顺序编号，至少有数十年无人居住，且里面除了简朴的家居和工具，无太多有用物资。探索者已在村庄建立了基础防护设施以抵御恶劣天气。
//
//实体
//无实体。1
//
//基地，前哨站和社区
//雪域废弃村庄似乎于数十年前曾有社区，目前有9位探索者居住于此。
//
//+ 文档记录2
//
//Level C-129 版本3（于2019年1月29日记录，2019年1月29日记入档案）
//
//- 关闭档案
// 
//
//生存难度：
//等级 0
//
//较安全
//稳定
//无实体危害
//Level C-129是后室C层群的第129层。
//
//描述
//Level C-129层级地势平坦，由雪域枯林和雪域村庄组成。
//
//雪域枯林
//雪域枯林为该层级的主要组成部分，由深达0.5米的积雪和无数枯树构成，气候较为恶劣，白日最高气温约为-9°C，夜晚最低气温可达-20°C。时常下雪，且平均三个星期会有两次暴风雪，此时温度会急剧下降至-32°C。置于雪域枯林中的探索者会有强烈的孤独感，驱使探索者向雪域废弃村庄方向行走。也正因此没有探索者能探索其是否有边界。从雪域枯林向雪域村庄行走天气会逐渐温和。无实体，除枯树枝外无有用物资。无WiFi信号。
//
//雪域村庄
//坐落于雪域枯林中某处的平原上。面积约8.5平方千米，天气相对较温和，白天最高气温约为5°C，夜晚最低气温约为-5°C，有时下雪。有129座木屋，每座木屋按数字顺序编号，有数十年无人居住。目前居住于此的住民正对村庄进行改造，部分荒废已久的农田重新开耕以种植作物。有不稳定的弱WiFi信号。
//
//+ 文档记录3
//实体
//雪域村庄所种植作物是从Level C-194中带出，因涉及机密不便透露。
//
//基地，前哨站和社区
//雪域村庄内有37位居住民。
//
//+ 通讯记录1
//+ 通讯记录2
//Level C-129 版本4（于2022年1月29日记录，2022年1月29日记入档案）
//
//- 关闭档案
// 
//
//生存难度：
//安全
//宜居聚居地
//无实体危害
//+ 文档记录4
//Level C-129是后室C层群的第129层。
//
//描述
//Level C-129层级地势平坦，由雪域枯林和环形森林和绿野村庄组成。
//
//雪域枯林
//雪域枯林为该层级的主要组成部分，由深达0.5米的积雪和无数枯树构成，气候较差，白日最高气温约为-3°C，晚上最低气温约为-10°C。时常下雪。置于雪域枯林中的探索者会有孤独感，驱使探索者向环形森林方向行走。也正因此没有探索者能探索其是否有边界。无实体，除枯树枝外无有用物资。无WiFi信号。随着靠近环形森林天气会逐渐温和。
//
//环形森林
//围绕着绿野村庄的一圈森林，纵深约1200米。气候温和，白天最高气温约为12°C，夜晚最低气温约为3°C。有树枝，可食野果，可食野蔬等多种物资（据称有探索者曾看见小动物，但未经证实）。有中等强度的WiFi信号。
//
//绿野村庄
//坐落于被环形森林围绕的平原上，面积约8.5平方千米，与环形森林气候相似。平原内有大片草原，一些灌木丛，农田和129座木屋，每座木屋按数字顺序编号。环境宜居，有良好的WiFi信号。
//
//实体
//雪域村庄所种植作物是从Level C-194中带出，因涉及机密不便透露。
//
//基地，前哨站和社区
//T.P.S2
//绿野村庄中存在团体T.P.S，由居住于此的91位居住民组成。与E.P.B关系融洽。
//E.P.B.3 C-129分部
//经E.P.B.上级允许，E.P.B.中层干部罗比·贝克在此设立分部。听到消息后，各居住民都踊跃加入。
//入口与出口
//入口
//从Level C-129.F.T前门出去可来到绿野村庄。
//经分析统计结果如下：
//目前未发现其他Level C-129其他固定入口。绝大多数居住民都是从较寒冷和危险的层级（如Level 129和Level 420）偶然单独进入,只有一人从Level C-194进入除外（操，这是为什么？——罗比·贝克）。
//
//出口
//从绿野村庄编号129F.T的小木屋的门进入可到达Level C-129.F.T。
//
//
//
//Level C-129 版本5（未编辑）
//
//- 关闭档案
//会有的，总有一天，会有的。
//
//
//你所看到的每一篇版本背后，都承载着我们所有的每一点努力。
//
//
//- C-129
//
//
//
//这里是C-129，我是C-129。
//
//
//
//我存在于这里，这里因我而存在。
//
//
//
//这里曾有一些孩子，我曾照顾一些孩子。
//
//
//
//这里曾经很温暖，我感到很温暖，她也很温暖。
//
//
//
//但孩子们离开了这里，抛弃了我，也抛弃了她。
//
//
//
//为了自己的理想，背井离乡。
//
//
//
//这里开始冷寂，我感到孤独。
//
//
//
//于是我开始沉睡，这里封闭了。
//
//
//
//
//我醒了……好冷……
//
//
//
//咦？她一直都在吗？她一直都醒着？
//
//
//
//她真坚强，她明明比我孤独得多。
//
//
//
//我感到惭愧。
//
//
//
//我决定补偿她，为她写一篇童话。
//
//
//
//为了她，也为这里，为我自己。
//
//
//
//我开始寻找另一些孩子，他们孤独而坚强，迷失了路。
//
//
//
//我将他们引导向这里，以及去借了一个有用的孩子。
//
//
//
//我们开始书写：从前有一粒埋藏在雪里的种子睡着了。过了很久很久……
//
//
//
//呀，种子发芽了，雪开始融化了。
//
//
//
//春天要来了吧？
//
//
//
//- C-129
//Footnotes
//1. “老奶奶”为Level C-129.F.T的实体
//2. “The Prodigal Son”的简写，即“浪子回头”
//3. Electron Positive™ Particle Technology Co.,Ltd. of Backrooms，正电子™后室粒子科技有限公司，对外宣称目的是从微观视角探寻后室的本质。同时致力于特种工业产品制造与贩卖，分子科学、原子能、量子技术研究，资源探索与层级勘探工作等。目前成员人数不明。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1129{}