//Level C-181
//评分: 
//+21
//+
//–
//X
// 
//
//生存难度：
//等级 1
//
//安全，取决于你
// 
//少量实体
//Level C-181是后室C层群的第181层。
//
//欢迎你，新来的嗜血者。这里是争斗与流血的地方，端起武器，加入战斗！
//
//描述
//tRvq69YayTchuLS.jpg
//Level C-181内的一张照片，于第三竞技场内拍摄。
//
//Level C-181是一个理论上无限宽广的空间。在目前已探索的范围中，该层级由层叠的楼层与街区构成，建筑风格类似于日本东京或中国重庆的都市，包括大量霓虹灯、广告牌、高低不一的楼层与纵横交错的街道。但由于市区内的发电站处于停摆状态，这些设施大都无法正常运作。这些霓虹灯与广告牌上的语言为汉字或英文，但其意义不明，也无法找到相对应的产品、公司或网页。
//
//在已探索地带的中心，即流浪者切入时到达的地点1，坐落着一栋巨大的摩天大厦。该摩天大厦有111层高，占地面积超过3万平方米，内部设施完好，包括餐厅、办公室、娱乐场所等。在后室娱乐的成员抵达这里之后，很快为其恢复了供电，并以之为据点在Level C-181展开了探索。该大厦被后室娱乐命名为中心大厦。
//
//Level C-181具有特殊的性质：若流浪者在该层级受到了致命创伤，则将会迅速陷入昏迷、失去意识，但不会脑死亡。在其身体被重新治愈至重伤状态后，流浪者的意识将会回归。以上特性只对在该层级内收到的伤害生效，这意味着流浪者在本层级不会死亡。这一现象的具体原理目前未知。但是由于该层级较为安全的环境，这一性质实际上并无太大作用。
//
//Level C-181的街道上停放着不少车辆，与现代的车辆形式略有不同，但大体操控方法一致。这些车辆均处于未锁状态，但是缺乏燃料，无法启动。
//
//真实枪战场
//后室娱乐在发现该层级的特性后迅速对其展开了应用。在初步探清大厦周围区域后，创意设计师Klein提出了利用这一特性建造一个“竞技场”的提案。该提案迅速被所有设计师一致通过，并由保罗•西蒙斯亲自盖章实施。
//
//这一灵感源于 雷神之锤3：死亡竞赛
//QUAKE 3: Deathmatch
// ，最终敲定为大逃杀模式的竞技场项目受到了后室娱乐员工的极大欢迎，仅耗时七个月左右就完成了基本的比赛设施装修，并在该层级发现一年后推出了“真实枪战场”服务。该服务场所由四片街区构成，每个街区皆已恢复供电，车辆也会定时加油，以确保整个街区的完全运作。
//
//以下为一份“真实枪战场”的宣传单（数字版），该宣传单在中心大厦内随处可得。
//
//真实枪战场欢迎你的到来
//
//还在为无法宣泄你的情绪而感到压抑？还在对卷入这个可怕的世界而感到懊恼？参与真实枪战场，忘记一切烦恼，尽情挥洒子弹！在这里没有仇恨，只有开枪与反击；没有失败，只有再来一场！最真实的战场体验，最令人激情迸发的竞技场，在这里，感受肾上腺素在你的体内熊熊燃烧!
//
//想要进入真实枪战场，只需在Level C-181的中心大厦二层报名参加即可！切入Level C-181的方法很多，详见本单背面。在这之中，我们最推荐的是通过Level C-140内的入口进入，这是最稳定的办法！
//
//在缴费后你将得到一张门票，那是你进入一场竞赛中唯一的许可证明。该门票上会打印你的照片（我们会在报名的时候为你拍一张），禁止送出、交易、转让门票，门票仅在购买当日有效、同时，你也将暂时得到我们的定位手环，便于后室娱乐监控你的生命状况和位置。该手环将直接锁在你的手腕，避免在竞技期间脱落。在竞技结束后，请自觉交还手环。
//
//我们每天将开展两次竞技，分别在12:00和21:00开始，每次竞技为期五个小时。竞技将会在四个赛区中的随机一个内展开。竞赛具体的范围将视具体人数而定，于每次竞赛前对所有参与宣布。如果擅自离开竞赛区，你的手环将会开始强烈震动；在竞赛区外逗留超过5分钟，我们的工作人员将会找到你并取消你的竞技资格。
//
//在游戏期间，每过一个小时我们就会宣布缩小一次竞赛区的范围，以确保竞技不会因人数减少而变得无趣。具体缩小的范围也会随人数而定，在赛前发布，记得多加留意！中心大厦会实时显示时间，在厮杀中把握好自己的位置。
//
//以下是具体规则：
//
//一、在竞赛期间，你可以随意击伤、击杀你的对手，而你本人也会背上相应的风险。受伤者与死亡者会由工作人员回收，并在两个小时以内得到妥善治疗，恢复意识。虽然原则上我们允许随意攻击，但是我们不希望得到碎成一地的尸块或是肉末子。死亡者复活后将指认你是否存在虐尸行为，不要以为你能杀人灭口。我们的工作人员很忙，不要给他们增加多余的工作。
//
//二、请自备服装，但是不能穿着任何带有黄色的服饰。我们在赛前会检查这些。你也可以不穿衣服，这是你的自由！竞赛开始时每个人将被发放一把匕首、一把型号随机的手枪和相应的7发子弹，剩下的一切要依靠你们自己在竞技场摸索。
//
//三、所有的工作人员都穿着显眼的明黄色的衣服，请不要向他们开火。如果你这么做了，后果自负。
//
//四、不要刻意攻击破坏场地内的监控与参赛者身上的手环。这些物品可能会在竞赛中意外损坏，但我们事后会追究破坏者的责任并向其罚款。如果你试图破坏自己的定位手环，我们的工作人员很乐意与你玩一场猫鼠游戏，但我们不会复活你的尸体。
//
//五、不要破坏枪械，或试图将枪械带走。你可以取走被击杀者的物品，但是这些枪械在竞赛结束后都要统一上交。我们的武器里都配备了定位系统，别想着从我们这顺走哪怕一把匕首。
//
//六、竞技场内的武器由工作人员在竞赛前随机摆放，我们不会提供给手雷、RPG等爆炸物武器。你也可以使用竞技场内的物品作为武器，这是你的自由。
//
//七、在竞技时间结束，或存活人数小于2时工作人员将向全场宣告游戏结束。最后存活的参与者可以获得一名冠军徽章，这将是你荣誉的证明。
//
//玩得愉快！
//
//一切最终解释权归后室娱乐所有
//
//
//
//-收起补充资料：表演赛
//M.E.G.专员 龙泽 补充：
//
//在真实枪战场开设后，很长一段时间内没有人报名参加。就在所有人都认为这个项目黄了的时候，保罗•西蒙斯与其他92个后室娱乐成员亲自下场在第一赛区打了一场表演赛。在所有参加比赛的员工事后都重新露面后，逐渐有流浪者开始报名真实枪战场。时至今日，这里每天都会开展两场至少有30人参加的死亡竞赛。
//
//可惜的是，没人在第一场表演赛中看到他们想看的东西——保罗•西蒙斯的死状。这位后室娱乐领导人得到了真实枪战场发放的第一枚冠军徽章。
//
//
//- 收起补充资料：中心大厦
//M.E.G.专员 Helikos 补充：
//
//中心大厦随竞技场一同被改造成了娱乐设施。后室娱乐只开发了这里的前三十层，对于以上的楼层都只是做了照明维修。第一层被改造成了迎宾大厅，也是切入该层级后到达的地点。第二到五层分别为报名大厅、餐厅、餐厅、休息室。第六到八层为赌场，九到十五层为员工住宿处与休息室，十六到三十层为向流浪者开放的住宿处。
//
//他们在这里建立了一个小型的的“后室娱乐”大厦，就像他们在Level C-140里做的那样。这依旧是他们最擅长的经营。
//
//
//- 收起补充资料：枪械库与靶场
//M.E.G.专员 Kaito 补充：
//
//后室娱乐在大厦地下四层建设了靶场，供流浪者付费练习。我进去玩过几次，确实都是荷枪实弹。现在只能猜测后室娱乐在某个层级找到了军火库、枪械制造厂或是可以稳定交易军火的第三方势力，亦或者他们自己制造了这些枪械。不论如何，这都值得M.E.G.和盟友的关注。
//
//好消息是后室娱乐目前只使用这些枪械作为娱乐设施，对其管控之严格也常常让流浪者抱怨。我曾四次试着将枪械带离该层级，都被他们发现并阻止。我还因此被严肃警告，这也是我写完这个就打算调任的原因。他们可能已经开始怀疑我的身份了。该层级所有的出入口都在中心大厦内，而中心大厦处于后室娱乐的严厉监管之下。这或许也是他们为什么有自信在这里开设这种疯狂的游戏。
//
//有传言说后室娱乐在地下更深层建立了枪械库，可信度较高，但没有实质证据。
//
//
//
//实体
//在Level C-181内出现的本土实体有：笑魇、窃皮者与悲尸。这些实体出现的频率非常低，且大多已被后室娱乐清剿，保证不会出现在竞技场内。此外，还有诸如娱乐清扫者的后室娱乐实体。有关该类实体的信息详见Level C-140文档内有关实体的描述。
//
//基地、前哨与社区
//中心大厦
//由后室娱乐管理并经营，处于四个竞技场的中心。
//该层级所有的出口与入口都坐落于此。
//高111层，其中前三十层对外开放。
//地下共有四层对外开放，包括停车场、储物库和靶场。
//提供住宿、交易、餐饮，开设赌场.
//竞技场
//共四个，位于中心大厦周围。
//内部设施得到修缮，但由于开设真实枪战场的原因受到人为破坏。
//开设面积根据当日参赛人数变动。
//竞技场之外
//离开竞技场范围的流浪者将不受到后室娱乐的保护。
//后室娱乐不会阻止流浪者离开。
//枪械等竞技物品禁止带出竞技场。
//入口与出口
//入口
//从“后室娱乐大厦”（位于Level C-140）第一层中的竞技场入口切入。
//在Level 230中有一个建筑上带有霓虹招牌，从那里可以切入Level C-181。这栋建筑现已被后室娱乐掌控。
//从Level C-126车厢内的洗手间切出有很小几率抵达这里。
//在任意有热武器存在的层级切出都有很小概率抵达这里。
//出口
//从中心大厦一层的1号出口切出，将抵达Level C-140。
//从中心大厦一层的2号出口切出，将抵达Level C-13。
//从中心大厦一层的3号出口切出，将抵达Level C-96。
//从中心大厦一层的4号出口切出，将抵达Level 36。
//从出口以外的地点切出，将会随机抵达某个层级。通常来说，C层群的可能性更大。
//附件
//>>由专员 龙泽 提交的Level C-181侦察报告
//
//EagleWhiteSD.png
//对于后室娱乐的特殊侦察报告
//报告编号：Level_C_181_07
//报告撰写者：M.E.G.专员 龙泽
//报告提交日期：2022年4月7日
//报告概要：
//在Level C-181的中心大厦地下七层，有一个巨大的有机体存在。该有机体具有特殊的能力，也是Level C-181中异常性质的根源。据估计，该有机体未来有可能造成巨大危害。
//
//报告视频（转录）：
//视频备注:
//视频拍摄于：Level C-181，中心大厦十一层，一间客房的卫生间内。
//拍摄者：龙泽
//拍摄时间：2022年4月6日
//
//- 收起：视频资料
//>> 视频开始。
//
//>> 画面晃动，电流声。画面对焦。
//
//>> 镜头中出现了专员龙泽的面孔。他将手持设备放在洗手台上固定好。
//
//我是专员龙泽，现在开始第三次对后室娱乐在Level C-181内的情况的报告。
//
//后室娱乐的人都是疯子。他们的精神绝对不正常。我强烈建议M.E.G.遣返任何留在那里的成员，并且今后与后室娱乐减少接触。Level C-181有极大危险，极有可能带有精神干扰方面的特性。
//
//同时，也应对任何从Level C-181归来的人员做定期的精神状态检测，尤其是那些打过竞技赛的。我知道这点就我们目前的状况很难实现，但至少，对于那些大型聚居点，生活着百人以上的哨站，如Level 4、Level 11这类的地方，一定要提起重视。
//
//我说的这些人中……包括我自己。我也在这里死过一次。
//
//>> 龙泽做了一个深呼吸。
//
//抱歉，我有点太急了，这并不符合报告条例。从头说起。
//
//自上次报告之后，我就一直潜伏，作为外围工作人员在竞技场收尸。具体的工作内容请见上次报告，我就不再赘述。
//
//在我这么干了三个月后，终于有了一次机会。今天中午的比赛人数过多，导致尸体运转不过来；我们平常只是把不同的尸体分开装在袋子里，再运输回中心大厦的地下一层，这之后他们会做什么一概不知。但是今天他们说尸体太多，让我们也去复活一些。
//
//如果你看过我的前几期报告，你就知道我这里指什么。这层里受伤的人不会死。
//
//所以我开着车和我临时的搭档把尸体运进了地下一层。我们像平常一样把那些裹尸袋丢进那个大洞，就是我之前提到的那个。然后对讲机告诉我们，坐电梯去地下七层。
//
//我们照做了。大概在电梯里过了二十秒左右，电梯开门了。
//
//我需要暂停一下，思考我怎么描述我在地下七层见到的东西。
//
//>> 视频出现剪辑痕迹。场景和龙泽本人均无变化。
//
//地下七层是一个环形的空间，高约八米以上。在这个环的中间是一个玻璃管，巨大、厚实，有点像一个实验室里的培养试管。玻璃管一直延伸到地下七层之下，不知道有多深。
//
//管内是一个巨大的粉色肉团。我只能这么形容。那个东西的体积超过我见过的一切生物，不知道会不会比鲸鱼更大。它几乎把整个玻璃管挤满了。我的第一反应是这是整整一管的肢团，因为那些挤压在一起的肢体和触须跟它们太像了。但是我很快意识到这不是肢团，而是一个巨大的有机物。试管里装着不知道是什么东西的液体，那个有机物就浸泡在里面，那些一人高的触须就在管里轻轻摆动。
//
//对，这玩意儿是活的。
//
//如我在上面说到的，今天尸体人满为患了。我没能观察它太久，或者给它拍个照——这无疑会引起不必要的怀疑。我的临时搭挡只是个普通的后室娱乐成员，他也吃了一惊，然后跟我说：“他们玩得还挺大。”
//
//我们很快就看到了我们之前丢下的尸体在哪儿。在经过某种筛选机制之后，那些黄色的袋子一个一个地从旁边的管道里掉了下来。今天至少有八十多个。我们的对讲机很快又给了指示，让我们把尸体一个一个运送往管道旁边的那些设施，然后根据设备上的指示操作。
//
//我们照做了。我的搭档和我随便拽了两袋尸体到那些机器旁边。我上面忘说了，补充一下，管道旁边围绕着一圈看起来有点像X光机或者是什么的设备，和管道里是连通的。
//
//指示就贴在那个设备上。我们先把尸体从袋子里拖了出来——他的一只腿都被打烂了，胸腔上也都是弹孔。事实上，这个人的死因应该是他的脑门，他的大脑绝对遭到了破坏——这很难解释为什么这种人都可以复活。
//
//把尸体拖出来之后，我们打开了那个设备的舱门，把尸体倒了进去。舱门闭上之后，两道保险门依次打开，把它转移到了旁边的舱室。那个舱室透明，和管道连通，里面也都是那种淡黄色的不明液体。
//
//根据指示，我们要先进行“意识识别”功能。按下操作键后，我看到一根触须——那玩意儿的触须，从舱室后方的一个洞伸了进来。
//
//那根触须很快摸到了尸体。它深深地扎进了尸块之中，大概花了十秒的时间又抽出来。机器弹了一下，用英语写着“识别成功”的灯马上亮了起来。
//
//这之后是“意识维修”。操作之后，那根触须重新伸入了尸体。
//
//它似乎在吸收那具尸体。尸体肉眼可见地变得干瘪，塌了下去，然后我看到那根触须变粗了不少，前端鼓胀了起来，变成了一个类似圆球的结构。
//
//那个圆球上慢慢出现了一些褶皱，然后越来越多。它与触须主干之间的连接处逐渐变细，最后……脱离了出来。
//
//那玩意儿……是个脑子。
//
//>> 龙泽做了一个深呼吸。他的声音略带颤抖。
//
//我后面的内容不说了，浪费时间。总之，那根触须用类似的办法，把尸体吃光了，一根骨头都不剩……然后又分离出了一个个器官和神经，接着吐出了骨架，最后填补了血肉。整个过程只花了七八分钟左右。在“恢复完成”的灯管亮起来之后，我们进行了排出操作。
//
//跟与放进去时的一样，我们最后搬出了那个崭新的身体。我注意到，就连一些小伤疤都被还原了。那个“人”……我不知道那是否还能称为“人”，或者说是它的造物，完美的复制品……我也是……
//
//>> 龙泽的表情出现扭曲。他取下了拍摄设备。
//
//>> 视频出现剪辑痕迹。场景和龙泽本人均无变化。
//
//我们把那个人搬到了指定的地点，那里已经躺了一堆这样造出来的人。他们在稍后会被统一苏醒，当然不是在这儿。之后我们又搬了大概三四具尸体，才终于全部处理完毕。地下七层里至少还有六队人和我们做着一样的工作。
//
//在这之后我以身体不适请了假。经理用很正常地态度同意了，但他再三叮嘱我要记得遵守员工守则，否则后果自负。
//
//现在……外面正在打第二场竞赛。四号竞技场，四十六人。他们里又有多少人会死去……然后毫无知觉地以在另一个身体中苏醒？
//
//我不愿想。
//
//在此，我再次声明：后室娱乐都是一群疯子。这里的设备可能是层级里原有的，但他们还是在知道这些的情况下开办了那个竞技场……我不明白他们是出于什么心态这么做的，他们疯了，毫无人性地疯了。
//
//后室娱乐骗了我们所有人。这个层级根本没有什么狗屁特殊性质，只有那个异常的肉团。我只能猜测……在我们所有人进入Level C-181的时候，它就会用某种方式备份我们的意识，以及与之相匹配的身体状态……我不知道这是怎么实现的，它难道有什么精神上的特殊吗？它能感受到我是谁？它是怎么识别尸体的？它创造的意识都还是正常的吗？
//
//我的……脑子，还是正常的吗？我还是我吗？还是它的一部分？
//
//>> 视频出现剪辑痕迹。场景和龙泽本人均无变化。
//
//抱歉，分析不是我的工作。我的精神状况可能略微有点异常，但是我保证我的理智还在工作。以上就是我今天看到的一切。这份视频会实时上传。
//
//在今天之后，我希望暂时调任，离开后室娱乐的侦察项目。我会提交申请的。
//
//专员龙泽。
//
//>> 龙泽靠近摄像设备，关闭了镜头。电流声。
//
//>> 视频结束。
//
//- 收起：视频资料
//以下为与本报告相关的补充资料
//补充资料1：营救专员龙泽
//
//在收到本报告后，本部迅速决定派遣专员叶芷带队接应专员龙泽。然而，在Level C-140内，他们却受到了后室娱乐的阻挠。详见相关报告。
//后室娱乐在事后拒绝承认阻挠的行为是他们做的，而称“这是第三方势力在作怪”。
//
//补充资料2：后室娱乐的信件
//
//2022年4月14日，M.E.G.Gamma基地收到了一份电子邮件：
//致 监督者A：
//
//我已经听闻了发生在Level C-140里的那些令人不悦的事情。
//
//非常遗憾，我当时不在本层，否则必然会第一时间阻止这场闹剧。拦截你们的并非后室娱乐的工作人员，而是身份不明的第三方势力。我已知悉你们对真实枪战场的看法，你们在此事上可以保留自己的观点。但是真实枪战场会继续开设下去。我们单方面担保，它是无害的。但我们不会做出进一步解释。
//
//我希望这不会影响到我们未来友好的合作发展与贸易来往。
//
//
//
//
//真挚的问候
//保罗•西蒙斯
//
//脚注
//1. 目前为止，通过任何方法到达该层级的流浪者都会出现在这里。
package lvls11x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1181{}