//Level 372
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//Level 372是后室的第373层。
//
//vdNP2j.png
//Level 372中外围的景象。
//
//描述
//Level 372的中心区域的变化看似十分的随机，通常在几分钟到几天的时间内都不会发生任何改变；但在这之后，便会发生“重组事件”。当该事件发生时，整个Level 372的外观都会发生巨大的变化，有着从平凡的前厅风格到未来主义或梦幻般的环境变化。尽管该层级的变化不可预测，但该此层级经常出现一些特定的外观。这些外观已被指定为372.1号房间至372.4号房间。虽然这些变化可以是无限的，但该层级的中心区域的大小通常是有限的，它可以是一个房间到整个城市的任何地方。在Level 372的中心区域之外是一片白色的沙漠，伴随着是无星闪缩的黑色天空。任何源自Level 372的物体在被带出此Level时都会变成与上文提到的类似的白沙。Level 372的迭代通常由类似于人类的东西组成；然而，这些东西却表现出非常低的认知能力，并且会受到类似于进出层级的影响。在“重组事件”期间，在Level 372内的任何流浪者都会感觉自己被一种未知力量打昏了。当他们醒来时，Level 372的面貌便发生了变化。
//
//在Level 372中始终存在一个名为The Kid的实体。该实体外貌类似于一个棕色短发的小男孩。The Kid会对流浪者与其的谈话做出反应；不过，他几乎没有之前的记忆，当他被问任何有关Level 372的异常时，总是会表现得一头雾水，对于他而言似乎无事发生。
//
//房间
//372.1号房间是一栋三居室的小房子，其房间内部的墙纸剥落。在该房间内，通常有一个成年女性、一个男孩和一个成年男性与The Kid一同出现。这些人类似充当着The Kid的家人。与此房间内其他以普通人类的形式出现2位居民不同，这个成年男性与 1999 年的同名电影中所描述的“小侦探相似。
//372.2号房间是一个单层的教学楼，里面有许多看起来在中学年龄左右的孩子。虽然有教师在场，但他们很少在那里上课；相反，学生们经常互相交谈，并在楼外的操场上玩耍。
//372.3号房间是一个两层楼的房子，是另外一个四口之家的家。其他几个孩子通常也在这个房间里。经常可以发现他们在房子后面的院子里玩耍。
//372.4号房间是一个看似无限的森林。由于这个房间无限大，所以无法从这个房间进入本层的外围。该房间内永远保持黑夜状态，被满天的星光和一弯新月所照亮着。在本房间中，可以看到一个高大、阴暗的身影在追赶The Kid。当这个身影追上他时，一个“重组事件”便发生了。
//入口与出口
//入口
//Level 372可以通过Level 60的一个门或Level 72中的一个站台进入。
//出口
//当走进此Level的外围部分时，流浪者报告说他们的视线渐渐变成惨淡的白色，随后并出现在Level 124。
//增编
//Joshua Day是M.E.G. Track Mappers Team "Alice "的成员，他在372.4号房间内误食了少量液体而导致身体疼痛，他误认为该液体是杏仁水。此后不久，便发生了“重组事件”，在此期间，Day仍然保持清醒。他报告说当他误食不明液体后，他周围的环境逐渐陷入了黑暗。在此期间，Day声称听到了缓慢的蜂鸣声、模糊的声音和一些无法辨认的拖曳声。这一事件持续了数分钟。之后，Day被送回了M.E.G. Beta基地并在一系列治疗后得到了完全康复。
package lvls3x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl372{}