//Level 300
// 
//
//生存难度：
//等级 2
//
// 
// 
// 
//15753579259_ceefedfec0_b.jpg
//Level 300的一座木板路。
//
//Level 300是后室的301st层。于2012年11月29日被一小群流浪者发现。
//
//描述:
//Level 300主要由数不清的木板路组成，它们坐落于明亮的森林和蜿蜒的河流上方几英尺高处。据推测，层级整个区域位于一处无限的平原上。
//
//与前厅相同，Level 300存在着一个完整的昼夜循环。然而，天黑后的夜空却没有任何记录在案的卫星或天体，导致该层级的夜晚呈现出一片漆黑。该层级的温度在20°C至27°C内变化（68°F至81°F）之间变化，气候略带大风和多云。
//
//Level 300内的实体相当稀少。然而，目前由于缺乏研究，可能存在其他尚未记录的潜在实体。Entity 155 生活在彩虹瀑布和周围地区，尽管该个体数稀少。Entity 43，又称蠕灵，通常隐藏在彩虹瀑布的岩石下，曾有一些目击过它们在木板路上爬行。如果你找到了蠕灵的巢穴，最好将其清除。一位流浪者在木板路上报告过出现了一只尸鼠，即Entity 24。来自前厅的非实体生物如细菌和昆虫也会出现在彩虹瀑布的大部分岩石上。
//
//木板路
//Level 300有着无数的木制道路(地上的木板路或木桥)。大多数木板路都是死胡同, 因为它们的路径都被一些小山丘所挡住。Level 300木桥总是笔直的，永远不会偏离路径。经过进一步的研究，证实了这些木板路在原子级上保持一条直线，这意味着它们一丁点的弯曲都不存在。 尽管构成这些木板路的木板可被破坏，但它们却异常坚固——一块木板可以承载大约800公斤的重量，而由这些木板组成的桥至少离地20多英尺
//
//这些木板路大约每20公里相交一次。木板路，以及前面提到的彩虹瀑布，被认为是该层级唯一安全的地方。
//
//森林与河流
//Level 300的森林被认为是该层级中最危险的部分；这就是木板路在整个层级中存在的目的。木板路周围的地面、树木及其树枝实际上是非物质的，流浪者的手可以毫不费力地穿过它们。然而，高于木板路的坚实地面区域，例如山丘，是完全有形的，无法被穿过。
//
//一经发现，Level 300最初被认为由数量不详的河流组成。然而，进一步的研究表明，其实际只由一条河流组成。据推测，该河流至少有500万公里长。由于目前假定Level 300是无限的，尚未发现该河流的源头或河口。
//
//绝大多数到访过该层级的流浪者都试图翻越木桥，到达森林或河流。不幸的是，这导致了他们的神秘失踪。理论上，Level 300不存在实际的地面，翻过桥的流浪者都跌入了无尽的深渊，而不是像我们想的那样切出进入了其他层级，因为再也没有人见过他们。
//
//彩虹瀑布
//19869840481_3a8d62ed7a_b.jpg
//Level 300的彩虹瀑布。
//
//彩虹瀑布是Level 300内的一个特定区域。它存在着一个神奇的现象，即几乎所有的自然物体（树木、植物、人类皮肤等）在该区域内都呈现出了彩虹的不同颜色。这些彩虹的颜色虽然明亮和生动，却让人感到不自然。并且这些颜色不断地变化着迷人的图案。每15秒到几个小时不等变化一次；目前尚不清楚该现象的原理。
//
//流浪者报告说，在探索这一区域时，他们的幸福感会增加。经证实，这些五颜六色的树木的叶子完全可以食用，并有一种强烈的果酱味。1 食用它们会进一步增加流浪者的幸福感，不过要小心，因为一次性食用超过四片叶子会导致彩虹叶服用过量，这将造成心脏骤停。一片彩虹叶就能给予约半天的饱腹感。为了避免这种影响，建议将树叶在碗中研磨或在搅拌器中混合，研磨成液体饮用可以消除该影响。彩虹叶也可以有多种不同的味道。2
//
//流浪者吃下彩虹叶的味道似乎取决于它们的颜色。彩虹叶的各种味道如下表所示:
//颜色	味道	类似于:
//红色	略带辛辣，回味悠长。	胡椒
//橙色	略带酸甜，回味短暂。	橘子
//黄色	非常酸，回味悠长。	苹果醋
//绿色	无味。	—
//蓝色	薄荷般的浓郁，回味短暂。	薄荷
//紫罗兰色	果香浓郁，回味短暂。	蓝莓
//彩虹瀑布是Level 300唯一稳定的部分，任何人都可以在地面上自由行走，而不会有坠入深渊的危险。巨石、坚固的矿物岩、大树和悬崖构成了彩虹瀑布的景观。水并不纯净，但未经处理也可以饮用。
//
//白天，瀑布正常流动，因为它们不受Level 300的“彩虹效应”的影响。然而，当太阳完全落山，看不到任何光线时，瀑布开始散发彩虹颜色的光，构成了一幅非同寻常的景象。在该状态下，瀑布的水流似乎比平常快了至少十倍，大量的水蒸气散到空气中，使得整个区域发出不同颜色的光，同时空气中漂浮着些许果酱的气味。
//
//15952744992_857c4e7d2c_b.jpg
//另一张彩虹瀑布在黎明时分的照片。注意这五彩斑斓的光芒，在它的后面有该层级的出口。
//
//这是唯一一段流浪者可以离开Level 300的时间; 那些曾离开过该层级的流浪者表示，在瀑布后面有一段长达一公里的洞穴通道，它会逐渐通往Level 173。洞穴内几乎没有光线，流浪者需要小心，以免绊倒或撞到岩壁。山洞也很窄，随着深入你可能会发现，山洞内的空间开始缩小，并不得不匍匐前进，挤进狭小的空间内。离开该层级的过程非常困难。由于水流十分湍急，想要穿过瀑布几乎是不可能的——试图穿过瀑布的人则会造成骨折。似乎在瀑布下停留三秒钟就足以对身体造成永久性的伤害。
//
//离彩虹瀑布越近，木板路的细节就会稍微改变。木板通常会变薄，木板路的栏杆会明显变厚。尽管如此，目前还没有确切通向彩虹瀑布的路径。
//
//基地，前哨与社区:
//瀑布居民:
//它是目前已知的唯一一个Level 300的社区
//该团体大约有4-8名成员。
//他们决定留在Level 300因为这里有维持生存所需的所有资源。
//开放贸易，允许他人加入。他们并未武装。
//他们在该地区相当深的悬崖上建了三间小屋。小屋很小，家具也很简陋，但很舒适。附近还有一家小招待所——所有新来的人想在那里住多久就住多久。
//给新来者一些有用的建议，如果流浪者提出要求，则通常会告诉他们离开的唯一方法。
//入口和出口:
//入口
//目前只有三种已知的方法可以进入这一层级。
//
//Level 39的一些小路可能会出现一些木板躺在两侧，站在上面，则有可能切出进入Level 300.
//切出穿过Level 140的树木可能会将你传送至Level 300的木板路上。
//穿过Level 797墙壁上的一些洞可能会进入Level 300.
//出口
//目前只有一种已知的离开该层级的方法。
//
//冒险穿过Level 300的一座瀑布则会看到一个通往Level 173的山洞。需要注意的是，离开这一层级几乎是不可能的。除非流浪者找到通往彩虹瀑布的路，否则他们很可能会渴死或饿死。
//[+] Author
//« Level 299 | Level 300 | Level 301 »
//
//Footnotes
//1. 与森林不同，彩虹瀑布的树木是有形的。下面会阐述。
//2. 由于人类的皮肤也是一种天然材料，它也存在着不同的口味。但是，不建议这么做。
package lvls3x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl300{}