//Level 330
// 
//
//生存难度：
//
//画作
//
//不安全
//危险的体态变化
//人类禁止进入！！！
//330_entry_painting
//Level 330其中一个入口，位于Level 57。
//
//Level 330 是后室的第331层。其外观表现为一移动的儿童画作。
//
//描述
//层级本身具有一种独特的效果影响，使得周遭的环境看起来像手绘一般，而2D平面的物体将会竖立并占有立体的空间1。该影响同样会对流浪者在此层级中行动时遇到的实体起效。然而，流浪者们会发现自己和其他人的身体仍保持正常。由于在某一特定距离之外，颜色将会褪入一片漆黑之中，所以流浪者只能看见其周围一定距离之内的地方。因此，无法理论计算或实地测量该层级的占地大小。
//
//流浪者在层级内待的时间越长，其找到离开的方法的可能性越大。然而，建议流浪者尽早尝试寻找出口。虽然该层级相对安全，且只含有无面灵以及悲尸，但仍建议流浪者在此层级停留时间不应超过两小时。流浪者在层级内停留的时间越长，其进入一不可逆转的名为“入画过程”的体态变化过程的概率越大。
//
//入画过程体态变化的阶段
//经历阶段	经过时间（小时）	影响
//第一阶段	一小时	流浪者开始在地上留下颜料的脚印，颜料的颜色通常是其鞋底的颜色。
//第二阶段	两小时	流浪者开始受到该层级的视觉效果的影响，其身形将会被画笔风格化。
//第三阶段	三小时	流浪者的衣服与皮肤将开始滴下颜料。由于尝试离开或切出均会使得流浪者的身体如颜料一样泼洒在其尝试切出的物体表面，并由此丧命，所以这一阶段开始便无法逃脱。
//第四阶段	四小时	流浪者会被固定在其位置，使得其无法在三维空间里移动，但其仍能在二维平面上移动。其身体将会经历巨大转变，快速地变成其自己作画风格之下的自己。流浪者转化后的外貌以及其能否活过这一阶段均取决于其作画的能力。
//第五阶段	五小时	流浪者的身体将会完全固定。如果其作画风格不足够真实以至于内脏器官无法放入，在该阶段结束时流浪者便会死亡。但若流浪者的作画风格具有真实性，则其仍将拥有感知能力。
//由于入画过程的最后一阶段，流浪者认为在这一阶段中与其永远被固定在此，死亡将是更好的选择。若流浪者在第三个小时开始之前找到一出口，则入画过程将可以被逆转，而其身体将会在几小时后恢复正常。
//
//探索日志
//- 隐藏日志
//下列日志由第一名成功从本层级离开并安全回到M.E.G.基地的流浪者手中获得：
//
//13:28：好…开始录像了！我想我好像找到了个新的层级？我正在Level 57里闲逛，然后就看到了这张…看起来自己在移动的画作。不像层级里其他的画，这副画似乎具有相反的作用，想让我碰触，而我碰到它的时候，我就来到这个新地方了！这儿目前看起来相对比较安全，我要在这儿四周逛逛。
//
//13:42：额，这个层级看起来有点…欸，那是啥—马里奥纸模？我上次玩这种游戏已经是好几年前了。而且，好像到处都有纸板立着…灌木丛，树，啥都有！还没找到点其他的东西，甚至没有实体或流浪者…
//
//13:45：啊没事了，看到了只无面灵。在这里我真的没法辨认这是什么种类的无面灵，而且我也完全不想辨认。现在想来，我觉得之前那里好像有个肢团。我还以为那只是个长得奇形怪状的石头来着…
//
//14:01：我看到了…一个人类的立牌？它看起来…不像是画上去的。这里还有好多这种立牌！我知道这可能是个坏主意，但…我得去看看。
//
//14:03：我天—他们是流浪者！他们都是流浪者！
//
//14:06：有一些流浪者早已经死了，而那些还活着的流浪者，他们—他们向我大叫，让我在一切都来不及之前，让我在变成和他们一样之前，跑，赶紧离开。我鞋底开始有颜料了。这个层级…它会对流浪者干点啥事情…而且是坏事。
//
//14:48：无论我跑到哪里，我总是能找到越来越多的人。我觉得我能辨认还活着的以及已经死了的人的不同了。那些火柴人和长得形体不正常的人死了，而身体看起来正常的人还活着。
//
//15:18：我的身体看起来变得奇怪了，变得和这个层级的画画风格一样…靠，我希望能快点找到出路。我还没见到容易切出去的东西，而且我都尝试一大堆灌木丛了。
//
//15:25：有个湖！我要跳进去了，求求上帝保佑这里面没啥奇怪的实体。
//
//在最后一则探索日志之后，流浪者发现自己来到Level 43，身上裹满蓝色颜料，推测为其之前跳入的湖的颜料。在这之后，其成功进入了一安全层级以报告其发现。
//
//- 隐藏日志
//M.E.G. 探索日志
//
//
//起始时间：2022.4.15 11:20
//
//记录设备：手持无线电发报机
//
//起始地点：Level 57
//
//M.E.G. 队长：Eric Blane军官
//
//前言：一支 M.E.G. 特别小组的三人小队被派遣以调查一流浪者逃脱后报告的 Level 330 内存在的体态转换作用，下文为其探索记录。
//
//<记录开始>
//
//
//Blane：全体队员，我们没有很多时间就要离开，注意观察人类立牌以及附近的出口。我们需要层级影响的解答，以及一种出去的方法。
//
//Virta：我…真的不喜欢这地方，它看起来像是个五岁小孩做的东西。
//
//Osvin：所以呢，你能画的比这更好？你连火柴人都不会画，老兄。
//
//Virta：闭上你的臭嘴你个—
//
//Blane：好了，你俩够了，我们可没时间坐在这谈画画能力。你俩要是还在这吵我们就找不到要找的东西了。专心行动。
//
//Virta：额，好吧。
//
//Osvin：是，长官。
//[时间 - 11:50]
//
//
//[可以听见小队行路的声音。]
//
//Osvin：长官，我找到了一个人形立牌！
//
//Blane：这人看起来活着么？
//
//Osvin：看起来是！
//
//Blane：漂亮。 Virta，继续搜寻出口。
//
//Virta：真的？我？
//
//Blane：这是命令， Virta。
//
//Virta：哎，好吧…妈的…
//
//Blane：Osvin，把家伙都准备好。我们在这呆了多久了？
//
//Osvin：不多半个小时，长官。我们距离离开这里还有很多时间。
//
//Blane：不错。保持警惕。
//
//[可以听见脚步声和放置设备的声音。]
//
//(注意： 下列的立牌的回应仅为粗略翻译2。)
//
//立牌：离开！赶紧跑！离开！
//
//Blane：不，我们就是来这和你讲话的。我们想知道这是…怎么发生的。
//
//Osvin：可以嘛？我们会尽力给予帮助。
//
//立牌：没办法啊！尝试切出我们就会洒成颜料的3！迷路的朋友！
//
//Osvin：呀…你们知道到这种地步要经历多长时间么？
//
//立牌：我觉得…三小时…颜料…从他们身上滴落…不喜欢失去颜色的…
//
//Blane：你怎么听懂他们在讲啥的？
//
//Osvin：这是我的一个古怪的兴趣——我年轻时候学会了腹语。无聊和家长对电子产品的偏执掌控对孩子产生的影响有时真的会很神奇。
//
//Blane：我…靠？
//
//Osvin：如果我们出去了的话，我可以给你演示演示。现在的话…
//
//Osvin：你们怎么能活下来的？
//
//立牌：失落的…感情…饥饿…口渴…没别的了。
//
//Osvin：为什么你们只有一些人活下来了？
//
//立牌：只有一些…活下来…好的画手…能活下来…火柴人会死…身体比例错误会死…只有所有都正确…
//
//Osvin：好吧…看来 Virta 活不下来了，哈哈。那么，你们知道什么导致了这些事发生么？
//
//立牌：这个层级…是活的…它不喜欢…人…听见了人的声音…会尖叫…总是在生气…
//
//Osvin：这…好恐怖。你们变成这样花了多久？
//
//立牌：我觉得…第五个小时…才结束…第四个小时…好痛…好痛…好痛好痛好痛好痛—（立牌开始尖叫） 快离开！
//
//Osvin：这—这不是之前那个说话声音！
//
//立牌： 没有颜色！没有天赋！离开！我的世界！人类不许进入！
//
//Osvin：为什么你讨厌人类？
//
//立牌： 糟蹋！混乱！撕毁！坏蛋！人类都是坏蛋！
//
//Virta（通过对讲机）：Blane，长官！我找到一个可能是出口的地方了！看起来是一幢大楼的门，这扇门似乎通向…我觉得是 Level 1。我在你们当前位置的东北方。
//
//Blane：好，我们一会就会跟上你。
//
//Virta：这尖叫声是什么鬼？你们那儿出啥问题了？
//
//Blane：没事，我觉得我们已经得到了所需要的所有信息。我会在回到基地后解释的。Osvin， 我们马上就走。
//
//Osvin：但是长官！我们现在还能得到很多—
//
//Blane：这个声音已经因我们的出现而生气了。我们得走了。我鞋底开始有颜料了。
//
//Osvin：…好吧。 给我一段时间理东西。
//
//立牌：快！离开！我的世界！这不是你们的！
//
//[新的声音持续向 Blane 和 Osvin 大叫，直到他们离开去寻找 Virta，随后记录终止。]
//
//<日志结束>
//
//基地、前哨和社区
//由于本层级的性质，并没有任何基地或前哨建立于此。
//
//入口与出口
//入口
//进入该层级的唯一方法是碰触在画布上的一张移动的画作，这些画作通常都描绘了建立在绿草上的一座小屋，以及蓝色天空和黄色太阳。这些画作通常可以在任何有画廊或博物馆的层级内找到，例如 Level 57 或 Level 321 。有一些画作出现在 Level 5 之内的报告，但是这有待考证。
//
//出口
//跳进湖里可以通向下列层级中的一个：
//
//Level 7
//Level 43
//Level 130
//Level 173
//如果你选择这么做，来到新层级时你的身上将裹满蓝色颜料。
//
//进入与建筑联通的一扇门可以通向下列层级中的一个：
//
//Level 1
//Level 4
//Level 9
//Level 11
//不与建筑联通的门可以随机通向任意层级，包括负数层级。
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//嗯？
//有啥东西在画里呢… 
//« Level 329 | Level 330 | Level 331 »
//
//脚注
//1. 译注：就是像立牌一样在地面上。
//2. 立牌的交流能力在这种状态下似乎被阻碍。
//3. 译注：根据原文意思翻译。
package lvls3x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl330{}