//Level 302
//⚠️安全通知⚠️
//由于Level 302中栖息的野生动物给组织所带来的巨大益处，M.E.G.现已将有关Level 302的文件档案设为机密。每一个在后室有可能到达此处的入口均有M.E.G.相关人员驻守，Level 101 则全部位于M.E.G.相关人员的监视和保全之下。请输入欧米茄级准入许可证以继续浏览。
//
//访问已批准
// 
//
//生存难度：
// 
// 
// 
//level-302.jpg
//Level 302 的山谷风光
//
//大国家公园是后室的第303个层级，由两位来历不明的人于2021年发现。两人的尸体在层级入口处被找到。
//
//描述：
//Level 302 是一片层峦环绕的针叶林，据位于Level 101 的入口处的标志所称，其名为“大国家公园“。瀑布、异国生物、有非自然环境特征的自然奇观，与大量栖居于此的野生动物一起，使Level302闻名遐迩。
//
//属性：
//气候
//Level 302气候恒定，天气温度罕有变化。Level 302 的海平面温度为27摄氏度(80 华氏度)，顶峰处温度为15摄氏度(59华氏度)。Level 302 常是万里晴空，其中点缀有几朵白云。
//
//地貌样态
//Level 302的地表样态十分多变，且依照从众多调查和测试中修复的数据也尚无法得出一致的数据资料。以下是可被记录下来的已观察到的一些有关地表样态的例子。
//
//主要湖泊，又称“渊之海“（the Apýthmenos sea）
//渊之海1，坐落于Level 302 的几何中心处，是Level 302的主要特色景观。渊之海，是一个占地面积约30，0000km2（11.5830mi2），深约200km（124.27mi）以上的湖，用于比较，地球地壳的深度大概是70km（43.5mi）。渊之湖有其特殊的香味，尤其像酒水（特别是朗姆酒）的味道，原因是渊之海的水体中28%是由甲酸乙酯2组成。在level 302的其他地方没有观测到此种现象。*.
//
//山脉
//所有的位于Level 302 内的山脉都看起来像阿拉斯加山脉, 麦金利山3被发现位于Level 302的边缘。Level 302的山脉通常由硅、碳、钾、铝、钙和低浓度的铁、镁、钚乃至 鿫4等元素组成。除了其元素组成之外，Level 302的山脉未表现出任何的异常性质。
//
//瀑布
//Level 302的瀑布和Level 302的山脉几近相同，但两者的重大差异体现在高低落差上。瀑布是一种近似于山的地表样貌，有着至少一面的倾角相对地面为86°到111°。瀑布常常被湖泊或者其他较小的水域所占据，越小的水域也意味着从瀑布上飞流而下的水流量更少。这里的这些湖泊的水体由多种单质混合而成，不像是本层级其余的地方流的是盐水，这里流的是丙酮和柠檬酸的混合物。
//
//野生动物
//有许多原生于此的野生动物，它们为此层级唯一的一类“实体“。大多存在于Level 302 内的物种被列为濒危状态，原因是除了Level 302 外在后室里没有找到其他可以供这些生物生存的层级。目前，在Level 302 内有73个独立野生物种，如下是一些已经被记录的野生生物案例：
//
//物种001—丰饶之树
//危险等级：绿
//物种001是在level 302内的优势物种。物种001 的实例样本表明，其外观为针叶树木，且基因序列与前室的针叶树木相同。样本显示其肥力相比于前室中的针叶树木来说要强100倍以上，这可能会导致土壤肥力强的地区过度密集。
//
//物种017—凤凰
//危险等级：红
//样本显示，物种017外观为一只由火焰组成的白头鹰。物种017高一般为14.2米(46.58 英尺)，翼展32.8米(107.6 英尺)，体重30吨。物种017常常对外来事物展现出敌意，物种017被观察到可以将没来Level 302多久的人原地火化，因此，物种017被视为一种威胁·。而对在此长期驻足的流浪者和M.E.G.成员，017往往会无视他们，或协助他们与可能的敌人战斗。
//
//物种035—相变者
//危险等级：绿
//物种035的基础形态常被描述为一位身着上世纪九十年代服装，黑发蓝眼的美洲裔女性，年龄大概处于青春期晚期。物种035实例显示，其身体由碲 (Te)、钨(W) 、以及较低比率的铁(Te)、水(H2O)和汞(Hg)组成。物种035实例有在金属的若干相态之间切换的能力，可转变至的相态包括：固态，液态，气态，离子态，夸克-胶子等离子态 (quark-gluon plasma)，准固体态和玻色-爱因斯坦凝聚态（Bose-Einstein condensate, BEC）等。改变相态不会改变其身体温度。物种035常是友善的，不管对方是外来者还是来自于本层级。
//
//物种066-成真
//危险等级：橙5
//物种066的外观与在市场上常常称作“神奇8号球“的商品一致，且拥有着和普通神奇8号球相同的平均大小和重量。通常物种066不会被称为是一种”动物“，因为它似乎没有任何如动物一般的身体机能。它随后被归类为植物王国中的一份子，这是因为在它的实体样本上面提取的细胞和亚马逊红木6的树皮细胞类似。
//无论何时物种066被碰撞到，它会且仅会散发出红色的光，但以下情况除外：当人们带着想要某个东西的愿望而碰触物种066时，它会散发出蓝色的光芒，随后一个和愿望中的物品相同的物品在许愿人的周围大概0.9米(2.9 英尺)远处凭空出现。物种066可以这么做的原因目前未知。
//
//发现
//在2027年，在level 302的入口旁发现了两具尸体。对两具尸体的DNA鉴定显示这两具尸体死亡时间大概均在6年前。在其中一个人的身上找到了一个物种066，在另一个人的身上，搜到了一本皮革封面的的笔记本，里面写着他们在后室里的见闻经验，包括发现Level 302。以下的文本为第23天的日志的重制版本，第23天指的是Level 302被发现的日子。
//
//第23天
//我们在人们常称作Level 8的地方的一处洞口停住了脚步。这个洞口可不一般，洞口里面有一片森林，远方望去依稀有山峦叠嶂。我告知了█████有关洞口的事，但他认为那只是“又一个洞口“而已，并没有在意。我想要好好探索这个地方一番，我的好奇心压过了其他的想法。我开始用我从Level 5里捡到的菜刀来挖开（我知道这挺奇怪的）入口处阻挡道路的岩石，直到挖出一个可以让我一个人钻过去的缝隙为止。█████犹豫了一阵子，最终还是下定了主意钻过了缝隙，走在我的身后。我们找到了一些奇怪的玩意：一个神奇8号球，一只火焰鸟还有一大堆其他的东西，然后时间就来到了现在了。我们在我们进来的地方搭了个帐篷，希望这个层级是安全的。
//
//基地，前哨和团体：
//M.E.G.“野外奇观”前哨站
//位置：从Level 101*进入Level 302的入口处
//成立日： ████/██/██
//人口：26
//描述：“野外奇观“前哨站是一座M.E.G.前哨站，于████/██/██在从Level 101进入Level 302的入口处建立。本前哨站的建立目的是保护Level 302内部的物种，同时确保Level 302的物种不会出现在后室中其他任何地方。这么做的原因是它们的守护者在它们那里可以得到特殊的益处。
//入口和出口
//入口
//Level 8
//进入一个在后面有森林景观的洞口（详见发现日志）。
//Level 75
//进入一个极其罕见的不宽于一米的子洞穴。
//Level 101
//在森林里漫步超过20分钟，你应当可以见到实体数量在增加，直到实体变为了野生动物为止。
//Level 165
//进入一个石棚（1/3000的概率）。
//出口
//Level 8
//在你来的地方出去即可。
//Level 93
//爬上最边缘处的山时，应该可以明显的觉察到山的高度开始或多或少的增加，这是你已进入Level 93的标志。
//Footnotes
//1. Apýthmenos希腊字母写作απύθμενος，意为深渊。
//2. 带来朗姆酒味道的主要化学物质
//3. 又称德纳利山
//4. 为其能指的汉字尚未纳入计算机可输出的汉字中，该汉字读作ao（四声），写作气字头里面一个"奥" 字。原子序数为118，人造元素，半衰期为0.68毫秒，电子排布为 5f14 6d10 7s2 7p6（预测），可能为稀有气体——译者注
//5. 原文为Amber，意译为橙。——译者注
//6. 学名：Dalbergia spruceana
package lvls3x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl302{}