//Level 324
//致： 亨利•桑特, M.E.G.
//自： 杰克•何登
//标题： 梦
//2021/6/17
//
//你还记得几年前我说的重现的梦吗？嗯，觉得你的建议还不错，就一直把那些你有可能感兴趣的梦写成了日记。之所以到现在我也没给你看哪怕一篇，是因为它们好像都是很隐私，每个都出于某种原因。就像我自己的秘密一样。但是我现在就是需要不把它当成秘密了，把这些梦将给某个人。也许它们会浮现地更真实一点吧。下面的这些附件是记录，而且是所有。 或者至少我自己是这么认为；我也不想要更多了。
//
//杰克•何登
//
//2020-01-19.txt
//又做了一个紫色的梦。写这个梦日记还真的能记得更清楚些，但这个还是有点模糊。记得在一个桌子边（或许是一张饭桌？），桌子的另一端有一个人。房间很漂亮，四面墙是紫色的，和往常一样。至于那个人，觉得他她？在对我说话，但是更多的就想不起来了。这些梦正一点一点变得清晰，看起来不久我就可以获得更多有用的信息了。这些梦无端地让我特别感兴趣，也不知道为什么，但是还就是觉得它们有一些重要的地方。
//
//2020-02-04.txt
//又是一个，这种，紫色的梦！这次记得清楚的多。这个场景不只是一个房间了，而是一个宅邸。这个古老的宅邸很大，而且确实很老式。不太确定墙是不是真的是紫色的，但所有东西都感觉被紫色的薄雾笼罩了一样。
//
//还记得那个人。她是一个老太太，有一头很长的白发。还是不记得她的脸是什么样子，但她穿着一件精美的紫色连衣裙。她让我叫他“外婆”。
//
//我们聊了一会儿，（希望我之后还会记得这番谈话。）尽管我的话不是很有趣，但是几次她都笑了。她的笑声很年轻，让我有点惊讶。
//
//2020-04-17.txt
//又一个紫色的梦。我承认，有点想念“外婆”了。不知道为什么，就是想和她谈谈。
//
//所以一直想着再去那里，最终也实现了。我现在很确定她还记得我。一直对她说着话，就似乎她不是我的想象一样，但自己确实觉得这是真的。这整个后室实在是太诡异了，感觉要是我突然被带到这些梦境里真实的地方，也不会感觉太奇怪。或许这些只是自己的臆想，但是不管怎样，依然觉得她看见我也很开心。问她怎样才能经常去看她，她笑了笑，接着说我什么都做不了，我还是不能控制自己的梦境。她解释说，这就是为什么你应该和我在一起。但是感觉她有点像是自言自语着。我怀疑着她很孤独，甚至比她的表现更孤独。
//
//似乎呆了几个小时。大部分时间，都只是谈话。最后问她，如何能醒来。她看起来有一点落寞，指了指那个通向地下室的楼梯。在记忆的结束，是我下楼梯的场景。
//
//2020-07-26.txt
//昨晚，我再次做了一个紫色的梦。它变得不同于往常——变得空了。周围紫色的墙在我独处时让人感觉有点恐怖。很想下楼，回到舒适的床上，但还是决定等她。
//
//一段时间我都在这房间里踱步，之后突然就有点想探索这座宅邸。之前并未上过楼。楼梯的顶端有一条走廊，只对面有一扇门。从我站的这里，能听到门里传来的啜泣声。突然有了一种抬腿跑的冲动，就像自己不属于这里，亦像自己不再被需要在场。但几乎同时，一种更强的冲动袭来，驱使着自己弄清楚门内的东西。想着若思考太久，懦弱的感觉就会占据上风，所以马上做出了前进的决定。
//
//好像很久，才穿过走廊，终于摸到门把手时，啜泣停止了。那种自己不属于这里的可怕感觉消失了。打开门，发现房间里空无一人，只有一把爬满蜘蛛网的，废弃的摇椅。然后我感觉到一只手搭在肩膀上。
//
//转过身，看到了外婆。本以为她会生气，但她只是看上去很伤心。“我觉得你该走了。”她用一种挫败而悲哀的语气说着，一言不发地领我下了楼。
//
//2021-06-17.txt
//一年多了，但对于外婆与紫色的梦，我终于有了一个终点。其实，我自己也不确切地知道这意味着什么，但这个梦就是一种终点，也给我留下了深深的空虚感。
//
//在一片田野里，有紫色的草和紫色的天空。觉得那做宅邸就在身后，但似乎很模糊。地上有一个洞——是一个坟墓，一口棺材正慢慢地落进去，落进去；就像被施了一种悬浮的魔法。某种原因让我感觉埋葬她是不可推卸的责任，但无论挖了多少土，棺盖却都盖不住。
//
//我醒了。
//
package lvls3x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl324{}