//Level 309
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//Trees
//一张 Level 309 的照片。
//
//描述：
//Level 309 是后室的第310层，外观表现为一森林，植被生物覆盖密集。森林中最常见的树木为白桦木，但也可以发现其他的品种。 Level 309 内的土壤肥沃，可供大部分花草生长，也可以种植作物。 有许多流浪者报告称他们在层级内为绕圈而非直线行走，因此 Level 309 被认定为非欧几里得空间。层级内地势平坦，但偶尔也会出现小山。天空无云，无论何时其颜色及亮度均相同，推测该层级并不存在昼夜变化。
//
//Level 309 内空气过于湿润，导致整个层级都蒙上了一层雾。在雾最浓的地区，可见度少至只有几英尺。在此层级内栖息的一些敌对实体已经演化出了忽略雾所带来的影响的能力并利用此能力进行攻击。
//
//Level 309 中存在许多种真菌，主要为该层级特有的闪着微光的蘑菇。即使 M.E.G. 已经在进行调查，对于这些蘑菇的信息仍知之甚少，但层级内大部分蘑菇均可食用，但味较苦较难下咽。但不建议准备长期生活在此的流浪者囤积这些菌种，因为它们会在被拔根后2~3天之内腐坏1，所以建议流浪者先行准备物资。腐坏的蘑菇可能会让流浪者的肚子痛上几天。
//
//Mushroom
//Level 309 内发现的一只发光蘑菇。
//
//Level 309 目前发现的最有名的菌种是狂孢菌。狂孢菌与层级内其他菌种不同，它无法发光，且不可食用。狂孢菌颜色暗黄，高三英尺。切成小块煮熟的狂孢菌即成为一种毒品，称为狂孢毒。吸食过狂孢毒的流浪者将其描述为“味咸，吃下去后感觉呼吸困难。”
//
//狂孢毒会自然散发烟气，吸入烟气的流浪者会感到强烈的躁动感，促使大脑分泌多巴胺。其初步症状为：缺少理性思考；有轻飘飘的感觉；以及不正常的大量精力，吸入者一般会以跑步或其他方式消耗这种精力。后室中许多组织均会收集这种物质以作贸易或娱乐用。一磅狂孢毒的平均售价为一升杏仁水左右。
//
//行途：
//行途 为一条笔直的一码宽道路，由木板建成，木板已经老化磨损。在行途上行走时流浪者有几率发现有毒腐烂的木头，这一般是死亡飞蛾所致。行途估计约有10英里长，会对流浪者产生特殊效果：流浪者离行途越近，其周围雾的厚度越低，能见度越高。
//
//大多数流浪者来到 Level 309 时会处于行途的起点。想尽快安全地离开层级的流浪者应尽量保持走在行途上。否则他们会来到层级内其他更为危险的地区。
//
//在行途的中点之后，整条行途变得不稳定，走在其上的流浪者随时都有突然切出的可能。流浪者传送到的层级取决于其在行途中点之后行走的路程。2然而，在行途旁边而非在其上行走便能防止突然切出。
//
//实体
//死亡飞蛾在 Level 309 较为常见，一般位于行途旁边以看清楚周围。进入大雾中的死亡飞蛾可能会成为潜伏其中的实体易得的猎物或棘手的目标，具体取决于死亡飞蛾的性别。对于流浪者和捕食者的好消息是，雌性死亡飞蛾相对较少，而且数量也在减少。流浪者可使用 Level 309 内的蘑菇驯服雄性死亡飞蛾，但这么做大多只是浪费资源。
//
//另一种在层级内找到的实体是猎犬。 Level 309 内的猎犬已经演化出了使用红外线以相对容易地透过大雾看周围的能力。 此外，层级内的猎犬也与普通猎犬极为不同。它们以2~4只为一组伏击没有防备的猎物，通常是流浪者或走失的死亡飞蛾。已经有大量流浪者被猎犬伏击时过度惊吓无法及时作出反应而受伤甚至死亡。
//
//为了避免伏击，建议流浪者手中持武器以表现出自己很健壮，这通常能恐吓猎犬，减少它们发起攻击的可能性。此外，在伏击前看见一只猎犬就足以让一整队猎犬撤退。若流浪者已经遭受了猎犬的攻击且没有逃生措施，建议使用钝器攻击猎犬脆弱的皮肤。
//
//菌体人：
//在 Level 309 中也发现了菌体人，为外形像蘑菇的类人生物，在层级内形成了最初的文明。
//
//菌体人与 Level 309 内的发光蘑菇以及狂孢菌外形（可能生理也）相同。与发光蘑菇一样，目前对这种生物的生物过程几乎不了解。菌体人会发出微弱的光，且能随自己的意愿改变光的颜色。调查表明这是菌体人向同伴交流的一种方式。菌体人的语言很难翻译，目前只翻译出一些词语。例如，在菌体人安全健康时会闪绿色的光，而在生气或感觉到有危险靠近时会闪红色的光。总体上来说，菌体人除了在受到攻击或捕猎猎犬外均不会表现出敌意。
//
//菌体人 身高约为2英尺，重约30~40磅。菌体人是一种杂食动物，主要以猎犬肉以及 Level 309 内的发光蘑菇为食。菌体人相对脆弱而寿命较短，因此它们团队行动，制造工具以捕猎或保护自身。
//
//菌体人已经会利用它们与狂孢菌相似的生物学特征。有报告称见到菌体人使用木制刀片割下自身的一部分并用火烤制。得到的狂孢毒被卷成一个球，外部裹叶片，与矛相接。在进行反击时，1~2只菌体人会使用矛攻击敌人，使得敌人在接下来的几分钟内发生摄入狂孢毒的一系列反应，以让其他同伴更快速的杀死并处理对手。
//
//Tools
//菌体人使用的各种各样的武器。
//
//菌体文明
//菌体人在 Level 309 中雾最浓的地方构建社区，流浪者距离行途越远，可能发现的社区就越多。 一菌体文明通常为许多小村落以及一首都的组合，村落分布于首都方圆两英里以内，但也发现了非常文明，例如拥有多个首都或只有一个村落。
//
//村落中一般居住8~12只菌体人，每两只共用一座房子。其他的房子一般为工作用或学校。每一个居民都有不同的工作以确保社区能维持。居民的工作有：捕猎，收集材料，以及制造武器和工具。每个村落也有一外交官，定期将村落的一部分资源送往首都。
//
//菌体人无性生殖，且大约每几个月交配一次。新生儿在一岁之前一直待在房子里并被喂食。一岁后，这些新生儿可能会随着物资送往首都，或者如果村落维生困难会直接加入村落工作。
//
//村落居民一般对流浪者无感。若流浪者相对富裕，居民可能会给予少量食物。然而，流浪者与菌体人同住的时间越长，菌体人就越对流浪者感到厌恶。在大约一周后它们会对流浪者表现出极大的敌意，直到他们离开为止。
//
//首都有约25~50只居民居住，有巨大的石制建筑，一个建筑可以容纳许多居民居住。由于诸多村落都会送予食物，住在首都的菌体人并不需要工作很久，过着更为轻松愉快的生活。它们的自负使得首都的建筑以及装饰更加华丽。
//
//在建筑中能找到菌体人所谓的信仰之‘神’或‘王’的画作。这些画作都描述了一只高大的菌体人，外观类似一猴头菇3。王手持一木制长毛，在画中经常为举矛刺杀黑色而无法辨认的类似植物的生物。
//
//城市内也有为王所建造的神庙，神庙内有一生长异常高的蘑菇，周围有一圈小鹅卵石。在此的菌体人有时会坐下并快速改变颜色，推测为表现出对王的祭拜。
//
//基地，前哨和社区：
//除了大量的菌体人村落和城市之外，Level 309 还有两个值得一提的驻扎基地。
//
//Asset 309 狂孢毒提取基地
//由 B.N.T.G 建造的基地。该基地建立的主要目的是提取狂孢毒，通过行途送至 工作室 EL3A。
//基地有18名成员，希望雇佣流浪者，回报为 B.N.T.G. 点数或者其他形式的补偿。
//U.E.C. 实验基地
//由 U.E.C. 建造的基地，主要目的为研究狂孢毒在进攻时的用途。
//该基地戒备森严，不允许任何非 U.E.C. 成员进入基地，对基地的其他信息了解较少。
//许多菌体人村落和城镇
//入口与出口：
//入口
//长时间待在 Level 9 的森林里会传送至 Level 309。
//若流浪者找到成片紧密生长的发光蘑菇，碰触它们即会将流浪者传送至 Level 309。这些发光蘑菇在许多层级都能发现，最常可以发现于 Level 4 ，Level 37 和 Level 47。
//出口：
//在行途上一直行走可以传送至不同层级，具体取决于流浪者传送时距离行途起点的距离。
//
//行走半英里可能会将流浪者传送至 Level 46。
//行走一英里以上会将流浪者传送至 Level 10。
//行走三英里以上会将流浪者传送至 Level 2。值得注意的是，以此方法切入 Level 2 的流浪者会发现自己距离工作室 EL3A 仅有几步路。
//行走五英里以上会将流浪者传送至 Level 474。
//有一些途旁树木可能在其旁边有向上的指示牌。攀爬这棵树就会将流浪者传送至 Level 39 的一棵树上。
//Footnotes
//1. 以前厅时间（24小时）为计时。
//2. 更多信息见“出口”处。
//3. 猴头菇是存在于前厅的一可食用菌种，由于其出色的烹饪用途以及在木地板上出现的特点而知名。
package lvls3x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl309{}