//Level 365
// 
//
//生存难度：
//等级 3
//
// 
// 
// 
//2bb7a7ab8bab4f86.jpeg
//哪都不去的电梯
//M.E.G.档案库
//
//"令人作呕的油漆和工业清洁剂的气味在空气中弥漫，即使闭上眼睛也无济于事。不过，这也糟糕不过被监视的恐惧。狭窄的走廊中，两面落地镜面对面摆放，制造出成千上万个你的倒影所构成的无限循环。突然，你的一个倒影自己转向另一个方向，离开了。欢迎来到Level 365。"
//- - 安妮·邓恩，超自然现象研究学者
//
//描述
//Level 365 是一个由走廊所组成的复杂迷宫，这里没有房间，只有镜子。镜子安装在这些走廊左边，右边或两边的墙壁上。耀眼的手电筒光束照进布满镜子的黑暗走廊，变为了无色的万花筒。有些镜子如哈哈镜一般将你所看到的事物尽数扭曲。
//
//另外的镜子完全黑暗而不透明；它们被称为“夜镜”。一开始，有人犹豫是否将它们称作镜子，在此之前，将其如此分类也曾多次引发争议。但其实它们所反射出的倒影更多的是隐喻性而非实质上的。曾长时间凝视它们的流浪者报告称，此行为会使他们产生一些与自己有关的神秘噩梦，并且，这些噩梦中有许多都以某种方式从本质上预言了未来。不是所有凝视深渊的人都毫发无伤。
//
//为了进一步解释Level 365的物理性质，迷宫被指出完全符合欧几里得物理且其布局结构没有出现过任何重大变化。墙上的白色油漆总是清爽干燥的。地板似乎是瓷砖地板和油毡地板的混合。层级内的门只会通向其他的走廊和镜子。层级内还有哪都不去的电梯。一切都如此完美无暇。
//
//两个实体已被记录：大量的悲尸与稀少的恐惧蜈蚣
//
//关于第三个实体：盲知的超自然现象的研究正在继续进行。此实体似乎只存在于此层级。 他们居住于镜内或超出镜子的一个领域。这些镜内智能从本质上来讲是虚无的，它们以负面情绪为食。在流浪者意识到镜子里的映像有不同行为的那一刻，它们会与被捕食者发生心灵感应。
//
//盲知没有视觉。他们“看”食物源思想的途径是与其产生的心灵感应。它们通过“看”消极情绪来食用它们。
//
//盲知会快速释放有寄生性的精神附着以抓住流浪者。这种伤害无法使用消毒剂或绷带应对；它是一种邪恶的控制机制，将会影响身体、精神和情绪的健康。在其影响下，流浪者会感觉镜子里的倒影变得更加隐秘，并且出现令其极度恐惧的幻觉。
//
//这种精神植入会令人感到厄运将至并陷入绝望。盲知 将这些形而上学的物体在人类的以太体或能量体中实物化以加速对其的伤害。植入物延长并放大了负面情绪，使食物源变得恐惧而温顺。
//
//盲知是此层级存在大量悲尸的原因。
//
//随着流浪者变得虚弱，盲知的能量将上升。最终，它将充满能量，并拥有穿过镜子在后室中现形的能力。据目击者称，这种缓慢飞行的捕食者就像一只水母。盲知只能穿过镜子而不能穿过任何墙或门。就像离开水的鱼，它在镜外的时间是有限的。
//
//重要提醒：饮用杏仁水，不要向恐惧和负面情绪屈服。请不要凝视此层级的任何镜子而是触摸它们。如果其中有能带你离开迷宫的镜子，你就可以快速地切出此层级。每个电梯都可以进入，你可以在里面休息并搜寻物资、信息与地图
//
//基地、前哨和社区
//该层级没有已知的基地、前哨或社区。不过M.E.G.的“镜子”小队正在尽可能多的电梯里储存杏仁水、不易腐烂的食品、信息和地图。他们时刻注意着有无需要帮助的流浪者。
//
//致相关人士：
//我叫安妮·邓恩。
//
//我是一艘穿越百慕大三角的超自然主题游轮的主讲人。讲座的题目是“超自然现象的统一理论”。我当时在我大西洋上的小木屋里正要涂口红。突然，我一个趔趄，向前跌去。我伸出右手防止自己摔倒，但我伸出的手臂穿过了镜子。
//
//没有疼痛也没有流血。我猛地把手缩回去，不知道接下来会发生什么。这面镜子完好无损。我也没有撕裂伤。好奇心驱使我将手指插进了玻璃并将它安全地伸了回来。我了晕过去，醒来时发现自己在一个满是镜子的大厅里。M.E.G.的一个好心人找到了我。
//
//他们告诉我这里是“后室”。
//
//他们还告诉我，没有回家的方法。
//
//我被警告不要参加这次调查。一个匿名的电话威胁称，如果我不立即停止调查并毁掉我所有的研究，就会让我承受可怕的后果。我记得我嘲笑过他。我记得他的笑声。
//
//由于我在心理治疗方面的训练，我现在与M.E.G.“镜子”小队一同在此层级工作，以将流浪者从精神附着和邪恶的植入物中解放出来。许多流浪者被感染了却不知道。
//
//你的研究人员
//安妮·邓恩
//
//活下来！使用电梯
//电梯是Level 365唯一的避难所，因为里面没有镜子。并且，流浪者在电梯中不会产生幻觉。通常电梯内还会有杏仁水和营养品以及信息与地图。你可以在此处休息并恢复体力。
//
//虽然电梯内有按钮，但它们不会去任何地方。每个电梯里都有两个按钮。这对按钮并不选择楼层，而是通过它们来做出选择。一对按钮上的选择可能为“生”和“死”或“危险”和“安全”。有几对看起来很蠢，像“里”和“外”，“冷”和“热”。这些按钮实际上做的就是打开电梯门。按下这些按钮不会有相应的结果；此层级似乎在用它们来操纵和恐吓无知的流浪者。
//
//托马斯·奥利弗·格里尔
//M.E.G.“镜子”小队
//
//警告！警告！警告！
//这是一条优先级最高的消息。
//
//据证实，盲知与恐惧蜈蚣现在为互惠互利的物种。视频显示，一群盲知将一名不知所措的流浪者引导进了等待中的恐惧蜈蚣的怀抱。毫无道理的是，恐惧蜈蚣在死胡同里站定位置仅仅是为了突然冲出以完美拦截一个逃跑的流浪者。
//
//这种互惠关系的结果过于可怕，在这里不做详细描述。在尖叫声中，M.E.G.“镜子”小队的四名成员发现了一名被恐惧蜈蚣抓住的残疾流浪者，盲知按照邪恶折磨的节奏闪烁着。如果有个别食物跑得太远太快，恐惧蜈蚣就会停下来让盲知去抓住他。这使得食物完全没有生还的希望。
//
//这种食肉动物之间的互惠关系是站不住脚的！
//
//托马斯·奥利弗·格里尔
//M.E.G.“镜子”小队
//
//入口与出口
//在当前情况下，切出似乎是进入和离开此层级的唯一方法。 你可能会发现一面独特的镜子，它的形状或颜色大概会明显与此处的其他镜子不同。这面镜子在后室的其他层级有一个双胞胎，这对双胞胎能够作为这两个层级之间的传送门。
//
//入口
//M.E.G.保护着两个可以切入Level 365的镜子。在后室中，于正确时间触摸任意的镜子将会切入此层级。能切入的时间是随机的。
//
//有一个特殊的案例，超自然现象研究学者安妮·邓恩直接从前厅切入Level 365。
//
//出口
//触碰此层级中的一个镜子可能会切入 Level 1。能切入的镜子是随机的。
//
//有些镜子为液态而非固态。穿过这些镜子会将流浪者传送到Level -3
package lvls3x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl365{}