//Level 370
//
//
//
//
//
//
//你逐渐感到平静。
//
//
//
// 
//
//生存难度：
//
//等级 0
//
//安全
//不稳定
//实体绝迹
//Poolrooms-1.jpg
//一张Level 370的照片。
//
//描述
//Level 370由无数广阔的房间与走廊相连而成，整个层级中均流淌着微波起伏的温水。该层级内的每个区域都有着截然不同的尺寸与结构：一些较小的房间构造简单，设计平滑整洁；而其他房间则呈现出了怪诞的结构，要么缺乏明确的设计理念，要么宽阔无比。然而，在“异常”这一点上，每一个房间都是相同的。该层级内的墙壁、天花板与地面皆铺有相同的白色瓷砖，除此之外再没有任何其他颜色；唯一的例外就是水体呈现出的蓝绿色调。所有瓷砖都诡异地光洁如新，每一块都毫无区别，闪亮的瓷面上没有哪怕一条裂纹。所有破坏这些瓷砖的尝试最终都证明，它们几乎坚不可摧；因此，以现有的技术，不可能通过钻开墙面来快捷地穿过该层级。
//
//Level 370的建筑结构多变，但却自有章法，使得其在混乱之中又表现出某种秩序。该层级内的不同区域之间以平滑的过渡相连，缺乏显著的可识别性。尽管不同区域的作用难以确认，但显然，它们远大于标准尺寸的建筑规格绝非是普通泳池所需要的。Level 370内部异常的几何构造使得它难以拥有任何所谓的“作用”：在某些区域，会有柱子从水下伸出，其数量之多难以统计；而在更开阔的区域，则缺乏供人驻足的平台。光线从不规律的角度射入，随意地切割着空间，导致某些区域完全处于黑暗之中。有一些阶梯径直通向水底，似乎暗示着本层级曾一度未被淹没。通往水底深处的入口通常表现为螺旋阶梯、或是水下深井。强烈不建议任何流浪者尝试探索深水，微弱的照明条件与尚不清晰的环境性质都将带来难以避免的风险。倘若未佩戴相应装备，流浪者在该层级的深水中很容易迷失、甚至溺死。有许多理论和猜想试图解释这些古怪结构存在的原因，但没有一个能够自圆其说。目前为止，没有人能够说明为何该层级内的建筑风格如此混乱，也无人清楚这些房间为何会被这样设计。
//
//Poolrooms-3.jpg
//Level 370的另一张照片。
//
//研究表明，Level 370的水体中存在泻盐（硫酸镁）的痕迹。当人体长期暴露于这种化合物时，会感到自然的放松感，包括肌肉的舒张与身体疼痛的减缓。除此以外，水体内还发现了数种未知的化合物。直到本档案撰写之时，研究者们依旧未能查明这些物质的来源与特性，但鉴于它们与上述的泻盐一同出现，可以推测这些物质皆可通过某种异常方法增强水体的放松效果。
//
//有趣的是，整个Level 370内的液体表面均荡漾着轻微而永不停歇的涟漪，但却无法找到它们出现的原因。这些涟漪可能是从该层级内的某一点发出的，也可能是水体自身的特性——现有的理论提出，由于层级的规模过于庞大，其内部很可能存在着自己的潮汐力。这是在后室的其他层级中从未出现过的现象。值得注意的是，水体的温度恒定在不冷不热的程度，即使在光线无法触及的黑暗角落也是如此。
//
//Level 370中的声音会受到严重的干扰。例如，层级内部的环境噪音突然减小，水波不再发出应有的荡漾声，且人声也受到了“消音”，变得“十分沉闷”。据推测，这一异常很有可能是水声导致的。该层级内部的水声表现得极不寻常。在大部分探索中，流浪者都报告称这里的水波安静祥和，几乎能使人感到镇静；而在少数报告中，水声会突然变大，并淹没其他声音。出现这一效应的原因目前仍在调查中，但是至今为止都未取得可靠的结论。
//
//Poolrooms-2.jpg
//水波在走廊中荡漾。
//
//实体
//Level 370中似乎完全缺乏生命迹象。在该层级中，没有任何人报告称遇到了实体或其他流浪者；这有可能是因为Level 370中存在着一种未知的隔离属性，也有可能是因为该层级庞大得难以想象，导致两个生物在其内几乎不可能相遇。直到取得更多发现之前，该层级都将被划分为生命绝迹的区域。
//
//基地、前哨与社区
//该层级缺乏建立哨点的必要、存在可能的隔离属性，且其地形也难以建造长期的聚居点，因此Level 370中并不存在任何前哨站。且该层级的规模过于巨大，又难以维持生命，导致这里没有愿意搭设永久性居所的居民。此外，该层级内部的声音异常也会使建立社区十分困难。
//
//附加信息
//据信，以下文本应为某个未知流浪者的日记，现已逐字转录。这段文本在流浪者之间广为流传，尤其是在那些以自由奔放著称的探索团体中：他们用这段文本抒发探索后室异常的欲望。因其知名度较高，现将之收录入档案中。
//
//笔记复原：
//
//我的冥思
//
//在这场无穷无尽的探索之旅中，我走过了数不胜数的地方。而现在，我似乎终于抵达了一处孤僻之所。无尽的厅室、昏暗的长廊、空旷的建筑……这些我早就习以为常。然而，在这里，我在混沌与迷惘的风暴中发现了第一处落脚点——一片宁静之所，我终于能够在此歇息一会儿。我从未见过这般的建筑：明亮的房间，湛蓝的水池，轻柔地像是拥抱一般环绕在我的身边。墙上、地上，铺满了洁白的瓷砖。光线在其间折射，使得每一个角落都能够被光辉触及。
//
//这些地方并不像现实一般界限分明——它们都是某人精神的宏观体现，是他们情绪的倒影；它们扭曲着、拙劣地模仿着现实，但其实不过是某个人意识中对现实概念的延伸，不过是在日复一日平凡生活中绝不会被提及的妄想。深入妄想，正如同游历梦境。我还不知道这里的探索是否永无止境，但我相信这些地方都是经历过它们之人脑中自成的臆念，正是他们的情感维持着这些空间的存在——情绪、思维，便是这方世界滋生、稳固的力量源泉。除了我们的想象，再也没有什么地方能出现这样的建筑；这正是为何穿梭其间时，我们总能感受到无边的孤独。它们是创造者抛诸脑后的遐想，无比熟悉，但又无比陌生。
//
//我决定称它们为“景”。泡影般的世界接连划过，我沿着序列在其中穿行，如同是一场梦幻的旅程。只要做好了准备、放平了心态，任谁都能轻易退出这场旅程；然而想要沉浸其中却绝非易事，尤其是当你身处循环的回廊与破旧的办公室，却又不得不在荒谬的几何结构之间夺命狂奔之时。在忘却逻辑、拥抱异常之后，这些地方便成为了你的一切。那些你从未想象过的空间，如今却成为了你全部的现实——很讽刺，不是吗？然而就算你真正适应了生活其中，它们也终有一天会展现出光怪陆离、让你熟悉得作呕的一面，褪下梦境的伪装，露出梦魇的真容。我承认这里很危险——无论如何，我都曾直面过这些危险——也承认，它们比起幻梦倒更像是梦魇；但是，这却只能让我感到更加兴奋。每一个“景”都有可能成为我的终点。这样的想法并没有使我畏惧，比起警告它反而更像是一种鼓励；在我头顶上高悬终有一日要降临的劫难就随它去吧，我只会面带微笑脚步轻盈地体验每一次旅程。也许我永远也不会在这场漫长的旅途中取得胜利，但只要我到死仍在走向未知，那么在弥留之际我就只会因这艰苦之旅的结束心满意足。
//
//我偏题了。简而言之，这片“景”真正地折服了我。这里的特殊效应简直引人入胜；当有些人沉浸于此享受平静与祥和之时，其他人却无时无刻不恐惧着自己被下一个转角淹没。“那里藏着什么？”他们也许会这样想，“是一片荒芜，还是一份恶意？”也许一位探索者会在此踌躇不前，但另一位却感到了宁静悠远。每个个体之间的差异，这对我而言一直都是一个令人迷恋的论题。这片“景”中，既无瑕疵，也无缺憾。“泳池房”只是在展示它那惊人的美——错综复杂的设计，一片没有尽头的图卷，但其中的每块拼图却又各有韵味——难以言说的奇异，难以言说的完美。鬼斧神工。
//
//入口与出口
//Poolrooms-4.jpg
//光线渗入了黑暗的角落。
//
//入口
//沉没在Level 58或Level 119的水中，有可能会使人出现在该层级；
//Level 233中铺有瓷砖的区域有小概率通往该层级；
//在少数情况下，Level 130的水下区域可以成为该层级的入口。
//出口
//浸入Level 370的水中可能会使人进入Level 130内的泳池；
//该层级内封闭、阴暗的隧道可能通往Level 43；
//Level 370的走廊有小概率连接到Level 233中相同的走廊。
package lvls3x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl370{}