//bHZsMzUy: 所言即咎
//Class: 变量	暂未确定安全程度	实体变量
//↓351	↑353
//描述：
//Cityvarasto_Jyv%C3%A4skyl%C3%A4_pienvarasto.jpg
//bHZsMzUy中的存储单元
//
//1998年9月25日，bHZsMzUy被发现了。它是一系列随机生成的储存间，没有确定的大小。bHZsMzUy整个层级就是由走廊和两边的储存间所组成，而且储存间被编上了伪随机的序号。除了一些丁字路口对面的门和在储存间门边的小垃圾箱外，bHZsMzUy中完全没有可以定向的标识。 bHZsMzUy为一列列存储单元旁的荧光灯所照亮，或者也有些荧光灯位于层级的墙上。
//
//在bHZsMzUy的储存间中，塞满各种纸箱和塑料箱。箱子里，装着一些引起回忆的物件，比如一些破旧掉毛的毛绒玩具、各种被撕毁的照片，照片上的内容是访问者的家人。但是，据报告，在这一堆堆旧物件中，肢团可能会塞在物件的下面，来伏击那些正将物件一件件拿开的人，也就是肢团的猎物。
//
//bHZsMzUy产生的最大危险，是它的独特侵入性性质：某一个人说出或者记录下这个层级的编号时，周围91米为半径的区域都会被这个层级所取代。语言触发的效果不会持续，这个层级会消失；然而，从记录文本所触发性质后，直到这个文本被摧毁或删除前，这个侵入效果都会存在。所有拉丁字母表文字，即使有一定变体，均会触发这个性质，如法、西、波、英语，甚至越南语。bHZsMzUy也会识别一些其他语言，如西里尔、希腊、阿拉伯文字。
//
//异常的是，bHZsMzUy不能识别写成64进制、16进制数等的层级编号，虽然它们也是用了拉丁字母来描述。目前，我们正在想尽办法宣传，使流浪者用bHZsMzUy1来代替它原本的层级编号，由此控制bHZsMzUy。
//
//如前所述，bHZsMzUy只存在一种原生实体：肢团。它们藏在储存间的箱子下面。但当bHZsMzUy对任何一个层级开始侵入，所有原层级的流浪者、实体、物品都会转移到bHZsMzUy内，因此这将决定bHZsMzUy的生存难度和实体数目。Level 0、Level 1、Level 4、Level 11与Level 61易受bHZsMzUy影响，但其他层级的实体也存在于bHZsMzUy内。
//
//History:
//Self_Storage_Flexbox_Hinged_Door.jpg
//bHZsMzUy拍摄的第一张图片。
//
//1998年9月25日，两个流浪者正流浪于Level 2的无人地区。他们专注地交谈着，交谈后室数据库中一个明显的缺陷：所有在层级bHZsMzUy皆已经被编号，唯独这个层级没有。
//
//当bHZsMzUy的数字被说出时，层级立即侵入，在两位流浪者周围展开了它的走廊与储存间，也使流浪者被突然惊吓。记录显示，一个储存间就正好落在一位流浪者前方，于是这位流浪者挤坏了储存间门的结构，他脖子、左臂和右腿的位置留下了门上一个个大洞。在bHZsMzUy被发现时，层级只有简单的一个区域，所以离开层级易如反掌。
//
//流浪者离开层级之后，他们将一张层级的照片与这一段文字一起发送：
//
//“这是什么层级？我就说了一句数据库里缺了[根据协议，此段内容编辑]，然后它就出现在我面前了。”.
//
//流浪者开始讨论bHZsMzUy加入数据库的可能性，这使bHZsMzUy又分别在流浪者与档案管理员Alexandar Bates的电脑边出现，由此层级也侵入了Level 4。
//
//1998年10月2日，M.E.G.监督员A被告知这些信息，他将bHZsMzUy的行为有关信息公布。为了不使层级侵入更多其他层级，监督员A决定用摩斯电码来代替层级名称。从bHZsMzUy出现侵入次数的下降来看，这种政策有所收获。
//
//关于bHZsMzUy层级侵入触发条件的实验被表决通过。实验在2000年1月1日的下午六点开始。在废墟之路的外侧，我们设置了一个显示器，来播放bHZsMzUy的不同名称。
//
//下为实验结果的记录表格。
//
//特定文字：	影响 (影响半径):
//英语名称	立即侵入(91m)
//英语名称缩写	立即侵入(91m)
//层级编号与有关的上文语境	一段时间后层级侵入(91m)
//层级编号与无关的上文语境	无确认影响(0m)
//单独层级编号	无确认影响(0m)
//俄语层级名	无确认影响(0m)
//法语层级名	一段时间后层级侵入(90m)
//越南语层级名	一段时间后层级侵入(86m)
//NATO字母2	一段时间后层级侵入(91m)
//摩斯电码	无确认影响 (0m)
//英格玛3	无确认影响 (0m)
//二进制编码	无确认影响 (0m)
//16进制编码	无确认影响 (0m)
//64进制编码	无确认影响 (0m)
//基地、前哨与社区
//截至2022年11月，没有基地存在于bHZsMzUy，因为层级受到来自不同其他层级的实体威胁，且很难寻找到其他流浪者。
//
//入口和出口
//入口：
//全部层级
//Entrance into bHZsMzUy
//可以通过说出层级名称（使用拉丁字母）进入层级。使用这种方法可以保证生成时面向三向或四向交叉路口。
//
//出口：
//Level 96
//爬进一个38*29厘米尺寸的通风口会带你到Level 96，但这个出口可能被一个钉住的通风口拦网阻挡。
//
//[显示作者与图像信息]
//Footnotes
//1. 也即它层级编号的64进制
//2. 译者注：北约在军事通信上使用的一种字母读法，如原字母"B"读为“bravo”
//3. 译者注：一种密码方式，主要是将字母沿顺序加密为密文，如A->C，同时C->E，Z->B……重复多次。
package lvls3x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl352{}