//Level 345 - “阈限森林”
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//Billboard
//阈限森林的“欢迎”广告牌
//
//阈限森林，也被称作怀旧公园与享乐地，是后室中一个存在于人类意识阈限之上的主题公园。它是一个方位，但并非空间，它可以坐落此处，也能位在他方，这座乐园于昨日与明天的间隙保持开放，想要入场是免费的。
//
//这座公园采用现收现付的收费机制。在这里，乘坐游乐设施、购买食物饮品、体验该公园众多集市风格的游戏或浏览景点，这些项目均需花费每人一张票券。票券需要花费游客的记忆购买，且它以十张为单位起售。（抽取的记忆由公园管理员酌情决定，且所有交易不可退款。）票券也可以通过多种方式赢得或挣取。
//
//阈限森林将永远心系这些票券！
//
//该层级建设在多雾的永夜环境中，这座主题公园如同一座代表着欢愉与亢奋的信标，矗立于这座无穷愁楚的森林正中。游客在最初只能只身进入森林，但随着他们的探索，其他旅者的踪迹会在眨眼间若隐若现，他们好像几乎就在你身旁，但也不尽然，嘉年华狂欢的躁动、呼喊、音乐，这些被缄默了的声音没有方向地漂浮在空气中。阈限森林中那些乐于助人的工作人员，他们的形象多是由访问者们记忆中那些活着或已经去世的人们组成的。这提醒着这些游览公园的旅客们，这些工作人员的外表或许只是欺骗性的皮囊，公园的管理员对他们的外貌如何而来也都闭口不谈。
//
//阅读“游玩评测”
//浏览你的朋友们对阈限森林的游玩评测。
//
//特色设施与景点：
//T -10
//“胡闹厕所”是阈限森林最狂野刺激的游乐设施，没有任何标记能揭示它内里的秘密，这间神秘厕所的庐山真面目在你进入里面一探究竟前，一切都不得而知，它绰号“雷霆之箱”，这间蓝色的茅房在任意人员进入其中后便会把门反锁，开始“倒计时”。十秒钟后，它将上升，上升，然后飞走！乘坐这个惊险刺激的游乐设施会给予游客10张票券的报酬。
//
//47262af67d4960c4cc8b188a8ff71769.jpg
//T -10
//
//天际过山车
//我们广负盛名的过山车不需要轨道就能运行，游客将被牢牢束缚在列车之上，翱翔云霄，进行最疯狂野蛮的特技动作。陡峭极限的下落、急转向和数个人仰马翻的倒立动作对游客来说都是不可或缺的位移，不详的天空中游曳着饥肠辘辘的飞天鲨鱼群，这些动作都是在对它们的撕咬进行着规避。
//乘坐这个刺激凶险的空中设施并最终存活会给予游客8张票券，没有次数限制。
//
//家呀我那甜蜜的家
//这是一间黑暗的“乐趣屋”，游客将在导游的带领下，穿过一条由他们已经历的过去与可能发生的未来构筑的小路，这一系列在黑暗中发出光芒的场景可能会包含痛苦的记忆、动画与被录制的对话，以及其他特别的呈现效果。完成这趟旅程将给予游客2张票券，没有次数限制。
//
//5bfbbd05ab647b7a658a6ff616e16f4b.jpg
//记忆厅室
//
//记忆厅室
//这是你用票券换取美妙回忆的地方！
//
//这里呈现的记忆比实际经历还要真实。你能随心所欲地“暂停”和“重播”每一段记忆，只要你想，你便可以在这里一遍又一遍地品味那些记忆，“再访”你记忆中的爱人与伤心地，“重温”那些尘封已久的胜利和“光辉岁月”。只要有足够的票券，你甚至能按照自己的需求去“定制”特别的、只为你创造的记忆。这些记忆属于你自己，在你丢弃它们或离开记忆厅室前都可以随意享受，没有限制。
//
//隐藏 评测
//我刚到这里的时候感觉还挺好的，整个公园都属于我一个人，所有设施！所有吃的！所有游戏！全是我哒！接着，我开始感到孤独，周围的一切好像都变得诡异起来了，太可怕了！有什么不对劲，放我出去！
//…Tim R.
//
//这里绝对不仅仅是游乐设施、游戏与食物，有什么不对劲的正在发生。虽然我们只会形单影只地出现在这里，但我有种感觉，好像有成百上千的我们在同时在此地存在，在这个维度里。好像有什么东西正在研究着我们，蚕食着我们的记忆。我们在这里就是一群小白鼠啊！
//…Dr. John R.
//
//“忧郁的旋转木马”真是我的意难平（1）旋转、哭泣，如此悲伤的音乐，浑身黑色、披挂阴影的朦胧马匹…
//…Michael W.
//
//我要对记忆厅室上瘾辣！
//…Jill N.
//
//这地方可真有意思嘿！我等不及换更多票了。
//…Robert G.
//
//甜蜜之家和天际过山车都写着“没有次数限制”，当看到这个的时候我直接：“不是吧！”这俩玩意我哪个也不想再玩一次了！
//…Tom D.
//
//这是一个地方之间的地方。
//…Gretchen G.
//
//它们在收割我们的记忆！
//…匿名
//
//体验所有设施来获得在阈限森林中的最佳体验！
//
//食品：
//阈限森林的食品摊位出售各种各样的美食饮料。与前厅的食物类似，它们提供像棉花糖、椒盐卷饼、漏斗蛋糕和炸薯条这样的零食。正餐包括披萨和热狗，饮品则有“可乐”和香味气泡“水”可供选择。
//
//隐藏评测
//你好奇里面掺了什么吗？我好奇里面掺了什么！
//…Karen K.
//
//这里的吃的好吃死我了！披萨真是绝绝子！
//…"Wild Bill" G.
//
//我对这里食物的打分…
//（评分从1到10）:
//棉花糖 - 10；太好吃辣！
//椒盐卷饼 - 6；需要点起司酱来蘸。
//漏斗蛋糕 - 8；美味。
//炸薯条 - 9；需要点起司酱来蘸。
//披萨 - 10
//热狗 - 4；太老了。
//可乐 - 3
//气泡水 - 8；樱桃味10分。
//…Roger T.
//
//尝遍所有美食来获得在阈限森林中的最佳体验！
//
//特色项目：
//转转乐
//该轮盘被分为几个面积相等的区域，落定的区域决定着你能赢得的票券。轮盘由工作人员进行旋转且由一枚指针决定你赢得的票券。有些区域是没有票券的，大多游客只能通过转一赢一的结果达到收支平衡，运气好点的少数人能赢5张、10张或20张票，此外轮盘还有两个区域能够赢得50张票。没有次数限制。
//
//猜·体·重·
//
//后室别的地方可没有玩得这么大的重量级景点！如果工作人员没办法准确地猜出你的体重，你将会获得一个回到前厅的机会，地点任你选择。每次来访限玩1次。
//
//隐藏 评测
//猜·体·重·有黑幕！我就算浑身湿透也才重110磅，他们却说我有358磅！我当时还觉着“我去，我能够回到前厅去啦！好耶！” 怀着这样的心情站上了秤，然后我的身体突然跟发疯似地猛猛膨胀起来——我358磅的体重足足过了两个小时才复原回去。
//…Sandra P.
//
//转轮游戏的赔率并不高，但有时我也能幸运起来。这儿的食物不错！不过我还没找到出口呢，倒是，感觉还挺孤独的。
//…Tammy V.
//
//游玩所有游戏来获得在阈限森林中的最佳体验
//
//基地、前哨与社区
//该层级没有基地、前哨或社区建立。
//
//入口与出口
//入口
//在你听到嘉年华风格的欢乐音乐时，触摸Level 365的一面扭曲的哈哈镜会使你切出到这里。
//
//所有有关嘉年华或游乐园的照片、图画甚至是交流都会导致前往该层级的切出。这一效果并没有你想得那么随机。
//
//犹豫和绝望的情绪会帮助它们找到你，并将你传送到该层级。
//
//出口
//在猜·体·重·中获胜会赢得前往前厅的出口（？）。
//
//被飞天鲨鱼群吞噬会将你送到你意愿的层级，该效果是随机触发的。
//
//在游戏中作弊或在游乐场表现出破坏行为会将你传送到Level 148。
//
//当你在“阈限森林”玩累了时，只需要和一位我们友好的工作人员简单示意，他便会带你切出到一个安全的层级。
//
//作者
//« Level 344 | Level 345 | Level 346 »
//
//Footnotes
//1. 译注原文为downfall。
package lvls3x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl345{}