//Level 322
//~ Level 322 - 不可辨认的图案 ~
// 
//
//生存难度：
//等级 4E - 环境
//
//不安全
//不稳定
//非实体危害
//~ 描述 ~
//glitch2.jpg
//Level 322 内一面墙。
//
//Level 322 由未知数量的相互间隔的房间与走廊组成，与Level 0较为相似。两层级的建筑布局类似，但不同之处在于Level 322 并非线性空间。1 就像Level 0一样，Level 322 的房间或走廊内完全不存在物品或实体。但两层级仍明显存在差异。其中一条差异便是Level 322 的墙壁与天花板，（偶尔也会有长一点的走廊）均着不同的颜色。该层级走廊的平均长度为 2 公里（1.2 英里）。Level 322 的地板可能由大理石构成，但地板一直为乌黑色，不会改变颜色。
//
//Level 322 的墙有 13.5米（44.3英尺）高。M.E.G. 的深入调查表明这些墙壁由钢筋框架组成。这些框架用以支撑上千更小的体积不同的几何形体。这些几何体完全由LED灯组成，这些灯每半秒改变一次颜色，使得任何时候任一几何体的颜色均随机。这种无休止的颜色改变尚不知其原因及能量源头。框架内也拥有内置的步进电动机，让墙壁随机向前，后或左右方向移动。这些几何形体的颜色会组成具有数百种颜色的3D像素图案。这些图案会造成视觉暂留并显现类似“数据崩溃”的效果。在层级内的天花板上也能看见这些装置，这些奇怪的装置的来源完全未知。
//
//~ 附录 ~
//Level 322 内完全实体绝迹。但这并不意味着该层级完全安全。前文提到的墙壁内的灯能组合出完全不可辨认的混乱形状，并且颜色会快速变化闪烁。这可能会导致流浪者突发癫痫。若流浪者在 Level 322 内停留过长时间，其行为将会变得奇怪，伴随有说话含糊不清以及智力降低的症状。此类症状被认为是一种疾病的征兆，被称为“色崩疾病（Mosh Infection , M.I.）”。流浪者感染这种病症的过程仍未探究完全，但已知的症状如下：
//
//进入后 3-5 小时：
//在进入 Level 322 后的3到5小时间，进入层级受到影响的流浪者将会感觉失去方向感。他们会对自己的身份产生疑惑，并开始表现出智力降低的症状。他们的性格以及状态也会发生较小的变化。例如，若被影响的流浪者一开始处于积极状态，该流浪者将会转变为悲伤或易怒的状态。
//
//进入后 5-12 小时：
//在进入后5到12小时，被影响的流浪者将会说出明显无法理解的语言，除无法正常拼读词汇外其说话也会无法听清。此时的流浪者的性格已经发生了很大的变化。
//
//进入后 12-36 小时：
//在进入后12至36小时，流浪者将会感到严重的头痛。其肤色将会变白，并有可能会晕倒。此时流浪者也开始产生认知障碍。
//
//进入36小时或更久：
//在进入 Level 322 36小时或更久时，被影响的流浪者会有可能因为墙上闪烁的灯光而癫痫发作。流浪者也会表现出明显不正常的行为。此时的流浪者已经感染了色崩疾病。
//
//对于可能感染色崩疾病的流浪者的提醒：
//一名流浪者不会将色崩疾病传给另一名流浪者。
//无法承受颜色快速闪烁或物体快速移动的流浪者不应进入 Level 322.
//若您进入此层级，请盯着地面。
//若您携带了任何形式的面部遮盖物，请在看见移动的物体或闪烁的颜色时将它们盖在脸上。
//在 Level 322 内尽可能闭上眼睛。
//在2019年6月24日，多名 M.E.G. 工作人员，维洛卡农民2 以及 B.N.T.G. 的合作研究发现，杏仁水，半块皇家口粮，维洛卡果汁，以及化掉的油腻棉花糖的混合物能很好地治愈色崩疾病。这种液体目前在Level 0，Level 1，Level 4，Level 6.1，Level 11，Level 36和Level 109的饮料贩卖机内出售。该物品被 M.E.G. 编号为 MEG-OOI-00223
//
//隐藏 MEG-OOI-0022 的制作方法：
//MEG-OOI-0022 制作配方
//原料：
//
//半块皇家口粮
//150ml 维洛卡果汁
//100ml 融化的油腻棉花糖
//上述原料能制作300ml MEG-OOI-0022。
//
//制作方法：
//1. 将 150ml 维洛卡果汁倒入搅拌机。
//2. 将 100ml 融化的油腻棉花糖倒入搅拌机。
//3. 将皇家口粮切成十小块并与液体混合。
//4. 搅拌混合物直到固体完全溶解。可以任意添加更多量或较少量油腻棉花糖，具体取决于你对饮料浓度的要求。
//5. 推荐：在顶部添加草莓糖浆或巧克力糖浆增添美味。
//
//~ Level 322 探索记录 ~
//隐藏 322-001:
//前言： 下文为一流浪者探索 Level 322 的记录。该流浪者最终感染了色崩疾病。其名为 Luca Veneto.
//记录开始
//
//第一天 12:11
//好了，这个层级怎么看起来这么怪？我刚刚还 Level 4 里胡乱切出。
//
//第一天 12:15
//我在这个层级里呆了一会儿了，墙上好像有啥东西在动，还在变化颜色。
//
//第一天 12:22
//我现在正在透过这些东西看后面，好像有钢筋的柱子。我好像也看到了个马达。我觉得就是它们让这些东西动起来的。
//
//第一天 16:53
//我—靠—这墙怎么这么—额额。我感觉很痛苦。我来这之前还挺开心的。现在感觉这一层要把我脑子挤满了。
//
//第一天 21:19
//等等，为啥我会在这里？是我谁？啊？这是全或— 哎呀……
//
//第二天 04:13
//唔啦呜… 莪在褶儿… 采铯的墙……
//
//从此往后，Luca 开始吐字不清，并且说话不成句，智力降低。色崩疾病的初期症状开始出现。
//
//第二天 10:12
//么-么-么-么-么-么-么-么-麽… 什… 去过时多少间了？额……
//
//第二天 14:01
//啊… 头我痛… 太久待时间这里了… 去哪李李李…… 唔啦……
//
//第三天 01:12
//莪胴布廖勒… 酒峨… 勿…
//
//记录结束
//不久之后，承受了过多精神压力的 Luca 昏倒在了地板上。他现在携带着色崩疾病。他最后在 Level 109 的一张床上，完全不记得他如何来到这的。
//
//关闭 对感染了色崩的流浪者的观察记录以及对 MEG-OOI-0022 的测试：
//对 MEG-OOI-0022 的测试
//时间 06/27/2019
//相关人士：
//Valerie James - Level 109 的医生。
//Kiren Evans - Level 109 的医生。
//Luca Veneto - 感染者。
//记录开始
//
//Kiren: 好的 Luca. 你现在感觉怎么样？
//Luca: 五-五-勿-勿-屋-埃-埃-埃-和-和-和-…呣-呣-呣-呣。
//Valerie: 这感觉不是啥好事啊。他的言语已经不可分辨，智力也明显降低了。纸上说这两个都是色崩疾病的症状。
//Kiren: 所以，他语言很混乱，就应该是得了这个病了。
//Valerie: 我确定是这样。
//Kiren: 那好，我记得药房那里还有几瓶解药，应该能把病治好。我去拿。
//Valerie: 那你去吧。
//
//Valerie: Luca, 你呆在这里。Kiren 医生去给你拿解药了。你会没事的。
//Luca: 额-额-额-额-哦-哦-哦-和-和-啊-啊-好。
//五分钟后…
//Kiren: 我带着药回来了，这个就能治治他的病了。
//Valerie: 谢谢，Kiren.
//Valerie: Luca，坐着别动。我们给你喝点药。
//Luca: 啊啊啊啊啊啊好好好……
//Luca 喝了 MEG-OOI-0022 液体。
//Luca 大声尖叫。
//Kiren: 哦不…
//Valerie: 给他点时间，他会缓过来的。
//Kiren: 好吧。
//十分钟后…
//Luca: 我— 刚刚发生了什么鬼东西？我咋在医院里？哎呦。
//Valerie: 你刚得了色崩疾病，在 Level 322 里崩溃了。你不知道咋的从那一层里切出来到这一层了。我们把你抬到这房间里的。
//Kiren: 根据你之前的行为判断，你应该已经染上疾病超过36小时了。
//Luca: 好吧，但我完全不记得那件事。我只记得看见了几百个在闪烁颜色的东西，然后就不知道后面发生啥了。
//Valerie: 你现在已经安然无恙，可以离开了。
//Luca: 好的，十分感谢。
//Valerie: 不用谢。
//
//End Log
//Luca 现在已经痊愈。他从一扇门离开到了 Level 11。
//
//关闭Rachel Baker医生的来信。
//写于： 2019年7月1日。
//来自： Rachel Baker - Level 109 的医生。
//
//问好，如果有人能看见这封信的话。我是Rachel Baker 医生。我现在正在 Level 109 的药房里。现在好像有三个穿黑色西装的人从柜子上拿走 MEG-OOI-0022 。他们告诉我他们在很多层级里都设了饮料贩卖机为染上色崩疾病的人提供帮助。他们告诉我他们在医院里也放了一个贩卖机，然后还要在 Level 0, Level 1, Level 4, Level 6.1, Level 11, 和 Level 36 里再放几个。那三个人还告诉我他们往贩卖机里塞了个无限复制的机器，这样所有人都能拿到无限量的 MEG-OOI-0022 了。我觉得他们能做到无限复制这药这件事太荒唐了，我觉得他们可能是从哪个地下组织里学到的新技术。但如果这会避免更多的人得色崩疾病的话，我完全支持。
//
//~ 基地，前哨和社区 ~
//由于 Level 322 内恶劣的环境危害，无法在此层级内建立任何基地，前哨或社区。
//
//~ 入口和出口 ~
//入口
//从 Level 4 里一个绿色水冷器前的地板切出可以到达 Level 322.
//在 Level 12 里碰触一个有固定颜色的中型方块可以传送至此，但这未被证实。
//出口
//在此层级昏倒会传送至 Level 109.
//在层级内碰触任意发出任意绿色光的物体可以传送至 Level 0 或 Level 1。 由于物体会改变颜色，该方法只有在物体变为绿色时起效。
//作者
//« Level 321 | Level 322 | Level 323 »
//
//Footnotes
//1. 即有可能在 Level 322 内沿一直线行走，最终回到原处。沿着原路返回将会通过一系列来时未经过的房间。
//2. 见 Level 48 中对维洛卡农民的介绍以了解更多信息。
//3. MEG-OOI 指M.E.G. 关注的物品 (Objects Of Interest)。这些编号用来指代最近被发现或未被认证的仍未有 M.E.G. 正式编号的物品。
package lvls3x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl322{}