//Level 333
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//weirdroom.jpg
//Level 333内视图。
//
//Level 333是后室的第334层。发现于2/2/20Δ#。该层级面积相当小，仅由一间房间组成。房间通体白色，天花板上有一照明处。另有一间微型的房间位于层级中心的支架上。
//
//描述：
//Level 333表现为一间普通白色房间，中间的支架上放有一个房间的微缩模型。这个微型房间似乎是大房间的某种模型。流浪者可以看到里面有缩小版的自己和房间里其他物件。
//
//weirdminiroom.jpg
//Level 333的微型房间。
//
//所有放进微型房间的物品都会等比例放大并出现在大房间里。你也可以把自己的手伸进微型房间里，这会使你的手以放大的比例出现在大房间。这一现象能产生许多怪异效果。如将许多小型物体通过反复放进小房间里，可以将之放大，经过调整后又能放回去。
//
//我们不建议你把手伸进去，将自己抓起来。这样的话任何贸然举动都可能导致严重受伤或损害。同样，也不建议你把头伸进微型房间。
//
//目前尚不清楚该层级如此运转的成因。由于其特性，单次进入Level 333的人数不应超过4人。
//
//▶ 隐藏日志
//我最终抵达了这个……白色房间，中间又有个迷你版的房间。我看见里面有个迷你版的我正在看向更小的房间。我决定把手指伸进去看看会发生什么，然后我看到我的手指从我所在的房间墙里探出来了。我正在向自己和其他东西挥手、自娱自乐的时候，有什么东西也进入了房间，而且不是我干的。一只看起来好像是由某种黑雾组成的手，伸进了我所在的房间。它把我握住，抓了起来，这让我非常惊恐。但它没有别的举动，仅仅是……握住我。不管它是什么，它确实没有敌意。一分钟左右后，它把我放回原处，挥了挥手，然后径直穿过墙壁离开。我觉得这个房间可能是什么生物的芭比屋，而我只是它的一只玩偶。
//
//基地、社区和前哨：
//该层级没有已知的基地、社区或是前哨。
//
//入口和出口：
//入口
//通过Level 188一扇发光的白门可以抵达该层级。
//进入Level 36的任意浴室可能被传送到该层级。
//有各种上面描绘一间纯白房间的海报，上面有一只挥动的手。朝海报挥手回礼会使人员传送到Level 333。
//出口
//进入约12小时后，人员会被传送回原位。
package lvls3x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl333{}