//Level 399
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//l1Q7aTbvJzjPXgW.jpg
//Level 399的座位。
//
//Level 399是后室的第400层。该层级似乎是一个16座客车的内部空间。在很长一段时间内，Level 399的流言在流浪者中流传甚广，而它第一次被确认是在2007年4月7日，其证据是一张由未知身份的流浪者所拍摄的照片。
//
//描述
//Level 399是一个客车的内部。这部客车有着16个座位，有空调供应，在每一个座位的背面，还有着一瓶杏仁水。整个层级都能听到发动机所发出的低沉的引擎声。从地板到窗口都可以感觉到柔和的震动。在司机的座位上，会有一个名叫Richard的实体，它驾驶着这部客车。
//
//wYo2FgcbzGfV3ad.jpg
//Level 399窗口外的景象。
//
//Level 399窗口外的景象是一条高速公路，上面全都是正在前进的私家车、卡车和公交车。路的两侧是建筑物，里面还亮着灯。尽管有着通电的建筑和移动着的车辆，但你看不到任何一个实体。
//
//客车的外面还会时常下雨，同时，Level 399没有固定的日夜循环，在大多数流浪者的回忆中，层级的时间都会在傍晚以后，日落时分。
//
//尽管能够看见Level 399有着客车以外的空间，但目前没有办法离开客车，来到公路上以及外侧的建筑里。强行通过切出的方法离开客车，只会导致来到其他的层级。因此，目前该层级似乎只存在着客车内部的空间。
//
//进入到Level 399的流浪者会从座位上醒来。在大多数的报告中，流浪者在醒来时会感到舒适与平静。尽管流浪者能够从座位中起身并在层级中走动，但还是建议流浪者在座位上放松并休息，最后回到睡眠状态。值得注意的是，即使流浪者选择不入睡，但在Level 399经过很长一段清醒的时间之后，流浪者也会自动地睡去。
//
//Richard
//Richard是Level 399中的唯一的一个实体。Richard会在客车的司机座位上。Richard没有敌意，对流浪者的态度很友好。虽然它大部分时候会保持沉默，但如果有人与它搭话，它也会与人进行友好的交流。尽管Richard对后室表现出了很深的理解，但它会对关于后室的所有话题保持沉默。
//
//附录1：从2007年4月9日起，流浪者们报告说，他们现在在Level 399中醒来的时候，手里会拿着一张新添加的手写便条。便条中的内容已转录如下。
//
//你好！看到这句话的时候，你肯定已经睡醒了吧。
//不用太过于担心你现在所在的地方，我们很快就会到达你的目的地。在此期间，你可以自由地喝水，坐好并放松。如果你想的话，你也可以小睡一会。你在这里很安全。我保证。
//- Richard
//备注：我在驾驶座上！如果你有其他的要求，可以来和我聊聊。
//
//基地、前哨和社区
//目前本层级没有已知的前哨站或社区。
//
//入口与出口
//入口
//尽管未被证实，但现有的理论表明，只有当流浪者单独行动，且在层级之间做着长距离的旅行时才能来到这个层级。该层级只能够通过睡眠的方式进入。在进入Level 399后，流浪者的身体以及所带的物品都会被传送到这里。
//
//出口
//流浪者在Level 399中再次进入睡眠就可以离开那里，并在他们的目的地醒来。也可以从客车的车门切出至Level 50、Level 69和Level 80。但这种方式是非常不推荐的。
package lvls3x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl399{}