//Level 906
// 
//
//生存难度：
//等级 Blanche
//
//安全又可靠
//与危险绝缘
//很高兴见到你。
//Fold
//Table of Contents
//描 述：
//实体
//值得注意的区域：
//基地, 社区和前哨
//入口和出口：
//library.jpg
//一间前厅中的图书馆，和Level 906有些许类似。
//
//Level 906是后室的第907层。它被M.E.G.干员Dawn Marchesa以及她的小队从一本书中穿过后发现。 Log 906-1记录了发现过程。不过，关于这一层级的记录最早可追溯到2/1/#∆¥π。
//
//描 述：
//Level 906为一无限大的图书馆，这里广泛地被在前厅中称为哥特式、维多利亚式以及巴洛克风格元素的建筑填充。因为摄影机等记录设备在这一层级会出现不明故障，一切对这一层级进行图像、视频以及音频记录的尝试都失败了。
//
//Level 906的木制书架上堆满了书本、笔记本、文件夹以及以不同语言写下的各式文档，它们中的大多数晦涩难懂。这些书架看上去是整齐排列的，有些时候一些书架会无视重力而漂浮在空中，想要到达这些书架需要用到图书馆内的木制扶梯。图书馆内被烛灯照亮，尽管被悬挂在高到不可思议的天花板上，它们仍能给整个图书馆提供需要的照明。天花板装饰有彩绘玻璃和风景画。到达天花板处是不可能的，越是向上走，天花板看上去就越远。在木地板上铺着具有金色装饰的蓝丝绒地毯。
//
//IMG_20220222_121931.jpg
//Level 906一个区域的图片, 由Blanche本人提供。
//
//书本、卷轴、文件或笔记的增殖与突然减少在这一层级是常见的事。不论是各种语言的普通书籍，还是用某种失传字母书写的古老卷轴上，都写有Blanche的签名。
//
//实体
//Level 906中有一特殊实体，她看上去对整个图书馆具有绝对的控制权。这一实体从外观上看是一名皮肤苍白，拥有金色长发和淡蓝色眼睛的矮个子人类女性。她通常的穿着为一件精致午茶袍，不过也被见到身穿其他的各种服饰，例如晚会礼服以及管家服和女佣服，并称自己为"Blanche"。她十分欢迎来访者的到来，并会用茶招待任何访问她图书馆的人。如果来访者表现出不礼貌的行为，他们首先会被警告，而后因他们的不逊举止而被Blanche大声斥责。如果他们拒绝改变自己的行为，他们会被以合乎礼仪的方式训诫。怀有敌意的来访者会被无形力量钳制住。如果这一来访者继续表现出敌对行为，他们会被强制送出图书馆并回到原先的层级。
//
//此外，微光向导经常被发现在这一层当中漂浮。根据报告，它们会自动消失、闪烁，并以看上去没有规律的模式移动，比较其他层中观察到的这类实体的行为，这些行为是非典型的。
// 
//
//值得注意的区域：
//Blanche的办公室：
//任何访问Level 906的人会首先到达的入口点。Blanche的办公室是位于这一层级中心的一片小区域。Blanche常在这里写作、阅读以及招待访客。 里面有一张书桌，几张桌子，椅子以及装有Blanche喜爱书籍和未完成工作的书架。 在这个房间中存在的一些物体包括：
//
//一张Blanche的肖像画，画像作者与署名为E.Isle。
//一本未写完的书，标题为“Blanche的安慰餐指南。”
//两本古代卷轴，标题分别为“月之书，第一卷”和“Azkhari卷轴”。
//几本关于人生哲学的书。
//一个装有几张乐谱的文件夹，包括从十四世纪到1950年代创作的，大多数是大键琴谱、风琴谱和钢琴谱。
//不同各种语言书写的宗教书籍。
//一个等身大的队长毛绒玩具，其脖子上写着“免费拥抱”。
//大量植物学书籍。
//一张哥伦比亚面具。
//此外，以下书籍在标有“阅读清单”的书架上被发现。 据Blanche说，这些书籍是被客人赠送或推荐给她的。
//
//隐藏清单
//《墨水心》三部曲的全套，作者柯奈莉亚·冯克，以不明语言书写。
//一本西班牙语版《基地》，作者艾萨克·阿西莫夫。
//一套葡萄牙语的上下册版《沙丘》，作者弗兰克·赫伯特。
//英语版《神经漫游者》、《零伯爵》、《重启蒙娜丽莎》和《全息玫瑰碎片》，作者威廉·吉布森。
//一本英语版《头号玩家》，作者恩斯特·克莱恩。
//一本英语版《时间的皱纹》，作者玛德琳·恩格尔。 根据报告，它会时不时“出bug”、“闪烁”或者以其他方式扭曲。
//几本不同语言的《猫武士》，作者艾琳·亨特。
//一本英语复印版《What If》，作者兰多尔·门罗。
//一本法语翻译版《傲慢与偏见》，作者简·奥斯汀。
//一本英文版《乐高人仔书》，作者Gregory Farshtey 和 Daniel Lipkowitz。
//一套关于J.R.R托尔金的典藏版书籍，例如《霍比特人》、《精灵宝钻》和《指环王》系列，全部用英语写成。
//史蒂芬·金的《小丑回魂》，罗马尼亚语版本。
//一本《Noli Me Tángere》的复印版，作者 José Rizal，用塔加洛语书写。
//一本英文版《Magyk》，作者安吉·萨奇。
//一本法语版《橡树上的逃亡》，作者Timothé de Fombelle。
//一本英语版《Cinder》，作者Marissa Meyer，里面零零散散地记着一些用塔加洛语写的笔记。
//一本英语版《Noughts & Crosses》，作者Malorie Blackman。
//一本马耳他语复印版《华氏451度》，作者雷·布拉德伯里。
//
// 
//茶室：
//Tea_room_with_interior_decoration%2C_Shantytown_Historical_Park%2C_New_Zealand.jpg
//茶室的复现图。
//
//茶室由图书馆中央的一处小型厨房区域组成。其内有着可工作的烤箱和熔炉，几台储藏柜，里面储存了各种类型的茶，以及一只装满了瓷制杯碟以及银制餐具和大量烹饪书籍的壁橱。这里是Blanche为客人准备茶与饼干的地方，有时还会用来准备正餐。她的茶会往往会持续一到两个小时。在这期间Blanche会尝试与她的客人聊天，询问从他们的生活到兴趣至专业领域的各种话题。
// 
//
//客房：
//Level 906具有未知数目的空卧室，供Blanche的客人们使用。Blanche能够自由改变和操纵这些房间，来更好地收容客人，满足他们的需求。如是，这种可变化的性质使得对这些房间进行固定描述不太可能。受伤的客人会被带到其中一间客房，而Blanche会帮他们处理伤口。这些房间中的一间似乎被她的男管家兼门徒Tom Von Haderach永久占用了。
// 
//
//超视
//有传言称，长时间待在Level 906可能会导致一种被称为“超视”的现象。虽然没有目击者陈述、事实报告或任何其他形式的证据，但该传言已经普遍流传开来，难以忽视。 据说这种现象可能对神经系统造成严重损害，导致记忆力、自我认知、感知能力的丧失，甚至在某些情况下致人死亡。
//
// 
//
//基地, 社区和前哨
//本层没有已知的基地、社区和前哨，不过有些来访者会在图书馆的一间客房内停留数周甚至数月的时间。
//
//入口和出口：
//入口
//BlancheSignature.png
//Blanche的签名。
//
//进入Level 906唯一的已知方法是用食指从右向左划过Blanche的签名而后被传送进去，不过有些时候只需要触碰即可，在她散落于后室各处的书籍与文件中可以找到它们。使用签名的图片、复印、打印、以及影印件不会产生任何结果。
// 
//
//出口
//为了离开Level 906，应当礼貌地向Blanche申请离去。她会引领你到一扇出口，它通往你所选择的层级，如果该层级安全的话。表现得十分粗鲁或展现敌对行为也可以离开Level 906。 在那种情况下，你会被强行传送出这一层，回到你进入时的地方。
//
package lvls9x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl906{}