//Level 911
//—— Level 911 ——
//某些层级之存在高深莫测，晦涩难懂，而有些层级则可一眼望穿，无所遮拦。在后室之中，无物守恒；所谓的已然“定数”终不如一句“也许”来的更为准确。
//随光阴流转，人们渐渐学会了自己跋涉探索，游历层级。一次次地测验着切入切出方法的可行性；一次次试探着何物无情致命，何物带来生机。
//
//然而，这终属大多数情况。
//
//Level 911则是一个凤毛麟角的全新挑战。流浪者要想活命，就不得不遵循它所承载的一系列铁律。在万劫之后，幸存者则能收获一个同样神秘未知的奖品。
//没有一条规则可以一眼识破，更有甚者如同天书一般无人能解。
//
//无论你将踏向何方，遇见何物。这条条铁律必须字字贯彻，滴水不漏、天衣无缝地执行。
//
//Level 911内除了一条寂寥的街道与其尽头的一座酒店之外空无一物。这条街道有着一条带草皮的中间带，一侧植有排树绿化带，另一侧则仅生有阴翳枯死的灌木和烧焦的草皮。坐落在街道的一端的酒店是一座破败不堪，遭尽铅华的木制建筑；另一端则一无所有，只是被浓雾笼罩的尽头，这片浓雾也同样覆盖着除上述地点外层级的其余各个角落。
//已然进入雾中的那些流浪者早已杳无音讯。若他们真的“生还”，请务必无视他们，他们再也不是人了。这些非人生物是无害的，他们仅仅是再没有生活之渴望的，已然迷失的孤魂野鬼。不必为他们感到扼腕痛惜，他们不会感知到任何感情。
//
//若流浪者决计在##### #内搭乘一趟特殊的班车，他们大多会切入此层级。该班车会指明一个名为“911”的终点站，而“911”同时也是班车的号次，车牌号和车型。甚至车上的那些座位也一致标上了这个数字，车速表盘、时钟无一不显现着“911”。这个数字喜爱在各处重复现身。
//
//班车会在##### #的街道上不断巡游，等到车上的受害者够数了，它便会驶离##### #，开往Level 911。 记住这个数字，它叫10。
//不会有司机现身的，或者，没有人能看到过。
//
//跳离这趟班车可不是明智之举，任何尝试离开班车的尝试都是徒劳之举：每个出口都无法使用；车窗坚不可摧，车门紧闭锁死，车身上连一丝剐蹭痕迹都无法留下，直到每个人都到了终点站。 但你真的想跑出去吗？在车里难道不是更安全么……
//
//如果你已翻阅至此，想必你已站立在这空空荡荡的街道，无所适从了吧。毕竟，这篇文章似乎也从未存在过呢……
//一经抵达，每个人都会被分发到一本日记。日记的前四页即为每人必须遵守之纪律，正如前所述。想要活命，严守条律。
//
//— 抵至规则
//这条街道正如你们周遭一样寂寥伶仃，保持恭敬之心，在其被激怒前趁早离开。
//举头望天，微笑示好。
//执行上述条律后若无事发生，在之后的旅程中保持肃静。
//若你感到阴风拂面，这时你能与其他流浪者自由交谈。
//切勿踏入虚空，它会吞噬你。
//如耳边有窃窃细语，无视它们。
//请在参阅抵至规则后马上赶往酒店前门，你将可以在酒店内安全地阅读完剩余规则。而此时外部地雾气正逐渐变得躁动不安。
//— 基本规则
//你们仅仅是游览者，此处他物皆非人类。
//所有流浪者共用同一间卧房。房间内如出现多于10张床，那么夜里必会有些污秽之物游荡于卧房之内。
//这里的地毯会试图绊倒经行的流浪者。
//若你目睹地毯绊倒了其余生物，切记要对其放声嘲讽。
//若被绊倒的是你，务必在其余流浪者经过时再尝试爬起。
//地下室的门处于常闭状态。
//如地下室门敞开，周遭气温会于你注视空气之时骤降，请马上跑向起居室并稍等几分钟。在气温仍是正常之时，立马关紧地下室门。
//有时起居室内的电视会莫名自启，无论电视放送内容为何，请马上关闭电视。其放送的某些影片总会令观影者汗毛倒竖。
//酒店内有许多不同的楼梯，如其中有些楼梯似曾相识，切勿走上这些楼梯。
//酒店内总是会出现2条狗和1只猫。2条狗结伴而行，而猫会从远处跟随它们。
//如猫忽然直立在原地，说明最近有某位流浪者已经身处黄泉。而狗则会去分食其尸体。
//若狗未被公猫尾随，立刻前去寻找他。他有时确会离奇失踪。
//— 日间规则 [12 PM – 12 AM]
//各位流浪者须将其随身物品置于卧房之衣橱内。任何不置于其中的物品最后会消失不见。
//就寝时间为9 PM至12 AM。如你未能在午夜时分归宿，那么卧房之门将不会再为你敞开。
//若你感到饥肠辘辘，厨房内则会出现已为每位客人准备好的正餐，就餐时间为7 PM至11 PM。切勿在其余时段闯入厨房。
//切勿让狗在此时段闯入卧房。相反，应让猫进入卧房之中，在此时段他能为流浪者带来好运。
//浴室仅在此时段可用。
//若另一位流浪者出现在浴室内，你仍可以使用浴室的其余部分。
//若浴室内空无一人，请在进入后随手关门。
//若你在淋浴时发觉有其他个体进入了浴室，请无视他们。无论他们是人类与否，请务必在他们离开后再走出浴室。
//— 夜间规则 [12 AM – 6 AM]
//尖叫声是助你生存的帮手。若尖叫声停止了，流浪者们必须顶替尖叫声直至其重新响起。
//如醒来后发现某位流浪者失踪，及时测定其床铺的温度。若床已冰冷，此人可宣告死亡。
//每人应至少保持一小时睡眠。梦魇们喜欢找睡眠不足者趁虚袭击。
//凝视窗外，若天空呈腥红色，无论你是真想入睡亦或只是假寐，马上返回床上，并忽略此时听到的一切声响。
//若卧房的门莫名开启，应在门再次关上之前保持不动，并迅速检查何人失踪。
//忽略所有敲门声。敲门的可不仅仅是些在开派对的善茬。
//无论何人何物在召唤你，在6 AM前绝不能走出卧房。
//— 早间规则 [6 AM – 12 PM]
//若你在早晨最早醒来，应马上唤醒其他流浪者。
//如没有人回应你，回床继续睡觉直到你再次醒来或是由别人唤醒。
//酒店为每个流浪者都准备了早餐，即便是那些死者。不要与死人争食。
//猫和狗也会在此时进食。切勿打扰它们。
//若猫在夜间与各位流浪者待在一起，请爱抚他。他会在你毫不知情的情况下救你一命。
//最后请上楼取回你的随身物品。若你未能在12 PM前离开酒店，你须在酒店中再滞留一夜。
//住宿愉快。别忘了给我们的服务评分
//
//"Level 911"作者为MyrandFox
//作者页： 点我！
//译者： 
//Deip*isoster
//特别鸣谢：
//Sjoerd Hekking
//https://www.writtenhorror.com
package lvls9x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl911{}