//Level 998
//免责声明
//本文的主题中包含较为沉重的自杀情节。如果相关内容会使你感到烦躁、不适或过激，请直接跳过该层级，或是自行决定是否阅读。
//
//
//
//
//
// 
//
//生存难度：
//等级 变化
//
//安全性变化
//稳定性无法预测
//实体数目波动998skylight.jpg
//Level 998的天空，可透过顶层房间的天窗看到。
//
//描述
//Level 998是一片空旷、平坦的平面，由状似云层的物质构成。这些云被压印在地表，就如同3D纹理或是全息投影一般。随着流浪者位置与视线的变化，云会发生相应的移动，并给人以立体的错觉；但实质上，该层级的地面为坚硬平坦的固体表面，带有羊毛般的纹理。这些地面上的纹理会给人一种发自内心的感觉，仿佛其正是记忆中虚幻而熟悉的云。
//
//
//
//998stairway.jpg
//Level 998入口处的楼梯，可以看到拍摄时已经从底层登上了数段台阶。
//
//虽然这些二维平面云层构成了Level 998的主体，但流浪者们抵达该层级时，并不会直接出现在云层之上。Level 998不像大部分层级一样具有多个入口，无论从哪个层级进入该层级，似乎都会抵达同一位置。所有Level 998的入口都将通向一栋写字楼楼梯间的最底层。
//
//在走过八段台阶之后，流浪者将抵达一个小而空1的房间。最近，这个房间里出现了一堆彩绘鹅卵石，大致上可以用于计数自愿进入Level 998的人数。目前仍然不知道Level 998云层的入口处堆积了多少鹅卵石，但根据最新上传的照片，已经有约38颗石子被粗略地堆成了一堆。
//
//level998door.jpg
//阶梯尽头的空门廊，房间与云层的交界点。
//
//在离开Level 998的最终房间后，便会进入一片平坦、空旷的云纹理平面，正如上文所述。这时若回头再看那个房间，便会发现其只是一个简陋的方形建筑，类似于探出摩天大厦顶层的电梯间。从外部来看，该房间似乎缺乏其所应有的细节，唯一的装饰就是屋顶边缘的壁板。由于无法攀上屋顶，屋顶上的情况至今未知，但可以确认至少存在着一个三等分的天窗2，因此可以推测屋顶部分可能全部由天窗构成。
//
//虽然Level 998内的云层地表是最稳定的区域，但在离开房间大约30千米后，层级性质便会出现变化。流浪者踏上的云层将开始变得灰暗，同时，天空也将与地面一样发生色调转换。伴随着颜色的变化，凉爽的微风将会一同出现。这一现象导致此时的温度将会从室温3降至大约11°C，即52°F。
//
//此时，将会有少量的各类“普通”实体出现。根据目前深入Level 998的探索者上传的信息，笑魇、钝人、被Entity 17感染的人形及非人形生物，以及木灵，都会于此现身。然而这些实体并不会如同在其他层级时一样正常行动，而是会漫无目的地徘徊、张望。随着气温下降、灰度上升，Level 998内的实体将越发温和，准确地说，它们的举止将越发与其正常行为模式相悖。
//
//大多数在该层级出现的实体除了移动之外，几乎什么也不会做。在很多时候，它们甚至会忽视眼前出现的流浪者，只是单一地向外移动，背离着该层级的中心。
//
//然而，值得注意的是，Level 998内的实体并非是严格“安全”或是“温顺”的，对于任何人而言，都不应用类似无害的词汇形容它们。在Level 998内激怒实体、过于靠近实体，甚至只是单纯不走运，都有可能会导致实体被激发出正常行为模式，开始攻击流浪者。
//
//998outside.jpg
//Level 998中未知区域的边界线，由The Leaders的一位成员拍摄。目前为止，这张照片是所有图像中最深入该层级中心的。
//
//在跨过第二区域后，穿越了灰云地带的流浪者将会抵达Level 998的第三区域，也大概率是最后一个区域。理论上说，任何流浪者在穿行大约80千米之后4，就会进入到一片遮天蔽日的黑雾之中，连脚下的云层地面也无法看清。这一区域的温度将急剧升高，造成狂风与大规模的风暴，风速最高可达29米/秒。5
//
//虽然没有任何图片可以证实或是否定，但是据称，Level 998的黑色区域中实体数量将会大幅上涨。与先前的灰云中层地带类似，黑云区域内的实体也不会遵循它们原有的行为模式行动，只会像大部分来到这一区域的流浪者一样，向着背离中心的方向漫游。然而由于此时实体出现的概率较大，流浪者依旧有可能会受到它们的攻击，尤其是那些兽性较强的实体，例如笑魇、猎犬、悲尸、爬菌、瘟疫地精与牧蛇6。
//
//除了狂风以外，Level 998的第三区域还会出现极度凶残的暴雨。从第三区域的最外环开始，将会有大雨倾盆，可能会将苦苦深入的流浪者再度推回起点。在深入第三区域15千米后，将会踏入一片规模巨大、无休无止的迷雾风暴。在雷雨交加之间，纯黑色的云层几乎无法提供任何视野。据称，此时风暴中的风速将会达到31米/秒，且伴随着巨大、强力、迅猛的雨珠捶打，将流浪者置身于一片肆意奔流的雷暴雨之中。
//
//
//
//在这一部分之后的Level 998，至今仍被迷雾笼罩。大部分摄影设备与电子仪器在狂风和暴雨中都无法幸存。在进入上述的暴雨带后，多数设备将会在几分钟以内报废，或是因进水7而失灵。
//
//自从1925年开始，一种观念就在后室居民的心中牢牢扎根：Level 998是一场充满痛苦与磨难的试炼，通过后即可抵达一片安详的“天堂”。通常，选择相信这个说法的都是那些尝遍苦难的人们，他们饱受疾病、饥饿、离别之苦，或是患有肉体与心灵的残疾，渴望寻求更好的生活。
//
//而另一种关于Level 998的理论同样被广泛接受，即该层级没有任何出路：在黑云区域最黑暗的至深处，仅有着一片致命的风暴终年旋动，快速绞杀每一个进入的生命。尽管这个理论听上去略显悲观，但依旧有不少人为此来到Level 998。这些人认为，进入Level 998中的风暴是一种相对轻松、无痛的自我了结。8
//
//如果第一种人进入Level 998是为了追求更加安宁、平静的生活，那么第二种人就是单纯地以此面对自己生命的终点。走上这一条路的大多是年老体衰的长者、患上不治之症的病人，以及因后室中各个层级、实体、物品而受到巨大创伤的人们。
//
//基地、前哨和社区
//安魂者
//在2016年B.N.T.G.成立之初，安魂者这一非官方组织便已经出现。直到2022年M.E.O.D.创建之前，安魂者们都居住在商人之家，而在那之后则移居到了他们在Level 13.1小镇中的主要基地。
//
//安魂者们的目的是集结那些希望进入Level 998的人，无论他们抱着哪一种目的。该组织会向路过的流浪者发放传单，也会在小镇的墙上印贴广告和海报，从而尽可能告知更多人有关Level 998的信息，并将所有被生活压垮的不幸者们聚集在一起。
//
//在集齐足够多的人后，他们便会三两成群的出发，前往那些可以连通Level 998的层级，去迎接自己心目中的命运。该组织的成员在深入Level 998之前，还会在最后一道门廊旁放一颗鹅卵石，其上书写着遗言、符号，或者是任何他们想要在这个世界上最后留下的痕迹。在做完这一切之后，他们便会动身前往该层级的深处，静候结局的到来。
//
//该组织的存在与行动素来饱受争议，有人从道德层面上指责他们宣传的安乐死，也有人认为他们会强迫不自愿的人牺牲生命。但无论如何，M.E.O.D.最终允许了他们继续活跃。
//
//入口与出口
//入口
//Level 998的入口多到需要列成一份清单，至今已经有208个层级可以进入该层级，且这一数字日后很有可能还会继续上涨。正如上文所述，进入该层级的方法非常简单。只需要在以下层级中找到一扇白色的铁门，其外观与电梯门相似，推开它们即可抵达Level 998的起始楼梯9。
//
//收起目前记录中通向Level 998的层级
//Level -998
//Level -10
//Level -8
//Level -6
//Level -4.1
//Level -0
//Level 1
//Level 1.1
//Level 1.5
//Level √2
//Level 2
//Level 2.1
//Level 3
//Level 3.1
//Level 4
//Level 4.2
//Level 4.4
//Level 5
//Level 6.1
//Level 6.2
//Level 7
//Level 7.9
//Level 8
//Level 10
//Level 11
//Level 11.1
//Level 14
//Level 16
//Level 17
//Level 18
//Level 19
//Level 20
//Level 22
//Level 23
//Level 25
//Level 28
//Level 29
//Level 30
//Level 32
//Level 33
//Level 34
//Level 35
//Level 37
//Level 38
//Level 39
//Level 40
//Level 42
//Level 43
//Level 46
//Level 48
//Level 49
//Level 50
//Level 51
//Level 54
//Level 56
//Level 57
//Level 58
//Level 59
//Level 60
//Level 63
//Level 66
//Level 68
//Level 69
//Level 71
//Level 74
//Level 76
//Level 78
//Level 80
//Level 83
//Level 84
//Level 86
//Level 90
//Level 93
//Level 94
//Level 95
//Level 98
//Level 101
//Level 102
//Level 106
//Level 107
//Level 108
//Level 109
//Level 111
//Level 112
//Level 113
//Level 115
//Level 116
//Level 118
//Level 119
//Level 122
//Level 123
//Level 125
//Level 129
//Level 130
//Level 134
//Level 136
//Level 137
//Level 139
//Level 140
//Level 141
//Level 142
//Level 143
//Level 144
//Level 146
//Level 150
//Level 151
//Level 155
//Level 156
//Level 161
//Level 162
//Level 164
//Level 167
//Level 168
//Level 170
//Level 176
//Level 178.1
//Level 183
//Level 190
//Level 193
//Level 19710
//Level 199
//Level 201
//Level 202
//Level 203
//Level 204
//Level 210
//Level 220
//Level 222
//Level 224
//Level 226
//Level 240
//Level 241
//Level 250
//Level 254
//Level 270
//Level 280
//Level 282
//Level 290
//Level 291
//Level 299
//Level 300
//Level 302
//Level 317
//Level 322
//Level 324
//Level 333
//Level 356
//Level 372
//Level 389.1
//Level 399
//Level 401
//Level 404
//Level 410
//Level 420
//Level 432
//Level 448
//Level 456
//Level 466
//Level 480
//Level 494
//Level 499
//Level 501
//Level 502
//Level 503
//Level 512
//Level 515
//Level 563
//Level 60011
//Level 611
//Level 616
//Level 621
//Level 648
//Level 666
//Level 700
//Level 721
//Level 729
//Level 756
//欧文森之海
//Level 797
//Level 826
//Level 831
//Level 888
//Level 901
//Level 995
//Level A-9
//Level A-11
//Level A-13
//Level C-395
//Level Θ
//Level µ/阈限剧院
//蒙黑天空
//密码
//电镀层
//终点
//遗忘之森
//礼物平原
//蜂巢
//角骸裂谷
//淡色层
//褪色层
//享乐层 =)12
//伪层级
//此外
//山村
//蛇虚空
//未命名
//乳白天空
//深层绝缘
//出口
//直到今天，Level 998的出口依旧是一个谜。除了一些能够追溯到公元500年的参考文献13之外，没有任何人知晓Level 998的边界究竟通往何方。
//
//有许多理论详细地指出了Level 998可能通往的地点，但是相关的实证似乎永远不会出现，因此这些理论都并未归档。任何前往Level 998的个人都可以自行选择相信某种说法，也有自由追逐那些理论中出口的权利。但在付诸实践之前，最好能够先明白这个决定所蕴含的分量。
//
//M.E.O.D.原则上并不支持流浪者通过Level 998自我了结，但是也不会对那些自愿深入Level 998、追逐迷雾之人做实质性阻拦。
//
//
//
//
//对于那些选择离开之人，我们真诚地祝福他们能够在旅程的终点得偿所愿。
//
//
//
//
//作者
//« Level 997 | Level 998 | Level 999 »
//
//Footnotes
//1. 此处的空指未经装饰，安魂者们已经在房间中加装了额外的家具。
//2. 可在本文开头部分看到。
//3. 18-19°C，即68-77°F。
//4. 此处的80千米不包括最初在白云区域行进的30千米路程。
//5. 该数据并不完全可靠，引用自一些探索过该层级的流浪者上传的文件。
//6. 就像很多流浪者一样，这些实体也时常会被卷入风暴。
//7. 令人费解的是，根据部分报告，即便是经过特殊设计的防水设备也会在此时进水失灵。
//8. 有着类似功能的层级还有Level 790，但后者更加不可预测，且记录中可能会出现极度痛苦的死亡方式。因此，决定自我了结的人往往会避开这个选项。
//9. 需要注意的是，通往Level 998的门没有任何形式的把手，唯一进入的方式便是直接推开它们。一旦铁门在你身后关闭，就再也无法重新回到进入的层级。
//10. 特殊的是，Level 197中，铁门只会在紫水晶区与石英区出现。有关石英区的具体内容可在Level 197的补充文档中查看。
//11. 由于在21世纪之初该层级的崩毁，我们实际上不清楚Level 600中是否存在通向Level 998的入口。根据一些曾经属于The Leaders的文件描述，该层级中似乎出现过与Level 998入口非常相似的铁门。
//12. 这个出口在我们这儿派不上用场，不过我们已经给你安排好一场派对了！=)
//13. 在合并之前，只能通过失落一族的协助得知。
package lvls9x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl998{}