//Level 995
// 
//
//生存难度：
//等级 4
//
//不安全
//不稳定
//少量实体
//Level 995是后室的第996层，它是一片半欧几里得空间，一系列不连续的住宅及家具的排列组合。
//
//描述：
//Level 995外观类似于一条无尽延伸的直道，两侧的住宅内部塞满了家具和功能紊乱的电器。归咎于层级边界处具有的超自然几何形状，使得试图通过在道路外围徘徊来逃离的尝试，都无功而返。离开道路会使人员再次回到初始的位置，因此认为Level 995的空间结构是圆筒形的。
//
//Level995
//道路照片。
//
//由于缺乏重要组件，停在路边的大量车辆都无法启动。但常常可以在汽车内部的某处找到一些用品，但这些用品的功效令人生疑。据称其中发现的许多配件或是组件都让人难以理解。大部分找到的东西要么都是碎的，要么和其他什么不相干的物品以未知方式组合在一起。各类物品的组合体总能构成某种具备超常单一功能的装置，这些功能很少能对我们有所助益。Level 995的许多住宅同样也存在各种材料的融合。这种融合现象的成因未知，但目前普遍认为它们是该层级特有的一种空间扭曲现象的原因。
//
//目前已证明，与Level 995中和其他住宅存在明显不同的房屋互动，会导致某种短时性的环境或空间的扭曲现象发生。我们认为这种影响的程度大概与人员互动后唤起的怀旧情绪程度成正比。许多受害者报告称在受到影响的过程中，目击了错位的建筑和大量扭曲的、超自然的墙壁结构的出现。大气折射的光线在明朗与黑暗之间无序转换。这些被认为是Level 995中发生的生物或非生物异常现象的主因，同样也是导致人员死亡的主要原因，但其成因不明。
//
//目前认为该层级的实体同样受到类似影响，许多生物因此具有了不正常的外观和敌意。据称Level 995的大多数生物都因为上述的这种融合现象所造成的某种突变而变得更具危险性。由于它们特殊的习性，绝大多数安全协议将失效。当有人员接触到异常生物时，建议向相反方向撤离，直到离开其视线。
//
//异常建筑
//根据近期研究小组成员与异常建筑物接触者的访谈结果，发现Level 995与前厅存在明显联系。以下是一位匿名研究人员的相关言论：
//
//“所以说我们昨天就拿到了结果，说真的这很让人吃惊。我完全没想到我们会得到这样的答案。我们的发现是，接触Level 995中异常建筑物的人员表现出困惑。当我们问及为什么他们在已知这种空间扭曲可能带来的潜在后果时，依旧决定接触这些建筑。我们得到的回复是，这些房子看起来就像是他们在前厅的家的完全复制品。这一点之所以重要，是因为之前有许多类似的假说。如果他们所言非虚，这就说明Level 995和现实世界存在某种关联。出于某种原因，这里前厅后室的建筑共同存在，这也合理地解释了为什么人员试图与其互动时，会发生那些异常现象：这是两个世界间的融合。现在的问题是，前厅和后室之间是否真的有某种联系……”
//
//- 匿名
//
//基地、前哨和社区
//目前，没有关于Level 995存在任何社区或团体的报告。
//
//入口和出口
//入口：
//要进入该层级，人员须突破Level 9中某个上锁的房间。
//
//出口：
//若流浪者能找到到一栋蓝色涂装的、构造与Level 995的其他住宅相似的房子，进入后可抵达Level 63。
package lvls9x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl995{}