//Level 940
// 
//
//生存难度：
// 
// 
// 
//4073700457_608b13b75b_b.jpg
//从Albert小队的临时营地看向停车场。
//
//Cache-66042308ce16582e.webp
//Pendragon教授绘制的停车场示意图。
//
//Level 940是后室的第941层。该层级似乎基于人员童年时期的迷失经历而生成，并表现出严重的非欧几里得空间结构，这产生了极其重大的探索隐患。该层级存在未知实体。任何情况下都不建议对车库外的停车场进行探索。
//
//描述：
//Level 940的危险性取决于人员是否遵循本文中的说明。层级由一座30英尺乘30英尺的车库开始，向外无限延伸出停车场。车库具有未完工的木墙、金属板制成的屋顶、以及粗糙的水泥地。外面的停车场则是一片普通的平地，每隔一段距离就竖有一根一模一样的路灯，此地极其危险，不应对其进行深入探索。由于其异常的空间结构遮蔽了大部分天空，目前不清楚该层级内是否存在太阳。
//
//基地、前哨和社区：
//此地没有已知的社区或是前哨站。
//
//附件
//[信号传入]
//[位置未知]
//[启动层级探索信息转录]
//- 探索日志 部分一
//Level 940 探索日志 部分一
//Albert小队从Level 22切入了未曾被发现过的层级。他们所处的环境似乎是一座由木板和金属板搭建而成的破烂车库。
//
//Henson： 全员抵达吗？有伤员吗？
//
//Robinson： 没发现谁不在。
//
//Larson： 不管这是哪儿，我们都到了。
//
//Henson： 有人来过这个层级吗？
//
//Turner： 从没听说过。
//
//Trent： 这和我所知的任何层级都不匹配，我们一定是找到了新的。
//
//Henson： 还有WiFi信号，我会向上面汇报的。其他人，确保区域安全。
//
//小队走出车库，进入一片无限延伸的、夜幕下的停车场区域，该区域由数不尽的路灯提供了照明。
//
//Larson： 这里看起来很空旷，据我所见没有任何实体。
//
//Henson： 我们的首要任务是探索。
//
//Robinson： 实际上，我的首要任务是休息。
//
//Trent： 我支持。
//
//Henson： 好，我们可以等到日出再继续。
//
//Turner： 如果这儿有太阳的话。
//
//Henson： 如果有的话，或者等所有人都休息好了。把营地搭起来，然后我会和Larson看第一场日出。
//
//小队将重型设备放置在车库外，打开补给。Robinson想从一根路灯上取下电气接入板，以此为他们的设备充电。
//
//Robinson (尖叫)： 我的手！我的手！
//
//Robinson持续尖叫并跑进停车场。Henson追赶Robinson直到他跑过一根路灯后消失，Henson停了下来。
//
//Turner： 他不见了！
//
//Trent： 到底发生了啥？！
//
//Henson： 我还能听到他的叫声，但他已经从视野中消失了。
//
//Larson： 我可不想追着他进去。
//
//Henson (跑进停车场): 你没得选！跟着血迹走！
//
//Trent： 这可真是好多好多血。
//
//Larson： 他怎么了？
//
//Trent： 看上去他的动脉被切开了。
//
//Turner： 比那更严重，他的整只手都被切成了两半！
//
//Trent： 血迹在那盏路灯后消失了。
//
//Henson： 那里也是Robinson消失的位置。
//
//Larson： 只有我觉得去那边是个坏主意吗？
//
//Trent： 你不是一个人。
//
//Henson (到达血迹拐弯处)： 继续前进，这里存在一个从车库看不到的方向。
//
//Turner： 我看不到。
//
//Henson在一盏路灯后沿着血迹走，看上去直接消失了。
//
//Turner： 他去哪儿了？
//
//Henson： 我还在，你在哪里。
//
//Larson： 我们看不见你。
//
//Henson： 我这里也看不见你们，可以试着绕过来。
//
//Larson (在Trent边上)： 你先。
//
//Trent (对Larson)： Robinson可能快死了，快点吧你个胆小鬼！
//
//Trent到达痕迹弯折处。
//
//Henson： 你来了。
//
//Trent (对Larson和Turner)： 我看到他了，就在这盏路灯后面的拐角。
//
//Turner： 你能同时看到我们和他吗？
//
//Trent： 是的，我能同时看到你们。
//
//Turner： 这是某种传送吧。
//
//Larson： 这儿的空间结构一定很奇怪。
//
//Henson： 这路灯里面有什么东西把空间扭曲了。你们待在来路上，如果乱跑的话，我也不知道会怎样。
//
//Larson： 我们也会消失，这就是后果。
//
//Turner： 但我们可以直接往回走啊。
//
//Larson： 前提是你还记得你来的方向。
//
//Trent： 在这个层级里还不如瞎了算了，一切看起来正常，但一拐弯人就没了。
//
//Larson和Turner跟随Trent和Henson绕过拐角。
//
//[连接丢失]
//[重建连接]
//[下载日志数据]
//- 探索日志 部分二
//Level 940 探索日志 部分二
//
//Larson： 我看不到车库了。
//
//Trent： 你在想什么，如果之前从车库看不到这里，那这里肯定也看不到车库。
//
//Henson： 我们有一条血迹标记了来路，没有迷路的风险。
//
//队伍沿着血迹绕了几个弯。随着他们靠近，尖叫声也越来越响亮。
//
//Henson： 我们越来越近了，我现在听他的声音更清楚了。
//
//Larson： 可能是我听错了，但我感觉尖叫声是从我们身边发出的，而不是前方。
//
//Turner： 他之后肯定绕了更多弯子吧，也有可能就在我们这边。
//
//Larson： 如果我们直接朝着尖叫声走过去，说不定可以找到捷径。
//
//Henson： 不，这血迹是我们唯一的退路。
//
//Larson： 如果我找到他，自然就有更多痕迹了，我会比你们走的更远的。
//
//Henson： 待在路上。
//
//Larson (离开痕迹)： 前面见！
//
//Henson：他怎么突然变得这么莽了？
//
//Trent： 早些时候他阻止我们时，我对他大发雷霆，骂他是胆小鬼。
//
//Turner： 对，他可能是想挽回之前的退缩吧。
//
//Larson (离来路远远地说)： 现在声音是从我身边传来的，他肯定又动了！
//
//Henson： 赶紧撤回来！
//
//Larson (转身离开)： 我回不去，现在我看不见你们！前面见吧。
//
//Trent： 我们继续沿着血迹走吗？
//
//Henson： 不，我们等着，直到他回来。
//
//Larson： 我能听到惨叫声更响了，我一直跟着走，但它的来源不断变化，好像在引导着我一样！
//
//Henson： 撤回来，这是命令！
//
//Larson： 我不知道你的位置，前面见吧。
//
//Henson： 跟着我的声音走，就和你跟着惨叫走一样。
//
//Larson： 你的声音是从我身后传来的，我可以试着去找找看，但听上去和惨叫声一样奇怪。
//
//Henson： 为什么奇怪？
//
//Larson： 当我跟着惨叫声走的时候，无论我面向哪边，你的声音总是从我身后传来。
//
//Henson： 就跟着我的声音走。
//
//Larson： 你得一直说话才行。
//
//Henson： 现在惨叫声是从你身后传来的吗？
//
//Larson： 是的，我正远离它，走向你那边。
//
//Henson： 你在回来的时候有绕弯吗？
//
//Larson： 有。
//
//Henson： 而尖叫声一直在你身后？
//
//Larson： 对。
//
//Henson： 我认为，这是此地的空间结构所致。绕着路灯柱往左和往右似乎会走向不同的地方，这也解释了为什么站在柱子后的人只能从他们过来的那一侧被看到，而无法从另一侧看到。
//
//Larson： 对不起，你说啥？我没听明白。
//
//Henson： 这个层级是由欧几里得空间碎片以非欧几里得的形式拼接而成，这就是为什么尽管空间表现出正常的曲率，但我们却观察不到任何扭曲和透视的现——
//
//Larson： 好好好，我知道我之前让你一直说话，但这话题真的很无聊。你能聊点别的吗，或者干脆就发出啊啊啊啊啊啊啊的声音也行。
//
//Henson： 这些就是Pendragon教授一直讲解的东西，我为了不让他失望，就学习了很多关于这方面的知识。
//
//Larson： 你真的听了课啊？我都左耳进右耳出了。
//
//Henson： 我也想，但他认为我是他的“得意门生”并且经常检查我的功课。
//
//Larson： 为什么要跟他玩过家家呢？你就直截了当地告诉他说你不是他的学生，这儿可没设立他的专业课。
//
//Henson： 老头子已经81岁了，如果他觉得自己还在前厅的大学里教书的话，我愿意给他一些心理安慰。
//
//Larson： 我不知道你还有副菩萨心肠。
//
//Larson从灯柱后面绕出来，回到其他成员的视野。
//
//Turner： 你回来了！
//
//Henson： 现在我们该去找Robinson了。
//
//Trent (提前到达下一个拐角处)： 呃……Henson？
//
//Henson： 怎么了？
//
//Trent： 我找到Robinson了，他已经……死了，长官。
//
//Henson： 能看出死因吗？
//
//Turner (焦虑)： Henson？
//
//Trent： 从他的失血量和手部状态来看，我估计是流血致死。
//
//Turner (焦急)： Henson！
//
//Henson： 什么事？
//
//Turner： 如果Robinson已经死了，那是谁的惨叫？
//
//Henson停下了脚步，同时惨叫声愈发刺耳。
//
//Henson： 所有人，跟着血迹原路返回，动起来动起来！
//
//Albert小队的幸存成员沿着原路跑回。
//
//Larson (看向自己的肩膀)： 你能看见吗？它在跟着我们吗？！
//
//Henson： 别回头，继续跑！
//
//Larson： 我记得这里是往左走。
//
//Larson从队伍中脱离，跑向左侧的路径。
//
//Henson： 你去哪儿？！
//
//Larson（离开视野）： 抄个近路！
//
//Trent： 你刚才不是说从路灯的左右两边过去到达的地方不一样吗？
//
//Henson： 对，但没时间为他停留了，继续跑。
//
//他们身后的惨叫声变得更加高亢，听上去不像人类所能发出的叫声。
//
//Henson： 这路灯里面的东西，能把空间像纸一样折叠，能把Robinson的手切成碎块，别离开血迹！
//
//Turner： 我要和这怪物搏命去了！
//
//Turner脱离队伍，向左边拐去。
//
//Henson： 快回来，Turner，这是命令！
//
//Trent： 就咱俩了，我们甚至还没见过那个实体。
//
//Henson： 继续走就能回车库。
//
//Trent： 你确定撤退是个好主意吗？
//
//Henson： 现在去开战已经晚了，就我们俩。
//
//当他们走过最后一个拐角时，重新看到了车库。
//
//[录制片段结束]
//[恢复实时转录]
//- 探索日志 部分三
//Level 940 探索日志 部分三
//
//Henson： 就快到了！
//
//剩下的成员冲进车库并关上了身后的车库门。
//
//Trent： 这车库看起来并不牢固。
//
//Henson： 是这样。
//
//Trent： 你觉得它能挡住外面那玩意吗？
//
//Henson： 我不觉得，但至少提供了掩护。
//
//Trent： 我们已经失去两名队员，必须与之一战了。
//
//Henson： 我低估了在这个层级探索的难度。
//
//Henson拔出枪。
//
//Henson： 你负责前方，我负责后方。
//
//Trent在墙板的间隙处选好了射击位置；Henson在车库门后做准备。
//
//Trent (回头看了一眼Henson)： 长官？这车库有些古怪。
//
//Henson： 什么古怪？
//
//Trent： 我从这根支撑柱的右边看，车库是封闭的，但从左边看是开放的。
//
//Henson (往身后瞥了一眼)： 什么？
//
//Henson绕着柱子逆时针走。
//
//Henson： 我看不见你了。
//
//Trent： 你走到柱子后面之后就突然消失了，这柱子和那些路灯一样。
//
//Henson： 和路灯一样……
//
//Henson沿着柱子顺时针绕回来，和Trent会合。
//
//Henson： 原来我们一直以来的思路都错了吗？
//
//Trent： 长官你是指什么？
//
//Henson： 这不是车库。
//
//Trent： 怎么说？
//
//Henson： 这是一条走廊！
//
//Trent： 走……走廊？
//
//Henson： 这个柱子周围的空间就像路灯周围的空间一样弯曲，整个走廊也随之弯曲。我们看到的只是一间房间，因为我们对弯曲超过360度的空间没有实感。
//
//Trent： 它弯曲了多远？
//
//Henson： 我想，可能是无穷远。来吧，顺着往下走。
//
//Ternt： 顺着走？
//
//Henson： 绕着柱子走。
//
//Trent： 这有什么用吗？
//
//Henson： 因为这不是柱子，这是一面墙！
//
//Trent： 长官，我没听懂。
//
//Henson： 你没必要听懂，跟着我走就行了。
//
//Trent： 我认为我们没取得任何进展，而且那玩意会越靠越近。
//
//Henson： 会吗？它的叫声还和之前一样响吗？
//
//Trent： 没有，变得更安静了。
//
//Henson： 因为我们绕着柱子走，声音要绕过几个弯才能传到我们身边。
//
//Trent： 就像绕着灯柱左右转一样。
//
//Henson： 没错，只要绕一圈就会带你到一个新地方，不是两圈或是三圈。
//
//Trent： 所以我们就好像在顺着螺旋楼梯往下走。
//
//Henson： 我管这叫走廊，但楼梯也说的通。
//
//Trent： 那Larson和Turner再也找不到回去的路了，是吗？绕过灯柱，他们沿着不同方向的楼梯走下，带他们去不同的地方，走的越远，越是走进了停车场的更深处。
//
//Henson： 哪怕身后没有东西追赶，我们也不可能挽救他们了。
//
//Trent： 我想我看见一扇门。
//
//Henson： 你是对的，那面墙上有扇门。
//
//Trent： 我们得绕过去。
//
//Henson： 这地方的空间结构一团乱，但至少我们能离开了。
//
//Henson和Trent穿过那扇门，返回Level 22。Larson和Turner被认定为已死亡。他们所发现的新层级被归档为Level 940。
//
//Level 940退出途径
//绕着车库中间的柱子走
//始终保持围绕方向一致
//直到墙上出现一扇门，穿过。
//此处包含由Pendragon教授编写的文本摘录。
//
//- 摘录
//该层级的空间结构为无限负曲率的一维特殊锥形的无限阵列，尽管缺失引力或相对论的属性且是通过直角性的而非最低能级，也就是60度角性的状态排列，却表现出类似充满反物质的宇宙弦的空间几何形状。此处的空间是平移的形式，考虑到无限曲率本身是不可观测的，且会使得空间中的某个奇点的平移无尽头，因为该点的曲率是负无穷的，所以是否具有这种属性令人怀疑。每个奇点都与无限多的相邻奇点接壤，并与每个奇点恰有一个边界。空间的流形不能以任何有限维度的空间为导向，因为每个奇点都可导向它自己独有维度，人员可以经由它进入。通过研究这种结构，人们可能会开始理解为什么我们有时说树状图具有无限负曲率。
//
//- 你已被警告过
//如果你正在读这段文本，我们只能假定你忽略了以上的多次明确警告，并最终选择去探索停车场区域。人生须自重。
//
//切勿转弯，始终保持车库在视线范围内。如果车库离开视线，即刻返回，直到再次看到它。WiFi是从车库发出并向外直线辐射的，因此一旦车库不可见，信号将即刻丢失，并丧失层级中用于导航的唯一地标。记住你的每一次转弯和经过的路灯数。请记住你返回的确切路线，而非在返回时尝试任何形式的捷径。
//
//入口和出口：
//入口
//该层级可经由Level 22切入。
//出口
//经由车库中的一扇门可退出到其他层级。
package lvls9x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl940{}