//Level 999
// 
//
//生存难度：
// 
// 
// 
//Level 999是后室的第1000层，同时为层群 I的最后一层。
//
//level999.png
//对Level 999外观的数字化再现。非照片。
//
//描述：
//Level 999为一悬浮于无边界的漆黑虚空区域的无光热带岛屿。该岛由沙子，棕榈树及水体构成，且均处于完全黑暗状态下。本层未发现已确认实体。坠入岛外的虚空会导致你从岛屿上方重新掉回岛上。
//
//随着在Level 999内停留时间的增加，你越可能产生某种幻觉或自身记忆的幻象（包括你最大的遗憾，以及一生中在后室内外所做的最可怕的事）。上述幻象将开始转变为对自身未来处境的大部分为黑暗且凄凉的设想（例如英年早逝），或对自身更好处境的憧憬（例如如果没有犯某些错误他们会变成什么样的人）。最终，他们的脑中将充满某种以不同声音表现的低语声，嘲弄他们的遗憾及错误。这些声音常被描述为“折磨人的”。
//
//"低语"被描述为一知晓进入Level 999人员的一切信息的个体（可能为生命体）。其很可能为折磨进入本层人员幻象的幕后黑手。以下为该个体曾对幸存者低语过的内容：
//
//“你没救了。”
//“这全都是你的错。”
//“你可救不了他们。”
//“这就是你的末日。”
//“看看你原本可以变成怎样的人。”
//“你绝不可能离开这里。”
//“你在自掘坟墓。”
//“你为此感到骄傲吗？”
//“活该。”
//“你永远无法逃脱。”
//基地，前哨与社区
//本层无已知社区或前哨。
//
//入口和出口：
//入口
//步行数百英里进入Level 998的三号区域。当你最终因力竭，饥饿或脱水昏迷后，再次醒来时，你将发现你已身处Level 999，所有导致你昏迷的不良状态均已消失。
//
//出口
//只有唯一一种方式可以离开Level 999：忏悔你一生中犯下的所有罪孽。每一件。回忆他们很容易，因为低语将会强迫你再次体验它们。不是所有人都能在处于幻象折磨状态下还留有这样做的余力。如果你无法忏悔，根据你所犯罪孽的严重程度，你将会死亡或被送回Level 0。低语也可能会为你决定另一种与你所犯罪孽更有关联的命运。
//
//如果你能完成所有忏悔，低语将会说：“你已被原谅。你可前进至更远处。”此时，你将在Level 1000醒来。这是进入层群 II的唯一方式。
//
package lvls9x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl999{}