//Level 900
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//8198004689_48eff18814.jpg
//Level 900入口和出口连线大约中点的地方的照片.
//
//Level 900 是后室的第901层。 该层级目前已知的两个出口都很难达到，但并非不可能。
//
//
//
//描述:
//Level 900看起来是一个极大但有界的床垫商店。此层级层的宽度与普通前厅床垫店的宽度相似，但是，该层级的长度约为800公里（~500英里）。虽然床垫是该店最常见的家具，但该店还有床上用品、枕头、床架、架子和床头柜。
//
//商店依靠天花板上的荧光灯照明。偶尔，Level 900中也会发现夜光灯和动物标本。进入该层级的流浪者报告称空气中有薰衣草和甘菊的香味。这种香味的来源目前尚不清楚。此外，此层级的墙壁上装饰着各种形状，颜色，大小的捕梦网1
//
//无论你通过哪个入口进入此层级，你最终都将到达Level 900的正中心。换句话说，如果一个流浪者试图从起点走到任一出口，那么将花费他们3天的步行时间。人们发现，离Level 900的中心越远，带有床上用品、枕头、动物标本、小夜灯和捕梦网的床垫就越少。报告称，靠近层级边缘的床垫看起来非常不舒服或很蓬乱，且明显缺少毯子或枕头。
//
//2252949732_95bbe4763b.jpg
//Level 900中心附近带有正确物品的床垫的例子。
//
//虽然Level 900对流浪者没有任何明显危害，但它似乎具有一种反常效应，这种效应会使流浪者比正常人更嗜睡。然而，一些流浪者坚持认为这是因为3天的旅程使他们极度疲倦而不是因为层级本身造成的。
//
//尽管你可能感觉很累，但强烈建议你不要在Level 900的入口区域之外的地方睡着。如果你在没有床上用品的床垫上睡着，醒来后你会发现你又一次被转移到了该层级的中心。但是在带床上用品的床垫上睡觉可以防止这种情况发生，从而节省您的步行时间。如果流浪者能设法醒来，在这此层级内睡觉总是会让他们感觉休息得很好，神清气爽。
//
//成功通过Level 900的流浪者报告说，他们不时会听到音乐盒中传出的摇篮曲。据推测，Level 900中唯一的实体通过他们的口腔唱出这首歌。录制这些歌声的努力尚未取得成功，但歌词和音乐盒的旋律已经被记录在案
//
//实体：
//塔克
//塔克是Level 900中唯一一个已知实体，其只被发现过几次。它们是一种有角的两足绵羊-山羊杂交动物，大约7英尺高（不包括它们的角）。“塔克”这个名字来源于他们穿着的薰衣草浴袍，浴袍在左上方绣有黄色的线。塔克的眼睛似乎没有瞳孔，且会发出类似于小夜灯的柔和光芒。
//
//目前，人们对塔克知之甚少，只知道他们似乎十分被动，且负责吟唱Level 900中听到的摇篮曲负。由于他们庞大的身躯和神秘的天性，大多数遇到塔克的流浪者出于谨慎，都会主动避开他们。然而，一位化名为“Sheppard”或“Shepp”的M.E.G.特工主动研究了塔克并报告了他的发现2
//
//基地、前哨与社区：
//由于此层级的特性，该层级没有已知的基地、前哨与社区。
//
//入口与出口:
//入口
//如果一个流浪者由于精疲力竭而睡眠不足并无意中昏倒，那么他有小概率进入Level 900。此外，在Level 11中进入一个床垫商店有更小的可能性进入此层级。
//
//出口
//Level 900目前只有两个已知出口。第一个位于商店正门外面，可以按照出口标志和墙上的箭头确定其位置。也由于有这些指示，此出口是进入Level 900的流浪者最常用的出口。而第二个出口通向商店的后入口，与商店的箭头方向相反。
//
//前出口
//6615891041_0a938acd6d.jpg
//Level 900的第一个出口，该照片描绘了店面众多变化中的一个.
//
//一旦你走出床垫商店的前门，你就会发现自己身处一条城市街道上，且没有任何车辆或生命的迹象。但是，该街道的声音听起来将与早上高峰时段的典型城市相似。这里经常能听到车辆鸣笛、民众的喋喋不休和街头艺人的声音。
//
//此街道的建筑物的门总是无法接近。且试图离开这条的街道会导致流浪者被传送回床垫店的店面。此外，店面本身的外观会变化，但一定能在 前厅中找到与之对应的店面。
//
//流浪者在离开床垫商店时还会闻到一股明显的咖啡味，这会立即使疲惫的流浪者恢复活力。跟随这股香味，你会发现一辆装满咖啡且乎无人管照的手推车。从该手推车中拿出，调制并喝掉一杯咖啡即可切出Level 900
//
//喝完咖啡后，你的最终到达的层级完全取决于你如何调制咖啡，如下所示：
//
//不加任何牛奶（或奶油）: Level 91
//不加咖啡因：回到Level 900的起点
//一勺糖: Level 817
//两勺糖: Level 512
//三勺或更多的糖: Level 6
//一袋奶: Level 153
//两袋奶: Level 6.1
//三袋或更多奶: 似乎是随机的
//一勺奶油: Level 176
//两勺奶油: 似乎是随机的
//三勺或更多奶油: Level 0
//一袋奶, 一勺糖: Level 98
//两袋奶, 两勺糖: Level 67
//一勺奶油, 一勺糖: Level 480
//两勺奶油, 两勺糖: 似乎是随机的
//目前正在对其他组合进行进一步测试。
//
//后出口
//368245073_8585c4ad42.jpg
//Level 900的第二个出口。该照片描绘了能使流浪者离开这一层级的床垫。
//
//离开床垫商店的后出口后，你会发现自己身处一个与普通城市街道十分相似的封闭区域。与此层级的第一个出口不同，该区域非常安静，只能听到远处车辆的声音。到达这个出口的流浪者还报告说他们闻到了微弱的烟味。
//
//在这个封闭区域内，流浪者可以找到一张看起来十分凌乱的床垫、一盏破灯、两个枕头和一条脏兮兮的毯子。要从这里离开Level 900，你必须睡在该床垫上，醒来后你会发现自己身处Level 11。
//
//
//
//这一路下来都没睡着，嗯哼?
//« Level 899 | Level 900 | Level 901 »
//
//Footnotes
//1. 捕梦网是一种通常被挂在墙上的物品，由美洲土著中的第一民族手工制作，其中最著名的是奥吉布乐队。这些手工制作的物品传统用于保护儿童睡眠。有人说，在太阳升起之前，捕梦网会诱捕所有的噩梦，从而保护人们。
//捕梦网代表着生命，而编织的网（通常用珠子装饰）与庇护土著儿童和当地人民的蜘蛛女， 阿西比卡什，有关。因为土著人民开始在全国各地旅行并传播，所以阿西比卡什无法轻易地接触和保护他们。因此，奥吉布人精心打造了捕梦网，以伸长蜘蛛女的触角。
//
//2. 译注：此链接在原文就是空的。
package lvls9x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl900{}