//Level 972
// 
//
//生存难度：
//等级 阿特拉斯
//
//不安全
//有神明存在
//极端宗教元素IMG_5590.jpg
//一名未知流浪者在 Level 972 中被“审判”的图像，其四周的无面灵在一段时间之前已经消失。
//
//介绍
//Level 972是后室的第973层。
//
//该层级是一块大平原，天空永远保持湛蓝，且层级内存在大量无面灵。
//
//描述：
//该层级是一块大平原，部分区域多云，且此层级的天空释放了一种可能是甲基苯丙胺的气体。无面灵挤满了这个层级的各个部分，使得流浪者彼此隔离。这些无面灵无法被强行移动，因此流浪者几乎不可能从它们中通过。无面灵朝着太阳的方向移动，由于流浪者无法强行移动它们，流浪者会被无面灵推着移动。
//
//ht返S;回dd*E
//附录 1
//
//Level 972 似乎会主动地将流浪者带入此层级，大量流浪者声称他们在被此层级“抓获”之前，好像看到了无面灵的身影。然而这些“无面灵”事实上并不是无面灵，而是其他人类的面部被毁容到超出想象的结果——鍙脸鍑上哄幓埇完濂全消鎴戠失。该现象第一次被发现是 u/bitcha33m0fo 于 Reddit 发布消息称他发现一个无面灵有着与他伴侣失踪前相同的衣着。随着时间的推移，关于类似事件的报告越来越多，足以证明这一猜想。
//
//
//这些无面灵会始终推动生物直到它们感知到更强大能量的存在，这种能量的拥有者被称为“伪神”。这不是在前厅中已知的任何特定的能量，而是在这个级别中发现的一种无所不能和无所不知的神力。它开始与人交谈时（最有可能是心灵感应），会完全“审判”该人，看他们的罪恶是否超过他们的善行。 与此同时，四周无面灵的数量开始减少。
//daw反/cr回aEog
//附录 1.5
//通过多次测试和通过无人机对无面灵的观察，得到了一个结论。伪神似乎用谎言说服了自己，它相信自己是神明，所有在后室的人都必须崇拜它。它使他人“崇拜”它的唯一方法是进行无面灵转变进程。它派遣这些无面灵随机带走流浪者并“审判”他们。
//
//
//如果神力认为进入层级的人类是“圣洁”的，那么这个人就会上升到云层中，然后坠入Level 63。作为“圣洁”的奖励，流浪者会发现一些补给出现在他们身旁，包括杏仁水或武器和其他食品，皇家口粮的发现也被报告过多次。如果它认为这个人是“罪恶”的，流浪者会穿过地板然后落至Level 666，流浪者之后的命运已被决定。
//基地、前哨和社区
//由于在此层级的特性，人与人互动是不可能的，因此没有已知的基地、前哨站或社区。
//
//a.返lKjf回hjd
//附录 2
//
//在此层级有一个有极端宗教信仰的宗教团体，被称为 “ >\%{{*=追随者” 。他们是一个极端敌对的团体，由已经或正在进行无面灵转变流程的人类组成。有人看见他们偷偷接近并绑架流浪者的过程。他们崇拜这个层级中的伪神，并在这个层级中的田地和城市中出现。他们是充斥在任何刚进入此层级的流浪者四周的无面灵。理论上，这些无面灵是在为流浪者设下阻碍，他们知道并确保流浪者被困在他们之间，大概是为了限制他们的行动。在此层级的城市区域，他们充伪神的传声筒。
//
//实体
//无面灵
//
//这一层挤满了大量无法强行移动的成年无面灵，这些无面灵将阻止人进一步深入。它们似乎不会消失或移动到其他地方，因此它们只是在那里充当屏障。
//
//伪神
//
//这个实体是此层级独有的，一些流浪者对其外观描述与“上帝”的外观相似。它在此层级是全知且全能的。此实体只能通过视觉幻觉才能观测到，因此不同流浪者可以在多个的地方的同时看到它，给予伪神看起来是无处不在的错觉。这个实体也可以使流浪者切入或切出此层级，但它被限制在此层级，理论上伪神就是层级本身。
//
//入口与出口：
//入口
//持有来自任何宗教的任何宗教物品可能会随机切入此层级。
//
//出口
//当此层级的特殊实体发现了你，若它认为你是 "君子"，你会被切入 Level 63；而你若被视作“罪人”，你将被切入Level 666。
//
//快>%{{*=！
//Level 972 - 你的罪恶已被揭露.
//
// 
//
//生存难度：
// 
// 
// 
//89FA6C25-C794-4D58-B382-7EBBCFE9A4E2.jpg
//Level 972 的城市部分
//
//描述：
//Level 972 呈现一个被摧毁的世界。在此层级，流浪者可以听到明显失真的人类尖叫声音。此层级的天空颜色深红，并释放出气体，使流浪者很快感受到极大的压力。人们很容易在 Level 972 迷路，因为有成群的实体阻挡了道路，这意味着穿越 Level 972 几乎是不可能的。更糟糕的是，流浪者必须穿越 Level 972。因为如果不一直奔跑，将被伪神发现。如果被抓住，那流浪会处于极大危险之中，没有一个流浪者在被伪神抓住后幸存。
//
//"非fij=oia+rjf"
//前哨
//上帝保佑我们/半身人1
//这个哨站由被困在此层级，拥有宗教信仰的流浪者组成，他们一直在逃亡，几乎不可能找到他们。他们似乎在此层级崇拜伪神。他们并不怀有敌意，但最好不要与他们互动，因为有流浪者看到他们蓄意让流浪者落入伪神之手。
//
//实体
//伪神
//
//这个实体是此层级主要的威胁，并一直追逐流浪者。它知道此层级的所有流浪者的位置，它的移动速度仅仅略慢于成年男性的奔跑速度。此实体极端敌视流浪者，据推测具有很强的感知能力，但无从证实。
//
//其他的实体包括猎犬，笑魇，窃皮者，地栖怪，死亡飞蛾，肢团和牧蛇活跃在此层级。传言栖居者也在此层级出现，但M.E.G.尚未证实。2
//
//入口与出口
//入口
//
//唯一证明的进入Level 972的方法是由一个邪教成员带入。
//
//出口
//
//ja审\=判Dk…或{-f救!gfD赎
//
//作者信息
//« Level 971 | Level 972 | Level 973 »
//
//Footnotes
//1. 译注：原文为Halflings。“半身人（Halflings），他们所出名的不是勇气，而是贪婪和对美食的渴求。”——bing 词典
//2. 译注：本段实体超链接由译者添加。我想没人记得地栖怪，牧蛇，栖居者吧（
package lvls9x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl972{}