//Level 945
//目前正在调查该层级发现者Elijah Makaraig的下落。下文中包括了初次探索期间记录的日志，其中有多处数据损坏，希望我们能找到恢复数据的方法。
//
//—— 监督者 B
//
//我希望你回家。
// 
//
//生存难度：
// 
// 
// 
//lake-945.jpg
//Level 945内岛屿的航拍图。
//
//Level 945是后室的第946层。它是一片无尽海洋，中心有一座岛屿，由Elijah Makaraig发现，并由“导火索”兵团指挥Micheal和Narda Makaraig在一次搜救行动中进一步探索。
//
//日志 2021/12/6
//采访日志 2021/12/6
//7:21
//“生命线”刚报告说跑了两个病人。肯定是他们昨天送来的那几个孩子。我担心他们可能会跑的太远了，毕竟其中有个还在养伤。目前，来自Level 11基地的志愿者正在负责相关事宜。
//
//11:10
//Harry收到了伽马基地的消息，说他们发现了一个符合特征的女孩，准备派人去接她，但人员失联了，我想现在事情全靠我了。希望他们派来的人只是单纯迷路了，那还算走运。
//
//12:04
//坏了，刚才有两个人从这层消失了。更麻烦的是，这狗日的电梯还卡住了，我怀疑是别的什么东西干扰的，也有可能就是这个地方太古怪了。我得另寻出路。
//
//15:20
//对我来说，幸运的是我现在能直接去别的层级了，不幸的是我找到了他们派来的人，还有那女孩。那女孩还活着，实际上她似乎根本没注意到自己面前就有人的尸体。尸体边上还有些软踏踏的鸟尸，他的死因很明显。
//
//我把那女孩（她跟我说她叫Narda）带到了欧米茄基地。她确实没什么大碍，由于她明显不想和照顾她的人聊天，我接下了和她交流的任务。
//
//描述：
//Level 945是一片看起来无边无际的海洋，中心有座岛屿。海的洋流都流向岛屿，理论上那里是层级的中心。岛上是一座四周由陆地围绕的湖泊，云雾缭绕。该层级被发现于Elijah Makaraig在M.E.G监护下失踪后。
//
//此地衰草寒烟，可不知为何，你却得其门而入。你在追寻谁？——当人们告诉你，这一切之后他也会一直待在你身边时，你能听到他吗？——
//
//Level 945是一片无边无际的海洋，海的洋流都流向一座据说是层级中心的岛屿。岛屿的中央满是雾气，与层级似乎一直晴空万里的天气形成了鲜明对比。
//
//你对他的最初印象是什么？就是你另一个父亲和无数医生让你回忆的那个人。
//
//Level 945的昼夜周期与前厅相似。该层级只有两个季节：夏季和雨季。该层级属于热带气候，气温一月最低，五月最高。
//
//你六岁的时候，你问他这个世界是怎么来的，他给你讲了个故事，说是一只蓝色的鸟把人类从竹竿里放了出来，你又问这鸟会不会吃人，你父亲笑了。
//
//Level 945的岛屿中央有个大湖。是由类似山谷的结构形成的，湖的结构表明它是在部分陆地坍塌后形成的。这座湖也是虾虎鱼（Mistichthys luzonensis），世界上最小的鱼1。
//
//后来你给他画了张蓝鸟的画，画的很粗糙，但他把它裱起来，放在办公桌上。
//
//你还可以在原位找到那副画，一年前你闯进他上锁的办公室时看到过
//
//Level 945是一片看起来无边无际的海洋，中心有座岛屿。岛上是一座四周由陆地围绕的湖泊，云雾缭绕。由Elijah Makaraig发现。
//
//Level 945是一片无边无际的海洋，中央有座岛屿
//
//Level 945是一片无边无际的海洋，中央有座岛屿
//
//Level 945是一片无边无际的海洋，中央有座岛屿
//
//Level 945是一片海，中央有岛
//
//Level 945是一片岛，中央有海
//
//Level 945
//
//Level 945
//
//Level 945是一座房子，房子的白色外墙被岁月风化。房子有着红色屋顶和一座小花园，静谧地立在水泥车道间。房子里有三间卧室，还有阳台，从那里可以看到不远处的山丘，视野非常好。这座房子的价格也在你的预算内。
//
//我觉得你应该会喜欢这里良好的通风条件，所以也许你不用担心 Elijah了？
//虽然夏日炎炎，但从这边过去就有几家商店。供水和供电都不错，你真的不用担心 Elijah看我看我。会坏掉。
//
//这倒不错……我上一间公寓的房东花了很长时间才把东西都修好，实在是令人沮丧，特别是我还有个 呼吸，深呼吸好吗？ 孩子，而且我工作很忙，不能再分心于维护了。
//
//我知道了，请问你的孩子几岁了？ 还记得我跟你说过什么吗？数到三……
//
//哦，她七岁，六月份就要上一年级了，这就是我换地方住的原因，我想找个离她学校和我办公室比较近的地方。 吸气……呼气……看吧？
//
//你是教师吧？我记得你提起过你给高中生教科学，对吗？
//
//对，我不得不辞职。需要一个教学的新环境。
//
//Rommel……我觉得咱们买这里是个好主意。
//
//那邻居……怎么样？ 别急，别急。你先休息吧。我会带你离开这里的。
//
//噢，别担心，这儿的大多数人都是独来独往，你完全没必要担心你和你男朋友。
//
//那就好……哦！你去哪儿了？
//
//这是你女儿吗？哇，她和你长得一模一样！我也有个和她一样大的孩子，你想不想见见他？
//
//你都长这么大了……
//
//好啊！
//
//抱歉，Elijah……
//
//错误
//无法打开该文件，它可能已损坏。对于给您带来的不便，我们深表歉意。
//
//加载中……
//
//正在打开 emmak.note ……
//
//我不知道该说什么，可能只是我觉得自己被骗了，真的。你知道吗，在我上大学离开你的前一年，我得过一段时间的抑郁症。我那时想的是你怎么一年比一年衰老，会不会有天我回家时，会发现你已经走了。这想法很荒唐，那时你也就快47岁，但我所意识到的是，我比你活得更久的这一事实，这令我无比悲伤。你为我做了这么多，而我觉得自己还没有对你的离开做好准备。
//
//但现在我又见到你了，我不知道该作何感想。
//
//我知道这很虚伪，但现在就让我和Narda独处吧。我希望Narda能忘掉你，也希望自己能忘掉你。
//
//再见，爸爸，我爱你。
//
//关闭
// 
//
//生存难度：
// 
// 
// 
//lake-945.jpg
//Level 945内岛屿的航拍图。
//
//Level 945是后室的第946层。是一片看起来无边无际的海洋，中心有座岛屿。
//
//描述：
//海的洋流都流向岛屿，理论上那里是层级的中心。岛上是一座四周由陆地围绕的湖泊，云雾缭绕。由Elijah Makaraig发现，并由“导火索”兵团指挥Micheal和Narda Makaraig在一次搜救行动中进一步探索。
//
//该层级的昼夜周期与前厅相似。由于浓雾的阻碍，M.E.G.并未探索岛中央的湖泊。目前没有在该层级中遭遇或目击实体的记录。
//
//探索日志 - 导火索 兵团 - 1
//探索日志 - 导火索 兵团 - 2
//16:50
//将损坏的文件归档后，我们开始着手搜索所有关于无尽海洋和岛屿的层级。通过广撒网，我们发现某位高级档案员近期曾经过那个文件中反复描述的层级。他们告诉我要小心行事，因为这层里存在某种东西。我虽然不知道他们是不是在胡说八道，但这层确实没人在，而且我已经在岛上呆了几个小时了。
//
//17:15
//我发现那个女孩藏在我船上。Narda，她躲在我带来的一个袋子下面。我本来想告知伽马基地，告诉他们把她弄丢了，但她让我不要这么做，实际上是求我不要，我就放弃了之前的打算，毕竟她看起来像是被吓坏了。
//
//19:00
//已经找了两个小时，仍然没有发现女孩哥哥的踪迹。这座岛要比我预想的大得多。我觉得这里的森林愈发安静了，但Narda似乎并不为此担心。
//
//19:40
//那孩子跑了！她拔腿就跑，我追上她之后她一直指着远处，摇晃我的手臂。我走近一看，看到了雾气的尽头。
//
//基地、前哨和社区
//Level 945没有任何基地、前哨或是社区。
//
//入口和出口：
//入口
//循着Level 18的流水声可以抵达该层级。
//踩入Level 200的水坑，有极低概率抵达Level 945。
//出口
//在岛上停留一周，会将人员传送至Level 62。
//在水下屏息两分钟，会将人员传送至Level 944。
//逆流而上，会使人员传送至Level 4。
package lvls9x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl945{}