//Level 901
//评分: 
//+6
//+
//–
//X
// 
//
//生存难度：
//等级 2
//
// 
// 
// 
//level901
//一张Level 901景象的照片。图中的浓烟清晰可见。
//
//Level 901 是后室的第902层，也是资源采集及物品生产的主要层级之一。
//
//描述：
//Level 901是一大片可能没有尽头的陆地，含有多种资源，一个独特的生态系统和一片广阔的森林——流浪者初到这一层级时会发现自己身处其中。
//
//整个层级完全没有颜色，因为Level 901的灰色外观是由表面反射或光线缺乏造成的。
//
//起初，当7位探索者在调查Level 11内的一间本地仓库时意外发现Level 901后，这一层级据信是TH3 SH4DY GR3Y的一个新入口。
//
//另一方面，进一步的探索则表明Level 901与TH3 SH4DY GR3Y之间并无联系。
//
//进入后，流浪者会发现自己身处于一片名为“生命之奥秘”的森林中。此地因位于“这片黑白相间的地狱”中却具有宁静祥和的自然环境和看似优越的美景得名。
//
//这片森林因敌对实体的缺乏而相对安全。然而，离开上述森林后，流浪者会进入这一层级的主要部分，由广袤的平原，山丘及众多河流组成。
//
//secretsoflife
//“生命之奥秘”
//
//与森林不同，平原因其中存在的大量实体而危险且充满敌意。
//
//强烈建议流浪者留在森林的边界以内，因为穿越平原有将自己暴露于敌对实体的风险。许多实体倾向于隐藏在小型灌木或较高的草丛后，并准备捕捉，虐杀视野内毫无防备的流浪者。
//
//资源：
//平原部分虽然危险，但也储存着Level 901内绝大多数可获取的宝贵资源，包括但不限于：煤炭、铁、铜，锡以及黄金。
//
//矿产和岩石的丰富储量使得这一层级可作为众多组织的主要矿产基地以支持他们位于后室各处的设施。
//
//在上述资源中，煤炭最为常见，也是Level 901内的主要能源。因此视野内大部分区域充斥着工厂的浓烟。
//
//在这一层级中工厂十分常见，因为大部分矿物和岩石都在层级内加工。成品则由车队运送出口至各个地点。
//
//森林是木材和食品的主要来源。许多流浪者建设了农场以期获取稳定的食品收入并提供给层级内人口。
//
//大量野生动物也生活在森林中，因为其中大部分似乎都畏惧平原上潜伏的敌对实体。
//
//Level 901也是工业发展的主要地点之一，并负责所有制成品中约26.3%的部分。
//
//在M.E.G.完成所有对L901的持续探索后，全部可获取资源将记录于该文档后部。
//调查：
//factory
//出现于 Level 901内部的众多工厂之一。
//
//由M.E.G.和一些其他组织发起的调查表明，由于这一层级的迅速工业化，空气质量急剧下降，平均温度以惊人速度增长，动植物也受到了严重的消极影响。
//
//这些调查引发了诸多抗议和法规制订，以减少上述工业化对层级造成的损害。
//
//归根结底，我们不想重蹈在家时的覆辙，不是吗？
//城镇：
//城镇由Level 901内的幸存者创建，是Level 901所有居住者的家园，为所有居民提供住所、食物和水，利用层级内的资源自我维持，并在必要时进行扩张。
//
//城镇的大部分位于森林边界内。然而，某些部分建造于上述边界之外，以作为任何来袭危险的瞭望塔。
//
//这些瞭望塔事先及时发现实体袭击并通知居民进行自我防卫，从而防止了许多灾难。
//
//还应指出的是，城镇正在不断扩张，因为大量新迁流浪者涌入，并且一直在矿井中寻找工作。
//
//城镇也持有多种医疗设施，能够妥善处置任何伤病的流浪者。
//
//实体：
//这一层级中出现的主要实体包括雌性和雄性的死亡飞蛾，肢团以及窃皮者。同时大多数团体决定在白天探索，而在夜间休憩，因为夜间也有笑魇和碾压者出没。
//
//他们在白天藏匿于洞穴或更加黑暗的地方。笑魇不会从上述地点外出，但碾压者会攻击距离过近的流浪者，即使在黑暗区域以外。
//
//M.E.G.正在调查Level 901的动植物群落。
//如果您有任何关于Level 901动植物的信息，请向距您最近的M.E.G.前哨报告。 一切信息都至关重要!
//一旦我们获得足够的信息，且记录了Level 901全部特有动植物中的大部分，我们将更新这篇文章。
//基地、前哨与社区：
//B.N.T.G.矿业社区901:
//对流浪者友好
//持有Level 901内最大的矿业前哨
//由大约1877名居民组成
//额外为所有工人和需要休憩的流浪者建立了一座城镇
//M.E.G.矿业基地901:
//M.E.G.在Level 901内的主要基地
//持续供应后室内其他的友好基地和社区
//由大约2949名居民组成
//正在进行沿直线植树的实验，以期创建安全获取资源的走廊
//L901的幸存者：
//没有领导的幸存者团体
//由大约515名居民组成
//建设了“城镇”为居民提供住所，食物和水
//受M.E.G.保护
//入口和出口：
//入口：
//若想进入Level 901，你必须进入Level 11的一间仓库或工厂，并通过墙壁或机器切入。
//
//通过Level 937进入Level 901同样可行。要这么做，你必须向北走，直到注意到周围环境的颜色突然变化。一旦颜色的变化稳定到上述灰度，你将进入Level 901内。
//
//出口：
//若想退出Level 901，请在森林中部找到一个宽阔的洞穴。这种洞穴可以轻松地进入Level 11，任何由此进入的流浪者，连同任何资源或货物，都将切入Level 11的特定位置，那里建造了一个终端以处理所有的运输和储存事务。
package lvls9x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl901{}