//Level 974
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//vLw1fuPrpe5Nm7D.jpg
//一张"Kitty" 站在Level 974的门道中的照片
//
//Level 974 是后室的第975层。
//
//描述:
//Level 974 是一栋中等大小的房屋，内部整体以粉红为主色调进行装饰。屋内看上去并不存在能够通往屋外的实体门扉，同时本层中的窗户只会显示出艺术画作，其内容描绘着人们在室内向外看时通常能看到的场景，但是进行了高度的“可爱化”。
//
//由于其有限空间的性质，本层中只有少量能够进入并探索的房间。本层中包含：一间普通大小的卧室，一间主卧室，两间浴室，一间客厅，以及一间拥有开放式厨房的餐厅。供水供电系统在Level 974中正常运行，同时这里也能够找到稳定的Wi-Fi连接。这些生活设备现已被证明可以安全使用，而流浪者们身处这一层时使用这些设备的做法也是被支持的，因为他们在一段时间内有可能很难遇到另一个这样的安全地点了。
//
//本层独特的奇异风格在于其中粉红色和蜡笔画式的风格装饰：墙壁、家具，甚至是电器都具有这种引人注目的装饰风格。这些物品上通常贴了一些前室中人们熟悉的吉祥物形象，比如一些三丽鸥和San-X的角色。
//
//在这里可以找到很多生活消耗品，例如甜腻棉花糖以及在前厅中常见的各式食物，这些消耗品能在厨房的冰箱和食品储藏柜中找到。这些食物本身品质良好，而且食用它们是绝对安全的。从食品储藏柜和冰箱中拿走的任何食物最终都会以未知的方式补充。
//
//实体
//只有一已知的实体定居在Level 974：这一实体被称为“Kitty”。Kitty是一3.2米高的人形实体，具有长到不自然而又缺失手脚的细瘦肢体。这一实体的皮肤为哑光黑色，纹理与皮革相似。它看上去也缺少任何外形上的面部，但被认为能通过其他的方式如同大部分流浪者一样看、听、闻。在移动时，Kitty能够平滑且迅速地行动，当出现在没有意识到其存在的流浪者周围时，它经常会吓到他们。
//
//这一实体目前没有展现过任何形式的敌意，而是会在流浪者在Level 974中探索与休整时跟踪他们。
//
//基地，前哨与社区
//本层没有已知的基地、前哨与社区。
//
//入口和出口:
//入口
//如果一名流浪者在进入一新的层级时携带了任何被认为“可爱”的物品，就有极小的可能性被送往Level 974 而不是通常会被送往的地方。
//
//出口
//离开Level 974唯一已知的方式是给予Kitty一件你来访前持有的“可爱”物品。这个物品可以在你待在这里的任何时候给予Kitty。将礼物给予Kitty后，你会立刻陷入睡眠，然后在一个安全的层级中醒来。
package lvls9x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl974{}