//Level 944
//除了有进无出之外，我们尚未明确有关这一层级的任何信息。几乎我们所掌握的全部内容都是由一个名叫Gani的人提供的。尽管无法证实内容的真实性，但鉴于之前与他的交流来看，我没理由质疑。
//
//—监督者 Stretch
//
// 
//
//生存难度：
// 
// 
// 
//只是提醒，我给你写这封信的原因只是想让你别再把人往那扇门里送了，因为我不想去那儿了。我的事儿已经够多了，而你却想探索这恐怖地方的每一处边边角角。你已经送了五个人进去。五个。你能承受多少就这样被扔进未知领域的损失？这种活计都让我困惑为什么还有人愿意给你干。你现在应该知道了，有些事情最好别掺和。
//
//描述：
//想要准确描述这个地方应该蛮难的，因为我怀疑它的样子可能因人而异，但我起码可以告诉你它在我看来的模样。
//
//我在一艘位于海上的小船上醒来，身边围绕这刮骨寒风和倾盆大雨。狂躁的风和水裹挟着我，偶尔有电闪雷鸣乍起。海浪拍打摇晃我的船舷，随时都可能将其倾覆。我很确信，这样的经历对我来说独一无二，虽然我在风暴中什么都看不见看不清，但我知道自己以前坐过这艘船，区别是这次只有我一个人。
//
//我已经很久没有坐过船了，实际上我一直竭力避免这样，但过去总会追上来，你跑不远。尽管我中断了航海生涯，但很多技能永远不会生疏。肌肉记忆促使我冲向船舷，扯住船帆，拼命地想要抢回控制权。我把身体全部重量都压在上面，希望自己能够凭借一己之力承受这场风暴。但无论怎么努力都是徒劳，风暴并没有给我多少操作的空间。我也不知道自己坚持了多久。三十分钟？四十分钟？又或者只有十分钟？后来我甚至放弃了去掌控船帆，只是坚持着活下去。
//
//最后，我的手臂屈服了，我被甩了下去。当我陷入冰冷的深渊时，风雨被汹涌的波涛所取代。我懂水性，但在这样的波浪下完全无计可施。我用力挣扎，心里尽是无助恐慌的感觉。我的脑袋渐渐在水下呆的越来越久，直到再也浮不起来。精疲力尽的我被拽到更深处，而我对此无能为力。
//
//我确实死过几次，但最痛苦的还是溺水。我屏住呼吸直到肺部燃烧，喉咙抽搐。我的身体如此渴望呼吸，以至于仿佛无视了这样的事实：我张开嘴的话，只有海水灌进来。有人跟我说过，一个叫Houdini的人可以憋气整整四分钟。我想我肯定没有坚持那么久，但感觉上好像过了几个小时。视线渐渐昏花，海水最后还是流进了我的肺里。
//
//海面距离我如此遥远，感觉非常不真实。随着我越沉越深，某种诡异的平静感席卷了我。我甚至不再尝试去自救了，只是感到累。
//
//我合上眼。
//
//我醒了，大口地喘息着。身体上的疼痛虽然消失，但恐惧依然麻痹着我的头脑。这就是我葬身之地吗？我难道注定要一次次地重复死去？这是为什么？我为之奋斗了如此之久，而这就是我获得的回报？我并不总是诅咒我的不死之身，但那天我确实这么做了。我几乎希望老板就这样让我自生自灭，那样事情应该会简单很多。我实在没有力气和那船帆搏斗了，所以我只是躺着，等着狂风把我卷走。
//
//我不知道是层级觉得我死透了还是我通过了某种测试，反正就在那时，船的甲板裂开，露出了一块连黑暗都不存在的虚空。宇宙自我坍塌，我感觉自己的思维被撕扯成一千块，又被粗暴地缝合。我的意识被某种伟力所掌控，它猛烈地摇晃着我，然后又小心翼翼地把我放在柔软、潮湿的地毯上。
//
//我从来没想过自己会在再次看到那黄色墙纸时那么高兴，尽管我曾在这里追踪过不少尸体，但我还是庆幸自己又能脚踏实地了。盯着天花板刚看了几分钟，就有一个想法在我的脑海里升起：“得加薪。”
//
//剩下的你可以自己补完，我还有些工作要做，但请你，请你别让其他人靠近那扇门了。
//
//实体：
//该层级没有已知实体。
//
//社区和前哨站：
//该层级没有已知的社区或前哨。
//
//入口和出口：
//入口：
//Level 944偶尔可经由Level 18某扇风化的木门进入。
//
//出口：
//未知。
package lvls9x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl944{}