//Level 924
//好吧，我是M.E.G的一名数据库维护员。他们告诉我如果在库里发现任何奇怪的的东西都要记录下来。所以我写了这篇笔记。以下为我的发现。
//
//我在值班时在普通层级列表中发现了个奇怪的东西。这是它的链接。 (http://www.meg-archive.com/normal-level-list-1)
//
//总而言之我发现923层与925层间的Level 924没有链接入口。我对此有个还不是很确定的解释。
//
//我感觉这条好像就是单纯被删了。
//
//你猜怎么着？我要去查查。它可能已经被归档了而且具有重要价值。
//
//好，找到了。而且从链接上来看它确实被归档了。跟我猜的一样。
//
//这条看起来好几年前就被归档了，但是不知道为什么又从列表里消失了。好吧，反正就是这样。
//收起条目：
//1.png
//我去。这还是个旧条目。
//
//Level 924为后室的第925层。
//
//描述：
//Level 924是一个充满活力又多彩的大城市，许多人似乎都生活得很快乐。该层共有两个主要区域。郊区与镇子。所有房屋或公寓都住着住在Level 924的一家人。
//
//这条开始恐怖起来了。至少在SPaG1的部分上就有问题。
//
//郊区有许多房屋和公园。它们都可以居住而且很安全。所有房子都有全套家具和电力供应。所有厨房都有食物，并由在商店买补给品的人定期补充。可以在很多地方看到水塔。它们都是人们的供水来源。Level 924有许多不同的居民住在一起，他们共同工作来创建一个生态系统。经营商店，饭店或其他工作。所有人都快乐。
//
//等会，有人住在那？工作？补给！？
//
//镇区是所有人开车去工作并完成他们的日常任务以养家的地方。工作包含从小收银工作到在核电站工作。本层的科技水平在40年代至60年代之间。这里的货币用来为许多家庭购买补给。这里似乎没有出现实体。只有很多不同的人和宠物在正常生活。
//
//Level 924对后室的居民来说非常好，因为它的物资似乎是无限的。这里的一切只是完美的日常生活。
//
//前哨和社区：
//目前还没有。但是我们会在未来试着送更多人到这里。
//
//入口和出口：
//入口：
//找到一张50年代的海报，上面画着一个在美丽社区里拥有着美丽家园的佳廷2。把你的手放在上面并希望自己在那里。我们一直在收集这些海报以便尽快能分发给其他人。我们很快就会都安全了。
//
//出口：
//我们不需要离开。我们有一切需要的东西。一切都是完美的。
//
//“佳廷”？你不能校对一下吗？这篇甚至连个页面导航都没有。
//
//等会，你是说这个层级可以容纳并养活后室里的所有人，但这条却被删了？
//
//为什么？需要重写？它应该被人们知道！
//
//如果我们可以去那的话我们为什么还要在这个鬼地方受苦？
//
//我们可以彻底安全！可以有家庭！可以有个正常的生活！我需要去找找这些海报。我需要亲自看看。我要把这个笔记当作日记：
//
//第一天：出去找海报。从11往Level 4走。应该不会太难。只要找到个能把我送到那里的房子。附注：找到一个通往3的建筑！
//第二天：经过数小时的徒步和一次与猎犬的亲密接触，我感觉我要——刚刚听到了尖叫声。继续前进。我会回来的。
//第四天：刚才去了Gamma基地，他们给了我一些物资并把我带到了一部电梯里。跳了进去。请带我去Level 4…然—后—凭着我的狗屎运我抵达了Level 5！唉…我应该在11层的时候就找个通往Level 4的入口。
//第五天：打开一扇门并发现了大群死亡飞蛾！正是我要的！难怪我没搞到探索工作。我全程一直在抱怨。据说我得找到一个通往Level 4的旧楼梯，但我这辈子从来没在5层看见过什么鬼楼梯，我还得继续前进。
//第八天：找到一个楼梯！我终于抵达Level 4了！除了在Level 5的壁纸上看到一张奇怪的脸外没有发现其他异常现象，不过那应该只是我的想象。
//第九天：好，找到Omega基地了！我找到了一个正返回基地的M.E.G.踪迹制图者小队，我决定跟着他们。现在，是时候问问他们的储藏区里有没有任何描绘幸福家庭的古怪海报了。附注：没有。我翻遍储藏区也没找到任何线索。他们让我去Level 1的Alpha基地找找看。他们给了我一个GPS，我的探险应该更容易了。
//第十一天：已经快过去一个星期了，现在我终于找到了一部电梯。Level 4的条目还没有更新，但据说这层的电梯或楼梯可以通向Level 3。希望它也能通向Level 1。我不会再回到这里的。附注：我还是回来了。
//第十二天：呼！凭运气我在24小时之内找到了一扇通往Level 2的门！我很惊讶。我会把找到的东西放在这里。
//第十三天：我去办公区EL3A简单休息了一下，我已经徘徊好几天了，还好GPS预先标记出了这个地方。我会在休息过后明天再次出发。
//第十四天：重新出发，我找到了另一个入口，正要打开它。猜猜怎么着？我又回到4层了。我最好继续前进，我听到通风管道里有什么东西。
//第十六天：找到通往Level 1的另一扇门！我发现一个肢团正追着我，当我关门挡住它后我发现我已经离我进入的地方跑了相当远的一段路。GPS标记出了Alpha基地和贸易者堡垒。我现在正朝着Alpha基地前进。希望不用在贸易者之窖里再找一遍。
//第十七天：成功抵达Alpha基地！多亏了这个方便的GPS。我听说这是M.E.G.的新发明。但这不是重点，我终于找到了海报！整整四堆！海报的储存量甚至有点吓人。没人知道这些海报为什么没被发出去。好吧，我拿了一张，打算现在在基地外使用它。我会把这个条目和笔记重新发布到层级列表里好让所有人都看见，明天我会告诉你们都发生了什么。
//第十八天：这地方太美了！我必须把这里的一切都记录下来。我现在正在一条房前的街道上。每栋房子的色彩都很鲜艳。黄色，粉色和明亮的蓝色。汽车是条目中提到的40至60年代版本的汽车。这里的人也穿着相同年代的衣物。我不知道这里的居民是实体还是真正的人类，但这地方实在是太神奇了。湛蓝的天空，翠绿且修剪得完美的草坪。所有事都很完美！还有一些提到某些事的旧警报，像是“战争将要结束，一切将重归和平。”，“你不再受战争的威胁。”…等下，有人在向我打招呼。
//第十九天：我不敢相信！我遇到了一个神奇的家庭，一对父母和三个孩子。他们让我住在他们家因为我现在无处可去！昨晚我还和他们一起共进了晚餐！是看起来非常完美的意大利面！尝起来也很完美！虽然我感觉有些头晕。好像我吃了一堆粉末但它的感觉和味道还是非常完美！我们交谈了好几个小时！包括即将结束的战争！我甚至有了自己的房间！有点尴尬的是我的鼻子一直在流血。我平时不怎么容易流鼻血，所以我不知道这是怎么回事，但是我在乎它吗？不！….我的嘴在流血…多么美的地方啊！
//第二十天：我玩的很开心！走过海滩！我的皮肤有点发红。我涂了一些防晒霜但却更痒了也没有恢复正常不过会没事的！我只痉挛了几次而且我感觉良好！我还在流血，我的头发掉光了，但一切都很好！我不想离开！
//M.E.G.事故报告：
//于Level 4发现一具性别与来源均不明的尸体，以胎儿体位右侧卧躺在地上。尸体被高度辐照且其表皮似乎被烧伤至通体漆黑。由于防护服储备量较少，两名M.E.G.人员护送尸体至Omega基地进行进一步分析。
//
//实验室报告显示，在受害者胃部发现了超过一千（1000）克灰烬，岩石和木屑，并造成了严重的内出血。受害者因此受到极大伤害。确认受害者的死因为高剂量辐射造成的辐射中毒。
//
//为所有流浪者的安全，M.E.G.正试图找出尸体的来源及其死亡地点。
//
// 
//
//EagleSD.png
//M.E.G. - 为人类更好的明天
//作者
//« Level 923 | Level 924 | Level 925 »
//
//Footnotes
//1. 译注：即拼写，标点与语法（Spelling, Punctuation and Grammar）的缩写，在国外部分考试中作为评分标准。
//2. 译注：原文为foamily。
package lvls9x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl924{}