//Level 996
//评分: 
//+23
//+
//–
//X
// 
//
//生存难度：
//等级 2
//
// 
// 
// 
//79667f25615b0ed3.jpg
//Level 996内的一间仓库。
//
//Level 996 是后室的第997层。
//
//描述：
//Level 996是一大片仿照前厅中九龙城寨延绵而建的城市区域。
//
//Level 996被视作一个最高点，该术语来自流浪者对Level 998的称呼，特指一个远离枢纽且自身是或导向“终点”的层级。其位置难以准确估计，因为从已知入口进入Level 996的概率非常低。目前预估的最短路线距枢纽至少有85个层级。
//
//Level 996整体相对于水平轴倾斜超过70度。因此，该层级内的行进通常被称为“上行”。
//
//尽管Level 996与前厅的九龙城寨极度相似，但二者间仍存在一些显著差异：
//
//即使在Level 996中可发现九龙城寨的某些部分，但大多数地点在原市区中并不存在。
//目前认为Level 996的区域范围无限，唯一已知的测量值是其水平宽度为三公里或称约两英里。 （九龙城寨总面积为2.5公顷或称6.5英亩）
//这里不是你的家。
//Level 996内几乎完全缺乏家具和资源。
//环境光水平基本与黄昏时的海面相似（即前厅中太阳位于地平线以下六到十二度时的情形）。
//虽然打开的门或许可以安全穿过，但已出现打开新一扇门导致流浪者消失的案例。 因此不建议进行此类尝试 ……？
//Level 996内建筑延伸的垂直程度远高于原本的九龙城寨。目前，它们抵消近乎垂直条件下重力的手段仍然未知。
//物体和实体：
//以下是Level 996内记录在案的物体和实体。由于其与早期发现的层级相距甚远，故认为此处实体是该层级所特有的。
//
//灯泡
//灯泡是Level 996内最常见的物体。它们可能会以任何人造灯具的形式出现，同时会在自身周围投射光线。普通灯具则是Level 996内建筑的照明部分且可以通过它们散发的微弱光线识别。虽然灯泡也能够附着于层级内构筑上，但可以通过它们发射的光将其与普通灯具区分开来。
//请注意，从Level 996以外携带的光源仍然可以正常发光，但它们似乎不会导致阴影搬运工的出现。
//阴影搬运工
//阴影搬运工在流浪者于Level 996 内投下影子时出现。然后，阴影搬运工将取代流浪者自身的影子，并呈现其真正轮廓。一旦发生这种情况，流浪者会切过阴影，重新出现在Level 996的一个入口处。
//每个轮廓各不相同，因此流浪者们相信存在多个阴影，但它们的数量规模未知。它们是否拥有感知也无从确认。你认识他。
//记忆思絮
//记忆思絮是难以捉摸的生物，外表与鬼火现象相似。当接近记忆思絮时，它们将导致与流浪者体验和记忆相关的事件发生，比如强烈的怀旧之情和既视感（déja vu）。由于该实体生命短暂，与其相关的信息较少。
//基地，前哨与社区：
//Level 996内没有流浪者基地的建立。很少有流浪者踏入该层级，而且通常认为该层级内资源太少，无法维持永久居住。
//
//上行：
//尽管没有前哨，仍有一些流浪者试图找到Level 996的尽头。发现该层级在平行于斜面的空间内仅占三公里或称约两英里的宽度，但长度仍然未知。以下是关于该层级上行须知事项的速览：
//
//时刻警惕灯泡和关闭的门。
//做好准备。 带上食物、急救用具和任何能够帮助你上行的东西。
//留意观察点。 这些由先前流浪者留下的东西能在攀登途中引导你。
//以下是记录在案的观察点列表：
//
//观察点A
//位于一座带有药房标志的大型建筑的屋顶上，此处能找到一顶储藏有杏仁水和口粮的小帐篷。
//
//观察点B
//一个由废弃的金属板建成的大型10米x10米的庇护所。 大多数记录回收于此观察点，与此同时还有几件废弃的设备，包括手电筒和绳子。此处也可找到供给。
//
//观察点C
//Level 996内一片完全空旷的区域。 此处留下了双筒望远镜和大量食物，以及一个废弃的睡袋。在观察点附近发现了撕碎的笔记，以及一些血迹。由于阴影搬运工并非暴力实体，因此建议关注这个观察点周围的未知实体。
//
//观察点D
//██████████████████████████████████████████████████
//██████████████████████████████████████████████████
//██████████████████████████████████████████████████
//██████████████████████████████████████████████████
//
//别来就对了。- Paul
//
//目前为止，大多数流浪者都无法到达观察点D（最初建立它的定居者除外），因为某些神秘事件阻止了到达此处的行进。
//
//因此，其存在本身就是纯粹假设的，但M.E.G.认为其包含可利用的潜在信息。
//
//入口和出口：
//入口
//许多地点均可能通向Level 996，比如：
//
//Level 36，尽管Level 996内并无机场出现的报告。尚未发现哪些大门可以通往Level 996，因为相关流浪者刚一到达就因疲劳而陷入昏迷。
//离开Level 444后进入的Level 176。在层级中发现了一片区域，与可通向Level 996内部建筑的仓库极为相似。
//立刻离开Level 666后进入的Level 165。目前推测该途径仅能通过利用“山魔王仪式”实现。找到一个被污染的水池能提供一个通向Level 996下水道系统的入口。不建议这么做，因为阴影搬运工可能将你带入一间上锁的下水道，导致你的溺亡。
//Level 282。在特定条件下昏倒可能会将你带入Level 996，但这并非普遍事件。
//Level 996的入口似乎随机出现。但下列规则被发现可以增大进入几率：
//
//远离枢纽。
//注意路径，经过流浪者已经去过的相同层级可能会降低几率。
//层级困难与否，危险或难以辨别方向的层级更有可能到达Level 996。
//记忆，与记忆或怀旧现象紧密相关的层级通常能够直达Level 996。
//出口
//最可靠的返回方式就是从原出口离开。 怀疑Level 996的顶部边界有一个出口（如果其确有边界），但这点尚未确定……？
//
//拜托了。 即使他独自一人，也并不安全。
//
//归档日志
//在20██的六月五日，你没必要知道。 M.E.G.特工保罗·H（ Paul H. ）和伊芙琳·T（Evelyn T. ）到受派遣前去探索Level 996。这些日志回收于上述探险开始411天后。
//
//Paul H.失踪前不久，视听记录于其手机上发现且已转移到数据库中。在Paul的背包里也发现了书面记录。从那以后，再无Paul或Evelyn的踪迹发现。
//
//- 开始播放。
//[记录中可见两人，分别为Paul H.和Evelyn T. 所处位置确认为Watchpoint B。]
//
//E: 你知道，这些东西真挺漂亮的。都快让我感觉天下太平了。
//
//P: 我已经开始记录了。
//
//E: 哦，拜托，用不着这么认真。我们好一段时间都没看见东西了。
//
//P: 这可是M.E.G.的任务。Evelyn，你觉得他们真在乎这些若隐若现的萤火虫吗？
//
//E: 估计确实如此。至少我挺在意的。他们让我想起了我们当初去那个花园的时候；那里有一个小池塘，里面就是这样的东西。
//
//P: 我甚至听不明白你在说什么。我们困在这少说得有12年了，你觉得我还能什么都记住吗？
//
//[Paul坐了下来。摄相机位置被调整以对准Level 996的顶部。]
//
//P: 今天是我们到这儿的第50天。我们终于到观察点B了；离上面也越来越近。我开始注意到这里并不完全稳定，许多建筑似乎以荒谬的方式连在一起。这在后室里不是稀罕事，但我还是觉得它不应该在这个地方发生。
//
//E: 你已经在做报告了吗？那我就在这里看看那些絮。
//
//[Paul向Evelyn点头示意。可以看见Evelyn 正在饶有兴致追着记忆思絮。]
//
//P: 我们又找到了一些用品。顺便说一句，我觉得这个地方不是是无限的。在斜坡的左侧，有很长一面墙，都是没有入口的房屋。我不知道如果能去另一边会发生什么，但我们找不到任何东西抵达。
//
//[Paul陷入沉思。]
//
//P: 我认为今天这样就差不多了。还要给我的手机找一些电源。
//
//[记录结束。]
//
//- 开始播放。
//[画面中可见Paul和Evelyn坐在某屋顶上。位置无法确定。]
//
//P: 亲爱的，走吧。我得先做个报告。
//
//[Evelyn看起来在盯着某物。]
//
//P: 嘿，别看了。我知道你迷上了这些飞来飞去的小东西，但我们得走了。
//
//E: 啊，对。等我拿上咱们的东西。
//
//[Paul站起身，然后被一条金属线缆绊倒。]
//
//P: （粗口）！在这要小心点。我要是掉下去可就回不来了。
//
//[Paul小心翼翼地再次起身。他看向摄像机。]
//
//P: 在Level 996的第62天我们还有相当充足的补给。仍在攀登；我们应该就快到观察点C了，但问题在于，有很多谣言说，大部分人到达C观察点后就立马消失了。 悲伤的是我们别无选择。M.E.G.知道这儿能找到什么东西，然后我们就必须这么执行……至少对他们来说正是如此。
//
//[Paul沉默了几秒。他看向自己身后，然后走近摄像机。]
//
//P: 我有点担心Evelyn。她好像……完全不在状态。我怕她已经被这个地方的偏僻隔绝影响了……我感觉我们离开Level 11已经有好几百天了。 她就是我的全部啊，我也不想孤身一人呆在这儿……
//
//[Paul看向自己身后。]
//
//P: 我不知道该做点什么。以防万一，我开始把大部分供给都给她了。我只希望她能平安无事。
//
//[Evelyn拿着几个包从远处走了过来。]
//
//E: 可以走了吗？
//
//P: 嗯。
//
//[记录结束。]
//
//- 播放文件。
//第64天的报告。我手机电池没电了。没什么大碍。
//
//Evelyn不太好。她（粗口）确实状态不太好。我不知道该从哪说起。她现在开始……胡言乱语了。我再也不知道她在说什么了。我也感觉那不再是她了。昨天她跟我说什么我们在这的街道上玩耍的事。我们从来就没在这住过。太不对劲了。
//
//这不是第一次，但我没做过记录，因为我确实以为她就是想家了。我有点不敢和她待在一起了。但我也不想一个人孤零零的。
//
//她不在这。她总盯着什么东西看。我告诉她振作点。她动不动就拍一下我的肩膀但其实无事发生。她开始产生幻觉了。她还不吃一点东西。我感觉她要变成悲尸了。但她的皮肤很正常。我不知道该干点儿什么而且我现在真（粗口）害怕。我该怎么办？
//
//我觉得我们得回去了。再这么下去就活不了了。
//
//[报告结束。]
//
//- 开始播放。
//[画面中可见Evelyn。画质飘忽不定，同时摄像机剧烈摇晃。慢慢可以听到粗重的呼吸声。]
//
//E: 我们要去哪？
//
//[Evelyn沉默了几秒。 Paul以惊恐的语调低声说着什么。]
//
//P: 不不不不不，这（粗口）是怎么回事？这（粗口）是怎么了！太（粗口）糟糕了。简直（粗口）糟糕透顶。我该怎么办？我该做点什么？
//
//[摄像机剧烈摇晃，然后摔在地面上。Paul将其捡起然后缓缓靠近Evelyn。]
//
//E: 你说它会帮……我们？
//
//[Evelyn沉默不语。]
//
//E: 好。带路吧。
//
//[呼吸声明显更响亮了。]
//
//P: Eve，你（粗口）要去哪？她现在已经陷入严重的幻觉了。我做了什么。我就知道我们该回去。我太（粗口）知道了。我现在应该跟着她吗？我该怎么办？
//
//[Evelyn缓缓走着，似乎跟随着一不可见实体。Paul开始握着摄像机跟随她。可以听见低沉的隆隆声。而Evelyn在与上述实体交流时貌似听不到其他声音。需要指出的是尽管观测数据表明观察点D此时应处于画面中，但其确实未被看到。摄像机停止移动。]
//
//P: 上帝啊，如果你确实存在，那你肯定是个毫无幽默感的家伙。
//
//[Evelyn停下脚步。]
//
//E: 我准备好了。
//
//[Evelyn沉默片刻。]
//
//E: 别担心。你不再是孤身一人了，好吗？
//
//[Evelyn打开一扇门。摄像机摔落在地。可以听到沉重的脚步声和远处传来的尖叫，随后一片寂静。]
//
//[可以听见Paul在啜泣。脚步声距摄像机越来越近。]
//
//[记录结束。]
//
//- 播放文件。
//她走了。她穿过了那扇门。我不知道她在和谁说话。但她走了。我已经三天没看见她了。
//
//我要回去了。这儿没什么需要我观测的了。我把这东西带回去交给M.E.G.然后就辞职。我不知道该怎么办了。
//
//我本意并非如此。她不应该来这的。
//
//对不起。
//
//她是个好人。
//
//[报告结束。]
//
package lvls9x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl996{}