//Level 626
//| 重要提示 |
//
//依照于主管之权限，我在此宣布，若非我本人宣布取消，否则Level 626必须处于Gamma分部行政员的直接管理之下。他所有的命令都必须服从。所有扩展我们数据库有关本层级信息的所有行为即刻得到授权并须立刻执行，但我们严格限制Level 626外的所有探索行为。
//
//~ 总管
//
//欢迎，资料库成员。
//Echo:Level-626.file
//作者： 隐秘发掘者Hughes
//无危险	存档库存在	低环境危害
//Level 626 是后室的第627层并且是 永恒资料库一个在建数据库所在地。
//
//描述：“岛”
//Level 626是一个面积约为1832.7平方千米的寒带苔原气候的岛。一年内大部分时间，全岛被持续的降雪所覆盖。岛的边缘完全被某种50米高的墙所包围，且这堵墙的建筑材料未知。此墙的厚度约为10米，其此，到目前为止，所有突破该墙或者从它上面切下来一部分材料的尝试都失败了。但是，在墙的东南端，有一个光滑且整齐的大洞。这似乎是由某种大型挖掘工具或者某种机械所留下来的挖穿墙体的痕迹。1这个洞的开口平缓的延伸到海岸边。注视它的人可以看到后面平静的黑色大海。
//
//岛的中部有一个可能是设计用作灯塔的六边形高塔。测量结果为该塔高约70米，直径约15米，建造该塔的材料类似于前文所提的那一种建筑材料。塔顶有一个灰色的机械大眼，绝大部分时间这只眼睛都面向岛的南方，该方向与前文所提的洞的方向所一致。四只黑色大金属环包围着这个大眼睛，推测这四个环的材料也是前文所提的材料。当这个大眼睛盯着某个特定位置时，这四个环会聚拢成一个圆。遍历我们对Level 626的所有资料，这种情况也就发生了一次，它具体注视的位置处于墙外。尽管连着锁链和线缆，但通过某种尚且不明的机制，这个眼球依然可以在空中悬浮2，且能无缝旋转至任意方向。3这个机械眼球每天都会工作。届时，其将放射出一束可见的灰色光。这束光覆盖范围又远又宽，它一般指向墙外的大海，更准确的说是南方那个洞形成的光圈。当我们把任何物质与这个所谓的“光”交互时，这些物质立刻被原子化了4，五名成员已经由于这个痛苦的过程而牺牲了。但是很奇怪的是，整个自然环境还有墙并没有因为这种“光”而分解。
//
//高塔的内部分为5层，除了第五层以外，其他层级都是空的。楼梯很自然的贯通不同的层级，并且能够完美的贴合高塔六边形的几何外形，5但如前所述，它们所贯通的层级都是空的（除了第五层）。第五层，也就是最后一层，存放着用来自动驱动“大眼球”的发电机和其附属机械。电力的来源，或者说是所有能量的来源任然是一个谜。在机械轮子上，制造者用褪色了的灰色字体写道：“父亲之眼注视着这里”。
//
//被称为“父亲之眼”的设备，可以通过向机器输入信息的方式，来用物理方式存储目前不明数量的信息。存储信息的过程可以通过把实体文档投入机器最左侧的部分来完成。文档里的信息会被存档于“父亲之眼”体系内。该体系可以用位于机器右端的打字机来访问，打字机可以输出任何已经被存储的信息。向“父亲之眼”存储信息的过程似乎会让它在一天内的其他时间更加活跃，例如它可能会在不同的方向上多凝视几圈。
//
//永恒资料库目前已经将有关它们的信息存入它们自己创造的数据库中。这些由Gamma分部的行政员Cherub所存入的信息，让626-Ψ号数据库的数据量翻了一倍。626-Ψ目前存有关于本层级与其本身属性有关的信息，同时还保存着永恒资料库有关于其他层级的信息。Gamma分布的从成员在数据库外还搭建了几顶帐篷。经由主管本人认可，本层级目前已经是永恒资料库的官方领地。
//
//到目前为止，永恒资料库完全控制着Level 626。除经主管或Cherub行政员许可以外，我们拒绝任何意图在地面上标记本数据库的来访请求。如果一个人必须查询有关于某个清晰主题的档案，那在他进入之前，他必须出示如前所述者的直接许可文件。
//
//描述：“大海”
//在“岛”之外6是一片无边无尽的黑色大海。那个机械眼球的目标似乎一直是水中的某些东西。有理论认为，“父亲之眼”是在保卫这座岛免受某种人类不可见的威胁，或者它只是在找水里的某种东西。已经尝试过对该海域进行探索，但目前只有人员受伤或死亡的报告。
//
//_依主管之命，在Level 626的墙外，严禁任何形式的探索。_
//
//就颜色而言，这里的海水呈完全的黑色，但它仍有普通水的属性，包括尝起来的味道也一致，使得它可以净化成纯净水。这种水的颜色并不会随着简单的变化而改变，即使过滤后的水也依然保持黑色，在煮沸后，它的蒸汽也保持黑色。这种水可以沾染在衣服上，用不是该海的海水的水可以洗去这种污渍。这种水颜色很深，有人可能会把它误认为墨水或者干燥的血迹，但它仅仅是这种水的一种自然物理属性。
//
//将普通水与该海水混合仅仅会得到更多的黑水。通过某种途径，海水能够把其所流过或者混合的液体染成黑色，即使是油、胶水、或者其它化学物质也不能幸免。但除开这种听起来不吉利的现象，其他的各种性质都不会发生改变。例如某一个人可以拥有功能正常的血液、尿液、眼泪等一系列体液，但这些体液全部都是黑色的。体液全部变黑这一过程会持续1个月或半年。在某种程度上来说，“黑色海水”这种物质能够化学扩散到任何液体之中.7
//
//鉴于这种水对人体的反常作用，不推荐饮用甚至触碰这种水。
//
//描述：历史
//本层级的历史基本未知。本层级的历史仅有一些神秘的细枝末节，例如岛南侧的墙上那个光滑而精准的洞、无边无尽的海，以及“父亲之眼”，还有它那望向海洋的未知原因。尽管本层级于我们而言已经变得宜居，但本层级仍然到处是疑问。
//
//本层级目前的状态似乎表示，在被清空和废弃之前，有某种有智慧的东西层级居住在这里。也许他们在躲避某种东西，并且建造了父亲之眼这座哨塔，它可以监视在墙外的海里存在的某种威胁。
//
//由于岛上仅存在自然的地理形貌以及一些建筑，导致永恒档案库无法形成关于本层级历史的正确文档。关于黑色大海也没有多少参考信息。鉴于Level 626的范围里没有什么异常情况，Level 626就成为了一个未解之谜，而且关于这个谜题，只有模糊的线索和理论去支持它。Level 626将作为永恒资料库的一个仓储数据库运行下去。
//
//实体
//永恒资料库目前非官方的把“父亲之眼”定义为实体。然而它没有表现出任何意识或感觉，相比起实体它更像是一个物品。除前文所述之内容，本层级无值得关注的信息。除“父亲之眼”外，本层实体绝迹。
//
//基地，前哨与社区
//626-Ψ号数据库
//626-Ψ号数据库是本层唯一的社区，由永恒资料库管理与保护。数据库的工作人员都有志于存储信息，并将其提供给任何有需要的人。当不怀好意的组织上门的时候，一组驻扎于此的哨兵负责其防务，这使得Level 626成为了永恒资料库的少数的永久基地之一。在有关本层级的信息发布后，工作人员的数量正在稳步上升，目前有539名工作人员。
//
//入口与出口
//入口
//绝大多数Level 626的入口目前任为机密，但有几个入口已经被公开。供大众知晓的入口是永恒资料库所使用的大门。并通过某种方法被保护着。
//
//有谣言称11-Θ号数据库有直达塔内的通道，它仅由主管本人使用。这些消息大多是未经证实的谣言。
//
//任何有水源的层级里，偶尔会出现黑色的水面。跳进去最终将来到Level 626的海滩。通过这种方式到达Level 626不会引发黑水对身体的反应。
//
//在常刮暴雪的层级里进入雪暴会把你引到Level 626内的平原上。但是此途径更加的危险，而且由于这种现象相当危险，我们没有很多经验。
//
//在Level 600到700之间的非切出入口偶尔会把你带到墙外的区域。但是由于我们的测试员没有确定这种现象的存在，因此我们目前仍将其作为谣言处理。
//
//出口
//只有两条路可以离开本层级。一是把自己完全沉入黑色大海里10秒钟；二是把自己的全名写在一张纸上，然后将它放到机械眼球的机器里。第一种途径会让你陷入沉眠，同时梦见自己站在黑色海洋的海滩上，看着上方的一束灰光。第二种途径会让机器“记住”你的全名，并当场离开本层级，而你可能会梦到俯视某人站在海里的画面。
//
//Repository-Signature-Transparent.png
// 
//
//我就在这呢，亲爱的孩子。
//作者
//Schulzenreich
//Schulzenreich
//
//准许人
//CutTheBirch
//CutTheBirch
//
//感谢
//NavyEOD_24
//NavyEOD_24
// 对Level 626一文的详尽批评
//CutTheBirch
//CutTheBirch
// 对Level 626一文的批评
//
//译者
//Auroraton
//Auroraton
//
//Sources
//N/A
//
//« Level 625 | Level 626 | Level 627 »
//
//Footnotes
//1. 这个洞类似于某种武器快速射击所形成的洞。
//2. 尽管尚未证实，但是这个眼球似乎任意方向上360°旋转，就和没有东西支撑它一样。
//3. 注：它的机械结构将在下文进行讨论。
//4. 在本文中，原子化指物质被拆分成独立的原子。
//从远处观察，这个过程类似于一场大爆炸。这个过程可能会对靠近的人产生伤害。
//
//5. 这些楼梯的边缘相比于是焊在塔上，不如说是从塔里刻出来的。这就产生了以下问题：这座塔起初是否是一块大石头，后来被居民给凿成了这个样子。无论他们是谁，他们都用令人恐惧的效率和精准度凿出了各层地面还有楼梯。 - Digger Hughes
//6. 作为唯一连续的大片陆地，可以认为它是Level 626的主要组成部分。
//7. 也许这个海可能曾经有没被染黑的时间？ -Digger Hughes
package lvls6x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl626{}