//Level 696
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//20201126-180859.jpg
//1楼的窗户图像
//
//20201204-191023.jpg
//Level 696 的地下楼层
//
//20201204-191701.jpg
//Level 696 的一个空房间
//
//20201204-192216.jpg
//9楼的一张照片
//
//20201205-110255.jpg
//Level 696 地下深处的一个楼层
//
//Level 696是后室的第697层，于2022/2/2被发现。它呈现为一座由浅灰色混凝土筑成的废弃建筑物。
//
//描述：
//这个层级呈现为一座由浅灰色混凝土筑成的废弃建筑物。因为建筑已经很旧而且开始变质，墙面上经常出现棕色的污斑。向窗外望去，不能看见天空，仅能看见大楼。所有窗外的大楼都是相同的。这些楼高达无穷，有无限的地下楼层、亚楼层、字母编号楼层（A、B）等等。
//
//不是以纯数字编号的楼层都有奇异的性质。例如，B1层极似Level 1，B2层极似Level 2，由此类推。A编号的楼层全部整体翻转，C编号的楼层上下颠倒。由此类推。奇异的是，每个楼层都没有发现任何实体，而且每个楼层的面积是有限的。所以，探索这里能够有效地替代探索危险层级，规避风险。
//
//在电梯的按钮中楼层通常很难找到，因为按钮是无序排列的。当你确实找到目标后，电梯可能会用一个小时才能到达目标。在第一层的主电梯中，重要的楼层都被标上蓝色字，奇异性质楼层被标上橙色，与后室层级相似的楼层都被标上红色。
//
//层级被认为含有无限的房间构型和组合，但因为这里天然的布局，这不可证明。每部电梯拥有不同的楼层按钮，而且每个楼层有4部电梯。它们通常布局在楼层的每侧。在曾经探索过层级的7个人中，有4个是M.E.G.成员。有三人在层级中停留了整年以上，剩下的仅仅停留了少于一个月。有一人在这里停留了三年以上，并将发现全部提供给M.E.G.。但现在此人已经失踪。以七人进入层级的数据计，达到此层级的概率仅有0.0091%。
//
//有一个实体经常在B编号楼层中出现。它有能力构建后室层级，而且正在建筑所有层级的副本。其他楼层只是失败实验品而已。它在B编号楼层中被发现，因为它一直在改进所有层级的复制品。现在我们对它所知甚少，主要因为它喜爱独行，且没有被真正看到过。
//
//>隐藏
//注意这些楼层是非欧几里得空间。房间和子区能够容纳在楼层中。
//B0
//B1层
//B2层
//B3层
//B4层
//B5层
//B6层
//B7层
//B8层
//B9层
//B10层
//B11层
//B12层
//B13层
//B14层
//B15层
//B16层
//B17层
//B18层
//B19层
//B20层
//B21层
//B22层
//B23层
//B24层
//B25层
//B26层
//B27层
//B29层
//B32层
//B37层
//B44层
//B72层
//B99层
//B100层
//B158层
//B302层
//B423层
//B998层
//B999层
//
//重要楼层
//4层： 本层有大量杏仁水。
//19层 本层有床，可以安全地休息。
//90层： 有一个水池。
//-6层： 看起来像 Level 1.5
//-61层： 看起来像 Level 6，但是这里是明亮的。
//T8.1层： 本层由固体酸构成。
//L9.4层： 本层弥漫着有毒气体。佩戴一个防毒面具很有必要。
//A层： 这个楼层由可触摸的光线组成。
//E9层： 屏蔽任何信息，相似于Level 12.
//-Z6层： 与现实世界相似，但每处都与阈限空间相似。
//=)层： 有一个派对，但是是安全的。
//
//初始楼层
//你会进入该层级的地面层。
//地面层： 这层楼看起来像塞浦路斯的普通房子，完全由混凝土制成。这层楼有一个厨房，一个客厅，一间浴室。客厅里有一条向上的楼梯。此层有 杏仁水。这是被探索最多的楼层。这个楼层的地板上有一个洞，能通向地下楼层。
//
//0.5层：与地面层完全相同，但灯光呈现蓝色。因为与地面层完全相同，所以也有杏仁水。由于蓝色的灯和脏的墙壁，它似乎是Level 0.1。
//
//1层：这个楼层与任何房屋里的楼上相似，除了它完全由混凝土制成。有一个卫生间、一个卧室和一个阳台。这层能够找到一个撬棍和稀少的杏仁水。有一个与地面层相连的楼梯，所以不需要坐电梯到达这里。
//
//1.5层： 此楼层类似于DJ室。于此可以找到一个不可食用的蛋糕。此楼层极难到达，因为绝大多数电梯不包含1.5按钮。所以可行的入口是乘电梯去2楼，但在正确的时间离开电梯。这很困难，因为电梯在移动时不会自动开门，强制开门也很难。奇怪的是，1.5层确实有电梯，但当你到达选定的楼层时，它会消失。
//
//2层：此楼层是空旷的图书馆，仅有极少可能出现一本书。如果出现，它将极厚，但半数内容是空白。书含有随机的内容，似乎与后室无关。
//
//2.5层：如同一间大学教室。也可以偶尔发现桌上放着书，书中含有一些无用的内容。建筑内可以找到6个教室，但教室里有更多的门能通向其他建筑外的教室。
//
//3层：本层有很重的空煤气罐，遍布楼层。虽然是空的，仍然可以点燃与爆炸。这有仅次于从高处坠落危险的致死风险。
//
//3.5层： 本层类似于木屋。本层有一个空的冰箱，类似于木屋，但它较为明亮。
//
//4层：本层与3层相似，但煤气罐内盛有杏仁水。灯很有可能是坏的。很难进入煤气罐的内部，所以从本层采集杏仁水不可行。
//
//4.5层： 本层类似于室内高尔夫球场，大小为15千米乘23千米。没有高尔夫球，却有400个洞。这些球洞彼此相距甚远。
//
//5层：像是一间废弃的办公楼。又是只由混凝土筑成的。这层楼没有足够的探索过，也没有得到足够信息。
//
//5.5层：看起来像花园。有多种草植，树木与花卉。大小10千米乘10千米。
//
//6层： 本层看起来像0.5层的倒置。
//
//6.5层： 本层像一座古老的豪宅。
//
//7层：本层是电梯间。要去下一层，你必须找到标有8的按钮。
//
//7.5层：本层像一个户外花园，但它在建筑之内。当你远处看墙时，它似乎不存在。
//
//8层：仅少见家具，但所有家具有一个长方体碰撞箱。
//
//8.5层：类似监狱。
//
//9层：空楼层，而且重重落灰。
//
//9.5层：看起来像动物收容所1
//
//10层：此楼层有现实世界的地图。叉标可以在地图上的随机国家或地区找到。该地图也不准确，有显示不存在的国家或地区，并且不显示重要的国家或地区。
//
//注意：电梯能够达到的最高层是2847层。在2847层中，可以找到一个去向10000层的按钮，但需要钥匙来开放。钥匙的出现位置还未知，M.E.G.正在寻找。
//
//基地、前哨和社区：
//没有社区或前哨。
//
//发现记录
//最初进入层级的人在消失进入层级之前曾与两个朋友在Level 7探索。这是M.E.G.收到的记录
//
//记录
//朋友1： 喂？在吗？！
//M.E.G.： 请讲。
//朋友1： 我的朋友有一个消失了！我和他同行了8年他从没有离开我的。但是现在他神秘地消失了！我们正在探索Level 7的，想出去。我走神大概几秒，然后他就消失了。
//M.E.G.： 消失了？是切出了吗？
//朋友2： 他没靠近任何墙壁或者地面什么的啊。我觉得不是。他也不比我们游地快多少。我觉得他肯定不是游远了。
//M.E.G.： 我们会去找。别担心。
//朋友1： 感谢！！你们真的知道了他是我几年的朋友！2
//记录结束
//
//失者传输的信息
//[未知身份]： 喂，你好？
//M.E.G.： 嗯，请讲。
//[未知身份]： 我迷路了！我和几个朋友在Level 7探索的时候，不知道怎么就进入了这个层级！我们在那里都几天了，刚才进入这个层级。层级全是混凝土构成的，外面的大楼像是无尽延伸的，还有，电梯里面有几千个无序的按钮！
//M.E.G.： 额，真的是随机进入吗？你在进入之前做了什么特殊的事情？
//[未知身份]： 不是，就是随机传送到这里的。来到这里就没有什么原因。
//M.E.G: 冷静。我们会试着去找到这个层级。
//[未知身份]： 感谢。
//记录结束
//
//探索发现
//根据记载，打破或切出层级墙壁会通往另外一间不同结构的大楼，但是资源一样。极其稀少的情况，打破墙壁后你会看见建筑的外侧，呈现为一个废弃的被锈迹覆盖的操场。当你前往操场，最有可能会传送回一个随机的楼层，否则将被困在本层级的奇异空气中。
//
//另外一个发现：从一楼的电梯最高能到达2900层，在那里可以看见任何物品就像你脑中所想的一样出现，但是物品和实体除外。
//
//地下楼层
//穿过地板，可能到达地下楼层。除此之外，没有方法去往地下层级。一旦到达地下层级，就可以看见上下的楼梯。地下楼层没有电梯，所以深入地下层级就需要使用楼梯。奇异的性质会每层递进，例如-1层可能会发生“卡顿”。如果你想要撞掉一个物品，掉落可能需要2秒钟，而且你的手也有可能穿过这个物体。从物体掉地到听到砰声可能也需要两秒钟。发现过的最深地下楼层是-3190层。这里的所有东西都是故障似的，而且难以穿越这些故障找到出口。
//
//故障列表
//-5层： 再往下视觉开始恶化，开始色弱。
//-10层： 再往下，地板上发生故障，地板会每隔几秒就变为紫色，随后复原。从这里开始视觉对比度会下降。
//-25层： 再往下就会完全色盲。从这里往下的景象都是与色盲无异。地板会开始看起来像素化。
//-50层： 再往下，卡顿效果很频繁。物体落地可能需要5秒钟。整个层级都像素化了，还有一种“平滑”效果。
//-100层： 这里幻觉频发，层级几乎不可视，而且视力正常的人也将看见高度近视似的世界。3
//-500层： 没有过多异常加入，但值得注意的是一切都开始变得更暗。
//-1000层： 这里的楼层开始更亮，且幻觉几乎每秒发生几次。从这里开始，可能会有迷失感与孤独感。
//
//入口与出口：
//入口：
//似乎能够随机达到层级。
//
//出口：
//在层级中死去，能回到Level 0。4
//去往-9999层5，就将达到褪色层。
//作者信息
//« Level 695 | Level 696 | Level 697 »
//
//Footnotes
//1. 原文就没打标点。
//2. 原文如此。
//3. 译者注：原文myopia -7，此处许久没有找到与国内近视度数的换算方法。
//4. 原文如此。
//5. 译者注：此处明显与之前的“发现过的最深地下楼层是-3190层。”一句产生矛盾。
package lvls6x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl696{}