//Level 612
//
//
//在我们的新计划中，以下的文档是该层一名居民在一名M.E.G.的成员批准下所编写的。我们希望通过遵从本地居民的意愿，来更好地描绘里面的生活到底是什么样子的。
//
//—监督者Andrew，来自M.E.G.
//
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//描述：
//c8809839c3d2f5c7.png
//我卧室的窗户所映出的景象。
//
//那些给我任务而且人还不错的那些探险者告诉我他们管这里叫“Level 612”，不过我更喜欢叫做“家”。我问他们这里的名字，他们却说“Level”已经代表了这个地方。这个古老的概念已经被使用了几十年，而现在它的原意已经不再为人所知了。既然有着612，我问他们这之前是不是还有611个这样的地方，他们回答说远比这多的多，而这只是第611个他们决定要记录的地方而已。这对我来说几乎是难以去想象的，但是我相信了他们的话，相信他们说的都是事实。这片沙漠，也就是我的家，是多么不可思议的大啊以至于我根本没法想象这辽阔的宇宙中还有600个甚至更多的这样的地方。当然，我也没有愚昧到认为只有一个如同这里的地方存在着。我时常和那些时不时来到这里的旅行者们交谈，而且事实上，我自己的母亲就是从外界来的。
//
//我觉得这就是我关于这个地方首先应该写起的地方。毕竟这是那些探险者叫我这么写的。这个地方是我的家。这是我终身都要居住的地方，是我父亲以及他的祖祖辈辈生活的地方。没有参照物的话，我真的不知道有什么好去特地指出来的。我不知道什么东西值得去讨论。非要说的话，所有的“Level”的天空都是慢慢变亮的吗？我曾经在地球上读到过，地球是被几百万英里外的一团大火照亮的（也许叫“前厅”对于读者来说会比较熟悉一些，那些探险者也是这么叫的），但在这儿没有那样的东西。这里的天空永远地停留在了一种状态——“黄昏”，我确信这是我在地球的哪儿读到过的用来描述天空既不太亮又不太暗的词语。这里有的全都是一片由黑色沙子组成的无垠沙漠，一直延伸到我能看到的和我已经鼓起勇气走过的地方。
//
//不论何时，我都能听到空气中传来的美妙的声音。那些探险者告诉我这里什么都没找到，但是对我来说，它就好像这片沙漠自己的声音一样。这种事使我感到愉悦。旅行者告诉过我那声音听起来像一架钢琴，那是一个有着一堆按键和锤子的大盒子，当按下上面的按键时它会发出美妙的音乐。我觉得我应该在一本书里面读过它，但是我没有从来没有体会过它听起来是什么样的。
//
//对于我来说，除了自己、奶牛以及偶尔路过的旅行者，这边算是空无一物，但我不在乎。那些旅行者其实告诉过我它们不是奶牛，至少不是它们见过的奶牛，但却符合我见过的任何一条关于奶牛的描述。这些棕色的大家伙每天“哞哞”叫着同时吃着我家附近的沙子。它们在年轻的时候能为我提供牛奶在年老的时候又能让我吃上它们的肉，而反过来，我会去照顾它们，确保它们是安全的，它们的宝宝是安全的，而且它们的心情是愉快的。我很乐意如此，我认为，它们是在这个地方唯一能与我相伴的事物。我的母亲不喜欢奶牛，但它们对我来说是特别的。
//
//在这边儿真的挺容易感到孤独的。我认为我真的是非常幸运能有一门和路过这里的探索者沟通的语言，因此他们也可以分享他们一路来的故事以及他们对于未来的美好憧憬。当然，我和他们有着一些辩证事物上的不同之处。举个例子，在和探索者在一起的时候，我喜欢叫他们说的那些东西为“动物”，而他们会说那是“实体”，而且对于他们，什么东西都得有个编号，即使是那些随机出现在我房子周围的东西。这真是蛮奇怪的。
//
//我想我也应该写下那个音乐的含义因为这是这里唯一的“秘密”了，而我如果不这样做它也将伴随着我一同长眠。我认为这是我的家庭一直在刻意保守的一个秘密，但是关于此事除去一些零碎的信息几乎什么都找不到了，而且我想我的家庭也将和我一起消亡。在我之前的所有人都死去了。出于奇迹，我的父亲找到了一个同意和他住在这里并延续家庭的旅行者，而我现在已经比我出生时的父亲还老了，所以我想这真的就是最后了。
//
//我家的秘密是关于那首由歌女演奏的永恒之曲的。或者说，是那个女音乐家或是一段有关她的记忆又或者说是记忆之地中有关记忆的一段记忆的。 我不知道她是谁，而且没有一个我问过的旅行者知道她，不过我感觉我已经通过她的歌曲了解过她了。也许她在许久之前创造了这个地方，又或许是她只是路过后留下了自己的足迹而已。我希望我能知道，不过我该去问谁呢？大概她已经离开这里去往别处了吧。我在想她是否还记得这片我称之为家的沙漠。我好奇是否还有除了我以外的人还记得她。
//
//有些时候我甚至在想她到底是不是真的存在。毕竟，我知晓的关于她的全部不过是几代人流传下来的半知半解而已，而且谁又能说里面哪一块儿是真的呢？但每当我昏昏欲睡而我又听到那来自天空的旋律时，我确信她就在这里因为我能在音乐中感知到她。
//
//入口和出口：
//入口：
//M.E.G.当下只知道两个可以到达Level 612的入口。不论如何，通过穿过此层的大量旅行者不难得出这里其实还有着不少其他未知的入口。目前已知的两个入口如下：
//
//对于钢琴乐曲有着兴趣的流浪者在进入Level 67后偶尔会找到一架钢琴，顶部放着一张框起来的布满黑色沙子的沙漠照片。“卡入”钢琴将来到Level 612。
//在Level μ外部的地面上“卡出”会来到Level 612。
//出口：
//当一个人在Level 612中走的足够远时，将发现许多半埋在地面中的打开着的样式不同的门，它们通往地面。对于这些门能到达何地的探索还在进行中，但是已经有两扇门已经被探索完成了，它们将通向以下层级：
//
//一扇由深棕色桃花心木制成的门通向Level 153。
//一扇有着华丽雕刻的樱桃木门会带向Level 89。
package lvls6x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl612{}