//
//建立帐号 或 登入
//The Backrooms吧
//Backrooms Fandom Wiki
//The Backrooms中文wiki官方哔哩哔哩公众号
//Discord
//主页
//
//中文沙盒站
//
//图书馆
//
//层级
//|
//实体
//|
//物品
//|
//团体
//
//故事
//|
//相关人士
//|
//现象
//|
//设定
//
//搞笑文章
//|
//国际翻译中心
//
//原创图书馆
//
//原创层级
//|
//原创实体
//
//原创物品
//|
//原创故事
//
//原创团体
//|
//原创相关人士
//
//原创设定
//|
//原创搞笑文章
//
//原创艺术作品
//|
//原创现象
//
//网站
//
//最近创建的页面
//
//最近的更新
//|
//最近的编辑
//
//随机层级
//|
//随机原创层级
//
//随机实体
//|
//随机原创实体
//
//旧页面中心
//
//本月最高评分页面
//
//历史最高评分页面
//
//最低评分的页面
//
//社群
//
//讨论区
//
//翻译预定
//|
//最近的帖子
//
//作者页
//|
//中文网站作者页
//
//加入网站
//
//管理专用
//
//后台管理
//
//职员站点
//
//所有页面
//
//会员一览
//
//侧栏
//|
//顶栏
//|
//主题版式
//
//
//
//　
//
//Level 600
// 
//
//生存难度：
// 
// 
// 
//bQH5KfvkPqNMtOa.jpg
//该层级并不存在。
//
//Level 600是后室的第601层。它于2020年11月26日被发现。
//
//Level 600是一个空层级。该层级无法进入或探索，被称作“空白地带”。
//
//描述
//Level 600是一片虚无。它无法进入，由Level 599与Level 601之间的虚空构成。该层级无法出入，其存在只能通过实验被证明。
//
//关闭文件
//uahXimYoEBZsn9C.pnglevel6001.jpg
//山脉与道路的一处。
//
//PMLtfrE4kNvFD5X.jpg
//城市中心一处。
//
//场景（Scene）-01.1是开发室（Devroom）的A号场景，它是在1987年8月31日被发现的。
//
//场景-01.1是一个巨大的城市，与穿越山区广阔景观的道路相连。
//
//布局与效应：
//场景-01.1 由两个主要区域组成，分别是与场景-01.2相似的繁华大城市以及分隔城市的大片山地森林。这些城市内部没有实体出没，唯一的例外是那些自发驾驶的智能汽车。它们的驾驶方式没有类似人类的特征，只是温和平缓地沿着道路行驶，并遵守所有道路安全法。
//
//虽然建筑物的内部与真实世界中的类似建筑具有相似的结构，这些建筑都是未经装修且空无一物的。虽然各种居民从其他场景带来了家具，并一直在这里建立家园，但许多建筑物仍然是空的。偶尔会出现具有非欧几里得属性的房间。这些房间具有清楚标记其非欧几里得特征的路标，进入它们时没有任何危险。
//
//场景-01.1的森林沿着山地景观出现，森林里长满了树木，但没有野生动物或昆虫。河流可以在森林中找到，但它们都没有起点或终点。河流从不形成急流，被认为是可以安全进行游泳和饮用的。
//
//道路没有笔直的路径，会随机绕着山脉和景观蜿蜒而行。人们经常可以找到跨越数英里，从一座山峰到另一座山峰的混凝土支撑桥梁。汽车实体也可以在这里找到，但它们在森林中不太常见。
//
//已知文明
//领导者前哨站-城市行者
//拥有一百多位人员。
//他们住在一家名为“皇后之旅”的大酒店内。
//他们协助其他旅行者在场景-01.1内定居。
//场景-01.1的居民
//居住在场景-01.1城市中的平民的总称。
//友善程度因人而异。
//他们在每座城市中至少有1000人。
//场景-01.1的露营者
//场景-01.1森林中平民的总称。
//友善程度因人而异。
//每个营地大约有2-15人。
//营地数量的确切数字尚不清楚，但基本可以确定在一百与一千之间。
//入口与出口
//如何进入
//场景-01.1可以从场景-01.5内的任意一棵树木切入。或者，从场景-00.8你可以找到看起来像明信片的艺术品，以任何方式触摸它都会把你带到场景-01.1。但是，众所周知，当从现实世界进入开发室时，也有可能进入场景-01.1。这就是为什么这么多人来到这里并在这里居住。
//
//如何离开
//在场景-01.1，可以在城市中找到通往场景-01.2的出口，也可以在森林中找到通往场景-01.5以及场景-01.4的出口。
//
//« 场景-01.0 | 场景-01.1 | 场景-01.2 »
//
//[我操？？怎么这里也有这个傻卵页面？？啊，如果这是有什么人故意捣鬼的话，我严肃建议他赶紧停止。]
//
//基地、前哨和社区
//该层级内没有已知的基地、前哨站或社区。
//
//隐藏笔记
//[啊，总算有一个人回复了我的消息。有人说我们发现的那两个隐秘层级，正是那古怪旧页面中提到的城市的遗迹。他说这个层级破碎了，然后就会“从层级列表中隐去”还是怎么样。我觉得有点道理。但我还是很好奇，是谁把那个页面传到系统上来的？我他妈保证这傻卵页面两周前还不在这儿。不过我还是会相信Josh。我已经没有什么可以信任的了。]
//
//入口与出口
//入口
//该层级无法进入。所有已知的进入方式都会通往废墟之路或是他X的世界的终点。
//
//出口
//目前该层级没有已知的出口。
//
//凭证有效
//[我们决定研究一下Melody的那些话，于是发现了……某些东西。现在它似乎只是记忆罐里完整的回忆，但它绝对存在。我们将暂时保密这些信息，这完全是为了大家好。在此处查看我们在http://www.meg-archive-memory-jar-writeup-880.com发现的东西。]
//
package lvls6x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl600{}