//Level 648
//一个身影无声地落在混凝土地面上。他的皮肤撕裂，骨头折断，但地面上没有鲜血。一个看上去很廉价的塑料狼人面具在他之后也飘落在地，这是他的脸第一次暴露在凉爽的空气中。也许如果能感觉到微风吹拂着他的皮肤，他就会醒来，但他一动不动，那双乳白色的眼睛凝视着上方的云朵，好像是第一次见到它们。他张大了嘴，不是出于震惊，而是好奇。他似乎只是被定格在那，好像这一刻可以永远延续下去，但随后他的身体终于开始流血。几乎不可察觉地，他的嘴唇抽动着，好像要挤出最后一个字。然后，他一动不动。
//
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//描述：
// 
//wasteland.jpg
//周遭的沙漠。
//
//沙漠。天空总是多云。几棵孤零零的树点缀着地貌，它们的树枝偶尔在风中摇曳。天气永远不会改变。温度永远不会改变。任何透过云层投射光线的东西都不会改变，但这一切都有着某种美好。这里很平静。
//
//在这片无边无际的景观中，唯一真正的特色是一个小镇，不比几个街区大。看起来好像某个郊区的一部分被剪裁并传送到了这里。也许事实确实就是这样。居民们告诉我，在有人居住这一层级之前，这些建筑就已经存在了。
//
//这些居民由各种各样的人群组成。一些人出生在这里，一些人从其他层级移民过来。我想这一层正是一个居住的好地方。这些房子永远保持着最好的状态，油漆永远不会剥落，管道永远不会出现任何泄漏，甚至冰箱和食品储藏柜也会自行补充。
//
//这一层级还有一个值得注意的地方：尸体不断从天空坠落，每隔几天就会有一个新的尸体坠落地面。有时在周围的沙漠上，有时在连接房屋的柏油路上。每当这种情况发生时，一小群人就会冒险出来埋葬尸体。我打算多问问周围的人关于这些事件的情况。我想还有更多值得报告的地方。
//
//入口和出口：
//入口
//我是从Level 372的郊区来到这里的，虽然这个方法本应把我带到Level 124，所以我认为它不可靠。我和镇上的一些人谈过这件事，很多人都报告说他们是从其他层级来到这里的。其中我唯一能辨认出的是Level 494.
//
//出口
//直到得到了所需的所有信息后我才会退出，所以我还没有确认任何出口，但我觉得沙子中一些可供一人通过的坑也许会通向某处。不过，当地人似乎不想冒险。我可以理解，我想进入之后就很难再找到回来的路了。
//
//发现：
//天空之城：
//我问过一些居民关于从天上掉下来的尸体，以及它们来自哪里。令人惊讶的是，他们给出了一个非常具体的答案。他们谈到了云端之上的一座城市，那里每个人都戴着面具(我之前提到过面具吗？尸体总是戴着这些塑料万圣节面具)。他们说，那是一个高等的社会，工人们被迫掩面以压制个性。一个如此发达的社会，然而他们的公民却被迫自杀。真可怕，对吧？但我认为这不是真的。我听的越多，一切就越不合理。每个人口中的细节都大相径庭。更不用说，没有人提供任何方式来获取这些信息。
//
//我问他们是怎么知道这些的，他们只是告诉我，年长的居民已经知会了他们，而那些年长居民又是被更早的居民告知这一切的，以此类推。我不认为他们在骗我，我很擅长识破谎言。我认为这只是一种代代相传的城市传说。但他们的确给了我一个地方去调查，一个被称为“父亲”的人。听起来很不祥吧？他们向我保证，父亲只是有点古怪。显然他在这里已经很久了，比任何人大概都活得长。我不认为我能从他那里得到任何有用的信息，但我还是追查最后一条线索为好。如果我什么都没有得到，我也不会失望的。我可能不应该期望得到合理的解释。这个地方的一切本就不合理。
//
//父亲：
//当他们向我展示父亲的房子时，我很惊讶。他们如此大肆吹捧他，以至于我没想到他会住在一个看起来如此普通的地方，但事实就是这样。房子被涂成深灰色，与周围颜色暗淡的房子没有什么不同。我走上前去敲门，但在我的手碰到木头之前，门就开了。
//
//门后是一个男人，他看起来很老了，不可思议得老。他皮肤上的皱纹似乎要淹没他的容貌。然后他笑了。他的牙齿发黄又弯曲，但他的笑容很纯净。
//
//“嗯？”他的声音沙哑，但我听得很清楚。
//
//“嗯什么？”我很紧张。他的出现使我遗忘了一切。
//
//“你想问我一些问题。”
//
//“是的。”
//
//“那就问吧。”
//
//他把我带到他家的起居室，示意我坐在沙发上。他拉起我左方的一张木椅，坐在我的对面。
//
//“空中之城是真的吗？”
//
//也许我应该先做些铺垫，而不是长驱直入。但这里的一切让我有些措手不及。
//
//他笑了。“有什么是真的吗？”
//
//“什么？”
//
//“我不知道。”他叹了口气。“我真的不知道那是不是真的。”
//
//“好吧，如果不是真的，那么尸体是从哪里来的？”
//
//“这是一个隐喻。”
//
//“什么？”
//
//“尸体。”停顿。“嗯，也许这座城市也是。”
//
//“我看过尸体。我知道那部分是真的。”
//
//“他们都戴着万圣节面具，你不觉得奇怪吗？”
//
//“嗯，是的，但是——”
//
//“你认为它意味着什么？你认为它象征着什么？”
//
//“我不确定我是否理解。”
//
//“嗯，他们告诉过你一些。面具代表着一个扼杀个体的社会。一个唯一的目标是把人培养成劳工的社会。一个不关心公民心理健康的社会。当他们自杀时，面具就会脱落。这告诉我们什么？在这样的社会里，唯一要做的就是自杀？这听起来不像是一个好消息，但这似乎是它想传达给我们的的。"
//
//“我不确定我是否明白。你一直在谈论隐喻，但这是真实的生活。你不能像书一样分析它。”
//
//“是吗？是真实的生活吗？”
//
//“啊？”
//
//“我在这里待了很长时间。‘这里’不仅仅是指这个城市，不。我花了很长时间在这个地方旅行，而我早就注意到了一些例子。这里并不全是毫无意义，有些事物自有道理于其中。”
//
//“我还是不太明白你的意思。”
//
//“你看。我将从你以前听过的东西开始。我相信你听过这样的观点，这里整个地方都是一个模拟，一系列的1和0奇迹般地创造了一些类似人类社会的东西。”
//
//“我听说了，但是——”
//
//“让我说完。模拟的整个概念已经暗示了上帝的存在。毕竟，必须有人来创建代码。必须有人对模拟进行编程。但它必须是模拟吗？难道没有其他解释吗？”
//
//“什么意思？”
//
//“这不是一个模拟。它比这简单得多。这整个地方不是1和0。这是诗。这是一系列在宇宙的某一页上舞动的文字。由一只我们甚至无法理解的手写出。随着电子脉冲流过一个永远不会真正在乎我们的生物的神经元，世界的生死随之决定。”
//
//他停顿了一会儿，陷入沉思。
//
//“所以你问我天空中的城市是不是真的。当然。至少，它和你我一样真实。也许有一天你会找到一种方式飞过云层。也许你什么也找不到，但这并不意味着它不是真的。你必须是真的吗？你做的任何事都必须是真的吗？并不，但你对你自己来说是真实的。我可以看到你坐在我面前的沙发上，所以在这一刻，你是真实的。如果我明天醒来，不记得你，你依旧是真实的。如果你不再存在，那也没什么区别。你现在是真实的，这还不够吗？”
package lvls6x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl648{}