//Level 657
//IMG-level-657-B.jpg
//购物车望着地平线，沉思着，沉思着，沉思着
//
//这么一天，云雾缭绕
//有个女人脆弱又娇小
//她穿过无人喧哗的停车场
//忽然间，她摔倒在地板上
//
//她的购物车也随之倾翻
//压入她的身体糊成一团
//血肉与钢铁的糅合物
//有颗心慢慢跳动而出
//
//“没有人使用我”
//“怎能遗弃了我”
//
//谁会过来把我推走
//让我能希冀着今后
//可以踢垮和踏翻这个牢框
//这个破碎且受摧残的心房
//
//你会把我拥入你的怀抱吗？
//答应不要在险境遗弃我吧
//为什么每个人都远远而去？
//如今小岛上生活着一个
//孤单的购物车
//孤单的
//购物车
//
//天空啊现在，是如此的蓝受
//天路开启的迹象一点也没有
//我身体的轮子，也开始锈坏
//我不知如何能令自己动起来
//
//“我不关心你是否想把我用到烂”
//“我只求你答应不要将我弃一边”
//
//你难道听不见我如此大声的喊呼
//我多么期望你能来这打碎我身骨
//只有即刻动身与你一同回家
//才会隐去全部的裂痕和伤疤
//
//你会把我揽入你的怀中吗？
//答应不要在险境遗弃我吧
//为什么每个人都远远而去？
//如今小岛上生活着一个
//孤单的购物车
//孤单的
//购物车
//
//为何只有在需要我之时，他们才把我看见
//也仅是为了带走所有东西，如此贪得无厌
//如今杂草丛生，在我身上生长蔓延
//地平线和蓝天——
//你的思绪
//是最后之物我所能望见
//
//谁都好，求求你了…莫要让我孤独
//我已经没有地方可去，没有地方漫步
//我的牢框是空的，请带我回家
//我的神，你究竟在哪
//
//你会把我揽入你的怀中吗？
//答应不要在险境遗弃我吧
//我的声早已破碎，我的魂也已崩裂
//如今小岛上生活着一个
//孤单的购物车
//孤单的
//购物车
//
package lvls6x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl657{}