//
//建立帐号 或 登入
//The Backrooms吧
//Backrooms Fandom Wiki
//The Backrooms中文wiki官方哔哩哔哩公众号
//Discord
//主页
//
//中文沙盒站
//
//图书馆
//
//层级
//|
//实体
//|
//物品
//|
//团体
//
//故事
//|
//相关人士
//|
//现象
//|
//设定
//
//搞笑文章
//|
//国际翻译中心
//
//原创图书馆
//
//原创层级
//|
//原创实体
//
//原创物品
//|
//原创故事
//
//原创团体
//|
//原创相关人士
//
//原创设定
//|
//原创搞笑文章
//
//原创艺术作品
//|
//原创现象
//
//网站
//
//最近创建的页面
//
//最近的更新
//|
//最近的编辑
//
//随机层级
//|
//随机原创层级
//
//随机实体
//|
//随机原创实体
//
//旧页面中心
//
//本月最高评分页面
//
//历史最高评分页面
//
//最低评分的页面
//
//社群
//
//讨论区
//
//翻译预定
//|
//最近的帖子
//
//作者页
//|
//中文网站作者页
//
//加入网站
//
//管理专用
//
//后台管理
//
//职员站点
//
//所有页面
//
//会员一览
//
//侧栏
//|
//顶栏
//|
//主题版式
//
//
//
//　
//
//Level 616
// 
//
//生存难度：
// 
// 
// 
//fIyMZHV.jpeg
//由未知流浪者在Level 616的大门处拍摄的照片。
//
//Level 616是后室的第617层。
//
//描述
//Level 616是一大片树木密集的面积未知的森林，其中大部分树木呈现干燥状态且没有生命迹象。Level 616在两种状态之间切换，分别被称为“和平状态”和“杀戮状态”。该层级入口处有一座大型的木制公寓，该建筑被带有一座大门的围墙围绕。在该层级一般可以发现一些特征性物品，如下所示：
//
//可发现握持多种物体的骸骨，常常为钩子或镰刀；
//出现不同尺寸的空心南瓜灯；
//桌面或地板上偶尔会出现Backrooms实体的塑像和雕像。
//若流浪者尝试穿过该层级的森林，他们将返回到他们出发的地方。目前的理论是该层级公寓以外的区域是不稳定的，导致流浪者的行走路线在不经意间发生弯曲，走向反方向。这不会立即对流浪者造成伤害，但会迫使流浪者穿过大门进入该层级的公寓。
//
//该建筑似乎是一座保存完好的19世纪公寓，其内部有与该层级其他区域类似的万圣节主题装饰，但比公寓外更丰富。其结构设计与19世纪常规房屋设计并无不同。然而，其内部尺寸大于其外部尺寸。
//
//成袋的不同种类糖果会在整个Level 616的房间中和露天区域出现。这些糖果往往被陷阱保护，这些陷阱一般不会造成伤害。陷阱包括但不限于：上搭假地面的坑、会困住靠近的流浪者的绳子和门上方的装有冷水的水桶。在Level 616可找到一些关于这些糖果的传单，以下为一个副本。
//
//快来，都快来
//好啊，来啊！
//挑战
//这里是鬼屋，我们为不同年龄段的来者提供挑战！最主要的项目是糖果跑路。你或许认为没有人能从这里逃脱，但事实不是这样的！只要你希望，你可以离开并再也不回来！你只需要找到10包糖果并把它们放在恐怖屋的桌子上，这不是很好玩么？
//
//规则
//你只能拿走10包糖果；
//流浪者之间可以合作，但每次只有1人能离开；
//如果你和别人合作，你的队友逃脱了，你需要另外再收集10包糖果才能从这里出去；
//我们的工作人员会在日间某些时段放置糖果，不要在此时进入公寓；
//祝你玩得开心！
//和平与杀戮状态：
//和平状态是Level 616通常所处的状态，是最安全的在Level 616收集糖果的状态，然而，这并不意味着此时适合在该层级进行探索。
//
//Level 616处于和平状态时，会出现如下情况：
//
//能找到少量糖果。
//该层级出现少量敌对实体。
//该层级任何区域都有充足光照。
//警备员有时会在该层级的公寓内被目击到。
//杀戮状态是Level 616最危险的状态，有很高风险。
//
//Level 616处于杀戮状态时，会出现如下情况：
//
//能找到大量糖果。
//该层级出现大量敌对实体。
//该层级在该状态下更暗，建议在此时使用手电筒。
//警备员在该层级处于杀戮状态时从未被目击到过。
//该层级公寓内的陷阱会造成致命伤害。
//实体：
//Level 616警备员：
//20211012_205708-1.jpg
//对Jack的艺术表现。
//
//20211013_132114-1.jpg
//一张描绘Frank的画。
//
//警备员是两个出现于Level 616的不相同的实体，似乎负责管理和维护该层级的公寓。这两个实体分别被命名为“南瓜头Jack”和“Frank”。这两个实体本身没有敌意，但若被激怒则会有攻击性。建议人员避开警备员。尝试攻击警备员的流浪者从未被再次找到。
//南瓜头Jack是一个高大的实体，由与蜘蛛类似的腿和一个附在上面的南瓜组成。此外，该实体的南瓜上雕刻了一个笑脸。可以观测到南瓜上的孔洞持续发出黄色光。根据南瓜头Jack自己所声称的，它似乎被派来保证“鬼屋是安全的”。
//被称为Frank的实体是一个人形生物，外貌与人类相似。但是，Frank明显比一般人类瘦弱。Frank会避免与流浪者接触，保持其所认为的安全距离。Frank的职务目前未知，但一般认为该实体负责管理该层级的装饰。
//已尝试对这两个实体进行访谈，但是没能获得结论性信息
//其它实体：
//该层在和平状态下除了警备员之外没有得到确认的实体，然而，多起对于不同实体的目击曾被报告。这些报告一般包括流浪者听到或看到来自未知实体的不同尖叫和剪影。如果有流浪者尝试对其进行调查，其不会找到任何踪迹，故这可能是Level 616的特性，但无法证实该假设。此外，在公寓内可听到笑声与交谈声。这个声音通常会说“去整点糖果”或其它意思相同的话。
//
//当处于杀戮模式时，在该层级的公寓内外会出现大量未知实体。公寓内往往会布满陷阱、糖果以及攻击性生物，不建议在此时进行探索，但若队伍准备好了进行战斗、杀戮和逃跑则在此时进行探索是值得的。
//
//基地，前哨和社区
//半人马座
//一个决定不离开Level 616的12人团队。
//该团队受过充分训练以在杀戮状态下进入公寓。
//接受贸易。
//除非受到威胁否则不会表现敌意。
//入口和出口：
//入口
//最常用的进入Level 616的方法是梦到该层级。流浪者报告称这些梦境本身都是噩梦。由于入口的该特性，大部分关于该层级的细节信息目前未知。一个替代性的进入方式是在任意层级找到一个关于该层级的传单。
//
//出口
//唯一已知的离开Level 616的方式是收集10包散落在该层级的糖果。随后流浪者将回到其原先所在的层级。如果流浪者通过噩梦进入该层级，该个体会在其入睡的地方直接醒来。
package lvls6x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl616{}