//Level 880
// 
//
//生存难度：
//等级 1
//
//安全
//稳定
//极少量实体
//Level 880是一片疑似无穷面积，发光的海底环境，一艘自动驾驶，异常构造的潜水器械充当着这一层级唯一的宜居区域。
//
//礁石行者号
//Level 880唯一的宜居区域是一艘大得难以置信的潜艇的内部，它被该层群的主要住民命名为 礁石行者号1 。礁石行者号似乎主要由黄铜、紫铜、组成大窗的强化玻璃以及一种未知种类、像钢铁一样、拥有深蓝色彩的金属所组成。这种金属似乎是礁石行者号主要的组成成分，因此这艘潜艇大部分被呈现为深蓝色。
//
//礁石行者号疑似能够独自运行，这让一些人相信它拥有自我意识，再不济也是由某种外部力量所操控着。尽管没有发现任何已知的功能电源或操作装置，这艘潜艇仍然一直保持着活动，这种现象为这两种理论进一步提供了证据2。此外，由于礁石行者号缺少发电设施，潜艇几乎没有任何的机械光源，但借着海洋照进的微光，使得空间内并非处于完全的黑暗。十分昏暗的环境让潜水艇的大多部分处于一种类似“夜间”的模糊景象。如果你视力不佳，虽然并非强制性，但也极度不建议将手提光源（也就是手电筒）带到Level 880，这一层级的居民视觉对光源十分敏感，并且会对手电的照射感到恼怒或不满。由于前文中提到的居民所具有的这种性质，他们对光源照射会呈现出如下几种不同的反应——有些会礼貌地让你将手电筒拿到一边，有些会怒气冲冲地恐吓你，而有些居民似乎会将光源照射视作一种挑战，直直地与其对视。总而言之，最好不要冒险冒犯他们。
//
//礁石行者号与任何在前厅已知潜艇的构造都不相同，它由四个楼层组成，并由一座单独的电梯将它们相连。一些在楼层上的房间对整艘船并没有明确的作用，这让该层级的居民将它们改造为居住与储存物资的区域。礁石行者号最特别的一点在于，它疑似拥有腿部：朝某扇嵌进外部舱壁的舷窗向外看，有时会有机会捕捉到一个短暂的瞬间，呈现出推测为是14只细长机械质感的腿部在驱动整艘潜艇前进的景象，而非任何传统地、依托螺旋桨进行移动的方式。这些腿部引发了许多有关礁石行者号外部真实样貌的猜测，大多人相信它是一种巨大的等足类或其他品种的深海甲壳动物。
//
//礁石行者号由一个由智慧实体组成、被称作 海沟歌者 的怪异组织所全权管理。虽已无法得知他们是何时接管的这一层级，但自他们接管以来，这里便被改造了一个繁华的社区，甚至达到能够在一些较大房间建造村庄的水平。
//
//Reefwalker
//礁石行者内部的基本示意图，由艺术家Aster Conkreet提供。
//
//位于礁石行者号的四层楼层，由上到下如下显示：
//
//星光层，对海沟歌者有某种宗教意义的楼层。
//上部楼，作为流浪者的主要进入点的楼层。
//中部楼，仅有两个区域的楼层。
//下部楼，主要由电子硬件迷宫所组成的楼层。
//如若要查询包括房间的细节在内，有关各个楼层的细节，请浏览下方任一折叠条目。
//
//隐藏 880 - 星光层
//星光层
//星光层是礁石行者号最高以及最小的楼层，仅仅由一道长廊与一间未知尺寸的异常房间所组成，星光层似乎对海沟歌者而言拥有严肃深刻的宗教重要性，这里对他们而言似乎是一种类似“圣地”的存在。在各个楼层中，它拥有着最多的舷窗和玻璃幕墙，因此，它同样是整艘潜艇中最明亮的楼层。
//
//星光长廊： 一条相当长的走廊，两侧的墙壁挂满舷窗，天花板的玻璃穹顶星罗棋布地排列着。这条长廊笔直地通往星光室，在大部分情况下，任意时间都至少有两名身强力壮的海沟歌者在此巡逻。尽管潜艇的墙与窗户没有显现出明显的泄漏迹象，这一楼层的过道仍然被海水充斥的水洼所覆盖。如果对你鞋子的防水性能没有自信，建议在这条长廊上要小心走动。
//
//星光室： 除了星光长廊外的唯一一间房间，并在目前仍处于高度未知的状态。由于海沟歌者对这间房间的严密保护，关于这间房间的情报微乎其微。因为只有成员与即将成为正式成员的海沟歌者允许入内，截至撰写此篇报告时，仍然没有一次对星光室的成功勘察。对这间房间唯一能够确定的信息就是它尺寸巨大，形状相对而言呈现圆形，并且在墙面上高耸着尺寸大到难以置信的窗户，海洋透过这些巨大的窗户完全照亮了整个房间。此外有流言声称，这一房间的地面是由水组成的层面，流浪者与海沟歌者可以像在其他固体表面上一样走动。
//
//在Level 880各种各样的居民里，只有“被选中”的存在才能够进入星光室，选拔程序的具体细节是未知的，因为大部分海沟歌者对这一问题的回答都不相同。然而，我们能够得知的是，当流浪者进入房间时，他们会经历一场所谓的“仪式”，这将导致流浪者被转化为一名海沟歌者，以至于永远停留在Level 880中。仅有两名已知的流浪者在进入房间后没有被转化为海沟歌者，他们是被称为“蛋蛋领主”的流浪者Kirby·Shatner与隶属于M.E.G.的Cyrus·La'Bumski。
//
//隐藏 880 - 上部楼
//上部楼
//礁石行者号的上部楼恰好坐落在星光层的下方。它实际上充当着这艘潜艇“核心枢纽”的作用，包含流浪者来到这里的起始点与海沟歌者主要的居住楼层。毫无疑问，上部楼是这一层级危险最少的部分3。
//
//入口大厅：一间小面积的矩形房间，似乎被定位在这艘潜艇的止点上。它拥有一扇巨大的舷窗悬挂在它的背壁，它的一侧墙面配有电梯，并且墙上一扇通往主舱的门正对着那扇舷窗。这间房间的名字源于海沟歌者见大多流浪者都于此进入Level 880而为其起名。有些特工曾问过海沟歌者们，为何这间房间明明不是一座大厅，他们却仍为它取出“入口大厅”这样的名字，这一问题得到了大量不同的回答，从“我到这之前他就叫这个了”到“因为这么叫它很酷呀”。
//
//电梯： 最初是被定位于入口大厅一边侧壁的小型立方电梯，它的墙壁与门似乎由某种黄铜所铸成，由后侧的玻璃幕墙外边的海洋为其提供主要的照明。电梯的金属板上配有八枚按钮。
//
//被标记为1，2与3的按钮分别通往上、中、下三个楼层。
//标有星星图案的按钮通往星光层。
//开关电梯门的按钮与普通电梯无异。
//红色的应急按钮貌似会在电梯在中途卡住时将其重新启动。
//最底下标有问号按钮没有任何作用。
//与任何标准的电梯一样，按钮上方有一个黑色的小屏幕。不论何时，每当在电梯中进行例如进入、离开或按下按钮的操作时，屏幕都会显示几个短语。根据这些不寻常的评注，可以推断这间电梯或许是电梯的某种变体。
//
//主舱： 整个潜水艇中第二大的房间。周围大约有一个足球场的面积，并且墙体建得相当之高，这间房间因其巨大的尺寸在上部层以至于整个潜水艇中占主导部分，仍不清楚这样巨大宽敞的房间对这艘潜艇最初的作用是什么，但自这房间被建造以来，便根据海沟歌者的需求被改造成了类似于“村庄”的场地。这座村庄由看起来十分脆弱的废弃木材所组建，并偶有舒适的帐篷夹杂在楼宇中间。
//
//这间房间被镶嵌在两侧墙内的六扇大窗所微微照亮。即使窗户如此巨大，舱室内仍旧是极度的黑暗。但尽管在如此黑暗的环境中，在室内的生活却总是保持着积极与活力，歌者们不断忙碌着，为他们的日常生活与工作劳顿奔波。友情提醒，你应当在穿越这片地区时小心一些，在这里的人们很容易被杂物，或在某些情况下，被人绊倒。
//
//东部与西部大厅： 一对长廊，可以分别从主舱东西两边墙上的门进入，两条长廊拥有同等的长度与宽度并同样排列着舷窗。因此带来的极佳视野，再加上没有任何歌者在长廊安家，让这两座大厅共同成为了观赏外部海洋景观的最佳景点。
//
//隐藏 880 - 中部楼
//中部楼
//中部楼位于上部楼与下部楼中间，它是唯一被认知为具有危险性的楼层。它的危险性来源于它是整个礁石行者号上唯一拥有敌对实体的地方。更糟的是，这层楼的大多数空间被笼罩于黑暗之中、不断移动变化的地形所占据。建议在进入中层楼时时刻保持高度警惕。
//
//垃圾间： 一个相当大号的房间，如潮水一样源源不断涌现的湿垃圾代替了所有地板。这个房间极其黑暗且寸步难行——沿着堆积如山的垃圾前进时，你必须万分小心，稍有不慎便会被卷入垃圾之中，在最坏的情况下甚至有可能被其直接吞噬。加上这是礁石行者号中唯一拥有敌对实体的区域，这点使它无疑成为了整个层级中最危险的地方。根据推测，这层垃圾是深不见底的，因为至今仍未有人能触及到被它淹没的固体地板。此外，通过移除房间内的垃圾来清洁它也似乎是徒劳的，因为不论从房间移走多少的垃圾，垃圾组成的浪潮仍旧会保持在同一水平线上。这些垃圾多由废木头、废金属与破布料组成，但你偶尔也能在其中找到一些其他有趣的东西，例如：
//
//基础缝纫器材。
//浸水的枕头。
//看着就很有趣的小玩意儿。
//小碎石子，在岩石的种类与色彩上各有不同。
//除了这些杂七杂八的垃圾外，通常也能在垃圾潮中找到腐烂的海洋生物的尸体，这些尸体是海沟歌者们唯一的食物来源，你有时能在这里发现更多是身材轻盈的海沟歌者在这片垃圾海洋中捕鱼，并估摸着能否为他们自己、或因更加笨重无法安全进入垃圾间捕鱼的伙伴们找到些更先进的食物。
//
//这间房间同样是Level 880中唯一能发现敌对实体的地方， 有 寄生谎， 蠕灵， 蚂蚁，和腐蚀者出没。
//
//驱动室： 有时也被称作“引擎室”和“反应堆”。驱动室是一间能从垃圾间一面墙上的门进入的大房间。这间房间大且呈立方形，由一个大型、类似涡轮机的装置主要构成，这一装置被认为是礁石行者号的引擎，但就目前来看，这个引擎已经完全报废了，它的表面锈迹斑斑，并且有数个重要部件的缺失。房间四处散落着垃圾，这些垃圾很可能源自无意中被卷入的垃圾间浪潮。
//
//隐藏 下部楼- Lower
//下部楼
//下部楼是礁石行者号的最底层，同时也是整艘船上最诡异的地方之一。整个楼层的大部分区域是一间被称作“电气领域”的巨大迷宫式房间。潜艇的这一部分是迄今为止最黑暗的，这意味着你极易在这一分层迷路，在没有一名至少海沟歌者的帮助下穿越这片区域是十分不明智的行为。
//
//电气长廊： 通往电气领域的长廊；有些类似于星光层的星光长廊，却比上部楼的东西大厅略微短些。只有非常少的舷窗提供照明，这让这里几乎伸手不见五指。取代舷窗，挂在墙壁上的是无响应的操控面板，上面布满了闪烁的灯泡和按钮。
//
//电气领域： 礁石行者号上最大的房间，并且因为时常在此有流浪者失踪而恶名远扬。电气领域内只有构造无序古怪的迷宫，墙面上挂满了奇怪的屏幕、压力阀门、按钮、键盘，以及一些其他你能在潜艇上找到的可互动物品。人们将这个区域认为是礁石行者号构造异常的控制室，但里面的控制设施似乎都没有什么实际作用。屏幕上显示着乱七八糟的像素噪点，阀门随机地转动着，按钮们发着光并能在按下时发出可爱的哔哔声，但似乎没有一件电气领域的物品在互动后有产生实际作用。
//
//除了屏幕按钮带来的昏暗光照，空间里是令人难以置信的一片黑暗。更何况这座迷宫因为充斥着被绊倒的危险性而臭名昭著。一些椅子的轮毂散落四周，被控制的墙壁与那些无法响应的面板一样会随着你向前探索突兀地凸出。因为它迷宫式的结构，人们很容易在电器领域迷路，高度建议寻找一名海沟歌者护送你通过房间，因为他们比一般的流浪者更善于导航。
//
//冷库： 一间相当寒冷的房间，可以通过电气走廊电梯旁边的一扇门进入。冷库是一间小面积的矩形房间，它被这个层级的住户改造成了某种储藏室，主要用来储存海沟歌者们捕来的未腐烂的肉类与蔬菜，此处同样也存放着一些放在这里会显得很奇怪的物品，例如衣服。这个房间通过一对镶嵌于天花板，不断喷出冷空气的通风口常年保持在恒定32°F（0°C）的温度。
//
//冷库的一个角落内有一扇舱门，将其打开会通向一条冗长的金属壁洞口，它会将流浪者直接投射到外部的海洋。这个位置奇怪的舱门是进入海洋的唯一途径、冷库内唯一的光源，以及海沟歌者们唯一的水源来源4。值得注意的是，由于舱外没有梯子等借以返程的装置，这个舱门是有去无回的。这个舱门的出口点大致位于礁石行者号的最南端。
//
//为了从外部观察礁石行者号的全貌，人们曾七次借由这个舱门进入海洋进行勘探，但最终均以失败告终。
//
//陈列室： 整艘礁石行者号尺寸最小的房间，客观而言也是最奇怪的房间之一。它的入口在电气领域的西南转角深处，偏僻得像是有人刻意将其隐藏。陈列室在整个层级中显得格格不入，并非礁石行者号标准的深蓝色钢质壁面，它拥有着深色木质地板与黄宏条纹相间的墙纸图案。整个房间仅仅由一盏悬挂在天花板的昏暗灯泡提供照明，这也是整个Level 880内唯一的机械光源。
//
//这个房间得名于它所陈列的八个海洋生物标本，每一只生物都不类属于任何在前厅或后室的已知海洋生物。与进入Level 906的方式类似，沿着这些鱼类的名字滑动你的手指将会把你传送至其他的层级，每个奖杯传送的层级都有所不同，具体见下方的出口部分。
//
//深海
//像之前提到的一样，礁石行者号的外部是一片广袤的海洋，它几乎占据了Level 880的绝大多数空间。正如“礁石行者”这个名字所象征的一样，据推测，这片所谓的深海是一座位于海底的无尽冷水珊瑚礁。这片区域的光照水平被认为是介于低中层海（黄昏）与深层海（午夜）之间。仍未知这片海洋是否拥有海面，然而，尽管位于水底深处，在Level 880中也似乎并不存在有海底压强。
//
//并非处于一片漆黑，整个层级中栖息着成百上千的发光浮游生物，虽然没有达到照亮整片海洋的程度，但这些生物也为礁石行者号或者说整个冷水珊瑚礁本身提供着相当可观的光线。许多进入Level 880的流浪者们都把这片海洋比喻成“挂满天幕的星斗”。
//
//在浮游生物散发光芒之下，各种类属于前厅的深海鱼类、珊瑚和甲壳类动物都被“星斗”所照亮。所有存在记录的物种似乎都是能在前厅深海区的找到常见鱼类。
//
//海沟歌者
//海沟歌者是一个仅在Level 880出现的狂热宗教组织，总的来说，这个组织十分友好，尽管他们不允许任何非海沟歌者的个体长时间逗留在Level 8805，他们付出大量的努力将礁石行者号改造成了自己的家园，在主舱内建设了一个完整的村庄、并利用在垃圾间发现的闪亮石头发展出了货币体系，依靠鱼类尸体与海水维持着他们的生存。经历的种种考验是他们能立足于Level 880的资本，他们虔诚地信奉着，那名为“潮湿大神”的唯一神明。
//
//尚不清楚潮湿大神的现界神形，似乎每一个海沟歌者都对这位神祇的外貌与声音有不同的认知。然而，虽然祂容貌不详，但在每一次对海沟歌者们的盘问中对这位神明的造化与细节却有保持一致的部分。其中一些不变的因素包括有——
//
//潮湿大神创造了Level 880，同理，祂同样创造了海沟歌者。
//潮湿大神与深海与它的造物们有着极端的亲和力。
//潮湿大神本身并不居住在Level 880，它绝大部分时间都位于“空洞的蓝色深渊”，无法确定这是否指蓝色通道亦或其他。
//潮湿大神亲自挑选将转化为海沟歌者的流浪者。
//潮湿大神绝不是一位暴戾或严苛的神明。
//潮湿大神似乎对海豚拥有着明显的憎恨情绪。
//海沟歌者间以潮湿大神的名义举办着数个仪式性的节日。这些节日的意义并不旨在安抚祂，而是为了对其“进行回馈”。节日的参与并非强制性的，一个海沟歌者可以自由地决定是否参加这些节日，尽管缺席会令他的同族们所不齿，但这仍是被允许的。
//
//如前文所述，加入这个组织必须被潮湿大神所“选中”，获得被选中的头衔是一场十分困难的测试，并且似乎没人确切清楚这个过程究竟涉及到什么。话虽如此，海沟歌者们似乎全部拥有识别被选中者的能力。如果一个被选中的流浪者进入Level 880，他们将会被介绍到星光室中，在那里歌者们的实际领袖将执行一场不知详情的仪式，导致流浪者永久地被转化为一名海沟歌者。海沟歌者的领袖是一个形象怪异的三臂鹈鹕鳗，据说他相较于其他海沟歌者而言，有与和潮湿大神更紧密的连接。
//
//当一个流浪者被转化为海沟歌者时，他们会经历生理和精神上几个明显的变化。通常，变成海沟歌者的流浪者会保持他们从前的记忆与个性，但他们会开始变得完全不愿意离开Level 880。而后，他们会为自己更改一个新名字，这个名字出自某种特定的深海生物。有些海沟歌者变得完全习惯了他们的新名字，连他们以前叫做什么都忘记了。
//
//每一个海沟歌者在外观上都大致保持人形，但在他们的身体上，往往有一些怪异的生物学畸形使其明显区别于人类。这些畸形千奇百怪，包括有被拉长的身体部位、扭曲或变成球体的躯干，到增生或缺少的四肢。已知这些畸形多半不会在一开始就存在，被选中的流浪者会随着他们在Level 880停留的时间增加缓慢畸变。人们认为，当流浪者的身体外观停止转变时，便是他们成为海沟歌者、脱离人类身份的时刻。除上文显而易见的畸形外，海沟歌者的身体常年被一层材质独特的衣物包裹，对于他们的生理特征也不得而知。在他们的衣柜中最引人注目的资产便是一顶由与他们同名的海洋生物形象类似的毡织斗篷，从这些罩子里的鱼嘴可以看见海沟歌者隐隐发光的眼睛。
//
//屏幕讯息:
//如前所述，在你与礁石行者号的电梯互动时，电梯上的屏幕会根据你的具体行为亮起随机的短语。下面是迄今为止记录的标准短语列表，此外还有一份更加特殊的短语清单，上面记录的短语均仅出现过一次。
//
//隐藏 880-E
//进入时的短语
//这些短语可能在你最初进入电梯时显示。
//
//[用流浪者的母语进行正式的问候]。
//冒泡的声音
//多么有趣啊
//按按钮就完了
//离开时的短语
//这些短语可能在电梯到达目的地或你将要离开时显示。
//
//[用流浪者的母语进行标准的道别]。
//生活愉快
//路上小心
//请你为他人着想
//输入数字时的短语
//这些短语可能会在你按下标有1，2，或3的按钮后显示。
//
//冲呀！
//向上向下——随便啦
//哆ruai咪
//摩擦我的齿轮
//星星短语
//这些短语有可能在你按下星光图案的按钮时出现。
//
//抬头来汪海星星
//上天国
//是来转化的吧？
//星光灿星光漫
//一闪一闪亮晶晶
//卡住时的短语
//当电梯罕见地被卡住时，会显示如下几句短语
//
//呃呃
//蛤
//等等哈
//哦，我去
//一般是不会发生这种情况的
//对不起
//:(
//问号短语
//这些短语可能会在你试图按下问号标记按钮时显示
//
//什么？
//不
//请停止
//我不知道那意味着什么
//????
//我不能
//错误
//省省吧
//有时与电梯的互动会导致“独特”的信息出现。它们只出现过一次，并且被认为是一次性的“错误信息”。有错误信息出现的现象与电梯类似，这进一步论证了礁石行者号的电梯似乎是电梯某种变体。
//
//隐藏 880-E?
//电梯错误
//进入时的短语
//欢欢欢欢迎光临
//鞋子不错呀
//2333
//华盛顿
//离开时的短语
//要小心生物名称
//希望我能再见到你
//Fimsh
//输入数字时的短语
//我觉得2是我的本命数字
//往…左边？
//多么粗糙的选择呀，我的小乡巴佬
//试试我们的食物再来见见我们的鱼人。
//别忘记去逛逛地点位置
//星星短语
//你听到了嘛？
//感受那令人愉悦的丝滑
//卡住时的短语
//饿啊
//唔
//我要吐了
//我只是停下来方便你观赏一下外边的酷炫景象而已
//问号短语
//……
//每隔一段时间，其中一块发现于电气领域或电气长廊上的控制屏幕会发生突然关机的情况，在直到其重启的这段时间，屏幕上似乎会出现某种错误的显示。然而，这些错误显示并非普通的屏幕故障，而是会输出胡言乱语、古怪的诗句，甚至还会显示食谱。这些错误往往会持续一个小时不到，随后屏幕便会自行修复后显示正常的输出。
//
//一位更名为三角鱼的M.E.G.特工在被选为海沟歌者后一直贴心地记录着这些错误，并在其他特工经过此层级时将情报转送。下面是一些错误屏幕上值得关注的记录。
//
//隐藏 880-1
//错误短语
//下列列表由错误屏幕上出现的各种通常为单句的短语所组成，其中一些似乎是标准的计算机错误信息
//
//你的电脑遇到了一个问题！
//蓝屏
//Ctrl+Alt+Delete
//序列错误：请拔掉电源插头后重新插入
//请立即保存，否则你将丢失你的数据
//计算机已损坏，是否修复？
//看起来有人购买了FISHNAME的盗版，怪丢人的。
//舒舒服服地，进入睡眠模式吧。
//错误：我拥有了一个鱼脑子，啵，啵。
//硬件故障，我需要物理治疗。
//我似乎已然步入超凡
//喝海水吧，脱水会让你充满活力。
//在海浪的拍打下，我遍体凌伤，即便如此我依然保护着。你是否以我为荣？是/否
//猎杀海豚
//更正：脱水其实是件很糟糕的事。
//冷知识：线口鳗的肛门在它的喉咙里。你知道不？我知道。
//我的胃好疼，好痛苦。
//授人以鱼不如授人以渔。
//隐藏 880-2
//随机音乐事件
//在一个久远到已经被遗忘的日子，一个奇怪的错误导致一块电子屏幕完全变黑。然而，这块屏幕仿佛拥有了自我意识，开始播放一首伴有歌词的电子音音乐。这些歌词十分难以理解，在某些地方完全显得莫名其妙。
//
//进出来去
//翻覆飘絮
//进出来去
//（恸哭/挣动）因于
//
//鱼跃出水
//安能呼吸？
//鱼跃出水
//安能（看清/活命）？
//
//来去进出
//（惊叫/尖声）旋舞
//来去进出
//尖啸亵渎
//
//阿，离水之鱼
//汝安（理喻/钝愚）？
//离水之鱼
//汝知恐惧？
//
//进出来去
//坠入悲虚
//进出来去
//暴怒，狂虐
//
//离水之鱼
//数以千计
//离水之鱼
//至少约也880数级
//
//来去进出
//(无法理解)
//来去进出
//周而复始
//
//阿，离水之鱼
//汝畏死乎？
//阿，离水之鱼，
//不必担心，我会来带你回去。
//
//这首歌循环了两遍，它在最后一个调子上停留了大约三小时后，便恢复到了原来的画面。
//
//隐藏 880-3
//未知菜谱
//在2021年7月7日，电气领域的一块屏幕陷入了错误状态，它缓慢且啰嗦地显示出了一道未知料理的菜谱，由于这道菜谱上许多无意义的制作成分，截至撰写这篇文章时仍无法还原出这道菜肴。
//
//第一步： 用你能找到最大的碗，加入如下几种食材：
//
//五（5）杯当场研磨出的面粉
//五（5）杯并非当场研磨出的面粉
//三打（36）加仑的盐水
//小部分（大概是一点点吧）新鲜的氧气（太香辣！）
//一块当地市场买到的gribblebits
//一整罐Big Tonythan的豪华版番茄豆子汤——蓝色灼烧III 至尊版2.0先生+指关节
//五（5）茶匙柠檬汁。柠檬汁必须来自于一株非常特别的柠檬树。因为相关法律我无法告诉你它的确切位置，不过你看到它就知道了。
//用同一支茶匙来加入面粉。
//一种新发现的青蛙物种（必须没有被任何其他物种发现过才行）。
//你灵魂的一部分，如果你没有灵魂，可以用朋友的灵魂代替。
//根据个人口味加入一些铁。
//如果你想尝试时髦一点的吃法，加入数个绵羊形状的棉花糖。他们必须是绵羊形状的。如果他们不是绵羊形状的，这道菜将会惨遭失败。
//如果你感觉很自己很狂野，可以加入一些巧克力。
//只有当你自己感到很爽的时候，才能够同时加入两种食材。
//第二步： 用打蛋器把混合物打成面糊，我没有打蛋器就用自己的手代替了。这大概没差啦。确保里面最坚硬的材料也要被打成汤状的面糊。搅拌它，直到你的调制物完全液化。
//
//第三步： 当你觉得搅拌完成时，继续搅拌五分钟。这是一个重要的步骤。忘记额外五分钟的搅拌会导致可怕的后果，你无从得知这个报应的存在，但他们的的确确发生了。
//
//第四步： 当你完成搅拌后，把面糊到倒进冰块托盘为冰块定型用的孔洞里。确保它不是塑料材质的，因为它会在烤箱里被烤化。同样确保它不是金属材质的，因为它会在烤箱中结冰。别忘记戴你的烤箱手套哦。
//
//第五步： 用下列的一种或几种方式来对未烹熟的菜肴进行调味——
//
//醇厚的氮气，必须是醇厚的，如果它不够成熟，你可能有在食用后患上香草鲑鱼病的风险。
//一顶有趣的小女巫帽。在任何情况下你都不该用巫师帽来进行调味。
//随便啥与太阳沾点边的东西
//诺如病毒
//用任何不属于上述四项选择之一的材料调味，都会导致令人难以置信的可怕后果。三思而后调味，小厨师。
//
//第六步： 把食材放入烤箱，烤制8分钟至17个小时，烤制的时间取决于你最主要及最受尊重的器官的意愿。
//
//隐藏 880-4
//潜艇上的一节历史课
//在2020年10月6日出现了一启特别的屏幕错误事件，似乎是一节有关于这艘潜艇的某种历史课程。隶属于M.E.G.的几位历史学家曾多次对这节所谓历史课程中的内容展开质疑。
//
//部分有关这次错误信息的记录如下。
//
//自从拥有智慧以来，人类一直在追寻着对事物的控制。无论是物件、动物或者其他人类，对很多人而言命令某物在你的要求下改变或行动都是一种让人欲罢不能的权能。然而，随着时间的推移，人们开始对越来越大的物体产生占有的渴望——而在可能被控制的物体中，最大最好的东西就是土地。因此，王国的概念被发明了。作为一个国王，你有权利控制星体名称本身，以此延伸到所有胆敢在你的领域中存在的生物。
//
//随着时间在黑暗时代的血泪中不断推移。许多地位在平民百姓之上的人们把目光投向了陆地之外的两个地方；那就是天空和大海。然而，天空几乎是不可能被触及的，它在众多神明的管辖之下，祂们用人类可望而不可即的狂风、极寒，与风暴保护着自己的领土不受殖民。因此，在等待技术水平能够发展到征服天空的这段时间里，海洋成为了人们征服的下一个目标。可是，人们渴望的并不是海洋的表面，而是海洋深处，潜藏在海平面底下那片难以言喻的宝藏。这便是潜水艇产生的契机。
//
//从那时起，人们开始勾勒出各种不同的想法来征服海洋，有的人甚至开始创造和使用拥有缺陷的潜水艇。第一艘潜艇的历史可以追溯到1620年，它由一个叫做Cornelius Van Drebbel的荷兰人设计与建造。该交通工具形态类似于一艘涂有防水皮革，由船桨推动的密封大船。为了解决水下的呼吸问题，Drebbel使用了一种被称为硝石的奇妙矿物制造氧气供他与船员们生存。令人惊讶的是，它成功了，Drebbel与他的船员们成功潜入水下，并且在三小时后重新上浮。全程没有受到任何伤害。这在当时是一件工程奇迹。
//
//在Drebbel成功证明人类能够在水下生存而不被溺死后，潜水艇如其他技术一样，不断进步着。如今，木质与皮革的外墙被完全防水抗压的金属替代。船桨和人力被精心设计的螺旋桨与发动机取代。由硝石产生的空气已完全是过去式，取而代之的储存在水箱中，实实在在的氧气。在所有技术中，潜水艇无疑是走得最远的。
//
//然而，我不认为迄今为止的任何一个人能够创造发挥出最大可能性的潜艇。想象一下吧，一艘如果你愿意便能永远居住其中的潜艇，像一个家一样。你与你的朋友或家人们完全不需要处理海面之上那些普遍的问题，你们都能在海洋之中过上没有纷争的生活…
//
//据推测，至少还有两段未被记录的讯息，特工三角鱼没能赶在屏幕重新启动之前将它们记录下来。
//
//隐藏 880-5
//阳光怒怨。
//在2021年1月18日，电气领域的一个屏幕陷入了错误状态，它开始发表一系列奇怪的、对阳光的愤怒埋怨。完整的埋怨内容记录如下。
//
//你知道嘛，我一直不懂阳光是有什么毛病。
//为啥每个人都好像一直很享受它的暴晒一样？
//它让你出汗，灼烧着你的肉体。
//更别说，晒得太多就会有一个不速之客来拜访你。
//最糟的是，如果你试图欣赏它时它还会将你亮瞎。
//这有什么好享受的？
//我真的不懂啊，
//我的大脑无法理解，
//明明能拥有愉快的寒冷与黑暗，为何还要暴露在残暴的热量与致盲的光线中？
//有一说一，冷就是比热好。
//在寒冷里，你可以长出更多的皮肤和脂肪层直到你达到适宜的温度。
//但在燥热中，你只能让你的皮肤们被一层层剥离，到最后就只剩下骨头了。
//没错没错，你在光明中看的是比黑暗更加清晰。
//但黑暗保护着你免受周围人丑陋的伤害。
//他们怪异的毛皮和多毛的头皮。
//和他们奇怪的，充满粘液的喙。
//呕。
//光是想到就让我心里发毛。
//总之，回到正题..
//在黑暗里，没人能看到你在焦虑或是哭泣。
//在黑暗里，没人能让你产生因为被发现在一般区域喷洒黄色液体的尴尬。
//并且在黑暗里，没有一个小型肿瘤会突然跑到你的身体里安家。
//我们身体里唯一的寄生虫在他们能正常生活前就已经被吃掉了。
//对他们来说，那确实可悲的，但对其他人来说是好事一桩啦。
//总得有人来当倒霉蛋。
//我言尽于此。
//
//入口与出口：
//入口
//人们偶尔能发现一艘潜艇的潜望镜从大水体中探出。抓住潜望镜会使你在水下被拖动一小段时间，随后在入口大厅中“醒来”。潜望镜最常出现在Level 85、Level 97、Level 134和Level 233。有报告称，潜望镜同样出现在Level 283的坑洞中。
//人们能在 Level 817 找到一具错位、死去已久的抹香鲸尸体。与它距离过近会导致你昏倒，随后在垃圾间的某处醒来。
//出口
//在陈列室将手指沿着鱼的名字滑动，会将你送到不同的层级。
//构造简单瓶头鱼会将你送到Level 37。
//漩涡废品鳗会将你送到Level 34。
//二进制错误会将你送到Level 201。
//葫芦囊咽鱼会将你送到 Level 45。
//油菜学院会将你送到 Level 117。
//折纸礼服海星会将你送到Level 409。
//火神锻造蟹会将你送到Level 8。
//凸眼某某鱼会将你送到Level 43。
//通过冷冻室的舱门跳入大海会将你冲到Level 134的海岸上，或者在Level 119醒来。有传闻说这种出口方法也有可能将你送到Level 100，但就和这一层级的性质一样，这是未知的。请注意，这种出口方法需要你在水中因缺氧而昏迷，这对一些人来说是很可怕的。
//作者信息
//« Level 879 | Level 880 | Level 881 »
//
//Footnotes
//1. 没有人能确定它的称呼究竟是“礁石行者号”，亦或仅仅是“礁石行者”，甚至这一层级的原住民也似乎是以两种名称随机交替的方式称呼着它。
//2. 要我跟你实话实说，这玩意完完全全就是活着的嘛，再怎么说也是有感情的。如果它看着像是活的，那它十有八九就是活着的，后室的法则就是这样，懂不？
//——“碎膝者”Jerry·Patella
//3. 除非你真的很厌恶鱼的味道——如果真是这样，那这一整个层级对你来说都是人间地狱了。
//4. 没错，他们喝海水 。
//5. 通常不超过三天。
package lvls8x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl880{}