//Level 888
//
//
//内容警告
//本文中包括可能引起不适的内容、版式和涵义。如果你对以下内容敏感，请谨慎考虑是否阅读。
//
//生理&心理创伤
//家暴&殴打
//虐待动物
//绝食自杀
//
//
//
// 
//
//生存难度：
//极度不适宜居住
//持续生成的实体
//无解的认知危险O4CkJVV.jpg
//在温和天气下拍摄的照片。
//
//Level 888是后室的第889层。它是一片巨大而冰冷的地带，由荒芜的森林组成，四周环绕着山坡。该层级存在数种特有的实体，它们共同组成了一套生态系统，这套系统实现了自给自足，但却会通过操纵心理对人类产生极为有效的强烈诱导，而且没有任何已知方法能够减轻这些实体造成的任何影响。
//
//描述
//Level 888中最有必要去探索和了解的区域就是它的森林景观。里面只有落叶树和灌木，而这些植物全都已经或者将要死亡。经测量，此地温度最低可至-34°C (-29.2°F)，最高至-5°C (23°F)。昼夜周期40小时，季节变化可以忽略不计或者说根本不存在。虽然看起来像雪，但地面上覆盖的白色粉末实际上是一种硅藻土，其包含的晶体硅浓度被认为足以对人类产生毒性，而在低浓度下，这种粉末能够形成云团，受干扰后悬浮空中。此地的能见度也受到由前文所说的这种粉末以及硫酸、水分和微量未知化合物组成的持续性雾霾的限制。建议在该层级活动时穿上防护服，并佩戴现有的最佳性能的呼吸设备。
//
//探险队已穿越森林，并推断出其直径约1400 km (~850英里)。除此之外，外围还有绵延起伏的山丘和平原，总体面积仍未得到测量。严重的粉尘沉积和强风使得探索行动风险极高。冒险进入这些地区的流浪者要么因暴露在毒性环境下死亡，要么在找到明显地标或是地势起伏前就离开了该层级。由于未知原因，在Level 888所发现的人类遗骸上，没有任何一个人表现出悲尸化的症状。
//
//实体
//- 蜱蚤
//sipohonap.jpg
//营养不良的幼年期蜱蚤。
//
//体表半透明的昆虫，解刨发现其与跳蚤相似，通常能长到20 cm (7.8 英寸)长，最大跳跃距离可达约12 m (40 英尺)。它们腿上的倒勾能作为钩子辅助攀附各种表面。已知它们会将自己掩蔽在有厚厚粉尘的地方，并在跃出咬住猎物前埋头等待。由于它们口腔中分泌的麻痹毒素，其咬伤几乎不会产生痛感。
//
//蜱蚤咬伤人类时，只会吸取与其身体大小相称的少量血液，因为此举的主要目的是为了注入麻痹毒素，一旦毒素的浓度足够，受害者的精神状况会受到严重影响。引发的症状包括强烈的空虚感、意识模糊、对自我意义的怀疑，以及去找寻附近的“慰藉”，也就是其他实体的渴望。如果没有注射更多毒素，以上症状会在两小时后消失。蜱蚤喜欢聚集在热源附近，并且会避免对放出热量的生命体造成致命伤。
//
//- 负蚤织工
//A892-DB5-A-37-DD-439-E-BE33-746-BE09-B6-B0-C.jpg
//由一位踪迹制图者成员绘制的草图。
//
//浮肿、苍白的人形生物，身高达4.3 m (14英尺)，面部长有一束卷曲的触须，掩盖了面部特征。由于其退化的后肢，负蚤织工无法直立，并仅具备有限的活动能力。负蚤织工和蜱蚤形成了一种互利共生关系，它们允许蜱蚤在自己的背部钻出浅洞来筑巢，作为回报，蜱蚤有时也会冒险寻找猎物，并在猎物丧失抵抗能力后将其引向织工的巢穴。
//
//一旦受害者进入到合适的攻击范围，负蚤织工就会抓住受害者，将其牢牢地控制在胸前使之无法逃脱。然后，它将触须垂到受害者身上，用它的下颚套住其头部。此举会启动一个缓慢的取食过程，过程中，受害者的大部分记忆都被啮噬，负蚤织工以受害者的记忆，特别是年轻时的记忆维生。人们根据间接证据推测，认为那些关于压力和创伤的记忆对其更富营养。
//
//为了使食物来源尽可能长期存活，负蚤织工会将一根管子插入受害者的喉咙或肚脐，每20小时一次，泵入紫色的浆液。1接近负蚤织工的唯一的相对安全的时间点就是在它吸食受害者的时候，但它会迅速抛下意识丧失的受害者，而后指挥自己背部的蜱蚤去攻击新的猎物。
//
//- 骸布潜行者
//shroudstalker.jpg
//一只打算逃离的骸布潜行者的照片
//
//水蛭状的生物，身体两侧长有多组手臂，沿着整个头部垂直的分界线左右对称。据目击者称，它们体长约3 m (9.8 英尺)。事实证明，由于它们身上闪烁的异常的条状光带，想要拍摄它们的身形非常困难，我们认为这是它们所具有的某种自我防御机制，受到威胁后启动，在其死亡后也会持续一定时间。
//
//尽管它们的地面速度可达10 m/s (36 迈)，但骸布潜行者不喜欢直接接触其他生物。它们实际上像清道夫，选择从游荡的蜱蚤那里偷东西，或者等负蚤织工丢弃其猎物，而猎物这时往往还活着。虽然以上是它们最喜欢的取食途径，但骸布潜行者也曾多次想要袭击熟睡的人类。袭击猎物时，它们会以巨大的力量将猎物束缚，并用附肢做支撑，将猎物拖到偏僻处，然后开始发出阵阵尖啸。这样的叫声能同时震慑其他捕食者和猎物，但这种生物之间没有任何语言可言。
//
//一旦猎物放弃抵抗，骸布潜行者就会对其造成严重伤害，通常是骨折或是用尾巴造成的钝器伤，然后它们会将猎物回复到相对健康和平静的状态。这种造成痛苦，又掩盖伤害的循环，正是骸骨潜行者的进食方式。它们极度痴迷于在外观上掩盖自己所造成的伤害，确保骨头断的干干净净，淤伤完全消失。猎物对疼痛的反应变得过于迟钝时，骸骨潜行者就会将之弃若敝屣。
//
//- 阿米卡犬
//Pickle
//由不知名流浪者上传的画作。
//
//粗壮的双足哺乳动物，有许多畸形的性状。它们外观上类似无毛的犬科动物，但没有肋骨以下的部位，也没有下颌。它们是森林中其他实体除人类外的主要食物来源。阿米卡犬主要以其他生物的副产物和实体维生，通过一种效率极其低下的消化系统和一个小膀胱吸收营养，然后将剩余的东西反刍。在如此生理构造和数不清的身体缺陷下，它们的正常生命周期很少超出10到20天这一区间。
//
//当阿米卡犬接触到一个体型相对较大的生命体时，它会即刻对其产生不可分割的依恋，它的余生都将为这一绑定的伙伴服务，无论它是人类还是实体。这种忠诚是完全不可动摇的，哪怕是故意伤害也无妨。如果期间有任何其他生物试图攻击它的伙伴，虽然没什么用，但阿米卡犬会试图上前保护。还有人发现，它们能够在受到提示时进行“嬉戏”这一行为。
//
//当阿米卡犬不可避免地走向死亡时，无论它的死亡是外部因素还是自然衰老，它的伙伴都会陷入到长达数周的悲痛中。在实体身上这种表现相对迟钝，相比之下，人类会产生近乎歇斯底里的抑郁情绪，并连续数日拒绝基本的饮食摄入。在极端情况下，这能导致脱水和饥饿而死。那些和阿米卡犬亲近的人类更可能受到这种影响，哪怕他们离开Level 888也无法避免。想避开阿米卡犬十分容易，因为它们的移动速度非常慢，无法追上以中等速度慢跑的人类。
//
//- 天外存在
//唯一能在森林外部观测到的实体。很少有流浪者与之接触，而且所有关于其外观的描述都大相径庭。传闻中，其外表特征不一致处如下：
//
//祂的肢体、躯干、眼睛、嘴巴等器官的数目从无到几十万不等。
//祂的体型被描述为“比摩天大楼小一圈的”，“一座泰山”，“无限延伸到天上”，“和我一样大”，以及“没有大小可言，祂实际上就在你眼里”。
//祂的皮肤是“覆鳞的”，“像水，但比虚空还要深邃”，“光滑如丝绸”，“我觉得很正常”，“就像诺亚方舟一样，都是浑然一体的”。
//祂的行为是“眩目的刚烈”，“比母亲更温柔”，“在某个我所看不到的维度上”，“和我一致”，以及“毋庸置疑的欢喜”。
//唯一的普遍共同点是，没人使用过贬义词。实际上，目击者拒绝对其进行任何哪怕是轻微的负面评价。任何试图与该实体交流或长时间直视祂的人都在心理上发生了永久性变化，表现出以下人格特征。
//
//强烈的共情能力。
//高于平均水平的社交能力和外向的行为。
//乐于信任他们所遇到的任何人。
//强迫性地拥抱他们所见到的任何人。2
//根据最新目击报告，天外存在可能是Level 888中其他生物群落的祖先。在获得确切证据前，这一结论与其他相互矛盾的信息一样应视为猜测。
//
//基地、前哨和社区
//该层级没有已知的基地、前哨或是社区。
//
//入口和出口
//入口
//有几率在以下层级中受到情绪烦扰时切入Level 888：3
//
//Level -4
//Level 14
//Level 39
//Level 47
//Level 65
//Level 129
//Level 135
//Level 240
//Level 494
//Level 797
//极巨化植物区系
//深红森林
//被遗忘的森林
//出口
//目前仅证实了两种退出Level 888的方法：
//
//击杀一只将你作为猎物的负蚤织工或骸布潜行者，可使你切入Level 63。并非百分百成功，但如果在其死后五小时内吃掉它的身体，就能大大提升这种几率。
//与天外存在接触会最终使你被传送到其他地方。目前，对于这种极其罕见的情况，记录在案的终点有Level 11和Level 974。
//
//
//
//合上访谈记录 888-1
//采访者： Simon Evansfield博士
//受访者： Ava Alis
//
//<记录开始>
//
//Evansfield： 在开始之前，感谢你同意接受这次采访。
//
//Alis： 没必要，还有，很高兴见到你，我是Ava。
//
//Evansfield： [轻笑。] 我叫Simon。我感觉你很有礼貌，你一直都是这样彬彬有礼吗？
//
//Alis： 看情况吧。我现在比之前更有修养了，但说实话，我遇到祂之后，也没有感觉自己有多大改变……
//
//Evansfield： 你是指“天外存在”，对吗？
//
//Alis： 这是你对祂的称谓吗？
//
//Evansfield： 我的看法是，在获得具体细节之前，这是一个待定称谓。照我们这个进展的话，这个名字还要继续用下去。
//
//Alis： [咯咯笑。]
//
//Evansfield： 我希望你能明白，很少有人能从你之前所处的情形中幸存，更不要说以你这样的方式回来了。我们从你身上收集到的任何信息都会对后来者影响深远。
//
//Alis： 这也是我在这里的原因。至少我是这么想的。
//
//Evansfield： 非常好。那么，你能记起有关这个实体的任何细节吗？任何特别之处？
//
//Alis： 祂只是，在创造。
//
//Evansfield： 然后呢？
//
//Alis： 当我们遭遇祂时，祂正在创造，好像创造着一切！祂把自己的身体撕下，然后把它揉成大胖子；祂把胖子的腿扯下来，拿那些捏成了小狗。祂的血管，或者说是动脉？我不太懂解刨学，血管化为了蛇……嗯，祂的血变成了那些小爬虫。一切尘埃落定后，祂把自己的骨粉撒向空中，就像我们扬起灰烬一样。
//
//Evansfield： 那……
//
//[沉默。]
//
//Evansfield： 你认为祂为什么要这么做？
//
//Alis： 有意思的是，我真的问过祂的目的。祂告诉我说，总有一天，这些可能会演变，但那是注定的路。那时祂……祂似乎不太高兴。我感觉我不应该再继续问下去了。
//
//Evansfield： 还发生了什么事吗？
//
//Alis： 没了。我没时间继续站着了。Lynn当时的情况很糟糕。我问祂我们能不能离开，祂说祂会带我们前往出口。故事在这里就结束了。
//
//Evansfield： 我明白了。虽然我知道这可能很难说出口，Ava，但从那时起……你的精神状态还……
//
//Alis： 你需要一个拥抱吗，Simon？
//
//Evansfield： 我——Ava，我不觉得这有——
//
//Alis： [椅子刮擦声]
//
//两人： [沙沙声]
//
//Evansfield： [清嗓子。] 谢谢你，Ava。
//
//Alis： 没关系！
//
//Evansfield： 你知道吗，我有个和你一样大的女儿，曾经有。
//
//Alis： 我感受到了。
//
//Evansfield： 好吧，我想……我想就到此为止了。
//
//<记录结束>
//
//合上采访记录 888-2
//采访者： Simon Evansfield博士
//受访者： Lynn Odagrau
//
//<记录开始>
//
//Evansfield： 请，请就座吧。感谢你愿意同我们合作。
//
//Odagrau： 别谢我，我本来不想来的，是Ava说服了我。
//
//Evansfield： 那我要好好谢谢她了。请问你的名字？
//
//Odagrau： Lynn。你不是知道我叫啥吗？
//
//Evansfield： 那请问你和Ava的关系是……？
//
//Odagrau： 不好意思，我不是来说事件本身的吗？
//
//Evansfield： 是的，但这只是为了记录，一种形式吧。如果冒犯了你的话，我很抱歉。
//
//Odagrau： [叹息。] 她就像我的小妹。从我们认识以来就是这样。
//
//Evansfield： 在后室，是吗？
//
//Odagrau： 你说呢？
//
//Evansfield： 嗯……所以你们是同行的吗，那时……
//
//Odagrau： 对，我们——对的。不知道为什么，但我觉得那都是我的错，我们最后走进了那个地狱。幸运的是我们身上带着面罩。我把大部分防护都让给了Ava。当那些操蛋的虫子冲过来的时候也保护了她。我记得她在叫我的名字，然后的事……很难描述。
//
//Evansfield： 不着急。
//
//Odagrau： 我好像回家了。我看到我妈，就像大白天一样看的清清楚楚。我闻到她做的饭，感受她的手，听到后门上风铃的摇动。而到这时，一切又变得混沌，有一处空白，那里只有……朦胧。直到我有时间去思考时，我才恍然大悟。
//
//Evansfield： 所以那是？
//
//Odagrau： 我失去了和我的父亲的记忆。
//
//Evansfield： 我很……遗憾听到这个。
//
//Odagrau： 是的，任何人的反应都是如此，毕竟我被夺走了重要的东西。但我却无法感同身受，好像自己陷入了某种迷茫。往好的方面想，我在它偷走其他记忆前被救了出来。
//
//Evansfield： 那是个导火索小队是吗？“Liam”队？我们已经拿到了他们的报告。
//
//Odagrau： 肯定是，但我想的比那些大兵哥和那些行动报告想的更周全，而他们所做的只是把那怪物激怒了而已，所以我们撤退，去和其他人汇合。幸亏他们已经找到了Ava。我们得到了医疗救助和呼吸装备，那时候我的肺简直要烧起来了，但起码没有继续恶化。我俩一直和他们待在一起，直到某天我们醒来，发现他们凭空……消失了。
//
//Evansfield： 我们与他们的通信记录并没发现什么明显迹象。他们被归档为已阵亡。
//
//Odagrau： 操。行吧。之后我俩试图悄悄前进。在那里，我俩打不过任何怪物。我猜可能是运气原因，我们抵达了森林边缘，然后我俩决定不走回头路了。
//
//Evansfield： 你们在平原地区走了多远？
//
//Odagrau： 我不知道。我想应该不是很远。那时我很虚弱，神志不清。肚子上的绷带一直在渗水，那是我唯一能感觉到的温度了。然后Ava停下了脚步，而我也意识到祂就在我们面前。
//
//Evansfield： 仅为了解，你没有注意到祂吗？
//
//Odagrau： 我做不到，那……对我来说太难了。真的。
//
//Evansfield： 所以只有Ava受到了影响。
//
//Odagrau： 别这么说。永远都别这么说。
//
//Evansfield： 抱歉，这不是我想……那一定很危险吧。她是个聪明的女孩，但如果你对祂所构成的危险一无所知的话，其他实体会造成更大的危害。
//
//Odagrau： 不。
//
//Evansfield： 你说什么？
//
//Odagrau： 你说错了。虽然有点困难，但她很清楚要避开实体，况且我们已经到了Level 11。不管怎么说，你真的没必要担心这儿的实体。不不不，说到底，不是它们。
//
//Evansfield： 你还好吗？
//
//Odagrau： 是人，人心险恶。
//
//[沉默。]
//
//Odagrau： 我真……我真失败。我甚至没能……
//
//Evansfield： 没关系的。我要终止记录了，就到此为止吧。4
//
//<记录结束>
//
//
//
//
//著作信息
//« Level 887 | Level 888 | Level 889 »
//
//Footnotes
//1. 插入肚脐眼的管子会刺穿肠壁，造成的损伤较小。
//2. 以上人格特征中也不包括对人类或是实体的区分。
//3. 这样的切入不仅针对个人，也能够影响群体，即使群体中仅有一人符合切入的标准。
//4. 在这些采访结束并提交相关文件的不久后，Evansfield博士以疲劳为由请假，离开了岗位。
package lvls8x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl888{}