//Level 831
// 
//
//生存难度：
// 
// 
// 
//level831.jpg
//Level 831已损坏的实验室
//
//Level 831是后室的第832层。该层级类似于一个严重受损的生物研究实验室。
//
//描述:
//Level 831的可探索区域包括一个十字形的走廊，其中三条走廊已经被成堆的碎石堵住，以及一个大型实验室区域，该区域可以通过一个已经被摧毁的双开门进入。从该实验室的废墟中可以看出，这里曾经经历过严重的火灾和爆炸，大部分的机器和设施已经损坏，几乎无法被修复。
//
//实验室内可识别的物品包括：
//一幅已经被火烧毁的人类基因组的海报，但还能看清一部分内容。海报上显示了27条染色体，而不是我们熟知的23条。
//
//一本被火烧损毁很严重的书，封面上唯一清晰的字是"Pr[ac]tica[l G]enetic Enhanceme[nt.]"1
//
//5个排成一排的储罐，约成年人大小，上面挂着电缆。储罐的玻璃都已被震碎，但其中一个储罐的玻璃似乎是因为内部发生了爆炸而碎裂。
//
//各种各样的化学容器，但没有用于识别的标签。它们并不安全，应存放于开放空间，在存储在单独的储藏柜中，以避免发生危险。
//
//两台计算机终端，损坏严重，无法启动。经过抢救回收，显示其制造日期为2064-2068地球年。
//
//一个装甲存储容器，标着无羁探险者联盟的标志，它的锁已经损坏，用蛮力打开之后。容器内有以下物品：
//
//一台能够登录至操作系统提示符的计算机终端，已送至Beta基地进行修复和信息恢复。
//一张手写的便条，可以在本页末尾阅读。
//实验室里发现了两组可辨认的人类遗骸。两人都有M.E.G.身份证，但已经被火烧毁。在完成初次探索后，遗体被交给Angels of Death团队处理.
//
//经过研究，这些碎石堆因为密度太大，无法徒手搬动或摧毁，曾经测试过使用火盐炸药进行初步清除碎石堆，但这导致了墙壁和天花板的开裂，因此清除碎石堆的工作已被无限期暂停。
//
//基地，前哨和社区:
//在Level 831的可探索区域内没有发现任何基地，前哨和社区
//
//入口和出口:
//入口
//在Level 817的公路旁可以找到一个由混凝土制成的地堡入口。入口处是一扇钢制大门，钢制门由于损坏过于严重，其上锁系统已经失效。
//Level 103有一扇标有“实验室入口”的门，其门把手已被拆掉。
//一些非M.E.G.的探险家声称可以通过Level 141进入Level 831，但这未经证实。
//出口
//唯一已知的离开Level 831的方法是通过一扇标着出口标志的门，在实验室对面的瓦砾堆附近，连接着个人使用入口
//回收材料:
//从回收终端内恢复的错误消息。
//
//隐藏恢复数据
//基因融合 版本11.6 日志错误:无效日期
//
//警告：电源子系统出错：日期溢出，无法进行维护。请尽早联系技术人员。
//继续? [是/否] 是
//
//2号储罐 108号输液 启动中…
//
//警告：3号注射器中有不明物质。建议使用得到基因公司授权的产品。
//警告：未检测到镇静剂。患者可能会感到严重的不适或疼痛。
//继续? [是/否] 是
//
//输液进度: 86%
//警告：电源子系统温度处于90%的安全操作极限。建议关闭系统。
//继续? [是/否] 是
//
//输液进度: 92%
//警告：电源子系统温度为安全运行极限的96%。强烈建议关闭系统。
//继续? [是/否] 是
//
//输液进度: 98%
//!!严重警告!!:电源子系统温度已到达安全操作极限下的101%！继续进行输液可能会对系统造成不可逆转的破坏！
//继续? [是/否] 是
//
//输液进度: 99%
//!!严重警告!!:电源子系统温度已到达安全运行的110%+++++++++++
//错误：连接丢失
//请联系管理员
//
//这是在箱子内找到的那封信。
//
//隐藏信件
//亲爱的 Meggies,
//相比于你所担心的叛徒问题，你更加关心如何找到新的层级进行写作，所以我给了你这个层级作为礼物——我甚至为了你把锁给拆掉了！
//我还依然记得当我告诉你已经死去的Bartholomew Johnson是一个叛徒加折磨狂时, 你那不相信我的眼神。但没关系，我会等待你的道歉，特别是当你找到他留在终端的日志时。
//
//P.S. 别妨碍我猎杀你的叛徒和他们的UEC朋友。他们是我的。
//
//- V.V.
//
//Author(s)
//« Level 830 | Level 831 | Level 832 »
//
//Footnotes
//1. 译注：实用性基因增强
package lvls8x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl831{}