//Level 817
//一封致M.E.G.的公开信.
//
//希望你们不要介意我自作主张给这个网页加点料。说实话，它糟糕透了，就跟0层级的墙纸一样枯燥乏味。好吧，就当它是你们派“丧家之犬”来找我的回报吧。再见！
//
//- Frederick Kaiser
//
// 
//
//生存难度：
//
//一起摇滚！
//
//安全
//稳定
//实体数目少
//Level 817 是后室的第818层，是一座沙漠中的大型路边露天垃圾场。本层于1998年5月14日由Frederick Kaiser（外号“锈蚀朋克”）初次发现。
//
//描述
//本层级大部分地区为一有许多巨型沙丘的大沙漠，几乎没有植被覆盖。不过在沙漠中也有些值得注意的区域，例如：
//
//atI3hJvC6Go1iEA.jpg
//一张描绘露天垃圾场的图片
//
//垃圾场
//Level 817的入口，同时也是最具代表性的地区。其中堆放着大量垃圾，例如汽车部件、家用电器、电脑部件、老式游戏机等，其中有些物品此前并未出现。在垃圾场中发现新东西很正常。理论上它们可能来自别的层级，在某些情况下，也可能来自前厅。
//露天垃圾场是M.E.G.前哨部队“丧家之犬”的驻扎地，同时也是一位有德国血统的男人，Frederick “锈蚀朋克” Kaiser的居住地。他常常寻找他觉得有趣的零部件，把它们焊在一起，有时能做出相当壮观的成品。他有一头又硬又直的棕色长发，常戴着写有“Rock You”的红色头巾，穿着红黑相间的背心和白色牛仔裤，扎着腰带。因为Frederick对此层级的布局和物品的了解他人无法相比，和他保持友好关系是M.E.G.在此层行动时所要优先考虑的事之一。
//
//在该地区发现的物品包括：
//
//几个电子部件，其中一些并非人类科技制造
//许多车辆零件，绝大部分没有实用价值。
//碎掉的特斯拉线圈、发电机、太阳能板和风力涡轮机
//如山如海的、已经损坏无法使用的家用电器。
//形状型号各异的子弹壳
//燃料罐
//坏掉的电动工具
//满地都是的跨性别骄傲旗帜
//6257c833239250f7c5bcdc16.jpg
//一张Frederick Kaiser的装有喷气发动机的冰箱的设计草稿
//
//除此之外，以下条目建自Frederick Kaiser
//
//一个没做完的战斗用机器人，他说他不打算接着做了
//一个以咖啡做喷墨的打印机，每当它被启动时都会播放《At Doom's Gate》
//一把可伸缩电锯
//一个阁楼式游戏厅，根据Frederick的信息，《罪恶装备XXAC 加强版R》游戏次数最多，也是他最喜欢的一款游戏
//一个手套式电钻
//一把《雷神之锤》中火箭筒的复制品，不带弹药
//一个有各式各样工具的工具箱，其中有些是Frederick Kaiser自己做的
//一个转速可达10000RPM的滚筒洗衣机
//一个喷气式冰箱，做这玩意单纯就是想看看会发生什么
//一个手持式轨道炮模型
//半途而废的一架直升飞机
//许多风力发电机和太阳能电板，为露天垃圾场的机器提供动力
//几个Object 42的实物
//一把使用生物燃料的，会冒出火焰的剑。名为“焰燃之封”
//垃圾场仅占Level 817的一小部分，除此之外还有一条长度未知的柏油路，盐碱地，还有一座岩石山。
//
//高速公路
//一段被破坏的高速路，没有护栏也没有路标，到处都是裂缝。走到任意一边的末端都会去往Level 9。“尘暴”有维修该公路的计划。
//
//盐碱地
//一片巨大的盐碱荒漠。“尘暴”常常驾驶生物燃料汽车穿过此地。“肢团”也在这里，其在该层级几乎没有威胁。它们常被发现潜行于盐碱地中捕食同心虫。
//
//龙骷峰
//龙骷峰是“尘暴”给他们在Level817的山中的基地取的名字。内含一套巨大的洞穴生态系统，包括地下农场，地下河，火盐矿和一些实体，绝大多数为同心虫。这里有一个通往Level 797的出口。洞穴系统的大部分尚未探明。
//
//基地、前哨与社区
//M.E.G.前哨部队-“丧家之犬”
//有六个成员，非常乐意帮助他人，做交易和回答问题
//他们常常在露天垃圾场修东西
//目的是找到并修好对M.E.G.有用的东西，并将Frederick的新发明登记在册
//“尘暴”
//是在Level 817的岩山中居住的一个团体，一共有21个人
//他们自己种植所需的食物，并且非常乐意用它们换取有价值的东西。
//他们常被发现在造车或修车，抑或穿越盐碱地。
//他们和Frederick "锈蚀朋克" Kaiser保持着非常良好的关系，后者提供给他们许多零部件和物品，以换取食物和水。
//入口与出口
//入口
//Level 1的一个集装箱里有时装着碎金属块，从该集装箱中切出可到达Level817
//进入Level 797大坝边上的山洞可到达露天垃圾场
//出口
//从该层级的任意金属墙切出可能会到达Level 1
//走到高速公路的任意末端可到达Level 9
//探索龙骷峰的洞穴可能会到达Level 797，极为少见的情况下会到达Level 75
//
//新增文件:
//以下是M.E.G.特工Axel Lowe寄给Frederick "Rust Punk" Kaiser的信
//
//吃了吗，Kaiser！我们没见面有段时间了吧？抱歉我不能经常过来，你知道的，M.E.G.的领导总给我们派活。你怎么样？尘暴那些人没打扰你吧？我听说M.E.G.派了一队人过去，叫“丧家犬”什么的。对他们温和些，好吗？你的那些东西呢？那个喷气冰箱还在不？我真特么的希望它还在，造那玩意太有意思了。兄弟，我很想念垃圾场，我一定尽快过去。快点给我回信，你这个混蛋，好好照顾自己。
// 
//摇滚起来，锈蚀朋克！
//Axl Low.
//
package lvls8x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl817{}