//Level 853
// 
//
//生存难度：
//等级 4
//
// 
// 
// 
//“后室中英勇的探索者们可能会发现，自己闯入了一片熟悉的循环回廊，强烈的清洁剂气味扑鼻而来。Level 853看似与那些类似的层级一样无害，但一旦流浪者试图喘息片刻，该层级便会瞬间陷入黑暗，只留下绝望的探索之人妄图从成群结队的实体手中逃出生天。”
//
//描述
//Level853.jpg
//[一张Level 853的照片，背面写有“Atlas”一词。]
//
//深陷于腐烂的绿色地毯与褪色的黄色墙面之间，Level 853似乎由无数曲折的廊道相接而成，随处可见死路与岔道。M.E.G.推测该层级内部存在某种循环，导致其规模远远超过了实际尺寸。倘若这个后室层级存在于现实，应当只有约25平方米大小。据报告，地毯上随机分布着洗涤液坑，导致该层级内充斥着一股浓郁的化学试剂气味，某些区域还带有少许霉味。该层级内没有窗户，但却永远有狂风呼啸的声音响彻；此外，地板之下有时也会传出嘎吱声。该层级内的门打开后一片漆黑，只能看到门后数英尺的景象。强烈不建议流浪者在该层级中随意开门，因为门后很可能栖息着满怀敌意的笑魇。
//
//在本层级中寻路几乎是不可能的，因为其中的空间均为随机排布，哪怕你只是移开视线，原本的结构也会发生变化。此外，倘若流浪者试图在墙壁上画线、或是在地上撒下某种粉末来标记道路，他们便会听到远处传来剐蹭的声音。而在他们回到先前的空间之时，留下的一切标记都将化为乌有。该层级内存在着许多逃生标志，然而大部分情况下它们都不会指向真正的出口；这些标志往往会指向死路。据报告，某些水坑中弥漫出的化学气味能够使人感到晕眩，进而失去方向感，导致遭遇实体的可能性进一步增加。身在该层级的流浪者即使未受到攻击，也会感到有人正在注视自己，仿佛有什么东西在通过门上的锁眼窥视。
//
//基地、前哨与社区
//该层级内没有已知的基地、前哨或社区。
//
//Level 853的灯光
//建议流浪者在进入该层级之前准备好充足的食物与杏仁水。该层级中没有任何补给，亦不会提供便利的条件；尝试打开门只会发现更多实体。当该层级中的人类行动的时候，尤其是剧烈奔跑时，灯光才会闪烁着亮起。这也就意味着，如果不想让灯光熄灭，就必须加快行动的速度。当该层级陷入黑暗时，将变得伸手不见五指，只能看到逃生标志散发出绿莹莹的灯光，却微弱得连地面也无法照亮。同时，笑魇将在黑暗中打开房门，将疲惫的流浪者团团包围。在黑暗之中，钝人也会从墙壁与房门之间切出。灯光一经熄灭便需要至多20秒来恢复照明，而在此期间实体们能够自由地行动，故建议所有进入该层级的流浪者第一时间寻找出口。该层级的出口是一扇门，其上嵌有一块雕刻着“351”字样的壁板。打开那扇门并进入即可抵达Level 854。
//
//笑魇会从没有“351”字样壁板的门后出现。
//钝人与猎犬往往在走廊中游荡，通常成群结队，且不受到灯光影响。
//在黑暗中，流浪者很有可能感到走投无路、不知所措。再次强调，请所有进入该层级的流浪者第一时间找到“351”门，迅速进入下一个层级。
//
//入口与出口
//入口
//攻击一只微光向导，在其逃跑时跟随并穿过一个带有走廊的层级，便会进入本层级。
//从电梯的底部切出，会使你掉入该层级。
//出口
//进入标有“351”的门会将你即刻送入Level 854。
//在该层级内的走廊中跟随一个微光向导，即可进入Level 0。
package lvls8x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl853{}