//Level 811
// 
//
//生存难度：
//等级 1
//
//部分稳定
//轻度环境危险
//无敌对实体tower
//Level 811众多建筑中的一个。失落一族声称他们建造了这些石制建筑，但否认在它们旁边建造了金属建筑。
//
//描述
//Level 811，也被称为“泰坦墓”或“泰坦的临终之床”，是M.E.G最近发现的层级，但该层的书面记录可以追溯到公元前3189年。此层级是一片广阔的草原，遍布着各种各样的小山、树木、河流、湖泊、花圃、火山和山脉。此层级的大气成分似乎与地球相同，检测到的温度为15-19ºC。这里的昼夜更替和磁场与地球相同，但还没有理论能解释此层级为什么会存在磁场。目前尚未记录到动物的活动，也没有检测到该层级的地理、气候或植被出现异常。
//
//Level 811中存在几处被毁坏的建筑，从看起来较为简陋的石制建筑到形态扭曲的金属都有。当前理论猜测这些建筑可能是由非人实体建造的。在不久的将来，考古学研究应该能够证实或证伪这一猜测。
//
//然而，最值得注意的是该层级中与层级同名的的特征结构遗迹。无数类似盔甲和武器的巨型金属结构遍布整个层级，所有这些结构都被奇怪的、类似电路的线条穿过，且每隔一段时间就会发出微弱的光。这些遗迹星罗棋布的分布在大草原上，被雕刻在山上。有的遗迹深埋于地底，有的以未知方式悬浮在空中。下面详细记录了其中的一些遗迹，因为它们是此层级主要的地标。这些结构自失落一族的时代起，就能帮流浪者确定自己的方位，并存在于他们的地图之中。目前正在对这些地图进行研究，以便准确报告其他未被发现的结构。
//
//王者之剑
//第一个被记录在案的遗迹是王者之剑。就像它的名字一样，是一把位于地面上雕刻而成的剑。它是该层级的入口、主要地标之一和重要的确定方位的地点。因为其所的处地方十分平坦，所以它也可以当作日晷。从剑的外观来看，其被严重损坏，剑上有裂纹、大块破损和生锈。由于该剑的大部分都在地下，因此不可能准确确定剑的长度。
//
//泽胡蒂
//泽胡蒂是一个巨大的头盔状结构的名字，它位于王者之剑东偏北约3公里处的一座小山上。头盔周围是各种较小的金属零件，比如碎片、较大的钢板、电线和管子。但它们与泽胡蒂之间的联系尚未确定。据推测，更多的零件隐藏在地表之下。
//
//泽胡蒂的名字来源于埃及智慧和文字之神透特，他经常被描绘成朱鹭的头部，因为其头部看起来很像朱鹭。和王者之剑一样，它年久失修，布满裂缝、锈迹和苔藓。
//
//安喀勒神盾
//安喀勒神盾是一座小山上雕刻的圆形盾牌的名字，安喀勒神盾位于王者之剑东偏南约7公里处。与其他的大多数遗迹一样，安喀勒神盾处于严重失修的状态，有大块丢失、大量裂缝和明显的被腐蚀的迹象。
//
//安喀勒神盾名字来源于保存在马尔斯神庙内的神盾，而马尔斯神殿是使罗马帝国主权得以延续的物品之一。
//
//伊卡洛斯
//伊卡洛斯位于王者之剑以西12公里的一块花田中，是一个与从地面伸向天空的护腕相连的臂甲1其名字根据其所处的位置并参考希腊神话中的伊卡洛斯所命。据估计，它的长度在9-12米之间。现计划在这座遗迹周围进行挖掘作业，以确定伊卡洛斯是否不仅仅只是是一件臂甲。除此之外，人们发现伊卡洛的手掌上长着鲜花。
//
//阿特拉斯
//阿特拉斯，与伊卡洛斯一样，它是一个与位于王者之剑以东17公里处的山丘上的与护腕相连的臂甲。它在设计上与伊卡洛斯有许多相似之处，尽管它看起来比伊卡洛斯损坏得更严重，一些镀层上有烧伤痕迹，还有明显的腐蚀迹象。尽管遭受了这些破坏，阿特拉斯仍在支撑一块巨大的巨石，且其重量据估计达15吨。这些特点为阿特拉斯赢得了它的名字，因为阿特拉斯是希腊神话中的巨人，且他被判永远支撑天空。
//
//冈尼尔
//冈尼尔是一支20米长的巨型长矛，位于王者之剑以北约25公里的一条河流环绕的大陨石坑上。它几乎每一处都被装饰过，且似乎带有某种徽章，这些徽章悬挂在柱子末端。目前尚不清楚长矛是如何在原地漂浮的。虽然冈尼尔的确切起源尚不清楚，但其形状和周围的河流表明，这是一个撞击形成而不是自然侵蚀形成的火山口。冈尼尔以传说中的奥丁矛命名，奥丁是挪威诸神埃塞尔家族的主要神。
//
//埃癸斯神盾
//迄今为止发现的最大的人造物品“埃癸斯神盾”似乎是一个巨大的机械盔甲的躯干部分，它严重受损，被卡在山上，没有四肢和头部。它位于王者之剑西偏北30公里处。它似乎层被击碎并刺穿过几次，并露出了盔甲下方的金属框架。埃癸斯神盾似乎还包含通风井，其胸部区域似乎有一些房间，而这些也是进一步探索的目标。埃癸斯神盾的大部分被藤蔓和苔藓覆盖。埃癸斯神盾这个名字来源于希腊神话中的一个传说中的神器，据说其是宙斯的胸甲。
//
//附加内容
//经进一步调查，人们在埃癸斯神盾内部发现了一个类似驾驶舱的小区域。 M.E.G.的特工以及新视野团队的成员，费斯·西尔弗松，通过一个小舱口进入了埃癸斯神盾，舱口在进入后立即关闭。舱口被密封后，可以听到几秒钟的机器发出呼呼声。费斯声称，机舱的内部发生了变化，她坐在驾驶舱内，四肢被金属管所包裹，并在这个过程中在头上被带上头盔状的面罩。她还声称自己的后颈有刺痛感。呼呼声停止后，面罩的内部屏幕为费斯显示出一个终端。经过大量详尽的工作，M.E.G.已成功提取该终端的摘录序列，以便在本页上显示。
//
//
//ZEHUTI-T802.10
//0000 05.10.2187
//BOOTUP
//INITIALIZING
//ALMIRIA
//
//
//
//
//
//
//
//
//
//
//
//
//特工费斯·西尔弗松晕倒了，不得不从安喀勒神盾内部转移出来。因为入口舱口已被密封，所以需要进行复杂的救援行动来凿开一个足够大的洞，以便安全地将弗松从驾驶舱中运出。弗雷德里克·凯泽为M.E.G.提供了一个圆形电锯和瓶中闪电，这些工具在这次救援中被证明是必不可少的。在这个过程中，M.E.G.在装甲板下方发现了大量的肌肉组织、骨基质和巨神经。六个小时后，费斯被从安喀勒神盾内移走，的仍处于昏迷状态，其颈部背部有一个非常小的刺伤。她被带到阿尔法基地，在那里她得到了充分的治疗。12小时后她醒来了，但感到头痛、嗜睡和头晕，这些症状通常与使用镇静剂有关。进行血液测试后，人们发现了一种不明物质的微弱痕迹。穿刺伤口不会导致并发症或长期伤害，费斯在完全康复后已重返工作岗位。
//
//入口与出口
//入口
//据失落一族所言，Level 2中的一些管道偶尔会发出类似电路的闪光，随着光线微弱地脉动，就像遍布于Level 811中的许多遗迹上的闪光。沿着这些管道将通向一扇锁着的门，门上刻着一把仪式用的机械匕首。匕首无法从门上取下，但是，拉动匕首而非门把手将打开门，这将通向Level 811。
//此外，据说Level 797的众多洞穴中有一个能通向Level 811。
//
//出口
//在Level 811的山洞中居住时，流浪者可能会发现生锈的人形金属雕塑指向着前方。跟随他们将带你去到Level 817的龙骷峰。
//据说位于伊卡洛斯附近的一些坑洞通向Level 170，但这一点尚待确认。
//
//还有报告称，有人潜入了冈尼尔周围的河流中，后在Level 466的湖泊中浮出水面。
//
//作者（们）
//« Level 810 | Level 811 | Level 812 »
//
//Footnotes
//1. 臂甲（法语：avant-bras，中世纪有时被称为lower cannons）或称作前臂护甲，是管状或沟槽式护甲，臂甲作为一套板甲的一部分，通常与护腕相连。
package lvls8x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl811{}