//Level 899
// 
//
//生存难度：
// 
// 
// 
//前几天有人把这本宣传册给了我，上面写的东西与一个目前还未探明的层级相关。我的信息来源告诉我说一些其他的组织已经知晓了这个层级的存在。我过几天会派一队人去这个层级，但我们现在所掌握的所有关于此层级的信息都来自这本小册子。
//
//—监督者 Stretch
//
//何必冒命丧于凶兽之口的风险？
//何须惧身死于无人之境的孤凄？
//何不度余生于平和与宁静之处？
//
//邈远之终恭迎列位到来！
//
//历史
//
//邈远之终1最初由一群怀揣着改变世界的志向的青年梦想家们所建立。自邈远之终被创立以来，她一直都是任何有需要之人的避风港。从最初的唯一一位居民开始，我们已接纳了几十位从外界而来以寻求庇护的成员。
//
//环境条件
//
//邈远之终建立在一座风景宜人的浮空岛上，可以俯瞰秀丽的景色。色彩起舞于无尽虚空，点亮整个天际。由于全天候自然光源的存在，这里并不需要电力设施，且所需的水资源可从附近的一个泉水湖取得。我希望你喜欢蘑菇——邈远之终内生长的多种多样的蘑菇可以让你吃一辈子都吃不完。不要担心单一的菜谱会让你感到厌倦，我们天才的厨师长一定会保证菜品花样百出。
//
//成员
//
//不要害怕，我们不会攻击其他人！对于邈远之终的大家来说，尖牙仅仅起装饰作用，额外长出的眼睛和肢体也只是为了尽快完成更多的工作。邈远之终的每一位工人都具备老练的经验，所以你大可以放心，在这里你将被很好地对待。
//
//位置
//
//有时你可能很难发现邈远之终，但是只要给我们最近的邮箱地址发送一封邮件（我们会放一只携带这本宣传册的信鸽来让这一过程对你来说变得更加简单），我们就会派一位代表去接你来此地。
//
//M.E.G. 日志 2021/02/23：
//2021/02/23
//
//我是詹姆逊，我们请求邈远之终的代表在我们发信后的一周内抵达我们所在的位置，约定日期正是今天。我真的觉得发信的过程本身值得一提：宣传册里提到了“信鸽”，但我觉得这个描述有些不够准确。一只折纸鸟2被叠在信封之中，信封上写着一些关于如何投信等等的简短说明。在把信系在鸟的脚踝上后，我们按照说明拉了一下纸质小鸟垂下的双翼。它立刻就从墙上飞了出去，这把麦克吓了一大跳——像是见了鬼一样3，我觉得。但麦克说那只折纸鸟看起来很怪——啊，不好意思，跑题了——我和麦克正要去执行任务，我猜Stretch并不会派其他人协助我们。他可能还在对上次他送了一整支小队探索未知地区时发生的意外感到内疚。
//
//2021/02/23
//
//邈远之终的代表来了。代表们在小册子里被编写者简要描述过，且我曾经和半影4共事，因此对于她的外表我并未感到不适。她看起来像是我在前厅时看到的老照片中房檐上的石像鬼滴水嘴一样。我真好奇她那对翅膀能不能正常使用，尽管我从来没见她用过。不管怎样，对她外表的描写已经够多了。她操着一口流利的英语，带一点我不知道具体是哪里的口音。她的真名是卡尔。尽管对于一个生物而言卡尔这个名字很可爱，但她实际上好像很冷漠。麦克对她仍然有戒备之心，但我相信他会改变他的观点的。当我写下这段文字的时候，卡尔正带我们前往Level 11的几个出口。我以前从未想过，但是如果他们能做到把人从几乎任何地方送到邈远之终，那么他们一定知道自己周围进出各个层级的路径。或者我可以拜托她帮我绘制地图，我敢打赌Stretch一定会喜欢的。
//
//2021/02/25
//
//卡尔选的这条路比我预期的要长一点。尽管如此，我丝毫没有感到疲劳。我猜是因为她给我们做的汤。卡尔很会做饭。不管这汤究竟是什么，它对麦克确实产生了一些影响。在麦克吃了一些东西后，他和卡尔逐渐攀谈起来，现在他们之间的关系看起来已经很友好了。我一直在记录我们经过的出入口，等我们回来后，我会发给你的，Stretch。我们干这行已经有了几十年了，但我们甚至还没有触及到后室所显露的事物表面，这真是……不可思议。
//
//2021/02/27
//
//邈远之终太美了。你无法用语言来准确描述它有多美。这里的居民在宣传册里提到了这一点，但邈远之终附近天空的光实在是太出人意料了。我完全能理解为什么流浪者们会选择在这里度过余生。这真的摄人心魄。总之，麦克和我决定在这里待几天，然后就回家。即使我们没有收集到全部的出入口信息，这也是一次难以忘怀的经历。说实话，我并不介意在这里多待上几个星期，但邈远之终的成员们说得很清楚——如果我们想待几天以上，我们就得签署一个终身协议，而我并没做好充分的思想准备。也许等我退休了我会再来这儿吧。
//
//2021/02/28
//
//嗯……麦克最终决定留下来，但我不能责怪他。脱离开后室的诸多危险而享受平和的生活实在太诱人了，但我还有任务在身。不过我想麦克在这儿会很愉快的，他和卡尔相处得很好。我问过卡尔她能否派一位代表帮助我们测绘一些层级的地图，但她回绝了。我能理解她，我猜主管这么少的人去完成邈远之终的日常事务所需的工作量大概实在太巨大了。很难想象这些成员从邈远之终建立开始就一直保持这样的工作强度。不管怎么样吧，总之卡尔几个小时后就会带我回去了。
//
//2021/03/05
//
//我才反应过来，我还没问过卡尔她的翅膀是否能用。
//
//M.E.G. 日志 2026/06/14：
//2026/06/14
//
//已经五年多了，我还是经常回想起邈远之终——噢，现在它的官方名称是“Level 899”了。我可能会尽早过去那边，但如果没有“信鸽”，我就没办法跟卡尔取得联系。不过我经常回忆起她。上次从邈远之终返回后，我意识到我有太多事还没来得及问她……也许现在我有机会了。几天前，我的床上又放了一本小册子，信封里装着一只“信鸽”。我很激动。这两天我一直在斟酌这件事，我仍然觉得我还没准备好在那里度过余生，但我的确也很想去看看麦克和卡尔。
//
//2026/06/15
//
//卡尔在这里。我就知道，她一定会来接我。事实上，卡尔说正是她本人给我递送的信封。我猜她或许是也想念我了。能和卡尔聊天总归是让人高兴的，尽管在过去的5年里我们之间的关系和我们两人都似乎并没有发生什么变化。我同样很高兴马上能再次见到麦克。
//
//2026/06/15
//
//我的理性好像无法解释这一切，它彻底失效了。天空太美了……我可以盯着变幻莫测的云影和光芒连续看上好几个小时。不过，我想我是时候去看看麦克了。不知为何，我居然有点儿紧张。
//
//2026/06/15
//
//有什么事情不对劲……有什么事情很不对劲。我今天见到麦克了，但他不再和以前一样……他看起来很苍老，他的变化比经过5年时间人类应该有的正常变化要大得多。从一个每天用钢笔填字谜的男人到一个忘记旧友姓名的可悲的人，他身上发生了巨大的改变。但，至少他自己看起来很开心，尽管这并不符合逻辑。我要在这好好休息一晚，然后明早再去找卡尔弄明白这些年究竟发生了什么。
//
//2026/06/16
//
//我向卡尔抛出了我的疑惑，她看起来有些局促，甚至不知所措。她尝试用麦克在这里很快乐这一事实来说服我，至于具体发生了什么并不重要——但我并不接受。选择驻留在这里的人显然要支付时间来作为换取快乐所必要的代价，于是我问她为什么带我来这儿。她回答说，她认为我至少需要知道真相。她直到最后也不允许我带走麦克，于是我立即离开了邈远之终。我也许会迷失方向，但我猜卡尔一定在我的大衣口袋里悄悄放了张说明……啊，是的。这张纸的背面是她的道歉，但我还没准备原谅她……也许永远。
//
//2026/06/17
//
//……她或许是对的。至少……麦克很开心，不是吗？
//
//一封信件，2034/10/21：
//你为了快乐愿意支付什么代价？我已经写下我的答案。
//
//再见啦，Stretch。我们和M.E.G.共同度过了很长一段值得回忆的时间，同时我们也为M.E.G.做出了许多堪称卓越的贡献。但现在我到了退休的年纪，所以我想我是时候离开了。我没有和你详细说明我去向的必要，但我确信，我这次不会再回来了。
//
//——詹姆逊
//
//作者信息
//« Level 898 | Level 899 | Level 900 »
//
//脚注
//1. 译注：原文中由于特殊格式的需要一直都以"Yonder's End"来代称level 899，故译者沿用这一表达方式。
//2. 译注： 这东西并不是千纸鹤。原文中修饰这种鸟的定语是“origami”，即日本折纸艺术，而千纸鹤的英文是“close-to-you”。且根据下文的脚踝来判断，这种纸质鸟应该有接近于正常鸟类的结构，故译者选用了这个相对更笼统的名称来指代该鸟。
//3. 译注：原文为"how he's seen riddle telling sheep with human faces" 。译者起初猜测为英文习语，但并未在任何地方检索到这一表达形式的相关信息，故在直译明显不合理的情况下选择了理解性翻译。若读者有更好的解释还请不吝赐教。
//4. 译注：原文为"Penumbras"。译者不知道这是什么。译者没查到任何资料。在翻遍实体列表而一无所获之后译者又发现主站的内置搜索引擎坏了，且之前英文站的管理团队发电删了一大批文档，其中就包括Penumbras的超链接。所以等译者过段时间再完善，姑且先保留直译。
//5. 即邈远之终。在这里用英文名是想强调英文站CTB的那一份文档。
package lvls8x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl899{}