//Level 800
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//Level 800 是后室的第801层。它是一个迷宫般的大型仓库，装饰着各种钟表发条零件。‎
//
//描述：
//Level 800是一个看似无限的仓库，里面装有许多与发条相关的结构和物品。此层级的每个空间内都有浑浊的昏黄的光。每个空间的大小和宽度都是不可测量的，在有些空间需要上下楼梯或爬上低垂的链条。‎
//
//Level 800 的房间布置整齐，内有金属滑轮、管子、机械等，这些物件沿墙壁和天花板排列。所有的机器都是如太阳般闪闪发光的明亮的金色。当穿越这个层级时，会听到由许多钟表发出的滴答声。 无论在这个层级中走多远，都可以听到这个声音。每个房间里都有许多显示时间和外表风格各不相同的传统时钟。
//
//所有的时钟在大小和形状上都有所不同，似乎表现出非欧几里德几何体的奇怪形状。Level 800 能够改变时钟的形状来迷惑该层级中的流浪者。下面列举出Level 800最常见的转换:
//
//看似无穷无尽的走廊，走廊的一头会逐渐收缩成一个无法穿越的小洞。从这个洞望过去，可以听到钟楼的钟声从走廊的另一端传来。
//一个巨大的方形房间，有900多个岔路口。
//一个很高的垂直空间，类似于老爷钟的内部，似乎绵延数英里。
//狭窄的走廊，多扇方形窗户围成一圈，将流浪者引回此层级入口。窗户的里面是一个漆黑的空间，
//会在 Level 800 出现的实体有 错音玩偶，猎犬和窗户。
//
//以下文档是发现Level 800的探索日志。发现这个层级的两个流浪者仍然处于失踪状态。
//
//– hide block
//层级： 800
//时间： 9:32 PM
//
//记录开始
//
//流浪者一号和流浪者二号站在 Level 800的门口，似乎在观察其中的环境。
//
//流浪者一号1： 这个地方看起来很陌生。
//
//流浪者二号2： 这里出奇地干净有序，一切都是完美无瑕的金色，看不到任何污垢或灰尘。
//
//一号： 我们可不是来赞美这地方有多干净的。这可能是另一个层级。我们是从哪里进来的来着？
//
//二号： 嗯……我们刚刚在level799，所以这里一定是level800。
//
//一号的叹息声
//
//一号： 好吧。我们最好开始探索吧。
//
//一号和二号开始行走了大约25分钟后，该层级的结构开始发生改变。
//
//二号： 这到底是怎么回事？这个空间很奇怪。
//
//一号： 是啊，所有东西都是木头做的，上面还有个巨大的东西！
//
//二号： 嗯，这看起来不太安全。我们继续走吧，门在那边。
//
//一号： 等一下，如果我们爬上去，上面可能会有东西。也许是出口！
//
//二号： 什……什么？不，这简直可笑！我们在这鬼地方待了两年了，你觉得回到我们自己的世界会这么容易吗？
//
//一号： 看，我们一直在恐怖的房间里奔跑，逃离那些房间里的恶魔和怪物，这一定是我们应得的解放！
//
//二号： 嘿！嘿！给我下来！这是一个陷阱！这地方就是想让你产生一种虚假的安全感！
//
//一号没有回应，仍然爬上了链条。
//
//二号： 伙计？老兄！停下来！快下来，不然就太晚了!
//
//一号依旧没有回应.
//
//二号： 老兄，别把我一个人丢在这！我很害怕！
//
//二号开始啜泣。
//
//二号： 该死的！这地方简直就是地狱！
//
//远处传来低沉的咆哮声。
//
//三只错音玩偶走进房间。
//
//二号：什……什么玩意？！
//
//另外两只错音玩偶从入口进入这个房间。
//
//二号： 不——不！退后！退后！
//
//二号跑到房间的另一端，蜷缩在角落里。
//
//错音玩偶开始走向二号。
//
//一声响亮的钟鸣从房间的顶部响起，链条开始摇摆。
//
//二号： 发生了啥？！
//
//二号开始尖叫，他的肉体开始腐烂，露出了里面的发条零件。
//
//二号： 哦——不！不！我感觉不到我的腿了！
//
//错音玩偶的齿轮开始高速旋转。
//
//钟声变得更大了。黑色的粘稠液体从二号体内喷射出来。二号开始痛苦地尖叫。
//
//二号： 它在燃烧！啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊！！！！！！！！
//
//二号的喉咙和声带开始融化，他的声音扭曲了。
//
//二号的尖叫声变成了咯咯笑和咆哮，他变成了一个错音玩偶。
//
//记录结束
//
//基地、前哨站和社区：
//在这个层级中没有已知的社区或前哨站。
//
//入口：
//Level 800只有两个已知的入口。
//
//爬入Level 1的一个开放式通风管道就可以进入Level 800。
//打破Level 356中的一道墙将带你来到Level 800。
//出口：
//打开并进入Level 800的任何一扇窗户将带你回到Level 0。
//移除任何一个大型时钟并爬入其后面的洞将带你来到Level 808。
//爬上垂直的“落地钟”房间内的吊坠，你会发现一个可以进入终点的木门。
//当移动到层级末尾时，灯光将变得更暗，直到聚光灯显示出一个巨大的垂直落差。可以通过悬挂在液滴上的链条，沿液滴的方向向下攀爬。下落大约有3英里后你会掉到一片由砖铺就的地面上。前面是一个小走廊和一扇上面有“出口”标志的门。这扇门会带你到Level 801。
//作者
//« Level 799 | Level 800 | Level 801 »
//
//Footnotes
//1. 译注：以下简称一号
//2. 译注：以下简称二号
package lvls8x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl800{}