//Level 826
// 
//
//生存难度：
//危险环境
//极度难以生存
//不可靠出口sea-of-bones.jpg
//尸骨之海。
//
//Level 826是一个能在睡眠期间中进入的层级。
//
//描述：
//Level 826是一堆看似无限的骨头，它们形成了一个大致平坦的平面。这些骨头中的大多数似乎是人类的，尽管有一些报道称，他们发现了来自未知实体的头骨和骨头。流浪者在穿越关卡时应该小心，因为骨头经常从地面伸出，它们之间的空间很容易使流浪者被绊倒或扭伤流浪者的脚踝。
//
//Level 826的天空没有被任何形式的星星或云层覆盖，完全是漆黑的。尽管如此，该层级仍然被没有照射原点的无色光芒照亮。这个层级非常炎热和潮湿，以至于一些流浪者因中暑而昏倒或死亡。在此层级中，腐败和降解速度会加快，所以任何流浪者携带的食物都会很快变质，任何在层级中死亡的流浪者在几天内都只是骷髅。在层级中度过一个多星期后，活着的流浪者也会开始受到降解效应的影响，因为衰变的速度超过了细胞再生的速度。
//
//hand-of-god.jpg
//手。
//
//在层级中唯一可以找到的地标是一个巨大的，看似无底的坑，上面有一个巨大的手工雕像，由石头制成。手在手腕处连接到一根向下进入坑中的石柱上。目前尚不清楚坑通向何处，也不知道任何掉进去的人会发生什么。
//
//基地、前哨和社区：
//由于层级的状况和不可靠的进入方式，无法建立社区或前哨。
//
//入口和出口：
//没有已知的方法可以强行进入Level 826。流浪者报告说，他们通过梦境进入层级的机会很少。此时，他们沉睡的身体和他们身上的所有财产都会消失6-8个小时，之后流浪者将回到他们睡觉的地方。然而，他们在Level 826的实际时间比这长得多。一些流浪者形容自己在层级内呆了几天，甚至几周。在层级中度过的时间，他们的身体将存在于层级中，因此在他们返回时，在这段时间里所遭受的任何伤害仍然存在。此外，存储在其身上的该时间段的任何照片，图画或文字作品也将被一齐带回。
//
//
//
//
//
//
//
//随着你不断堕入深渊，一阵刺耳的声音填满了你的耳朵。
//
//
//
//你可以听见它们呼唤着你。
//
//
//
//你忘却的太多了。
//
//
//
//你留下的太多了。
//
//
//
//一个遥远的世界。
//
//
//
//一辈子的旅程。
//
//
//
//只有寥寥几个脱颖而出，比其他的更强大。
//
//
//
//更清晰。
//
//
//
//这些是你永远都不会忘记的。
//
//
//
//永远不要停止哀悼。
//
//
//
//永远不要离开。
//
//
//
//你看见它们的脸恳求你救救它们。
//
//medium.jpg
//这是天堂吗？
//
//
//
//这是地狱吗？
//
//
//
//你会找到答案的，但现在，你只是个访客。
//
//
//
//一种形态从灵魂的海洋中脱颖而出。
//
//
//
//它与其它的不同。
//
//
//
//虽然其它的都只是他们过去自我的碎片，但这个是完整的。
//
//
//
//一个看守人。
//
//medium.jpg
//它就算没有眼睛也依然注视着你，以一种你无法理解的方式移动。
//
//
//
//那个声音挣扎着以挣脱束缚。
//
//
//
//但它们不能回来。
//
//
//
//这是它们的结局。
//
//
//
//但这里没有结局。
//
//
//
//那个人影离你越来越近。
//
//
//
//你可以感受到它渗透进了你的灵魂。
//
//
//
//引导它。
//
//medium.jpg
//
//
//
//你尝试着呼唤那声音，但它们再也无法听见你的回应了。
//
//
//
//你很快就会和它们在一起。
//
//
//
//你醒了。
//
package lvls8x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl826{}