//Level C-717
//评分: 
//+6
//+
//–
//X
// 
//
//生存难度：
//等级 4
//
// 
// 
// 
//- 收起
//Level C-717 为后室C层群的第717层，该层级于1998年3月22日首次被发现。
//
//M.E.G.随后派出4批成员共计19人进入该层级探索并尝试建立哨站，在2001年9月17日，一名成员亚伯拉罕·戴维斯成功返回位于Level 1的基地并从 Level C-717 带回一本流浪者日记。
//
//亚伯拉罕表示日记是在探索过程中发现的，经研究人员查阅，该日记中记录有作者"M"的生存记录，其中包含有大量关于该层级的有效信息。而亚伯拉罕也声明自己是依靠这本日记记录的内容才得以在 Level C-717 存活下来。
//
//研究人员将这本日记中的讯息摘录下来并归档为初代资料。自初代资料在流浪者中流传开来，终于有流浪者能够从 Level C-717 中生还。2001年12月25日，M.E.G.再次派出一些成员对该层级进行探查， 有关该层级的资料正随着更多的流浪者报告而不断地更新与完善。
//
//外注：
//初代资料的作者"M"的字迹十分潦草，日记部分内容被撕毁遗失；而"M"的绘画技术比他的文笔还要糟糕。因此我们并不打算完全放出初代资料的原本内容。“M”的一些金句将被分享出来1，但不必过于好奇他的故事，或许我们自己就会成为下一个传奇。
//
//描述：
//
//环境
//
//- 收起
//该层级拥有类似Level 0的单调泛黄壁纸与荧光灯，但与之不同的是，该层级是更为庞大复杂的迷宫，不受非线性法则约束而且被认为没有尽头。这里没有嗡鸣作响的噪音，通常情况下也闻不到任何气味。在 Level C-717 ，地面是草地而非地毯。绝大多数区域的草地已经能够没过脚踝；而在少数区域内，草地生长的高度甚至能够超过120厘米。
//
//first.jpg
//初代资料中 Level C-717的简笔画
//
//该层级生长有多种菌类，在现实中含有毒性的菌类与无毒菌类的营养性在该层级完全颠倒，请分辨并食用那些颜色鲜艳的菌类。该层级还被发现生长有其他五种植物：蓝莓、覆盆子、蔓越莓、柠檬树、香蕉树。它们会在层级内任何地区生长，果实无害，均可作为食物来源。
//
//在 Level C-717 中发现有杏仁水池塘与杏仁水排水渠可作为水源补给来源，杏仁水池塘仅分布于开放的空旷房间内，此类区域不会存在第二个出入口，杏仁水池塘附近必定生长有果树或者浆果。杏仁水排水渠可以在狭窄通道的两侧墙根处找到。
//
//腐烂的空树桩在该层级中并不多见，这是 Level C-717 中唯一的工具补给来源。在树桩内部能够找到填充物2，有利于流浪者求生的物品3，在极少数情况下可能还会找到武器工具4。
//
//Thepool.jpg
//初代资料中绘制的杏仁水池塘
//
//- 收起
//防御机制
//
//- 收起
//Level C-717 的天花板安置有灭火装置。一旦检测到烟雾，附近的灭火器喷头就会被触发并迅速喷洒出一种会腐蚀肉体的酸性溶液稀释烟雾或熄灭火焰，该溶液的具体成分未知。任何在 Level C-717 进行生火的尝试均以失败告终；穿着防水衣物或者打雨伞可以在短时间内隔绝该液体对身体的伤害。尝试破坏灭火装置的行为会使喷头破损，并迅速泄露出大量腐蚀性酸液。据不完全统计，目前已知有74人因破坏灭火装置而导致死亡。推测这一装置为该层级的某种防御机制。
//
//与其他人类共处50小时左右便会被该层级强制分离，这种现象只会在人类身上发生；其原理未知，推测是层级的另一项防御机制。表现形式为附近的灭火装置释放水雾，身处其中的人类都会感到一股强烈的抽离感并迅速昏厥，随后被传送至本层级其他陌生区域中。
//
//与他人主动建立联系的尝式在多数情况下以失败告终，遗体与遗物或其他流浪者仅能在探索层级的过程中被随机地发现。
//
//- 收起
//层级其他现象
//
//- 收起
//在该层级中没有任何通讯信号以及网络信号，而且绝大多数机械设备在这里无法被使用。（包括摄影装置，这使得流浪者无法在该层级进行拍摄或录像）该层级存在一套独立的时间法则，表与沙漏可以在 Level C-717 正常使用。在 Level C-717 中，每30小时为一“天”，每15小时进行一次昼夜交替。层级在"昼"时，温度将保持在32℃左右，该层级荧光灯悉数开启，在“昼”时遇到敌对实体的概率较低。层级在"夜"时，荧光灯尽数关闭，温度会骤降至10℃左右，敌对实体与大型野兽通常会选择在这个时间段外出觅食，并在翌日“昼”前躲藏起来。在下一次"昼"前该层级不会出现温度回升的情况，也不会出现任何自然光亮。
//
//Level C-717 内部存在“刷新”现象，层级内部的植被，排水渠，树桩，遗弃的物品甚至人为标记都会因刷新而突然消失，出现，或变换位置；层级的磁场也会因刷新而发生变化，因此指南针与定位器无法在层级内正常工作5；该层级被破坏的区域以及被酸性溶液污染的区域会在刷新后恢复正常；已发现该层级的地形，位于开阔房间内的一切，实体及其巢穴所处的位置（如果它们筑巢的话）均不会受到刷新现象的影响。气味在该层级不会很快消散，且不会受到刷新的影响，也许可以作为标记使用，但也可能会引来附近的实体。该层级刷新行为并无周期规律，但每次刷新间隔一定在20小时以上。
//
//- 收起
//实体：
//
//- 收起
//Level C-717 是多种实体的栖息地，在该层级中不同种类的实体可能会同时出现，它们之间也存在竞争与相互捕食的关系。除此之外，层级中也栖息着许多现实中的野生动物，这些生物的来源未知，它们依旧遵循着在现实生活中的习性，而且更好地适应了在 Level C-717 中的生活。甚至有流浪者目击到了棕熊与窃皮者的搏斗，猎犬捕食盘羊，鬣狗群与聚合体争夺尸体等场面。少数流浪者的报告中提及到在该层级遇到了无面灵游商，他们的穿着打扮像中世纪的波斯人，背着一个几乎等同于身高的登山背包。可以用果实或动物的毛皮与之交易食品，香料和工具。
//研究人员根据初代资料及目击者报告对层级中的实体进行了如下总结：
//
//目前确认存在的实体：无面灵，猎犬，聚合体，窃皮者，扼杀者，双尾狐，悲尸
//已确认不存在的实体：派对客，笑魇，死亡飞蛾，肢团，骨盗
//新发现的实体：巡猎者（于初代资料中得知命名），趽驼（于初代资料中得知命名）
//发现了许多种类的疑似从现实切出至该层级的野生动物（鹿，羚羊，兔子，蛇，野猪，狼，虎，熊，豪猪等），但尚未发现任何鱼类，鸟类以及两栖类生物存在。
//- 收起
//原生实体
//
//- 收起
//实体C-717-1是所有从该层级逃出的流浪者公认的威胁极大的原生实体。甚至有人说，相比于该实体带来的威胁，层级的其他实体与现象造成的危害简直无足轻重。初代资料中对巡猎者的第一次记录显示，该实体徒手与一头成年犀牛对峙并在几分钟内杀死了犀牛。
//
//有相当一部分流浪者在遭遇了该实体后出现了不可逆的精神损伤。他们终日紧绷神经，喃喃自语，始终认为巡猎者此时正带着一大群猎犬在他们附近徘徊。亚伯拉罕本人也表示，相比于真正的巡猎者，初代资料中那幅潦草的简笔画傻气地如同一个玩笑。
//
//根据初代资料中的信息以及数十名流浪者提供的情报，M.E.G.的相关情报人员对该实体的信息多次梳理并进行了如下总结：
//
//描述：
//头颅覆盖着厚实的外骨骼，看起来像牛的头骨；身体高大壮硕，有毛皮覆盖；双臂形似猩猩，能灵活地抓握物品；还有像鸵鸟一样的双腿。具有一定的智慧，会搭建营地和简单的陷阱，能够熟练使用任何狩猎用具（包括但不限于弓箭，长矛，刀具，枪械），必要时也会进行肉搏。
//
//Hunter.jpg
//初代资料中的巡猎者图画
//亚伯拉罕对这幅画给予犀利的评价："这就好比将狮子画成了猫。"
//
//实体特性：
//懂得合作，似乎会使用某种语言与其他同类交流，但社交对于该实体来说似乎并不是必要的，因此多数情况下只能发现独来独往的巡猎者而很少发现巡猎者聚落。
//
//流浪者可能在任何时间段与该实体遭遇，实体身旁可能有一至数条猎犬相随，推测两种实体之间存在合作共生关系。
//
//巡猎者会狩猎被它或猎犬察觉到的一切潜在猎物，狩猎手段包括但不限于埋伏，突袭，包抄，引诱，投毒，设陷阱。
//
//该实体的狩猎周期是8-10天，在狩猎结束后会在水源附近扎营休息1-2天。随后实体会继续在层级中游荡，寻找新的猎物。
//
//杏仁水会迅速治愈巡猎者的伤势，所以在狩猎时该实体一定会携带杏仁水。
//
//注意事项：
//实体会使用多种气味吸引猎物或是为同行的同伴引路，在探索时要多加注意。
//
//该实体的方向感非常强，几乎不会迷路，但似乎也可以用气味干扰其认知从而摆脱独自狩猎的巡猎者。
//
//小心巡猎者身边的猎犬，它们比一般的猎犬聪明而且更加敏锐。如果找到了一处资源丰富的区域一定要多加留意，这里很可能已经被巡猎者布下了陷阱。
//
//只有与巡猎者体型相当的实体才有可能与之一搏，所以不要尝试与其发生正面冲突，即使你持有武器。来自其他实体的袭击可能会被巡猎者成功招架，灭火装置的酸液会对该实体造成一定伤害但不足以致命。可以尝试使用枪械类火器或大型瓶装闪电在极短的时间内重创巡猎者，这是目前人类能够杀死该实体的唯一手段。
//
//- 收起
//-收起
//和狡猾的巡猎者相比，相对友好的趽驼则是流浪者们更愿意在该层级遇到的实体。
//
//趽驼的脂肪可以和杏仁水混合作为燃料安全使用，厚实的毛皮可以做成简易的帐篷，而趽驼本身如果被驯服也可以成为一个不错的伙伴。许多流浪者也都表示趽驼在他们的探索生存中提供了不少帮助。
//
//研究人员仅根据初代资料就整理出了较为完整的趽驼资料：
//
//描述：
//身体似牛，有结实的皮毛，腿似马。有一条灵活如鞭子般的尾巴用以保持平衡和防卫，背上长有两个驼峰
//
//实体特性：
//草食性群居生物，没有固定的巢穴，会根据层级的刷新寻找食物与水源，能够发出类似老虎低吼的声音驱赶附近其他的草食生物。落单时或群体中有幼崽时遭遇冲突会先尝试逃跑。
//
//注意事项：
//如果遇到成群的趽驼不要尝试靠近，成年趽驼难以捕捉且会发动攻击保护族群，趽驼族群会接纳落单的同类，包括老弱病残的个体。
//
//趽驼听觉敏锐，建议使用弓箭或陷阱猎杀。其毛皮可用于制作睡袋或帐篷，筋骨可以用于制作长矛、弓箭等狩猎用具，所以该实体常常会成为巡猎者的目标。其肉含有毒素，少量食用后会产生呕吐，昏厥的症状，大量食用会直接导致脱水死亡，不过猎犬与扼杀者这两种实体却可以正常猎食趽驼。趽驼的驼峰内含有驼脂，为淡红色膏状，微黏稠，无味。驼脂暴露在空气中再接触杏仁水就会缓慢挥发并迅速散发热量，最高可达120℃，可用做燃料，且不会产生烟雾。
//
//趽驼对酸味非常敏感，可以尝试用柠檬的气味吸引该实体，并用菌类尝试驯服落单的个体。三只及以上数量的趽驼聚集后会回归野性，尽量不要让驯服的趽驼遇到其他同类。该实体被驯服后可帮助携带物资或代步。
//
//-收起
//基地，前哨与社区：
//
//因该层级的不稳定性以及无限延伸的特性，目前尚未在该层级设立任何固定基地，前哨与社区
//
//入口与出口：
//
//入口：
//
//在任何具有大面积植被的地区（不包括草原，耕地，人工绿化）切出即有概率直接切出至该层级
//出口：
//
//在该层级有极低的概率遇到三种门
//
//通过绘有卡通形象的门，会直接来到 Level 94
//通过紧急消防逃生门，会直接来到Level 2
//打开木制防盗门后会发现一条植被繁茂，荆棘丛生的狭窄通道，径直穿过后可能会到达 Level 32 或 Level 345
//不必浪费多余的体力去尝试切出。这里是一个十分罕见的只能被切入而无法切出的层级。
//
//作者信息
//脚注
//1. 因为M.E.G.情报部门认为这些话具有一定的警示与激励性
//2. 骨骼，毛皮，内脏
//3. 兽皮水袋，折叠伞，紫外线手电筒，荧光棒等日用品与工具
//4. 小型刀具，弓箭，瓶装闪电甚至老式猎枪
//5. 如果方向感好而且不想走太远可以尝试绘制地图
package lvls17x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1717{}