//Level C-798
//评分: 
//+18
//+
//–
//X
// 
//
//生存难度：
// 宜居
// 
// 
//Level C-798是后室C层群的第798层。
//
//描述
//Level C-798是一座被群丘环绕的城镇。城镇与一战前后西欧郊镇的建筑风格类似。以此为基础，点缀有少量风格类似古希腊或古罗马设计的建筑或景观。然而事实上，在层级内仍然发现了一些接近现代的电器如吊扇，日光灯等。城镇的建筑布局相对并不太整齐，这或许因为其外低中高的地形导致。地面道路统一被浅灰色石砖铺满，经常可见道路两旁种植着花草，路灯整齐地排列在道路两旁。在镇中央是一座类似行政中心的机构，而其余部分皆为居民区，拥有公园，集市等设施。数条小溪在镇中间流淌，而游船亦常见于其中。
//
//城镇被纵横交错的火车铁轨穿插，这些轨道都被以古典的建筑风格修成离地面较高的天桥，然而事实上在前厅，一战前后的建筑技术和建材并不可能支持修筑起如层级内这种结构的桥。这些铁轨看起来通向城镇四周的山丘里，延伸向未知的远方。偶尔会观测到一些较大型的火车驶进镇里，它们看起来以蒸汽驱动，会停在镇里的火车站中。流浪者亦可在火车站买票以坐车离开Level C-798。
//
//整体来讲，层级的建筑风格带有一定奇幻色彩，因为其中带有不同风格的建筑，一些设计甚至并不曾存在于前厅。在镇中的许多地方可以见到一些破损，也有少数破坏严重的建筑。在这些地方可以隐约闻到火药味。但镇民们正在不断地修复它们。
//
//据层级内的文献记载，层级内拥有宜人的，类似于温带海洋季风区的气候和与前厅基本相同的昼夜/季节更替。层级全年以晴天为主，降水月分布均匀。层级在夜晚经常会出现与Level C-799高度相似的星空，且同样会对看着它的人产生心理镇静的作用。
//
//基地、前哨与社区、居民
//鉴于层级被正式确认的时间，目前层级内暂无外来人员建立的前哨站或社区。
//
//非常奇怪的是，Level C-798的居民以人类为主，但又和其它非人实体混杂。包括笑魇、猎犬等实体，和人类（包括后室原住民、无面灵、异人和前厅的人类）共同居住在Level C-798，但所有实体都失去了它们的敌对性，并表现出了比通常更高的智能，它们一起生活，互帮互助，形成了一个有机的整体。其对外来者也很友善。这并不是所谓第11效应能够解释的现象。这被猜想与镇中心的行政机构有关系，但那里未知原因地无法进入，且镇民们拒绝谈论有关话题。
//
//镇民们不愿或很少谈论有关它们自己和层级的历史，但我们仍然可以了解到本层级曾发生过类似战争的事件，且似乎就发生在数年前，这也与镇中被破坏的部分相吻合。镇民对此事抱有比较积极的态度，比起沉沦于过去，他们更愿意看向未来。作为历史见证的是镇东的一座墓园，里面的墓碑大多属于因战争逝去的镇民。
//
//随着本层级被确认，一部分流浪者在支持下进入其中。在传回来的报告中，大多都在描述他们在层级内的生活较为慢节奏，且舒适惬意。综上所述，本层级被判定为是完全宜居的。
//
//采访
//以下是对Level C-798内居民的访谈记录。
//记录 1 号
//<记录开始>
//
//
//你好。这里是我的家。
//我是从外面偶然进入的流浪者，在这里住的时间不长，但是我很喜欢这里。老实说，当我第一次进入这里时，我被这里的居民给吓到了，那些笑魇什么的，毕竟是曾经威胁到我的生命的家伙。但是随后我发现他们并未伤害我，反而是表现得很友好。之后嘛……我大概也接受了这个不同种族共存的城镇吧，就这样定居在了这里。
//
//不过有一说一啊，当我定居下来后才发现，这里的生活实在是很棒。是真的能慢下来享受生活的地方，和我曾在前厅时过着的繁忙奔波的生活完全不一样。用苏轼那句词来说的话，就是在那片青空与流云之间，「听君飞去饱时来，看头上风吹一缕」的惬意啊。我在这里也认识了许多的人们，也有过了难忘的回忆，挺不错的不是吗？
//
//嗯，你说关于战争的事？抱歉，关于这个我也不太清楚，那就这样吧，谢谢你。
//
//为什么谢你吗？这个就不重要了。
//
//<记录结束>
//
//
//记录 2 号
//<记录开始>
//
//
//是一个采访吗？嗯，可以的，没问题。
//你问为什么……可是我们本来就没有伤害你们的理由。其他地方？那和我们又没关系。你们那些常识对我们可不适用，在这里没人管你是什么，你看到过有谁会伤害，嘲笑其他种族吗？没有对吧。这里是我们所有人重要的家，仅此便足够了。我们每人都很重视个体，不会简单地凭借肉体来评价一个人，所以不管你是谁都可以成为这里的一份子。
//
//关于那件事吗？嗯……那确实很恐怖，但我们挺过来了，既然如此我们就更应该向前看，毕竟逝去的一切不会再回来了，那么继续走下去才是所有人期望的。
//
//这个话题到此为止吧，还有要问的吗？
//
//<记录结束>
//
//
//人类与实体似乎不可逾越的境界线在此层级内被确实模糊了，M.E.G.认为这是一个可以突破的方向。有关内容的研究正在筹备开始。
//入口与出口
//入口
//在Level C-799，手拿其庭院中种着的无名之花，并按照正常离开方式走上山道离开层级会到达Level C-798。出于各种原因这个出口已被封锁，仅部分人员可以使用。
//出口
//走上通往小镇四周群丘的山道可以回到Level C-799。通过此方式进入Level C-799的流浪者尝试离开它只会再次回到本层级。
//镇西南方的集市里有一间无人的店铺，它双向联通Level 82中的一间同样无人的店铺和本层级。
//在破败的建筑废墟里切出会来到Level 49。
//在火车站买票并进入对应的列车可到达对应的层级。由于尝试离开层级的流浪者很少，目前仅知如下出口：
//
//Level 11
//Level C-990
//而理论上出口会比这更多。在流浪者坐上的列车在驶离小镇后，窗外的景象会突然呈现出类似冲进隧道的画面而后变得一片黑暗，在数十分钟至数天后，类似于冲出隧道一般，车窗外将会突然呈现出他们目的地层级的景色。车内会有食物供应，因此不必担心。
//
//其他
//欢迎
//以下是被隐藏的采访记录。它无意间记录了关键信息。
//
//记录3号
//<记录开始>
//
//
//哦，你好，年轻人。抱歉我刚刚在发呆，所以你有什么事？
//我在看什么吗？也没什么，就是想到了以前的事。以前在这个集市上经常可以看见一个女孩子，她捧着一大把花，把它们卖给路人。那些花确实很漂亮啊，是浅浅的蓝紫色，就像你拿着的这些花一样……怎么了，你怎么这个表情？
//
//那些花的名字吗？我也不知道。话说那个时候好像还有一个稍大点的男孩，是女孩的朋友，两个人经常在一起。女孩子叫什么？我想想……好像叫露娜一样。可惜现在他们两人都不在了，男孩去了远方，而女孩……她已经……
//
//话说，年轻人，你的脸色真的不对劲啊？不舒服吗？啊，没事就好。
//
//<记录结束>
//
//此记录中提到的信息被认为与Level C-799的实体露娜有关。但我们无法得知更多情报。
//
package lvls17x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1798{}