//Level C-797
//评分: 
//+9
//+
//–
//X
// 
//
//生存难度：
//
//等级 E
//
//不安全
//环境敌对
//最低实体数量
//Level C-797是后室C层群的第797层。它最早在Level C-8里被红星建筑队第六支队的一名成员意外发现。
//
//描述
//Level C-797表现为以一块四方空地为中心向四周延伸的非线性建筑群。虽然层级内仅存在很少量的笑魇和窗户，但它仍然是极为难以生存的。
//
//N
//Level C-797 中心的一张照片。如此图所示，建筑之间的空间均会被各种方式挡住。虽然破坏这些阻挡并非不可能，但在建筑间行走本身是相对更危险的。
//
//层级内的建筑高度大体呈现梯度上升，由中心向四周远离高度递增，使得建筑群在宏观整体上应呈现漏斗状。理论上来说层级无限延伸，因为到目前为止仍未发现边界。层级内的建筑通常为中式风格，但不同建筑的外表和内饰都表现了不同的年代感，一些建筑接近于上世纪七八十年代的旧屋，而另一些也可能与前厅现今的建筑无异。建筑内不会存在任何可供生存的食物和饮水，电源不稳定，但仍然存在少量Wi-Fi信号。据报告，层级似乎会随前厅建筑风格的发展而更新自己的建筑风格，但这难以被证实。
//
//像许多层级一样，一些建筑从外部看会表现出违反物理定律的存在形式，如卡在彼此中间等。建筑之间被连接在一起，流浪者能探索的区域仅限于建筑内。环绕层级中心的周围一圈建筑并无异常。而其余建筑均存在大量异常属性。如建材似乎都被某种未知效应所脆化，流浪者脚下的地面可能会突然裂开坍塌。层级内偶有地震发生，这可能会导致建筑崩塌。许多走廊或门将奇怪地通向死路、室外的高空，甚至会让流浪者当面撞上有害的窗户。灯具等电器可能漏电甚至爆炸。室内可能出现栽培着类似于蒲公英的花的盆栽，这些蒲公英会散发出对流浪者有很强吸引作用的香气，但是这种气味同样的也会吸引来笑魇，当流浪者沉迷于花香中而忽视四周环境时，也决定了他们的死亡1。随着探索的深入（即对中心区域的远离）建筑群将愈发混乱和异常。
//
//流浪者在探索中很有可能遇到带着某些特殊符号的门，这些门是半开的，通往其他层级。门后将可能显示如下几个层级的景象：
//
//Level 0
//Level 2
//Level 9
//Level 11
//Level C-36
//Level C-48
//这些出口仅仅是被发现的数量，其真实数目可能更多。而当流浪者尝试接近那些门时，这些建筑看起来就像是对在其中探索的流浪者表现强烈敌意一般，此时前文提到的异常效应将明显加剧，流浪者身处的环境很大可能会发生坍塌。同时他们可能会被一股倾斜的力作用从而倒向一旁，尚不清楚是建筑发生倾斜还是重力变化，但脆化的建材很多时候并不能承受住流浪者的体重。建筑的某些区域也可能会发生平移从而把流浪者送入其他空间。一言以蔽之，层级将会全力阻止流浪者进入出口。同样的，向出口内投掷物体也会被阻止，但与人体直接进入不同的是，投掷物体并不是不可能做到的，通过这种方式我们得以确定出口的有效性，即使没有人能够成功进入它们。
//
//基地、前哨和社区
//受限于Level C-797内部的属性，流浪者在进入层级内后通常只能等待自己的死亡。且层级本身并无任何可供开采的资源。这导致目前在Level C-797内不存在任何已知的基地、前哨和社区。
//
//入口与出口
//入口
//目前已知的两个入口都在Level C-8里被发现。
//
//流浪者在Level C-8里进入任何室内时在门口意外摔跤可能会进入Level C-797，但这种进入概率很小。
//另一种更确切的进入方式是摘掉一朵在Level C-8的农田部分或土路边可能出现的蒲公英。
//任何流浪者都不会被建议进入Level C-797，且Level C-8内的社区会告知其中的流浪者如何避免进入此层级。
//
//出口
//层级本身应没有任何对流浪者可行的出口，如上文所述。
//附件
//流浪者Starset_M曾于层级内探索并研究其异常属性。以下是对他的采访记录：
//
//- 正在加载中，请稍后……
//采访者：Huyyy
//被采访者：Starset_M
//
//<开始记录>
//
//采访者：你好。
//
//Starset_M：嗯。我们直入主题吧。
//
//采访者：OK。这次采访主要是了解你在层级内的体验，以及你的离开方式。
//
//Starset_M：那我就描述一下我怎么离开的吧。
//
//采访者：请。
//
//Starset_M：当时我在层级内一栋楼里探索，我当时已经长途跋涉了有一段时间，身上的食物都要吃完了……哦对了，先问一件事，我之前应该往看起来通往Level 11的门里丢了一张纸团来着。
//
//采访者：我们这边确实发现了它。上面是不是写着一句███████。
//
//Starset_M：对对对，看来出口确实是有用的。虽然你们捡到了那纸团是有很大运气加成。不过有一说一，你应该看到那句话就知道是我才对。
//
//采访者：嗯……我只是觉得有点不可思议。
//
//Starset_M：那我继续。就是我当时突然又看到了一扇门，门后映出Level C-48的景象。我本来也是想去那里的，所以我当时就尝试接近它。但是当我马上就要走到它面前时又开始地震了。带着不甘，我最后见到的画面就是我脚下的地板裂开碎掉的一瞬间。但等我再回过神来时，发现自己正走在一条山道上，夕阳光暖暖地照在我身上。我当时就很疑惑你知道吗？接着我顺着山道爬上去，看到了一块不大的，种着许多浅蓝紫色的花的庭院。庭院中有位表情带有一丝忧郁的少女，金发蓝眼的白色人种，大概十五六岁的样子。
//
//采访者：等会儿……这不会是……
//
//Starset_M：是的，你没猜错。她看见我后便微笑着向我打招呼，之后嘛……就是你我都熟悉的故事了。
//
//<记录结束>
//
//作者信息
//« Level C-796 | Level C-797 | Level C-798 »
//
//Footnotes
//1. 层级内的笑魇仅会在这种情况下出现，其余时间不会被找到
package lvls17x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1797{}