//
//建立帐号 或 登入
//The Backrooms吧
//Backrooms Fandom Wiki
//The Backrooms中文wiki官方哔哩哔哩公众号
//Discord
//主页
//
//中文沙盒站
//
//图书馆
//
//层级
//|
//实体
//|
//物品
//|
//团体
//
//故事
//|
//相关人士
//|
//现象
//|
//设定
//
//搞笑文章
//|
//国际翻译中心
//
//原创图书馆
//
//原创层级
//|
//原创实体
//
//原创物品
//|
//原创故事
//
//原创团体
//|
//原创相关人士
//
//原创设定
//|
//原创搞笑文章
//
//原创艺术作品
//|
//原创现象
//
//网站
//
//最近创建的页面
//
//最近的更新
//|
//最近的编辑
//
//随机层级
//|
//随机原创层级
//
//随机实体
//|
//随机原创实体
//
//旧页面中心
//
//本月最高评分页面
//
//历史最高评分页面
//
//最低评分的页面
//
//社群
//
//讨论区
//
//翻译预定
//|
//最近的帖子
//
//作者页
//|
//中文网站作者页
//
//加入网站
//
//管理专用
//
//后台管理
//
//职员站点
//
//所有页面
//
//会员一览
//
//侧栏
//|
//顶栏
//|
//主题版式
//
//
//
//　
//
//Level C-728
//评分: 
//+39
//+
//–
//X
// 
//
//生存难度：
//等级 2
//
// 
// 
//实体绝迹
//Level C-728是后室C层群的第728层。
//
//描述
//fenchang1
//Level C-728 最早的一张照片。
//
//Level C-728是一座面积约2991平方公里的废弃城市。城市分为几个区域，包括工业区、主城区、郊区等。Level C-728中的城市所有区域均遭到了严重的破坏，绝大多数建筑随时可能倒塌，因此建议流浪者在探索该层级时尽量远离所有的建筑物。在该层级中还散落着大量的废弃的装甲车、坦克、飞机残骸1，还有很多不明用途的重型车辆，结合该层级城市严重损毁的情况，M.E.G.推测该层级可能爆发过大规模的战争。
//
//在这些车辆中遗留的文档大多为英语，同时少量可辨识的仪表盘中的各种参数经辨认也与前厅中的单位一致。据曾在这些车辆中过夜的流浪者报告，有时在部分车辆仍能收到来源不明的通讯信息2，虽然大多数通讯只是毫无意义的杂音，但有少量信息仍可辨认，这些准确的信息大多为准确的军事命令，现将已知的指令汇总并附在下面的文档中。同时据收听过这些通讯信息的流浪者声称，这些通讯信息带给了他们极大的精神压力，尤其是收听到准确指令，流浪者反映准确的指令让他们觉得自己仿佛即将踏入一个残酷的战场，并且无法反抗这种命令，在讯息结束后他们普遍出现了呼吸困难、身体止不住的颤抖、失眠等现象，部分流浪者甚至需要心理辅导才能摆脱这一影响3。
//
//- 收起
//注：该部分所有记录均由流浪者提供，为确保真实性，本文档只收录具有音频或视频录像的记录。
//
//记录一：通讯主题-进攻指令
//收录时间：21/02/2014
//提供人员：流浪者Vicente Kutch
//地点：一辆未知位置、型号的坦克内部
//
//Vicente Kutch正在车辆内部睡觉，忽然传来了微弱的电磁杂音。
//
//杂音：请……请……遭到……（长时间的沉默）……爆……回应。
//
//Vicente Kutch仍然在酣睡，没有对杂音作出任何反馈。然而杂音越来越大，也变得越来越清晰。
//
//愤怒的男声：13号，13号，为什么不回应！
//
//Vicente Kutch惊醒，并且大口喘气。
//
//Vicente Kutch：谁，谁喊我？
//
//愤怒的男声：13号，你居然敢玩忽职守！你立即前进到Q9区域发起进攻…（杂音）…，完成任务之后原地待命！你要是再敢休息，等着吃…（杂音）…，明白了么！
//
//Vicente Kutch：我，我听不懂？
//
//男声变得更加愤怒，甚至可以听到摔杯子的声音。
//
//愤怒的男声：如果你听不懂，就趁早拿把枪把你那没用的…（杂音）…掉，知道了嘛！
//
//Vicente Kutch：…是。
//
//对方中断了通讯，Vicente Kutch仍在不断地颤抖。
//
//
//
//记录二：通讯主题-救援请求
//收录时间：27/01/2015
//提供人员：流浪者Alayna Jacobi
//地点：位于工业区的一辆损毁的重型车辆
//
//Alayna Jacobi正在搜寻车辆内可用的物资。忽然车内的无线电对讲机发出了噪音。
//
//慌乱的男性：救救我们，救救我们！有人能听到么？
//
//Alayna Jacobi有些迟疑，但是还是拿起了对讲机。
//
//Alayna Jacobi：您好，请问你们是？
//
//慌乱的男性：快来救救我们！我们被困在商场大楼里了！这里到处都是火，我们总共有七个人，还有两个孩子，求求你，快来救救我们！
//
//Alayna Jacobi：商场？你是说主城区的商场？
//
//慌乱的男性：是的是的，我们在商场9楼，楼下全部都是火，我们下不去，我们在九楼北侧的窗户附近，我不知道具体是哪个窗户，我只知道是远离厕所的那一边，求求你们快来吧！
//
//Alayna Jacobi：好的，你不要紧张，我联系一下我在那附近的伙伴。
//
//Alayna Jacobi试图将无线电调整到该层级的公用波段。
//
//慌乱的男性：你联系到了么？这里快塌了！
//
//Alayna Jacobi：请不要慌张，我在尝试。
//
//Alayna Jacobi成功连线到公用波段，并请求在商场附近的流浪者留意商场是否起火。
//
//Alayna Jacobi：我们已经联系了最近的人员去查看，请在原地等候。
//
//慌乱的男性：让他快点，让他快点，有个小孩快窒息了！
//
//Alayna Jacobi：我们的人员在尽快赶来，请保持冷静。
//
//接下来的几分钟，Alayna Jacobi一直试图安抚未知男性的情绪，但男性一直报告着周遭情况越来越糟，他开始变得极度紧张。
//
//慌乱的男性：你们真的派人来了么？我完全看不到他们！
//
//Alayna Jacobi：他们已经接近了，他们是从建筑南边绕过来的，所以需要一些时间，请保持冷静。
//
//慌乱的男性：能不能让他们再快点，有个小孩子已经快没呼吸了！
//
//Alayna Jacobi：他们在尽力加快速度。
//
//忽然无线电里传来巨大的声响，以及数人的尖叫声。
//
//慌乱的男性：哦，天哪，别别别，不要！
//
//在更多的巨大声响与男人的哀嚎声传来后，无线电断连。
//
//同伴的联络：我们到商场九楼了，窗户旁边完全被碎石和立柱掩埋了，根本不可能有人，你是不是弄错了？
//
//Alayna Jacobi：…不，难道，这，这不可能…
//
//Alayna Jacobi在此后经常失眠，最终向M.E.G.申请了心理援助。
//
//
//
//记录三：通讯主题-增援指令
//收录时间：24/02/2021
//提供人员：流浪者Doris Jeames
//地点：位于郊区的重型机甲内部
//
//Doris Jeames正在为机甲内部拍照，忽然严重锈蚀的显示屏传来了通讯联络。
//
//镇静的女声：EX-2驾驶员，请立即返回作战区域。
//
//Doris Jeames：这玩意居然还是可用的么？喂喂，能听到我的声音么？作战区域是什么？
//
//镇静的女声：EX-2，你的这种行为会被认为是叛变行为。
//
//Doris Jeames：搞什么，原来是记录么？但是屏幕上好像有文字记录，我看看这个驾驶员说了什么，“不想再继续战争了”，啊，这个显示屏怎么回事，太糊了吧！
//
//Doris Jeame拍打着显示屏边缘，雪花点稍微减少了一点。
//
//镇静的女声：EX-2，区域D7的士兵已经遭受了巨大的损伤，他们需要你。
//
//Doris Jeames：我看看，好像又有新的字浮现了，“并不是他们需要我，而是这场战争需要我。”可恶，剩下的藏在雪花点里面啊。
//
//镇静的女声：经过战斗评估，你今天操纵机甲仅四个小时，你应当还有足够的精力去战斗。
//
//Doris Jeames：才四个小时啊，这样的好东西给我开一天我也不会腻啊，这家伙后面说了什么呢，“从那天已经连续四个月了，我每天机械重复的在各个阵地往返，碾碎敌人，听着他们的…（雪花点）…，的导弹杀了十几个平民，其中还有好几个小孩，但是我居然一点感觉都没有，我杀了太多人，我已经麻木了，我觉得自己已经不是…（雪花点）…，我不敢面对我的家人，曾经他们以我为荣，那天我在难民中看到他们，我甚至不敢和他们打招呼，我不敢说我杀了那么多人…求求你们，放过我吧，我要离开机甲了，这里的血腥味让我恶心。”
//
//Doris Jeames仿若被驾驶员的话语深深触动，开始复述显示屏里的文字。
//
//镇静的女声：EX-2，我们会为你准备心理支持，但现在你要继续战斗，仰赖你我们才能取得胜利。
//
//Doris Jeames：不，我拒绝，这场战争已经失去了原有的意义，我要离开了，请告诉大家我已经阵亡，因为我的心已经死在这场战争里。
//
//Doris Jeames怅然若失的离开了机甲，随后再走了数公里后被其他流浪者撞见后才恢复意识，从那之后便患上了抑郁症。
//
//
//
//在该层级可发现大量报废或被销毁的武器，包括但不限于常规的枪械、手雷以及一些看起来并未使用常规能源的武器4。被销毁的武器占了绝大多数，这些武器被集中在城区中心，大多数武器被机械性破坏而无法使用。
//
//在此层级中流浪者几乎找不到任何补给，也未曾有任何实体的目击报告，但此层级散落的金属资源极其丰富，绝大多数遗留的废弃的武器装备具有极佳的强度，因此在此层级有大量收集废弃金属的流浪者，还有数个进行交易的简易哨站。
//
//主城区
//fenchang2
//Level C-728中核心城区的照片。
//
//主城区部分位于Level C-728的中央地带，占地面积约625平方公里。主城区的建筑物从外观上看大多为居民楼、写字楼等，其中央建筑物最密集的场所还可辨认出数个类似于大型商场的建筑物。主城区的建筑损毁程度大多极高，部分建筑物疑似遭到导弹的攻击，一些受损程度高的建筑物已经彻底垮塌。
//
//在主城区中可发现一些残存的基础设施，包括路灯、天桥、地下车库等，但几乎所有的基础设施全部处于损毁的状态，极少数可用的基础设施也早已被在该层级寻找资源的流浪者带走核心配件。在主城区中央的几座墙体较厚的建筑物仍可安全的进入，这些建筑均为写字楼，但其中的办公设施均遭到了不同程度的破坏，例如较多的弹痕、表面严重的碳化或出现较大的机械性损伤等。
//
//另外，在主城区的建筑内经常听到来源不明的脚步声、人类之间的交谈声或是类似儿童嬉戏玩闹的声音，这样的报告大多为深入建筑的流浪者所提交，但这种声音似乎对流浪者的精神影响因人而异，大部分流浪者表示这种声音只能让他们觉得悲伤，在离开建筑后这种感觉便消失；有少部分流浪者5声称在听到声音后会看到该建筑物未破败时的样子，见到这样景象的流浪者往往会因此连续数天处于一种沮丧、伤感的情绪之中。
//
//边缘区
//fenchang3
//边缘区的一张照片，其中可见大量废弃的民用车辆。
//
//边缘区位于主城区与郊区的交界处，占地面积约189平方公里，其中各种道路交错，是该层级的交通枢纽，很多流浪者团体在此设立了集结点与哨站。
//
//在该区域可见大量的废弃的民用车辆，据推测，在该层级的战争爆发后，大量的平民可能从这里逃离城市。在该区域可获得较多的汽油、柴油、以及各种汽车零配件的补给，同时也有很多帐篷、睡袋补给。
//
//在这里的建筑物可见较多的涂鸦、标语等，大多已经不可辨认，标语大多是关于战争或是指出逃离城市的方向，尚可辨认的涂鸦以及标语已经汇总附在下方。
//
//- 收起
//标语一
//发现地点：休息区入口处的墙上
//
//██(被涂黑)族禁止进入！你们是一切的罪魁祸首！
//
//标语二
//发现地点：主城区的道路附近的瓦房
//
//出城之后右转！别回头！
//
//标语三
//发现地点：加油站入口处的内墙
//
//免费提供一桶汽油，两瓶水，这里很安全。
//
//标语四
//发现地点：集结点处的内墙
//
//停止战争，我们需要和平！
//
//涂鸦一
//发现地点：边缘区北侧废墟的断墙
//涂鸦二
//发现地点：未知
//涂鸦三
//发现地点：南侧居民楼楼道
//
//工业区
//fenchang4
//工业区的入口。
//
//工业区是Level C-728中较为靠北侧的一片工厂及厂房，占地面积约857平方公里。该区域的建筑损毁程度很高，很多厂房已经完全垮塌6，即使未完全垮塌的厂房也是极度危险的，流浪者不应进入这些厂房探索。
//
//该区域内亦有较多的废弃车辆，并且有很多用于运送化工原料的车辆，在这些车辆的车厢内可以找到大量未标记或标记已经模糊不清的化工桶，这些化工桶有些是未开封的化工原料，有些则是废液，不少流浪者来到此地寻找可用的化工原料和厂房中的可用器具。在该区域内的部分地区出现了大规模的化工原料渗漏现象，不仅对工业区的环境造成了巨大的危害，也使得这些地区的空气中含有数种剧毒气体，M.E.G.已经封锁了这些地区并放置了醒目的标识，流浪者不应在缺乏完备的个人防护装置(PPE)的情况下进入这些地区。
//
//郊区
//fenchang5
//在郊区被废弃的机甲，其内部已经被植物侵占。
//
//郊区是该层级中最外围的区域，大多为平坦的平原区域，并且覆盖着多种灌木以及多年生草本植物。该区域面积约为1320平方公里，在区域内只有零星数座人造的建筑，并且大多年久失修，无法居住。
//
//在该区域内废弃着大量的军用车辆、货车、坦克等重型车辆，同时在该区域可见到一种类似人型的巨大机械体，流浪者们通常称这种机械体为“机甲”。这些车辆与“机甲”均已经严重锈蚀，并且其上长满了多种植物，尚不清楚这些植物是如何在金属上生长。据绝大多数流浪者报告，在靠近这些被植物覆盖的机械时，可以感到“安宁、放松，与在城内压抑的感觉完全不同”。
//
//少数“机甲”内部的操作界面仍可输入指令，但缺乏有效的反馈，并且由于大部分机械已经严重生锈，这些机械已经无法再度启动。现将已知的有效输入和反馈汇总在下表。
//
//- 收起
//输入指令	反馈
//战争	拒绝
//和平	接受
//地区	坟场
//启动	拒绝
//敌人	和解
//目的	无
//时间	无意义
//状态	死亡
//基地、前哨与社区
//M.E.G. “废土探险者”团队
//由约45人的团队组成，在该地进行勘探以及资源回收，同时也负责对于对于在此地遭遇危险的流浪者进行救援。他们在主城区和工业区都建造了基地，并且为流浪者提供住宿和心理治疗。
//B.N.T.G. C728号资源提取站
//由31名常驻人员与14名运输人员组成，负责金属资源、化工原料等物资的交易与转运。他们的基地开设在边缘区，并且在该区域开设了较大的交易市场，欢迎任何流浪者前来交易，并且有该层级稀缺的食物与饮用水供应。
//后室机器人科技 研究基地
//由23名研究人员组成，其基地位于郊区，致力于研究郊区的“机甲”的构造，较少与该层级的其他团体来往。
//入口与出口
//入口
//在Level 11找到一个沙盘模型，凝视它一段时间可来到该层级。
//在Level C-727切入一个荒废城市的照片可将你带来该层级。
//在Level 57找到一幅描绘着战争的画作，可将你带来该层级。
//出口
//在郊区行走足够远的距离直至找到一条沥青公路可将你带到Level C-289。
//在边缘区沿着一条未指明通往任何地点的公路前进足够远的距离可将你带到Level C-729。
//作者信息
//« Level C-727 | Level C-728 | Level C-729 »
//
//Footnotes
//1. 绝大多数车辆严重损毁，无法辨认其型号，可辨认的少数几辆装甲车的型号无法与任何已知的型号匹配。
//2. 事实上，该层级中的车辆的无线电通讯系统经调查已经全部损坏，它们在一些时间仍能运转的原因不得而知。
//3. 据治疗过该层级流浪者的心理医生反映，他们的症状与战后创伤应激综合症极为相似。
//4. 部分武器的弹药舱加装的是类似电池的元件，但都因腐蚀严重而无法准确判断其功效。
//5. 据调查，女性或共情能力较强的流浪者更容易看到这种景象。
//6. 调查显示，很多厂房并不是因为直接遭到武器袭击而垮塌，更有可能是炮火引爆了化工原料引起的大爆炸摧毁了这些厂房。
package lvls17x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1728{}