//Level C-700
//评分: 
//+5
//+
//–
//X
// 
//
//生存难度：
// 
// 
// 
//Level C-700是后室C层群的第700层。
//
//描述
//Level C-700的主体由两面长度、厚度以及高度均未知的墙壁构成，构成墙壁的物质据推测为混凝土。
//
//两面墙壁之中间隔10米至200米不等，墙壁间由一些风格各异的桥梁连接，桥梁与墙壁的连接处会出现一扇木门。Level C-700中的木门大部分都无法打开，即使借助斧子等工具也无法破坏木门，甚至连刮痕都不会产生，流浪者无法进入木门内的空间，也不知道木门内到底是什么，但M.E.G.的成员在多次对木门的研究中发现，木门内部会传来一种类似于低吼的声音，多数流浪者会理所当然地认为这是该层级幽闭环境带来的心理错觉，不过根据M.E.G.专项调查组的研究，这种声音是真实存在的。M.E.G.也无法给出声音来源的任何信息，目前仅推测为实体的叫声。
//
//从Level C-700的任意一座桥梁向下方观察，看到的都是一片无尽的黑暗，这一行为会给流浪者一种非常强烈的孤独感，使流浪者感到不安和恐惧。目前已在该层级发现并报告了不下20起流浪者观察虚空时坠落并失踪的事例，M.E.G.不建议以除科学研究之外的理由进行观察虚空的活动。
//
//pexels-photo-3861795.jpeg?cs=srgb&dl=pexels-kelly-3861795.
//Level C-700中的桥
//
//该层级的上空与下方的虚空截然不同，其表现为前厅中的正常天空，有以24小时为周期的昼夜循环，但即使是在白昼时期也只有少量光线可以到达桥梁所在的位置。
//
//曾有流浪者尝试沿墙壁向上攀爬，均以失败告终，以下为一位参与了攀登活动的流浪者的采访记录：
//
//- 返回
//采访记录
//【记录开始】
//
//记者：你好，请问您就是三年前那次在Level C-700的攀登活动的组织者吗？
//
//流浪者：对，是我组织的，同时我也是那次活动中唯一的幸存者。
//
//记者：您能简述一下当时事件的经过吗？
//
//流浪者：可以，我记得当初我们一共去了九个人，除了我之外，还有两个M.E.G.探员。我们从中心大桥的西侧开始攀登，我是第一个上去的，刚碰到墙壁就感到了一丝刺痛，墙上有微弱的电流，我就下去穿上了防护服，这样就不会触电，但会大大降低攀爬的速度。我们向上爬了大概2个小时吧，因为劳累停下休息。我让下面携带物资的队员把食物传上来，但过了很久才有人说那名队员失踪了，我怀疑是他自己的工具坏了，但没有考虑太多就继续往上了。又过了半个小时，下边又有两个人失踪，搞得整个队伍人心惶惶，除了我没人愿意继续上去，于是那些队员就都离开了，剩下我一个人。我没有理会他们，自顾自地继续爬，大概过了几十分钟，我向上一望，发现光亮仍然遥不可及，我放弃了，这根本不可能上得去。当时我又渴又累，没想太多就下去了，回到中心大桥，却连队员的影子都没看到，报告M.E.G.，他们查了两天也没找到人，只好判定他们死亡，草草了事。
//
//记者：那您有没有什么特别的发现呢？
//
//流浪者：没有，什么都没有，只能告诉你们一句话，那那是我在一本前厅的小说中看到的：“方寸之间，深不见底。”我再也不会产生攀登层级这种想法了，太可怕了……
//
//【记录结束】
//
//据记者事后回忆，该流浪者在说完最后一句话后立即要求结束采访，并且将记者赶出了其在Level 11的居所，貌似该流浪者患有严重的精神疾病。
//
//2021年9月12日，M.E.G.的另外一支探险队也开展了攀登墙壁的活动，这才证实了该层级为非线性空间的事实，探险队的调查结果显示，无论向该层级的任何方向移动，最终都会到达原点。
//
//桥梁
//桥梁是Level C-700中一类特殊的存在，也是该层级已知的唯一落脚点，同时是沟通两面巨大墙壁的唯一途径。但据M.E.G.研究发现，大部分桥梁的建造时间都在最近的3个月至2年内，并且桥梁的数量在持续增长中，目前并不知道桥梁的建造者是何人，据此问题流浪者有两种看法：
//
//桥梁由不知名流浪者或者未知实体建造
//桥梁没有建造者，由层级自行产生
//桥梁不一定是平行分布的，有些桥梁与墙壁有一点的倾斜度，所以也有大量桥梁的组合体。
//
//基地、前哨与社区
//M.E.G.“深渊”前哨站
//帮助和保护流浪者
//引导误入该层级的流浪者离开
//勘探层级地形，完善层级的资料档案
//入口与出口
//入口
//在C层群的任意一层找到一扇黑色的合金大门，拉开后会出现一个稳定的与Level C-700双向连接的入口。
//在Level C-386跌入虚空有小概率切入Level C-700
//出口
//打开任何一扇木门可以到达Level 0。
//不要尝试跌落深渊跌落深渊将回到前厅
//
//
//
//
//
//
//
//
//看来你跌入深渊了，不是吗？
//我曾经多次观望桥下的深渊，每当我望着它时，我总感觉深渊也在看着我。
//
//深渊，这个令人敬畏的地方，它的神秘气息对我有着无穷的吸引力，它令我神往，但原因，我也不知道。
//
//谁也不知道深渊里有什么危险，我觉得总要有人打破先例去看看才行，我认为那个人应该是我。
//
//这天，我终于鼓起勇气，从桥上一跃而下，桥逐渐消失在了我的视线里，光明也消失了，周围一片黑暗，没有光。
//
//我在黑暗中蜷缩成一团，严寒从下方袭来，我无法睁开自己的双眼，寒风猛烈地袭击着我，我感到孤独、无助。
//
//光明终于还是降临了，尽管微弱但却带来了一丝温暖，我缓缓睁开了眼睛，一片白色出现在眼前，这是一个纯白的空间，除了白色，什么也没有。老式电视机的白噪音令人发狂，不知过了多久，黑暗再次降临。
//
//我继续向下，不料昏了过去，醒来时，身边只有黄色的地毯和嗡嗡作响的灯。
package lvls17x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1700{}