//Level C-762
//评分: 
//+12
//+
//–
//X
// 
//
//生存难度：
//等级 变化
//
//区域性的变化
//变化的安全性
//实体数量波动
//Level C-762是后室C层群的第762层。该层级共有三个区域，于2022/7/18日被发现。
//
//描述
//区域一 寂静之地
//寂静之地是Level C-762的第一区域，该区域色调极其黯淡，天空中始终被浓厚的乌云覆盖，没有昼夜更替现象。地面由极黑的未知物质构成，它们被白色的线条分割成块状，这使得该区域的地面如同画作一般。
//
//1-A3-D490-F-443-D-48-FB-B721-AAEC9-C2-B943-C.jpg
//区域一的边缘。照片由康瑞特基地提供。
//
//此外，寂静之地的地面虽然无法用任何手段破坏，但击打地面会传微弱的呻吟声，原因不明。目前看来，这里除了地面能够造成视觉混淆之外没有其他危险。在这里，流浪者不会有饥饿和口渴的感觉，此区域也没有任何实体出没。Wi-Fi信号时有时无。
//
//当流浪者向任意一方向行走10km后，就能够看到寂静之地的边界。边界由成群的山峦构成，将整个寂静之地包围了起来。山上虽然同样没有实体，也无其它有生物生存的迹象，但却经常能够发现一些动物的骸骨1。这些黑色的骸骨大多极其锋利，稍不留神便会被其划伤。因此流浪者在翻越山岭时应当注意脚下，成功翻过山岭后便能来到本层的区域二。
//
//附录1
//一段探索录像
//
//2022/7/18/16:56
//
//<记录开始>
//
//（一阵短暂的黑屏，伴随着一些噪音后。画面中显示出了静谧之地的山岭地区）
//
//Elesar：我是Elesar，我现在正处于一座奇怪的山上。我不知道我现在在哪个层级，也不知道这里有没有人，我只希望有人能够看见这个。我得说，这里……十分的不对劲。（画面向四周转了一圈）如你所见，这里安静的可怕，到处都是望不到尽头的黑色。一个人在这里待久了绝对会出现精神上的问题，至少对我来说是这样的。可我却认为这里曾经是片很适宜生物生存的地方。
//首先就是这座山上，根本不可能有生物生存，但这里却有很多很多的骨头埋着，也包括了一些植物的根系。我仔细观察了一下，结果令我大吃一惊。给你们看看这里的骨头（镜头向一截裸露在地表的骸骨拉近），它……怎么说呢，似乎曾经有人拿它往水泥浆里浸泡过一样。表面全都是，额，混凝土？但骨头里面又确确实实是真的骨头。（镜头进一步拉近）混凝土和骨头的连接处很不自然，就像是，嗯…像是混凝土把骨头侵蚀到一半停止了。
//另外我还挖了一个坑（画面转向了Elesar挖的土坑），发现这底下全都是混凝土粉末。我不知道这意味着什么，我也不想再思考了，我现在只想尽快逃出这里。祝我好运吧。
//
//<记录结束>
//
//区域二 混凝土平原
//B688896-A-8-FE2-48-A1-ABDD-1-AF3-D4-F0-E888.jpg
//区域二的地面。照片由康瑞特基地提供。
//
//混凝土平原是本层的区域二。相比区域一，这里要更明亮一些。但温度会变得更低，从前者的23.5℃下降到了5.4℃，时不时有冷雾出现。因此，进入该区域应注意保暖措施。
//
//混凝土平原的地面由特殊性质的混凝土砖构成。这些砖的抗爆性和硬度极高，具有自我修复的能力。但破坏它们却并不会得到混凝土，而是类似凝固的血液和生物组织混合起来的物质。目前尚不知这其中的奥秘。
//
//除此之外，区域二还零星分布着一些外观奇怪的房屋。相比外面，屋内会更加温暖且存在一般强度的Wi-Fi信号。有时也可以找到诸如杏仁水、罐装龙肉、火盐等物品。不过，屋内也有少量的窃皮者和死亡飞蛾出没。因此，探索它们时应当加以小心。
//
//E5-A33-F26-5760-4436-9706-0-BF96-AE928-FB.jpg
//其中一个房屋的内部，照片由Elesar拍摄。
//
//要想离开区域二，就需要继续行进10km。若看到一面全是奇怪雾气组成的屏障，穿过它就能来到区域三。请注意，这面雾气屏障只能单向通过，一旦穿过雾气将无法再次返回上一区域。
//
//附录2
//探索录像
//
//2022/7/19/10:28
//
//<记录开始>
//
//Elesar：没错，还是我，Elesar。说来奇怪，我几乎花了一天的时间从原先那个黑咕隆咚的地方到这个，嘶…由混凝土构成的地方吧。但我感觉不到任何饥饿口渴的感觉，而且我现在对时间的观念也有些模糊了，现在大概是…早上吧我觉得。另外容我吐槽一句，这破地方可真他妈够冷的，而我也只穿了一件长衫。
//好吧，步入正题。现在在我的前方（镜头中，密密麻麻的混凝土覆盖着整个区域，前方是一座外形扭曲的房屋）不远处有一个……应该是，好吧，不管它是不是房子。我现在都要进去一探究竟了。（Elesar走进了那栋扭曲的建筑，随后关闭了镜头）
//
//<过了十几分钟后，录像机再次被打开>
//
//Elesar：现在有一个好消息和一个坏消息。好消息是，我在房子里找到了一些杏仁水和一点火盐，这对现在的我来说真是急需。坏消息是，这房子也太大了。我已经在这地方走了至少十分钟了，可还是没见到有什么门窗。我怀疑这里根本没有其他的出路，而且我也不确定我是否记得原来的路。目前看来我只好……
//（Elesar突然停止了讲话，将镜头对准了走廊远处一个模糊的身影。）
//
//Elesar（小声）：我现在似乎遇到了个更大的麻烦，远处那个看上去并不是人类。我现在要把镜头放大……
//
//（画面被缓慢放大，远处的那个身影逐渐清晰，是一只在原地发呆的窃皮者。）
//
//Elesar：妈的。竟然是个窃皮者！而且还堵在了我回去的必经之路上！真是晦气！
//
//（也许是Elesar过于激动，说话的声音被那只窃皮者听到了，它发现了Elesar并开始大吼大叫地向他奔来。）
//
//Elesar：哦不，那家伙发现我了，我现在只能向后撤了！但愿这不是死胡同！
//
//（录像机的画面时而清晰时而模糊，伴随着的还有Elesar的喘息声和窃皮者的吼叫声。这样的状况持续了几分钟，直到一扇门突兀的出现在了空荡荡的墙壁上。）
//
//Elesar（粗喘）：我现在…已经…跑不动了，我不知道…这扇门后有什么。但…我相信…无论是什么…都要…比被一只…愚蠢的窃皮者…追杀要好……
//
//<Elesar几乎是踹开的那扇门，随后他立刻将门关上并反锁，记录结束。>
//
//区域三 空白地带
//空白地带为本层的第三个区域，地面同样是混凝土构成，但混凝土变得异常脆弱，只需要敲打几下就会脱落。这时破坏混凝土砖所得的产物也变得更加奇怪，它们的截面类似于人类或是其它生物的血肉组织，并且被破坏的地方有少量的暗红色液体流出2。
//
//区域三的混凝土砖是有限的，向任意方向行走一千米左右就可以看到裸露的地面。目前还没有任何人进入到更前面的区域，但初步推测认为是一片空旷的虚空。
//
//3376-F87-A-7015-4876-9938-A7-F4-D71-C9080.jpg
//区域三的地面，拍摄者未知。
//
//空白地带也是本层最具危险性和神秘性的区域。虽然无任何实体出没，但本区域内经常会发生一些随机的改变，绝大部分的改变对于流浪者来说都是足以致命的。如：
//
//气温极其不稳定，有记录的最低气温为-34.1℃，而最高温度则达到了61.7℃。
//雾霾持续时间长，有研究表明长时间吸入这些雾气能引起呼吸困难，且容易让人失去方向感。
//重力有所变大，这行让走会变得吃力。
//流浪者有概率被随机传送，目前还不知道这些流浪者被送到了哪里。
//流浪者有时能感到有无数双眼睛在盯着自己看，独自一人时这种感觉会变得更加明显。
//在此区域睡觉的流浪者会离奇失踪，不过据报道所有失踪的流浪者在原来睡觉的地方都会出现一块白色的混凝土砖。
//该区域的混凝土砖似乎是一种实体。
//附录3
//一段流浪者与M.E.G.的对话语音
//日期：2022/7/30
//
//<记录开始>
//
//“喂？有人能听到我说话吗？”
//
//“这里是M.E.G.，请讲。”
//
//“我和我的朋友原本在Level 11呆的好好的，直到我们遇见了一栋外观奇特的高楼。这栋楼非常的醒目。外观是波浪形装的，从一楼到顶楼的颜色分别被涂成了黑、灰、白三种颜色。我们因为好奇就想进去看看，可进去之后我们才发现已经没法回去了。这鬼地方的样子也不像任何一个我所知道的层级。”
//
//“请问你是否可以描述一下那里的样貌呢？”
//
//“当然，这里的地面全都是白色的混凝土砖，除此之外我们没有看到其他的。不过这些砖质量太差了，我没怎么用力踩它们就碎了”
//
//“已记录，请继续描述，我们会尽快派出搜救队前往你们那里。”
//
//“之后我和我的朋友想要尽快的找到出口，走了不知多久才看见了一些没有被混凝土覆盖的地方。我们以为马上就能出去了，于是准备在这里安顿一下再出发，可事情就发生在这一步。”
//
//“你能描述一下当时发生了什么吗？”
//
//“我们当时正准备小睡一下，可我刚眯上眼睛没一会，就听到我朋友传来了一声惨叫。”
//
//“我立刻就被吓醒了。转头一看，发现我的朋友已经不见了，但他留下的外套上多了一块混凝土砖。我现在六神无主，只好来求助你们。”
//
//“我们已经派了人员前往了，请你保持冷静。”
//
//“对了，我要再补充几点，这里——阿嚏！呼，真是见鬼，这里似乎变冷了。”
//
//“这里的混凝土砖很奇怪，它们外表看上去挺普通，但把它弄碎之后，我发现这里面……似乎有血迹。还有就是，我朋友他似乎是挣扎过的，但不知为何，他只发出了一声尖叫，也并没有叫我……好了，我补充完了。”
//
//“谢谢你提供的信息，我们的救援人员正在前往，请你稍安勿躁。”
//
//“没问题，不过我挺好奇这些混凝土砖是由什么构成的。我现在就拿……奇怪，我的手怎么越来越僵硬了？就像石头一样……等等！我……我的身体越来越僵硬了……我说不出……”
//
//“喂！你怎么了？发生什么事了？请回答！收到请回答！”
//
//（对面传来了一阵阵类似石头撞击声和骨头碎裂的声音）
//
//“喂！你能听得到吗？”
//
//“这些……混凝土……是……是怪物！……啊！”
//
//（对讲机的另一头传来了一声惨叫和东西跌落的声音。随后信号丢失，记录中断。）
//
//基地、前哨和社区
//M.E.G.“康瑞特”基地
//
//该基地共有15人。
//位于第一区域正东方向1千米处。
//负责帮助前来的流浪者，勘察本层的特性。
//入口和出口
//入口
//在Level 11进入一栋扭曲的混凝土大楼会直接来到本层的区域三。
//穿过Level 108一条昏暗的走廊可能会来到Level C-762。
//可以通过Level C-102、Level 172打开一个暗灰色的石门进入这里。
//出口
//在区域二的房屋里可能会遇到通往Level C-13的门。
//在区域三沿着南方向或北方向行走至少24小时后可以看见一座被浓雾笼罩的城市，穿越迷雾即可来到Level 11。
//作者信息
//
//« Level C-761 | Level C-762 | Level C-763 »
//脚注
//1. 其中也发现了疑似人类和未知实体的骸骨。
//2. 后经分析，该液体确实为血液。
package lvls17x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1762{}