//Level C-723
//本层级档案由正电子后室有限公司（E.P.B.）与探险者总督（M.E.G.）合著
// 
//
//层级属性：
//获取前厅化合物的重要据点
//
//安全
//C-723试炼
//可获取前厅元素
//评分: 
//+13
//+
//–
//X
//Level C-723是后室C层群的第723层。
//
//描述
//Level C-723表现为一个颜色为纯白色的，无限大的平原，其地面似乎没有高低差距。
//
//Level C-723内的天空颜色为纯蓝色。
//据空气质量检测，Level C-723内有正常配比的空气，空气内水蒸气含量正常，但其空气内二氧化碳浓度似乎一直处于前厅1869年1时的浓度。大气温度稳定在25℃，尚未进行层级高度测试。
//
//据地质考察得知，白色地面的分子构成似乎为大理石，但是在Level C-723内的大理石硬度远远超过了常规大理石应有的硬度，其大理石强度甚至可以承受流浪者在“C-723试炼”时对其释放的的100Mpa2的压强。
//
//Level C-723内没有昼夜更替，但其蓝色天空正中有一团高度未知的，金色的光源，其内似乎包裹着一张“元素周期表”。
//据“元素教派”称：此为他们的“元素之神”。
//
//当一名流浪者进入Level C-723时，Level C-723会对此流浪者发起一项“试炼”（下称“C-723试炼”）。
//
//关于“C-723试炼”
//“C-723试炼”具体表现为：当一名流浪者来到Level C-723时，其面前将会出现多种特定的元素，且出现的目标元素均为刻着原子序数以及化学符号的固体方块3。
//
//- 关闭
//据前段时间提出的镜像化学惰性理论，我们对这些出现的特定元素进行了测定，发现均为前厅元素，有一种理论称：“这个层级是我们获取前厅元素反应物以及使用前厅元素制作武器的绝佳层级。”
//
//出现特定元素后，Level C-723会以一种未知的方式来提醒流浪者将这些出现的元素组成一个或多个化合物4，组成的难易度似乎与流浪者的学历有关，若流浪者的学历为小学毕业，此流浪者将直接跳过此层级直接进入Level 0。
//
//在组成化合物的期间，流浪者可以自由控制白色房间中的一切，例如温度，压强以及空气密度等5，但是流浪者对于Level C-723的控制程度似乎是有限制的，其最大可控范围似乎在-273.156至100兆之间。
//
//以下是关于经历过“C-723试炼”的流浪者的采访片段节选。
//采访记录1
//采访目标：匿名流浪者
//
//目标学历：初中毕业
//
//貌似是我正在我家看着一块烧着的煤思考它的烟是什么东西，我就进来这个层级了，然后它就叫我整什么“二氧化碳”？叫了我之后我面前就突然出现两个方方的东西，一个写着“O”一个写着“C”，反正我不知道是什么，我只是四处走走7，然后过了一段时间，我开始想我的家了？然后我就被传送回去了？真的莫名其妙。
//
//
//采访记录2
//采访目标：匿名流浪者
//
//目标学历：小学毕业
//
//呃，我听了你们对前面的那人说的话，我也差不多是这么进来的，但是这个层级只在我眼前闪了一下，非常白，然后我貌似就直接进Level 0了？
//
//
//采访记录3
//采访目标：一名匿名E.P.B.研究员
//
//目标学历：博士毕业
//
//采访？好吧..我是这么进来的：“在研究所打破了一个烧瓶。”我就来到了这个新层级，我一来到这个新层级它就叫我合成氨基酸，它叫了我之后，我面前就突然出现了几个固体元素方块，但因为是新层级，我也不知道怎么合成，但过了一会我发现我可以控制这个新层级的大气压强和温度等权限，知道我有这些权限后我很容易就搞出来了。
//
//整出来氨基酸后我是一心想着回到研究所打算跟他们说我发现了一个新层级，似乎是听到了我想回去吧，我就被这个新层级给送回去了？
//
//
//
//若流浪者在进行“C-723试炼”时陷入困境8，此层级的唯一实体“化学老师”（详见新增实体档案）将出现，他会给予流浪者提示，若仍然未合成出目标化合物，此流浪者便会被Level C-723送入Level 0。
//
//若流浪者成功合成目标化合物，他们就可以前往一个被他们任意指定的，生存难度大于宜居的层级，或者在Level C-723内定居9，Level C-723会定期给予在Level C- 723内定居的流浪者一些随机元素，这些元素通常都能合成出淀粉和蛋白质以及水。
//
//目前我们尚未发现流浪者合成的目标化合物的去向。
//
//- 欢迎
//通过追踪观测的方法，我们发现这些目标化合物以一种未知的途径到达了Level C-340。
//
//在Level C-340中的某些表面标有：“F”的化学仪器内含有的化合物正是来自于Level C-723内的目标化合物。
//
//目前M.E.G.的研究小组正计划与E.P.B.达成长期协作并长期驻扎在Level C-340内以获取来自于前厅的化合物。
//
//E.P.B.正在企划通过提高流浪者的学历来以此制造更多多样化的目标化合物。
//
//- 欢迎
//
//因为此层级的特殊性质，此层级内没有任何实体记录已更新，请查看新增的实体档案。
//- 关闭
//实体
//在Level C-723内仅有一名实体，该实体自称：“化学老师”。
//
//描述
//此实体据推测是一名人形实体。
//此实体出现时的样貌因人而异，但是其在流浪者眼前出现的样貌均为看见此实体的流浪者最讨厌的化学老师10。
//
//行为
//如果一名流浪者在“元素试炼”中陷入了困境，“化学老师”将会出现，他会对陷入困难的流浪者进行一系列关于化学的批判，这通常要花费流浪者许多时间。然后此实体会给予流浪者一些提示，这些提示往往能使流浪者马上完成试炼，但是所有流浪者都拒绝透露关于提示的细节。
//
//应当
//完成“元素试炼”。
//不应
//陷入沉思。
//拒绝“化学老师”的帮助。
//- 关闭
//基地，社区和前哨
//“元素教派”
//在白色平原内居住，相信元素就是他们的“神”。
//大约10人。
//与有识血肉“前厅采集巢”关系不佳。
//中立
//不开放贸易
//掌握如何使用元素制造食品。
//以下是他们传教时常常背诵的教义。
//
//- 关闭
//你们总是认为“人”才是世界之王。
//
//甚至你们还想妄图占领这片被称为“后室”的净土。
//
//殊不知。
//
//人类与世界上的一切物质都是由元素组成。
//
//就连前厅那无垠的宇宙。
//
//也是由元素组成。
//
//我们信仰元素。
//
//我们相信信奉元素能给我们带来更美好的生活。
//
//我们利用元素之主赐予我们的元素来满足我们的食欲。
//
//而那些只懂得使用血肉的蠢蛋只会到处切出切入来寻找食物。
//
//我们利用元素之主赐予我们的元素来制造武器。
//
//伟大的元素之主永远爱戴着我们。
//
//我们永远相信元素之主。
//
//永远。
//
//
//
//所以。
//
//你想与我们一起。
//
//相信元素之主吗？
//
//- 关闭
//有识血肉“前厅采集巢”
//由20个流动有识血肉人口组成。
//与“元素教派”相距不远。
//友好
//高价收购前厅化合物。
//- 关闭
//E.P.B.与有识血肉达成了临时盟约，E.P.B.提供前厅化合物，他们则帮E.P.B.监视“元素教派”并查看被E.P.B.及M.E.G.发派到Level C-723内的采集人员，若他们表现出要入教的倾向，有识血肉会劝说其放弃入教，如有必要，他们会采取强制措施
//
//是的，这是伟大母亲的旨意，而且我们也很讨厌这些啥都信的人类。
//
//- 关闭
//因为“元素教派”的影响，E.P.B.与M.E.G.并未在此层级设置基地。
//发现
//此层级是由一名在Level C-340内的E.P.B.研究员误将一瓶标签为“F”的空圆底烧瓶打碎而意外进入的，据采访称，他的“C-723试炼”是氨基酸的合成，但是其轻松完成试炼并回到了Level C-340
//
//入口和出口
//入口
//在Level 11尝试自制核反应堆会来到此层级。有趣的是，若以这种方式来到此层级，离开后会附赠关于核反应堆的全部元素以及一张“元素周期表”。
//在任意一个层级思考二氧化碳的构成即可来到此层级。
//在Level C-340打碎一个写有“F”的空瓶子即可来到此层级。
//出口
//特别的，此层级禁止切出，且诺克利普贴也在此层级失去了作用。
//完成“C-723试炼”即可来到一个被流浪者任意指定的，生存难度大于宜居的层级。
//在“C-723试炼”中陷入困境，你将会来到黄色。
//作者信息
//
//« Level C-722 | Level C-723 | Level C-724 »
//
//Footnotes
//1. 此为门捷列夫发布第一张元素周期表时处于的年代
//2. 压强单位，其Mpa的中文名为：兆帕
//3. 方块体积似乎会随其目标化合物的质量大小来进行相应变化
//4. 目标化合物均为前厅已发现可合成的化合物，例如：氧化钙CaO。
//5. 制造真空是可行的，但是我们不敢保证流浪者不会死于窒息。
//6. 即绝对零度。【附录：除绝对零度外可控范围为：1至100兆】。
//7. 我们推测此流浪者通过呼吸合成出了二氧化碳，所以Level C-723判定其完成了“C-723试炼”
//8. 比如：30分钟后仍未合成出目标化合物、合成出了错误的化合物等。
//9. 若定居在Level C-723中，Level C-723将剥夺定居者在“C-723试炼”中获得的控制Level C-723的权限。
//10. 不论人数
package lvls17x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1723{}