//Level C-712
//评分: 
//+35
//+
//–
//X
// 
//
//生存难度：
//等级 2
//
//不安全
//稳定
//非蓝鸟鹉主
//Level C-712 是后室C层群的第 712 层。
//
//描述：
//Brs6yPLfEU9X8Kd.jpg
//山坡上树木较多的一侧
//
//Level C-712 是一片永远被薄雾笼罩的原野，地表形态表现为一个相对高度约为 50 米到 100 米，坡度较缓的山丘，近似于一个扁平的圆锥体。主要的植被是一种常见的青草和偶尔会单独出现的树木。该层级的树木通常处于枯死状态，其周边也没有落叶或是树叶正在落下的的现象被观察到。
//
//该层级的大小是有限的，但具体面积由于该层级特殊的空间性质而难以测量。任何进入这个层级的流浪者都会随机出现在山丘的一侧，当流浪者尝试向远离山顶的方向移动时，便会在对应的另一侧出现。
//
//当流浪者到达山顶，有可能会找到一扇竖立在原野上的出口门。有时这扇门会处于一片向日葵花海中。在花海里，流浪者有可能找到“理查德”。流浪者能否进入向日葵花海似乎因人而异，有的人能够很轻易地进入向日葵花海，而有的人则永远不能。出现这种差异的原因未知。当一个流浪者下山并离开向日葵花海，再次返回山顶时则不能回到花海，直到下一次进入该层级。
//
//该层级存在众多的鸟类实体，包括部分在其他层级可见的鸟类实体，但最常见的是该层级独有鹦鹉类实体。它们通常只会单独出现，流浪者在向山顶方向探索时就有可能在树上发现它们其中的一只。
//
//强烈建议流浪者不要靠近任何鹦鹉类实体，它们已被证实有着和杰瑞类似的教化能力，太过靠近它们将会导致流浪者成为该实体忠实的信徒。成为信徒后，流浪者将会表现出和杰瑞的信众类似的行为，包括但不限于狂热地崇拜教主实体、四处传播教义、尝试拉拢新成员、与其他鹦鹉教派成员（包括杰瑞的信众）产生冲突等。
//
//实体：
//“威廉”
//482351443_64ef90f9f8.jpg
//一流浪者在被教化前拍下的照片
//
//威廉是该层级中最容易遭遇的实体之一，其外观与前厅中的蓝黄金刚鹦鹉无异。
//
//当流浪者靠近时，威廉会侧脸注视流浪者；当流浪者靠得足够近时，威廉会抬高胸膛，张开双翼，似乎是在接受流浪者的崇拜；当流浪者尝试触碰威廉时，流浪者会在一瞬间成为威廉的信徒。
//
//与此层级中的其他实体和杰瑞不同的是，威廉在教化完成一个流浪者之后，会主动停留在该流浪者的肩上，此后流浪者会不顾一切地保护威廉，并且不会让任何其他流浪者靠近，这导致威廉通常只能拥有一个信徒。威廉的信徒会很快因保护威廉而死亡，这通常是由于他们被威廉教化后认知能力降低而盲目消除危险的行为导致的。
//
//威廉可以使用杏仁水和向日葵瓜子驯服，流浪者驯服威廉后，威廉会在空中跟随该流浪者并在流浪者遇到危险时发出叫声提醒流浪者。驯服一至两天后，威廉会回到 Level C-712。据悉，威廉会跟随流浪者离开层级，但会在流浪者进入室内层级后回到 Level C-712。
//
//“贝斯”
//Cc5g2JfA97IONGD.jpg
//前厅的一只葵花凤头鹦鹉，并非贝斯
//
//贝斯被认为是该层级最危险的实体，其外观与前厅中的葵花凤头鹦鹉无异。
//
//根据现有的报告，流浪者通常是在贝斯飞向并停留在某一棵树上时发现她的。有人猜想贝斯从某一刻开始就一直跟随流浪者，直到流浪者遇到一棵树时才降落并引起流浪者注意。但没有记录表明这一猜想是真实的，因为薄雾遮挡了流浪者的视线。
//
//被贝斯教化后，流浪者将会成为贝斯的“储备粮”，在贝斯感到饥饿时，她的信众会心甘情愿地成为她的食物，并被她用喙活活啄死，最后只剩下一具骨架。若贝斯在没有信徒时感到饥饿，则会主动教化并攻击附近的流浪者。
//
//“格林”
//nQboVu8FlAO9xzD.jpg
//出现在 Level C-712 的格林
//
//格林是一只头顶偏灰，喙呈亮红色的绿色鹦鹉实体。
//
//格林是层级中最稀有的一只鹦鹉实体，这可能是因为她喜欢跟随他的教徒到其他层级进行探索，她偶尔会回到 Level C-712 休息。
//
//目前格林没有表现出任何的危险性，并且她不会主动进行进行教化，只有当流浪者把格林抱紧时才会被教化。据格林的信徒所言，信仰格林将会获得自由穿越大部分层级的能力，格林会在信徒陷入危险时帮助其切出到安全层级。但这些说法均未被证实，由于格林的信徒十分稀少，并且格林本身也很少出现，M.E.G. 难以进一步调查。
//
//建议流浪者不要选择接受格林的教化。
//
//“汤姆”
//BXEOgAmF6U3KCjl.jpg
//汤姆
//
//汤姆是全身橘黄，面部亮红，羽翼部分呈绿色的幼年鹦鹉实体。
//
//所有见过汤姆的流浪者都会不由自主地喜欢上它，并称自己从未见过如此可爱的生物。当流浪者靠近汤姆时，该实体会将自己一侧的脸颊贴在流浪者的脸上，并发出大部分鸟类幼崽能发出的"啾啾"声，这会使流浪者感到极大的满足感。如果流浪者感受到并接受了这种满足感，那么流浪者就会被汤姆教化。
//
//被汤姆教化后的流浪者会将汤姆视作自己的的孩子，会不顾一切地照顾和保护它。与威廉的信徒不同，这不会导致流浪者对危险的认知能力下降。但汤姆的食量惊人，并且永远处于饥饿状态，其信徒会永无止尽地为养活汤姆四处奔波，还会因此对亲人朋友不闻不问，甚至会丧失理智抢夺其他流浪者的食物和杏仁水。大部分的汤姆信徒都因饥饿缺水和孤立陷入悲尸循环。
//
//据悉，汤姆的数量并不唯一，最多有观察到三只汤姆一起出现的报告。
//
//有趣的是，尽管大部分鹦鹉教主都对其他鹦鹉及其信徒保持敌对关系，但汤姆似乎极度厌恶杰瑞。若有杰瑞的信众接近汤姆，该实体会表现出极强的攻击性，并持续啄击目标的头部。这最终会使得目标逃离或者死于其攻击，死后流浪者的尸体通常会被贝斯食用。
//
//理查德
//qWFSYjowp5HUaNx.jpg
//理查德
//
//理查德是一只头顶及羽翼呈棕黄色，面部和腹部呈白色的猫头鹰，它只会在山顶的向日葵花海出现。
//
//理查德不会教化流浪者，相反，它可以消除流浪者的“信仰”（包括对杰瑞的信仰），同时给予流浪者不被教化的能力，只要流浪者为理查德提供杏仁水或向日葵瓜子，这一方式与驯服杰瑞的方式类似。在流浪者接受理查德的帮助后，理查德会和向日葵花田一起消失，留下一扇出口门。
//
//M.E.G. 曾多次尝试将杰瑞和其他鹦鹉实体的信众带到理查德面前，试图消除其信仰，但都以失败告终。一部分原因是遭遇理查德的不确定性和信徒的极力反抗，主要原因是理查德似乎只会帮助主动寻求转化的流浪者。
//
//*此模块开放编辑，你可以在这里加入你在 Level C-712 发现的鹦鹉实体，但需要附上详细的描述以及图片，并且不能排列在"理查德"之后
//
//基地、前哨与社区
//该层级没有已知的基地、前哨或社区。鹦鹉们的信众在被教化后，通常会很快地被引导通过门来离开层级。
//
//入口和入口
//入口
//在起雾的层级中睡着将有很小的概率从 Level C-712 中醒来
//在 Level 9 找到远处的山丘并向其走去，若发现时间变为白昼并有薄雾出现，则表明你进入了 Level C-712
//在Level C-332 向树木和建筑稀少的地方走去就有可能来到 Level C-712
//出口
//打开山顶出现的门会把你带到一个随机的室外层级
//在鹦鹉类实体面前赞美鹉主杰瑞将会使你传送到杰瑞面前
//尝试在薄雾中对地面进行切出可能会来到杰瑞厅的门口
//在山坡树木较多的一侧向远离山坡的方向探索可能会来到 Level C-9
package lvls17x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1712{}