//Level C-795
//评分: 
//+18
//+
//–
//X
// 
//
//生存难度：
//等级 1E - 环境
//
//较安全
//不稳定
//环境危害
//Level C-795是后室C层群的第795层。是一片半欧几里得空间。
//
//描述
//Mk
//一张广为流传的Level C-795 的照片。图片经过加亮处理。
//
//Level C-795是一片巨大的平原，被桃树林所覆盖。层级不存在昼夜更替，始终为下午时分，天气大多数时候为临雨的阴天，气温恒定在14℃左右。流浪者在层级内偶尔会感觉到有几滴雨水飘下，但始终没有雨确实下起来的记录。天空中的景色似乎始终静止不动，被流浪者描述为一张贴在空中的画，看起来不存在三维透视。
//
//层级内的空气存在异常，进入层级内的流浪者在吸入空气后都会产生一定酒精中毒的症状，但这种状态不会随时间流逝和吸入空气增多而加剧，层级内所有流浪者都保持着仅限于较为明显的醉酒状态的中毒症状1。
//
//关于Level C-795的空气组成，在正常的，以氮气为主的空气中确实存在有一定酒精成分，但结合中毒症状的异常，空气中应该有更多未知的属性或成分值得研究。已知饮用杏仁水可以缓解这种症状，但考虑到呼吸是人体不可阻止的生理活动，这应仅是杯水车薪。
//
//与Level C-79的醉翁效应不同，本层级产生的是实在的酒精中毒症状，虽然它因未知原因不会加剧，但长期摄入层级内的空气仍然会对身体造成伤害。
//
//桃林
//层级内大多被桃林覆盖，桃林中具有类似Level 0的隔离属性。其在视觉上会给流浪者一种异样感，在此后的详细访谈中，其空间布局被描述为「不像是自然生长，而有些过于整齐」的感觉。桃树上的桃花基本都已凋谢，大多数树上已空无一物，部分仅有一二朵残花挂在枝上，而被多数半腐烂和少数腐烂的桃花花瓣覆盖的地面似乎证明了层级内的这些桃树曾满开过。少数时候，一些来源不明的桃花花瓣可能突然随风飘下，洒在流浪者身边四周，这些花瓣像是突然出现一般，即使流浪者在注意到时向上仰望也不会发现其来源，只会看见它们在空中飘落。
//
//在探索中，林内会随着刮风而产生令人不安的怪异声响，随之，流浪者可能会看到类似于猎犬的身影出现在远处，尽管层级内并无任何被确认存活的实体。
//
//在一些桃树下可能会找到凌乱的酒罐和盘筷餐具等物，其中残余有少量早已腐败的食物以及一种未知的，但气味很诱人的酒。偶尔地，流浪者会听见附近传来人类谈笑声以及杯盘碰撞的声音，但声源始终不明。
//
//村庄
//在桃林中找到任意一条小径或土路并沿着行进5公里左右将会到达层级中的一座村庄。村庄中亦种植着许多桃树，建筑可以辨认为东亚十五世纪前后的建筑风格。村庄内不存在任何现代科技产物，建筑大多已破败，少数倒塌，室内积尘和蛛网的状况十分严重，也可能出现疑似尸鼠残骸的腐败尸体。建筑内存在的食物和酒以外的饮品皆严重腐败，即使再饿也绝不建议食用。
//
//Vi
//Level C-795 的村庄部分的照片。同样经过加亮处理。注意这张照片展现了村庄中一棵存有桃花较多的树的部分树枝。
//
//流浪者在村庄外附近时可能观测到村里冒出炊烟或是听到喧嚷的人类交谈声，但未有在村内出现此类现象的记录，报告者在进入村庄内后也会发现异常现象消失。在村庄内则可能听到来源不明的脚步声或孩童嬉戏声。
//
//村庄里四处弥漫着酒香，后来发现许多建筑内有着装满前文所述的未知的酒的酒坛。这种酒在流浪者间饱受好评，但它一旦被带出层级就会变为近似于普通的水的液体，经研究这种水里含有极少量杏仁水成分。
//
//异常效应
//据许多进入过Level C-795的流浪者报告，他们在层级内的桃林中可能会通过睡觉等方式突然出现幻觉，这种幻觉在五感上极为真实，且在描述中幻觉所呈现的画面都是相似的场景，这被描述为一片类似于本层级的盛开的桃林。但在幻觉中某些部分又过于模糊。以下为可供参考的口述记录：
//记录1
//在桃树下睡着，我做了一个梦，大概是梦吧。
//
//那一瞬间，我看到了满开的桃林，就像是刚才的枯林一瞬间绽放了无数花朵一般。天空是明净的蓝色，令人舒适的晴日。粉色与蓝色的搭配让人视觉上很舒服。一阵春风将暖意带来，也将花瓣拂落，它们如细雨一般飘落，又随着风向在空中舞动着，最后轻轻落下，落在早就被那些先行的花瓣覆盖为粉红色的地面，也落在我的身旁。
//
//我似乎流泪了，并不是因为伤心，而是一种更难以言喻的情感。这是只有春天才能感觉到的，来自于自然，来自于生命本身的一种东西，可以说是对「春回大地，万物复苏」本身感到的本能的喜悦之情，它轻叩着我的心灵。鼻子一酸，泪水很自然地流了下来。
//
//动了动鼻子，这才意识到那股香味，夹杂着花香的浓厚的酒香。我环顾着四周，都是些围坐在一起谈笑的人们，这酒香便来源于他们手中的酒杯。我并不记得他们中任何人的长相或穿着，回忆起来很模糊。但我记得很清楚的一点是，即使我从来没有见过周围这些人，温暖的感觉依旧迅速占据了我的内心。
//
//我自己也正和几个人坐成一圈，面前摆放着一些小吃和酒，他们在聊着些什么，尽管我已经不记得了，但那应该只是朋友间会聊的闲话。即便我这么说，这种最普通的闲聊都令我无比的安心。
//
//怎么描述呢，大概是……挚友之间相处时的那种感觉，很自然的安心感，我几乎都要忘记了。上一次相关的记忆，依稀记得还是在学校时。之后就是为了生活而奔波，每天都喘不过气，心也逐渐麻木了。再然后，失足撞上了一堵墙，便见到了无尽的黄色。
//
//某个声音把我从回忆里拉出来，是我身边的人们在叫我，我并不记得他们对我说了什么，只知道他们都看着我，笑着。其中一个人向有些茫然的我伸出手。下意识地，我也准备伸出手去。
//
//但是透过伸出的手看到的，是阴云密闭的，死寂般静止的天空，我呆呆地眨了眨眼，愣在原地，那只伸出去的手始终没有放下。梦醒了。再次环视四周，还是和之前同样的景色，一片枯死的桃林，但现在再看着，却让我感到无比的窒息。
//
//感觉到脸上有什么东西流下，因醉酒而有些发烫的脸颊被冷风吹着，凉凉的。
//
//啊……这是我第二次哭了吧。
//
//
//记录2
//我当时正走在桃林中一条路上。这本来没什么，但某一时刻当我回过神来时，自己正走在与刚才几乎相同的一条路上，只是两边的桃树开满了粉红的桃花。说实话，它们很美，美到以我贫瘠的文采难以描述。
//
//我的右手正被握住。即使我刚刚才意识到身旁这个女孩的存在，但看着她，却又感觉她就好像一直都在一般。她的长相，到现在我记得很模糊，但当时我就是觉得她是一个重要的人，不知道为什么。她和我聊天，用清澈且好听的声音。我也很自然地做出回答。我们就这么在路上走着。
//
//我清楚地记得她的脸上充盈着笑容，我想我大概也是在笑着吧。温暖的春风迎面吹过来，她用手拨着耳边的长发。两旁桃树的树枝随风轻轻摇曳着，花瓣也随着风而飘起，有一片落在她的头上，看上去很是可爱。还没等我伸手去拿它，它已经再次踏上了春风，去向远方。
//
//我们在聊些什么呢……我不记得了，大概只是一些微不足道的小事吧。但就是这样的对话让我感到很安心，甚至于说幸福。我和她紧紧地牵着手，前方是一片碧蓝的青空。我就这么走着，就像是被她拉着，追着春天而行一样。
//
//『请带着我走下去吧，直到无尽的远方。』
//
//我不禁这样想着。无论这个女孩是谁，我只想现在的时光一直持续下去。
//
//「所以你——」
//
//眼前错误的景色让我的话语戛然而止。我走在这条毫无生气的路上，一滩死水般静止的天空像压迫着我一般，雨水星星点点地落下来，像是某人的眼泪。
//
//我怔怔地看着自己的右手，那份温暖仿佛还残留着。那是一个梦吗？是我永远无法到达的世界吗？萧瑟的风又吹了起来，一片花瓣落在我的手心。
//
//现在一滴一滴落在我手心的，是雨水吗？亦或是我的眼泪？
//
//在心里不知向谁发问，我就这样用双手捂住脸。
//
//
//已知的是，这种幻觉结束后会让流浪者感到极度的悲伤，推测其于幻觉和现实的强烈反差有关，也可能为特殊心理效应。结合层级内一些对应物的存在，幻觉中呈现的景色被认为是本层级过去的景色。
//目前暂无在村庄部分出现幻觉的记录，更多信息正在研究中。
//
//基地、前哨与社区
//Level C-795内并不存在任何具有开采价值的资源，加上层级内的环境影响，目前并未有任何基地或社区在本层级建立。但有少部分流浪者会自愿进入本层级，他们大多是受到异常效应影响的人，主要是为了研究层级内的桃树，空气，以及酒而来。可能在不远的将来会有基地、前哨或社区等被建立。
//
//从目前得到的信息来看，流浪者们似乎在尝试把本层级改造为和他们所见的幻觉相同或相似的环境。M.E.G.对此事持积极态度，并准备提供支持。
//
//入口与出口
//入口
//在Level C-514的室内有可能找到一瓶酒，将它直接倒在地上后2再走出室外，此时会突然刮起强风迫使流浪者闭上眼，待风势退去后，流浪者睁开眼会发现自己身处Level C-795。
//在Level C-79中找到一棵其下洒满花瓣的桃树，躺着花瓣中睡着即可到达Level C-795。
//在Level 10走上一条上有桃花花瓣的石砖小路可到达Level C-795的村庄里。
//出口
//跳入村庄中干涸的水井将到达Level C-8
//在村庄里找到任意一棵桃树切出便可以回到Level 10
//其他
//收起
//某位流浪者提供了一份对300号实体理查德的交互记录。其中理查德模糊地透露了本层级的一些有关信息，但其真伪难辨。可即便如此，这也让我们对层级异常效应的看法有所改变。
//音频记录
//<开始记录>
//
//（传来了脚步声）
//
//采访者：呃，你好，理查德先生。
//
//理查德：哦，你好朋友。有什么可以帮助你的吗？
//
//采访者：其实，呃……我在研究有关Level C-795的事，现在在收集资料和情报并进行调查。
//
//理查德：Level C-795，哦，你是说她…（理查德停顿了下来）
//
//采访者：理查德先生？
//
//理查德：惯性思维很可怕对吧？
//
//采访者：你是指……
//
//理查德：你不知道惯性思维是什么意思吗？当所有证据似乎都指向一个结果时，即使没有直接证据，人们也会惯性地认为那就是真相。其实真正的事实可能刚好相反。
//
//采访者：难道你的意思是，我们在层级中产生的幻觉并不是过……
//
//理查德：（打断采访者的话）好了，这个话题可以到此为止了，去睡一下吧。
//
//采访者：等……
//
//<记录中断>
//
//作者信息
//« Level C-794 | Level C-795 | Level C-796 »
//
//脚注
//1. 这种症状较轻，目前并没有流浪者出现俗话说的「断片」现象
//2. 喝掉也可以，但不建议
package lvls17x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1795{}