//Level C-750
//评分: 
//+51
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
//一小时逗留
// 
//Level C-750是后室C层群中的第750层。
//
//描述
//vZvIyj.jpg
//白日浅光，深藏云海。
//
//整体而言，Level C-750是一片具有无限延伸的性质的草地。
//
//时间上，该层级中的时间严格依照协调后室时进行，并被分为“昼”与“夜”两个时间段。从六时开始直到十八时为止为“昼”，从十八时到次日六时被划分为“夜”。经过M.E.G.的精确测量可得知：两个时间段的总长都是整十二小时，仅仅只有毫秒上的偏差。
//
//在“昼”的时间段上，Level C-750一直保持晴天，流浪者时刻能感受到光照，它们大多来自该层级中高挂的一个大型电灯，电灯的电力来源未知，它被流浪者们称为“太阳”。实际上，如果将它与前厅中的太阳作比较，那么它们两者之间只有光线强弱和能否运动的区别。
//
//由于Level C-750具有无限延伸的性质，所以太阳的发散距离也是有范围的，从中点出发越向外光线越弱，但目前仍未有人到达或是探测到真正的没有光线所及的地区。
//
//层级中气温多在二十摄氏度左右，由于水源多为地下水的缘故，这里湿度偏高，而且这些地下水深度较深且不可饮用，建议流浪者进入时备好可饮用水。而对于“夜”的时间段上的天气的具体情况目前仍未探测完全，且直至目前没有流浪者真正目睹过十八时过后的层级环境，所以在此不多做介绍。
//
//环境上，这片草原并不是完全的平地，偶尔能看见一些凸起的小坡，这些坡的坡高不超过两米。草原中间是一个较高的山坡，该山坡高度约有八米，坡度较缓，这使得坡长偏长，粗略估算大约有十五米左右。山坡顶部是一个较扁的圆形，上有一些被种植得很密集的树木，它们多为耐旱性树木，树干较粗壮，高度约有五米，分叉多而密，上面的叶片多为单调的黄色。
//
//Level C-750中分散有许多自然出现的木制房屋，每间房屋占地约有七十平。这些房屋装潢简单，多有正常房屋应有的日用品，杏仁水等物品尤其多见，内置资源完全能够让一个成年流浪者居住三天。房屋通常三四间一同分布，单间分布的房屋相当少见。
//
//这些房屋并不是无限制地出现在层级的任何地方，它们都分布在一个固定的区域内，通过M.E.G.成员的调查，我们得出了一个测量层级中“可居住区”的方法：以中部山坡为中点，半径为十公里做一个形状近似于圆圈的区域，该区域便是出现有房屋的居住区，在居住区内部有着微弱的Wi-Fi信号。位于居住区以外的地区环境与居住区环境相差不大，但相比起居住区内的环境更为干燥，同时还不存在任何的Wi-Fi信号。
//
//同时，这里也有大型聚落。在山坡的正北、正东、正南和正西1四个方向上，与山坡相隔七公里的地方分布有四个大型聚落，这里离奇地分布有总体数量大于十五间的房屋。毋庸置疑的，这四个大型聚落都有了组织的占领。
//
//特殊现象
//层级中一直有着某种没有固定频率的电磁波，这使得层级内充斥着电磁波干扰，收音机或能接收到电子信号的设备在这里不能起到任何的作用。同时，多个组织都试图拦截或接通该电磁波，但都无功而返。
//
//- 收起
//试验时间	实验经过	实验结果
//五月二日	试图通过老式收音机搜索频率	没有收到任何反响
//五月十三日	更换了更新式的收音机，能够搜索到某个频率并接入	只有杂音
//五月二十七日	进行最后一次实验，接入了一个固定的频率	只能听见一些模糊的字眼，大多是杂音
//尽管在描述中提到，在中点的山坡上的树木的种植间隔短而密集，同时又提到该层级中的太阳光线强度并不高，所以流浪者抬头直视太阳时所射入他们眼中的阳光并不会致使他们产生目眩感，因此这里的流浪者可以直视太阳。
//
//但每当流浪者切入时每次睁眼都会看见一束刺眼的光线射入他们眼睛，并造成眩晕感。有流浪者说：“这串光线是直接从树木间的缝隙射出的”。但太阳的位置固定且在树林的后上方，照常理而言，太阳是不可能跑到树林后面的。直至目前也没有人知道这串光线来自何处。
//
//有人发现，无论层级在前一日无论受到何样的损坏都会在度过一夜后彻底恢复原样，简要来讲就是层级的“重置”。目前暂且不知该层级在夜间发生了什么状况，但M.E.G.一直在试图放置录像机来收集关于夜间的消息。
//
//实体
//由于层级的切入特殊性，该层级没有任何已知实体。
//
//基地、前哨和社区部分
//由于该层级中有大量组织，所以仅在此处写出四个占有大型聚落且有人常驻的组织和其他具有代表性的组织。
//
//M.E.G.：
//位于中点正北方的组织。
//人数约有五十人左右，总是对流浪者开放。
//试图探测有关“夜”间的内容。
//B.N.T.G.（不结盟贸易联盟）：
//位于中点正东方的组织。
//人数未知但货物总是充足，可以在这里找到大多数物品，但抢手货多为一些武器。
//实行“以物易物”的交易方式。
//后室娱乐：
//位于中点正南方的组织。
//售卖属于该组织的自制物品。
//以杏仁水作为通用货币来进行贸易。
//B.F.P.F.（后室家居生产厂）：
//位于中点正西方的组织。
//固定人数最多，约有七、八十人。
//负责维护层级内部的稳定。
//画者（Artists）：
//专门从事于对层级中点树林的绘画。
//任何人都可以加入他们，当然是在你的绘画技术不差的前提下。
//与B.N.T.G.组成协议，他们的画经由B.N.T.G.之手销售。
//入口与出口
//入口
//在任何层级中看见该层级中树林的画像即可切入此层级。2
//似乎对实体有排异性，只有人类才能切入Level C-750。判断依据有两点：一：切入者的经历中是否有过切入后室这一行为；二：切入者是否有对前厅有简单认识。3
//凌晨六点后流浪者才能切入。
//出口
//当流浪者在Level C-750停留一小时后将会切出到流浪者切入前所在的层级。
//可以主动撕毁一副画像来直接切出到切入前所在的层级。
//当Level C-750的时间到十八时时流浪者将会自动切出到切入前所在的层级。
//附录
//实际上，仅仅只通过层级介绍我们不能真正了解到整个层级的全貌。每个适合居住的层级都是这样的，除了风土，还有由人类人文所滋养出的人情。我们从一位流浪者口中记录下了一篇别样的层级记录，这样其他的流浪者们就可以从别样的角度来了解Level C-750。
//
//- 收起录音
//我抓住了一根稻草。我知道在一个小时后我会松开我的手。我仍然要抓住它。
//
//对于我来说？这个层级无疑就是那根稻草，不到濒死之时我是不会抓住它的。同时它也是一剂药物，是真正意义上的续命药，能让我在面对那些死区中徘徊的强大实体或是自然灾害前从容不迫，因为我深深地知道着：在我死前还能拥有那么最后一个小时起草一篇遗书。你看，这些遗书都是我的大作。
//
//[[他翻出了四封遗书]]
//
//或许是我的命格硬吧，这些遗书都没有派上它们的用场。实际上在这个层级中，有大概百分之二十的人都在起草着遗书。我们对于那些从偏宜居类层级前来的人抱有什么想法呢？无非是很多人口中所说的“羡慕、嫉妒、恨”，我们清楚地看着他们把这里当成了半个旅游胜地。像我这样的人是很难看见他们的快乐的。
//
//不说他们，说说像我们这样的苦命人吧。其实除了起草遗书，在这里购置武器来找寻所谓“生”的人也是很多的，他们不甘愿自己的生命在此处走向尽头，于是就算是押上第二次性命4也要尝试去在无尽的黑暗中找寻那点零星的希望。
//
//人生百态在此尽显呐…。这里还有些不那么悲观的家伙们，他们既不写那封留给后人的无用书信也不去找寻突破困难的豁口。他们同样快乐，但与前面所说到的那些人的快乐全然不同，他们只需要尽情的狂欢，用酒精、用药物洗刷着死亡将来临的恐惧，洗刷着死亡在它们生命中的墓碑上留下的死亡告示。太癫狂了。他们的快乐来自这里，它是完全不同于先前说到的那种快乐。
//
//也有加入组织的人，他们能从组织中得到一些可用的武器来防卫自身，当然这都是免费的。不过我倒是没有加入过这里的任何一个组织。M.E.G.那还称得上不错，我在那里工作过一段时间，每日都有不认识的人来来往往。
//
//也就是在那段时间里，我有了一些追求，我想要把这里的事实看清楚。原先我刚加入时，大概只想着安身立命，为了寻求生而生，这是最正常、最朴素的想法。但当我加入后我才意识到他们的索求与我这种心理是完全不同的。
//
//那时正是“录像机行动”兴起的一段时间，组织中的大半人都在忙活着寻找一个好的地方来放置录像机，他们狂热地记录着一切他们所想的可能放置的地方。我也收到鼓动，也尝试着投入这场行动中去，每当我在山坡上看见他们留下的标记时都感到深深的震撼，直到现在。
//
//他们真正把生命投入到另外一种东西中去，那就只是人类最基本的好奇心，比起我们这类悲观的人来说，那是真正的遥不可望的一种精神品质。也正是因为这个，我意识到我已经缺失了什么，最后我离开了M.E.G.且此后再没有加入任何组织。对于B.N.T.G.而言，我没有经销头脑和对金钱货物的狂热喜好；对于后室娱乐而言，我太过正常，甚至有点悲观；对于B.F.P.F.来说，我这身板也发挥了不了什么作用。
//
//算了，不扯人了。
//
//讲讲风景吧，我老听说人死前看见的东西是最漂亮的，死前对往事的回忆也最深切。你看这里。
//
//[[他指向一个比较高的山坡。]]
//
//我经常坐在那里沉思，至于沉思什么呢？我也不太清楚。但我清楚地知道，再不多想一些东西，自己的脑袋往后就再也没有任何的用武之地了，我回忆自己的过往，应当被记起的、不应当被记起的东西统统浮现在眼前。活灵活现地。
//
//我看得最多的景色只由那些东西组成。太阳、山坡、房屋、草原。但当我第一眼看见他们时，他们就注定在我脑中定下了不变的基调，这种感觉就如同一个人永远不可能忘记他的家一样，它们注定会给我带来深切的怀念和崭新的记忆。
//
//阳光被撒以大地。山坡隆起。房屋长久地矗立着。草？草无处不在。这就是一片四色的风景线，每件事物互不干扰而又有着千丝万缕的牵连，他们无意识地发生，却又有意识地将所有东西牵连在一起，独立却自然。
//
//[[突如其来的沉寂。]]
//
//你看现在，天暗下来了。不瞒你说，我曾经也看见过天空中彻底暗下来的那一瞬间，就是他们所说的“昼”与“夜”的交接时分。
//
//那时的我还不太了解这个层级，于是选了个错误的时间进来。那时大概是十七点多吧，总之快要到十八点了，身边既没有人，也找不到离开的方法，我就呆坐在那里，一直等待、一直等待。天逐渐黑了下来，我低头看向手表：58分。
//
//接着，我的脑子、我的神经被什么东西撞击了，那是一条生命线，是这个层级的生命线，我本认为这一切并不会发生。也就是在那一瞬间，我清楚地认识到，属于我的生命线中有什么被触动了。我的意识波动，我看向天空，于是也就在那一瞬间。我看见了。
//
//先前看见的是日暮的碎裂。而接下来的夜空将要撤下那道一直遮掩着的幕布。可惜我不能好好地看啊。
//
//脚注
//1. 流浪者的切入点和方向是固定的，通常是在大山坡的斜坡上且面对树林。为了方便计算方位，以流浪者切入时面向的方向作为正北，由此推测出其余的四个方位。这套方向观测方法已在多个组织和流浪者间流通。
//2. 但请注意，这些画像并不是无限使用的，每次使用后都会减少画像的清晰度，当画像中没有任何内容时就无法起到切入的功能。
//3. 实际上这是相当好的判断方式，依据一可以将后室原生实体隔绝，依据二可以让后室一代有切入的方法。
//4. 据后来记录时调查得知，似乎是黑市生意。
package lvls17x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1750{}