//Level C-790
//评分: 
//+7
//+
//–
//X
// 
//
//生存难度：
//等级 5
//
//极端寒冷环境
//难以生存
// 
//Level C-790是后室C层群的第790层。
//
//描述
//sx%20100.3%E7%9A%84%E6%A0%91%E6%9E%97
//Level C-790 里的森林照片
//
//Level C-790是一处拥有森林与城镇的盆地,盆地四周为平均海拔3000-4000m的高山，该地区没有季节之分，温度随地区而变化。
//
//值得注意的是，该层级的寒冷气候似乎只对流浪者及外来物品有效果，该层级的实体的行动能力与正常无异，以及该层级内本应结冰的液体均未结冰1，根据化验分析，Level C-790内所有水与杏仁水，腰果水等本应结冻液体，内部含有大量的“抗冷离子”，“抗冷离子”正在进一步研究。
//
//蓝山
//盆地四周的高山被称为蓝山，蓝山上无任何植物与实体，目前未知山的另一面为何地，据传言那边有一片已经冻结的杏仁水湖。这些山上的平均气温为-40℃~-98℃极为寒冷，温度随高度增加而降低。如流浪者想要探索此地，请准备充足的御寒用品，并且请勿爬上山顶。若感到突然的寒冷，请立刻下山。
//因为此时可能会发生蓝潮现象
//
//蓝潮
//“蓝潮”现象是位于蓝山发生的特定自然事件，当蓝潮现象发生时，整个蓝山的气温将会下降至绝对零度，并且表面的岩石将会迅速转化为蓝砂，持续3到4小时，结束时，蓝砂将会以同样的方式转化为岩石。
//此时，附近的地区也会遭到大降温，例如寂静之森。蓝潮现象多发于下午16点以后至早晨6点以前。
//发生前兆为：蓝潮发生前三分钟在蓝山和寂静之森感到气温突然下降。
//
//寂静之森
//寂静之森生长在盆地靠近山的地方，是该层级较为安全的区域，也是该层级面积最为巨大的地区，大约有十八万平方千米。森林中大部分树木为松树，该地区的松树会渗出大量的松脂，一千克松脂能持续燃烧5到6小时，是流浪者取暖的不二之选。同时，该区域也存在少量物资，如罐装龙肉，幸运豆奶等，它们分布在森林中空地的木质箱子内，木制箱子在靠近平原一边较多，箱子会随机刷新。森林中存在着较多的实体，例如悲尸，笑魇，雄性死亡飞蛾，尸鼠等。森林的正常气温维持在-20℃~-56℃间，当蓝潮降临时将会下降到-62℃~-119℃。气温随时间变化而变化，白天保持在-27℃左右，晚上能达到-56℃，有较大的冻伤风险，请流浪者穿戴好防寒物品。
//
//由于该区域的巨大且寒冷，请各位流浪者做好过夜的准备，最好前往我们建造的临时木屋，内部提供燃料但不提供任何食品与药品，木屋由森林中的牌子指导进入。如流浪者在接近傍晚时仍未找到木屋，为确保生命安全，请收集大量松脂并点燃。
//
//蔚蓝之城
//“蔚蓝之城”是一片区域较小的城镇，约二十平方千米。城镇内拥有商店，教堂，警察局，消防局，医院，化工厂，防核地下室，战略导弹仓库等设施。“蔚蓝之城”内部游荡着大量的实体，种类较为单一，以悲尸与猎犬为主。在该城镇内，不同的建筑有不同的物资，表格如下
//建筑类别	物资丰富度	物资种类	实体数量
//双层蓝色楼房	较少	杏仁水	较少
//商店	大量且刷新	食物与日用品	中量
//教堂	少量	层级密钥	大量
//警察局	少量	滋水枪，Wi-Fi	较多
//医院	大量	杏仁水 医疗用品	中量
//冷库	大量	冰冻杏仁水块	少量
//化工厂	无限	火盐锭 液态痛苦 腰果水 蓝砂	巨量
//第一食品厂	不断生产	调味品与杏仁制品	定时肃清
//防核地下室	大量	应急食品与医疗用品	未知
//战略导弹仓库	-	Wi-Fi	未知
//sx%20100.3%20%E8%94%9A%E8%93%9D%E4%B9%8B%E5%9F%8E
//Level C-790 里的蔚蓝之城照片
//
//“蔚蓝之城”城市的气温在-13℃~-23℃之间，草地与农田的气温在-19℃~-49℃之间，温度随着时间而变化，早晨和晚上较冷，中午温度较高。冷库是一个特殊的地方，在此建筑内，温度仅为0℃~-11℃，但能使所有的实体与液态水受到影响，同时也是该层级较温暖的建筑。
//
//蔚蓝之城虽然相较于其他地方物资较为丰富，但且流浪者不应当优先搜索物资，应当优先来到我们的基地，我们将会提供食物与保护流浪者安全。
//
//“蔚蓝之城”四周拥有农田与草地，面积约有六万平方千米。这两处地区都有大量的实体，圴为肢团与爬菌。农田中种植的大麦可食用，但要小心是否被爬菌感染过，感染过的大麦部分呈白色。草地内隔十几米分布着一个水潭，水潭内有可能是杏仁水或腰果水，请确认后再饮用。草地的中心有一个液氮坑，跳入坑中可以到达Level C-273。小心草地附近的一些工具房，内部可能有肢团在内埋伏。为流浪者安全起见，请各位流浪者避免在此地久留。
//
//- 收起
//第一食品厂在层级的各地区均有投放该标牌，以下取自警察厅门口较大的标牌：
//
//你好，来到Level C-790的流浪者
//不管你原来来自哪个层级，既然来到了Level C-790，你就要做好为这个层级贡献出一生的准备。
//我们是这个层级唯一的基地——第一食品厂基地
//
//请不要慌张，该层级有我们在非常安全！
//如果你需要帮助，请向前走500米，看见了吗？那个蓝色高塔下方是我们的基地。
//基地里面有食物，日常用品与宿舍，还有友善的基地成员。
//我们会提供武器来保护你的安全，你的安全由我们来保障！
//
//不用担心你在其他层级的任何事情，
//你原先在其他层级的那些破事将一笔勾销！
//你将在这个蔚蓝的层级度过一段无忧无虑的时光，
//不管你是来自M.E.G. 还是来自B.N.T.G 这里不存在歧视，暴力以及一切令人厌恶的事！
//不用担心你的家人及朋友，只要你加入了我们，你的家人与朋友会被我们在基地外的人员安置好，他们会被安置到一个快乐且安全的层级，比如说Level 48！
//
//不要试图在该层级其他的地方安家！
//这个层级会有你无法想象的巨量实体与极端寒冷！
//
//这个层级不存在正常的出口，你也不想被传送进零下196度的Level C-273中吧！
//
//唯一生存的希望就是来到我们基地，
//除了我们没有任何人能保护你！
//
//最近的WIFI名称：ahid4358
//WIFI密码：1145213
//第一食品厂电子邮箱：[数据删除]2
//
//记住，除了来到这里，你不可能活下去！
//
//无论什么时候 我们永远欢迎你
//——第一食品厂基地
//
//- 收起
//基地、前哨与社区
//第一食品厂基地
//我们会帮助与保护误入该层级的流浪者
//我们正式成员为120人
//我们不开放贸易
//流浪者加入基地需审核3
//有偿保护流浪者 在此地居住的流浪者需每日完成任务 例如收集物资
//入口与出口
//入口
//在Level C-272有小概率出现一片极蓝的海域,向内开去即可到达Level C-790
//在Level C-205发现并注视着一道亮蓝色的极光长达一分钟后，即可到达Level C-790
//在Level 420进入一个布满着蓝色冰块的洞穴，即可进入Level C-790
//有流浪者称自己在蓝色通道以未知的方式切入了该层级
//出口
//尝试攀登至蓝山顶部，有传言将会传送到Level 93
//[以上信息均为虚假，谣言散播者已被惩治]
//跳入草地中的液氮坑可以到达Level C-273
//[这条信息是真的，但是你不可能在-196℃的环境活过一分钟！]
//在蔚蓝之城中找到[数据删除]即可安全到达■■■
//- 验证通过
//恭喜你成为了第一食品厂的正式成员!
//该层级存在安全的出口，并且只对正式成员开放：该层级安全的出口位于草地上的红色工具房中，他将通向Level C-28，每月你可以出入一次。
//现在请在下列几个小队选择一个职位并且担任
//
//第一小队：需要一名副队长及一名运输员
//任务：前往化工厂采集蓝砂，火盐锭
//
//第二小队：需要一名副队长
//任务：收集层级秘钥
//
//第四小队：需要副队长
//任务：驱赶非法进驻该层级其他地区建立基地的流浪者
//
//第七小队：需要销售员
//任务：去 Level C-28销售在该层级搜集到的物资
//
//第八小队：需要审核员
//任务：审核该层级流浪者交上来的成员申请书
//
//第十小队：需要队长
//任务：维护寂静之森的木屋
//
//如果你不想再在继续待在这个层级，那么请你给第一食品厂带来大约价值1000升寂静汁液的收益，我们将会散布你死亡的消息，而你将会来到Level C-28，并且永远不用回来。
//若发现任何成员未进行可擅自离开该层级，在Level C-28出口会有第一食品厂的成员对该成员进行严惩！
//不允许任何人将该层级的出口告诉未成为正式成员的流浪者，如有发现将进行记忆消除并且严惩告密者！
//
//- 验证通过
//作者信息
//« Level C-789 | Level C-790 | Level C-791 »
//
//Footnotes
//1. 冷库内除外
//2. 本邮箱只对本层级内部开放
//3. 审核需考察流浪者的原身份，身体素质，知识储备，全部符合即可成为正式成员
package lvls17x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1790{}