//Level C-799
//评分: 
//+25
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
//安全
//稳定
//宁静
//Level C-799是后室C层群的第799层。关于Level C-799的传言曾流传过相当一段时间，许多流浪者都声称自己去过Level C-799。在流浪者Starset_M进入Level C-799后，首次证实了它的存在并于2020年5月4日对其信息做出了系统的整理归纳。
//
//描述
//流浪者对Level C-799整体的评价最常出现的一个词便是宁静。这并不局限于描述层级的环境在物理意义上的安静，而更多偏向于描述流浪者在这一层级内时的心情。流浪者在层级内时总是保持着莫名的积极心理，而他们离开Level C-799后，他们会出现短暂且轻微的失落感，并在一段时间里对Level C-799产生强烈的发自内心深处的柔软的依恋和怀念，这种情感在减弱后将在之后很长时间内残存在流浪者的意识中。这可以被认为是此层级所特有的一种心理效应。
//
//Level C-799的环境看起来像是一片被温带落叶植被覆盖的丘陵地区，不存在季节更替和天气变化，长期保持着晴朗的天气和令人舒适的气温与湿度。虽然层级看起来似乎无限向远方延伸，但其实际情况无法被确认或进行测量，因为任何向周围探索的行为都只会让流浪者离开这一层级。
//
//当流浪者进入Level C-799时，他们会发现自己正在一米宽的石板山道上行进，夕阳温和的光芒透过树叶倾注下来，通过丁达尔效应产生略带朦胧的光路，斑驳地撒在流浪者脚下的道路上。值得一提的是，层级内的以植被为主的很多事物的结构，在流浪者离开层级后对它们的描述都是「无意义的」，「模糊的」。但是流浪者在层级内无法感受到，或者说无意识地忽略了那些结构。
//
//流浪者沿着道路继续行进直到山顶，可以看到一处庭院和其中的一座屋子，屋里住着名为露娜的人类实体。从山顶看其他的山丘可以看见流浪者脚下的山路通向远方，这条道路是本层级主要的出口。
//
//Level C-799最为著名的便是它夜晚的星空。流浪者在这里观测到的星空与在前厅地球南半球上观测到的几乎无异，但无法确认到太阳系其他行星的存在1。在流浪者的回忆中，尽管他们对这一层级的很多事物的印象都偏模糊，但是唯独对星空的记忆异常明晰，流浪者认为这里的星空比前厅的更加的清晰美丽，他们会使用「震撼感」甚至于「压迫感」来描述这满天星河。事实上，这一层级的星空仅仅是被流浪者注视着就能对他们产生镇静的效果
//
//399starset
//Starset_M在Level C-799 里所摄下的一幅星空照片。照片已经过后期处理
//
//层级内的时间似乎并不正常，层级在流浪者进入时表现为傍晚时分，之后时间将以与前厅几乎无异的速度流逝直到夜晚，如果流浪者始终不进行睡眠，他们将会感觉夜晚是无限长的，第二天似乎永远不会到来。目前尚不清楚是层级本身的性质还是流浪者的时间认知受到了扭曲。
//
//露娜
//露娜是本层级唯一存在的实体。外表与普通人类少女无异。在流浪者的描述中，露娜对他们非常友好，会邀请他们在自己的家里留宿休息一晚。通常来说，流浪者不会拒绝露娜的好意，我们当然也不建议流浪者对此做出拒绝。若流浪者接受留宿，他们会受到热情的招待。在流浪者准备睡觉之前，露娜会请流浪者陪她到庭院中观星，并与他们进行一些闲聊。露娜通常会让流浪者分享自己的旅行经历。这些行为对流浪者的身心都有明显的放松作用，流浪者可以在这里进行确实的休息。
//
//从目前在其他流浪者处得到的信息来看，露娜在与流浪者的对话中有时会间接地展现出她对后室的一些层级似乎存在一定了解，但流浪者无法和她进行与之有关的话题。在层级中一切关于我们所理解的「后室」的逻辑都会以某种方式被扭曲，流浪者自身并不会意识到这一点。
//
//附件
//以下是2020年5月1日对Starset_M的采访记录。
//
//- 正在加载中，请稍候……
//采访者：Huyyy
//被采访者：Starset_M
//
//<开始记录>
//
//采访者：你好，Starset_M……不过就我个人来说，好久不见。
//
//Starset_M：是啊，没想到竟然是你来采访我。
//
//采访者：这不也挺好的吗？上次在Level 11见面后你就一直没有消息了，这次是个机会，我之后还有些个人的事情要找你呢。
//
//Starset_M：你是指你冒用我的邮箱这件事？
//
//采访者：不不不求你别提这个……（清嗓子）我们正式开始采访吧。当然，是关于你最近进入的那个层级。
//
//Starset_M：等会儿。先确认一下，你之后把这个采访发给我，然后这篇层级的文档之后就交给我来写可以吧？
//
//采访者：没问题没问题，现在我们还是先开始采访吧。首先请你描述一下你是怎么进入那个层级的。
//
//Starset_M：这我不太清楚。我记得我当时是在意识到的时候就已经身处那里了。
//
//采访者：你进入前在干什么？
//
//Starset_M：进行一次长途旅行，具体请容我保密。哦对了，我在进入那里之前原本以为我会进入Level 399来着，不过我最后没有睡着，可能是这个原因。
//
//采访者：好吧……那请描述一下层级的环境。
//
//Starset_M：当我进入那里时正好是黄昏，我正走在一条山路上。我向后方看去，视野所及是一片广阔的丘陵地带，山丘的坡度比较平缓，可以看见我脚下的小路一直不断地通向远方。我继续沿着道路向着山顶行进，最终我在山顶处发现了一座房子。
//
//采访者：房子？那个房子里有实体吗？
//
//Starset_M：嗯。不过首先我要说的是，这一层级可以说非常安全，并不需要担心来自实体的危害。要说那座房子的话，这也是我要说的重点。那里确实住着一位无害的实体，她看起来与我们人类没有区别，是一位自称名为露娜的少女。我认为我得详细地把我当时的经历重现给你，听好了，这个层级有一个异常的属性……
//
//采访者：等等，你会说很久吗？
//
//Starset_M：没错。如果你没有那么多时间的话，我可以把这些写下来，之后再交给你。
//
//采访者：可以，拜托了。你现在只需要简单地说一下就可以了。
//
//Starset_M：简单说的话就是——露娜是一个完全无害的实体，她很友好，她看出了我当时很累并收留了我一晚。晚上我们在庭院里一起看星星，对，这个层级的星空真的很美，即使在前室，要看到那么震撼的景色也是不容易的。
//
//采访者：星空是吗，那……
//
//Starset_M：我知道你想问什么，事实上Level 24的确能被我观测到，但是我好像没看到金星，通过南十字星可以确认是南半球的星空。还有一点，我感觉夜晚有些长……不过可能也只是我的错觉。毕竟我很久没有体会过那样的感觉了，一种在旅行中才能体会到的感觉……你知道的，我曾在前厅时也是个喜欢旅行的人，旅行中路过某座城市时总会情不自禁地想着，如果自己是住在这里的人会过着怎样的生活之类的。但或许我并不会想去真正地去定居，正是因为我是这座城市的过客，正是因为自己的目的地不是这里，去想象这些才会有那种难以言喻的感觉，应该叫隔离感吧……让人意识到自己是一个旅者的隔离感，这种感觉其实并不坏，不知道你是否能理解……啊抱歉，我好像说远了。
//
//采访者：没事。你在这一层里体会到的也是这种感觉吗？
//
//Starset_M：差不多吧。话说你觉得呢，在旅行途中的某个晚上，吹着凉快的微风，端着一杯热乎乎的杏仁水欣赏着美丽的星空，不觉得很有氛围嘛？
//
//采访者：是啊，听起来就不错。那么你是怎么离开这一层的？
//
//Starset_M：就那么离开的。第二天我收拾好行李向露娜告别，我尝试问她知不知道怎么去Level C-48。很奇怪的是她竟然给我详细说明了线路，而且就我的印象来说，她的回答像是在前厅中正常旅行的方法一样而不是切出。明明我现在回想起她的回答是混乱的，毫无逻辑的，但是当时我确实听懂了，这简直就像……像做梦的感觉一样。对，这个层级给我的就是这种像一场梦一样，模糊，混乱，但是又莫名令人安心，怀念的感觉。
//
//采访者：好了，这样就可以了。谢谢你提供的信息。
//
//<记录结束>
//
//以下是Starset_M尝试还原出层级的异常属性的文件
//
//- 正在加载中，请稍候……
//与露娜的交互记录
//作者：Starset_M
//
//「那个……你睡了吗？」
//
//突然的敲门声打断了我的思考。我从床上站起来，走向门前。
//
//「怎么了，露娜？」
//
//我向在门口站着的少女问到。
//
//「你现在有空吗？要睡了吗？」
//
//「有什么事吗？」
//
//「没什么啦，就是想……你现在有心情去外面看看星星吗？这里看到的星空很美哦」
//
//星星吗？说起来，我也好久没看到过了。
//
//我下意识地环视了一下房间，果然没有窗户看不到外面的景象啊。
//
//……什么窗户？我在想什么呢？
//
//总之去吧，反正没有拒绝的理由。
//
//「好啊，我也想去看看」
//
//听到我这么回答，露娜似乎很开心的样子。
//
//「那你可以先去外面等着我，我很快来——哦，晚上外面有点冷，记得多穿点！」
//
//于是我披上外套走出室外。凉风吹在我的脸上，我抬头望向天空顶端——但实际上根本没必要那么做。
//
//因为散发着微光的星星本就洒满了整个深蓝的夜空，在一道银河和其他星云的点缀下，整个天穹看起来就像一副画卷包裹着地面。
//
//「好美啊……」
//
//看见那震撼的景色，我也只能说出这样的感叹了。
//
//「很美对吧？」
//
//在我看得入迷的时候，露娜端着两个马克杯走到我身边。
//
//「确实。像这样的星空我以前几乎没看到过，银河看起来离我们好近，甚至可以说具有压迫感了」
//
//当然我还能看到南十字星和麦哲伦星云，这毫无疑问是南半球才有的星空。
//
//「要喝点热的吗？」
//
//露娜将一个马克杯递给我，里面装满了冒着热气的杏仁水。
//
//「啊，谢谢」
//
//我接过杯子喝了一口，暖意顿时扩散至全身。
//
//「说起来，真是麻烦你收我留宿了啊」
//
//「不用道谢啦，是我自己想这么做的。毕竟你看起来真的很累嘛」
//
//露娜温柔地对我笑了笑。
//
//「嗯，所以我才想说谢谢你啊。让我能在长途旅行中得到这样的休息」
//
//「你是在旅行吗？」
//
//「是啊，我喜欢旅行，这是我的兴趣所在」
//
//「那，能和我讲讲你旅行过的地方吗？」
//
//看起来露娜似乎对这个很感兴趣，证据就是她现在看着我的期待的眼神。
//
//「我想想啊，我去过的地方很多」
//
//「那你去过有雪的地方吗？」
//
//「去过是去过啦，比如我去过一个北方的小镇……但是那里环境太危险了，我遇到暴风雪时都以为这就是自己的死亡终局了呢。还有另一个地方，是一片冰湖，那里冷得让人都必须穿上防护装备了」
//
//「不会吧，有雪的地方都那么危险吗？」
//
//她看起来有些惊讶，我不禁笑了笑。
//
//「也不完全是，雪景当然是很美的，就像我曾经听过的一首未完成的童话所描述的那样。话说，露娜，你喜欢雪吗？」
//
//「很喜欢哦，我一直想有一天能看到真正的雪呢」
//
//我看向露娜，她的眼里倒映着细碎的星光。
//
//「我说，既然这样的话，你想不想和我一起旅行？」
//
//我心血来潮地这么问她。而她对此只是无奈地笑着摇摇头，将视线投向庭院中那些我叫不出名字的花。
//
//「我……」
//
//「你不能离开吗，是有什么原因吗？」
//
//尽管我已经猜到了她应该有什么心事，但还是忍不住想问问。
//
//「我……在等一个人」
//
//「等人……吗？」
//
//带着凉意的微风吹在我们的脸上。
//
//「一个……可能回不来的故人罢了」
//
//「是嘛，抱歉」
//
//「嗯……你也知道，这个世界没有我们想象的那么和平2呢……」
//
//看着露娜她略带落寞的眼神，我识趣地不再进行这个话题。
//
//我只是一个过客，不应该介入他人本来的生活——不禁意识到了这点。
//
//第二天早上，我收拾起行囊准备出发。3
//
//「等我到了北方，再想办法给你带点雪过来怎么样？」
//
//对我临行时半开玩笑的话，她只是一笑置之。
//
//我看着她沉默了一会儿，然后转头向着远方的道路迈开步子。
//
//「呐，如果……如果███彗星███的话，我████！」
//
//我并没有听清她最后对我喊的那句话，也没有停下脚步。
//
//我是一个过客，本应如此。没有理由在这里停留。
//
//基地、前哨和社区
//目前本层级没有已知的前哨站或社区。
//
//入口与出口
//入口
//Level C-799暂时还没有一个准确的进入方式，但可以知道进入方式与Level 399类似。进入此层级的流浪者有些相似之处，例如都正在单独行动，都正在层级间在做有目的的长途跋涉，都处于疲劳和轻微饥饿的状态等。但并非所有处于这种状态的流浪者都一定会进入Level C-799。
//出口
//通常来说，流浪者休整一晚后第二天就应做好准备继续踏上旅途。在这一层级长期停留是没有意义的。沿着道路远行就可以到达流浪者想去的目的地。
//顺着可能会出现的草径走进山里将到达Level 9或Level 10中的某条小路上。但这种方法是非常不推荐的。
//据说有一位流浪者通过另外一种未知的方式进入了Level 49，但这未经确认，因为那位流浪者在之后完全失联了。不建议 数据缺失
//作者信息
//« Level C-798 | Level C-799 | Level C-800 »
//
//Footnotes
//1. 这一层级似乎能看见一个地球上无法观测的周期性彗星，但实际上没有任何人确实地观测到过
//2. 这里只是我的主观推测-S
//3. 我关于询问Level C-48相关的记忆实在是太模糊了，很难写出来，故略过-S
package lvls17x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1799{}