//Level C-888
//评分: 
//+17
//+
//–
//X
// 
//
//生存难度：
//等级 2
//
//安全
//不稳定
//少量实体
//Level C-888是后室C层群的第888层。
//
//photo-1611895608340-6d2e3e80f94a?ixlib=rb-1.2.1&dl=galen-crout-nA1mX8Tzptw-unsplash.jpg&q=80&fmt=jpg&crop=entropy&cs=tinysrgb
//在图书馆内拍摄的图片。
//
//描述
//Level C-888被认为是一座漫无边际的图书馆，其形状类似于一个无限符号。该层的楼层数同上述般被也认为是无限的。
//
//此层没有昼夜区分，且流浪者无法到达处图书馆以外的区域。当流浪者首次来到该层级时会来到此层级的中心处，流浪者可以通过随机发放的馆内地图来选择去自己想去的图书分区。值得一提的是，该地图由不可燃的纸质材料制成，背面印有一个西方衔尾蛇的图案与"永恒图书馆"的标志。流浪者可以选择爬楼梯或者搭乘馆内电梯来探索每一层，每层层高约为3.14米（大致测量），每隔15米设置有读书角，每层书架共有9层，并以一种类似于莫比乌斯环的形状摆放着，摆放在上面的书籍类型繁多，几乎涵盖了前厅市面上所有的书籍类型，你甚至可以在这里找到一些流浪者的自传。
//
//photo-1581696303366-3437bcd5fc15?ixlib=rb-1.2.1&dl=kirill--IKW5qBvZtY-unsplash.jpg&q=80&fmt=jpg&crop=entropy&cs=tinysrgb
//楼梯上拍摄的图书馆，还可以看到正在阅读的无面灵。
//
//这些书籍被证实在阅读时不会产生任何的不良影响，但有的流浪者声称在阅读时感觉周围的时间被似乎被放慢了，在此同时自己的阅读速度将会变得飞快，思维也会变得异常的活跃，且不愿结束阅读。流浪者有时会碰到少量正在阅读无面灵，擅自打扰他们并不是一个明智的选择。
//
//有的流浪者称在探索的过程中发现了一些漂浮在空中的书，这些书表现为黑色封面，里面为羊皮纸，并用流浪者看不懂的文字记载着某种研究记录，触摸这些文字会有轻微灼烧感。一旦流浪者阅读这本书籍后，会有永恒之人的成员主动出现在流浪者面前，并邀请流浪者跟他们走，目前这些流浪者在去后尚未归来，具体原因未知。有人推测说他们已成为了永恒之人的成员，但尚未得到证实。
//
//该层以一种白色金属物质作为其支撑结构，M.E.G.经过探测发现该类金属具有如金刚石般的硬度与铱般的耐腐性，这种特性远超于目前发现的任何合金。M.E.G.将持续研究此种材料。
//
//该层有许多的区域，为了避免赘述，将在下方列出几个该层中的重要区域：
//
//读书角
//该区域会每隔15米的出现在每一层中。此区域由几张木制茶色桌椅与一些矮桌组成，每张桌子上都摆放着形如克莱因瓶的花瓶，且插着会散发淡淡幽香的白玫瑰。流浪者可以选择在该区域内进行阅读，阅读时流浪者会感到如上文提到的时间放慢感。流浪者在阅读完后可以直接将书籍放在矮桌上，之后便会有无面灵前来拿去阅读。目前该区域已被用作为书虫俱乐部的聚集地。
//
//888号图书区
//该区域位于本层中的第888层，此区域的摆放经过M.E.G.研究后发现其类似于一个太极八卦阵，流浪者在进入此区域前会发现一个张订在书架上的宣纸，其上面的内容用隶书写着：
//
//“九为数之极，取六爻三三衍生之数，易有云：一生二，二生三，三生万物。又有所谓太极生两仪，两仪生四相，四相生八卦，八卦而变六十四爻，从此周而复始变化无穷。”
//
//有流浪者称曾在这多次目击到永恒之人的成员，但并未得到证实。
//
//馆内电梯无法来到此区域，目前已知的方法是通过彭罗斯阶梯来到这。
//
//photo-1635404617144-8e262a622e41?ixlib=rb-1.2.1&dl=cdd20-2sGAHzj7c7Q-unsplash.jpg&q=80&fmt=jpg&crop=entropy&cs=tinysrgb
//彭罗斯阶梯概念图，并非该层真实照片。
//
//彭罗斯阶梯
//该区域因其类似于几何学中的“彭罗斯阶梯”悖论而得名，进入方法为在登上中心区域北朝南88°角的一处楼梯并向上攀爬88层即可进入此区域。
//
//流浪者进入后会发现自己眼前的楼梯变成了一个一个始终向上或向下但却走不到头的阶梯，在此阶梯上永远无法找到最高的一点或者最低的一点，在此期间流浪者虽然可以看到在外的其他人，但对方却无法看到自己。
//
//唯一离开此区域的方法则是不回头并倒退88步，即可到达第887层。只有少数人通过了这个阶梯并来到了图书馆的第888层。
//
//事件
//该层中有时会随机发生名为“重组”的事件，当该事件发生，此层级会以碎片化的形式分裂成无数个时间点，流浪者会发现自己身边的事物会突然加快或者减慢，流浪者本人会突然因为时间分裂的而导致身体负荷过重而晕过去。并最终随机在图书馆中的某一层中醒来。
//
//只有正处于读书状态或者彭罗斯阶梯中的人才不会受到影响，M.E.G.还发现该层在发生“重组”事件时所有的入口都会失效，似乎这一层凭空消失了般，唯有在事件过后入口才会重新出现。M.E.G.并且还探测到在事件发生时该层的时空状态将在一维到四维空间中转变，目前暂未发现这些转别对意思不清的流浪者产生了什么影响。
//
//采访
//德斯博士在本层探索时发现了上文所提到的漂浮在空中的书籍，在阅读它们后跟随着永恒之人的成员来到一处尚未被发现的房间，并见到了永恒之人的首领——永恒之主，以下是他的采访记录。
//
//采访编号：888
//采访者 ：德斯博士
//被采访者： 永恒之主
//
//永恒之主：欢迎来到我的面前，天选之人。
//
//德斯博士： 我能问您一些问题吗？
//
//永恒之主：我接受你的请求。
//
//德斯博士： 首先是我的第一个问题，为何称呼我为天选之人？
//
//永恒之主：你难道还不明白吗？世界上任何物质都是无限的，人也是一样。只有符合永恒的条件，才能通过我的考验，这场考验很简单，也就是阅读那些空中之书。但这也很难，因为符合条件的人很少，而你，就是那万众之一的佼佼者，你就是那天选之人。
//
//德斯博士：嗯….那么，请问您如何看待无限与永恒？
//
//永恒之主大笑了起来。
//
//永恒之主：你是怎么认为的呢？
//
//德斯博士： 无限，可以认为是不可全知的，不可精确测量的。每一棵树，每一滴水，每一颗沙，每一个原子，每一个人心，都是无限的。事物发展的根本在于内部矛盾，事物发展的条件在于外部矛盾。任何事物都是有内部矛盾的，任何事物都可以再分的。即使一个原子，原子核和核外电子之间也有无限的空间。但，就像那完美的圆一样，π作为一个无理数，却是在一个循环链接的圆上出现，在人类所能明确知道的物质和概念里，拥有无限的概念的，只有循环这一说法。我感觉，这个答案便是真理。
//
//永恒之主再次大笑了起来。
//
//永恒之主：看来你的觉悟还是不高啊，这后室这个人间不见之地狱里，死死生生，就如同一个循环。第一个意外进入后室的人死了，就会有第二个，第三个……这样，不断的死生构成了一个循环…..
//
//说着，永恒之主摘下了兜帽，露出了他深陷在眼窝里的眼睛与他布满大大小小无数个筋疙瘩，被一条条高高鼓起的血管串连着的脸。
//
//永恒之主：生命永恒，就是真正的永恒！难道你还不明白吗？无限，循环，永生！
//
//永恒之主：接受我的力量吧！成为我们永恒之人的一员！那些曾经来到这的人，无一都获得了永生的力量…….来吧！成为我们的一员！
//
//四周风尘四起，永恒之主死死地抓住了德斯博士的肩膀。
//
//永恒之主：无限，循环，永生！
//
//德斯博士看到了永恒之主身后的那本漂浮着的书，连忙挣脱开永恒之主，朝那本书扑去。
//
//永恒之主：你会后悔的。
//
//德斯博士扑向那本书后，整个房间的灯光忽然熄灭，只剩下眼前的写着EXIT的门。
//
//德斯博士奋力朝那扇门跑去，进去后，他来到了Level C-1。
//
//记录结束
//
//永恒？
//基地、前哨与社区
//书虫俱乐部
//人数约为10人。
//经常在图书馆中的读书角内阅读书籍。
//开放交易并接纳新成员，要想成为成员必须经过智商测试。
//永恒之人
//人数未知。
//自称是图书馆的主人。
//身穿红黑色长袍，且其脸部被兜帽遮盖，无法被观察。
//入口与出口
//入口
//在后室C层群中找到一本写着"永恒"二字的古书，阅读它即可来到这里。
//在Level 972中找到一本画着无限符号的古书，你也会来到这里。
//出口
//从图书馆的大门出去可以来到Level 11。
//在阅读任意一本有关死亡的书，读完后你可以来到Level 998。
//借助那本书，来到Level C-1。
//你要想好了。
//离开这，就会失去永生的机会！
package lvls18x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1888{}