//Level C-815
//评分: 
//+16
//+
//–
//X
//“梦之所以美丽，是因为它不可及。步入仙境，但它分崩离析。”
// 
//
//生存难度：
//等级 0
//
//令人失望的安全
//令人失望的稳定
//令人失望的实体绝迹
//“这里残酷地摧残了我心中的家园。”
//%E2%80%9D%E7%B2%89%E9%A5%B0%E4%B9%8B%E4%B8%8B%E2%80%9C
//一名流浪者拍摄的Level C-815。
//
//Level C-815是后室C层群的第815层。
//
//描述：
//Level C-815是一片处在天蓝色的天空下的白色平地，无边无际。地面的质感类似ABS树脂1，但与之不同的是构成地面的这种材料非常坚固，无法以任何已知的物理手段破坏 。Level C-815内存在日夜更替，周期为24小时。除此之外，据大量提交报告可知，该层级最多只能存在一名人员，在Level C-815存在人员时无法以任何方式切入此层级。
//
//值得注意的时，进入此层级的人员会发现其心中最理想的可作为住所的建筑正处于其身后。建筑的完整程度取决于该人员心中对其设计或要求的繁简，并且异常稳定，哪怕其结构极端不合理。
//进入Level C-815生成的建筑的人员会发现，其内部的内饰布局也会完美地符合他们的心意。经考察，已证明这些建筑完全稳定，可以居住。
//然而随着时间推进，此建筑的弊端会以各种无害的方式不断放大。包括但不限于：
//
//%E2%80%9D%E7%B2%89%E9%A5%B0%E4%B9%8B%E4%B8%8B%E2%80%9C%E9%82%A3%E7%B3%9F%E7%B3%95%E7%9A%84%E5%9C%B0%E9%9D%A2
//一张Level C-815的凌乱地面的照片。
//
//
//
//
//
//·孤独感被放大
//·幽暗闭感被放大
//·内饰老化速度异常迅速
//·大量繁殖的霉斑
//·因不明原因而凌乱的地板
//
//
//
//
//%E2%80%9D%E7%B2%89%E9%A5%B0%E4%B9%8B%E4%B8%8B%E2%80%9C%E9%82%A3%E4%B8%8D%E5%90%88%E5%B8%B8%E7%90%86%E7%9A%84%E6%80%AA%E5%BC%82%E5%86%B0%E7%AE%B1
//Level C-815建筑内那像贴图一样的“冰箱”。
//
//尽管不同人心中对完美内饰设计的定义不同，但所有的报告中都出现了一台“冰箱”——无论在此层级的人员内心的那个完美住所是否配置了冰箱，Level C-815的建筑内部必定会有一台“冰箱”。其为一个580mm×1722mm的长方形——因为它没有厚度，以类似游戏贴图的方式附着在任意平面上。“冰箱”于进入Level C-815的人员首次有进食/饮水欲望时出现在其可以注意到的位置并自动打开，提供一份餐食，在餐食被取出后关闭，于次日同时刻再次打开并重新提供一份餐食。尽管“冰箱”总是处于制冷状态，但餐食总是以着新鲜出炉的状态出现。其中的食物和饮品的营养足以满足一个正常成年男性一天所需。这些食物和饮品均为前厅出现的种类，口味取决于此层级中的人员的喜好。2“冰箱”提供的食物中从未出现过后室中特有的食物。这意味着，该层级中没有杏仁水，只有正常的水——或者说，就是”水“。然而，同Level C-815生成的恼人建筑一样，“冰箱”提供的食物的品质也会随着时间推移越来越差，虽然已被证实对人体无害且营养成分没有减少，但其口味与样貌令人难以下咽。承载食物的容器也会出现大量意义不明的字迹，但均不属实，故不必参考。
//“冰箱”生成的食物和饮品无法被带出Level C-815。
//
//基地，前哨与社区
//本层无已知社区或前哨。因为梦碎于此。
//
//附加内容：
//- 不可思议
//语音日志记录
//记录者：白任—— M.E.G. —— 探员
//记录时间：2017年10月4日
//
//白色的材质类似树脂的地面，失真的蓝色天空…….哦，好的，看来我成功抵达Level C-815了。然后就应该生成我理想的住处了…….老天，这房子什么时候出现的？等等，它很眼熟……这，这是我以前在前厅时一直想买的那栋别墅？
//
//（Level C-815回荡着奔跑时发出脚步声。）
//
//嗯，两层楼，有地下室。但是貌似没有院子，应该是我对那栋别墅的记忆已经模糊的原因。总之……先进去看看吧。
//
//（门没锁，传来了推门声。）
//
//虽说有心理准备，但……（啜泣声），这里的内饰！白桦木地板，灰白的吉他和谱架，还有温室里雪白的风信子……我在天堂吗？
//
//（探员白任调整了情绪，继续对此建筑进行探索。）
//
//（小声的）天，这些细节……墙纸、家具……和报告所述一样，这里的确会生成一栋“最完美的住处”。以及……那台糟糕的冰箱。真的，这东西这么不协调地黏在墙上，这是一种亵渎！不管怎样，先等它打开再进行进一步的记录吧。
//
//（“冰箱”的门打开了）
//
//哦，这是……一份麻辣火锅，一份凉粉，以及……一杯没有任何气味的冰水？看来的确是普通的水。不管怎么样，一顿佳肴作为来到这个层级的第一餐还是鼓舞人心的。那，且让我尝一尝……
//
//（咀嚼声）
//
//味道还是很好的。
//[记录结束]
//
//- 不可思议
//- 不太对头
//语音日志记录
//记录者：白任—— M.E.G. —— 探员
//记录时间：2017年10月7日
//
//谢天谢地，没有任何损坏。我是白任，今天继续做关于Level C -815的报告。
//
//（床板晃动导致其木质结构摩擦，产生了恼人的噪音）
//
//真不妙，这床从昨天半夜就开始吵人了。算了，还是先下楼吧。
//嗯？这地怎就擦不干净了？这么多灰？看来，本层级的一些恼人的性质已经有所显露了，这真的很烦。不过，白色系的房子和内饰恐怕的确有这些问题吧。但这些不知何处而来的污渍到处都有，尽管我很肯定我把用过的餐具都洗净了，这就很不合常理了……如同报告所述，尽管门外Level C-815的地面和天空没有任何变化，但我的确无法离开我身处的建筑了。罢了，先把今天的餐食吃了再进行清扫和记录吧。
//
//（“冰箱”的门打开了）
//
//嗯，麻辣香锅，米饭，还有一杯可乐，看来目前为止餐食还是很好的。
//
//（然而接下来长达30分钟的进食声夹杂着不少干呕声）
//
//收回前言。没有气泡的可乐，和糖水别无二致；不麻不辣但甜到令人眉头紧锁的麻辣香锅，仿佛是这个层级开的恶毒的玩笑……等等，这盘底写着什么？“多加些糖才好玩=)”3
//可恶，这些家伙真的无处不在吗……（咒骂）
//
//（长叹）
//
//算了。再过4天就可以走了。把这些都记录下来吧。
//[记录结束]
//
//- 不太对头
//- 不去为妙
//语音日志记录
//记录者：白任—— M.E.G. —— 探员
//记录时间：2017年10月11日
//
//我是白任，终于可以走了。Level C-815深深地伤害了我。
//
//（走下楼梯的脚步声，楼梯发出不堪重负的咯吱声）
//
//上次报告后，这接下来的几天真是糟糕到不可名状了，无论怎么清扫或整理也无法使它有所改观。这里挑几个还能令人接受的讲一讲。
//所有的白色家具和内饰都泛着老化的黄斑；木质的地板要么开裂要么发霉；温室里的那些风信子的球茎都腐烂了；那把灰白色的吉他永远也较不准音，因为它受潮变形了。然后还有多到常人无法接受的程度的糟糕之处，说出来都是种折磨……哎呦（肉体与腐烂地板撞击发出的巨响），老天，这里的地板甚至烂没了。或许进入这里就是种错误。
//
//除此之外（吱吱呀呀的地板声），这“冰箱”里的食物也是愈发地表现得像一堆恶毒的玩笑。“冰箱”仿佛知道了我对那些天杀的敌对实体有多么不满，就开始尽它最大的努力折磨我。10月7日之后的食物——如果你还愿意这么叫它们的话，简直就是一场又一场炼狱。8日是活着的蛆虫配辣椒酱，盘底写的“疏通肠道，恢复记忆”，味道好似那黄色潮湿储藏室地毯里的胸膜液掺了辣椒味的香精；9日是腐烂的肉加辣椒碎，盘底写的是“天然无公害的悲尸肉”，这令我心理上极度不适，所以我只是把它取出来搁在一边。10日还好，只是一盘看着还不错的麻辣小龙虾，但看到那盘底没被小龙虾挡住的部分有个“∴）”我便意识到我处境的危险，也没敢去动它，把它和”悲尸肉“一起放在了餐桌上。除此之外，每天的饮品只有一杯味道令人作呕的水，这水的滋味如同现在这栋糟糕的房子里弥漫的粉尘和木屑的味道。等等，这震动？啊啊啊啊啊……
//
//（积水的地下室的承重柱被腐蚀得残破不堪，终于分崩离析。整个建筑塌方了）
//
//不！那龙虾掉下来了！我还年轻！不想就这么去909那鬼地方被凌迟啊！！！
//
//（盘子落在地上的脆响）
//
//嗯？“别太紧张，只是个小玩笑∴” ？ “小玩笑”？
//
//（沉默了3分钟，然后传来了你所能想到的最糟糕的咒骂，持续了1个小时，礼貌的问候了Level C-815的一切，以及很多别的东西）
//
//（声音沙哑的）好了，受够了，该记录的也记录了，该测试的也测试了，这鬼地方的废墟我一刻也呆不下去了……哎呦！
//
//（白任的头被“冰箱”不合时宜打开的门打中了，这让他晕了过去，恰好一头扎进了“冰箱”）
//[记录结束]
//
//- 不去为妙
//
//备注：后来该探员醒来后发现自己躺在自己于Level 11的住处的地板上时，他激动的如同教皇一样跪在地上亲吻了那里的地板。
//尽管其语音日志有对M.E.G.的诋毁以及大量不良内容，但鉴于其情况特殊，监督者团队在其进行了道歉后不给予处分决定并批准了其在Level 27一天的假期。4探员白任的语音日志经处理后被存入Level C-815。
//入口和出口：
//入口
//M.E.G.强烈建议不要无故进入此层级。
//在Level 11或Level C-117这类城市层级时怀着强烈的思乡之情切出有极小概率进入Level C-815。
//
//出口
//进入本层级生成的建筑后，你将无法以任何方式离开该建筑。在其中度过一周后，”冰箱“会一直保持开启的状态且不再提供任何餐食。此时进入冰箱会使你昏迷，醒来时你会发现自己身处于Level 11
//
//“不管怎么样，有些梦，让它永远只是个梦吧。”
//写这文章的人是...
//« Level C-814 | Level C-815 | Level C-816 »
//
//Footnotes
//1. 乐高积木的材料。
//2. 若是出生于后室的人，依然会根据其喜好提供这些前厅的食物和饮品。
//3. 然而本层级没有任何实体 。
//4. 万幸当时他心中的理想住处没有温泉。
package lvls18x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1815{}