//Level C-899
//评分: 
//+34
//+
//–
//X
// 
//
//生存难度：
//
//等级 E
//
//不安全
//环境敌对
//非实体威胁
//Level C-899是后室C层群的第899层。
//
//描述
//W6Ha8P3DQNLdo2f.jpg
//一张于Level C-899中拍摄的照片。
//
//从外观上来看，Level C-899是一条有着喀斯特地貌特征的非线性峡谷，向着某一弧度向外无限延伸。峡谷通常宽约2～10m，深度在20～50m之间徘徊，其表面上覆盖着一层光滑的细沙，因此，徒手从峡谷中爬上去的行为基本是无法完成的。
//
//Level C-899的主要岩石类型为光滑的黄褐色结晶沉积岩，其检测出含有大量的铜、铁及少量的镍等矿元素。在其中可以发现含有大量的未知小型动物化石，已证实为不属于前厅中的任何生物及其亚种的遗骸，但值得一提的是，目前尚未在该层级中发现存在任何的实体，因此其来源有待考证。
//
//Level C-899中没有明显的昼夜循环，天空中无法观测到任何太阳的影像，尽管如此，流浪者依旧能够感受到从上方传来的光源。Level C-899的气温总是恒定的，在29～32°C之间徘徊。Wi-Fi覆盖了整个峡谷，但信号强度始终不大稳定。
//
//静音草丛
//切入该层级总是会在一片含有积水的草丛中醒来，这是一种称为“静音草”的黄绿色的草本植物，形似于前厅中一种名为禾草的植物的亚种，但经研究发现，静音草与其无任何的关系。静音草的根茎处富含大量的水分，可食用，味微甜，可作为Level C-899中的食物来源。该植物广泛的分布在该层级之中，通常以成片形式出现。异常的是，在其上方的流浪者将无法产生任何的声音，包括：骨头摩擦声、谈话声、投掷物体所发出的声音等，其原因未知。
//
//无声岩洞
//是Level C-899中最安全的地方，稀有的分布在该层级中。其外观为一个潮湿阴暗的小型岩洞，与峡谷的景象截然不同。深度大约5～10m，直径通常在4m左右，底部总是堆积着一摊冰冷的杏仁水，不可饮用。在其岩壁上均匀的覆盖一种类似于多头绒泡菌的黏菌，散发着微弱的褐黄色荧光，能够吸收声音并以此为养料，原理不明，暂未知是否能将其带出Level C-899培育。
//
//尖啸效应
//在Level C-899中产生的任何响度达到20dB1及以上的声音（非自然声音）都会产生尖啸效应，此效应异常具体表现为：声音无法自然消散，且声波在经由石壁反射后，其响度会以一个未知的比例呈倍数增幅，并在经一定的反射作用后，会将其转化为含有巨大能量的强次声波。在其强次声环境中，人体的平衡器官将遭到重创，产生晕眩、旋转感等症状，严重的甚至会导致流浪者因内脏破裂出血而亡。
//
//理论上该效应产生影响的声波会无限的持续下去，但在其达到一定的阈值后将快速消散，此过程通常只会持续40～60s左右。
//
//因此由综上所述，流浪者在此穿行中应当严格遵守以下准则：
//
//不要产生任何过大的响声。
//优先选择在静音草丛中行走。
//随时注意无声岩洞的位置。
//如误导致尖啸效应发生，请第一时间躲进无声岩洞之中。
//基地、前哨与社区
//目前该层级中未存在过任何的基地、社区或前哨，这与其异常效应有关。
//入口与出口
//入口
//在Level 46和Level 169中可以找到一个峡谷，位置通常固定，下至底部便可来到这里。
//在Level C-45中进入一个结晶沉积岩洞，就可以来到这里。
//出口
//在无声岩洞中切出，就会来到Level C-98或Level C-20。
//在静音草丛中待20min后有小概率会来到Level 10。
//作者信息
//« Level C-898 | Level C-899 | Level C-900 »
//
//脚注
//1. 即分贝
package lvls18x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1899{}