//Level C-800
//评分: 
//+42
//+
//–
//X
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//Level C-800为后室C层群的第800层。
//
//描述
//IMG_20221202_021706.jpg
//Level C-800的一张照片。
//
//Level C-800的环境类似于一家午夜时分的空旷商场，拥有明亮的照明条件和完整的装修。当前并没有流浪者触及到Level C-800的边界，因此无法测定其面积。相较于其他层级，处于这一层级时流浪者会更容易注意到环境的空旷与人类踪迹的匮乏。
//
//与Level 0相似，Level C-800具有非线性空间的性质，也会令进入该层级的流浪者与其同伴失散开来，无法在层级内汇合。然而与Level 0不同的是，该效果并不适用于未成年人类流浪者及其直系原生亲属，意味着养育了孩童的流浪者家庭进入该层级时不会与彼此分离而落单；不过，与该家庭无血缘关系的其他同伴将依然与其失散。
//
//IMG_20221202_021729.jpg
//Level C-800的一家服装店。尽管种类繁多，但这些衣物的质量极差。
//
//Level C-800内部的商铺繁多，但内部均没有任何可供流浪者携带的资源：餐厅和零食店内没有任何食品饮料，家具店中的各式家具无法拆卸和移动，衣装店中的衣物总是不符合流浪者的审美1。进入任何商铺的后房2都会来到Level 0。另外，出于某种未知效应，在本层级拍摄的照片当中涉及到商铺品牌的部分总是会变得无法识别。
//
//在以后室标准时间而言的前厅节日所在日期（如春节1月～2月、圣诞节12月24～25日）进入Level C-800是唯一能从该层级获取物资的方式。在流浪者进入Level C-800后，其面前的第一家商铺当中会出现一份3礼物，内容一般为其童年时期最喜爱的玩具或系列书籍，以及若干符合其喜好的零食。礼物上总是附有一份纸条，写有流浪者的名字及节日祝福语。与该现象相对的，整个层级的装潢在节日期间都会变为与节日相对应的风格。
//
//Level C-800内存在着若干个大型充气城堡和小型室内游乐场，在部分餐厅内也存在儿童游乐区域。这些区域中的游乐设备均可使用，而不会造成任何危险。14岁以下的人类儿童接近或处于这些区域时，会表达出在该这些区域游玩的意图。若其父母拒绝在这些区域逗留，则其情绪会陷入低落状态，或是产生愤怒情绪。额外的，任何流浪者处于这些游乐区域时，均会听到一种儿童嬉戏声。据称，这种声音“微弱而清晰，带有回声，似乎是从远方传来的”，当前未知该声音的来源与产生原因。
//
//IMG_20220411_195926.jpg
//该“出口”样式被认定为是享乐层的一个入口。切勿接近。
//
//目前尚没有在Level C-800中目击到实体的记录。此外，曾有流浪者家庭（2名成年人，1名孩童）中的孩童成员在该层级中走失，该流浪者家庭随即与彼此失散。该家庭中的父母最终从Level C-800中脱离并来到Level 4，但孩童至今尚未在其他层级被发现。在该事件之后，有人报告称在Level C-800听见了疑似儿童惨叫求救的声音，但目前没有任何有关儿童尸体或人类血迹的迹象在该层级被发现。
//
//基地、前哨站与社区
//该层级没有任何已知的基地、前哨站或社区。
//
//入口与出口
//入口
//在Level 11中携带前厅货币和一只任意材料的购物袋，思考自己想要购买的物品4切入任意一家商铺的门即可来到Level C-800。
//
//Level C-299的墙壁上有一张褪色的、内容疑似商场开张迎宾的广告招贴，切入该招贴也可来到本层级。
//
//出口
//如描述所言，Level C-800中分布着若干个“出口”，其对应着不同的层级。切入这些“出口”的墙壁，或是打开“出口”的门就可以离开Level C-800。目前所有“出口”中已知通向的层级有：
//Level 0
//Level 4
//Level 7
//Level 9
//Level 10
//Level 11
//Level 48
//享乐层
//Level C-7
//Level C-114
//Level C-299
//此外，进入任意商铺的后房也可以来到Level 0。
//作者信息
//Footnotes
//1. 同时，这些衣物的材料质量极差，没有任何回收必要。
//2. 指并不展露在消费者面前的房间，如衣物店的仓库、餐厅的厨房等。
//3. 若为流浪者家庭则礼物份数等同于家庭成员数。
//4. 该入口很令人迷惑，因为流浪者并不能在这个层级购物。
package lvls18x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1800{}