//Level C-810
//评分: 
//+24
//+
//–
//X
// 
//
//生存难度：
//等级 变化
//
//随时间变化的安全性
//随时间变化的稳定性
//实体绝迹
//M.E.G.官方通报
//2022/9/1
//Level C-810已完全进入“收缩完毕”状态，由于该层级入口十分常见，请仔细阅读以下文档，以免进入Level C-810，失去您宝贵的性命。这种状态将在2023/1/1结束，届时，本公告即作废。
//
//EagleSD.png
//M.E.G. - 更好的人类
//当前状态:“收缩完毕”
//
//Level C-810是后室层群C的第810层。
//
//描述
//Level C-810的外观表现为一座处于阴雨天气的港口城市，风格就像19世纪的英伦城市，与其他层级不同的是，Level C-810的面积并不是无限大的，其的面积约为1577KM²。有趣的是，“阴雨”的成分为纯正的杏仁水，在每个房屋的屋顶上都带有一个蓄水池，用于收集落下的杏仁水，而这些蓄水池最终会通往一个教堂般的建筑，M.E.G.在其中建立了前哨。
//
//rain-1479303_640.jpg
//Level C-810 的港口样貌。
//
//然而，Level C-810的物资远高于其他层级，已发现的物资有（按发现顺序排序）:
//
//杏仁水
//火盐
//反欧几里得装置
//驱笑剂
//层级秘钥
//幸运豆奶
//腰果水
//瓶装闪电
//皇家口粮
//以上所述的物资将会在各个建筑中频繁出现，出现的数量暂未准确的统计，它们是否会源源不断的出现于Level C-810，我们也在努力的研究。
//
//本层级最备受关注的地方即“伞状收缩现象”，通俗来讲，则是整个层级的地形呈伞状向层级中心收缩或从层级中心向外扩张，这种现象导致了本层级的不稳定性，M.E.G.为本层级命名了四种状态，在下文中依次罗列其的必要信息。然而，我们最初认为收缩前的建筑和前哨站会在收缩中被彻底摧毁，但在再次扩展之后，我们意外的发现了先前的建筑和前哨站并未损坏，完好无损的正常运行着，正因这种现象如一杆雨伞的结果一般，得名“伞状收缩现象”。
//
//- 隐藏
// 
//
//生存难度：
//安全且稳定
//宜居聚居地
//实体绝迹
//如上文所述，此状态是本层级最适合居住、收集物资的状态，几乎与正常层级相同，基本信息部分在上文已书写，因此不在此处赘述。
//
//基地与前哨站
//The M.E.G. C810号哨站
//开放贸易
//对流浪者友好
//位于教堂建筑内
//人数约100人
//包含大量物资
//掌握着本层级的出入口
//管理本层级
//The B.N.T.G. C810号交易小队
//开放贸易
//不会理会流浪者
//仅为流动小队制
//人数约30人
//与The M.E.G. C810号哨站达成友好协议
//出口与入口
//在Level 11进入一座19世纪英伦风建筑会来到此层级。
//在The M.E.G. C810哨站中有一扇门通往Level 11，另一扇门通往Level 230
//
//- 隐藏
// 
//
//生存难度：
//等级 2
//
//安全
//不稳定
//实体绝迹
//在收缩完毕状态前最后的可存活状态，在层级的最外部，及深海区域将会以匀速慢慢收缩之层级中心点，如果你被收缩运动碾过了身体，那么你将会失去生命。在本状态开始前一天，The M.E.G.将会封锁该层级在Level 11的入口，违背者将会被强制驱逐。在正式收缩完毕前，你必须快速找到本层级的出口并撤离出本层级，所有哨站的成员将会在收缩刚刚开始时快速带上物资撤离本层级，当本层级的出口处也被收缩运动碾过时，你将无处可逃，任何切出行为都是苟延残喘，因为本层级无法进行切出。具可靠的描述，收缩运动会在最后时刻不断加速，直到收缩完毕。
//
//基地与前哨站
//The M.E.G. C810号哨站
//开放贸易
//对流浪者友好
//位于教堂建筑内
//人数约100人
//包含大量物资
//掌握着本层级的出入口
//管理本层级
//The B.N.T.G. C810号交易小队
//开放贸易
//不会理会流浪者
//仅为流动小队制
//人数约30人
//本状态没有已知的基地与前哨站存在
//
//出口与入口
//在Level 11进入一座19世纪英伦风建筑会来到此层级。
//在The M.E.G. C810哨站中有一扇门通往Level 11，另一扇门通往Level 230
//
//- 隐藏
// 
//
//生存难度：
//无限接近0的面积
//不存在物质
//不存在生命
//Level C-810的外观表现为一座处于阴雨天气的港口城市，风格就像19世纪的英伦城市，与其他层级不同的是，Level C-810的面积并不是无限大的，其的面积约为1577KM²。有趣的是，“阴雨”的成分为纯正的杏仁水，在每个房屋的屋顶上都带有一个蓄水池，用于收集落下的杏仁水，而这些蓄水池最终会通往一个教堂般的建筑，M.E.G.在其中建立了前哨。
//
//rain-1479303_640.jpg
//Level 810 的港口样貌。
//
//然而，Level C-810的物资远高于其他层级，已发现的物资有（按发现顺序排序）:
//
//杏仁水
//火盐
//反欧几里得装置
//驱笑剂
//层级秘钥
//幸运豆奶
//腰果水
//瓶装闪电
//皇家口粮
//以上所述的物资将会在各个建筑中频繁出现，出现的数量暂未准确的统计，它们是否会源源不断的出现于Level C-810，我们也在努力的研究。
//收缩完毕，具猜测，我们认为这是一片面积无限接近0的纯黑空间，就像奇点一般神秘而危险。它的质量为整个层级的整体质量，被压缩成了一个奇点，就像中子星上的一勺物质般沉重无比。在这种极端的状态下，没有物质乃至生命可以存在，甚至于它的存在都没有确切的研究报告可以证实。该状态的研究工作也无比艰难，因为几乎没有人、机器的大小可以无限接近0。
//
//基地与前哨站
//The M.E.G. C810号哨站
//开放贸易
//对流浪者友好
//位于教堂建筑内
//人数约100人
//包含大量物资
//掌握着本层级的出入口
//管理本层级
//The B.N.T.G. C810号交易小队
//开放贸易
//不会理会流浪者
//仅为流动小队制
//人数约30人
//本状态不可能存在基地与前哨站。
//
//出口与入口
//在Level 11进入一座19世纪英伦风建筑会来到此层级。
//在The M.E.G. C810哨站中有一扇门通往Level 11，另一扇门通往Level 230
//没有入口及出口。
//
//- 隐藏
// 
//
//生存难度：
//等级 1
//
//安全
//不稳定
//实体绝迹
//收缩完毕后的第一个状态，表现为从层级中心的奇点慢慢地扩展至原来的大小，在入口区域也扩张成功后，本层级便回归正轨，在收缩完毕前的建筑和物资仍会保留至本状态，所有的前哨站成员也会第一时间再次开始资源收集工作。
//
//基地与前哨站
//The M.E.G. C810号哨站
//开放贸易
//对流浪者友好
//位于教堂建筑内
//人数约100人
//包含大量物资
//掌握着本层级的出入口
//管理本层级
//The B.N.T.G. C810号交易小队
//开放贸易
//不会理会流浪者
//仅为流动小队制
//人数约30人
//出口与入口
//在Level 11进入一座19世纪英伦风建筑会来到此层级。
//在The M.E.G. C810哨站中有一扇门通往Level 11，另一扇门通往Level 230
//
//- 隐藏
//M.E.G.官方通报
//2020/02/01
//尽管代价巨大，但本层级的发现令M.E.G.以及其他组织的发展提供了无限的帮助。研究人员们的无私奉献令我们致敬，以下是英雄们的名单:
//
//Murphy Sasha（M.E.G.）
//Jack brtght（M.E.G.）
//Garham Sasha（B.N.T.G.）
//更多无名英雄奉献出了生命，而我们却不曾得知他们的名字，在此向所有付出生命的烈士致敬！
//
//EagleSD.png
//M.E.G. - 为人类而战
package lvls18x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1810{}