//Level C-805
//评分: 
//+16
//+
//–
//X
// 
//
//生存难度：
//等级 ♡
//
//不安全
//精神控制
//变化量实体
//Level C-805是后室C层群的第805层。

//
//level-c-805-p1
//沙滩边界线的景象，本条目图片均由流浪者Roger Bruce拍摄。经过了提亮处理。
//
//描述
//Level C-805外观上为一片面积约为100平方米的鲜粉色露天沙滩。在大部分时间中，该层级都呈现出小雨、乌云密布的天气状态，但该层级中心的天空呈现出“破洞状”，从中有光线射入，成为了该层级唯一已知的光源，但似乎有未知的微弱光源，使流浪者能够在该层级中可视范围与平常无大差异1。
//
//在100平方米开外的地方，则有未知原因形成的无形屏障。透过屏障可以看到无边的一片海洋。该海洋在流浪者进入状态IV前会一直保持着风平浪静的状态。但从状态IV开始，海洋开始卷起风浪。据部分报告称，从远处有观测到龙卷风，漩涡等恶劣气象。
//
//经调查发现，任何进入此层级的流浪者们会在距离他们约20米处看到一名未知的女性实体，目前对其属性尚未完全明确。但该实体会对任何被她发现的流浪者产生精神层面的影响，详情请见下文。

//
//实体
//“所爱之人”
//该实体在控制流浪者精神与心智的同时，会使流浪者产生“幻觉”。关于此实体，目前对其属性尚未明确，但已确认其不是无面灵等任何已知的某种实体。
//
//每一位从Level C-805中生还下来的流浪者，在被提问到关于此层级的回忆时，都会不约而同的提到一句：
//
//「我终于见到了我‘所爱之人’。」
//
//故该实体暂时被命名为“所爱之人”。
//
//下面是已知有关该实体的全部信息：
//
//体长约1.7m
//生理特征体现为一名青壮年女性，体态特征可能因流浪者心理状态而改变。据多数人目击，表现为身着过膝纯白色布制连衣裙，手捧一束白色的花球。有时连衣裙的白色会表现出异常的光亮，有小概率使流浪者短暂致盲，进入状态III，原因不明。
//似乎拥有控制流浪者心智、思想等的能力。
//可自由移动，但任何尝试接触此实体的行为都会失败，而是会穿过此实体，在穿过此实体的过程中，流浪者会有强烈的心脏刺痛的感觉，如有心脏病或类似疾病病史者，可能会因此而昏厥甚至直接死亡。
//此外，该层级在流浪者进入状态V时，层级暗处会生成大量无面灵及少量悲尸，他们在一般情况下会保持正常状态，但会在“所爱之人”表现出敌意时与其同时表现出敌意，原因未知。
//
//“幻觉”状态
//在“幻觉”中，流浪者们会经历不同的几个状态阶段：
//
//状态I：在状态I中，流浪者们将会直接看到“所爱之人”。
//状态II：在状态II中，“所爱之人”开始对流浪者进行进一步精神控制。流浪者将会看到有关于来到后室之前最爱的人的正向的幻象2 ，如果是男性流浪者，那么最大几率看到的与自己最爱的一个恋人相关的幻象回忆。若男性流浪者并无情史、或该流浪者为女性，则是与自己的亲生母亲、女性朋友等生命中最重要的一位女性相关的回忆。（出现形式为恋人的可能性依流浪者本身的性取向而定）。而在状态II中，该实体的白色连衣裙会闪出异常的光亮，有小概率使流浪者短暂致盲。
//level-c-805-p2
//流浪者Roger Bruce在状态II时拍下的照片，并非幻象内部景象，而是层级内实际存在过的场景。
//
//状态III：在状态III中，“所爱之人”会开始接近流浪者。而此时流浪者仍沉浸于状态II的美好幻想之中，但在靠近的过程中，流浪者会感受到心跳不停加速，且周围的气温缓步但可感知的升高。但值得一提的是，如果流浪者在进入状态III时成功的“击碎”幻象时，“所爱之人”会直接消失，并留下一支红玫瑰花，将其拾起后，会直接被传送至Level 18。
//状态IV：在状态IV中，流浪者眼前的幻象将会消失，取而代之的是与其距离约十米远的“所爱之人”。如果流浪者在这时有大幅度的位置移动，则会直接进入状态V。因此即使部分流浪者有可能在这时已经失去视觉功能，我们也非常不建议状态IV逃跑。
//状态V：在状态V下，该层级内会从暗处生成大量无面灵及少量悲尸。然后，“所爱之人”将以缓慢的速度继续靠近流浪者。在靠近的过程中，流浪者脑海中会听见一句话：“全部都告诉我吧。”
//随后，若想求生，需要流浪者大声喊出心中所有想对那位思念之人说的话，如果成功使她作出反应，则状态解除，详情见下文。流浪者会在“所爱之人”的怀抱中入睡。再次醒来时，会被传送至Level 18。
//
//反之，“所爱之人”则会主动与流浪者接触，将身体穿过流浪者。在这个过程中，流浪者会有强烈的心脏撕裂、炸裂感，最终导致死亡。
//
//基地、前哨和社区
//该层级因其特殊性质，暂无已知的基地、前哨和社区。
//
//入口与出口
//入口

//在任何层级中，当流浪者陷入对在前厅的重要之人产生任何与爱情有关的情绪时，有一定几率产生突发性的心脏刺痛，导致流浪者当场昏迷，醒来后会被传送至Level C-805。
//出口
//在状态III“击碎”幻象，拾起玫瑰花后将被传送至Level 18。
//大声喊出心中所有想对那位思念之人说的话，如果成功使她作出反应，她的面部会表现为幻象主人公的面部特征，但略显模糊。然后她会面带温和的笑容，缓慢的走向该流浪者，然后给予该流浪者一个体感温暖的拥抱，直至流浪者在“她”的怀抱中入睡。再次醒来时，会被传送至Level 18。
//补充
//流浪者一旦从Level C-805切出后，很大几率将再也不会以任何形式回到该层级。
//
//收起
//

//
//M.E.G. 采访记录
//采访者：M.E.G.某匿名人员
//受访者：Roger Bruce 布鲁斯•罗杰
//地点：Level 11
//
//<开始记录>
//
//采访者：罗杰，听说你前两日去了一个未记录的层级？
//
//受访者：……
//
//采访者：不必紧张，告诉我实情就好。这样，你可以先简单描述一下层级内的景象吗？
//
//受访者：那是…一片沙滩。是一片粉红色的沙滩…和她。
//
//采访者：她？
//
//受访者：对，她叫朱莉娅。不…她叫什么，似乎也不重要了。但我终于见到了我“所爱之人”。
//
//采访者：为什么？实体的名称可是很重要的信息！
//
//受访者：我希望她不是实体…
//
//采访者：因为什么？说来听听。
//
//受访者：她是我过去的所爱之人。在我来到这个鬼地方之前，我们还居住在一起。
//
//采访者：哦！是你的恋人！不过
//她为什么也会出现在后室？
//
//受访者：我希望我能知道…但是恐怕不能。我想，那是我们这辈子最后一次相见了。
//
//采访者：那听起来真糟糕。你们之间在那个层级里发生了什么吗？
//
//受访者：我回想起了我们过去的美好时光…那一切看起来都是那么的真实，真实到，我感受到了真切的声音与温度。
//
//采访者：有点奇怪，继续说。
//
//受访者：我还看到了好多人…他们面容模糊，可能是无面灵。印象中好像还有几个悲尸？记不太清了。
//
//采访者：我的老天，这太恐怖了。
//
//受访者：她对我说了一句话，“全部都告诉我吧”。
//
//采访者：然后呢？你告诉了她什么？
//
//受访者：我记不清了，我把想说的话都说出来了。这些话好像大部分是我一直以来心里想说的话。全部倾诉出来的瞬间，我解脱了。
//
//采访者：呼…还好你解脱了。后来呢？你是怎么逃出来的？
//
//受访者：那一瞬间，所有实体都消失了。她还在。她给了我一个温暖的拥抱，在那之后，我就不记得了。然后我就切到了另一个层级。好像是Level 18。那个层级还挺安全的，还有一个像玩具一样的绿色小恐龙，它带我回到了这里。
//
//采访者：哦…恭喜你啊老兄，从一个未知的层级生还下来可是尤其难的。
//
//<采访结束>
//
//
//

//收起
//

//
//<语音转文字开启>
//
//我的上帝，这可真是太糟糕了！我感觉我刚才经历了人生中最矛盾的一次层级探索！
//
//在那之前，我睡了一觉，那一觉梦到了我还在前厅的妈。然后我就不知道怎么回事，就被传送到这恐怖的粉色沙滩了。这沙滩美是美，可我好像看见上面有星星点点的血迹！这真不是开玩笑！这可真是太恐怖了！！！
//
//然后我就看到了一个女的，穿着白裙子，披着头发，说实话，怪像哪个鬼片里的女鬼了。然后又不知道发生了什么，我想想，我看到了小时候的我，还有我妈，跟梦里的情形差不多。
//
//我正怀念之心油然而生，然后就给我打回原形，画面突然就消失了，我又回到了那个鬼沙滩。那个女鬼转过身来，竟然是我年轻的妈？！我的老天爷，转身那一下子可给我吓个半死。然后她那个裙子就开始自己发光，那叫一个呲眼睛啊！给我好家伙直接晃瞎了，真就啥也看不见了。
//
//一片乌漆麻黑里，好像是我老妈的声音，她让我把想说的话都说出来，好家伙，我直接一顿输出，把对她以及对原来的生活的怀念，甚至我的遗言都直接编完了！然后说了一堆之后，不知道什么时候，我又能看见了。那个长得像我老妈的女鬼也消失了，地上只有一支玫瑰花，拿起那朵玫瑰花，我就进了层十八，说实话，我还以为把我送进Level 18，是我马上要下十八层地狱的意思……
//
//真的吓个半死，以后不轻易探索其他层级了，我还是在总部苟条小命吧。
//
//<语音转文字结束>
//
//

//
//

//作者信息
//

//« Level C-804 | Level C-805| Level C-806 »
//
//Footnotes
//1. 实际上，这些未知光源疑似是该层级中的某特殊实体所带来的，但原理及位置尚未可知。
//2. 指美好的，积极的回忆等。
package lvls18x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1805{}