//Level C-826
//评分: 
//+11
//+
//–
//X
// 
//
//生存难度：
//等级 2
//
//不安全
//不稳定
//极少量实体
//Level C-826是后室C层群的第826层。
//
//F314-C222-2369-4338-A9-A3-51-C7373-E9-D9-F.jpg
//层级内的一处巧克力钟乳石，图片经过加亮处理。
//
//描述：
//Level C-826是一个由巧克力和可可粉构成的大型溶洞，面积未知。尽管洞内缺乏自然光照，但仍有来源未知的微弱光源提供照明，巧克力钟乳石和石笋在本层级极为常见1。
//
//本层级拥有自我清洁的能力，故不必担心卫生问题。每隔1小时，地面会将长时间无移动的物品拖入地面，并在6分钟之内完全吞噬并消失2，尚不知被吸入的物品去了哪里。本层级WIFI信号较弱，到目前为止还没有发现过任何物品。
//
//A6-EDB546-B781-4858-A955-09-BDEE095-B16.png
//一处有阳光照射的地方。
//
//有时，在溶洞上方会出现一些透光的空洞，这些空洞表明Level C-826是有地表区域的，但截止目前还没有任何人员到达过地表。因为这些空洞极深，边缘十分光滑，极不利于人类攀爬。尚不知空洞上方具体是什么。
//
//此外，Level C-826的温度随着高度的变化而变化，相对海拔越高，温度越低，反之亦然3。温度的差异也造就了本层级丰富的地貌，例如靠近地表的区域总是能发现已经凝固的、表面光滑且有光泽的钟乳石群，在地下深处则有巧克力暗河或泥潭。需要注意的是，深度越深的区域越不安全，因为被高温融化的巧克力地面很可能令流浪者深陷其中无法挣脱，造成人员伤亡。
//
//后室厨师联盟曾对Level C-826的巧克力进行研究，结果发现这种巧克力口感极佳，有极高的营养价值，食用后不会产生任何不良作用，并能令人产生出一种极大的满足感。另外，Level C-826的巧克力种类繁多，自记录以来被发现种类的如下（排序从常见到稀有），而种类很可能继续增多。
//
//- 隐藏清单
//可可巧克力
//牛奶巧克力
//坚果巧克力
//咖啡巧克力
//醇黑巧克力
//酒心巧克力
//抹茶巧克力
//葡萄干巧克力
//巴旦木巧克力
//榛子巧克力
//香草巧克力
//杏仁巧克力
//蜂蜜巧克力
//草莓巧克力
//橙子巧克力
//冰激凌巧克力
//海盐巧克力
//醇香巧克力
//白巧克力
//多种口味混合巧克力
//辛辣巧克力（仅发现一块）
//其中，除可可、牛奶和坚果是层级主要结构外，其它多以特殊地貌和矿藏的形式分布。
//
//实体：
//Level C-826的实体仅有2种，分别为受到“11效应”的死亡飞蛾，以及一种名为“啃食者”的独有实体。
//
//啃食者
//啃食者的外观类似于前厅的金龟子，但前者要比后者大5～8倍，颜色更深且头部长有犄角，主要分布在温度较高的区域。啃食者以层级内的巧克力为食，且能够像蜣螂一样用两只有力的后肢搬运所收集的食物。
//
//啃食者是被动型生物，不会主动攻击生物。但若有生物持续干扰它的行动，那么它可以从头部喷出一种极为粘稠的巧克力浆来阻挡前者。射出的巧克力浆具有极其浓郁的香味，可使受击者陷入短暂昏迷。因此，有部分流浪者经常试图激怒啃食者来获得这种巧克力浆。
//
//基地、前哨和社区：
//后室厨师联盟“温巧俱乐部”
//
//坐落于一处巧克力瀑布旁，拥有14人。
//热衷于将巧克力制成不同的花样。
//尝试养殖“啃食者”来获得更美味的巧克力，但目前还没有成功。
//将流浪者看做客人，友好。
//M.E.G. “融巧旅馆”
//
//有17名特工常驻，基地可同时容纳100人。
//为流浪者提供住宿，并乐意作为导游。
//与其它组织有着良好的关系。
//“巧克力建筑师”
//
//该组织有9人，均为建筑爱好者。
//擅长利用巧克力来搭建各式各样的建筑，组织所在地已成为一处旅游景点。
//同样友好。
//B.N.T.G.“冷巧仓库”
//
//仓库有10人常驻，位置靠近地表。
//不断将巧克力运往其它层级，再进行二次加工和包装后售卖。
//开放贸易，有时会招募一些流浪者做工。
//入口和出口：
//入口
//
//在Level C-offee ୧⍤⃝、Level C-124喝下一杯巧克力奶可来到Level C-826
//出口
//
//拿起一块被锡纸包裹的巧克力将来到Level 75。
//尝试将自身埋进巧克力内会进入Level C-827。
//对着岩壁切出有可能来到蔗糖秘境
//作者信息
//« Level C-825 | Level C-826 | Level C-827 »
//
//Footnotes
//1. 以上两点与Level 8相似。
//2. 生物并不会被吸入。而物品不论大小以及质量。
//3. 截至目前，观测到的最低温度为2℃，最高温为35℃。
package lvls18x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1826{}