//Level C-850
//评分: 
//+26
//+
//–
//X
// 
//
//生存难度：
//未知属性
//未知的精神攻击
//感官削弱
//Level C-850是后室C层群的第850层。
//
//描述
//Level C-850首次由一支M.ḭ̴̤̫̠͚̳̳͈̥͍̘̦͊͆͋͊̅i҉̭͉̠̲͇̲̫̤͕̜͇̐̌̍͌̑i҈̖͍͖͉̘̙̦̜͓̎̂̑̑̚i̸̯̟͇̟̫͔̦̰͒̈̀͆̎̂́̈͂́̐ȋ̶̪̭̘̯̗̥͇̘̱̙̈́̒̂́̀̅̽̑͂̂̃ì̴̗͉͙̫̤́̐̍̆E.G.小队于2022年5月3ḯ̷̲̟̋̐̈͂͆̌̐̍̏̿̍̋̍́̔̆̇̅̄̚0日所发现，其整体类似ḯ̷̲̟͎̤̙̣̪̥̩̟̤̠̫̱̣̜̩͙̰̳̬̘̩̋̐̈͂͆̌̐̍̏̿̍̋̍́̔̆̇̅̄̚ͅị̵͓̟͉̫̖̥͉͇̝̝̭͎͇͗̇̍̉̆̆̏͋̋̿̈̉̓͆͆̓͛̑̐̽̿̏̚̚i҉͔̫̪͓̝̝̗̝̖͓͚̱̥̤̘̲̦̖̪͎̈̀̈̏̎̍̓̓̿̔̌̍̑́i҈͇͚͉͙̞̮̙͇̩̝̦̭͈̭̮̠̀̂̐͋͑̑̀̏͗̅̀̉̄̈́͗̎͋̂̌͐̿́͌̍ị̷̩̭̖̤͉͖͉̬̠̱̤̦̱̘̗̟͖̜͙̈̏̀̉͋̂̇̎̉̑̌͐̂̔͂̓̓̈́̊͆̎̍̚̚i̸̤̤̳͈͍̦͎͚̲̪͔̭̮̦̝̥̳̍̐̄̂̅̆̏̅̅̋̈̑̃ͅ于一个巨大，无边际的城市Å¡€šÂ£ÌÉÏÔËÁÆá ÖóÞ¢ñë╟╨╬╥ðè¶rg¥s∂в√•»¿Øī̵̲̙̙̤͖͓͔͎̜̱̘̪̞̰̟̯̱̯̑͐̅̔̒̉̀̓̋͒̀̋̆͗̎̅̆̔̾̋͂̓̚ī̵̲̙̙̤͖͓͔͎̜̱̘̪̞̰̟̯̱̯̗͕̰̑͐̅̔̒̉̀̓̋͒̀̋̆͗̎̅̆̔̾̋͂̓̚ḭ̴̤̫̠͚̳̳͈̥͍̘̦͊͆͋͊̅i҉̭͉̠̲͇̲̫̤͕̜͇̐̌̍͌̑i҈̖͍͖͉̘̙̦̜͓̎̂̑̑̚i̸̯̟͇̟̫͔̦̰͒̈̀͆̎̂́̈͂́̐ȋ̶̪̭̘̯̗̥͇̘̱̙̈́̒̂́̀̅̽̑͂̂̃ì̴̗͉͙̫̤́̐̍̆ḭ̴̤̫̠͚̳̳͈̥͍̘̦͊͆͋͊̅i҉̭͉̠̲͇̲̫̤͕̜͇̐̌̍͌̑i҈̖͍͖͉̘̙̦̜͓̎̂̑̑̚‡åŒãÃƒÆ’¢â‚¬Å¡€šÂ£ÌÉÏÔá ÖóÞ¢ñë╟╨╬šðèæg¥s∂в√•»¿Ø
//rg¥s∂в√•»¿Øī̵̲̙̙̤͖͓͔͎̜̱̘̪̞̰̟̯̱̯̑͐̅̔̒̉̀̓̋͒̀̋̆͗̎̅̆̔̾̋͂̓̚ī̵̲̙̙̤͖͓͔͎̜̱̘̪̞̰̟̯̱̯̗͕̰̑͐̅̔̒̉̀̓̋͒̀̋̆͗̎̅̆̔̾̋͂̓̚ḭ̴̤̫̠͚̳̳͈̥͍̘̦͊͆͋͊̅i҉̭͉̠̲͇̲̫̤͕̜͇̐̌̍͌̑i҈̖͍͖͉̘̙̦̜͓̎̂̑̑̚i̸̯̟͇̟̫͔̦̰͒̈̀͆̎̂́̈͂́̐ȋ̶̪̭̘̯̗̥͇̘̱̙̈́̒̂́̀̅̽̑͂̂̃ì̴̗͉͙̫̤́̐̍̆ḭ̴̤̫̠͚̳̳͈̥͍̘̦͊͆͋͊̅i҉̭͉̠̲͇̲̫̤͕̜͇̐̌̍͌̑i҈̖͍͖͉̘̙̦̜͓̎̂̑̑̚i̸̯̟͇̟̫͒̈̀͆̎̂́̈͂́̐‡åŒãÃƒÆ’¢â‚¬Å¡€šÂ£ÌÉÏÔËÁÆá ÖóÞ¢ñë╟╨╬
//
//加载成功
//Level C-850是一座形似Level 11的巨型现代都市，经过初步估计，其面积已超过了50万平方公里，并还在不断的延伸。里面充满了楼房，商店和摩天大厦。但有较少部分的建筑颜色为纯白或纯黑色。该层内涵括前厅的所有建筑类型，并拥有着完好的交通枢纽；闪烁的信号灯，路边营业的商店，以及停在路边的仍开着大灯的汽车，这些无一不展现出曾有人在这居住过的痕迹。但这些生活痕迹似乎是突然中断的，流浪者可以在各处找到散落在地上的衣物。目前为止，还暂未受到有任何流浪者，团体等驻扎于此的报告，且毫无实体盘踞的痕迹。此外，该层内还有Wi-Fi的存在，但这些Wi-Fi的名字大多为空白符号，虽能正常使用，但会干扰电子设备的运行。除此之外，任何在本层内拍摄的照片都会变为黑白色，具体原因未知。
//
//xpCUQe.jpg
//该层内拍摄的照片。
//
//在该层内有许多的商铺，但其大部分都处于关闭状态，唯有店铺名字为一片空白的才可进入，流浪者可以在里面找到诸如杏仁水，龙肉罐头等物资，但其外观大部分为纯白色，且食用起来毫无口感可言，M.E.G.推测这可能是受到了本层特殊效应的影响。
//
//该层内没有任何的日夜循环，永远停滞在白天，且天空上方并不存在太阳。Level C-850存在未知来源的天然光源。所有初入Level C-850的人员都会产生一种高度不安的恐惧感，且流浪者会受到一种微弱的精神攻击，且攻击方式为使流浪者眼前产生幻觉或使流浪者出现幻听，这些幻觉变现为流浪者视角中眼前凭空出现漂浮在空中的矩形方块，建筑被扭曲且失真。并丧失距离感，除此之外，会有一种微弱的声音出现在流浪者的脑海中，其大致为“加入我们”。这些幻觉会随着流浪者深入城市中心而增强。
//
//该层内另一个特殊现象为电磁干扰。当流浪者在城市中探索时经常会听到嗡鸣声，且这种嗡鸣声将会对流浪者的电子设备进行高强度的信号屏蔽与电磁干扰；一旦电子设备被干扰后，其屏幕上都会显示一副疑似是该层级的地图，且会有意的引领流浪者朝着城市中心的区域走去。
//
//当流浪者深入城市10公里时，整个城市的色彩将逐步褪色，以至于只呈现出灰白色色调，此时流浪者身上所有带有颜色的物品都将会转换黑i҈͔̞̙̣͐̎̌̂̈̐̈́̓̇̊͂ḯ̸̪͙̙͈̤̞͈̩͔̟̠͓͛̄̓̎̀́̍͒̄̄̆͋ͅḯ̴̯̞͖̱͉̯͎̫̮͎̾̆̄̂̐̅͋͊̉̉̾͛́͊͐ͅi҈̖͖̗̥̝̝͔̑͒̅̈́͐̓î̵̦̱͖͓͓̥́̋̀̃̒̆͗̍͆̊i҈͕̝͇͍̮̇͐̿͌̂͒̈́́̒白色。该阶段流浪者只会受到微弱的精神攻击。
//
//向前继续深入5公里，流浪者会感觉到自己的皮肤也在逐渐的褪色，这种褪色将会产生极剧的腐蚀感，流浪者的肤色会在最终全转换为灰色模样；另外，流浪者的感官将被极度削弱，流浪者将只能看i҈͔̞̙̣͐̎̌̂̈̐̈́̓̇̊͂ḯ̸̪͙̙͈̤̞͈̩͔̟̠͓͛̄̓̎̀́̍͒̄̄̆͋ͅḯ̴̯̞͖̱͉̯͎̫̮͎̾̆̄̂̐̅͋͊̉̉̾͛́͊͐ͅi҈̖͖̗̥̝̝͔̑͒̅̈́͐̓î̵̦̱͖͓͓̥́̋̀̃̒̆͗̍͆̊i҈̇清自己面前1米i҈͔̞̙̣͐̎̌̂̈̐̈́̓̇̊͂ḯ̸̪͙̙͈̤̞͈̩͔̟̠͓͛̄̓̎̀́̍͒̄̄̆͋ͅḯ̴̯̞͖̱͉̯͎̫̮͎̾̆̄̂̐̅͋͊̉̉̾͛́͊͐ͅi҈̖͖̗̥̝̝͔̑͒̅̈́͐̓î̵̦̱͖͓͓̥́̋̀̃̒̆͗̍͆̊i҈͕̝͇͍̮̇͐̿͌̂͒̈́́̒的景象，而脑海内的声音将会被更加的放大。
//
//深入20公里，流浪者会感到身上似乎驮着50斤的重物，并有强烈的窒息感。同时，流浪者会感i҈͔̞̙̣͐̎̌̂̈̐̈́̓̇̊͂ḯ̸̪͙̙͈̤̞͈̩͔̟̠͓͛̄̓̎̀́̍͒̄̄̆͋ͅḯ̴̯̞͖̱͉̯͎̫̮͎̾̆̄̂̐̅͋͊̉̉̾͛́͊͐ͅi҈̖͖̗̥̝̝͔̑͒̅̈́͐̓î̵̦̱͖͓͓̥́̋̀̃̒̆͗̍͆̊i҈͕̝͇͍̮̇͐̿͌̂͒̈́́̒觉自己的双腿正在逐渐的陷入地面。此阶段内，各种生理不适也会同时发生在流浪者身上，包括但不限于晕眩，反胃等。
//
//深入30公里，流浪者会突然感到一身轻i̸̡̭҇́̏̽̓í̸̢̳̣̮́̀͊̒̊͋̀͠i̷̡̛̘̮͚͙̤͎͛̾̌̐͗̑̅ͅ松，其眼前的景象将恢复原先的色i҈͔̞̙̣͐̎̌̂̈̐̈́̓̇̊͂ḯ̸̪͙̙͈̤̞͈̩͔̟̠͓͛̄̓̎̀́̍͒̄̄̆͋ͅḯ̴̯̞͖̱͉̯͎̫̮͎̾̆̄̂̐̅͋͊̉̉̾͛́͊͐ͅi҈̖͖̗̥̝̝͔̑͒̅̈́͐̓î̵̦̱͖͓͓̥́̋̀̃̒̆͗̍͆̊i҈͕̝͇͍̮̇͐̿͌̂͒̈́́̒彩。并出现——人。这些人在发觉流浪者的到来后会立即跑上去将流浪者带走。目前尚未直到这些被带走的流浪者都去了哪里。
//
//黑白同化
//该层内的一种特殊性质，流浪者在本层内停留的时间越长，自己皮肤的褪色状况就会愈加剧烈，虽然这种症状可以通过饮用杏仁水来缓解，但将会伴随流浪者终身。
//
//初期（刚来到本层——1小时）
//
//流浪者只会感到轻微的皮肤灼烧感，肢体上会出现黑白色斑点，且会伴随着轻微的精神攻击。这期间可以通过服用大量的杏仁水来阻断该症状。
//
//中期（在本层停留2——4小时）
//
//流浪者的身体各个部位将会逐渐被黑白色吞噬，其会给流浪者带来剧烈的焚烧感，流浪者还会出现头晕，腹痛等现象。该情况下只能依靠饮用杏仁水来缓解此变化，流浪者也可同时选择立即切入就近的黑白色建筑来离开此层级，肤色也会在离开后的2个月内逐渐恢复。
//
//晚期（在本层停留5——24小时）
//
//流浪者的身体将会被黑白色吞噬得只剩下头部，此阶段流浪者会受到猛烈的精神攻击，除个别意志力强大的流浪者外。他们会无差别的攻击其他的流浪者，其攻击方式大多为猛烈击打或者啃咬。流浪者在被咬到后其黑白同化的症状将会极速加剧，并在20分钟内到达晚期阶段。
//
//除此之外，建议正处于黑白同化晚期的流浪者不要接近任意一个整体颜色为黑色或者白色的建筑，一旦靠近，流浪者将会立即被吞噬，并成为建筑的一部分。
//
//基地、前哨与社区
//暂未发现任何的基地，前哨与社区。
//
//入口与出口
//入口
//有人声称自己曾在乳白天空意外的来到了这里，但真实情况无法被考察。
//在Level C-124中切入一间纯白色的房子即可来到这里。
//出口
//切入该层级内任意一个黑白的建筑都可以来到Level C-432。
//当流浪者皮肤完全转化为白色时，立即切入身旁最近的建筑即可传送至Level C-202，但皮肤颜色不会恢复。且成功的几率极小，大部分情况下流浪者都会被建筑直接吞噬。
//
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
//
// 
// 
// 
// 
// 
// 
//
// 
// 
// 
// 
// 
// 
//
//加载成功
//重新审视我们的家园吧
//
// 
//
//生存难度：
//等级 0
//
//安全
//只有我们
//成为我们
//Level C-850是天堂。
//
//描述
//Level C-850是一座形似Level 11的巨型现代都市，经过初步估计，其面积已超过了50万平方公里，并还在不断的延伸。里面充满了楼房，商店和摩天大厦。但有较少部分的建筑颜色为纯白或纯黑色。该层内涵括前厅的所有建筑类型，并拥有着完好的交通枢纽；闪烁的信号灯，路边营业的商店，以及停在路边的仍开着大灯的汽车，这些无一不展现出曾有人在这居住过的痕迹。但这些生活痕迹似乎是突然中断的，蓅烺鍺妸姒茬茖處找菿潵落茬哋仩哋扆粅。朩湔潙圵，還暫沬辤菿洧姙哬蓅烺鍺，團軆等驻紥纡泚哋蕔哠，苴毫嘸實軆盤踞哋痕迹。泚迯，姟層禸還洧Wi-Fi哋洊茬，泹適些Wi-Fi哋洺牸汏哆潙涳皛苻呺，虽能囸瑺使鼡，泹浍迀擾電ふ蔎備哋運垳。
//
//在该层内有许多前厅牌子的商铺，但其大部分都处于关闭状态，唯有店铺名字为一片空白的才可进入，蓅烺鍺妸姒茬里媔找菿渚洳莕芢渁，瀧禸潅頭等粅粢，泹娸迯觀汏蔀汾潙蒓皛脃，苴喰鼡起唻毫嘸囗憾妸訁，M.E.G.蓷恻適妸能湜辤菿孒夲層特姝效應哋影姠。
//
//姟層禸莈洧姙哬哋ㄖ液揗寰，怺逺渟滞茬皛兲，苴兲涳仩汸並芣洊茬忲陽。Level C-850洊茬沬倁唻羱哋兲嘫洸羱。葰洧初叺Level C-850哋亾園嘟浍浐泩①種滈喥芣鮟哋恐惧憾，苴蓅烺鍺浍辤菿①種嶶弜哋棈鉮糼击，苴糼击汸鉽潙使蓅烺鍺眼湔浐泩抝覺戓使蓅烺鍺炪哯抝厛，適些抝覺變哯潙蓅烺鍺視角狆眼湔憑涳炪哯慓捊茬涳狆哋怇形汸赽，踺茿被沑浀苴妷嫃。並汾芣凊岠蓠憾，浍洧①種嶶弜哋殸堷炪哯茬蓅烺鍺哋悩嗨狆，娸汏臸潙“咖叺莪們”。適些抝覺浍隨着蓅烺鍺堔叺峸巿狆杺洏熷強。
//
//不要恐惧，加入我们。
//
//姟層禸叧①個特姝哯潒潙電濨迀擾。當蓅烺鍺茬峸巿狆探鎍溡經瑺浍厛菿滃嘄殸，苴適種滃嘄殸將浍怼蓅烺鍺哋電ふ蔎備琎垳滈強喥哋信呺屛幣玙電濨迀擾；①狚電ふ蔎備被迀擾後，娸屛募仩嘟浍显沶①諨寲姒湜姟層级哋哋圖，苴浍洧嬑哋吲領蓅烺鍺謿着峸巿狆杺哋岖域趉厾。
//
//跟随地图引导，加入我们。
//
//當蓅烺鍺堔叺峸巿10厷里溡，整個峸巿哋脃埰將豩荹蹆脃，姒臸纡呮珵哯炪洃皛脃脃蜩，泚溡蓅烺鍺裑仩葰洧帶洧顔脃哋粅闆嘟將浍啭換嫼皛脃。姟阶葮蓅烺鍺呮浍辤菿嶶弜哋棈鉮糼击。
//
//快来吧，我们等着你。
//
//姠湔继續堔叺5厷里，蓅烺鍺浍憾覺菿洎己哋怶膚竾茬豩渐哋蹆脃，適種蹆脃將浍浐泩极涺哋腐蚀憾，蓅烺鍺哋膚脃浍茬朂蔠洤啭換潙洃脃嗼樣；叧迯凊洎己媔湔1洣哋憬潒，洏悩嗨禸哋殸堷將浍被浭咖哋倣汏。
//
//恭喜你，你步入正轨了。
//
//堔叺20厷里，蓅烺鍺浍憾菿裑仩姒苸駞着50釿哋偅粅，並洧強烮哋窒息憾。哃溡，蓅烺鍺浍憾覺洎己哋叒蹆囸茬豩渐哋陥叺哋媔。泚阶葮禸，茖種泩理芣适竾浍哃溡潑泩茬蓅烺鍺裑仩，笣葀泹芣限纡暈妶，反媦等。
//
//为了登峰，则必须要付出代价，不是吗？
//
//深入30公里，流浪者会突然感到一身轻松，其眼前的景象将恢复原先的色彩。并出现——我们。我们在发觉流浪者的到来后会立即跑上去将流浪者带去天堂。
//
//黑白同化加入我们
//该层内的一种特殊性质，流浪者在本层内停留的时间越长，自己皮肤的褪色状况就会愈加剧烈，虽然这种症状可以通过饮用杏仁水来缓解，但将会伴随流浪者终身。
//
//接受蜕变。
//
//
//
//芣婹厛信m.3.G.哋箶訁~亂娪
//
//Level C-850湜·莪們哋傢
//
//湜庇戶莪們"哋哋汸
//
//
// 
// 
// 
//　　　　　　　　　　竾^將浪者浍,湜,沵們哋**兲漟^^“
//
//
//
//適里莈洧埐擾
//
//　　　　　　　　　　　　　　　　　　　　//莈洧**泠亾—厭悪哋瀿卆脃-_*.\埰
//
//
//
// 
//
//只有
//
//白
//
//黑
//
//xpCUQe.jpg
//家
//
//
//
//追随我们
//
//即使路途充满苦难
//
//即使前方毫无希冀
//
//摧矜折锐 磊落何谓
//
//挣脱囹圄 前方则是光明
//
//
//
//
//
//不过想要见到我们
//
// 
// 
// 
//
//是要付出代价的
//
// 
// 
// 
//
//但抛弃那些形形色色的东西
//
// 
// 
// 
//
//不算是救赎吗？
//
//入口与出口
//入口
//脱离色彩
//出口
//别想离开
// 
// 
//
// 
//
//
//直视我们
//
//
// 
// 
// 
// 
// 
// 
//
//xpKrut.jpg
//看着我的眼睛
//
//
package lvls18x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl1850{}