//Level 143
// 
//
//生存难度：
//等级 神圣
//
//灵体现界
//极度危险
//大量实体
//Level 143是后室的第144层。
//
//143.jpg
//一张在圣地内所拍摄到神圣堡垒的照片。
//
//描述：
//Level 143是后室的第144层，从外观上看很像一座城堡，该城堡占据了该层级大约90%的面积，并被称之为“神圣城堡”，而剩余的10%的面积为室外环境，被称之为“圣地”。
//
//这座神圣城堡的内部与中世纪城堡十分相似，其唯一关键性特征为一层异常的橙色雾气笼罩在该建筑。虽然不建议直接呼吸，但似乎这种橙色雾气是无害的。
//
//目前神圣城堡被分为四个主要部分；
//
//主厅
//主厅内大部分的走廊都占据了城堡大部分的建筑，在该区域中能随时看到神圣骑士在执行巡逻工作，他们都是一群身穿盔甲、挥舞着刀剑的敌意实体，该实体会试图追逐他们所遇到的所有流浪者，并用他们的刀剑杀死流浪者，神圣骑士只有在看不见目标时才会停止追逐，所以绕过他们是一个可行的逃跑路线，失去追逐目标后，神圣骑士将会返回原来的巡逻路线。
//
//主厅是神圣城堡最为安全的区域，此外该区域还会连接至城堡的其他不同区域。
//
//宴会厅
//宴会厅是一个较为宽敞的房间，其内部有几张长方形餐桌，桌子上摆放着南瓜派、苹果味太妃糖或者玉米糖之类食物，这里也有装有红葡萄酒的高脚杯，因此该区域是获取食物的最佳区域，
//
//宴会厅是神圣骑士和幽灵的主要聚集地，幽灵是坐在餐桌旁的如同鬼魂一样的实体，他们会与坐在桌子旁的其他实体进行交流，若一名流浪者从盘子中拿走一些食物的话，那么幽灵就会站起身来追逐流浪者，除非流浪者把拿走的食物扔在地上，否则幽灵不会对流浪者表示好意。然而，幽灵在任何情况下都不会离开宴会厅。除非流浪者放下食物或离开宴会厅的话，不然幽灵永不会停止对流浪者的追逐行为。
//
//此外宴会厅的所有出口都通向主厅。
//
//酿酒厂
//酿酒厂是一个中等大小的房间，其内部装满了锅炉和摆放在货架上的药水，该区域是最危险的区域之一，但被认为是最有用的区域。
//
//这家酿酒厂中徘徊着女巫，女巫是最为残暴的实体，会使用一些列所酿造出的药水来攻击流浪者，并使其造成伤害，有一些实体会直接毒死流浪者，而有一部分实体会释放“魔法”来攻击流浪者，女巫由于本身非常弱，因此无法以物理方式攻击流浪者。
//
//流浪者可以使用货架上所摆放的药水击败女巫，每种药水都标有它们本身的作用。杀死一个女巫并不能将他们永久地清除，因为似乎在十分钟后它们就会复活，到目前为止还未清楚女巫是如何做到这一点的。
//
//从酿酒厂入口处中的最远距离的出口通向了神圣城堡的最后一个区域。
//
//军营
//军营是由一些列相互连接的房间所组成的区域，其内部有着各式各样的中世纪武器，从长弓到圣刀，都由神圣骑士所携带，而且此类武器有神圣骑士所严密看守。
//
//神圣贸易委员会（HTC）将为此类武器交纳最高的价格，对于那些勇敢或者愚蠢到试图偷走其中一些武器的流浪者来说，大多数的流浪者将此作为一种存放武器的好方法，尽管在其他方面上也很有用。
//
//值得注意的是，圣刀是后室中最为结实的刀剑之一，目前还未清楚该武器是由什么金属材质所打造的，但该武器会发出明亮的光芒，似乎是其颜色由橙色的微光所组成，据推测，神圣骑士的盔甲是同一种金属材质所制成的，因为在其表面上也有橙色的微光。
//
//圣地
//圣地是位于神圣城堡外的一小块区域，该区域内没有发现任何实体存在，有些树木的树枝并没有叶子生长出来，灌木丛的树叶颜色为橙色，并该区域总是布满着橙色的雾气，似乎这种雾气大部分都是无害的，但我们不建议直接吸入。
//
//圣地的位置位于神圣城堡的正前方，神圣贸易委员会所提供的的资源不多，但他们的基地就在圣地中。
//
//圣地中也会出现Level 143的出口位置，只要走出大门，你就可以回到Level 10。
//
//基地、前哨与社区
//神圣贸易委员会
//完全友好的贸易组织。
//其主要基地位于圣地中。
//可在神圣城堡内发现一些武器和稀有药剂，这些物品可以在该组织的基地中进行交易并获得。
//入口与出口
//入口
//在Level 10中极小的概率能知道一座破败的城堡，进入该城堡后会发现其环境变换为Level 43。
//
//出口
//在圣地上走出大门后将会返回至Level 10。然而，城堡废墟的位置将会被移动。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl143{}