//Level 146
// 
//
//生存难度：
//等级 0
//
//安全
//稳定
//存在友善实体joIyemHMLSpW93X.png
//温暖的壁炉和热汤供给所有人。
//
//快请进！快请进！
//你好，流浪者朋友！我叫Johannes Copely，应M.E.G.的要求来记录我在Level 146，也就是在所谓的感激旅馆的经历。
//
//他们给了我一种格式和特定的口吻来填这个表，但遗憾的是，我没有能力来写得那么闷。不管怎么说，我更喜欢个人化的口吻。希望他们不介意，但我仍会告诉你你想知道的一切。
//
//拿口喝的然后坐好，朋友。把自己弄得舒服点——我这都是好心。
//
//来想象一下，一个寒冷的、永恒的冬天，一件破旧皮夹克和上面覆满的冰与浮雪一并被烤化。想象一下老式木桌木椅的嘎吱声和趿拉声，以及温暖的哈气在你面前打旋，与手中热汤上升的蒸汽相混合的景象。我给你讲我如何遇到感激旅馆的故事时，请用舌尖去感受汤汁的风味。
//
//当时是Level 129一个大风天。我是无意间切出Level 39的边界后到达那里的。这是个意想不到的波折，本来我只想花点时间探索魔法森林以及冥想。更倒霉的是，我没有穿应季的衣服，只有一件简单的风衣外套，里面一件薄T恤，下身是卡其色裤子。
//
//
//
//lKQ86CmL4Rw3DfW.png
//我瞥见了一个木制的轮廓，它在黑暗中从一处剪影中升起。
//
//当我在这一层级徘徊时，我发现自己的处境因远处传来的滚滚雷声和天上飘落的雪花而愈发糟糕。掏出手机，却发现Level 129没有任何信号。因此，当雪花演变成冰雹时，我毫无准备，它们在我四周坠落，猛烈地撞碎在地上。此时天色漆黑，我不得不打开手机自带的手电来照明。似乎跋涉了很久后，我瞥见了一个木制的轮廓，它在黑暗中从一处剪影中升起。那是一扇门，我摸索出门把手，当冰冷的雹子砸在我身后的雪地时，我跌跌撞撞地闯了进去，一股温暖的气流扑面而来，我站直了身子，颤抖地感受着寒气渐渐离开身体。我把双手捂到脸上，发现鼻子和指尖已经冻麻了。我互相搓揉着双手，仔细观察周围的环境。
//
//
//
//VcIMuTNpEYWmwq4.png
//地板和墙壁是由暖和的鹅卵石砌成的……
//
//地板和墙壁是由暖和的鹅卵石砌成的，上面反射出后墙中央的壁炉所闪烁的橙色火光。两边摆着老式桌椅。温暖空气里充满各种气味：栗子、烟、肉、水果，以及从人体和饱经风霜的碗里升起的冰块和蒸汽的味道。松树的味道也在其中挥之不去，来自厅室角落里的一颗盆栽的小树苗。
//
//木制的斜顶上悬挂着灯笼，灯笼之间还有系着红宝石蝴蝶结的花环一直垂到桌面上。白线缝制的桌布上，玻璃杯里烛光闪烁。尽管酒馆规模不大，但有不少像我一样疲惫不堪的旅人在这里喋喋不休。当我合上身后的门时，一个铃铛因此叮当作响，面前有张手绘的木制招牌，上面写着“感激酒馆”。
//
//噢……这是谁来了？看来我现在有了自己的小听众！好吧，我肯定不能让你们干站着，对吧？来，我们到篝火边上去。不管怎么说，故事最好在篝火边上讲。虽然我不认为我是个善讲故事的人，但希望能让你们都乐在其中。特别是孩子们——这是给你们年轻人的重要一课。为什么呢，因为这是一个即使是像我这样的成年人都需要了解和记住的教训。认真听着，所有人。靠近点——我要你们都闭上眼睛，想象下面的部分。专注于这种感觉，这点至关重要。
//
//现在，我讲到哪儿了？哦，对。当我傻站着的时候，一个无面灵走到我面前，递给我一份菜单。菜单是上面绣着金色花纹的光滑深色皮革，我打开一看——嚯啊！是份只有一道菜的菜单：感激汤。我还没来得及想清楚这是啥，就有第二个无面灵穿着女服务员的衣服在我身边停下，用手捂住耳朵，向我表示她在听。我感到困惑，随手点了菜。她点了点头，在小本子上记了点东西，我觉得这事真傻，因为正如我之前所说，能点的东西就一个……
//
//在我等待时，我抽空听了听外面的风雪声。尽管之前来势凶猛，但酒馆还是坚强地立着。我才发现自己已经脱下风衣外套挂在了椅背上，摆脱了外套的束缚，伸了个懒腰。心想我在这儿待着，舒适而温暖，而不是被困在外面的暴风雪中，实在是幸事。
//
//没过多久，那无面灵就回来了，手里端着一碗热汤。我紧盯着汤看，感觉口水都要留下来了。汤是不透明的棕褐色，有点像土豆汤，里面还有两片小香菜叶。我双手捧着碗，感受到木碗的温暖渗入我的皮肤，驱走了体内最后残留的麻木感。
//
//
//
//MjnKEecRguPYSGw.png
//里面有两片小香菜叶。
//
//我盛了一勺，对着嘴边的肉汤吹气，看着眼前的水蒸气像是俏皮的鬼魂一样旋动，张开嘴喝了一口。瞬间，我感到一种狂喜的感觉从我的喉咙滑下，淌过我的整个身体。一种只能描述为活着的情感从指尖回荡到脚趾。我很快就吃完了，这过程中我不仅感到饥饿感的满足，还感到思想和精神上的满足。一种完成了伟大成就的自豪感以及小小幽默带来的谦卑感充斥在我的心里。是的，是这样。我非常感激，感激能在这样一个温暖安全的环境里，避开寒冷和风雪。我又意识到自己还对很多事物心存感激。手里的勺子握着很舒适很方便，嘈杂的聊天声让我听着很惬意。在后室这样一个不寻常的地方活着是如此幸运，以至于我将其视为理所当然。有个可以回去的家，找到一个幸存者社区，被赋予写一篇文章的荣誉，讲述一个可能影响历史进程的故事……这些事都如此简单，但又如此具有革命性，是这样的感激之情。
//
//你说你有没有感受过一把勺子的美？它曲线之精细、质量之完美、发明者之聪明才智、生产者之精确、实用性和简单性、普遍性和独特性、其具有的历史与未来，当我把那柄勺子握在手心时，我意识到自己是多么感激，能够握住这样一件特殊的物件，并且它随叫随到，使用方便。
//
//你是否在想象这种感觉？也许你也体会过一点这种感觉？看看你的身边，有多少人协同合作、生产和发明了你每天使用的物品？你屏幕上的每一个像素，书上的每一页，在家里走的每一步都是由于别人的工作。花点时间去承认别人的努力，大声地或者默默地感谢他们，让这种感激之情温暖你的心灵，升华你的灵魂，同时珍惜这种感情，保管好它，永远不要忘记它，它真的是独一无二的。
//
//感激汤可能只填饱了我一天的肚子，但从那时起，它让我的心里始终充满快乐。如果你发现自己在一个寒冷或黑暗的地方，请去寻找“感激酒馆”。也许我们可以找个时间喝一杯——我请你。
//
//旅途平安，祝你有美好的一天，更重要的是……
//
//谢谢你。
//
//
//
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl146{}