//Level 156
// 
//
//生存难度：
//等级 2
//
// 
// 
// 
//y4m0AE3BpJbTSV_U97zWC-GqrM51xBvvIx1l5PDk0-_OTVV3guahcpTao9nuDp2ynQ05X2H_gFNauH0CMQfVU0SwyvGLw_T-gsKY9r7jvUTXLO9RWMPsYZA-lYaBInNw21Dqlci1VmlDtLlwxE3_ngR822N5qUI-adFTvDKzl-10rXtrG8X_bnaDC8zEaoeHAW3?width=3024&height=3773&cropmode=none
//一张后台的照片。出口通向茉尔小姐的办公室。
//
//y4mGyARv1f8RbuqUYCl2QCL1Wjz3xFY6ycJrt02hSrY3CWj_d5qdETwiNdIGxsKPNwI44RO60tdeMGvL8n4WKkAviPpvmyvpa3k9PpSKJPXw_D_1gf4Kr1usNApBo9oKeluK5pgjZAJGz4wCyp9bB2YHoTgyYz_D6XXbld_VLflhrTaqpOruNSrON4IQO0Cbnm_?width=2633&height=3353&cropmode=none
//一张在后台的三个道具椅的照片。
//
//Level 156是后室的第157层。它是一出高中戏剧演出的后台。
//
//描述：
//Level 156为一高中剧院的后台。它由三个部分组成：后台，茉尔小姐的办公室，更衣室。从与层级中实体的对话与舞台上的声音可以得出，有戏剧正在不断上演，座位区也有观众。
//
//流浪者是有可能进入舞台的，这一举动甚至会被层级中的实体鼓励，然而任何进入舞台的探险者从未返回。流浪者应无视实体的建议并永不进入舞台区域。
//
//从流浪者进入这个层级大约一小时后开始，实体们将立即开始说服他们上台。随着时间的推移，他们的话语将变得不可抗拒。出于这个原因，建议流浪者们在这个层级停留不超过一个小时。
//
//区域：
//后台:
//这是此层级的主要区域。在此区域内，灯光处于被关闭的状态，且流浪者们只被允许用耳语交谈。这里堆积着许多道具，实体可能会时不时地经过。可以听到微弱而难以识别的讲话声和观众们偶尔的笑声。后台右侧有一扇小门通往茉尔小姐的办公室，左侧则有一段向下的楼梯通往层级出口和更衣室。
//
//茉尔小姐的办公室:
//此区域是一个小办公室，供“学生演员”们休息、聊天与放松。与后台区域相反，这里的灯是打开的，且流浪者们可以小声交流。这里有几个沙发，一个大桌子，和一个放着书的小书桌。书籍一般有关表演或是教学。墙上有一些手绘海报，包括“裘力斯凯撒1”，“妈妈咪呀！2”和一些有关未知戏剧的海报。
//
//在大桌子上有一个9英寸的蛋糕，上面用粉色糖霜写着“演出顺利！3”，还有一盘巧克力片饼干，一些常见的零食，以及几瓶杏仁水。所有的食物都可以被安全食用，M.E.G.建议流浪者们食用或者带走这些食物。
//
//一个类人型实体，“艾玛”，可以在桌子旁被找到。详见“实体”一节。
//
//更衣室：
//从后台左侧的台阶向下走到底可以达到更衣室。更衣室的入口是个棕色木门，上面有个牌子写着“进入前请先敲门！谢谢配合。”
//
//门是被锁住的，然而当流浪者敲门时，一个未知的中性声音会说“哦，请进”或是“你现在进来就行”。有很小的几率这个声音会说“嗯，抱歉，请先等一下。”然后会有来自一群未知女性的笑声传来。一分钟后，一个女性声音会问“大家都穿好衣服了吗？好啦，你现在可以进来啦。” 两种情况下，门都会在说话声后开启。
//
//如果流浪者试图在没有敲门的情况下进入，一个中性的声音会不快地告诉他们应该先敲门。道歉会使得门打开。无视或侮辱此声音会导致此门在他们下次进入Level 156前一直保持锁住。
//
//更衣室本身是个充满重复的化妆桌，服装架和储物箱的无限空间。流浪者可以在这里找到服装和化妆品。更衣室里没有任何实体存在。
//
//实体：
//有数个人形实体在Level 156中存在，他们是“学生演员”，“茉尔小姐”，和“艾玛”。他们大多数在第一个小时都是无害的，但是随着时间推移会变得越来越危险。由于未知原因，他们不会被任何物质伤害到，而且他们也不受杏仁水影响。M.E.G. 不建议流浪者与下列任何实体沟通。详见M.E.G. Level 156 音频日志-17。
//
//学生演员:
//学生演员是一群形似人类青少年的实体，通常穿着演出服装。学生演员的数量并不固定，但通常在九到二十人之间。他们会避免长时间的对话，并且更倾向于快速地用耳语回答问题，因为“观众可能会听到我们的”。
//
//在流浪者待在此层级大约一小时后，学生演员们会开始鼓励他们进入舞台，说一些类似“哥们儿，该你上了！” 或 “来吧 [流浪者名字] ，这幕完了就该你了，准备好！”之类的话。如果流浪者拒绝上台，他们会继续劝说流浪者这样做。随着时间的推移，他们的声音会变得越来越难以抗拒。如果流浪者在更衣室里，即使流浪者已经深入那无限空间，也会有两个与流浪者性别相同的学生演员敲门进来劝说。这背后的原因仍然无法解释。
//
//茉尔小姐：
//茉尔小姐是一个形似高挑的金发绿眼高加索女人的实体。有时可以在后台区域找到她；其他时候，学生演员们会告诉流浪者 “她现在不在这里，可能一会儿之后会回来。”
//
//如果流浪者以任何形式打扰了演出（包括大声说话，侮辱其他演员或毁坏道具），茉尔小姐会出现并警告流浪者。流浪者第二次打扰演出时，茉尔小姐会建议也许他应当“直到你上台之前都在我身边呆着”。此命令无法被拒绝，且该流浪者会在十分钟后走上舞台。拯救这种情况下的流浪者是不可能的。
//
//艾玛:
//艾玛是一个形似黑发黑眼亚洲少女的实体。在茉尔小姐的办公室里总能找到她。她很友好，而且总是乐于回答问题。然而，M.E.G.不鼓励流浪者与她交流。请参阅下面的音频日志 17。虽然艾玛很友善，但随着时间的推移，她会加入说服流浪者上台。
//
//隐藏M.E.G. Level 156 音频日志-17:
//音频日志 03/14/2022
//日志开始： 13：57
//参与队伍： M.E.G. 罗经点 - “替补演员”
//
//萝丝： 好了，这里是罗经点兵团 2-7，替补演员。我们在这层呆了十分钟了，现在我们要去与那个在茉尔小姐办公室里的人形实体进行交流。
//
//萝丝： 我们能拿点饼干吗？
//
//“艾玛”： 哦，当然。拿多少都行。这是瑞恩的妈妈带来的。
//
//萝丝： 她人真不错。
//
//“艾玛： 那可不是。
//
//丹尼尔： 所以，呃，抱歉，但你的名字是……？
//
//“艾玛”： 我是艾玛，舞台工作组里的。茉尔小姐让我待在这儿帮你们调整服装和麦克风啥的。我也负责通知大家什么时候上台。你知道吧，就怕有人忘了。
//
//萝丝： 这样啊。你知道我们俩什么时候上台吗？
//
//“艾玛”： 让我看看（纸页翻动声）你在第五幕第十二场上台，他在第四幕第七场上。你们俩还都有很多时间。现在才第二幕第五场。
//
//萝丝： 那我们最后一次出场是在？
//
//“艾玛”：（纸页翻动声）我……我看看……（纸页翻动声）可恶，我记得是第一百三十二幕第二十一场，但我得再看一下。我待会儿告诉你。
//
//萝丝： 行，谢谢。
//
//“艾玛”： 没问题，乐意为您效劳！（咯咯笑）
//
//丹尼尔： 我们演出结束后要干嘛呢？
//
//“艾玛”： 我不知道。茉尔小姐可能会想恭喜咱们一下，你知道的。但是估计真的没什么。（停顿） 我刚刚在观众里看到你妈妈了，所以你可能演出结束后就直接跟她回家了吧。
//
//丹尼尔： ……什么？我妈妈？
//
//“艾玛”： 对啊。我看到一个穿黄裙子的女士，戴着蛮配套的可爱眼镜。她带着两个小女孩走进来了，然后我就想“啊，那肯定就是丹尼尔他们家！” 她们不是你的妈妈和妹妹吗？
//
//丹尼尔： 什么……
//
//萝丝： (耳语) 丹，这不是真的！
//
//“艾玛”： 什么叫这不是真的？我亲眼看到她们了。啊等等！这是不是个惊喜来着？我是不是刚把它毁了？该死！对不起丹尼尔，我不知道这是个给你的惊喜。
//
//萝丝： (耳语) 别做傻事，丹尼尔。
//
//丹尼尔: 萝丝……让我……我就从幕布后面看一眼就好……
//
//萝丝： 醒醒！她们不在这里！这里不是前厅！
//
//丹尼尔： 我就看一眼。
//
//萝丝： (提高声音) 丹尼尔！
//
//“艾玛”： 别这么大声！观众可能会听到我们的。我们可不想毁了这出戏！
//
//(远处的脚步声靠近)
//
//“茉尔小姐”： 嘿，各位，别这么大声，好吗？
//
//萝丝： 抱歉，茉尔小姐。
//
//“茉尔小姐”： 没关系。只要别那么吵就好。
//
//(脚步声远去)
//
//萝丝： 丹尼尔，我们离开这层吧。
//
//(急促的脚步声，沙沙声)
//
//萝丝： 丹尼尔，别！
//
//日志结束： 14：05
//
//总结： M.E.G. 罗经点军团 “替补演员” 与实体“艾玛”交流并取得了关于戏剧的基本信息。在对话结束后，探险者丹尼尔接近了幕布，然后，不知是否有意地，走上了舞台。探险者萝丝呼叫了增援并等待丹尼尔归来，直到一小时后，一些实体（学生演员）开始催促她上台。探险者萝丝随后离开了此层。探险者丹尼尔至今下落不明。
//
//基地、前哨与社区：
//该层级没有已知的基地、前哨或社区。
//
//入口与出口：
//入口
//要想进入，你需要找到首页用黑色字印刷着“春季戏剧”的剧本（该剧本可以是任何类型的任何剧本，无论是听说过还是没听说过的）。剧本的内容无法看清，仿佛它是由故障的打印机打印出的一样。这些剧本几乎可以在除Level 0外的所有层级中找到。将剧本握在手中并进入任何门就可以将您带到这个层级。进入后，剧本会自动消失。
//
//出口
//只需通过建筑物的出口（位于更衣室对面，带有出口标志的黑色门），您就可以离开此层级。出口会带你到Level 52，但它有很小的机会会带你到Level 117。
//
//据悉，流浪者离开这个层级​​后，会有一种“一件很美好的事刚刚结束了”的感觉4 ，这种感觉会持续大概十分钟。杏仁水可以帮助缓解这种感觉。
//
//作者信息
//« Level 155 | Level 156 | Level 157 »
//
//脚注
//1. 译注：莎士比亚经典戏剧
//2. 译注：百老汇经典音乐剧
//3. 译注：原文 Break A Leg!，为用于祝愿演员演出成功的常用语。
//4. 这句话在M.E.G.探险家们的报告中反复出现过
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl156{}