//Level 180
// 
//
//生存难度：
//驻军存在
//宜居聚居地
//无有害实体FirstFleetShip
//第一舰队旗舰的照片，摄于兰利港三区。
//
//Level 180 是后室的第181层。此层级是一片浩瀚的海洋，有许多岛屿，岛上的建筑和船只与16世纪的相近。
//
//描述
//Level 180，或称其为“旅者之海”，似乎是一片无边无际的海洋，因海水受其不同区域变化的重力的影响，部分海平面呈现出像山坡或山地的地形。普通海洋应有的各种"洋流" — 没有更合适的词语以形容1— 似乎并不存在于岛屿周围与深海的海域中；然而根据先前的航行经验，这些不可见的洋流可以像真正的水一样影响航行。借助这些洋流航行时，看起来就像是在稀薄的空气中航行，此时下方的海床不再可见。这些洋流在《“旅者之海”海图及参考地图》中被用于将碧蓝的海洋划分为不同的区域，并作为这些被分割的区域之间的边界线。
//
//这些洋流一段可长达约一公里，是相当危险且不稳定的，同时它也会产生重力扭曲现象。同样危险的还有一种粘稠的灰色海水，与海水相比更不透明。“摆渡人”和海军通常都只会避开灰海，因为许多人都认为灰海中含有一种神秘的物质，并称其为 海洋异形
//Sea Anomaly
// 或 后室海妖
//Backroom's kraken
// 。尽管如此，目前还没有关于受海洋异形袭击或其幸存者的报告。
//
//被称为 荷兰人
//Dutchmen
// 的实体经常在开阔水域中航行，并藏身于重力扭曲程度高的地区，以伏击受害者。他们对大多数船只怀有敌意，然而由于其船只维修不善，很容易逃脱追捕。由于荷兰人基础设施脆弱，一次强制使荷兰人停泊的尝试以造成一场毁灭性灾难告终。
//
//在海洋的各个岛屿上，可以发现一些失修状态下的临时住房和废弃船只，包括从单桅帆船到大型帆船的各种船只。这些船只的建造者尚不清楚。在这些岛屿上，城镇、港口和据点都几乎没有磨损，其内充满了设备，但由于维护不善而磨损严重。据推测，过去各有一个实体原住民居住在这些岛屿上，利用从各种失事船只中找到的零件建造了这些城镇。
//
//在各个岛屿上都发现了通往其他层级的出口。因此，许多流浪者迁移到此层级定居，并修复轻度受损的船只，充当连接各个岛屿之间的商业渡轮。他们通过将其他流浪者送到其他层级的出口以换取贵重物品，包括小道消息、黄金、食物和水，或者是稀有物品。这些人被称为“摆渡人”。
//
//随着商业航路的建立，海盗开始出现，它们威胁摆渡人的船只并抢劫旅者的食物、水和贵重物品。面对荷兰人对部分摆渡人的小型船只形成的压倒性威胁，一位被称为 兰利元帅
//Grand Admiral Langley
// 的人迅速组建了 后室卫队海军
//Backrooms Guardian Navy
// ，更准确地说，是 第一卫队
//1st Guardian Fleet
// 。这支快速建立的海军租给了大型摆渡人船只拥有者或愿意出高价的摆渡人，从而极大的减少了海盗的威胁。
//
//需要注意的是，指派一艘后室卫队海军的船只来支援并不是一张一定能摆脱困境的保命牌，许多船只已经被大胆的海盗船和荷兰人击沉。不过，更多的舰队已被建立，作为应急响应预备队和雇佣军舰队。建议旅者和流浪者阅读并研究《“旅者之海”海图及参考地图》，以获取有关在该层级航行的更多信息。
//
//在遭遇紧急情况时，不用担心，联系他们中的任何一人，M.E.G.将帮助支付到达合理层级出口的费用。以下是已知舰队及其注册船舶的列表。
//
//第二卫队(2nd Guardian Fleet) 是一支正规舰队，人员包括：
//
//- 隐藏巡逻船舶名单
//LOS2 Mercutio号大型帆船 (现役)
//目前载有110名现役海员和32门满载舰炮，Mercutio号是第二卫队的旗舰。由准将Daykin领导。
//
//LOS Friar Lawrence号大型帆船 (现役)
//目前载有98名现役海员和28门满载舰炮。
//
//LOS Tybalt号双桅帆船 (歼灭)
//护送过程中击沉。船员失踪，推定死亡。
//
//LOS Romeo号双桅帆船 (现役)
//目前载有22名现役海员和10门满载舰炮。
//
//LOS Juliett号双桅帆船 (现役)
//目前载有22名现役海员和12门满载舰炮。
//
//LOS Count Paris号单桅帆船 (歼灭)
//巡逻时击沉。一些船员获救。敌舰已击沉。
//
//LOS Benvolio号单桅帆船 (歼灭)
//巡逻时击沉。一些船员获救。
//
//LOS Capulet单桅帆船 (闲置)
//在蒙提港临时休整。
//
//LOS Montague单桅帆船 (现役)
//目前载有18名现役海员和18门满载舰炮。
//
//LOS Balthasar单桅帆船 (现役)
//目前载有18名现役海员和18门满载舰炮。
//
//第三卫队(3rd Guardian Fleet) 是一支正规舰队，人员包括：
//
//- 隐藏巡逻船舶名单
//LOS Shmue号大型帆船 (现役)
//目前有89名现役海员和31门满载舰炮。BGN Shmuel是第三卫队的旗舰。由准将Monsour领导。
//
//LOS Pavel号大型帆船 (现役)
//目前有90名现役海员和30门满载舰炮。
//
//LOS Kotler号双桅帆船 (歼灭)
//未确认损失。于鲍尔港击沉。
//
//LOS Maria号双桅帆船 (现役)
//目前有24名现役海员和14门满载舰炮。
//
//LOS Leon号双桅帆船 (现役)
//目前有20名现役海员和12门满载舰炮。
//
//LOS Bruno号单桅帆船 (现役)
//目前有16名现役海员和6门满载舰炮。
//
//LOS Gretel号单桅帆船 (现役)
//目前有15名现役海员和6门满载舰炮。
//
//第四卫队特种舰队(4th Guardian Specialist Fleet)是一组特别组建的精英重型战舰群，人员包括：
//
//- 隐藏第四卫队巡逻船舶名单
//LOS Mitty号海岸警卫队 (现役)
//后室卫队海军相关，信息不予公开。由Skaro领导。
//
//LOS Melhoff号海岸警卫队 (现役)
//后室卫队海军相关，信息不予公开。由Langley领导。 (不要和兰利元帅搞混了)
//
//LOS Hendricks号海岸警卫队 (现役)
//后室卫队海军相关，信息不予公开。由Richie领导。
//
//LOS O’Connel号海岸警卫队 (现役)
//后室卫队海军相关，信息不予公开。由Barbosa领导。
//
//LOS Maher号海岸警卫队 (现役)
//后室卫队海军相关，信息不予公开。由Minte领导。
//
//LOS Odessa号海岸警卫队 (现役)
//后室卫队海军相关，信息不予公开。由Tom领导。
//
//第五卫队快速反应舰队(5th Guardian Response Fleet)是一个快速反应部队，人员包括：
//
//- 隐藏巡逻船舶名单
//LOS John号单桅帆船 (歼灭)
//执行快速反应任务时被歼灭。船员全数获救。
//
//LOS Nancy号单桅帆船 (现役)
//目前有18名现役海员和8门满载舰炮。
//
//LOS Red Dog号单桅帆船 (歼灭)
//执行快速反应任务时被歼灭。船员部分获救，其余失踪。
//
//LOS Jocko号单桅帆船 (现役)
//目前有18名现役海员和8门满载舰炮。
//
//LOS Peeto号单桅帆船 (现役)
//目前有18名现役海员和8门满载舰炮。
//
//LOS Vanno号单桅帆船 (歼灭)
//执行快速反应任务时被歼灭。与敌舰同归于尽。
//
//实体
//鱼类确实栖息于“旅者之海”，但目前尚不清楚它们本身就存在与此层级，还是通过其他海洋切入的。此实体放在这里是为了作为样板。
//
//较为常见的实体之一是荷兰人，一艘没有船员并缺少维护的船。在极少数情况下，在整个层级都可以看到荷兰人。船体上有较大的缺口，但不会被洪水淹没。然而，炮火可以对它造成伤害，并且可以使其下沉。水手们都认为，荷兰人是古老的幽灵船，它们独自航行，在光荣的战斗中死去，而不是像死亡或失踪的船员一样在岩石或海岸上死去。然而，这些传说没有任何证据支撑。
//
//一种很少遇到的罕见的实体，被称为海洋异形或后室海妖。报告称，它寄身于淤泥中，偶尔通过“洋流”到达另一个淤泥中。据目击者推测，这是一个球状实体，其多边形触手状长达十几米。虽然没有船只遭到袭击的报告，但经常有船只失踪。一些偏执的水手声称是海洋异形袭击了他们。
//
//已建立的港口与社区
//莫提港
//莫提港是Level 180中建立时间最长的社区和港口之一，港口内有一个小城镇，最初发现时只因人口过度增长而略显混乱。它靠近交通繁忙的出口，同时又是Level 180的主要入口，被称为商人中心。位于岛的另一端有一个干船坞，用于维修和定制作业，但价格非常昂贵。
//
//兰利港
//以后室卫队海军元帅的名字命名。这是海军的一个武装要塞，各处都是修复枪支和大炮的工厂，还有装满火药的储藏室，供远征使用。港口内有一个小镇，但它仅限于海军人员进入，守军会对未经许可接近的人发出警告并开火。
//
//达尔利港
//达尔利港是一个以聚会和啤酒闻名的小镇，当地有一家酿酒厂，由一家于Level 180创立公司管理，是最受海盗、海军和平民欢迎的地点之一。值得注意的是，所有停靠的船只都必须相互停火，任何人开火的行为都会受到岛上一些或小或大的堡垒的联合攻击，大型堡垒配备了更强大的火力和更多的人力。
//
//鲍尔港
//鲍尔港的位置未知，这个地点的位置只被一些海盗船长所知。因此，许多人认为这只是一个传说——然而；由于它声名狼藉，被认为是“海盗交流中心”，因而它被列在这个名单上。若有流浪者知晓相关信息，请向M.E.G.或后室海军卫队人员汇报。
//
//入口与出口：
//进入Level 180的入口通常可以在浸湿的木墙内找到，尤其是橡木或松木材质的，它将通向莫提港的城镇广场。
//
//Level 180是一个商业交通枢纽，请参阅 《“旅者之海”海图及参考地图》
//Voyager Sea Charts and Reference Map
// 获取已知港口、层级入口、层级出口以及停靠程序、税收和注册信息等相关信息。
//
//作者信息
//« Level 179 | Level 180 | Level 181 »
//
//Footnotes
//1. 译注：原文如此
//2. 译注：LOS推测为Law Of the Sea的缩写，下文同。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl180{}