//Level 103
//等级分类
//
//yruFdwNa8zEjxmX.jpg
//白天的航空母舰
//
//实例：Level 103 - “航空母舰”
//类型：水上
//生存机会：高。舰上的部分地区没有任何危险，并且可以收集到大量的物资。
//特性：来自海洋的浓雾和水都能修复对航母造成的任何损害。
//生物存在: 低。任意时间内都存在着少量实体。
//非欧几里得性质：高。走廊会循环和重叠，却没有物理上的连接。
//区域稳定性： 可能稳定。
//
//最终分类： Class 1
//CSE分级：AQU_N-EUC1
//
//附加说明: 一艘非欧几里得结构的航空母舰，从外部看起来它的空间是有限的，而事实上它的内部可能是无限的。
//
//描述
//
//尽管在无尽之海中航行，这艘航空母舰依然屹立不倒并保持坚韧：它为了存续并对抗一切危险而建造；它没有目标，没有目的地，只以自由和自己的意志为方向。
//据推测，Level 103是一片无限大小的水域，因此在口头上可以称它为Ocean 103；因为缺乏测量这片海洋确切面积的手段，因此无限只是一个近似值。
//
//NOorYCajsU5MPx4.jpg
//有时，这艘航空母舰会停靠在一个浮船坞旁边。在这里，流浪者可以取走各种补给品，但如果他们花了太多的时间，航空母舰就会自己开走而留下他们。
//
//也许它航行在一条看似偶然的路线上，但它会找到一个目的地；有时航母会在一个浮船坞上停上几分钟。
//停靠的船坞上有着许多装满贵重补给的供应箱，因为此时会形成一道临时的桥，它会在航母和船坞之间形成连接，所以流浪者可以把补给搬到船上。
//这些板条箱——尽管很大——但永远不会装满补给；与此相反，少量的补给会在箱子里集中摆放在一起，其中包括各种物品和工具，包括但不限于：杏仁水，它可能装在瓶子里或是别的容器里；傻瓜口香糖，他可能装在小袋子或是玻璃罐里；火盐，它会装在密封的金属箱里；以及寂静汁液，它会是粉末状的，装在另一个金属箱里。
//
//航空母舰会在短暂的停留后离开，所以要尽可能快速地收集补给。如果有人被抛弃且迷失在了这里，对于其他人来说，他们的命运会变成未知数，因为没有人再看到过他们，而且除了船以外的地方没有任何的出口。留在那里的所有流浪者都被认为是已经死了。
//
//与我们正常的现实无异，Level 103有着与前厅相似的日照周期，大约有8个小时的夜间和16个小时的白天。
//
//由于该层级没有任何的海底动物和植物，它的主要特征和细节都来自于航母本身。看似有限的外表，却有着非欧几里得的内在——一旦进入——所有的走廊都会相互重叠，形成无限的迷宫，房间和走廊排列错综复杂；不过，任何标记为出口的通道都会将流浪者带回外面。
//
//由于采用了坚固的材料建造，这艘航母非常地稳定和牢固，在任何时候都不会出现任何损坏或刮伤的迹象。对航母造成的任何损坏，只要通过浓雾或周围的水接触到受损区域，就会被立即修复。这些效果似乎只对航母有效，因为伤口和损坏的物体都不能用同样的方法愈合或修复。
//
//作为航空母舰的主体结构，舰岛也具有上述的非欧几里德性质。如果有人走近墙壁，控制室将无缝地向前延伸到无穷大。只要流浪者留在原地，这些变化就会一直存在；如果流浪者离开，房间就会开始收缩，直到它达到最初的形状。
//
//战斗机和直升机都在航空母舰上，但都无法使用。因为航母的内部已经被上文所提到的房间和走廊所填满，机库和任何甲板都在内部消失了。
//飞机上的燃料可以被取走，用在许多散落在航母里的发电机上。这些发电机通常被流浪者和社区用作他们自己的基地和前哨的能源供应，机器虽然不大，但它能为许多流浪者提供照顾。
//此外，如果航母上飞机在浓雾中穿行，那么燃料就会再生；航母在浓雾中停留的时间越长，燃料就再生得越多，从而产生无限的能源。然而，雾有时需要几个星期才能再次形成，所以必须找到其他能源，或者等待航母重定向至这些基地——尽管此时仍然会发生电涌现象。
//
//下层旅行
//走进楼下怪异的走廊，它们的外表没有什么特点。墙壁上覆盖着蓝色、红色，有时还有灰色的金属管；地板是用干净的、亮晶晶的米色金属制成的，屋顶也是用同样的材料制成的；偶尔，人们还会遇到电线、电路、门，甚至窗户。这些窗户没有任何的异常效果。
//
//好奇心会引导许多人进入这个走廊上的无数个门，大多数情况下，这将导致人们进入到一个独特的房间。房间之间有很大的不同，下文列出了有记录的房间类型及简要描述，但必须记住，实体会在这些走廊和房间中游荡，因此应该非常谨慎地进行探索。
//
//房间名	简要说明	补给（如果有）	威胁（如果有）
//创伤中心	这是一个为遭受重大事故的病人提供治疗的房间，里面有着各种材料。大多数设备已经失去了作用，但可以作为废料处理。	有时也可以找到医疗用品，但十分罕见。	损坏机器的电路和暴露在外的电线，可能导致触电。
//铺位	这是一个装满床和床垫的房间，其环境通常十分恶劣。	无。	无。从理论上讲，如果门能被锁上，以避免任何外界的危险，它就可以作为一个房间休息。
//食堂	一个摆满了桌子和空柜台的大房间。大多数时候似乎缺少电子产品或电器，但有些房间可能还有着一些电子产品或电器。	食物被认为是有毒的，因此杏仁水是唯一有价值的补给。	通常有着许多实体。
//机舱	一个中等大小的房间，包含最多三个大型发动机，应该是航空母舰的动力来源。它们不能被关闭，因为在之前尝试过数次，都没有作用。	有时，可以在红色的工具箱中找到一些工具。	很吵。长时间地呆在这里会变得震耳欲聋。
//生物危害控制室	充满生物危害物质的房间。培养着高传染性病毒和其他危险的东西。建议不要接触房间内的任何东西，以免传播任何疾病。	无。	充斥着危险的病毒和细菌。房间内存在的实体可能会被感染。
// 
//无尽的走廊里的水管被涂上了三种不同的颜色：蓝色，红色和灰色。
//蓝色的水管会从海洋中抽水，然后通过一个巨大的管网进行内外循环的输送，将海水送达每一个喷水器，这些喷水器会将海水喷洒到航母内部任何受损的区域。
//红色的管道会传输一种独特的红色物质，这种物质很难检测；因为它蒸发的速度很快，一旦把它从红管中取出，它就会迅速地消失，这导致了它无法被取走。顺着管道走有时会到达生物危害控制室，它最终会连接到某种发电机或离心机之中。
//灰色的管道会将氧气输送到整个走廊，因为走廊从任何起点延伸的越远，氧气的含量就越少。这些氧气会被连接到空调设备中，为流浪者的生存提供足够的氧气。
//
//据推测，所有的能量都是由机舱中的许多发动机提供的。这些能量通过一个巨大的电网传输，而这个电网与该层级中的所有电器相连。
//电涌现象时有发生，可能是某些关键区域的实体或机器开启导致的电源过载或中断造成的。大多数机器虽然无法使用，但似乎任何地点的机器都在消耗电力。
//房间内通常都会有一些插座，这些插座会提供稳定的电力，尽管它提供的电力非常低，在这里充电非常的耗时间。
//
//实体
//实体会在船的内部自由游荡。有时候，一些走廊和房间会全都是它们的身影。然而，想要在船里活动却不遇到它们是不可能的。因此，人们应该对一系列独特的房间提高警惕，这些房间必定有着可能导致严重伤害甚至死亡的危险。
//通常，这些房间有着非常醒目的特征，表明它们会对流浪者构成严重威胁，但即便如此，我们还是在下文添加了一个指南，它应该有助于减少Level 103中流浪者遇到威胁的数量。
//
//不要相信黑暗。
//没有任何形式的光源的房间。实体可以隐藏在黑暗中，等待你掉入它们的陷阱。
//
//如果你听到了声音，它们并不友善。
//流浪者不会寻求帮助；如果你听到了，就忽略它。实体会被声音吸引，你不应该让它们有机会来找到你。
//
//后室中没有人会那么友善；不要相信任何邀约
//请记住，一个人太过友好并不意味着可以相信。没有人能保证你的安全，任何邀约都有可能会让你走向深渊。
//
//如果你发现了一个实体，请不要进入附近的任何一个房间。
//如果一个实体在附近，那么完全可以假设在附近的房间中也有着实体，不应该与之接触。慢慢地离开并寻找另一条走廊。
//
//如果房间里充满了气球，请立即逃跑；你并不安全。
//你绝对不想参与这个派对。
//
//如果一个房间看起来是空的，就不要进入它。这可能是腐朽的表现。
//[损坏的数据] - 空洞…虚无…加入那些已经不复存在的东西。
//
//如果灯光关闭了，不要发出任何声音，尽可能地逃跑，实体会开始寻找你，当灯光再次被打开时，你不会想呆在原地。
//如果灯突然因为电涌而关闭时，你应该立即逃离你当前的位置。值得注意的是，停电只会发生在船的某个区域，所以只要你跑得足够快，你就一定会来到一个更安全、更明亮且没有任何危险的区域。
//
//如果一扇门和周围的区域被血覆盖，这可能是血室的入口。无论如何都不应该进入它，进去就一定会导致死亡
//血室是一个永远都不应该进入的地方。在这里，就连折磨和死亡都是一种享受，在你死之前，你会受尽痛苦。
//
//总体来说，Level 103有大量实体的记录，最常见的是：笑魇、肢团、窃皮者、Nguithr'xurhs、派对客和寄生涂料。
//在这个层级的内部还有着其他的很多实体，但在航母的顶层还没有实体活动的记录，这使得流浪者能够在这个区域安全的居住。控制室也没有任何的实体，但由于它与下面的走廊相连，所以有一天会有实体找到这条上来的路。
//
//基地、前哨和社区
//掠夺者
//哈哈，我们知道我们的名字可能有点吓人，但其实我们真的很友好！
//很高兴认识你。我的名字是William，是掠夺者的创始人，它是位于Level 103的一个友好的社区，我们依靠着船坞和楼下无数的房间里找到的许多物资而蓬勃发展。
//帮助需要帮助的流浪者是我们的首要任务，所以如果你发现自己在这个层级，来打个招呼吧！我们这里大概住着58个友好的人，我们总是会兴奋地把新人带到我们简陋的定居点。
//
//掠夺者是由一个名叫William的流浪者所创立的一个友好的社区。他们的主要目标是为任何来到Level 103的流浪者提供照顾和帮助。
//虽然只有58名流浪者居住在他们那里，但在报告中他们总共有172名成员，许多人会积极地在房间和走廊里收集医疗用品和工具。
//
//入口与出口
//入口
//要进入Level 103，流浪者必须要在Level 17找到一个有着特殊标记的出口门 。这个门被深灰色的哑光涂料完全覆盖，底部有着两到三条的黄色条纹。
//如果有两条条纹，这就代表着这扇门通向Level 103的顶部；相比之下，进入到三条条纹的门的人会发现他们进入到了航母的内部——通常是在一个房间里，但也有例外。2
//
//出口
//流浪者想要离开这个层级则需找到一个创伤中心房间，里面有一扇被霓虹灯包围的门。最初，人们认为它只会通向Level 103内的另一个房间，但经过两次简单的调查之后，人们发现它反而会通向Level 109。
//
//
//[+] 作者/许可
//« Level 102 | Level 103 | Level 104 »
//
//Footnotes
//1. CSE 分级
//2. 多份报告显示，一些流浪者进入了三扇黄色条纹的门后发现自己在走廊里，甚至在Level 103的控制塔里，这与常见的情况截然不同
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl103{}