//Level 161
//
//
//
//Level 161
//
// 
//
//生存难度：
// 未分级
// 
// 
//Level 161，也被称作停尸间，这是一个在后室中高度无事实证明的，且难以解释的层级。停尸间是一个极度令人不安并与世隔绝的地方。它拥有看似无穷无尽的房间和楼层，向各个方向无限延伸。所有的房间都模仿了20世纪40年代美国郊区的家庭，由当时具有代表性的材料制成，如彩纸和胶水。从理论上讲，这座停尸间是一幅反映20世纪中期美国家庭的立体画。
//
//由于这种结构，停尸间内的设施，如浴缸、水槽、卫生间、冰箱、淋浴器、烤箱和炉灶，均为纯粹的装饰品因而无法使用。这一层的所有食物和水都是经过加工或涂刷的，均不可食用。对于那些发现自己在停尸间里的流浪者来说，如果他们没有预先准备好的口粮供应，或者无法逃离这个层级，他们可能会在几天内饿死或死于脱水。
//
//在这个层级上不存在基地、前哨站或社区。除了修补匠和几位倒霉的流浪者之外，在这个层面上没有任何生命的迹象。许多房间都有窗户，但通过它们只能看到其他相邻的房间。没有可感知的天空，也不知道该层是否有昼夜循环。停尸间内的整体温度在大约60°F（15°C）。十分寒冷，即使有功能性空调或加热器，它似乎也不会波动。然而，由于未知原因，流浪者们可以发现从某些房间中已关闭的门下方可能会吹来微风。如果你感觉到一股微风从一扇门吹来，很有可能在它后面是停尸间的一个关键特征，也是它被这样命名的原因：一具“尸体”。
//
//
//
//人们注意到，一种持续的嗡嗡声一直存在着。其位置和成因目前未知。下面是声音的录音：
//
//
//
//
//
//在停尸间里，虽然缺少实体的存在，但在许多房间里，可以发现几具尸体间歇性地出现在不同的位置。这些尸体似乎也具有代表性——虽然它们与尸体非常相似，但它们是由塑料制成的，被认为是真人大小的人偶。每一个人偶都保存完好，类似于一个刚刚去世的人的尸体。每一个人偶都经过了修改，以代表各种死亡原因，其中的一些人偶被肢解或以其他各种方式受伤。在人偶的表面和周围区域，经常会有血被涂抹在上面，暗示着其遭受了暴力行为。人偶们的外表与年龄各不相同。有些看起来像是模仿老人的样子，而有些则是模仿小孩子的样子。每个人偶都可以以这样或那样的方式被推定为“死亡”。自从人偶可能会发现在停尸间开始，几乎所有人偶的死亡原因均是独一无二的，很少能发现几个人偶以同样的方式被“杀死”。下面是一些在停尸间中发现的被记录在案的“尸体”的例子。
//
//
//
//⚠️ 内容警告 ⚠️
//以下的一节文章中包含着以图片形式展现的一些事件以及对图片中所展示事件的文字描述。不仅包含着过度血腥的场面，还包含有尖锐物品，伤口以及暴力场面。这些均将会被以语言的形式被描述出来。所有罗列于此的信息均是为了说明停尸间内部的情况以及保证在此逗留之人的安全。虽然我们鼓励大家通读这篇文章以便充分了解这一层级的危险性。但是下面所罗列出的一些细节可能会让人感到很不舒服。
//
//所有记录在案的尸体：
//33288707225_5f3d14e828_b.jpg
//1号尸体
//
//死在婴儿房中的女婴
//死因： 锐器伤害致死 (锐器自眼窝处刺入形成伤口而死)
//致死类型： 立刻死亡
//32906203540_29e6a6aa6b_b.jpg
//2号尸体.
//
//死在厨房中的成年女性
//死因： 未知 (推测为疾病发作而死)
//致死类型： 立刻死亡
//32474175943_661a1f6d15_b.jpg
//3号尸体
//
//死在客厅的成年女性
//死因： 锐器伤害致死 (被屠刀刺伤腹部而死)
//致死类型： 立刻死亡
//33288823215_153bd5782c_b.jpg
//4号尸体
//
//死在卧室中的青年女性
//死因： 未知 (推测为窒息而死)
//致死类型： 缓慢致死
//33247955046_480e3f1c9e_w.jpg
//5号尸体
//
//死在浴室中的年长女性
//死因： 未知 (推测为溺水或是窒息而死)
//致死类型： 缓慢致死
//33160835881_e74375448e_c.jpg
//6号尸体
//
//卧室中的成年男性
//死因： 位于后脑处的枪伤致死
//致死类型： 立刻死亡
//修补匠
//
//
//
//33133770662_bfc353491c_c.jpg
//关于修补匠唯一已知的照片
//
//现在在停尸间中已知有一个被称作“修补匠”的人类居住在那里。在这篇文章被撰写时，修补匠是人类还是实体依旧未知。他穿着穿着格子裙衬衫和红色无檐帽。他的真实年龄依旧未知，但他目测为一名成年人。目前任何与他交流的尝试均以失败告终。唯一一张他的照片是在他不知情的情况下拍摄的。修补匠可在有尸体的屋子中随机出现。遇到他是极为罕见的。当被发现时，修补匠将会立刻停下手上正在做的事情并且会在流浪者不注意时离开房间。
//
//虽然修补匠的行为背后的最终动机仍不得而知，但他表现出了明显的行为模式。修补匠会在停尸间里四处走动，寻找人偶的“尸体”。在找到一具“尸体”后，他会在“尸体”旁边弯腰，开始检查并进行临时“尸检”。修补匠总是随身携带一本笔记本和一支笔，用来记录可能的死亡原因，以及“尸体”在“活着”时的任何信息。比如名字、出生日期，甚至家乡。修补匠也可以写下他认为是“尸体”死亡背后的动机，通常宣称这些动机不是意外就是谋杀。在完成“尸检”、得出结论并完成笔记后，修补匠将在笔记上签名（简单地写着“修补匠”）并将其留在“尸体”旁边。如果“尸体”在地面上或者被抬高，修补匠则会将其留在相邻的平面上。到目前为止，流浪者们已经找到了包括修补匠的笔记在内的大约20张笔记。
//
//Sarah Joeseph Bushart
//1899-1942, 死者时年43岁
//故乡： 布鲁塞尔
//死因： 颈部切口致死
//死者身上其他地方也有有多处伤口：头部有钝器伤，膝盖和胫骨有瘀伤，以及左脚的小伤口。和一个在左脚上的小切口。凶器是一个距尸体3米远的一个染血的餐刀。推测为一起谋杀案，在现场并未发现扭打的迹象。距尸体4步远的地方有一个洗衣篮，和一个倒置的鞋。受害者的表情十分惊讶。屋子内部的灯都打开着，门都关着。这似乎是一起凶杀案，动机未知。
//
//在Bushart在外面拿着一个洗衣篮时，杀手打开了门。当看到入侵者时，Bushart丢下了洗衣篮并被快速地切开了喉咙。她瘫倒在地板上。凶手扔掉刀，关上门并离开了现场。
//
//一些补充：
//人类惊讶时会掉落物体的理论得到了证实。
//
//如果一个人类很快就受伤了，他们将会更少的去尝试反击。
//
//一个深深的伤口足以杀死一个人。
//
//如果一个人因受伤而丧失了行动能力，那么他们痉挛的可能性就会降低。
//
//许多杀手把武器留在了现场也许离开武器是杀人的一部分？（还需进一步调查）
//
//修补匠
//
//
//
//出口与入口
//
//只有一条路通往停尸间，那条路就在Level 5。停尸间可在主大厅中找到一个充满人偶的屋子并与之互动后进入。对于出口，目前已知的唯一出路是找到一间黑暗的洗衣房然后进入其中一台洗衣机。这样做可能会导致来到Level 41。并不是所有洗衣机都会以这种方式运行。所以流浪者们需要多次寻找正确的洗衣机以逃离此地。如果其中一个流浪者发现他们自己正身处于停尸间中，那么尝试立马逃离此处吧。
//
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl161{}