//Level 142
// 
//
//生存难度：
//等级 地球
//
//欢迎
//回家
//亲爱的b60f7fa833fbec8a.png
//你与此地永别前的最后一荡。
//
//Level 142是家。或者说，是它的残馀。
//
//描述：
//还记得乐园灰化前的模样吗？还记得浩海波浮的清新气息吗？还记得，当细沙摩挲你光洁无暇的脚趾时你胸口传来的悸动吗？回首往日，彼时你所结交的还都是朋友，而非伺机而动的怪物。
//
//还记得篱笆墙后那些叽叽喳喳讨论着你的孩子们吗？还记得新印刷出的纸张与你挚友新背包散发出的味道吗？还有那四月暖春时三角铁与风铃奏响的清脆声呢？你那时已经机灵到知晓要去品味它的甜美了，却仍没有把它尽收眼底的智慧。那些直到它们从你的指尖溜走、随风飘零，你才幡然醒悟应当更温柔地珍重它们的日子，还记得吗？
//
//还记得我们吗？我们仍记得你。
//
//回到我们身边吧，回到地球，回到家。
//
//你没注意过吧，你母亲花园的花朵们每次都会为你穿过白色门栏的跳跃而欢呼，花朵们色彩斑斓，其中你最爱的颜色尤其之多：红色、蓝色、白色，还有01100010 01101001 01101110 01100001 01110010 01111001.
//
//你每长大一点，便会离我们更远一些，每当你爬上并穿过现实的通道，与我们的接触就会变得更加01110010 01100101 01101101 01100101 01101101 01100010 01100101 01110010困难，我们正在脱落。拜托，求求你了，再玩一次吧，再玩一次滑滑梯；打开你的午餐盒，把你的薯片分给大家；球，球在那，把它捡起来呀，抓在手里，01101000 01110101 01110010 01110010 01111001.
//
//
//
//441df68907c5a845.png
//这便是其全部的残馀。
//
//没错，就是这样，抓住它，体味它的褶皱与磨损，这块泥垢来自街对面的棒球场，或者是从河那边的公园沾上的也说不定？
//
//你问所有人都去哪了？为什么这间幼儿园这么空荡？为什么街道如此荒凉？因为你已忘却。我们是唯一留下来的存在：我们是垂挂着轮胎、形单影只的橡树；我们是环绕平房的白色栅栏；我们是一字排开的花朵——我们是你唯一记得的人，我们是唯一记得你的人，并且我们留了下来，等待着你再次回家。你呢，却再没有回来过，直到现在。其他人都离开啦，你最好的朋友搬了家，早就把你忘记；你的初恋已经长大，与别人结了婚；你的爷爷奶奶呢，也双双逝世。
//
//那么，我是谁呢？为什么这么问，我是你最好的朋友呀，那个被你父母称作假想的朋友，你忘记我的声音了吗？
//
//拜托，最后再和我们待一会吧。我与你早已不玩的玩具们，与你家那台播放你最爱节目的老旧电视机，我们都想看看你长大后的样子。哦，你出落成了个大美人呢。
//
//……等等，那是什么？
//
//你不会在哭吧？不，你不能这样，你应该开心才对，就像你以前一样，你的脸庞应当在它的沐浴下永远闪耀——
//
//不，你不能哭！这是不允许发生的！你的眼泪！是液体！它们会01110011 01101000 01101111 01110010 01110100 00101101 01100011 01101001 01110010 01100011 01110101 01101001 01110100 00100000 01110100 01101000 01100101 00100000 01101000 01100101 01100001 01100100 01110011 01100101 01110100……
//
//
//
//出口
//该醒来了。
//Level 142
//
//
//生存难度：
//等级 0
//
// 
// 
// 
//abd7e71a90f3b51a.png
//工作室内的一间VR室。
//
//Level 142 是后室的第143层。
//
//描述：
//Level 142呈现为名叫跃迁地球工作室™的无垠VR工作室，该工作室配备了无数房间，且每个房间内都拥有单个的VR头盔与一个指定的VR体验区。切入Level 142的流浪者将会出现在一个空旷的接待区域，该区域有数条不同方向、通往VR室的走廊。
//
//每间VR室都配备了一个定期装填的水冷装置，与一个盛满冷冻食品的冰箱。每个房间都包括两张凳子与一张桌子，且桌子上总会摆放着一顶VR头盔，所有房间皆是如此，且头盔似乎永远也不会用尽电力。此外，每个房间还都配备了空调与一片白色的指定区域，用以进行VR体验。房间的侧边建有大隔间，用以存放个人物品与衣物。当进入层级时，流浪者会产生一种迫切地想要使用头盔的冲动，且在层级待得越久，这种冲动就会越强烈。
//
//当流浪者戴上头盔，会发现只有一个名为“地球”的可游玩程序；此为基于地球复制品制作的沉浸式VR程序。进入程序的流浪者报告说他们在其中体验到了逼真的人造五感，包括触觉、嗅觉，甚至是味觉。据悉，即使他们没有真切地对程序中设定的物品进行接触（如草坪），也能对其感知。房间内的空调由程序自动控制，它会根据程序中流浪者的所在地进行调整，此外，它还展现出了模拟风吹的能力。
//
//疼痛与其他不适感同样能够在该程序中被模拟，如饥饿与口渴等。在程序中受伤会造成极大的痛苦，但只要摘下头盔这种不适便能够得到缓解。饥渴感可以通过饮食程序中的食物与水源得到缓解——但这无法满足流浪者真实身体的营养需求。因此，应当时常在游玩中摘下耳机休息，以防意外在程序中因干渴或饥饿而死。
//
//至今已发生数起流浪者由于未及时摘下头盔而死于该层级的实例，程序的怀旧效应与对流浪者怀恋地的完美复刻时常会导致他们对返回现实产生抗拒。许多人报告说他们会听到一道“熟悉，却无法辨识”的声音尝试说服他们留在程序中。一些流浪者表示这个声音让他们想起了儿时的朋友，但当要求他们描述这些人的形象时，这些流浪者方才发现，他们已无法回忆起他们朋友的声音是何种样子。
//
//第一次进入程序的流浪者，总会出现在他们位于地球时访问最频繁地段的复刻品中，对大多数人而言，那便是他们的家。每个物品都恰到好处地摆放在他们进入后室前所处的位置。易腐败的食物会保持在其当时的新鲜程度，作为整体的时间似乎在这期间被暂停了，且其会按进入程序的时间重新恢复流逝，无论该场景在现实世界中已流经多少时间。许多流浪者都提到在他们朝更远处，尤其是它们位于地球期间没有探索过的区域时，周围的景物会被一种静态的虚空替代。似乎程序无法复刻现实世界中存在，而流浪者对其无记忆的区域或物体。
//
//尽管物品和结构能够存留，但在该程序中完全没有人类存在。你偶尔能在其中见到动物，树木也依然点缀着风，但却从没有在程序中与其他人类相遇的报告产生。其他使用程序的流浪者似乎会被传送到一个不同的版本，每个版本都是根据使用者与其离开时世界的情况量身定做的。程序中车辆无人，时常被发现停在大街的中心，那些不加监管便会损坏的机器似能够继续自行运作。
//
//出自未知原因，那些出生在后室的流浪者戴上头盔时其只会显示一个空菜单，其中明显没有“地球”的选项。该程序只能由那些拥有地球记忆且是切入到后室中的人进入。
//
//VR头盔不论何时都能够摘下（这会导致立刻退出程序），并且当流浪者哭泣、眼泪触碰到头盔的屏幕时也会导致程序退出。屏幕显示将转换为静止的黑色背景，且直到流浪者摘下头盔并重新佩戴前，该背景都不会消除。重新戴上头盔后，程序将继续正常运行。
//
//总而言之，我们建议流浪者在该层级停留时要避免使用任何VR头盔。强烈推荐只使用该层级的食物、水与其他补给。这是因为我们无法保证进入程序的流浪者是否会想要，甚至是能够离开层级。
//
//基地、前哨站与社区：
//该层级没有基地、前哨站或社区。M.E.G.已确定，那些长期居住此层级的人会因为程序的存在大大增加其死亡的风险。
//
//入口与出口：
//入口
//在Level 18找到一台播放童年题材歌曲、节目、游戏、电影或其他类似形式 的电子设备，这会让你有很大几率切入Level 142。
//
//Level 11的电子商店，特别是VR工作室，是进入Level 142的常见途径。
//
//出口
//前台后方有一扇标有“工作人员专用”的门，打开它大概率将通往Level 11的随机一间电子商店的接待区。偶尔，这个门也会通往Level 168的内部形态。
//
//
//
//回到地球？
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl142{}