//Level 192 - “视觉性妄想症”
// 
//
//生存难度：
//
//等级 E
//
//不安全
//敌对环境
//极少量实体
//face.jpg
//其中一棵异常树木。
//
//描述
//Level 192是一片占地面积几英亩的广袤森林。本层级被观测到拥有24小时昼夜循环，但由于树冠过于茂盛浓密导致其始终保持环境昏暗。森林中的树木几乎都是巨大的红杉树，或是极为罕见的，与红杉相近的异常树木。此类树木才是本层级真正的危险之处。
//
//该层级中的所有红杉树上均生有一种特殊的树瘤，其表面看上去像是人类面孔，注意到树瘤的流浪者将产生严重的幻觉与恐惧感。这些“脸面”的仿真程度各不相同，有的拥有高度的真实感，而有的仅仅勉强能够被视作为眼睛与嘴（见上图）。然而，部分脸面似乎会对人类产生极大的生理影响，此类脸面的总占比是未知的。若是流浪者与此类脸面产生了目光接触，在移开视线时会导致不可逆的心脏骤停1。为了避免此类情况发生，建议保证目光看向地面，向着选定的一个方向持续前进。由于本层级没有明显的小径或道路，故保证自身的行进路线为直线十分重要，否则将因无法找到自身于层级中的位置而不断绕圈。
//
//除了树木外，此层级不存在其他植物。地面似乎是由普通土壤构成的。然而，土壤中的蠕虫数量非常多，几乎任何一处开阔的土壤中均可以观测到多种蠕虫。于地表向下挖掘几米，便会发现一堵大约3英尺厚的坚固的骨制墙面2。目前正在开展关于骨墙起源的调查。
//
//基地、前哨和社区
//由于该层级缺乏足够的建筑空间，故没有任何已知的社区、基地或前哨站。
//
//滚出我的脑袋滚出我的脑袋滚出我的脑袋
//疽域乃是镀于四维顶部的空间
//那些以喧嚣引人侧目的，处置不当的灵魂
//他们无法离开这片森林，无论我如何引导他们
//
//但是，唉，没有改变，只有我能听闻
//
//实体
//不不不不不不不不
//但但这并不完全正确，不是吗？
//这片森林充斥着那些过去时日的鬼魂。
//树木注视他们。
//那些看向别处的流浪者们使得自己的灵魂从身体里被剥离出来，吞噬，并消化于树树树树树树树树树树权
//
//行为准则
//应当：
//尽快离开此层级。
//保证眼睛目视着地面。
//若是不小心看到一张脸面，不要终止与其的眼神交流。后退直至找到出口。
//不应：
//看向任何一张脸面。
//把目光从任何一张脸面上移开。
//我恨你我恨你我恨你
//我是德鲁伊
//我找到了有灵魂之森
//我盯着那张脸，一个小时又一个小时
//然后他们向低语
//我恨他们
//我即他们
//他们称呼我为先知，镇定剂3，代言人
//眼睛无处不在
//
//我听闻他们的受害者呼唤着我
//我看到他们的精神漂过了以太之界
//疽域几乎充满了被盗走的灵魂
//当此地满员之时会怎么样？
//当受害者前来寻仇时会怎么样？
//当死神来临，收割属于他的战利品时会怎么样？
//
//那些眼睛，他们注视
//那些鼻子，他们呼吸
//那些嘴巴，他们进食
//
//…
//
//我无比恨你
//
//入口和出口：
//入口：
//在Level 62的森林中，有两棵由M.E.G.使用标准荧光橙色旗帜所标记的树。任何时候，此对树木都有非常微小的几率组成通往Level 192的大门。由此进入后的地点每次均是相同的，且通过大门可观测到的“脸面”均无异常性质。
//切出Level 39的地面。
//出口
//离开森林会前往Level 170，自此，把目光移开是安全的。
// 
// 
// 
// 
// 
// 
// 
//
//unknown.png
//树树树树树树树树树树树树树树树树树树4
//
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
//
//作者（们）
//« Level 191 | Level 192 | Level 193 »
//
//Footnotes
//1. 这种效应似乎对非人类或类人实体无效。
//2. DNA测试无法得出结果。
//3. 译注：原文为Lorax
//4. 译注：图中的詹姆斯·布坎南（James Buchanan）为美国著名经济学家。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl192{}