//Level 147
// 
//
//生存难度：
//等级 2
//
// 
// 
// 
//unknown.jpg
//描绘Level 147中城市的一张图片
//
//Level 147是后室的第148层。该层是一座大雾弥漫的灰色的城市，到处都是行驶着的巴士。
//
//描述：
//Level 147类似于一座城市，主要由各种建筑物所组成，从白色小石屋到现代的摩天大楼。然而，该层一个显著的特点是建筑物总体的灰暗色调与其同观察者之间的显著距离。来到该层的调查员将发现他们身处于一辆客车中，客车以类似圆柱螺旋状的轨迹驶过街道。该轨迹的螺旋状性质仅能通过太阳的位置来确悉，且此性质很少被偶然发现。
//
//Level 147似乎会扭曲人们的记忆。它给予流浪者们一种他们早已来到这里、毕生都在层中四处游荡的假象。尽管有着强有力的证据反对，大多数人仍报告称他们熟悉这片区域。由于此种性质，定位巴士的路径正缓慢地向城市北部移动是很困难的，因大多数人只是沉浸于怀旧之情中。这种记忆扭曲似乎只会影响那些记忆最深刻的公交路线是在城市中的人。那些更生动地记着或更钟情于城市外的公路旅行的人将不会遭受记忆扭曲。
//
//不时地，巴士将停靠并开启车门。这通常发生在靠近类似公交车站框架的结构时。在那能够遇见乘客、捣蛋鬼，或有时在罕见情况下，能遇到巴士售票员。流浪者或许会离开巴士，结果通常是因脱水或饥饿死亡，有时甚至是冻死。除非你打算自行冒险探索Level 147，否则不建议离开巴士。
//这座城市完全是一座空城。建筑内部什么都找不到，只有裸露的水泥墙，即使建筑的外部不是由水泥建成。城市的总面积未知。已有256 km2 的土地被探索并绘制了地图，但还无人知晓该层的边界。
//
//已知第34路巴士并不是在Level 147中漫游的唯一方式。还存在着其他大量载具：巴士、小巴、汽车等等。但有些载具是危险或致命的，例如电动巴士，有着处于380V恒定电压下的金属表面。它们可以由缺少内燃机的噪声和窗户上的大型文字写着：“这是辆电动巴士。就像一辆电动汽车，但实际上是巴士。”而被很容易地辨别出来。若无直接接触，这些巴士是无害的。
//
//实体
//该层的实体可被分为两类：敌对的与非敌对的。乘客被认为是非敌对的，而捣蛋客和巴士售票员是敌对的。乘客应被中立地对待；他们不会对所见或所遇到的人有任何反应。乘客有着类人的形态，但没有脸。然而，他们有着光滑的、黑色的皮肤。有调查员报告称他们看起来像“头上套了紧身衣”。乘客们通常身着各种西装，有时头戴檐帽。
//
//捣蛋客有时是很危险的，但通常情况下，他们会对巴士本身造成伤害。他们已经破坏了座位且划烂了墙。他们的外貌与乘客相似，但有着大眼睛（通常是红色的）和一张长满尖牙的嘴。请勿让他们登上巴士。他们会吸引巴士售票员。
//
//巴士售票员是一个穿着皮衣的高个男人。你需要一张车票来避免被他攻击、甚至很可能被杀。假如你拥有车票，那么在下车之前，你就可以在层中随意停留。对于所有逃票者来说，巴士售票员是极其危险的。大多数情况下是一些意外登上巴士的旅行者和捣蛋客。若你是一名逃票者，那么除了等死之外你再没有任何办法。在巴士上，售票员免疫武器或任何形式的伤害。目前未知他是否能被怎样伤害到。当某人想逃跑时，巴士售票员能够扭曲巴士的空间来困住他们。在这之后，他会杀死逃票者。有时他会捡起受害者的所有物。即使你已设法避开了巴士售票员，这趟巴士仍是一条死亡之路，除非你携带着大量的水和食物。或许你可以从尸体上收集些物品。
//
//车票是一张8.5*5.4cm的柔性矩形卡片。它由一种与塑料相似但导热性更好的材料制成，也使它触感冰凉。你能在车站附近的地面上找到它。有时车票会被埋在土中，故难以被发现。车票是相当罕见的，且在交易时有极高价值。当巴士售票员向你走来时，若你向他展示车票，他将拿走车票，但在这之后，你随意搭乘多久都可以——售票员不会再攻击你。
//
//基地、前哨和社区
//KVZ (后室幸存者联盟) 基地Astra “启明星”。
//基地A是关于如何设置层级秘钥来开启新层级的主要研究中心。
//基地A拥有488名成员。
//它位于Level 147的一栋摩天大楼中，大楼由KVZ的军队全副武装进行镇守。
//入口和出口：
//入口：
//你能通过在其他层级切出随机地进入Level 147。
//若你在Level 11找到第34路巴士并搭乘，你有很大可能会与车上的其他人一同到达Level 147。
//在Level 9的街道走了很长一段路后，或早或晚，你会开始感到被Level 147的效应所影响，或只是注意到周围的奇怪环境。这是进入Level 147最危险的方法。
//出口：
//搭乘另一辆巴士，有几率去到一栋由玻璃建成的摩天大楼。走进大楼，穿过内部迷宫般的走廊，会将你带到Level 4或Level 0。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl147{}