//Level 157
//
//
//
//Level 157
//
// 
//
//生存难度：
//等级 2
//
//不安全
//稳定
//大量实体
//
//
//描述:
//smallerfieldchess.png
//一张无边无际的方格地面的照片.
//
//Level 157 表现为一片向各个方向无限延伸的巨大平面。Level 157的地面由黑白相间的方格组成，呈现出一片国际象棋棋盘的模样，而非任何种类的草或泥土。每一个方格边长约有3英尺（或一米）长，由平滑的大理石构成，无法使用锐器破坏。这个层级完全水平，没有任何山坡，凸起，小坑或任何其他可观测到的地面高度的变化。被传送至这个层级时，流浪者会发现自己身处Level 157的随机位置，身边至少有两个可在短暂步行内达到的“车塔”，在地面上可以看见。
//
//Level 157总体统一，但该层级被居住在此层级内的实体分为两个广阔“国域”。这些实体存在感知能力，能与流浪者流畅沟通交流，并且形状如同国际象棋棋子。层级内没有明显标注国域之间的边界，但居住在这里的实体坚守这些边界，并且希望流浪者也如此。在流浪者被传送到层级内的任意一个国域后，实体仅会允许流浪者在该国域之内行动，一旦实体发现流浪者离开了他/她所属的国域，这些实体会将其看作敌人并立即发动攻击。
//
//当来到Level 157时，推荐流浪者优先寻找地面上的两只“车塔”。由于两只车均会位于流浪者所属的国域上，所以在流浪者向两只车行动的过程中不会遇到任何麻烦。车塔的高度会有所不同，但通常为50英尺（15米）高左右，并且着黑或白色。在车塔的底部将会有着色的吊桥，当流浪者接近时打开。车的内部将会被着色成其对应的颜色，并且每一只车塔共有三层楼，每一层的地板均为黑白相间的方格状，并且拥有诸多家具。车塔的内部构造将会在后文“车塔”的部分下详细介绍。
//
//对局
//
//
//
//chessboard157.png
//新手玩家最为常见的棋子排列.
//
//在进入此层级后，流浪者将会参与进行中的“国际象棋”对局。流浪者所位于的国域将会拥有国际象棋游戏开始时拥有的所有“棋子”。所有玩家总是不可避免地执黑棋。大多数国域都仅有二或三只车，但有一强大国域拥有几十座车塔并主宰层级。该国域被称为“三角国域”，被一位自称为“三角”的存在领导。“三角”执白棋，所以一切人类玩家均为“三角”的对手。在一位玩家进入车塔时，他将会收到一封写着详细的象棋规则的手写信。信的内容如下：
//
//
//
//
//
//目标:
//
//
//1.向颜色对立的对手的国域中的棋子发起一场象棋挑战并获胜，以占据该国域的车塔。
//
//
//2.继续攻占更多车塔并组织壮大一支军队。
//
//
//3.挑战“三角”的地方军队并得胜。获胜后，将有能力自由进入与离开层级。
//
//
//
//
//规则:
//
//
//1. 玩家必须使用在进入此层级时被给予的棋子。每名玩家第一局均执黑棋，拥有至少两只车塔，一名国王战术家，一位刺客皇后，两名跑者象，两名骑士，以及八个标号j~q的步兵。
//
//
//2. 玩家不得在一局游戏定胜负之前离开。若得胜，则胜者将被给予一本特别的书，打开书将可以让玩家随时随地来到象棋游戏层级。若告负，则玩家将会被传送到来时的层级，并终生不可再次进入本层级。
//
//
//3.禁止任何形式的友军开火。
//
//
//4. 不同国域可以在国际象棋游戏中挑战对方，并使用本国域的任意数量的棋子。每场比赛的获胜者将从失败者手中夺取他们选择的车塔。其车塔的所有居民都将被着上胜者的颜色，并加入胜者一方作为棋子，用于下一场战斗。
//
//
//5. 玩家在其所有车塔被占据（并因此所有棋子也被占据）时告负。
//
//
//6. 国域之间允许联合战争。其中，多个国域同时挑战另一个，使得其被迫分裂自己的棋子力量。玩家之间不允许联手。
//
//
//7. 若在象棋游戏间一国域仅有一只车塔，则该局游戏的目标将变更，从将死只有一只车塔的国域的国王战术家变为捉获国王战术家。捉获后国王将被处决，而剩余国域的所有棋子将对胜者国域表示忠诚并服从。这一局游戏被称为国王的“终末处决”。
//
//
//8. 棋子的起始位置有以下规则:
//双方的前线开局时必须与对方前线保持四格宽距离。
//步兵只能起始于其对应字母的格子。
//国王以及皇后必须参加所有对局，并被放置在底线。
//前线必须全部由步兵组成。
//棋盘将被分为行列，行标字母a~z,列标数字1~8
//底线与前线必须只有纵一列，即使它们可能有26格长。
//对局的有效场地仅有长26格，宽8格。
//
//
//除了这些特定的规则，这些象棋对局近乎与普通国际象棋相同。 正常的象棋游戏规则仍然适用，例如白先手，交替落子。在吃子时，吃子之棋子移动到被吃之子的位置，被吃之子将退后至底线之后，从而离开游戏场地。当一国域的国王被将死时，该对局结束，所有棋子离开游戏场地，那些将被涂上胜者颜色的败者棋子行进至最近的车塔，而那些获得自由的棋子回到自己的车塔。
//
//车塔
//
//Chess_piece_-_White_rook.jfif
//一张白色车塔的照片.
//
//车塔是Level 157中每一国域至关重要的一部分， 并且永远会着其目前所处国域的颜色。每只车塔内含有四名步兵，一名骑士，一名跑者教皇，偶尔可能拥有一名国王战术家或一名刺客皇后。它们也是本层级唯一的已知建筑，因为并没有证据证明层级内存在其他建筑。因此，一切Level 157的实体赖以生存的资源与设施都位于车塔之内。此外，每只车塔内可能含有专为流浪者提供的无限量食物 （因为Level 157的实体并不进食）以及专门为流浪者提供的便利设施。
//
//车塔内也包含无限量的颜料，用于在棋子转换国域时着色。车塔的颜料供给位于一楼的颜料室。 在一国域损失其车塔时，车塔也会着色以匹配新国域的颜色。 许多长期存在的车塔已经着了许多层的黑白相间的颜料。
//
//即使车塔拥有不同的尺寸大小，它们都具有相同的外部构造特征。每一只车塔的外形均类似于国际象棋的车的放大版。车塔一般由白或黑色大理石或厚的着色颜料建成。 车塔包含许多具有特定作用的房间和楼层。下图为一标准车塔构造的可视化。
//
//
//
//
//车塔构造
//屋顶
//矮墙
//
//顶层
//图书馆以及对局档案馆 || 王座室 || 皇家宿舍 || 抄写室
//
//中层
//瞭望台/阳台 || 玩家房间 || 骑士房间 || 客厅
//
//底层
//厨房 || 大堂 || 入口 || 步兵房间 || 颜料室
//
//
//
//实体
//
//rooktowerinside.PNG
//一位玩家在车塔内的模拟对局中与一些棋子讨论战略.
//
//有许多类型的实体居住于Level 157。目前共有六种被发现的实体。 所有六种实体都具有感知能力，并能以任何一种语言交流，即使没有任何可见的口。其中五种均形似于国际象棋棋子，而第六种则是三角。所有形似国际象棋的棋子都称自己为“棋子”，并且也拥有自己的名字以及不同的性格。没有证据表明它们繁殖、吃、喝、排泄、睡觉或作任何其他正常生命所必须的生理活动。因为没有手脚，棋子都以一些特殊方式移动。步兵和骑士从一个地方跳跃至另一个地方，而跑者教皇，刺客皇后和国王战术家均在平坦地面上滑动，即使它们也有能力跳跃一小段距离。 由于关卡天然存在的无限延伸的性质、稳定的实体密度以及众多国域的存在，可以假定在 Level 157 内有超过数百万的棋子。
//
//
//
//
//
//步兵
//
//Chess_piece_-_White_pawn.png
//一张白色步兵的照片.
//
//pawn%20movement.png
//标准步兵行动示意图.
//
//步兵是目前Level 157内最常见的实体。步兵为一外形矮小，形似国际象棋兵的实体。所有步兵都用一个命名系统命名：a~z内任意一个字母，在对局初始时被摆放的竖列（白棋为2，黑棋为7） 以及其从哪一国域起源。
//例：从Alesia国域出身的白色步兵，对局时被放置在g列，则被命名为G2 Alesia。
//
//
//步兵的移动的方式与国际象棋中兵的移动方式相似。它们在行进时向前走一格，在吃子时斜向移动一格。在它们第一次在对局中移动时，它们也可以选择向前行进两格。在达到对手棋盘的底线时，它们可以进行升变，即将其自身转化为马，象，王或后。由于车在Level 157中并非一可使用的棋子，而是作为其他棋子生活的城堡，所以步兵无法升变为车。在对局结束时，在对局中升变成功的兵将会转换回到它们原本的外貌。
//
//
//在对局之外，步兵通常在车塔周围执行下层任务。它们经常以仆从，厨师，清洁工，守望者和其他各种各样的职业工作。出于它们缓慢的移动速度，它们一般做一些不需要过多体力劳动的工作。在后来被集合的原处于不同的国域的步兵中，通常曾在相同格或相同列进行过对局的步兵会形成一个社会团体。 例： 如果三个来自近期被征服的不同国域的步兵曾经都在G列的G2格进行对局，它们之间就会形成一个社会团体。在对局中升变成功的兵通常在它们的同行好友中受到尊敬，因为它们成功地到达了棋盘的另一端。这些步兵通常被认为是“老兵”并在象棋对局中比其他缺少经验的在同一格上进行游戏的步兵具有更高的优先级。
//
//
//
//骑士
//
//Chess_piece_-_White_knight.jfif
//一张白色骑士的照片
//
//knight%20movement.png
//标准骑士行动示意图.
//
//骑士是栖息于Level 157中的第二常见的实体，虽然它们比步兵少见的得多。 它们形似国际象棋的马。关于骑士的一件怪事是：即使它们被称为骑士，具有感知能力的反而是马，而并没有任何人类骑在马上。相反，马被认为既是骑士又是坐骑。骑士与步兵的命名方法大抵相同，但它们以被收服的顺序来数字编号而不是以它们在对局中开始的方格命名，因为对局时开始的方格在每一局都由玩家决定，并不固定。
//
//
//
//每个来到Level 157的新玩家都会以两只骑士起步，两只马将会被命名“（国域名）第一骑士”与“（国域名）第二骑士”。不像步兵会终身仅拥有一个名字，骑士在被征服收服后会变更自己的名字以对应它们目前处在的国域。举例来说，Juno第二十七骑士，在被Juno输给Alesia之时， 将会改变其名字以对应Alesia国域中骑士的排序。如果Juno第二十七骑士成为了Alesia国域的第七十五只骑士，它将更名为Alesia第七十五骑士。
//
//
//
//骑士的移动方式与国际象棋中马的移动方式类似。它们只能以"L"字形行进，即在轮到它们行进时，只能向上，下，左或右移动一格，再以垂直于之前的移动方向移动两格。骑士，正如国际象棋中的马一样，可以“跳过”或穿过在其行进路径内的敌方或友军，这是一个任何其他棋子都不具备的能力。
//
//
//
//在平时休战的和平时间，骑士的工作是在国域内栖息的步兵的管理者。一只骑士会担任平均约四只步兵的管理员，确保它们分配到了任务并且按时完成。由于经常有刺客皇后刺杀敌对国域的国王战术家的记录，骑士也经常担任国王战术家的贴身护卫。
//
//跑者教皇
//
//800px-Chess_piece_-_White_bishop.jfif
//一张白色跑者教皇的照片.
//
//bishop%20movement2.png
//标准跑者教皇行动示意图.
//
//跑者教皇是栖息在Level 157中第三常见的实体，仅略微比骑士少见。教皇形似国际象棋中的象。除刺客皇后外，教皇被认为是棋子中最快也最机敏的棋子，所以它们担任国域中的信使。教皇的命名方式与骑士的命名方式相同，被命名为类似“三角第八十二教皇”以及“Wallenheim第四教皇”之类的名字。和骑士一样，在自己国域被打败后，被征服的教皇会根据它们在新国域内的序位变更它们自己的名字。
//
//
//
//在象棋对局中，教皇的移动方式与国际象棋中的象相同。它们具有向任意方向斜向移动的能力，并且只能斜向移动。在每一次移动中，它们可以行进任意数量的格子，直到它们到达棋盘边缘，捉获了对手国域的棋子，或者被自己的盟友挡在行进路线中。
//
//
//
//在国域的运作中跑者教皇扮演着重要角色。它们是对局的记录员，国域的秘书，以及国域之间交流的依托。国域之间每一封挑战书均由教皇书写并送达。此外，虽然Level 1571中所有的实体均能流畅的使用语言交流，但教皇是其中唯一一个具有阅读和书写能力的棋子。目前看来并没有任何其他棋子有这种能力。教皇可以把笔插入其上身的口状凹槽来书写。由于教皇需要使用标准象棋记录符号（SAN,标准代数符号,Standard Algerbraic Notation）来记录每一对局中棋子的行动以及发生的事件并将其封存于车塔中的图书馆内，这种读写能力使得教皇在对局记录的工作中显得至关重要。来到Level 157的新玩家可以在国域的图书馆中学习对局的策略与布局。
//
//
//
//
//
//刺客皇后
//
//Chess_piece_-_White_queen.jpg
//一张白色刺客皇后的照片.
//
//queen%20movement.png
//标准刺客皇后行动示意图.
//
//刺客皇后是栖息在Level 157中最为罕见的实体。她们形似国际象棋中的后。她们是棋子中最快，最具杀伤力而最强大的棋子。一个国域平均会拥有一到两位刺客皇后，仅有一些国域超过这个数目。与步兵，骑士和教皇不同，刺客皇后拥有自己的名字，而不是被以字母或数字命名。她们的命名方法与英国命名传统相同，即一姓一名。由于棋子并不繁殖，棋子之间似乎不会形成家庭，这使得每一位皇后的姓都是不同的。每一位皇后也会冠以皇后之冕，并被尊称为“（皇后的姓）皇后”。
//
//刺客皇后是棋子中唯一一个具有能对其他棋子和人类造成重度伤残的能力的棋子。她们的头部顶端是锯齿状的，在与她们极快的速度的配合之下，她们能使用锯齿撞向其他棋子，并将它们杀死。当被激怒时，刺客皇后也会使用这种方法伤害人类，但这只是一种假设，而且目前也并没有攻击的记录。 由于其力量强大，刺客皇后也是其他刺客皇后和被打败的国域的国王的刽子手。
//
//在象棋对局中，刺客皇后是除了国王之外最为重要的棋子。她们的行进方式形似国际象棋中的后，但由于棋盘更大，她们的能力相对于正常国际象棋大大增强。 刺客皇后可以横纵或斜向移动任意数量的格子，直到她们到达棋盘边缘，捉获了棋子或被自己的盟友挡住。
//
//和平期间，刺客皇后担任国王的精英近卫。由于皇后相对于其他棋子的极大能力，一次别的国域的刺客皇后的刺杀行动通常只能由另一位刺客皇后阻止。一国域中的刺客皇后会照顾国王，并在一天内的任何时间都陪伴着他。但并非所有刺客皇后都遵循这种规律。一些皇后选择离开车塔并尝试杀死敌对国域的国王。国王战术家也可以组织对另一国王的刺杀计划。这些计划很少成功，但一旦成功，国王战术家被杀死，那么他的国域将落败，国域内的一切棋子都将臣服于刺客皇后所属的国域。然而，若刺杀失败，刺客皇后将会被敌对国域的刺客皇后处决，或者在刺杀行动中被杀死。在象棋对局中如果缺少皇后，该国域将会处于极大劣势，并反而有可能使得自己的国域落败。
//
//国王战术家
//
//Chess_piece_-_White_king.jpg
//一张白色国王战术家的照片.
//
//king%20movement.png
//标准国王战术家行动示意图.
//
//国王战术家是Level 157内找到的最罕见的实体。他们形似国际象棋中的王，并且为他们所处国域的统治者。一个国域仅仅会有一名国王。国王战术家在棋子之中拥有绝对权威，即使棋子也听从玩家的指示 国王对于其国域的稳定至关重要。在他们死亡后，其所处国域将被认定陷落，无论玩家处境如何。 国王战术家的命名方式与刺客皇后的命名方式相似：冠有国王之冕，并同时拥有姓与名。国王战术家一般只被观测到在车塔内部的皇室，或者正在进行对局。出于被刺杀的风险，大部分国王并不会选择去其他地方。
//
//象棋对局中，国王战术家的作用与行动方式和国际象棋中的王类似。即，他们可以向任意方向移动一格，前提是该格并未被占据或不会使他们下一轮次被捉获。在对局中国王的与众不同之处在于，除非该对局为国王的终末处决，国王不可以移动到会使得其下一轮次被捉获的格子。由于对局的目标是将死国王，国王的处境将反映整局对局的处境。
//
//若要将死国王，玩家必须在其回合结束时使得对方国王周遭所有格子均被自己的棋子攻占2，包括国王当前所在格子。这会使得对方国王除了被捉获无其他格子可以移动，并且若不移动，其下一轮将被捉获。在同时满足这些条件时，敌方国王将被将死，己方获胜。唯一的例外是在国王的终末处决，在该对局中，该国王需要为该国域最后一只车塔而战。若该局对局的失败会使得此国域失去所有车塔，则该对局便为国王的终末处决。此时，游戏会在敌方国王被捉获时才结束，使得其所处国域陷落，而被捉获的国王会被处决。
//
//在对局中，国王战术家将会给予玩家战术策略以及行进点。国王战术家也会在玩家忘记或不执行规则时进行提醒。国王有丰富的象棋知识以及对局经验。他们也会在和平期间制定计策，决断其他所有国域内棋子的生死，并保证国域内所有居民均具效率与机动性。这个任务会受到教皇的辅佐与帮助。
//
//三角
//
//trianglesuit.png
//对三角的描述画像.
//
//三角是居住在Level 157内的一奇异实体。目前尚未知三角为人类还是实体，但由于其头部的怪异形状，推断应为后者。其头部形状为一彭罗斯三角，即广为人知的“不可能三角”。无论流浪者从什么方向观察三角的头部，其均表现为一彭罗斯三角的三维投影，此时三个维度的边同时显现，并且旋转使得该面一直面向流浪者。其被观测到时均穿着黑白西装。三角极度智慧，并且能以任意一种语言流利地交流，阅读与书写。其声音被描述为“机械化”及“中性的”。
//
//三角是三角之国度，即三角国域的领导者。三角国域是目前已知最宏大而最强力的国域，且在Level 157的各处均有互相独立的分国域。来到Level 157的流浪者只有在赢得一场与三角国域的对局之后才可离开。得胜后三角将会立即以人形出现，亲自问候并庆祝流浪者的胜利。三角随后会给予流浪者一本独特的黑色封皮书，在书的封面上有一步兵图案。该书拥有一皮革书封，使得除流浪者有意打开外本书一直保持关闭。打开书后，流浪者便会传送到Level 157，随后，三角将会将流浪者传送回到其来时的层级，通常为宜居层级。
//
//三角被推断近乎无所不知，并且掌控整个Level 157.其不仅拥有操作物体以及现实的能力，还可以随意传送至层级内任何地点。三角被认为是Level 157中棋子以及象棋游戏的制作者。其动机未知，但三角似乎乐于看见流浪者在完成初等挑战后再次来到Level 157.
//
//入口与出口
//
//Level 157最常见的入口是从 Level 5, Level 13, 以及 Level 86 进入。从三个层级进入Level 157的方法都相同：找到一间有两张椅子一张桌子，桌上有一副象棋棋盘的房间，碰触棋盘将会将流浪者传送至Level 157.一旦流浪者完成了初等挑战，他们将可以通过打开三角赠与的黑色封皮书来随意进入Level 157.
//
//只有在初等挑战获胜或落败后流浪者才能离开Level 157. 若流浪者在完成初等挑战后来到Level 157，他们也能通过打开黑色封皮书来离开本层级。初等挑战落败的流浪者会立即被传送出本层级。离开Level 157时，流浪者将会回到其之前所在层级中来到Level 157的地方。
//
//shapeshifterslogoblack.png
//作者(们)
//« Level 156 | Level 157 | Level 158 »
//
//Footnotes
//1. 译注：应为Level 157,原文写为Level 147
//2. 译注：即在攻击范围之内
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl157{}