//Level 150
// 
//
//生存难度：
//
//等级 Ψ
//
//不安全
//不稳定
//精神危害
//imgroad.png
//Level 150 的一张照片。
//
//Level 150 是后室的第 151 层。该层级于 2019 年 5 月 11 日被“Reed”小队发现。
//
//描述
//Level 150 也被称为记忆铸造厂。该层级是一片翠绿的草地，其内还有一些树木生长。整个层级都被淡蓝色的光笼罩，仿佛一直处于日落时分。天空中有一个类似月球的红色球状物，该层级居民（也被称作“新人”）称这个物体为“眼”，红色球状物来历不明，可能是天体、实体或其他异常物体。
//
//Level 150 中有一条老旧、狭窄的柏油路，路的缝隙间已经长出了一些植物；这条路连同整个层级似乎都是无限延伸的；“Reed”小队在探索过程中发现，如果朝这条路的垂直方向前进，一段时间后会回到起点。这种现象会突然发生，被影响者常常会很惊讶，而且会随之丢失现象发生前几分钟内的记忆。推测该层级本身会以某种方式改变流浪者的记忆，并将他们引回柏油路。
//
//位于 Level 150 时，能隐约听到一种嗡鸣声。一开始这种声音还比较小，但随着人在该层级中停留的时间增加，这种声音的强度也会提升，最终，声音会升高至“仿佛有钻头直冲你的脑袋钻去”的程度。这种声音似乎与该层级对人造成的精神影响有关。在 Level 150 中停留的时间过长时，会有一种古怪的现象发生：受害者的记忆会被逐步替换，最终成为全新的个体。似乎正是这种现象导致该层级实体绝迹，因为它们都“忘记”了自己的存在。
//
//精神影响现象
//这一现象也叫“铸造”，它会使层级中流浪者的记忆被逐步替换。在层级中停留的时间越长，或离“铸造厂”越近，这一过程就会发生得越快。虽然记忆被篡改的速度快慢不同，但这个过程总是会按以下几个阶段进行：
//
//阶段一：在这个阶段，所有与受害者主体性无关的记忆都会被替换，虽然不会影响到受害者的自我认知，但会引起极大的混乱。受害者将难以决定前进方向，无法编排行动计划，给自己在 Level 150 中的探索造成不便。
//阶段二：在第二阶段，一些根植于受害者头脑深处的记忆开始被替换，这些记忆称作“遥远记忆”，它们非常微小，虽然被头脑记录，却不会影响到受害者的人格、生活经验。这一阶段开始后，受害者对自己过去的认知会改变，但程度还不足以影响其心智完整性。
//阶段三： 在第三阶段，受害者在 Level 150 的影响下会产生难以治愈的自我认知损伤。这一阶段，受害者过往学习的所有技能都会被遗忘、替换。这会使他们产生一种不协调的感受，因为他们会发现自己的知识与行动能力无法匹配了。
//阶段四： 在这一阶段，受害者所拥有的各种知识会被一并抹除、替换。在少数情况下，替换出的新记忆还有助于增强受害者产生的新能力。这一阶段结束时，受害者的核心记忆仍然保留着，但是他们对自己生命经历的认识已经完全不同。
//阶段五： 最后一阶段，受害者的剩余记忆也会被替换，丢失这些记忆后，他们原本的自我认知会随之消失，成为一个完全不同的个体。不过，至今还没有人因为这一效应获得全新的姓名。这可能是受到此影响后残留的唯一记忆。
//铸造厂
//imageblaste.jpg
//铸造厂中“机器”的照片（由一名前 M.E.G. 特工拍摄）。
//
//铸造厂是一座占地约 47 平方千米的建筑，外形如同一所破旧的工厂，不少区域已是锈迹斑斑，而且充斥着金属废料和各种垃圾。铸造厂内部发现了 Level 150 产生怪异效应的可能原因。这栋建筑内部完全由一种装置占据，该装置被“新人”们称作“机器”，它可能就是造成记忆替换现象的源头。M.E.G. 派来的探索小队发现，“机器”不仅占据了建筑的大部分区域，还向下延伸至数个地下室，延伸深度暂时未知，但估计有 1 千米以上。
//
//“机器”似乎总是处于运行状态。在进入铸造厂时，能听到机械运转的轰鸣声，但尚不知其来源。经尝试，暂无法破坏、拆解“机器”或进入其内部，因此尚不知晓它的运作原理。由于该层级较为危险，所以相关测试进行得较少；但已经可以确认流浪者一旦进入 Level 150 就会受到精神影响。尚不明确“机器”是如何检测到有人在层级内的，关于这个问题有两种假说。
//
//- 地下侦察假说
//在铸造厂下方发现的地下室使得我们怀疑“机器”可能不是单单向下延伸，而是朝各个方向延伸，并在 Level 150 内组成一张网络。这也能解释该层级地表出现的轻微震动。
//
//- 注视假说
//不能排除天空中名为“眼”的红色球状物对该层级的影响。“新人”们认为该物体会注视他们，甚至会把它赞颂为神明。因此，可能该物体与“机器”有所连接，会提醒它有新的目标进入了层级内。
//
//
//
//EagleBlackSD.png 
//以下信息已被加密处理
//
//--- [关闭] ---
//2019年11月26日，三名M.E.G.志愿者前去调查Level 150的异常特性。三人均遭受到了严重的精神影响，因此，为维护对组织判断力的信任和组织公众形象，决定对相关信息进行加密。
//档案：Flavia Hadley是否生还： 是
// 
//cara2.jpg
//M.E.G.踪迹制图者兵团
//受到 Level 150 影响前：
//个人简历：
//Flavia Hadley 是 Level 150 探索小队的队长。过去在 M.E.G. 任职时，Flavia Hadley 恪尽职守，认真负责，忠诚于组织。她善良活泼，热爱自己的同事们，但由于个性固执，她没有交到多少朋友。
//
//
//
//M.E.G. 内工作情况：
//此人工作表现优秀，所执行任务大都成功。
//
//“钢丝”行动 - 成功
//“吊桥”行动 - 成功
//1479 号访谈 - 失败
//探索 Level 118 - 成功
//探索 Level 34 - 成功
//
//最后执行任务：探索 Level 150 - 未完成
//附录：
//以下文件由探索 Level 150 时的无线电内容得来。其中记录了此人遭受的记忆改造过程。
//
//Flavia：我们就快到……到哪里了？
//
//M.E.G.基地：要到“铸造厂”了。你不记得了吗？城镇里的人和你说过了。
//
//Flavia：哦哦……铸造厂。你是谁来着？
//
//M.E.G.基地：Flavia，你还好吗？如果需要休息，就和其他队员说一下吧。
//
//Flavia：队员？这些不是我的队员，我就没有队……有没有来着？
//
//受到 Level 150 影响后：
//现居住地：Flavia 现在是 Level 11 的一名居民。
//人格变化：Flavia 变得非常外向，外向到有些不适宜在后室生存。此外，她还掌握了高超的欺诈技术，不知情者一不小心就可能落入她的圈套，至今已有两名官员被她欺诈。
//行为举止：她开始收集自己“喜爱”的物品，但似乎没有任何选择标准。因为这一癖好，从她那里总可以换来各种各样的物品，她也因此变得小有名气。她不会效忠于任何团体，只会加入一时对她有利的组织。
//档案：Suraj C.是否生还： 是
// 
//cara1.jpg
//M.E.G.测验者部门
//受到 Level 150 影响前：
//个人简历：
//并未收集到前 M.E.G. 特工 Suraj 的详细个人经历，他不爱说话，少与他人往来。他的最大爱好似乎是读书，这在后室中很少见。他有属于自己的一些藏书，但有关他在何时何地找到这些书的问题从未得到解答。被问及情况时他一般会转移话题或默默走开。
//
//M.E.G. 内工作情况：
//Suraj 不喜欢实地作业，而喜欢从事档案、后勤等工作。不过当有需要时，他也会志愿加入自己舒适区以外的工作。
//
//最后执行任务：探索 Level 150 - 未完成
//
//受到 Level 150 影响后：
//现居住地：自从此人离开 Gamma 基地后，就再未被找到，但有报告称目击到此人在 Level 9 徘徊。
//人格变化：Suraj 变得异常自信，常常向他人展示自己，不过他保留了原来做事的高效、细致。
//行为举止：Suraj 的人格被替换为了一名侦探，他称自己是后室的第一位私家侦探。“机器”似乎赋予了他有关后室的大量知识，包括很多 M.E.G. 还未发现的层级。在记忆被重塑后，他获得了某个已经穿梭于后室多年的人的经验，这使他成为了一个重要的信息源。然而，经多次尝试，都未从他口中获取到有用的信息。他对我们请求的回应是，自己不为 M.E.G. 工作，而且有些事还是不知道更好，但是如果有需要，我们随时可以雇佣他。
//对 M.E.G. 支援情况：
//至今，Suraj 已对 M.E.G. 提供了两次帮助，他在一些行动中起到了重要作用。
//
//“快闪”行动 - 成功
//“红球”行动 - 成功
//
//附录：
//Suraj 留下的信
//亲爱的……朋友们，我在这里已经得不到什么东西了，所以，我要走了！不过我不是那种不懂礼节的人，不是，所以我还是得留一封信给你们。我明白他们用尽了一切办法，我也很感谢他们给我礼物，但是有些事M.E.G.真的不能知道。你们不要觉得我这么说是和你们作对，我没有这个意思。只要你们需要我的帮助（肯定会需要的），来雇我就好！我很乐意帮忙。
//
//Suraji留。应该是Su——哦，警卫来——
//
//档案：Igor Svanhildr是否生还： 未知
// 
//cara3.jpg
//M.E.G.第一响应兵团
//受到 Level 150 影响前：
//个人简历：
//Igor Svanhildr 曾是一名很有个人魅力的男性，他善于交际，为人熟知。他很擅长交朋友，大部分朋友们也很喜欢他。他常会花数小时和同事聊天，常常会说“人生中的故事就是我最宝贵的财富”。
//
//
//M.E.G. 内工作情况：
//虽然他的能力不差，但他并不喜欢实地作业。相反，他更喜欢需要和人交谈沟通的工作。
//
//紧急事件_1245 - 成功
//1211 号访谈 - 成功
//紧急事件_1329 - 成功
//
//最后执行任务：探索 Level 150 - 未完成
//受到 Level 150 影响后：
//现居住地：未知。
//人格变化：因为他在受影响后很快离开了现场，并未收集到太多有关他的信息；但可以确认他在受影响后变得雷厉风行。
//行为举止：Igor 的变化最为危险，因为他由 M.E.G. 特工变为了分裂者1组织成员。在变化完成后，他攻击了自己的前同事，随后逃离了层级，Flavia 和 Suraj 都听到 Igor 在离开铸造厂时说“我一定要将这个层级的事情告诉‘诸神们’”。这也是我们推断他转变为分裂者成员的依据——他变得对该组织十分忠诚，还立刻逃离了自己的前同事。
//据此推测，分裂者可能已经掌握了该层级的信息和特性，他们可能会使用该层级来消除反对自己的人，M.E.G.的成员也可能成为他们进行记忆改造的目标。
//
//基地、前哨和社区
//“新人”
//“新人” 是指居住于该层级的，记忆已被篡改的人们，他们以为自己从来都住在该层级。该团体表现友善，愿意交易。
//
//人口：此团体居住的小镇中有 73 人，但由于 Level 150 的变化，人数可能随时会发生变动。
//居住地：此团体所居住的小镇位于该层级的柏油路旁，沿路前进可看到有路牌标志着前方距离小镇还有多少千米（50、30、10）。
//描述：小镇内约有 100 间房屋，但是大多数房屋都是空的。这些房屋完全由木头打造，因此认为它们都是居民们自己修建的。
//入口与出口
//入口
//目前已知进入该层级的唯一方法是在 Level 10 中找到一个写有“道路在 10 公里处”的标牌，之后朝任意方向行走 10 公里就会来到 Level 150。
//
//出口
//该层级有两个已知出口。第一个，也是相对安全的一个，位于“新人”们的小镇，那里会有一条路被标记为“出口”，沿路走，就会进入 Level 10。另一个出口则非常危险，需要进入铸造厂内的门，有些门会将你带入 Level 23 或 Level 113。
//
//作者信息
//« Level 149 | Level 150 | Level 151 »
//
//Footnotes
//1. 译注：主站早期组织，U.E.C. 设定的前身；但可以被视为不同于 U.E.C. 的另一个组织（引自“理事会”）。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl150{}