//Level 129
// 
//
//生存难度：
//等级 4
//
// 
// 
// 
//medium.jpg
//Level 129中较稳定部分的照片
//
//简介：
//Level 129是后室的第130层，发现于2021年3月1日。
//
//描述：
//Level 129是一片以深黑色树木为主的被白雪覆盖着的无尽森林。该层非常寒冷，温度恒定在华氏0度（约零下18摄氏度）。地面上覆盖着一层看似无底的雪毯。人们曾尝试向下挖掘来寻找其底部，但除了雪之外，至今仍未发现任何东西。这些树木非常高大，高达近2000英尺。白色的雪和黑色的树使该层有一种“黑白”的感觉。该层似乎停留在无限的白天，没有记录到有昼夜循环。尽管该层十分明亮，但似乎没有观测到太阳的存在。
//
//刚进入该层时，你会在一小片被树包围着的圆形雪地中醒来。当你冒险深入该层时，你会发现只有森林雪地。该层开始时高度稳定，但随着你的进一步深入，它将会逐渐扭曲。你最终会看到树木绕结，部分地区的雪变成黑色、树木变成白色，还会出现大山。该层在最初时非常平坦，但随着逐渐深入，穿越森林时地形变得越来越困难。随着你对该层的深入，山丘会变得非常巨大且陡峭。当你深入森林深处时，该层会变得更加突兀，但由于该并层不那么稳定，所以更容易发生坠落事件。实体的数量也随着你对该层的深入而增加，这可能会使你的行动变得更加困难。
//
//你偶尔可以找到被遗弃的前哨站，这表明曾有一小群人可能在此试图建立营地，但很可能被该层发生的暴雪事件消灭或驱逐走了。这些前哨站通常有被遗弃的物资，你有时可以找到诸如武器、杏仁水、保暖衣物和其他零散物品。由于其展现出无限的积雪深度，该层级本身即可被视作行程中的障碍。因此，在该层的任何人都应该注意地面是否坚实，而不是柔软。柔软的地面可能会导致探险者深陷雪中而窒息。
//
//暴雪事件
//有时该层会发生一种被称为暴雪的事件，在该事件下，该层会在一段时间内变得几乎无法生存。暴雪事件以“警告”开始，如果你能遇到的话。一片巨大的灰色乌云将笼罩天空。远处将会传来雷鸣。当你看到这朵云时意味着你有大约20分钟的时间来寻找庇护或逃离该层。20分钟过后，云层将完全覆盖整个层级，使其几乎一片漆黑。雪花开始飘落，过程持续5分钟，5分钟结束时，该层的温度将下降到华氏零下5度（约零下20摄氏度）左右。之后，雪会变成棒球大小的冰雹，这可以轻松地砸碎头骨。风也开始以极快的速度吹过整个层级。雪将厚到你无法看到前方3英尺的地方。如果你不穿那种专门为此设计的加热衣服，一旦在该层中呆久，温度加上风雪会导致你的血液被冻结。暴雪将持续30分钟至1小时，然后突然停止。
//
//绝对零度事件
//这个事件从未被像M.E.G.这样的组织正式记录过，但该事件在一个废弃的前哨基地中发现的音频日志中有记载。该事件如下面的日志所示，似乎是某种形式的自然定向能量，受害者的内部体温立即下降到绝对零度，即-273摄氏度。生命立即被攫取，所有内部体液和分子被冻结，人立即死亡。这只能从音频记录中得知，因为记录的人说，他们在受害者身上做了实验，所有内部体温都保持在恒定的绝对零度，即使暴露在温度为98华氏度（约32摄氏度）的房间里也是如此。目前还不知道为什么或如何发生，因为它似乎是随机发生的。
//
//关闭在废弃前哨站中发现的日志
//开始记录： 时间不适用
//记录者 未知
//
//日志1：
//记录者：第1号条目记录。我们刚刚达到一个新的层级。我们不确定我们在哪里。我们正试图探索红木林，这时有一个人就切入了那棵树。我们跟着他看他去了哪里，结果我们以为是森林的另一个区域；但在该层中呆了一段时间后，我们很快就意识到，我们已经不在森林里了，而且白昼24小时都没有明显的变化。每当有事件发生时，我都会记录这个日志。希望你听到的是我说的，而不是别的什么。结束。
//
//日志2：
//记录者：第2号条目日志。我们已经探索了大约，哦，3天左右了。这层太冷了。幸好我们在红木林里准备了一些物资。我们目前正在尝试建造一个前哨，以便在这里生存。我们有大量的杏仁水，在营养上应该可以渡过难关。他们正在建立多个加热系统抗寒。我正在利用午休时间记录这个。希望我们能成功探索这个新的层级。John刚刚报告说看到一只猎犬在树林中行走。我们有一些野外探险者试图找到一条出路。这层似乎不是很危险。当有其他事情发生时，我会再来检查。结束。
//
//日志3：
//记录者：第3号条目日志。前哨现已完工。我们为所有组员准备了暖气和床，所以这里应该会比较轻松。我们用树做了墙。我以前从未见过这么黑的树。有些人传言，他们在探索时看到了爪形蛛菌的生长。我希望我们不要被这群实体攻击，我们才刚把这前哨建成。我们计划继续探索，直到找到一个出口。探险者们猜测他们最多在2-5天左右就能找到逃生的方法。我将继续记录最新情况。结束。
//
//日志4：
//记录者：老天，去他的手续，我们有麻烦了。我们建立前哨站已经有2天了，出了很多问题。我们派出了一个由3名探险家组成的小组，但只有一个人回来。他们发现一个洞穴里有笑魇出没。他现在正在接受治疗。我认为他有点…
//（从背景中可以有混乱的脚步声和尖叫声。这名身份未知的记录员暂停了记录）。
//卧槽……他发生了什么？为什么他……操……我说的那个探险家是唯一一个在笑魇洞穴中幸存的人，他刚倒下了。有人接触了他的身体，他们的手臂立刻被冻伤了。我稍后将更新日志……操……
//
//日志5：
//记录者：这是第5号日志。我开始觉得这层比我们最初预期的要危险得多。昨天倒下的那个探险者，就这样无缘无故地死了。我们仍然不知道为什么，但是他的血液瞬间冻结了。他的内部体温停留在绝对零度。这就对了。0开尔文，绝对零度，不管你怎么称呼它。我们不知道发生了什么或如何发生的。他前一分钟还好好的，下一分钟就倒下了，冻僵了。我们试图融化他的血液，把他暴露在98度的环境中。他的血液不会融化。我们进入了什么层级？我们有一些人试图进行尸检。我们知道他的死因，只是不知道他的死因是什么造成的。天啊，这真让人困惑。我开始担心我们在逃跑之前都会死。希望这不是我给这个世界的最后一条信息。如果我们想通了这位冰冻探险家，我会让你知道。结束。
//
//日志6：
//记录者：日志6。我们的杏仁水快用完了。我们现在正在配给它以保持饱腹感，但我们很快就会用完。我想我们不可能活着离开这里了。探险者们太害怕那些未知的实体。每个人都担心他们会被他们所说的“绝对零度”。我们不知道那个被绝对零度的人发生了什么。我向上帝祈祷这不会再发生。我想我们要抽签或什么的，再次去探索。我们计划离开到—
//（记录者停顿，背景中可以听到尖叫声。记录者似乎要去前哨外看看发生了什么。）
//卧槽。又有事情发生了。远处有一大片灰色风暴云。别别别……我不想死。求你了。不要。
//
//日志7：
//记录者：这可能是我的最后一篇日志。现在云层已经覆盖了整个层级的天空。现在外面很黑。开始下雪了，现在有巨大的冰块从天而降。刚才有个人的头骨被其中一个冰块砸开了。我们会死的。温度甚至更低了。我要去外面偷看一下，看看发生了什么。
//（可以听到混乱的脚步声）
//OK，冰块仍然在某些地区下落。云层已经使地面变暗。现在也起风了。我想有坏事要发生了。等等，远处是雪吗？卧槽。我操！
//（记录员扔下记录仪，尖叫着跑开了。可以听到有一阵大风，日志结束。）
//
//这段日志是在一个被遗弃的木制前哨发现的，除了这些木头之外，没有任何生命迹象。记录者的身份，以及他所在的团体，目前未知。
//
//基地、前哨站和社区：
//这一层没有已知的基地、前哨站或社区，但M.E.G.定期派遣特工进入，寻找对抗致命暴雪事件的方法。
//
//实体：
//在该层中，有许多实体已经适应了寒冷的气温，似乎不受暴雪事件的影响。笑魇、猎犬、窃皮者、警告风筝、死亡飞蛾、尸鼠、传送者，以及在某些地区生长的爬菌。这些实体都适应了寒冷的天气，并以某种方式对暴雪事件产生了免疫力。
//
//出口和入口：
//入口
//在Level 6找到一扇罕见的、感觉异常冰冷的大金属门，可通往这里。
//在Level 11.1通过黑树切入
//Level 21上的蓝门通向本层。
//如果Level 39的边界开始下雪，就有可能在那里简单地切入。
//切入Level 47里的一棵被雪覆盖的树，就有可能到达这。
//跳入随机出现在Level 115或Level 116的雪堆中，就会被带到这里。
//进入Level 188上一个看似被雪覆盖的窗口，就可以到达这里。
//出口
//找到一扇奇怪的黑门可以通向Level 130，但有风险。
//唯一已知的安全切出方式是找到一片柔软的黑雪并跳入其中。这会回到Level 11.1。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl129{}