//Level 131
// 
//
//生存难度：
//等级 2
//
// 
// 
// 
//shop-store-old-tv.jpg
//Level 131中一处阳光充足区域的图片。
//
//Level 131是一处电视机旧货店，货架上有很多（电视机）存货。
//
//描述：
//Level 131总的来看像是一家电视机旧货店，通常处在一种近似阳光的照射中。然而，对此类阳光源头的搜寻没有任何值得重视的结果，因为光源似乎就在房间外面，在每个房间当中。这种阳光并非无处不在，它可能会变弱、变得完全陷入黑暗——在这些地方，光线的源头就转为电力光源，例如电灯，或者电视机本身。有时会有无光区域。进入Level 131时，流浪者通常出现在该层的一处阳光充足的区域中。实体可能出现于该层的任意位置，然而，它们最常出现在较暗的区域中，因此强烈建议你去找一处阳光充足的地方。
//
//有时，区域中的阳光会尽数熄灭，如同按下电灯开关一般，该层的每一台电视都发出了信号受扰的噪声——你只能听到这些声音。通常，这意味着徘徊电噪即将出现，尽管它也可以在没有此类情况的时候显现。徘徊电噪是一种有时会出现于Level 131层内的类人实体——尽管其出现的次数要少于其他常规实体。如果Level 131层内的多台电视机发生自行启动并开始播放静电噪声的情况，请立即离开。
//
//对Level 131进行探索时，建议尽可能不要触碰多台电视机，因为可能会有复数电视机在某台电视机受触摸时发生反应，这会导致响度足以吸引实体的噪声。许多电视机会在看似随机的情况下启动，但是经过它们也有可能会令其启动。这些电视被观察到以多样的语言播放多样的频道，但是都没有足够的时长可以了解其播放的内容。此外，也常会观测到电视屏幕中出现信号干扰，以及似乎是关于某人的过去或未来可能发生的事件的记录。然而，这些东西似乎只囊括了他们在后室中的生活，因为没有播放关于外部世界的片段的记录。在Level 131的较暗区域，这些电视机会变得更加活跃。这些电视机可能具有某种程度的知觉，因为一台电视机的被毁似乎会让其他电视陷入某种“恐慌”之中——它们会迅速调换频道，移动任何旋钮、按钮、或者是它们可能拥有的其它“附肢”。老式收音机也会出现在Level 131，尽管它们不那么活跃，也不那么常见，但它们似乎也有类似的行为方式。
//
//整个Level 131层内到处都能见到随机的物品，包括一辆自行车、一个闹钟、一个工具箱等等。发现了很多类型不一的、似乎属于店主的文件——像是高中毕业证书之类的——但是每个文件上面的名字都被划掉了。除此以外也没有发现其他关于所谓的店主的证据。
//
//基地、前哨与社区：
//该层没有已知的基地、前哨或社区。
//
//出口与入口：
//入口
//就像Level 104一样，Level 131可以通过电视进入。然而，Level 131的不同之处在于，任一层级内都能找到一台屏幕碎裂的电视，并可通过其屏幕进入。无法看到上述电视机的内部结构，取而代之的是一片黑色的虚空。可以移动这台电视，尽管它会在某个随机的时点上从某个位置消失，然后重新出现在另一个层级中。进入时要当心，因为屏幕的位置仍然存在碎玻璃，这可能会造成损伤。
//
//出口
//想要出去的话，人们必须在本层的任意区域探索400米到1600米的距离。在这个位置能找到一个出口，类似于一家商店的正门。外面是一片看起来异常明亮的白色光源——一旦出去的话，这片光线就会消失，而流浪者会出现在一个普通的层级中。如果是身处本层的较暗区域，则会有一个带有霓虹灯“出口”标志的金属门——它可能位于电视货架旁、被货架包围、甚至是被货架封住。出去以后，流浪者会出现在一个负数层级中。强烈建议你寻找前一道出口，但若是正在被追赶或者身处其他危险当中，那也可以使用这扇门，风险由流浪者自行承担。
//
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl131{}