//Level 181
// 
//
//生存难度：
//等级 不可或缺
//
//重要档案
//时空变幻
//现象记录TRhWJiENaS7o5kr.jpg
//挖掘出的大块宝石。
//
//Level 181是后室的第182层 这个层级是我们的。请勿进入。仅指定人员能够得到矿区准入授权。
//
//描述：
//Level 181由矿区组成，我们在此地收集宝石，用于制作武器和珠宝。这一极其庞大的洞穴系统向周围延伸了数英里。尽管这里是地下，但仍相当寒冷，进入前请带件外套或是加层衣服，我们不希望你们中的谁被冻伤。矿洞由灰色岩石构成，平均高度约为8英尺。
//
//我猜在读这篇文章的你，应该是被分配来这里采矿的人员。如果这样，你在采矿时应谨记以下几点。首先，身上随时携带可计时的器具。时间，会因你在矿区的位置而膨胀或是收缩。标有S字样的矿洞可以安全地开采。切勿进入标有W，D，或C字样的矿洞。而你只有在全部S型矿洞都在运转的情况下，才被允许进入标有A字样的区域。
//
//- 矿洞分类
//矿洞类型&含义：
//
//S - 安全（Safe）
//你可以在该地区安全地自由开采。
//
//A - 异常（Anomalous）
//可以在该地区相对安全地开采，但要对于可能发生的无征兆的异变保持警惕。
//
//B - 贫瘠（Barren）
//该地区的所有宝石都已被开采完毕，没有理由进入。
//
//C - 收缩（Condensed）
//该地区的时间剧烈收缩。请勿进入。
//
//D - 膨胀（Dilated）
//该地区处于时间膨胀状态。请勿进入。
//
//W - 扭曲（Warped）
//该地区的空间时间扭曲。请勿进入
//
//7 - 受保护（Protected）
//你不允许入内。
//
//你可能会问，为什么开采这些宝石，怎么开采，对吧？这些宝石具有奇异特性，类似我们救世主所戴的项圈，它能使宝石持有者之间进行如己身一般的心灵感应。这些晶体惊人地坚硬，其硬度甚至可以与钻石相媲美。它们看起来就像绿宝石，嵌在灰色的岩石中很容易找到。对其开采也并非难事，只需要把它挖出来，用些杏仁水洗掉上面残余的石头就好了——后者溶于杏仁水。
//
//不仅看上去不错，它还是制作武器的上好材料。实际上，为了防止大型冲突和战争的爆发，我们已储备了不少这种资源。非组织成员不允许进入该层级，否则会被即刻遣返。如果你遇到闯入者，请通知主管人员。
//
//开采规约：
//以下是一份说明矿区内要求的全面指导。如有其他疑问，请联系主管人员。
//
//请携带提供的采矿设备进入Level 181，或在层级中找到一些。
//所有矿洞入口处均有分类标识。参考上文的指南，来确定矿洞安全性。
//你可以单独工作，也可以团队协作。只要你在采矿就行，别的都由你自己决定。
//你的18小时轮班快结束时，请将所有收集到的宝石搬出矿洞，回到中央区域，将其放在收集区。宝石很轻，所以携带应当不是问题。
//基地、社区和前哨：
//贝里信众：采矿前哨
//就是我们，很明显。
//无固定成员，成员被分配到此处，按指定时间工作。
//我们不想与那些未经允许的闯入者进行交易或给他们提供便利。
//入口和出口：
//入口：
//警告：
//
//仅允许贝里信众成员浏览以下信息。
//- 凭证通过
//在Level 4的地上找到一个满是泥水的洞，会使你来到此处。
//在Level 170内某个水泥箱中找到一扇绿色的门，进入后会前往B型矿洞。
//
//出口：
//目前有两个已知出口。
//
//在层级内停留18小时后，你会被传送至来时的层级。重要的是不要去往时间异常的矿洞，因为你在层级内的时间也会膨胀/收缩。
//找到一个水坑，跳入其中，你将去往Level 43。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl181{}