//Level 163
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//5ekmztp6FWi8fDI.png
//由无人机在中心建筑的边缘所拍摄的照片。
//
//ovLNXQlIEZRnMU1.jpg
//一位流浪者提供的中心建筑的平面草图。
//
//Level 163是后室的第164层。
//
//描述
//对这个层级最贴切的描述，就是一系列被浓雾所围绕的高楼大厦。由于这些雾气非常地浓，以至于没有办法看清这些高楼所在的地面；不知道是雾把地面给盖住了，还是根本就没有地面，高楼的下面只有无尽的虚空。目前人们更加认同第二种理论。因此，当我们提到高楼的底部时，我们通常会用“虚空”来指代它。
//
//当访问者进入到这个层级的时候，他们总是会出现在一部电梯里面。电梯会上升数分钟，最终来到一个位于最高的摩天大楼的顶层的一个房间里，这座大楼也被称作“中心建筑”。目前来说，这个建筑物是唯一一个可以安全进入的地方，而其他在这个层级中存在的建筑因为距离太远而无法到达。1
//
//这个层级的天气永远只有多云和多风，从不会下雨或者下雪。温度会在-5℃到5℃之间浮动，不过也有降低到-12℃的记录。2
//
//中心建筑的楼顶大部分是空旷的，只有一些通风口，空调外机和电气装置，还有前文所提到的电梯入口。楼顶的整个楼面可以分为两个部分：第一个部分是直角梯形的形状，而第二个部分会稍微高一些，呈矩形。位于中心的是一个立方体的结构，是电梯所在的地方。
//
//很多去到过那个层级的旅行者报告称，他们总是会感到晕眩和迷失方向，同时偶尔还会有恶心和头痛的症状。在许多例子中还会有一种被称为“虚空的呼唤”的现象，当一个人从高处，例如摩天大楼，向下看的时候，他就可能会有这种奇怪的，想要一跃而下的冲动。几乎在所有的例子中，人们都会产生这种冲动并随之跳下。在前厅中，这种现象有着详细的记录。然而，它通常不会真的使人跳下去，但在Level 163中，这种影响似乎被加强了。当人们跳进虚空之后会发生什么是未知的，但曾经有一个流浪者在论坛之中发布了一个现已被删除的帖子，他在帖子中声称自己在下落后，来到了Level 198，然后又在持续数天的下落后出现在了Level 11。3
//
//很多人认为在坠落到虚空的尽头往往意味着死亡，但有一些理论认为，这个虚空标志着这个层级实际上是蓝色通道的一部分，所以，落入虚空的人会一直下落，直到他们死于某种自然原因，例如饥饿。另外一些理论认为落入虚空的人会来到Level 254，这就说明了为什么没有人能在坠落之后回来。到现在为止，这两种理论都没有被证实。
//
//除了“虚空的呼唤”和虚空本身之外，这个层级里没有其他的环境危害，并且唯一存在的实体就是电梯。4
//
//基地、前哨和社区
//由于该层级拥有着某种特性，它能够使访问者出现让自己受到伤害的症状，因此在这里定居是很困难的，与此同时，因为那些令人不适的症状，绝大多数的访问者只会想要尽快地找到出口。到撰写文章为止，所有在此层级建立前哨的尝试都宣告失败。
//
//流浪者的故事
//这是一个一个流浪者所发的帖子，他于2021年11月5日在落入虚空后生还，这个帖子随后被删除。
//
//隐藏故事
//好的，我该从何说起呢…
//
//我叫Tay。我已经被困在后室…谁知道已经多久了。在后室里，时间无关紧要。
//
//我现在在Level 11，躺在一张我在一些建筑物里找到的旧床垫上，喝着杏仁水。在经历过那些事情之后，我非常需要补充精力。我希望任何一个看到这篇帖子的人都能够记住：如果你发现自己身处Level 163，请立即离开那里。那里可能没有危险的实体，生存难度可能是0，但相信我，那里并不安全。
//
//我是怎么去到Level 163的
//当我进入一个位于Level 11的建筑物之后，事情开始变得奇怪了起来，我发现我自己来到了Level 13。我讨厌Level 13。对我来说，它远比后室中的其他层级讨厌。我猜这是因为它会让我回想起我童年时生活的地方。
//
//在周围逛了一会之后，我找到了一部电梯。我可以做两件事：我可以永远被困在Level 13，或者通过一个常见的出口来到与其连接的另一个（有可能会更糟）层级；或者，我可以在电梯上碰碰运气。最后我选择进入电梯，让运气来决定我的命运。
//
//当然了，我很幸运；有一个可用的按钮标着Level 11。所以我毫不犹豫地按下了那个按钮。电梯随即动了起来。过了几分钟，它仍然还在动。我开始感到一丝奇怪，这部电梯在这两个相距如此之近的层级之间花费了太长的时间，但我也没想太多。
//
//过了一会，灯熄灭了。我瞬间进入了高度警戒的状态，想着是不是实体要入侵电梯了，或者是这部电梯想要把我给摔死。但几秒钟后，灯又亮了起来，一切似乎又正常了。我变得十分紧张；这些表现一点都不正常。“但话说回来，在后室里有什么正常的事情吗？”，我想。
//
//最后，就像是等到了时间尽头一样，电梯终于停下来了，我听到了“叮”一下的声音，随后电梯门打开了。
//
//Level 163的内部
//我走出电梯，发现自己在一个昏暗的房间里。墙和地板都是混凝土做的，周围被管道和通风口所覆盖。它看上去与我对Level 11的印象完全不同。
//
//在我的前方，我可以看到一扇黄色的金属制双开门。一个紧急出口的标志悬挂在它的上方，发着绿光。“也许”，我想，“这可能是某种维护房，走出那扇门，我就会回到Level 11了”。周围没有第二个出口，所以我径直走向了那扇门，打开了它。
//
//我刚打开门，一阵冰冷的狂风就向我脸上吹打而来。这里不是Level 11。我观察周围；这个全新的区域像是一座摩天大楼的楼顶。我很快就意识到发生了什么。
//
//我曾经听说过一些流言，它们说电梯有时候会无视你选择的层级，把你带到一个神秘的地方。但那只是流言而已，我选择不相信它们。但是，这一刻，流言是对的。我到达了Level 163，并且需要离开这里。
//
//当我想到这些的时候，我意识到了一些事情：我正在走动。我正在直直地向着建筑的边缘走去。就像是我的腿有着它自己的想法，像是有一些力量在推着我前进。直到我到达了建筑的边缘。
//
//我很快发现，我正在看着虚空。是的，虚空；那里是一片浓密的，几乎是紫色的雾，它覆盖着一切，当我向下看去的时候，我看不到任何地面的痕迹…我只能看到雾气。在我眼光所及之处，一切都是紫色的。然后，一个想法入侵了我的脑海，那是一个无论我多么努力，都无法摆脱的想法。
//
//“你应该跳下去。”
//
//我有一种糟糕的，想要跳下去的冲动。我不想死，我既不悲伤，也不苦恼。我只是想跳下去。有些东西正在控制我，那个声音一遍又一遍地让我跳下去。而且我没有办法无视它。
//
//只要我还有一部分理性能够思考，我就会一直想着跳下去的后果：我不知道下面是什么，但跳下去只怕是凶多吉少。我不能冒这个险。不，无论那个声音重复了多少遍，这都不值得。但话说回来…如果我跳下去了呢？
//
//在我想清楚之前，我屈服了，跳了下去。我开始自由落体，那个声音也消失了。随之而来的是恐慌。我要死了。我开始尖叫。然后，什么东西把我给弄晕了。
//
//Level 198的内部
//当我再次睁开眼睛的时候，我还是在往下落。我又开始了尖叫，但我随后意识到，事情有些不对劲。雾不见了。时间变成了白天，当我环顾四周时，我只能看到有着云朵的蓝天。我是已经被传送到了另一个层级吗？
//
//我向下看。还是那片天空。我往四周看，只有更多的天空。周围没有刚才我跳下来的那栋大楼的痕迹。我猜这个新层级是没有东西的，我只会在这里下落直到永远。我停止了尖叫。这种浪费空气和力气的行为没有意义。然后我想起了另一个我听说过的流言。据说，在极少数情况下，从高处坠落时，你会被传送到一个层级里：Level 198。那个层级除了天空以外什么都没有，甚至没有坚实的土地可供站立。你所能做的就是一直下落，等待着它把你传送到另一个不同的层级里。
//
//我还听说过一个女孩从Level 11的一栋楼上跳下，然后来到了这里的故事。她在被传送回Level 11之前，在这里下落了至少一个星期。如果流言属实，那我就得在这里花上一段时间了，但至少我还能回到我想要去的地方。而且，我在真的进入到Level 163之后，我也变得愿意去相信这些流言了。
//
//于是我冷静了下来。只要我有机会能够重回安全，我不在乎要花多久。
//
//回到Level 11
//事情发生在5天之前。而就在写这篇文章的30分钟前，我完成了Level 198的自由落体。我回到了Level 11，回到了那个把我送到Level 13，让我经历这一切的大楼的门前。终于结束了。此时我已经完全忘记我之前想要在Level 11做些什么了，但那已经不重要了。我活了下来。
//
//我到现在还不是很了解Levels 163和198，但我能够活下来似乎只是因为机缘巧合：我知道所有落入Level 163的虚空中的人都消失了，再也没有人见到过他们。那听上去很吓人。我本来会是被虚空所吞没的一员，但我就是没有加入他们。一点点的运气，也许就决定着生死。他妈的。我要更加谨慎一些了。
//
//无论如何，我活了下来。我这辈子不会再去碰任何的电梯了。
//
//入口与出口
//入口
//在Level 9以上的所有层级中，所有的电梯都有极小的几率会把你送到这个层级，而不是你的目的地。这个层级的按钮也有可能会直接出现在电梯里。还有一种理论认为，这个层级直接与电梯井连接在一起，尽管除了在电梯里面以外，从那里直接到达这个层级是不可能的。
//
//出口
//在电梯到达之后，如果访问者走出了电梯，又在电梯关门之前走了回去，那么电梯就会开始剧烈地下降，把访问者送到Level 3、Level 4或Level 5。
//如果访问者在电梯离开之后，又再次呼叫电梯，那么电梯依然会到达，其功能也会变得与平常的电梯实体一致。
//与上一个出口有关，有一定概率，叫上来的不是电梯，而是一扇去往Level 998的白色的门。
//前面提到的坠落并切入到Level 198的事例仍在调查中；如果这种方法能够被重现，那么它也将会是一种合理的离开这个层级的方法。与此同时，虚空仍然被认为是危险的，因为坠入到虚空中的结果仍是未知的。
//
//作者信息
//« Level 162 | Level 163 | Level 164 »
//
//Footnotes
//1. 有一个理论认为，这些远处的建筑要么是由无法进入的物质构成的，要么就只是一些海市蜃楼。
//2. 这种低温虽然十分少见，但还是建议准备来到这个层级的人多穿几件衣服。
//3. 这个事件已被调查。为了存档，被删除的帖子已被恢复，并附于本文的底部。
//4. 这个电梯的功能可能与其他大部分的电梯都不同，这取决于人们与它的交互方式。可以在本文的入口与出口部分中找到有关的详细信息。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl163{}