//Level 139
//欢迎使用M.E.G.层级稿件数据库，流浪者！
//
//
//请输入关键词：
// 
//Level 139
//
// 
//搜索有关 Level 139……
//
//
//
//……
//
//
//
//……
//
//
//
//找到4个页面。
//
//Level 139 递交文件 A » 创建日期：----/01/20
//创建者 特工Paula A.（退役）| 驳回
//
//Level 139 递交文件 B » 创建日期：----/04/12
//创建者 特工Jonathan Yu | 待定
//
//M.E.G. Level 139 探索通知 » 创建日期：----/04/12
//
//Level 139 » 创建日期：----/05/02
//创建者 特工Clarissa Violet，Linda J.等 | 通过
//
//请选择页面查看：
//
//
//
//关闭
// 
//
//生存难度：
//等级 无所畏惧
//
//安全
//稳定
//充满力量
//
//
//是什么造就了强大？
//
//
//能与任何敌人打斗，却被花言巧语随意操纵的彪形大汉……
//
//
//
//……并不强大。
//
//
//
//狡黠的小偷，几乎可以欺骗任何人，但品德低下，缺乏荣誉感……
//
//
//
//……并不强大。
//
//
//
//可敬的演讲者，正义的伙伴，铿锵有力的声音响彻云霄，可没有支持言论的力量……
//
//
//
//……并不强大。
//
//
//
//那么……什么才是强大？
//
//
//
//we_do.png
//让我们看看你有没有这个实力。
//
//欢迎来到勇者的试炼。
//1
//锻造力量，征服恐惧之地。
//
//我们人类是极其脆弱的生物。生来就只有缺乏保护的单薄身板，不论什么时候什么年龄，我们的成就和肉体都无法与自然的伟力相提并论。后室就是个例子。我们可以适应环境，可以随机应变，并且我们可以学习，但从全局来看我们只是一颗灰尘。我们可以是一个人，可以是五个人，可以是五千人，但我们仍然无法战胜后室，他是无限的化身。
//
//这是个可怖的想法吗？也许吧。
//
//一个人越是思考这样的事实，越会开始认为这一切都毫无意义。知道以我们软弱的人类思维永远都无法理解像宇宙这样浩瀚的概念，我们正在攀登一座无尽的山峰，永远无法抵达山顶。
//
//我们很清楚这些，但我们未曾停下脚步，为什么？
//
//因为我们是人类，我们足够强大。
//
//强大到可以大笑着直视死亡的眼睛。当地面在我们脚下坍塌时，我们的数量可能会减少，但我们总能东山再起。面对不可能的挑战，我们设定目标，取得进展，我们互相赋予动力，我们互相给予力量。
//
//
//
//强大不是击倒反对你的敌人的力量。它是理由。
//
//强大不是创造美妙词句背后的技巧。它是意义。
//
//强大不是相信正确事物带来的荣誉。它是信念。
//
//
//
//想在后室生存，你需要足够强大。
//
//强大到足以实现你的目标，不管它是宏伟还是微不足道。
//
//
//
//如果你的目标就是变得强大呢？
//
//
//
//那就来Level 139吧……
//
//
//
//证明自己。
//
//
//
//2
//我们在等你。
//
//
//
//来自Amber Hearth的通知，稿件管理员
//
//这是怎么出现在这儿的？这篇稿件的写作风格和Paula特工过去提交的完全不一样。就好像有另一个人在用她的号。这甚至没遵循适当的文件格式！很明显，这篇文章是由完完全全的另一个人所写，而且绝对不是我们的特工人员。我不希望这个数据库的信息落入歹人之手。在此通知所有正在阅读这篇文章的人，如果你有任何关于Paula特工，尤其是关于她的最后去向的消息，请通过M.E.G. CCC同我联络。谢谢，祝你旅途平安。
//
//- Amber Hearth
//冒险者总署，稿件管理员
//
//
//
//这篇文章还有附件，查看？
//
//
//
//Y
//
// 
//
//
//载入文件中……
//
//
//
//…
//
//
//
//文件已载入！
//
//
//
//
//
//3
//真正的强大需要敏锐的眼光和聪慧的头脑。
//
//
//
//
//
//关闭
// 
//
//生存难度：
//等级 3
//
// 
// 
// 
//4
//从岸边看斜面。
//
//编辑日志一
//
//Level 139是后室的第140层。
//
//描述：
//好吧，这是我头一次试着用这个，我也不知道自己在干啥。说实话，我从来没有想过自己会如此突然地发现一个层级，也希望一切能保持原样。事实证明我错了，我就这么找到了一个层级。本来我真的以为自己要完蛋了，来到这儿倒也是好事。我在Level 9被一大群Hounds所包围，如果没有以某种方式来这里的话我可能早死了。我想自己还是蛮走运的。
//
//在数据库里搜了搜，我找到一篇旧的这个层级的拒稿。Level 139……呃。写那篇稿子的肯定不是自己人！这让我毛骨悚然。但我想这是唯一能拿到的参考资料，所以我会在探索的时候继续读完它。
//
//从我所站的位置看，这个层级似乎是某种热带岛屿，坐落在什么荒郊野岭的那种。岛屿顶部有座火山，看起来很小，可能只有几英里的宽度？这里的阳光很炙热，但至少这回有太阳，还能听到海浪的撞击声和轻微的风声，除此之外，我什么都听不到。希望这意味着这里已经完全荒废了。我真心不想遇上写第一份稿子的那人。
//
//等等。
//
//我前方的一排树上有一个标志，我要去一探究竟。在此之前我先把它上面的内容写上。
//
// 
//如果你看到这里，你的勇者试炼才刚刚开始。
//
//
//
//5
//它看上去如此不详，但又如此诱人……
//
//编辑日志二
//
//我真是难以置信，一看到那个标志，前方的地面就裂开了，露出一个洞口！那时好像地震了一样，沙地突然开始摇晃，然后又停下了。现在我的心怦怦直跳，不知道自己是否应该继续记录，因为我看手机的每一秒都可能有东西跳出来抓我。我知道有什么东西在看着我，这个山洞不可能是自然打开的。
//
//我口袋里有把瑞士军刀，希望这足以应付。
//
//
//
//…
//
//
//
//我只是又看了一眼那个标志，就感觉胃部骤降了一下。说实话，我现在手抖的厉害，几乎打不出这些字。现在上面的文字又不一样，它他妈的趁我没注意就变了。也许是我疑神疑鬼，这只是后室的什么正常现象，但是……我先去看看吧，看看它说了什么。
//
//你想要一条出路，流浪者，对吗？嗯，你可能想要一个简单的解决方案，但简单的往往不是正确的。唯一的出路就是通过那个山洞。所以，你还在等什么？
//
//这肯定是什么神经病的玩笑。我才不会进那个洞！
//
//…
//
//但如果那是唯一的方法……我想我没有其他选择。这座岛可能很小，但我恐怕不能在饿死或渴死之前搜索整个岛来找到另外的出口。这可能就是我唯一的机会了。
//
//我现在要进去了，如果我没有继续编辑这个，就说明我死了。祝我好运。
//
// 
//
//
//编辑日志三
//
//我为啥这样做？
//
//我感觉有什么东西在腿上爬……很多，一种痒痒的柔软感和骨质的坚硬感混合在一起的感觉。感觉脚下有什么东西嘎吱作响，绝对不是石头。而且这儿闻起来像腊肉。
//
//我很慌。说真的。我已经被吓得魂飞魄散了，靠打字来分散自己的注意力，来继续前进。我用手机来照明，但只用它照向正前方。我可不想看现在脚下踩的东西。
//
//我听到一些响动。有籁簌声和一种奇怪的嗡嗡声。我感觉洞壁向我压下来，不得不躲避着前进；我的头已经贴在天花板上了。这里的空间非常狭小，我感觉自己的空气供应在减少。这儿真的好闷……老天爷。我有点焦虑了。Jonathan，保持冷静，继续记录……
//
//…
//
//有束光！耀眼的太阳光。我得救了！我赶紧爬过去，我好像真的做到——
//
//6
//我操
//
//他妈的我相机上有只狼蛛，这他妈哪儿来的？！
//
//
//
//7
//我征服了这个山洞。
//
//好，好好好。我成功了。我刚才可能激动地叫出来了，但现在都结束了。山洞的出口处有个栅栏，但幸亏我能打开它。出来后我把栅栏又恢复原样了，我担心那只狼蛛可能跟踪我或者会干什么别的。
//
//老天爷啊，原来这就是这玩意一直在我腿上爬。天啊。
//
//我无话可说了。但我从未想过自己会如此想念新鲜空气，和阳光。我想这些东西不是理所当然的，现在，出口在哪儿？希望这一切都是值得的。如果这里也没有出路，我就不会钻进那个山洞了。所以出口在哪儿？
//
//一次小小的惊吓不足以让你动容。告诉我，你为此自豪吗？是否对活着出去更有自信了？
//
//什么，对，我想确实——等等，我这是在和谁说话？
//
//这只是个开始。但你的试炼只进行了一半。你还没有证明自己值得离开。
//
//他妈的饶了我吧，我要一个答复！说好了你会告诉我出口的！
//
//你要的答案就在瀑布上方。
//
//
//
//8
//……
//
//
//
//你他妈肯定是在逗我。
//
//
//
//行吧，我去。毕竟我刚从一个满是狼蛛和鬼知道还有什么的山洞里活着出来。爬上去对我来说应该不算太难……实际上我的攀爬能力并不差。我以前一直在我家后院的树上爬上爬下！应该不算太难。
//
//现在观察我的那东西可能是个臭婊子，但他说的对。我现在真感到有点自信了。我能感觉到肾上腺素在血管里涌动。我能感受到空气缥缈，瀑布从我身边呼啸而下的轰鸣声。我的手从岩壁上滑脱了，这很滑，真该死。
//
//我可能会死在这儿。但这里是后室，我早就做好了死的准备。即使我死了，这些消息也仍然会传递出去。如果我活着，那我很可能会扬名立万。所以这是双赢。这是我在攀爬时不断告诉自己的东西。我能做到的。
//
// 
//
//
//我他妈卡住了。但是，哎，至少我已经爬了一半。我现在正坐在一个小岩架上面喘粗气。这儿的景色非常棒，我已经迫不及待想看到顶部的风景了。出于某种原因，我不再害怕自己失足坠落了。只是……我不知道怎么继续前进，上面好像没有能让我抓住的东西了……让我花点时间坐下来好好想想。车到山前必有路，肯定的。
//
//你确定？
//
//…
//
//没错，我要找到上去的路，就为了报复你，你个傻逼。
//
//
//
//这就是信念。
//
//
//等等，这儿之前没有那样的通道，吧？我刚才怎么没看见呢？
//
//
//
//好吧，这不重要。重要的是我爬上来了！爬上了一座狗日的瀑布！噢，脚踏实地的感觉真棒。我可以从这里看到最开始的海岸！它看上去离我特别遥远。我真的走了那么远吗？现在我他妈觉得自己无敌了。Katie绝对不会相信这一切。这个徒手攀登瀑布的人。这个铃声很好听，你不觉得吗？
//
//我喜欢它的声音。
//
//
//
//那么，接下来是什么？
//
//9
//顶点。
//
//
//
//啊，这就对了。果然，出口就在岛的顶点。现在一切都说得通了，所有事都说得通了。
//
//当我旁边的岩壁上出现一个洞口的时候，我已经不再感到惊讶了。我能感觉到不管是谁在看着我，他们都在默默地为我加油。我的脸和耳朵之间有股冲动。我径直走向新的洞口，感到一阵热风扑面而来。这座岛的这座山……是火山，对吗？
//
//不重要。我已经走过了满是狼蛛的山洞，还爬上了一座该死的瀑布。我能通过火山的内部，没问题。无论我在试炼开始时心里有多少恐惧，现在都已经不复存在了。我只感到……鲜活、新奇、振奋。我内心里的一半还在对我正在干的事情半信半疑，但我在做。我会找到出口。我会征服这座火山，毋庸置疑。
//
// 
//
//
//10
//如此美丽的熔岩。
//
//编辑日志四
//
//已经没什么可怕的了。我承认这里很热，但没什么是我不能忍受的。洞口通往一个宽阔的洞窟，有一条熔岩河从中流过，我一路穿过它，在隧道里向上走。我已经看到它尽头的光了——希望它通向山顶。
//
//
//
//当我走出出口时，周围的环境让我惊讶地喘息。这座火山位于岛屿中心，所以当我站在火山顶部时，一望无际。瀑布在我脚下奔腾，狼蛛洞，以及更远的海岸线。我站在世界之巅。我克服了恐惧，抵达了峰顶。我已经变得……足够强大。
//
//我听到有个声音在我身后呼唤我。我转过身，看到一位穿着白色夹克、有着脏脏的粉色长发的女孩朝我走来。她伸出手和我握了握。她的手和我的比起来是如此的小，以至于她自我介绍是“勇者”时，我很吃惊。
//
//你已经从开始的地方走了很远的路……在许多方面，对吗？我这里还有最后一件事需要你做。
//
//……她如是说道，脸上挂着腼腆的笑。
//
//在提交给你组织数据库的稿件中，有一条隐藏的信息。勇敢和愚蠢一线之隔。我想确保你有思考的能力。如果你能找到它……你就可以加入我们。
//
//
//
//我把信息告诉了她。不是吹牛，但我很容易就找到了。这是一句强有力的话语，我会铭记于心。
//
//她对我笑了笑，指向了火山口。那是一座波光粼粼的湖。那是出口，是我的出路。
//
//恭喜，你已经通过了试炼！现在……你有两个选择。你可以跳进湖，离开这个地方，或者……加入我和我的追随者。你将获得食物和水，以及一个安全的住处。当然我们会时常进行训练，以测试自己的极限，保持感官敏锐。但以你向我所展示的本领而言，那些对你来说应该是轻而易举的。我给你时间思考。
//
//我把手机拿了出来。虽然我认为她不知道这是干什么的，但她允许我输入这篇日志的剩余部分，我对此表示感谢。如果你们中有人想来搜救我的话，不用了，我已做出自己的选择。
//
//因为我为此骄傲，我足够强大，而且我无所畏惧。
//
//
//
//
//
//关闭
//M.E.G.官方探索通知
//
//近期正在寻找志愿者组成一个探索小队，旨在于寻找和记录新发现的Level 139。层级稿件数据库中提供相关的层级稿件。如果有任何其他信息提供，特别是有关于其进入方式的信息，我们不胜感激。
//
//- Myca Ashbluff,
//探险者总署，首席团队计划人
//
//
//
//
//
//关闭
// 
//
//生存难度：
//等级 3
//
// 
// 
// 
//11
//水面视角观察岛屿。
//
//Level 139是后室的第140层。
//
//描述：
//Level 139由一座位于无限宽广的海洋中的小型岛屿组成。岛上植被覆盖率较高，热带气候。平均温度为86°F（30°C），天气始终多云。其昼夜周期与地球相同，太阳落下和升起的方向也与地球的太阳相同。岛屿中心是一座休眠的层状火山。
//
//尽管植被茂盛，但这座岛上没有可供食用的植物、水果或动物。目前也没有发现自然存在的杏仁水。这结合上相当炎热的气候，使得处于没有援助的情况下，在该层级长期生存极为困难。
//
//然而，并非不可能。进入这一层级后，流浪者会通过“勇者”控制的标志与其沟通，这是一个友善而强大的实体，她监管着整个层级。
//
//勇者
//12
//勇者形象的艺术再创作。
//
//勇者表现为一个约十几岁的年轻女孩形象，身着白色冬季夹克、黑色背心和黑色紧身裤。她很少独自出现，但似乎无处不在且（或）无所不知，能够在任何时候按自身意愿操控和塑造岛上的任何物体。虽然她本身没有敌意，但会胁迫层级中的流浪者完成“勇者的试炼”来离开该层级。
//
//在成功完成勇者的试炼后，流浪者可以选择离开前往随机的安全层级，或是加入勇者的追随者，他们名叫无畏者。无畏者是一群可以永久居住在岛上的流浪者，他们以勇者创造的无尽的补给维生。
//
//据勇者所述，她的行为目的是，希望能让所有进入她的层级的流浪者为将来的挑战做好准备。她认为这里是流浪者的“训练场”，这样未来他们就得以探索更危险的层级。也正因如此，“无畏者”的成员允许在任何时候离开岛屿，继续探索后室。
//
//勇者的试炼
//勇者的试炼由三部分组成——穿过满是狼蛛的洞穴，攀登瀑布，以及通过火山隧道找到通往山顶的路。这些都是勇士设计的，为了鼓励流浪者面对自身恐惧。其中考虑到了最常见的一些非理性恐惧——蜘蛛恐惧症（对蜘蛛的恐惧）、幽闭恐惧症（对狭小空间的恐惧）、黑暗恐惧症（对黑暗的恐惧）和恐高症（对高空的恐惧）。
//
//虽然初心不是为了杀伤，但许多流浪者在这些测试中死亡。考虑到这一事实和其他问题，该层级的生存难度被记为3。拒绝完成这些考验会使流浪者马上回归到进入Level 139前的层级，而这往往是致命的，因为只有流浪者在某些危险层级中面临危及性命的情况时，才会进入Level 139。
//
//入口和出口
//入口
//Level 139基本上只能从生存难度为3或更高的层级进入。当流浪者处于危险情况时（如被敌对实体包围，无法逃脱），他们会发现自己被传送到了Level 139。唯一稳定前往Level 139的入口是从Level 121向西一路航行。
//
//出口
//唯一可靠的安全离开Level 139的方法是完成勇者的试炼并进入休眠火山中心的火山口。这将通向一个安全且很可能有人存在的层级，如Level 11或Level 1。另一种离开Level 139的方法是拒绝勇者的试炼，这时流浪者会被遣返至来时的层级，也仍然处于来时的境地。这很可能致死。所以任何在Level 139的流浪者都应尽力去完成勇者的试炼。
//
//
//
//
//
//勇者的试炼
//
//
//
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl139{}