//Level 127
// 
//
//生存难度：
//等级 4
//
//不稳定
//大量实体
//极端温度level%20image%201.jpg
//一个典型的热水器和炉子，在Level 127中发现了一盒随机物品。
//
//level%20image%203.jpg
//Level 127中一条拥有不同房间的走廊。
//
//Level 127是后室的第128层。
//
//Level 127由一系列的走廊和房间组成。Level 127的墙壁由胶合板或煤渣砖制成。这些墙壁上覆盖着一种物质，后被鉴定为人类的体液和组织及其他东西，地板则由混凝土或瓷砖构成，墙上涂有类似的东西，这取决于流浪者所在的房间。同时，Level 127被描述为闻起来像鱼和腐肉。
//
//银色的管道穿过每个房间和走廊的天花板。尽管这些管道大小不一，但它们通常是中空的，除了里面偶尔有试图穿过它们的人。当这些管道空着时，可以用来制造武器/工具，以防御该层级中的原生实体。
//
//家用热水器、火炉和散热器等物品都可以在Level 127中找到。这些物品在该层很常见，几乎每个房间和大厅中都有。它们的电源异常，无法关闭。如果其被摧毁，无论受到多大程度的损坏，这些物品中的任何一个一旦离开流浪者的视线，就会迅速自我修复。而且这些物品不会以任何方式受到所产生的热量的影响。
//
//该层级与Level 2有相同的属性，即随着时间的推移产生致命的热量。产生热量的罪魁祸首是上述物品。它们产生的热量可以上升到大约93.3o摄氏度（200o华氏度）。这足以将人类的皮肤和身体融化成水滴状的实体。在流浪者处于该层级的时间内，热度将继续攀升。然而，如果多个流浪者进入Level 127，每个人的热度将以不同的速度升高。
//
//该层级中的实体被描述为一团人或一个混合肉块人，故命名为人团。这类实体在整个Level 127中被大量发现。在无休止地穿过层级的管道和走廊时，可以听到人类的抽泣声和呜咽声。当与实体接触时，他们会在流浪者的皮肤上造成严重的烧伤和水泡。在进一步接触时，流浪者将燃烧成火焰，随后将他们变成人团。然而，人团通常不会攻击流浪者，而是试图从该层级寻求帮助和怜悯，尽管在某些情况下，他们可能会因为未知的原因而变得具有攻击性。
//
//[-]关闭文件
//描述
//Level 127的原生实体，通常被称为人团，是一种模糊的人形生物，类似于肉块或嚼过的口香糖，它们无休止地在Level 127中游荡，渴望逃脱。人团通过一系列的咯咯声、哭声、呜咽声和咳嗽声进行交流，然而，人团过去的语言在极少数情况下可以被理解。
//
//行为
//人团倾向于在Level 127徘徊，希望通过穿过里面的银管道，进入炉子和加热器，并试图进入墙壁的裂缝来逃离它。这永远不会成功，因为所有这些地方都没有出路。在Level 127流浪时，可以听到人团发出的声音，希望以此引起附近流浪者的注意以寻求帮助，但对流浪者来说，这些声音听起来通常像是随机的噪音。
//
//如果一个人团发现了一个流浪者，它会慢慢地滑行并蠕动到所说的流浪者身边，并请求帮助。它们偶尔也会故意伤害流浪者，希望因此能恢复他们原来的身体。
//
//人团的攻击方式是：
//
//将它们的身体包裹在流浪者周围。
//试图消化流浪者。
//肢解。
//在一个人团成功地终结了一个流浪者之后，他们会爬到尸体上，吸收尸体的能量，并试图恢复正常的身体。
//
//生物学特征
//人团是融合过的人类肉体，身体的不同区域长着肢体、器官和脸。值得注意的是，无论有多少身体结构，这些肢体、脸和器官中的大多数都能充分发挥功能，并且对其功能没有限制。人团的表面只有极少的体毛和皮肤，尽管它们的毛发和皮肤经常可以在内部找到。
//
//Level 127中的巨大热量给人团的外部和内部带来了致命的温度。与它的表面接触会瞬间造成几个3rd度的烧伤与沸腾。
//
//人团表面会分泌一种油状物质，呈半透明棕色，分泌时会沸腾。接触它时会产生有害影响。此外，这种液体往往会停留在流浪者的皮肤上，直到其被冲洗掉。它在皮肤上的时间越长，造成的伤害就越大。
//
//该实体会发出一种刺鼻的气味，闻起来像腐烂发臭的鱼，在Level 127弥漫。这种气味非常强烈，无论流浪者戴着怎样的呼吸辅助器都能闻到。据研究，这种气味具有极高的蒸汽密度，导致整个Level 127都是潮湿的。在它的冷凝物中可以找到与从人团的分泌物一样的液体。
//
//行为准则
//应当
//忽略它们。
//如果受到攻击，则反击。
//避开鼓起的管道。
//不应当
//触摸它们。
//回应它们的噪音。
//吃掉它们的尸体。
//引团注目。
//基地，前哨和社区
//该层级没有已知的基地，前哨和社区。
//
//出入口
//入口：
//可通过Level 2或Level 64中较热的区域，层级低地中的门或胶合板门进入Level 127。
//
//出口：
//要离开Level 127，流浪者必须找到一条装有多组火葬炉的走廊。找到这条走廊后，流浪者必须爬过其中一个熔炉。这将带你回Level 2或Level 90。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl127{}