//Level 176
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//Level-176.jpg
//Level 176内众多货架中的一个。
//
//Level 176是后室的第177层。这一层看上去是一间无尽的杂货店。
//
//描述：
//本层为一间不断重新补充的杂货店。每当你拿走了什么东西，就会立刻有一个相同的东西补充在原处。偶尔也可见到Level 11中的无面灵在这里四处购物，这种情况下有时候会出现灯光随机关闭的事件，而后所有的无面灵都会消失，当这种事发生时，有时周围所有的货架都会被清空，且在一段时间内不会补充货物。在扬声器中可以时不时听到慢慢减弱的无线静电声。在本层中你会突然无端产生一种某些坏事将会发生的疑惧感，或是与自身脱节的感觉。
//
//你可能会听到物品从货架上掉下的声音、风声、雨声、雷雨声、手推车声，以及跟踪着你的脚步声，有时你会感觉有人在注视着你，但周围却空无一人。收银台是空的，里面没有工作人员。在头顶的扬声器上经常会传出内容随机的公告声，标识牌上也可以看到写着随机的单词。罕见的情况下，你会找到一扇标着“员工专用”的门，进入此门会来到休息室。
//
//休息室：
//休息室是Level 176中的一个区域，里面有众多沙发和桌子，看上去是一间无尽的大厅。大厅内的沙发可以安全使用，有时你可以听到背景中传来对话声。这个地方十分神秘，有时你可以在一瞬间看到有人形的实体在你的视野中出现。在这个地方漫游是安全的，建立团体也是如此，不过目前没有团体在此建立。罕见的情况，可以找到一扇门，它通往一间储藏室，这间储藏室具有一扇车库门，每当食物储藏量较低时，一辆卡车会到来然后离开这个地方，跟随卡车会来到Level 11。如果你打开了卡车门，会看到里面空无一人，而卡车将一直不会启动，但如果你在这辆卡车上消磨了大量的时间，你会晕过去，并在Level 50中醒来。储藏室的货架通常是空的，上面只有少量食物和饮料，这很可能是因为其余的都在主店面。你可以看到这些货架上的物品时不时消失，这些物品将会出现在主店面区域的货架上。
//
//基地，前哨和社区：
//本层目前没有已知的基地，前哨和社区。
//
//入口和出口：
//入口
//为了进入，你必须在Level 11找到一个关于新食品店开张的广告牌，并切过它从而到达本层。另一条进入的途径是在Level 29中找到一张关于Level 176的画并进入它。你也可以在Level 20找到一箱食物，吃掉箱子中的东西会使你来到Level 176。箱子中的食物是可以安全食用的。在Level 138中进入一家便利店并在员工室等待几小时也可来到本层。
//
//出口
//为了离开，你可以在洗手间区域找到一个洞口，它会使你来到Level 34。如果你在休息室中找到了一张食品运输清单并进行阅读，你将来到Level 17，如果你在卡车离开时跟着它，你将会来到Level 11。在卡车中待过长的时间将会使你来到Level 50。找到一扇有着黑色粘稠物质的门将使你来到Level 20。如果你在本层中探索了100英里，商店将会不知不觉中转变为Level 177。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl176{}