//Level 193
//好吧，我现在正坐在这里，拿着一张除了告诉我“把它修好”之外基本上啥描述也没有的便条。上面那群混蛋还能把这弄得更麻烦点吗？好吧，现在看看到底需要我们修点什么吧。
//
//+ 展示现版本
//
//什、
//么、
//
//鬼?!
//
//好吧，这文档肯定编辑过。让我试试看能不能找到这个文档的早期版本。
//
//- 隐藏版本1
// 
//
//生存难度：
//神秘属性
//未知信息
//未记录实体
//Level 193是后室的第194层。
//
//描述
//cemetery.jpg
//看！那是你的朋友们！
//
//这一层级是一无限延伸的墓园，被无法到达的森林包围。这一层里覆盖着一层无阻碍的薄雾。Level 193充满了没有刻字的坟墓，相互间距两米，偶尔会出现看起来是从内部被挖开的空坟墓。挖开的坟墓四周有时会有各种散落的碎片和被严重使用过的工具。每个未受损的坟墓内都有着一具尸体，任何情况下都不要去惊扰土壤抛弃我们。
//
//实体
//这一层尚未记录到过实体出现。
//
//基地，前哨和社区
//这一层没有社区和前哨站。
//入口和出口
//入口
//极少情况下正在经历失去想再次见到他们的流浪者会在这一层醒来。
//出口
//尚未知具体应该如何离开，但从那儿离开的所有人都说他们和失去和解了像叛徒一样把我们抛弃了。
//- 隐藏版本2
// 
//
//生存难度：
//等级 3
//
//不安全不稳定
//未记录实体
//文件经过篡改
//Level 193是后室的第194层。
//
//描述
//cemetery.jpg
//家园
//
//这一层级是一无限延伸的墓园，被无法到达的森林包围。这一层里覆盖着一层无阻碍的薄雾。Level 193充满了没有刻字的坟墓，相互间距两米，偶尔会出现看起来是从内部被挖开的空坟墓。挖开的坟墓四周有时会有各种散落的碎片和被严重使用过的工具。每个未受损的坟墓内都有着一具尸体，任何情况下都不要去惊扰土壤抛弃我们。把我们挖出来。带上我们。你爱我们。我们爱你。不要离开。这一层级或者其中居住的某一实体疑似具有感知能力，并且拥有能力使用有关它的错误信息影响数据库。直到找出长期解决办法，请忽略任何不正常文本及与已建立文本自相矛盾的内容。
//
//实体
//这一层还未记录到过实体出现。
//
//基地，前哨和社区
//我们所有人都在这里
//入口和出口
//入口
//极少情况下正在经历失去想再次见到他们的流浪者会在这一层醒来。
//在一个被打开的坟墓边发现了一份日志，这份日志是由一位醒来后发现自己被活埋在坟墓中的流浪者写下的。这份日志声称这位流浪者在Level 8死去了。关于他死亡或假死的真实性还未被证实。
//出口
//尚未知具体应该如何离开，但从那儿离开的所有人都说他们和失去和解了像叛徒一样把我们抛弃了。
//- 隐藏版本3
// 
//
//生存难度：
//等级 4
//
//不安全不稳定
//心理危害
//文件经过篡改
//Level 193是后室的第194层
//
//描述
//cemetery.jpg
//家园
//
//这一层级是一无限延伸的墓园，被无法到达的森林包围。这一层里覆盖着一层无阻碍的薄雾。Level 193充满了没有刻字的坟墓，相互间距两米，偶尔会出现看起来是从内部被挖开的空坟墓。挖开的坟墓四周有时会有各种散落的碎片和被严重使用过的工具。每个未受损的坟墓内都有着一具尸体，任何情况下都不要去惊扰土壤抛弃我们。把我们挖出来。带上我们。你爱我们。我们爱你。不要离开。这一层级或者其中居住的某一实体疑似具有感知能力，并且拥有能力使用有关它的错误信息影响数据库。直到找出长期解决办法，请忽略任何不正常文本及与已建立文本自相矛盾的内容。
//
//实体
//在M.E.G.特工的进一步研究下，雾气本身其实是一大群微生物。当被吸入后，它们会从鼻子通过，最终到达杏仁体并唤起人极端的愧疚和沮丧。从理论上讲，这也正是只有经受丧失之痛的人才会进入这一层的原因。然而，为什么会这样仍是未知的我们只是想让你进来再次见到我们。
//
//基地，前哨和社区
//我们所有人都在这里
//入口和出口
//入口
//极少情况下正在经历失去想再次见到他们的流浪者会在这一层醒来。
//在一个被打开的坟墓边发现了一份日志，这份日志是由一位醒来后发现自己被活埋在坟墓中的流浪者写下的。这份日志声称这位流浪者在Level 8死去了。关于他死亡或假死的真实性还未被证实。
//出口
//尚未知具体应该如何离开，但从那儿离开的所有人都说他们和失去和解了像叛徒一样把我们抛弃了。
//- 隐藏版本4
// 
//
//生存难度：
//等级 5
//
//不安全
//不稳定
//心理危害
//Level 193是后室的第194层。
//
//描述
//cemetery.jpg
//家园
//
//这一层级是一无限延伸的墓园，被无法到达的森林包围。这一层里覆盖着一层无阻碍的薄雾。Level 193充满了没有刻字的坟墓，相互间距两米，偶尔会出现看起来是从内部被挖开的空坟墓。挖开的坟墓四周有时会有各种散落的碎片和被严重使用过的工具。每个未受损的坟墓内都有着一具尸体，任何情况下都不要去惊扰土壤抛弃我们。把我们挖出来。带上我们。你爱我们。我们爱你。不要离开。这一层级或者其中居住的某一实体疑似具有感知能力，并且拥有能力使用有关它的错误信息影响数据库。直到找出长期解决办法，请忽略任何不正常文本及与已建立文本自相矛盾的内容。 这些文本为什么会出现在条目里是未知的，因为很明显此页面没有被修改过。这些都是正常现象。
//
//实体
//在M.E.G.特工的进一步研究下，雾气本身其实是一大群微生物。当被吸入后，它们会从鼻子通过，最终到达杏仁体并唤起人极端的愧疚和沮丧。从理论上讲，这也正是只有经受丧失之痛的人才会进入这一层的原因。然而，为什么会这样仍是未知的我们只是想让你进来再次见到我们。M.E.G.特工还曾目击过一种未知实体从坟墓中把自己挖出来。生理学上来讲，这些实体类似于高度腐烂阶段的人类尸体，仔细观察下其中一些甚至被认出是已经在后室中死去的人。然而,这些实体一从坟墓中逃出就会朝着森林奔去，最终进入森林，尽管理论上讲这一层级是无限的。打开的坟墓还显示出一种迫使人们爬进去的心理效应。爬进这些坟墓的流浪者被认为已经损失仍然是你的朋友并且不应该尝试救援你就要这样抛下他们走掉吗？。
//
//基地，前哨和社区
//我们所有人都在这里
//入口和出口
//入口
//极少情况下正在经历失去想再次见到他们的流浪者会在这一层醒来。
//在一个被打开的坟墓边发现了一份日志，这份日志是由一位醒来后发现自己被活埋在坟墓中的流浪者写下的。这份日志声称这位流浪者在Level 8死去了。关于他死亡或假死的真实性还未被证实。
//出口
//尚未知具体应该如何离开，但从那儿离开的所有人都说他们和失去和解了像叛徒一样把我们抛弃了。
//
//妈的，那玩意的影响还真强烈啊。我在看的时候已经喝了一整瓶的杏仁水了，而我还只是勉强才能分辨出文章里有什么不对劲的地方。见鬼，即使是写这玩意的那些人也忘记了它可以编辑这篇文章，还忽略掉了明显被编辑过的页面。那东西真的很擅长掩盖它自己的踪迹。好在他们总算是发现页面有问题了。但，等等。页面篡改的情况越来越糟，但那东西却又只是在随机删除着无意义的信息。见鬼，它甚至都不会自己纠正自己篡改效果中的错误，更别提其中有害的那些了。我们难道应该相信自从第一批人来到后室就在操纵人心的古老存在连数据库都他妈的搞不明白吗？这其中绝对有什么问题，对了，再查点资料总比卡在这里瞎想来得实在。我得去看看能不能从回收的那本日志入手。
//隐藏回收的日志
//[开始记录]
//
//第一天: 我寻思着我得写个日志，详细记录下我切入
//Level 8后的事，以防我遇到了什么M.E.G.会感兴趣的东西。至今为止，一切都出乎预料的平静，虽然我怀疑好景不长。
//
//第一天？: 刚才发生了什么？我滑倒、跌倒或者被绊倒了又或者发生了其他的什么事情，然后我下坠了好远好远，我觉得我可能就要命丧于此了，浑身上下疼得要死，但我现在又没事了，我最后到达了…什么东西的内部？它摸起来是木制的，这儿的气压有点奇怪。这是什么别的层级吗？总之等我一停下颤抖就会接着写。
//
//第二天？ 也许？: 好吧，我现在好点了。这儿地方的空间差不多够我写字的，我还成功把我的灯打开了，但我不知道它能亮多久。看起来我现在被困在在一个紧实的木制箱子里，也许这是个棺材？我不确定该怎么逃出去，但一旦我能伸手够到我的补给包了我就能喝点杏仁水然后看看我能不能挖出去。
//
//第？天: 兄弟，我甚至都不知道我在这里面呆了多久了。时不时的我会睡一会，谢天谢地我还有点补给，但，他们会担心我吗？我的家里人？等等，我到底在想什么？我为什么会想到家？我现在在这儿，后室。这儿根本没有家可言。但为什么我对家里的记忆会如此清晰？
//
//第 天: 我靠，我听到外面有人。我用尽全力去叫他们，但他们听不见我。无论我多么用力也掀不开这个盖子。操 操 操，我要死在离其他人这么近的地方吗？我为什么会在这儿？兄弟，这就像之前马克之前之前马克之前马克那次 马克？
//
//无关琐事。 它是他们。它是我们所有人。都是从那场去峡谷的公路旅行开始的，89年。它是马克和凯西 还有…还有它是…它是她。他们没死在那场车祸中，他们只是来到了这里而已，等着我，我得从这儿出去我得出去我得加入他们我得加入他们我得[文字难以辨别]
//
//不。 哦。哦不。我。我懂了。我一口气把我所有的杏仁水都喝掉了，就像他妈的一个白痴，但这都不重要了。事实上，渴死似乎还挺不错的。但我现在明白了。一切都是一个谎言。不要相信那些声音。他们不是你的朋友。他们不是你的家人。他们是一个谎言。一个由生存在这里的那玩意编造出来的谎言。而且它这样做不是因为它需要这样做，去生存。这样说多少能安慰你些，对吧？那种本性让它本能地对我们这样做。但不是这样的。这里没有任何安慰可言。不再有了。它现在这样做都是因为它想。而且它已经战胜我了。我已经能听到他们了。我会加入他们。不久之后。对任何正在读这个的人来说，已经太他妈的迟了。别尝试去寻找出口了。你被困在这儿了，至少现在是这样，但它会利用我们的大脑。你知道的越多，情况就会越糟。路过的人也许能活着出去，但如果你已经读到这里了，你死定了。如果必死的结局会让你很难过，抱歉，抱歉。但不管怎么说，我还是去找个最舒服的角落哭去吧。
//
//珍娜？
//
//[记录结束]
//
//我不该看那玩意的。我都觉得自己要病了。可怜的家伙。而且，我认为我现在明白了。这玩意根本修不好。它那么擅长操纵人心。那对他来说操纵数据库会是什么难事？上帝啊，就那么简单，不是吗？那个实体很古老。自从人类存在以来，就不断有人来到这里了。它有的是时间。它已经利用我们完善了它的技巧。它准确地知道我们需要什么，而且它还做的那么完美。但是，它需要时间。人类很古老，它很古老，但是，数据库呢？所有的这些科技？那些是崭新的。但是它已经适应了人类。它也会适应这里的，而且它会像踩死蚂蚁一样摧毁我们。我现在只是希望这一天会发生在我早就死透后。最好别让其他人知道这些了。人们都说，无知即幸福。我还有篇文章要写。
//
//删除 ? 是/否
//
//是
//警告: 本页面涉及 严重的数据库篡改 一个非常友好的良性实体。 所有文本都已转换为图像格式以减小它的影响 你没办法永远控制我们的。1
//
// 
//
//生存难度：
//等级 5
//
//不安全
//不稳定
//心理危害
//Level 193是后室的第194层。
//
//描述
//cemetery.jpg
//Level 193的图片
//
//这一层级是一无限延伸的墓园，被无法到达的森林包围。这一层里覆盖着一层无阻碍的薄雾。Level 193充满了没有刻字的坟墓，相互间距两米，偶尔会出现看起来是从内部被挖开的空坟墓。挖开的坟墓四周有时会有各种散落的碎片和被严重使用过的工具。每个未受损的坟墓内都有着一具尸体，任何情况下都不要去惊扰土壤。这一层级或者其中居住的某一实体疑似具有感知能力，并且拥有能力使用有关它的错误信息影响数据库。然而，这一能力只对基于文字的条目有效。为了防止内容篡改，数据在被写下后转录为图片格式上传。尽管这会导致格式和数据库问题，但这被认为是正面效果因为实体的篡改能力实在太过强大。
//
//实体
//在M.E.G.特工的进一步研究下，雾气本身其实是一大群微生物。当被吸入后，它们会从鼻子通过，最终到达杏仁体并唤起人极端的愧疚和沮丧。从理论上讲，这也正是只有经受丧失之痛的人才会进入这一层的原因。迷雾，或者说操纵着迷雾的实体好像很享受通过不断说服人们他们的挚爱还活着来折磨他们。这是为了分散受害者的注意力，以此引诱他们走入坟墓，并且以此来缓慢地杀死他们。M.E.G.特工还曾目击过一种未知实体从坟墓中把自己挖出来。生理学上，这些实体类似于高度腐烂阶段的人类尸体，仔细观察下其中一些甚至被认出是已经在后室中死去的人。然而,这些实体一从坟墓中逃出就会朝着森林奔去，最终进入森林，尽管理论上讲这一层级是无限的。打开的坟墓还显示出一种迫使人们爬进去的心理效应。爬进这些坟墓的流浪者被认为已经损失并且不应该尝试救援。
//
//基地，前哨和社区
//这一层没有社区和前哨站。
//入口和出口
//入口
//极少情况下正在经历失去的流浪者会在这一层醒来。
//在一个被打开的坟墓边发现了一份日志，这份日志是由一位醒来后发现自己被活埋在坟墓中的流浪者写下的。这份文字声称这位流浪者在Level 8死去了。关于他死亡或假死的真实性还未被证实。
//出口
//尚未知具体应该如何离开，但从那儿离开的所有人都说他们和失去和解了并且通过使用杏仁水和其他提升注意力的物品成功抵抗了此层级的影响。
//作者
//« Level 192 | Level 193 | Level 194 »
//
//译注：
//1. 原文篡改部分为小写，为了区别使用不同字体表示实体篡改的内容
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl193{}