//Level 134
//免责声明
//
//这篇文章以癌症，无家可归和死亡为主题，如果您觉得这令您不安或不舒服，请自行跳过该文章
//
// 
//
//生存难度：
//等级 0
//
// 
// 
//大量无威胁实体
//描述
//79363812-9477-473-F-B041-EB129241151-D.jpg
//一艘倾覆的、老旧的、没有层级的居民的船只的前部。
//
//该层级的主要景观是一片碧蓝色的、一望无际的海洋。在海面上凸起了一些被海水浸湿的沙丘，这些沙丘好似不规则的斑点般从海洋中露出，海面上还散布着一艘艘生锈、腐烂的古代船只。据说这些倾覆的船被安置在一个废弃的海域中。
//
//4-DC63415-9-EAD-4-C47-8183-C69-FF927-BD9-E.jpg
//两艘在该层级干涸区域的船只。
//
//水始终保持浅浅的、平静的样子，由于缺乏自然潮汐，海水的高度始终保持一致，这一层的海洋永远不会涨潮，也不会退潮。尽管具有日月星辰，也有昼夜交替，理论上应该出现海水运动，但实际上依然没有海水运动。
//
//海水深度恒定于2英尺（0.61米），它只有在上升到沙丘和偶尔出现的坑洞时才会出现改变其深度至难以察觉的2 1/2英尺（0.76米）。水面上倒映着深深的天蓝色和一片片云朵，这使它看起来比真实情况要更深一些。海底是由一片柔软、潮湿且相对坚固的沙子组成的。尽管沙子的硬度足以支撑起流浪者的的身体，同时支撑起那些倾覆的古代海船，使船体不完全浸入海水之中，但是如果流浪者待在同一个地方太久，沙子也会变的松散，使流浪者陷入其中1
//
//尽管该层级大部分地区由平静的浅浅的海水所覆盖，但仍有偶尔出现的小沙丘突出于海平面之上，这些沙丘大多不超过几米宽，尽管偶尔会发现一些沙丘从一段到另一端延伸30米到50米以上。这些沙丘和海洋中一样，除了该层级自然具有的实体，没有发现任何生命
//
//船只
//正如文章开头所说的那样，本层级停泊了众多破旧且倾覆的船只。这些船只不仅停泊在浅海之上，也出现在沙丘之上，这些海船往往嵌入在海水里或海底的沙子中。它们没在任何地方，有的船只仅仅沉没了几厘米深，有些船只甚至连甲板和船舱也早已嵌入在了泥沙之中
//
//这些船至少经过20年左右的弃置，已经老化。根据船型的不同，这些船大多已经生锈或腐烂，如果它被存放于浅海之中中，则会被苔藓和藻类覆盖。无论其位置如何，这些船的木材或金属结构的结构完整性也难以确定。
//
//登上这些船只通常很容易，大多数流浪者选择使用船上的梯子、绳索、锚或在没有任何帮助下登上船只。这些船的甲板上几乎看不到什么东西，大多数甲板上除了钉子、腐烂的绳子和玻璃碎片外，没有任何补给、食物或其他东西。在大多数情况下，驾驶舱保持着令人惊讶的干净和未被损坏的状态。然而，它们仍然受到与船只外部相同的风化作用。这些沉船的原本所有的刻度盘、拉杆和按钮都被覆盖上了之前描述的腐蚀层，腐蚀程度也取决于弃船的地点。
//
//这些船只的舱室内有未被损坏但是老化了的零件，这些零件的口径和尺寸都符合大多数船只的引擎。与其他船舶一样，所有这些机械装置都因锈蚀和老化而损坏。对于木质且不依赖发动机作为动力的船舶，底盘将是一个极其空旷的空间，有时会有一些被随意丢弃的空的发霉的桶。
//
//归根结底，除了居住在这些船上的一个实体外，这些船几乎和其他地方一样没有生命。
//
//“思考之后”
//“思考之后”是一种人形实体，他们可以改变自身至人们所期望的各种体型、体重、性别和种族。你可以看见他们身上有着衣服的轮廓，这些衣服的轮廓有连衣裙、短裙、衬衫、上衣、帽子等。他们的身体都被一层烟黑色所笼罩，且这种颜色颜色越靠近身体中心越透明。然而，我们并不能凭借这一点看到他们的内部器官或表面以下的任何身体。
//
//这些被称为“思考之后”的人形实体会在船只的甲板上和船舱里漫无目的地游荡。人们能发现它们时常说出一些句子，乍一看，这些句子只不过是胡言乱语罢了。与他们交谈很容易，虽然大多数人同他们说话都很谨慎、内向，而且有点害怕。在很长一段时间里，这都被认为是一个发生在这个层级中的居民身上的未知的现象。然而，在M.E.O.D.形成后，人们开始更好地了解“思考之后”这个实体。
//
//基地、前哨与社区
//M.E.G. M.E.O.D. 第51号作战前哨站
//虽然自2017年以来已经知道了该层级，但任何团队都没有在此建立基地的计划。直到2022年前几个月，M.E.G.开始进行在该层级的基地的建设和规划，然而在此期间，发生了“2022 13.1事件”。事件发生后不久，OO51的所有工作最终都被放弃，将人员和物资集中在调查异常事件。五个月后，M.E.O.D.成立，该项目才重新启动。
//
//随着这个组织旗下的团体和人员数量的增加，重启OO51项目将是决定M.E.O.D.价值的首批项目，同时彻底查明“思考之后”实体以确认或否认围绕它们的猜想。
//
//M.E.O.D于11月开工，12月完成M.E.O.D.的基地的建设。目前，它容纳了13名来自M.E.G.和卡拉格灵协会的成员，以对“思考之后”实体进行记录与研究
//
//对“思考之后”的研究
//如前所述，在M.E.O.D.成立时，选出了新的领导人，同时向尚未加入该组织的且持怀疑态度的团体证明其价值。利用前M.E.G.、B.N.T.G.和一些较小的无资料的团体的力量，并从当时未经认证的卡拉格灵协会获得贷款帮助，M.E.O.D.利用这些资源进行了深入的研究，发现“思考之后”实体是从前厅进入坟墓的中转过程中被捕获的灵魂转变而来的。
//
//通过与“思考之后”实体对话，他们了解到，他们的胡言乱语实际上是他们生活中的记忆。他们一遍又一遍地自言自语的，往往是在他们活着的时候困扰他们或是他们心灵受到震撼的的记忆。
//
//除了上述信息，我们还了解到，与这些被地狱困住的灵魂交谈有助于这些人在通往远方的旅途中受益。虽然并非所有达到本层级的灵魂在生活中都感到困扰、不安或失败，但在最初交谈的由25个实体组成的焦点小组中，有21个是这样的。通过与这些人交谈并解决他们的疑虑，他们到达坟墓的时间大大减少。甚至有文献记载，“思考之后”实体有时在问题解并且“开悟”后立即离开。
//
//虽然有75个实录或转录的采访和谈话的记录，为了简洁起见，只有两个采访的例子被选入本文。
//
//莎莉
//- 隐藏采访
//<开始记录>
//时间：12:00
//日期：05/01/2023
//地点： Level 134 在一艘搁浅的旧木制渔船上。
//采访者： 索马里•汉克斯
//受访者：“莎莉”
//
//【这时，莎莉独自站在这艘古老的海船的船尾。她双手合十，低头看着沙子，笨拙地、困惑地自言自语。】
//
//【索马里•汉克斯，选择走近他们，在他们俯瞰着船时轻拍他们的肩膀。紧随其后的是马克•萨姆森、简•贝克和佩内洛普•哈沃森，团队分别负责摄像机、音频设备和编目。】
//
//索马里•汉克斯： 额，你好，我们能聊会天么？
//
//【莎莉看起来微微的跳了起来，她因被人打招呼和拍打而惊讶地喘着粗气。她的双臂抱住她的肚子，然后慢慢转过身来。当她抬起头看着这群人时，她的眉头皱了起来，她慢慢地后退试图远离我们，直到她的腿撞到船尾上。】
//
//莎莉：…和我说话么？为…为什么？【莎莉用一种有点孩子气的语气问道。】
//
//索马里•汉克斯：小姐，我们…只是想了解你的更多信息。
//
//【汉克斯小姐迅速回头看了看她的团队中的其他人。】
//
//索马里•汉克斯： 只是几个简短的问题，我希望这不会冒犯到您。
//
//莎莉： 额……我不清楚……但是你们都在拿着东西对着我，我不喜欢这样。
//
//【汉克斯小姐轻声叹了口气，瞥了一眼贝克女士，选择让她把摄像机的吊杆稍微远离莎莉一点。】
//
//索马里•汉克斯：你们三个人，试着离莎莉远点，尽量让她舒服一点。
//
//莎莉：哦…额…谢了，那…
//
//【莎莉又表现出尴尬，索马里选择退让一步，张开双臂让萨姆森先生、贝克女士和哈沃森小姐和她一起后退几步，选择这样做纯粹是为让“思考之后”们感到舒服一些。】
//
//索马里•汉克斯：我们可以现在问你这些问题了么？
//
//莎莉：嗯…好的，夫人
//
//索马里•汉克斯：从简单的问题开始吧，额…你叫什么名字？
//
//莎莉：哦，我可以回答！我叫莎莉！
//
//索马里•汉克斯：好，把它记下来…还有，莎莉，你平时在外面干什么呢？你看起来并不老？
//
//莎莉：不，不，我只有8岁，还有…我不太清楚？我只是…周围…没有人真正和我打招呼过…
//
//索马里•汉克斯：所以我们在这对你来说是个好事，对么孩子？
//
//【汉克斯小姐告诉萨利为了安慰她，她可以伸出手让他们握着。】
//
//莎莉： ：我呃，我想……你确定要让我和你握手么？我妈妈说…不要那样做。
//
//【汉克斯小姐看着哈沃森小姐，告诉她写下萨利使用“妈妈”的说法，说明她很可能是美国人后裔。】
//
//索马里•汉克斯：真的么？好吧，莎莉，告诉我为什么你觉得握手不是一件好事？
//
//莎莉： 妈妈说，嗯，嗯……她说我的病是s型传染的，会传染给学校里的东西或……让这些东西也患上s型疾病。医生说癌症之类的不会传染，但……我更信任我妈妈，而不是他们。
//
//【汉克斯小姐试图慢慢的张嘴来反驳萨利的言论。但是，汉克斯小姐在这件事上还是选择了保持沉默，相反，她选择把手从莎莉身上缩回，以使这场采访更快、更不具有冒犯性】
//
//索马里•汉克斯： 好吧，我也…相信你的妈妈。你的妈妈怎么了？她在你身边吗？
//
//【萨利咕哝着，紧紧地抱着肚子，她平静的低语变成了悲伤的呜咽。】
//
//莎莉： 她…她先对我很伤心，然后生气…之后她就不再带我去医院了。直到现在…我再没有见到她过了。
//
//索马里•汉克斯：为什么？她还关心你么？
//
//莎莉： 嗯…我希望如此…我希望她在身边…当我觉得冷的时候…当我头痛的时候…当我听不见的时候…当事情变得黑暗的时候…我…我希望她在这里…
//
//【汉克斯小姐同情地叹了口气，她感到有点悲伤，她摇了摇头，回头看了一眼她的那群人。后来，她再次向莎莉望去，微微张开双臂，提议给她一个拥抱。】
//
//索马里•汉克斯：孩子，你需要一个拥抱么？我不在乎你的那些传染病，你听起来很需要这个拥抱。
//
//【莎莉抽泣着，飞快地向汉克斯小姐跑去，给了她一个拥抱，她似乎把头埋在汉克斯小姐的脖子下开始哭泣。】
//
//索马里•汉克斯：嘿，好了，好了……听着，呃，孩子……我对听到发生在你身上的事感到失落与同情，我很抱歉听到你妈妈不在你身边。但是…我也许会留下来陪你，只需要足够长的时间你就可以到达目的地了。
//
//【莎莉愣住了，抬起头，带着沮丧的表情看着汉克斯小姐。】
//
//莎莉：我…我的目的地？
//
//索马里•汉克斯： 那是一个地方……比这里好得多，比医院好得多。那里…可能不会有你妈妈，但那里会有人非常乐意照顾你，萨利。当你妈妈不在的时候，你要去往那里。
//
//【汉克斯小姐慢慢地回头看了看她的队员，她把手放在喉咙上，指示他们停止录音。】
//
//<结束记录>
//布兰登•泰特利
//- 隐藏采访
//<开始记录>
//时间：16:01
//日期：10/05/2023
//位置：Level 134 在一艘锈迹斑斑的游艇旁边。
//采访者：本森•德洛比
//受访者：布兰登•泰特利
//
//【在与他交谈之前，泰特利先生在倾覆的船只前面闲着，背靠着它站着。泰特利先生似乎把手放在一件破旧的连帽衫里，正在看着本森•德洛比、弗里德里希•阿德莱克、凯瑟琳•里弗斯和亚当•波特。】
//
//布兰登•泰特利：嘿…你们是谁？
//
//【泰特利先生缩了缩肩膀，眼睛死死盯着这群人，他的在连帽衫里的手乃至手臂都开始发抖起来】
//
//本森•德洛比：嘿，别担心，好么？只是呃，你也知道，离开这里你也只能四处瞎逛，不知我们能否问你几件事呢？
//
//【泰特利先生皱起了眉头，表情中充满了不安感与戒备心，并很快把头扭向另一边】
//
//布兰登•泰特利：哦？我可不相信，你们全都离…离我远点，对，离我远点。
//
//本森•德洛比： 如果能让你平静下来的话，我们可以呆在这么远的地方。我们没有武器，也没有受过战斗训练，我们就是…我他妈的也不知道，我想我们应该算是记者吧…？
//
//【德洛比先生无奈地耸了耸肩，眼睛盯着泰特利先生。】
//
//布兰登•泰特利：这真是一个…糟糕的谎言啊，你要清楚我是绝对不可能和你们这些所谓的“记者”待在一起。好吧，问你的问题吧，但别试图靠近我一步。
//
//【德洛比先生向团队里的其他人略带惊喜的挑了挑眉毛，当他们困惑地回头看他时，他耸了耸肩。】
//
//本森•德洛比：首先，“间隔”先生，你叫什么名字？我总不能一直叫你“间隔”先生吧
//
//布兰登•泰特利：【他咬紧牙关，用一种有些恼怒的语气说】我叫布兰登•泰特利，傻瓜。
//
//本森•德洛比：不错，不，你回答的非常好！谢谢你的回答。现在，下一个问题。你平时在这里干什么，你可以告诉我们一些么？
//
//布兰登•泰特利：我…不想说什么细节，我只知道我死了，并且现在我呆在这个鬼地方。
//
//本森•德洛比：老实说，你有一点说对了。你死了，我们知道这是事实。你就像一个…无法得知未来会发生什么的被锁住的灵魂。
//
//【听到这个消息，泰特利先生似乎愣住了，他的将头从人群中移开，注视着他脚下的水，并将他的双手伸进口袋。】
//
//布兰登•泰特利：这是…真的么？难道不是你们绑架了我然后把我丢到这个…我不知道，哈夫里格海岸还是什么？
//
//本森•德洛比：什么海岸？好吧，没关系，我们没有绑架你，从来没有，这虽然很难让人相信，但你必须信任我们。
//
//【泰特利先生的体型似乎在不断缩小，他将他的手从连帽衫口袋里抽了出来。】
//
//布兰登•泰特利：哦…好吧…死亡，我明白了。好的…不是，这有道理，这些事情最终必会发生。
//
//本森•德洛比：我知道，这件事对你来说可能太大了，以至于你难以接受。你知道，这对我来说肯定是好事。2
//
//布兰登•泰特利： 我想，不管怎样。我只希望我可以做的更多。无论你们叫什么。现在你们还有问题吗？
//
//本森•德洛比： 嗯，我有一些固定的问题，但是……你说的“希望你可以做更多”等等是什么意思？
//
//布兰登•泰特利： 我希望你能问下去……不管你事先计划好的问题是什么。
//
//【德洛比先生停了下来，自己沉思了一下，摇了摇头。】
//
//本森•德洛比：我可以试试，但这真的只是想了解你，你生活中发生了什么，为什么你在这里，而不是后来发生了什么。我问我自己的问题会使这个采访加快十倍。
//
//布兰登•泰特利： 好吧，好吧。笨蛋，你又想问什么？
//
//本森•德洛比： 关于你所说的“希望做更多”，我忘记了你想表达什么。
//
//布兰登•泰特利：好吧…
//
//【泰特利先生长长地叹了一口气，把脚轻轻放进水里】
//
//布兰登•泰特利： 我想从生活中得到更多。我有自己的雄心壮志，但他们……被逐渐消磨掉了。
//
//本森•德洛比： 怎么被消磨掉了？
//
//【泰特利先生皱着眉头，撅起嘴唇，苦涩而失望地看着德洛比先生】
//
//布兰登•泰特利： 生活和环境消磨了我的志向。生活和环境都死死盯住了我。我没有真正的父母，没有真正的家。我…伙计，我只想成为一名赛车手。这是我在寄养家庭和孤儿院时的梦想。
//
//本森•德洛比：你的梦想实现了吗？
//
//布兰登•泰特利： …不，一点也没实现。我几乎没学会开车，也没跟志同道合的人说话过……妈的，我甚至没玩过任何赛车游戏。
//
//本森•德洛比：操…很抱歉…额，我能问你你是怎么来到这里的么？
//
//布兰登•泰特利：你问我是怎么死的么？
//
//本森•德洛比： 是的，是的，实际上，基本上就是这样。如果你同意告诉我们？
//
//布兰登•泰特利： 一些…一些家伙，我…我真的不知道他们是谁…他们不知从哪里冒出来，刺伤了我，让我死在街上。我在那里呆了几个小时，没有人来帮忙，没有人听见我的求救，我……一个人。感到孤独和壮志未酬的苦闷…
//
//本森•德洛比：嘿，看，额…
//
//【虽然德洛比先生开始说话，但他很快就被泰特利先生打断了。他的脸变得更加沮丧和不安】
//
//布兰登•泰特利： 在未来中，我还有机会吗？这里不是地狱之类的地方，不是吗？我实现梦想的机会结束了吗？
//
//本森•德洛比：说实话，呃…我也没有什么相关线索，我个人对这里了解得还不够，不能告诉你。然而……我想应该还有机会？
//
//布兰登•泰特利： 是的……太好了，不是吗……我希望你的想法是对的。
//
//本森•德洛比： 啊哈，我确信这个机会属于布兰登！你会有机会成为一名赛车手，你必须…离开这里去寻找它。
//
//布兰登•泰特利：是的…听起来很简单，谢谢你们这群傻瓜。
//
//<结束记录>
//入口与出口
//入口
//在Level 46，流浪者偶尔可以找到埋在沙丘中的活板门。一旦将它们完全暴露出来，它们便可以用于达到Level 134。
//
//与Level 979的大多数出口一样，沿着其路径边的岩壁上的洞有时会通向该层。在出现水淹的地方和含有水的洞穴系统中尤其如此。
//
//通过Level 880的“冷冻室的舱门”跳入大海会将任何这样做的流浪者冲刷到Level 134的“海岸”。大多数流浪者会出现在沙丘的边缘。
//
//出口
//如果潜入超过2英尺（0.61米）深的部分的水域，则有可能将流浪者带入Level 121。
//
//尽管非常罕见，但Level 134内偶尔会看到自动扶梯，尽管可能受到水和沙的干扰，但其功能完全正常。登上这些自动扶梯，顺着它们走，就会把流浪者带到Level 233。
//
//在看似随机的情况下，海床里有可能中途出现开口，并通过这些开口将开口下方的海水输送到Level 499的池塘和河流中。
//
//水中偶尔会升起生锈的、有点奇怪的潜望镜。抓住这些潜望镜，让自己被它们拉到水下面，流浪者将进入Level 880。
//
//作者信息
//« Level 133 | Level 134 | Level 135 »
//
//Footnotes
//1. 这种轻微的危害从来不是致命的，这种危害需要流浪者站在同一地方好几天才会导致窒息，演化至致命情况
//2. 此处翻译待商榷，原文：It sure would be for me, you know.
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl134{}