//Level 190
// 
//
//生存难度：
//等级 2
//
// 
// 
// 
//Hallway.jpg
//Level 190 的走廊之一。
//
//Level 190是后室的第191层。此层级和Level 52有些相似之处，其总长度仍然未知。
//
//描述：
//Level 190类似于高中的走廊，两侧有教室（有些教室门无法打开），最像是美国的高中。Level 190有昼夜循环现象，白天和黑夜均为为12小时。12小时要结束时，层级外的光线会突然消失，月光取而代之。有传言称此层级的太阳和其他层级并非是同一个，而是完全不同的变体。
//
//教室和走廊
//Level 190由一系列相连的走廊、教室和位置随机的楼梯组成。教室内放满了电脑、纸张、笔（可以用来制作画标，更多信息见下文），有些教室中有Wifi 网络。电脑上的文字由未知语言写成。
//夜间时教室的灯会自动打开。窗外什么也没有，除了一条空旷的道路，和一些游荡的 窃皮者。外面的地形类似Level 10和Level 205（未证实的传言称夜晚外面有双尾狐活动的迹象）。
//
//走廊的墙上有一些窗户，但用任何方式都无法打开它们，甚至撬棍也不行。
//
//在Level 190你会经常遇见：
//
//窃皮者；
//尸鼠，它们只出现在此层级的洗手间壁橱中；
//遇见笑魇的情况比较罕见，只会在某些教室的黑暗区域中见到（遭遇概率低，但不要放松警惕）；
//未证实的传言称见到过娃娃脸活动的迹象。
//洗手间
//Level 190的洗手间在白天的12小时中可以随意进入。洗手间功能齐全，可以使用，表明Level 190拥有管道系统。洗手池流出的水不可饮用。壁橱可以用撬棍强行打开，其中通常有尸鼠活动的迹象，它们通常是无害的。壁橱里可以找到以下物品：
//
//收音机；
//强力胶布；
//装满杏仁水的塑料瓶；
//手电筒；
//电池；
//书包（很少见）；
//清洁工具（如拖把、水桶、清洁用品）；
//双指（随机口味）。
//夜间洗手间会自动关闭，第二天壁橱的门会重新被锁上。再次强行打开时，里面的物品会重新装满。
//
//目前未知此层级是否存在更多实体。M.E.G.正在进行进一步研究。
//
//exit.jpg
//从内侧拍摄的Level 190出口照片。
//
//基地、前哨和社区
//学校计划
//Level 190有一个前哨。一群学生称他们在一次米兰研学旅行途中意外来到了后室。他们到达了Level 190并决定留下来帮助遇到困难的人。此群体会帮助其他幸存者收集洗手间壁橱中的物资。他们的基地层级在起始处的一间教室中。
//
//此群体有19人，18名学生和1名教师。原先共有30名学生，另外的人在其他层级消失或死去了；
//学生中有6名男生，6名女生；
//此群体每隔3天开放少量交易；
//此群体的首领是教授。
//入口与出口：
//入口
//想要到达Level 190，你需要从Level 156的一面墙，或Level 210的一扇密门切出。
//
//出口
//此层级只有唯一出口，一扇随机出现的紧急逃生门。出口是通向门的一段阶梯，把你带到室外，你越过学校的大门后会被传送到Level 807。
//
//IMG_20200930_113353.jpg?width=445&height=413
//Level 11的一条走廊里发现的危险标志（图片为示例）
//
//画标：
//画标通常是一些写有文字的纸张，用强力胶布粘在墙上。纸张和笔通常可以在Level 4，Level 190和Level 11的办公室里找到。
//
//功能：
//画标被M.E.G.特工用于帮助其他幸存者逃离最艰难的层级。有时会接到报告称画标神秘消失，或被某种实体损毁。1
//
//注：
//u/John_Thompson，幸存者之一，离开Level 190后报告称该层级和他年少时在前厅俄勒冈州上的高中非常相像。
//
//作者信息
//« Level 189 | Level 190 | Level 191 »
//
//Footnotes
//1. 目前未知是哪种实体。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl190{}