//Level 117
// 
//
//生存难度：
//等级 4
//
// 
// 
// 
//math-class2.jpg
//在第117层里拍摄的一张照片。
//
//Level 117是后室里的第118个层级
//
//描述：
//Level 117似乎是由无数的房间构成的。这些房间都通过门来彼此连接，看起来就像是学校的教室一样。这些房间在设计上非常相似，但彼此之间都有着细微的不同。这些不同通常会出现在黑板、桌子和储物柜上。在本层里能偶尔找到学习用品，如铅笔和活页夹。本层级由天花板上的照明设备照亮，但其中有一些照明设备已经烧掉了。
//
//Level 117有着长约18个小时的昼夜循环，其中白天占7小时，而夜晚则占11个小时。在夜间，所有的照明设备都会关闭，学校清洁工会开始在大厅里走动。笑魇偶尔会被发现于第117层中黑暗的角落，但在夜间却很少出现。有报道称，这是因为笑魇害怕学校清洁工，但这一推论还尚未被证实。
//
//实体
//除了笑魇之外，Level 117里还有两个主要的实体：学校清洁工和一个自称为“弗里曼先生”的实体。
//
//弗里曼先生:
//你在白天的时候能偶尔看到弗里曼先生在空荡荡的教室里教课。这通常包括此实体在空无一人的教室里讲授高中难度的代数和几何课程。有人称本层级里有不止一个完全相同的弗里曼先生，但这些报道尚未被证实。弗里曼先生对流浪者很友好，他可能会邀请遇到的流浪者来听他讲课。
//
//学校清洁工:
//学校清洁工是在Level 117里最常见的实体。他们身着海军蓝制服，拿着手电筒，看起来就像是模糊不清的人影。学校清洁工还经常拿着大扫帚和垃圾桶，除非流浪者离得很近，否则他们不会对流浪者做出任何反应。当流浪者靠近它们时，它们会以极快的速度将流浪者吞噬进影子里。之后，学校清洁工将会重新担起打扫卫生的职责，但那个被吞噬进阴影的人则会消失不见。目前尚不清楚那些被学校清洁工吞噬的人的身上都发生了什么，但有一些未经证实的报声称那些被吞噬的人会作为学生再次出现于Level 52。由于学校清洁工的存在，在夜晚探索Level 117是不被建议的。
//
//基地，前哨与社区：
//在第117层没有已知的基地、哨所或社区。这可能是由于学校清洁工（Janitors）在夜晚时所带来的危害造成的。
//
//入口和出口
//入口：
//到达Level 117的主要方法就是进入Level 83的教室，这偶尔会通向本层。有些人也通过Level 18成功进入到了本层，但此方法并不可靠。
//
//出口：
//Level 117的有些房间里有标有“计算器”标签的橱柜。进入后，这些橱柜会通向Level 4。也有报道称，卡出本层的墙壁可以到达Level 190，但这还没有被证实。红色的门在本层非常少见。进入后，你会被带入Level 74。
//
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl117{}