//Level 126
// 
//
//生存难度：
//等级 4
//
// 
// 
// 
//126
//Level 126 被侵蚀的部分。
//
//Level 126是后室的第127层。它以破旧的舞蹈或芭蕾舞教室的形式出现。
//
//描述:
//Level 126完全处于室内，当你从这一层级的窗户向外看的时候，你的视线会被一道白光阻挡，实体窗户会在破损或完好的窗户上出现。它似乎是一个废弃的积满灰尘的舞蹈教室，这里还有闪亮的木地板和挂在墙上的木杆。空气中弥漫着灰尘和恶臭，这很容易使流浪者出现轻度咳嗽的症状。天花板由木板和横梁组成，在Level 126的侵蚀状态，有些实体会在那里筑巢生活。任何流浪者刚进入这一层级时这一层级都是"安全"状态。经常可以听到从远处传来钢琴演奏声，但是没有找到过声音的来源。这个教室本身非常巨大，而可以通过的木地板走廊只会通向另一个教室。
//
//在这一层级的安全状态，Level 126只有实体窗户居住，但也目击到温顺的幼年 无面灵穿着芭蕾舞服，握着墙上的木杆跳舞。当这一层级处于这一状态时，避开窗户就可以在这一层级轻松的进行探索或者生存下来 。在流浪者在这一层级度过几天之后，光滑的木地板就会变得破旧，空气中会带有霉味，天花板上的木梁开始出现腐烂现象。这就是Level 126的侵蚀状态。
//
//侵蚀状态:
//当Level 126处于侵蚀状态时，该层级会变得让人难以置信的危险。安全状态下平静又遥远的钢琴曲在侵蚀状态下会变得杂乱吵闹，伴随着小声说话和脚敲击舞蹈教室地面的声音。这一状态下没有温顺的无面灵，而猎犬、爪形菌蛛和肢团开始在天花板筑巢。如果你在你的上方或隔壁房间听到了嘎吱嘎吱的声音，很可能是由于天花板结构不稳定或天花板上有实体存在。在这种状态下，除了居住在上面的区域以外，充满敌意的实体还会在这一层级的各个区域出现。在这里生存是极为困难的。
//
//基地，前哨站和社区:
//由于这一层级这些非常危险的会改变状态的性质，这里没有基地，前哨站或者社区，只有一些小团体隐藏在这一层级的深处。
//
//入口和出口:
//入口
//为了进入这一层级，你可以在Level 2或Level 3找到一扇从另一边传出钢琴声的门，不过这样的门很少见。另一个进入这个层级的方法是在大多数层级跳10分钟到一小时的芭蕾舞。你也可以走进Level 72的深处然后从楼上跳下去。
//
//出口
//目前已知有三种方法离开这一层级。最主要的方法是尽可能走进这一层级的深处就可以随机切出到Level 175或者Level 196。你可以在这一层级处于侵蚀状态时通过窗户切出这一层级到Level 105，或者在这一层级的侵蚀状态尽量久的生存下去直到找到通往Level 5的门。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl126{}