//Level 164
// 
//
//生存难度：
//等级 2
//
// 
// 
// 
//gallery1.jpg
//一张Level 164 中展览厅的图片。
//
//Level 164 是后室的第165层。它是一个无穷无尽的博物馆。
//
//描述：
//Level 164是一个无穷无尽的博物馆，它的光线通常很昏暗。它显露出19世纪50年代至20世纪10年代的建筑风格，但具体的建筑风格取决于博物馆的不同区域。该层级由两种不同的空间构成: 走廊 和 展览厅。
//
//该层级向来杂乱无章。陈列柜和木箱中标有“易碎”或者是“珍贵”的文物被胡乱地散落在大厅和展览厅。即便如此，该层级也始终保持整洁，这归功于该层级唯一已知的物理实体无面灵。几乎总能看到成年的无面灵穿着碧绿的制服进行打扫，例如对物品进行除尘，或把箱子搬运到我们不得而知的地方。幼年无面灵也会出现，尽管他们的所作所为与在Level 11影响下的幼年无面灵一样，只会对那些毫无戒备的流浪者开些温和的恶作剧。
//
//该层级大部分区域都会播放音乐，并且这些音乐被形容为“抚慰人心的” 和 “超凡脱俗的”。但所有尝试录制这些音乐的行为均以失败告终。
//
//hallway.jpg
//一张走廊的图片，近期铺上了瓷砖。
//
//走廊
//走廊长而宽，绵延数公里，目前记载最长的不中断走廊延伸超过5公里。每隔一段时间，一条走廊就会与另一条走廊相交，相交线总是90度。因此有人认为这些走廊已经组装成了网格状结构。
//
//这些走廊只含有寥寥无几的老旧装饰品和前面提到过的杂物。走廊的建筑构架很华丽。要么有高悬的吊顶和错综复杂的窗户，要么设计更封闭，但有更好的建筑雕塑品。这点与展览厅形成了鲜明的对比，展览厅只有十分简略的布局。
//
//gallery2.jpg
//另一张关于展览厅的图片。
//
//展览厅
//展览厅是摆满了各种各样物品的大房间，以至于无法很好的浏览它的全貌。这些展览厅都拥有很大的入口，入口为木门，木门上都有一个牌子，牌子上有一个标签。这个标签决定了展览厅内展品的主题，例如，M.E.G.的特工发现了一个标签为‘通信’的展览厅，其展品内包含电话，电话线和断开连接的计算机服务器。这些标签几乎都与人类有关系，像是‘战争’和‘厨房用品’。这些展厅中有木制的基座，基座上有用英语刻写的段落，这些段落以第一人称描写，据称，这些段落是在‘胡言乱语’和‘自省’。目前不知道这些段落是由一个未知实体写的还是该层级自己产生的。M.E.G. 将这个假想的实体称作馆长。
//
//任何试图触碰展览厅中展品的行为都会对触碰者造成锐器伤，触碰者身体与展品触碰的部位会出现剧烈疼痛。已知唯一消除疼痛的方法是触碰者从被触碰物的位置往后退，退到大约一米远的位置，这会立刻止痛。
//
//基地，前哨和社区：
//M.E.G.前哨 “画廊保安”
//该前哨的建立是为了了解更多关于馆长和Level 164的信息。
//主要由研究人员组成，其中有一个小型的勘察队，负责调查未探索过的展览厅。
//由12个成员组成。
//一半的前哨成员在靠近层级入口处定居，其余成员有时会去定居区，但依旧是流浪者。
//博物馆职工
//给予一群独特的实体无面灵的特殊术语，他们有着独一无二的作用。
//管理人：一个脸上有疤痕的无面灵，他似乎能命令其他的无面灵。
//警卫：穿着深绿色的长款大衣；负责抓捕试图从走廊偷走物品的流浪者和幼年无面灵。
//节目组成员：一个由无面灵组成的团体，为幼年无面灵表演节目。
//艺术家们
//一群以占领该层级一部分为目的的神秘流浪者。
//他们一直在和该层级的成年无面灵战斗。
//他们只愿意交换食物或艺术用品（例如纸，铅笔，水彩笔等）。
//其人数未知。
//入口与出口：
//入口
//一个位于Level 33的无名商店，它似乎是一间当铺，有时会通向这里。
//进入Level 11的一个大的平坦长方形建筑就会进入本层级。
//出口
//一个标签为“一个亲善的灵魂所绘”的展览厅内有类似于Level 57的画作。从这些画作中切出的人将通往Level 57。
//从走廊角落里切出的人将通往Level 84。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl164{}