//Level 140
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//140JPG.jpg
//照片说明：Level 140这一层级的山腰处, 距离边界大约25千米。
//
//Level 140 是后室的第141层。它被一个在Level 19的最深处迷路的流浪者发现，他也拍摄了这一层级的所有照片。
//
//xxxxx.jpg
//Level 140的较低处，距离边界大约3千米，比那里冷得多，雾也更多。
//
//描述:
//Level 140 是一座相对干燥的山坡，坡度约为20°，山顶处有一座木屋。这一层级是有限大的，跨度约40千米，或者是直径24.5英里的圆形（大约有5000平方公里，或2000平方英里大） ，最后是一片突然干死的树林，跨度约为50米。走到边界处的人可以清楚得听到附近有巨大的海浪声。可以猜测在那片树林后有一片无边无际的水体。
//
//LEVEL140two.jpg
//照片说明： Level 140,距离山顶不远处，山顶上的一团物体是文中提到的有破洞的小屋。
//
//天空中几乎没有任何东西，而且在哪里都看不到Entity 103。现在还不能确定日光是从何处而来。 Level 140 没有昼夜更替，只有白天和傍晚的更替。你不可能准确测量出一天的长度，但是大约确定白天和傍晚的交替周期约为2-3小时。这一层级的地面被干树枝和草覆盖，树和灌木可以很容易的在小片区域发现。温度变化范围在 26°C 到 45°C，这种变化取决于流浪者所处的海拔高度，越靠近山顶温度就越高。山的倾斜角和山顶到边界的距离已经确定，计算表明山的最高点就是中心点，海拔14500米，或者是47500英尺。离山顶越近，雾就越少。
//
//特性
//所有到过那里的人都宣称它们的视觉产生了一种模糊的，梦幻般的，还有些颤抖的感觉，稍微改变一下视角，看到的景象就会产生巨大变化。还会听到连续不断的施工的声音，声音的来源至今未知。
//
//summit.jpg
//Level 140的山顶处。前文提及的破旧的木屋仍然可见，这一层级的这一区域非常危险，还有一些让人迷惑的性质。
//
//山顶处破损的房子
//让这一层级变得有趣的就是这座山顶上的木屋的存在，它看上去离山顶有500米远。可以清晰的看出，这是一座美式建筑风格的房屋。当你接近它的时候它会因未知原因变得破旧和模糊。如果再接近它（大约距离顶部30米远）就会产生难以忍受的头痛，这座房子将会看起来像是闪烁的褐色、白色和米色斑点，没有任何物理形态。已经证实如果靠近它15米以内会导致贫血、晕厥、脸色苍白。一个人声称他被一种未知力量抛出 。一些人甚至说他们听到了命令他们撤退的声音。
//
//theendofthelevel.jpg
//Level 140里50米宽的带状树林，是这一层级的一道关卡，它通常被认为是这一层级最难以停留的部分，因为有两尾狐在此居住。这里对人产生的影响与山顶上的小屋相似。
//
//树林
//树林是Level 140中一条50米宽的在推测中的海洋与干燥的山脉间的一道屏障。它有一些突出的性质，与在小屋处时很像，站在树林中的人会感到无法忍受的头痛和呕吐感。可以听到海洋的声音，就像在100米以外听到的喧闹的浪花声。这片海洋永远隐藏在这一区域的茂密的树林后——没有拍摄到这片海的任何照片，也没有人探索到Level 140的这一区域。
//
//实体:
//经常能在这里发现 记忆蠕虫，它也是这一层级的主要威胁。它们大多生活在山丘的低处。
//Level 140里的两尾狐聚集在树林及其周边区域，它们也似乎是唯一在这片狭长地带内生存的实体。两尾狐对流浪者总是充满敌意，所以最好同它保持20米以上的距离，直视两尾狐的眼睛总是会引起它们的攻击。只能在傍晚时看到它们，因为它们要离开树林狩猎。
//Entity 147的实体充斥着整个Level 140，它们又开始在低处建立自己的定居点。它们相当强壮，不应该把它们看做是弱于人类的。
//基地，前哨站和社区:
//这一层级有许多未知的人类基地、前哨站和社区。食物短缺和极具攻击性的实体让这一层级很难维持长期的人类生存，当然，如果你有合适的装备的话待在这一层级也相当安全。但是，在Level 140的低处有一座Entity 147建立的小型前哨站这处定居点至少有12座木屋，附近还有长长的战壕。
//
//探索日志:
//关闭 140exp_log_1.docx
//前言: 这是已知最早的 Level 140的录音日志，由一个名叫Michael __________的流浪者于2016年3月5日记录。
//
//12:38
//*可以听到沉重的呼吸声和喘气声。*
//
//12:50
//好吧，我觉得我应该记录下这些东西。我叫Michael __________，我只是想从无限长的阁楼里找一条出路，我不停地走了好几个小时，直到我突然发现了这里。我的眼睛很疼，就像挨了一发闪光弹。我震惊地站了几秒，直到我感觉出剧烈的头痛，还有什么东西把我推出这片区域。我用尽力气跑了将近十分钟，直到疼痛消退。好吧，额，我现在感觉好多了。显然，我在一座山上。但是我看不到它的尽头…我感觉像在做梦一样，所有东西看上去都像在抖动，而且很模糊
//
//12:53
//我似乎登上了山顶，但是当我下来后，我清晰地看到了一座木屋。当我试图靠近它的时候，它变得模糊了，变成了一堆我分辨不出任何东西的点。而且，我还感觉我的头很晕，还有，额，我看上去有点虚弱。 [手机拍照的声音]我讨厌这里。
//
//13:29
//我刚要下山，但是我发现了一些情况。斜坡不是很陡，但是我还是感觉我随时会滑倒。我听到附近有施工的声音，但是我不知道是从哪里传出来的。我试着喊了几声来试探周围，但是没有回应。我很可能出现了幻觉，我每次看到奇怪的东西都会报告的。
//
//15:34
//两个小时过去了。现在好像是傍晚。呼，终于，现在凉快点了，但是我找不到太阳在哪。
//
//16:02
//好，现在过去了大约30分钟，不知道为什么现在又热起来了，哈？这里似乎每两三个小时白天和傍晚交替一次。忘了说了，我身上现在只剩下了一身脏衣服、半空的水瓶，还有我的手机。
//
//17:48
//嘿，现在又凉快点了，虽然现在是中午，我注意到前面有一层薄雾，而且我才发现，嗯，这座山并不是没有生命存在的。我可以看到一些没见过的虫子在地上爬。额，它们攻击性很强，它们中的一小群想要咬我，但是我一直在踩这些生物。
//
//19:35
//这些虫子真烦人。我已经确定我的腿已经完全保护好了，所以我现在对他们的攻击几乎免疫了。 这是我在这个层级的第四个傍晚，我仍然找不到尽头，嗯，我想知道到底有没有尽头
//
//21:06
//天啊，我的脑袋被那连绵不断的工地的声音给搞坏了，我累得要死，我的腿受伤了，9个小时过去了，不过我觉得我找到了终点。地面现在平坦多了，我看到前面有一片树林。我现在又开始头晕了，嗯…
//
//21:27
//妈的。不要靠近它三十米以内的范围。我先是听到了吼声，然后一只狐狸一样的生物发现了我，然后开始追杀我。我大喊大叫，不停拍手，终于起作用了，这只狐狸马上就跑回了树林，我觉得我安全了，但是我也更疲乏了。说老实话，我现在想睡一觉，我的腿已经受不了了。我要去喝点水然后准备睡觉，等我醒来之后我会继续探索——我觉得我听到了某地传来了海浪的声音。
//
//22:02
//我现在距离边界3千米左右。检查过我的皮肤被完全盖好以免我被那些虫子叮咬之后，我用手挖了一个小坑，这样我就可以睡觉了。是的，在这里是个噩梦，而且绝对有可能变得更糟。祝我好运。
//这名流浪者在Level 135进入Level 66处醒来。目前，他居住在Level 11。M.E.G的听完了他的日志，不久证实了Level 140的存在。
//
//入口和出口:
//入口
//目前仅有五个已知的进入这一层级的入口。
//
//进入Level 19过深常常会掉落到Level 140中的小屋的屋顶上。如果你的视力变得模糊，你就可以确定你到了那里，还会突然变得温暖，你也可以看到明亮的蓝天。为了生存下去，你必须尽快离开这一区域，因为这座房子又奇特且不可预测的性质，比如头痛，幻听，虚弱和晕厥。
//在Level 37的深林中闲逛时有可能遇到一片干枯的草地，从那里可以掉落到Level 140。
//太过深入Level 149的屏障会有极小的概率把你带到Level 140。
//进入Level 173的瀑布也许会把你带到Level 140，也可能是其它层级。
//进入 Level 797的墙上的某个洞前往Level 140。
//出口
//目前只有三种方法可以离开这一层级。
//
//跑下Level 140的小山时被地上的枯枝意外绊倒会把你送到Level 79。值得注意的是，故意被搬到不会触发这种转送方式。
//在Level 140睡着之后，你也许会在Level 135的某个区域醒来。
//从Level 140的树林中切出也许会让你掉落到Level 300的木板小道上。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl140{}