//Level 178
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//kodokan-mito-interior-big.jpg
//Level 178中的一个露天工作室 。
//
//Level 178是后室的第179层，被描述为一座环形的传统町屋，有一个没有实体的温泉。
//
//描述：
//Level 178是一座环形的町屋，墙壁和地板都是用木头制成的。该层级的一个显著特点是没有实体，在某些区域悬挂着食物、杏仁水和衣服，作为许多人居住或探险者们补货、淋浴和进食的基地。可以使用各种方法进入它，包括在Level 11中找到一幢房子或在Level 7中睡觉。该层级有多个部分：一个中央有温泉的庭院，一个环绕式门廊，厨房，主区域，淋浴间和卫生间，以及卧室。
//
//主区域通常是大多数旅行者最终到达的地方。它是一片宽阔的平地，明显且温暖的竹木香气在该层级弥漫。大多数门都是滑动打开的，便于找路。有时可以在该层级的某个地方听到涓涓细流和笛乐的声音。地板通常铺有地毯或木质表面，在某些区域可以找到露天的工作室，武士刀和武器挂在柜子里，纸1灯笼照亮房间。壁橱里能找到挂起的和服和可穿的木屐。穿过中心区域会到达其他部分。
//
//厨房可以通过玻璃和木头制成的移门进入，这是一个狭小的房间，里面放着厨房电器，如水龙头、冰箱、橱柜和烤箱。在这里可以找到杏仁水和食物，所有这些都可安全食用，在冰箱里会找到准备好的食物和一张食物清单，可能是天界准备的。右边的一扇门通向用餐区，短木桌上方挂着一盏灯笼，下面是可以坐的垫子。另一扇门通向门廊。
//
//可以从该楼层的多个区域看到178的环绕式门廊，它是一个环绕庭院的正方形，面向中心的温泉。灯笼通常悬挂在弧形屋顶上。庭院和门廊被困在一个时间循环中，表现为清晨，露水覆盖在植物上，从各个角度都能听到轻柔的流水声。门廊下流出一缕通向温泉的小瀑布，使用和浸泡其中都很安全。通过Shoji风格的门可以从庭院区域进入该层的其余部分。有一扇门通向一个装满热毛巾的壁橱，这些毛巾可以用来擦干身体或在温泉中使用。在温泉中睡觉可以通往Level 66或Level 132。
//
//a2000293_main.jpg
//从内部看庭院的图片。
//
//卧室可以通过主区域进入，也可以通过淋浴间和卫生间进入。卧室的墙壁上排列着水彩画和窗户，有些可以看到门廊和庭院。地板上铺着蒲团，这样睡觉很安全。木制楼梯通向更多的卧室。淋浴间和卫生间可以安全使用。
//
//失落一族真的很友善，你们太刻薄了。
//[视频开始，镜头摇晃，随后聚焦在一个年轻的高个子男人身上，他穿着紫色郁金香点缀的和服，黑色蓬松的头发扎成一个小马尾辫。他正坐在沙发上。他身后的墙上钉着一面ace旗，地上放着一壶杏仁水。]
//
//Irawan： 这该破玩意儿启动了没？我可不想像昨天那样，你这个愚蠢的哥布林，每次我让你帮我拍的时候都把镜头给弄丢，结果是因为你连镜头盖都没拿下来。该死的Philippe。
//
//Philippe：……哇哦。好吧，它关了，但是你在录音。一旦这东西带回M.E.G.并被播出来，你就完了。
//
//Irawan： 唔，我只是直接看着你，你猜怎么着，现在我的眼睛完了。
//
//Philippe：先让我们把这件事做完吧。
//
//Irawan：行，在这之后，我要洗个腰果浴，然后让这最近的记忆蠕虫帮我回忆回忆我不认识你时的那些时光。
//
//Philippe：好了，你想宣布这次的更新吗？这会让流浪者们见证历史的。
//
//Irawan：大家好。地狱是真实的，它就建在这里。最近，尽管我最好的朋友倾尽全力，但与神教的会谈比预期的要好，我们不仅达成了协议，而且还达成了一些新的，十分真切的，令人感兴趣的目标。我现在意识到Level 11可能是每个人的首选居住地，即使你必须经过Level 9，而且大多数流浪者不会生活在Ray的烹饪中，在这个weeb2层级中与我们一起玩。他们宁愿住在一个城市层级，在那里他们不会意外切出，也不会在周二以后，在一个危险的层级中以两种方式结束生命。这很有可能是Philippe，对吧？
//
//Philippe：真的吗？哇哦。
//
//Irawan：Level 178，正如文章所说，是安全的，没有实体——在某种程度上，它可能比Level 11更接近家。这不是一个陷阱层级，真的。一切都是真实的，没有危险，除非你进入一个危险的层级，如子区集或沼泽层。尽管我尽了最大的努力，Aadhira仍想在等级3的层级中生活，我只在补货时看到她。她一直是那种天真的理想主义者，想要帮助所有人。像这样的人在这里是不会成功的。不，我们不是Level 11居住地的竞争对手。我不相信那该死的资本主义市场竞争。
//
//Philippe：我试着通过9到11，差点失去了我的腿。
//
//Irawan：行了，午餐盒。听着，谈判进行得很顺利。神教允许在这里创建一个M.E.G.基地，如果有人想的话。我们已经同意建立一种村庄联合企业，并在墙上建造了这些钩子来铺设绳索，这样我们就可以更容易地找路和交易。在该层级上走得更远可以帮助你找到其他东西。我们有些商人和制图师一直在努力绘制该层级的地图，他们走的很远，并发现了几间厨房，在大多数食品储藏室里不只发现了大米和那该死的杏仁水。有些厨房里摆满了香料，有些则摆满了快餐。其中一个有一包Daun Salam3。我妈妈的咖喱里会放它们，这让我想起了家。我们一直在交易这些东西，看起来我们的菜单会变得更丰富一些。
//
//Philippe： Ray很乐意再做一次鸡肉干酪。
//
//Irawan：食物够了，够了！我们在建立村庄和贸易。任何进入该层级的流浪者，只要跟着你找到的绳子走，我相信你会找到一个村庄或一些人类的存在。我们在几个月内就与神教达成了协议，比起和M.E.G.在几年内达成协议更快更容易，因为他们有意隐瞒。但除了这些进步之外，还有一些新的、真正重要的东西。一旦第一条消息发出，我就会通知大家。Philippe，你现在可以把它关掉了，我们都知道你想下车喝个烂醉。
//
//[消息结束。]
//
//基地，前哨和社区
//大日母神教
//被称为失落一族的团体的基地，居住在中心区域。
//少数成员会说英语和日语以及他们自己的语言。
//乐于助人并永久居住在此层级，但不对新成员开放。
//与业界结盟；经常与团体进行交易和沟通。
//这个基地的一部分大约有12个人，都来自失落的玛雅人，新的万神殿或龙门。
//天照寮
//基地分布在周围的层级。
//Level 178中最大的团体。
//中央基地在厨房附近的一间工作室里，他们在那里为自己和旅客做饭。
//在已知入口附近设立了一个旅行站，以帮助最近切入的旅客通过或居住在这一层。
//该团体的领导人名叫Irawan。
//还有一些更小、更临时的群体居住在这一层，他们要么太小，要么缺乏被视为社区所需的结构。最近，一个较小的部族和天照寮之间正在谈判，因为178缺乏实体且有易于导航的结构，他们考虑在这个安全层级建立一个类似城市的定居点。
//
//出入口
//入口
//一名旅行者在Level 127意外进入了Level 178，当时他被一辆刮墙机追赶，撞上了一堵墙，逐步穿过墙，进入了Level 178中一间宽敞的房间。进入的方法包括在Level 7中睡觉，这有极罕见的机会在Level 178的温泉中成功醒来，进入Level 138中的一座木制建筑，或远行Level 11并看到远处的町屋，这是最安全的入口。
//
//出口
//目前有四种方法离开Level 178。其中包括在温泉中停留足够长的时间并睡着，这会导致你最终到达Level 66或Level 132，或者直接在看起来较暗的墙上切出，将你带回到之前的等级。还有一种是在层级中穿行几周，看到一个有出口标志的小房间，这个小房间通向Level 138。如果你从温泉里游下去，你会最终到达Level 178.1。最后，穿过其中一个厨房的餐具室，将通往反现实保龄球馆。
//
//其他文件：
//以下内容已发送给M.E.G.，Irawan的“Base Beta”和一位身份不明的太阳女神集团成员。
//
//你好，M.E.G.的梯队们，我们是Irawan和……你不想让他们知道你是谁？你确定吗？好吧，buddy bo -性别也不应该公开？好吧，那很好。你当然有蓝色的头发和自己的称呼。太有趣了……我喜欢我的蓝头发，它让我看起来像一颗黑莓。不管怎样，神教和天照寮一直在讨论.……我们发现了一件大事。不过，不要让其他团体知道这件事。我不想让这些破事从我们身边溜走，尤其是因为在这样一个地方的官僚错误。其余的失落一族目前并不知道这件事。所以，我们发现的小东西，包括我们以前在该层级不清楚的成分，建立了一个绳索网络，无论如何。看看我们发的视频就知道了。Siria和Marvin正在写一篇“物品”文章来更新你们的消息……看那里，那很奇怪。
//
// 
//来京都梦吧！
//这个格式对吗？去你的，Philippe。
//
//作者(们)
//« Level 177 | Level 178 | Level 179 »
//
//Footnotes
//1. 译注：原文为Shoji。
//2. 译注：weeb即“wanna be Japanese”，通常指那些对日本文化产生迷恋的人。
//3. 译注：此为印尼语。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl178{}