//Level 107
//Level 107：初始版本
//Level 107：修订1
//Level 107：修订2
// 
//
//生存难度：
//等级 4
//
// 
// 
// 
//7830-1541616875176.jpg
//Level 107内的一个毁坏的房间。注意墙壁上的电力箱。
//
//Level 107是后室的第108层。
//
//描述：
//Level 107是一片被严重污染和毁坏的房间，据初步观察，该层级内部表现为一段时间内无人居住。该层级外观标志为棕黄色的瓷砖墙壁以及被强行撕毁的屋顶，仅留下一堆扭曲的电线以及因未知原因腐烂的木材来支撑房间的顶部。房间的门已严重受损，其上大部分的铰链已脱落。有关Level 107需注意的是，每个房间似乎都有一个电力箱连接到房间的一面墙上。可以直接观察到钢筋支撑着主要部分并延伸至地板下的某些房间。
//
//大多数房间地面被断木与碎片覆盖，强烈建议穿着结实的鞋子以避免受伤。房间内不透明的厚窗户似乎会发出强烈而明亮的光线，但其为层级内唯一的自然光源。因此强烈建议使用强力发光设备。Level 107持续发出一种环境噪音，其被描述为一种由录音设备产生的静电与尖叫声。若该环境噪音持续时间较长，可能会使流浪者陷入疯狂。通常情况下，连续暴露在噪音下超过72小时将导致听力损伤。
//
//实体：
//层级被多种实体所影响。悲尸可以在许多房间内被发现，通常可以在附近找到杏仁水和口粮等物品。此外在Level 107中常常发现感染了疫疾的蠕灵，鸭典娜以及瓷砖陷阱。
//
//其他许多不明实体的报告已得到证实。多数前往该层级的流浪者报告天花板传来巨大的尖叫声。目前，没有任何证据支持该观点。
//
//基地、前哨与社区：
//由于Level 107上述所提到的环境噪音效应，该层级不存在已知的基地、前哨与社区。
//
//入口与出口
//入口
//最近的研究显示，通过Level 106内的特定门将带你来到 Level 107。此外，已经证明进入在Level 135发现的的一口特别的井有极低的概率带你来到Level 107。
//
//出口
//根据研究人员的一项新研究， Level 107每经过35个房间，天花板上会存在一定数量的洞。爬上天花板的这些洞将带你来到其他层级，通常会来到Level 68。从地板切出将带你来到Level 108。
//
//
//生存难度：
//等级 5
//
// 
// 
// 
//7830-1541616875176.jpg
//107内的一个损毁的房间。注意墙壁上的电力箱。
//
//Level 107是后室的第108层。
//
//描述：
//Level 107是一片被严重污染和毁坏的房间，据初步观察，该层级内部表现为长期无人居住。该层级外观标志为棕黄色的瓷砖墙壁以及被强行撕毁的屋顶，仅留下一堆扭曲的电线以及因未知原因腐烂的木材一种未知的材料来支撑房间的顶部。房间的门已严重受损，其上大部分的铰链已脱落。有关Level 107需注意的是，每个房间似乎都有一个电力箱连接到房间的一面墙上，这些电力箱在使用时会产生危险的异常效应。可以直接观察到钢筋支撑着主要部分并延伸至地板下的某些房间。
//
//大多数房间地面被断木与碎片覆盖，强烈建议穿着结实的鞋子以避免损伤。房间内不透明的厚窗户似乎会发出强烈而明亮的光线，但其为层级内唯一的自然光源。因此强烈建议使用强力发光设备。Level 107持续发出一种环境噪音，其被描述为一种由录音设备产生的静电与尖叫声。若该环境噪音持续时间较长，可能会使人员陷入疯狂。通常情况下，连续暴露在噪音下超过72小时将导致听力损伤。值得注意的是，此种环境噪音似乎对流浪者的精神有着特殊的影响。
//
//实体：
//层级被多种实体所影响。悲尸可以在许多房间内被发现，通常可以在附近找到杏仁水和口粮等物品。此外在Level 107中常常发现感染了疫疾的蠕灵，鸭典娜以及瓷砖陷阱。
//
//其他许多不明实体的报告已得到证实。多数前往该层级的流浪者报告天花板传来巨大的尖叫声。目前，没有任何证据支持该观点。
//
//直至该文档撰写时，由于虚假信息的传播，上述所有实体报告被视为无效。需要进一步研究以确定Level 107的真实实体种类。
//
//基地、前哨与社区：
//由于Level 107上述所提到的环境噪音效应，该层级不存在已知的基地、前哨与社区。
//
//入口与出口
//入口
//最近的研究显示，通过Level 106内的特定门将带你来到 Level 107。此外，已经证明进入在Level 135发现的的一口特别的井有极低的概率带你来到Level 107。
//
//出口
//根据研究人员的一项新研究， Level 107每经过35个房间，天花板上会存在一定数量的洞。爬上天花板的这些洞将带你来到其他层级，通常会来到Level 68。从地板切出将带你来到Level 108。
//
//展开采访记录107-1
//有关采访记录107-1的调查仍在进行。
//
//
//生存难度：
//未分级
//神秘属性
//未知
//未知实体数量
//
//7830-1541616875176.jpg
//它将摧毁你。
//
//Level 107是后室的第108层。
//
//描述：
//Level 107 是一个能够影响到达该层级流浪者的异常层级。
//
//由于Level 107的异常效应，Level 107的真实外观未知。当任何生物到达该层级时，其将会遭受严重的精神衰变，并被传送至被其他流浪者所认知为Level 107的区域。有关该区域的描述见初始版本。当任何人被问及有关Level 107的外观，实体或者具体描述（例如：Level 107的目的是什么），其将导致受影响者直接死亡。研究人员认为，此为Level 107有目的性的封闭信息的措施。
//
//实体：
//从某种方面来说，Level 107内的唯一实体即Level 107本身。理论上，其为一巨型智慧实体，其使用心智扭曲操作（P.B.W.M.）将人员传送至层级的一虚假空间维度内。据研究，传送一名人员需要约2.3秒。目前正在研究如何真正的探索Level 107。
//
//基地、前哨与社区：
//由于上述的异常效应，Level 107内没有已知的基地、前哨与社区。
//
//入口与出口：
//入口
//最近的研究显示，通过Level 106内的特定门将带你来到 Level 107。此外，已经证明进入在Level 135发现的的一口特别的井有极低的概率带你来到Level 107。（请注意，这些入口将通往真实的Level 107，但是流浪者将被传送至虚假的Level 107）。
//
//出口
//根据研究人员的一项新研究， Level 107每经过35个房间，天花板上会存在一定数量的洞。爬上天花板的这些洞将带你来到其他层级，通常会来到Level 68。从地板切出将带你来到Level 108。(请注意，这将会使流浪者离开虚假的Level 107。)
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl107{}