//Level 170
// 
//
//生存难度：
//等级 2
//
// 
// 
// 
//Concrete1.jpg
//关于Level 170的首批照片之一，其中有一型和二型水泥箱。
//
//Concrete2.jpg
//二型水泥箱，偶见于Level 170。
//
//Concrete3.jpg
//三型水泥箱，Level 170中最少见的一类水泥箱。
//
//Level 170是后室的第171层。由一位匿名流浪者于2014/03/19发现。
//
//描述：
//Level 170是一处干燥场地，地面上铺设有水泥制的箱子。该层级有边界，约7公里长，400米宽，总体上呈长方形，是面积最小的层级之一，面积仅2.8平方公里。四面围有稀疏的森林。
//
//层级地面由干草、树枝碎屑覆盖，少见旱生灌木。该层级气候相对温暖，温度在25°C和35°C间波动。Level 170的时间周期相当混乱——太阳一经落山，便立即在另一侧升起，跳过了夜晚时间。Level 170日出日落的平均时长约为6小时。而Level 170的天气则不受其怪异的时间周期影响。人们可以观察到天色变化，有时晴空万里，有时阴云笼罩，有时甚至有下雨的现象记录。
//
//水泥箱
//“水泥箱”是对一系列混凝土结构体的统称，常见于Level 170的地面上。每个结构单元的尺寸一致，即2.5 x 2.5 x 5米，由厚度25厘米的空心混凝土块制成。他们的摆放位置看起来很随意，但Level 170的这些板块结构体的朝向统一，且按照网格状排列。据估计，Level 170共有约1000个这样的结构体。
//
//这些结构体分三种类型，不同类型特点不同。
//
//一型
//该层级有约九百个这类型的板块。这种类型的板块完全不具有任何特殊性质，常见于地面。其中通常被死亡飞蛾据为繁殖地。
//
//二型
//约有100个二型混凝土箱。它们拥有某种特性，使其成为层级互相联系的门户，流浪者可自由穿过并出现在层级的另一边，这使得该层级易于探索。关于这种类型混凝土箱所具有的门户属性，目前所知甚少。M.E.G.正着手对二型混凝土箱进行分析。
//
//三型
//在层级边界有三个混凝土箱，它们被摆放为一个几乎完全对其的形状。已证实的是，三型混凝土箱对人类思维有益。待在这些结构周围的流浪者称，他们感觉自己的头脑更“清晰”，站在这些混凝土结构之间时，更容易回想起久远的记忆。所有流浪者都称自己在该区域时感到安全。许多人甚至对这些结构的影响成瘾了，为了失去对时间的感知，有的人可以在这一区域坐上数小时。由于对这一类型混凝土箱缺乏相关信息，M.E.G.特工人员不建议在那里待太久，而且有人猜测这些结构可能是活着的。
//
//森林
//Level 170的森林是该层级中心部分的边界区域。这一区域从里到外的平均距离约为15公里。人员越深入这一区域，树木就约稀疏。森林的空旷处有栖息怪出没，这使得对该区域的探索变得尤为困难。由于上文提到的栖息怪侵扰问题，建议进入该区域的流浪者保持警惕。
//
//实体：
//在Level 170的一些水泥箱上常见有死亡飞蛾，它们在这些结构上筑巢。在Level 170出没的死亡飞蛾通常富有敌意，并散发出一种独特气味。因为它们会向打扰者喷射酸液，强烈建议频繁检查水泥箱是否被其盘踞。
//Reviooks常见于Level 170的边界，它们等待流浪者在地面驻足，以抓住他们的脚。逃离它们的唯一方法就是不停地向前跑，或是迅速返回森林的起始处。
//基地、前哨和社区：
//该层级无已知的基地、前哨或社区。敌对实体的存在和各类食物的缺乏使任何人类都难以在这一层级维系生命。如果人员携带恰当的装备并待在恰当的区域，我们认为该层级对其是相对安全的。
//
//入口和出口：
//入口
//目前仅已知六种进入该层级的方法。
//
//通过Level 39的树木切出偶尔会使人员抵达Level 170。
//Level 81的某些水泥墙壁办公室可通向Level 170的二型水泥箱。
//通过Level 162的混凝土墙切出可前往Level 170的二型水泥箱。
//在Level 108的走廊中迷失，会导致人员通过二型水泥箱抵达Level 170。
//离开Level 192的森林，可抵达Level 170。
//通过Level 797墙壁上的某个洞，可抵达Level 170。
//出口
//目前仅已知四种离开该层级的方法。
//
//深入Level 170的森林可能使人员进入Level 10，这是由于前者渐变为Level 10，但人员进入后无法返回，因为Level 170直接从人员视线中消失，原因不明。我们认为这一方法最稳定，但可能也最危险。
//Level 170的某些二型水泥箱可通向Level 162。
//Level 170的某个特定的一型水泥箱可通向Level 181的B类矿洞。
//少数情况下，可在Level 170的森林发现单棵的棕榈树。攀爬这种树会将人员带到Level 204中相同的树冠上。值得注意的是，这类树木极其罕见。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl171{}