//Level 169
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//lv%20169
//一位探险家在level 169所拍摄的照片
//
//Level 169 是后室的第170层，1998年5月14日被发现。这是一个有限的层级，外观为北美沙漠荒原。
//
//描述
//Level 169 由峡谷和干燥的地形组成。它的直径约为551公里（317英里）。长时间处于此层级会导致中暑，这会进一步导致产生感官和视觉上的幻觉。大多数流浪者报告说，在该层级行进数小时后出现类似低温症的幻觉症状。在此层级中，一天的周期需要48小时。白天时，气温可达42摄氏度（107.7华氏度）。夜间时，气温会降至1摄氏度（33.8华氏度）这片沙漠是圆形的且面积有限，流浪者可以从沙漠中心向任意方向行进250公里，到达层级的尽头。沙漠的尽头是悬崖峭壁，悬崖下方看起来像是虚空。
//
//所有形式的水，包括杏仁水，都会在这一层级中变成沙子。当一个流浪者在此层级中暴露在阳光下的时间超过6-7小时，他身体里的所有水分都会变成沙子，并在此过程中杀死流浪者。建议流浪者在此层级活动时遮盖全身并寻找阴凉处。对其中一具木乃伊化的尸体的尸检报告显示，它的骨骼已经变形，身体已完全干枯，且被沙子填满。
//
//在沙漠的中心，有一口井作为层级的入口。从这里，流浪者可能会在远处看到一所房子。建议朝房子的方向走，因为它是一个安全的庇护所。
//
//实体
//幸运的是，层级中不存在危险的实体。唯一可以在此层级中找到的实体是 "Ferry"。Ferry是一个有感知力的冰箱而且它的内部会出现食物和杏仁水。它会每小时用食物和杏仁水补充满自己。Ferry也有补充层级内其他样式的容器内物资的能力。目前还不确定这种能力的原理，以及它的范围到底有多大。它的门上贴着磁铁和便利贴，并且它可以通过修改和重新排列便利贴和磁铁来进行沟通和交流。Ferry对层级内的人们很友好，并通过提供补给以及协助流浪者逃离层级来帮助流浪者在Level 169中生存下来。Ferry曾经对一个流浪者的离开表达了悲伤。
//
//基地、前哨和社区
//Ferry的房子
//Ferry的房子位于Level 169中心以北5公里处，里面住着7个人，他们被称为“Ferry的朋友”。这所房子有几间卧室、一个放置Ferry的厨房、几间客厅和一个地下室。当流浪者来到这座房子时，他们会受到Ferry的朋友的迎接，这些人是选择住在这个地方的以前的流浪者。他们会让流浪者进入房子，并给流浪者提供来自Ferry的杏仁水补给。流浪者可以要求Ferry提供许多杏仁水补给来帮助他们逃离这个层级，或者他们可以选择住在这里，但不建议这样做，因为这可能需要他们提供更多的补给才能让更多人住在这里。
//
//检查点 A, B, B½, C
//这些检查点充当试图逃离层级的流浪者的补给点。
//
//检查点 A位于沙漠中心以北60公里处。
//检查点 B位于沙漠中心以北150 公里处。
//检查点 B½位于沙漠中心以北190公里处。这个检查点是一所家具齐全的房子，还有一张可以用于睡觉的床。
//检查点 C 位于沙漠中心以北 230 公里处，是你在此层级中可以找到的最后一个检查点。
//入口与出口
//入口
//进入此层级的方法尚不明确。所有成功逃脱的流浪者关于如何进入此层级的所有报告都是不同的。不过，这些报告中的许多报告都有一些共同因素。这些因素包括：
//
//流浪者是独自一人。
//流浪者对他们的过去存在疑虑。
//流浪者在进行切出之前已经迷路。
//流浪者正处于危及生命的处境。
//一位不知名的流浪者最近发现了一个稳定的Level 169的入口。进入方法为切入隐秘层级井中的墙壁。
//
//出口
//离开此层级的方法为到达沙漠的尽头并跳下悬崖，这样做会导致流浪者在level 11中醒来。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl169{}