//Level 165
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//level-170
//Level 165的边缘地区。
//
//Level 165 是后室的第166层，由Level 9中的两名流浪者发现。
//
//描述：
//Level 165是一个被白色栅栏勾勒出的大型花园。花园中有许多花坛，花棚，以及少量温室。Level 165很可能包含前厅所有已知的植物种类。
//
//实体
//不同于Level 9的是，Level 165中没有任何敌对实体。实体可以自如进入Level 165，但是所有的实体相比他们在Level 9的原种群都有着完全不同的友好程度。Level 165目前只发现一种本土特有实体。
//
//鸟
//尽管鸟无法被观测到物理形态，但他们可以出现在这一层级的任何地方。他们不可视，却可以被听觉辨别。已观测到鸟会发出低声啼鸣，高声长鸣，少数情况下还会歌唱。鸟吟唱时会伴随着古典流派的音乐旋律 (例如《1812序曲》、《骷髅之舞》、《山魔王的殿堂上》等) 。尽管听众可能并不熟悉这首曲子，他们依然可以流利地“随着哼唱”，仿若似曾相识。
//
//强烈建议避免背向他们鸣叫的方向，或在朝向鸟鸣的方向时眨眼。此类实体在视觉接触中断后会突然出现，许多流浪者因此消失得无影无踪。目前这些流浪者失踪的原因尚未得到确认。
//
//特征
//“海柏利昂”
//在Level 165近中心区域有一棵红衫 (沿海红衫) 扎根在一片80m2的灰化土壤中，绰号“海柏利昂”。海柏利昂与现实中对应植物在基因层面上完全一致，然而以下不同值得注意：
//
//缺少根和枝干
//不需要养分
//维持每分钟90次的脉搏
//违反平方-立方定律
//未曾展现衰老的迹象
//周围植物生命力更加茂盛
//喷泉
//喷泉在Level 165十分罕见，且其间相隔很远。这里的喷泉通常由大理石或石英建成，每个喷泉都大约装有20升的腰果水。这些喷泉好像与半径500米以内的的植物相连通。当喷泉不运转时，Level 165会进入一种干旱的状态。
//
//恒定部分
//花坛
//在Level 165的花坛里生长有植物王国里8个不同种类的植株。在Level 165，一些不能在纯土壤中生存的植物(例如仙人掌，肉质植物，附生植物等)也可以无视本层级的土壤纯度，正常生存在花园中。
//
//花棚
//Level 165的花棚通常由木头 (一种桦木) ，金属 (铜) ，或少部分由石头 (玄武岩) 构成。花棚外部材质不同，内部的物品和对心智的影响也会有所不同。
//
//如果花棚由木头建造而成，花棚里会堆满铲子，手套和洒水壶。当人员进入该层中以木头建成的花棚时，他们会进入一种高度喜悦且兴奋的状态，这种效果会在约60分钟后结束，并与所处的地点和状态无关。
//
//如果花棚由金属建造而成，花棚里会堆满罐装的腰果水，桶，锄头和一个连接着一根灌溉软管，可以排出蒸馏水的水龙头。当人员进入该层以金属建成的花棚时，该人员会感受到轻微的恐惧。然而，这种效果不会继续在花棚外持续。
//
//如果花棚由石头建造而成，花棚里会堆满花园铲，许多桶装的覆盖物，及袋装的肥料和种子。当人员进入该层中以石头建成的花棚时，他将不会有任何精神上的异常反应。
//
//温室
//这里的温室几乎与前厅中的温室完全一致。每个温室平均有15种家庭植物。温室会对精神产生一定影响，但不与该层中的木质花棚相同。
//
//发现
//Level 165是由Jeremy██████和Thomas██████在██/██/████于Level 9发现的。Jeremy和Thomas为躲避一The Mangled的个体而跑进了一所房屋。为了打发时间，Jeremy在屋子中进行了探索并意外发现了一扇后门，从而到达了Level 165。
//
//基地，前哨和社区：
//Level 165因未知的特殊原因而不可定居，任何建造在Level 165的基地,前哨和社区会在几分钟时间内瓦解。因此不可能以殖民地/前哨的形式在Level 165永久居住。
//
//入口和出口：
//入口
//Level 9
//进入Level 9某间屋子的后门。
//Level 45
//进入一片叫“户外植物”的区域。
//出口
//Level 27
//在Level 165进入一个木制花棚（1/250的概率）。
//Level 37
//跳出Level 165的围栏。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl165{}