//Level 173
// 
//
//生存难度：
//等级 4
//
// 
// 
// 
//vgJJyT.jpg
//Level 173中的一个部分。
//
//Level 173是后室中的第174层。该层的环境类似于一个巨大的，半淹没在洪水中的洞穴区域。
//
//描述:
//Level 173是一个被洪水淹没的巨大洞穴。整个Level 173全部由混凝土制成，该层中的每个区域内都有着浅黄色的灯光，使流浪者的视野略微受阻。同时，本层内各个地方都并非完全相同，流浪者通常需要跃过或攀爬一些大型石头或者类似的地形结构才能继续前进。
//
//这一层中每个部分的环境都与每个流浪者所遇到的不同，该层甚至经常发生变化以来阻止流浪者们离开此层，这些变化包括此层级会凭空创造出一些死路和直接通向水中的陡坡等。在整个随机间隔内，地震这一现象也时常会在该层中发生，地震发生时通常会使一些石块从天花板和墙壁上掉落下来，使得流浪者的生命受到威胁。
//
//Level 173 中的水经常在该层级中每个地方发生变化，目前这些水的类型已被证实为有海水、淡水甚至杏仁水等。Level 173 中的每个水域都被证实十分的危险，因为曾有人在其中发现了许多陌生的鱼类。如果流浪者碰巧掉进了水中，建议其立即爬上陆地，因为水中的鱼类会对掉入水中的流浪者发起攻击。同时，在此层级中每个区域的水位都会发生不同程度的变化，例如水位会从原本仅为3英尺的深度变化到约60英尺深。常常会有许多敌对的实体出现在深度较深的水域。
//
//在Level173中也发现了数量多到难以记录的瀑布，在它们其中隐藏着通往其他层级的入口，一些充满了杏仁水的小池塘也可以作为杏仁水的补给处。尽管如此，目前已被证实部分瀑布将会直接通向深坑中，十分的危险。
//
//在Level 173中可能出现的实体有：死亡飞蛾，肢团，猎犬，Nguithr'xurh和爬菌等。此外，据说疾疫也在该层中肆虐。
//
//在这一层的墙壁和地板上还刻着许多的铭文，它们似乎都以英文的形式被篆刻在各处。这些铭文会在Level 173中各个不同的地方随机消失并再次重新出现，其内容通常为：
//
//"毋信水"
//"颤亦伤"
//"勿觉，否则地亦将颤也"
//"渊中之兽正颤，颤者亦颤"
//"LEVIATHAN"1
//"即将苏醒"
//"保持安静"
//
//编辑 (5/12/21): 近期，有流浪者报告说，Level 173中的地震愈发强烈，以至于使Level 173的整个部分完全塌陷。在地震中，人们还听到水中发出类似警笛的声音。还看到这一层中的墙壁和地板上都出现了新的铭文。
//
//"晚矣"
//"子必悔之"
//"离"
//"速离"
//
//基地、社区和前哨
//本层没有已知的基地、社区或前哨。
//
//入口
//在Level 172中的黑色黎明事件发生时将导致你会出现在这里。
//进入Level 8中的瀑布就可以来到这里。
//只有很小的几率在Level 3切入一面墙就可以来到这里。
//冒险进入Level 300里其中的一个瀑布就可以来到这里。
//出口
//寻找到该层中的终点就可以来到Level 174。
//进入瀑布后就可以来到Level 66，Level 76， Level 140，Level 2，Level 6，Level 994，和Level 998。
//一些瀑布后的深坑可以去到Level 666，Level 899，Level 532，和Level 6。
//在瀑布后面找到一扇色彩缤纷的门就可以参加一场 派对！ =)
//找到本层中的一个秘密出口就可以来到终点.
//+ show block
//« Level 172 | Level 173 | Level 174 »
//
//Footnotes
//1. 译者注：利维坦(《圣经》中的怪兽); 庞然大物;。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl173{}