//Level 172
// 
//
//生存难度：
//等级 3
//
// 
// 
// 
//Level172_1_day.jpg
//在Level 172的“白昼”间发现的电车的图片。
//
//Level 172是后室的第173层，是一座位于城市郊区的轻工业区。
//
//描述：
//Level 172类似于一座建造于2000年前后的现代工业/办公区域，包括许多大厅、仓储空间和偶见的办公楼。该层的湿度很高，温度徘徊在10 ℃（50 ℉）左右。会使流浪者惊讶的是，该层拥有日夜循环，且如果准备不充分，可能会造成伤害。该层可被划分为三大区块：大厅与仓库（在功能上相关）、办公楼、街道。
//
//大厅与仓库：
//大厅与仓库是Level 172中两种最常见的建筑形式。它们通常在结构上彼此相邻，并有着正门与侧门二者作为入口。内部的电力可正常运作（尽管不是所有情况下），但房间里找到的设备/物品偶尔会是散落在地上的。仓库内常常储满了有用的补给，甚至有食物。叉车是其中一件可在仓库中找到的实用的物品，有时也可以在大厅里找到。它们可以作为一种更加迅速的交通方式且能运载大量的补给/材料。
//注意：若大厅与仓库内部的灯光熄灭或正闪烁，请尽量远离。
//
//办公楼：
//在Level 172中，办公楼属于罕见的建筑。它们在规模上比大厅与仓库更加小。与前者不相似的是，大多数的办公室有着许多窗户，大部分窗口是暗的。建议流浪者保持谨慎并与窗户保持一定距离，因许多办公楼已被Entity 2所侵染。当位于楼内时，人们能在办公室里找到仍可使用的电脑与放置在走廊四周的、装满了杏仁水的冷却器。
//
//街道：
//街道是Level 172中位于大厅、仓库和办公楼之间的户外区域。街道通常由大小不一的沥青路组成，也包括人行道、路灯以及不时能遇到的电车轨道。路上的交通并不繁忙，但流浪者或许会遭遇驶过的巴士、无轨电车、带盖/敞口卡车或有轨电车（通常每小时一到两班）。这些车辆均无驾驶者并貌似自主驶动。
//注意：当行驶着的车辆接近时，建议流浪者们请勿在街上穿行。这些车辆速度极快且不会因有行人而停下。被行驶的车辆撞击或将导致重伤甚至死亡。
//
//街道上值得注意的地点:
//
//停车场——可能停放着车辆。这些车辆无法使用，但它们能够在夜间提供庇护所且可能内含一些重要补给。
//车站——在路边有时能发现巴士/电车站。概率地，在等待一段时间后，巴士或电车将会出现并停靠。有可能登上它们并被载往其他层级。（有时等待车辆出现并停靠将需要24小时以上，因大多数驶过的车辆只是无视站台）
//停靠的巴士——可在路边发现停靠的巴士（有时甚至是电车），或发现它们在车站前等候。这些车辆不会自主驶动且有时可被手动操纵，提供了夜间的庇护所和在层中的快速交通方式。
//事件：
//白昼：
//level172_2_black_dawn.jpg
//在“黑色黎明”持续期间摄下的图片。
//
//level172_3_night.jpg
//最后一张摄于“夜晚”事件即将生效前的图片。
//
//白昼通常是活跃的。其被认为是该层的默认状态。白昼期间，可在层中的街道上安全地漫游，遭遇实体攻击的威胁将会是最小的。白昼的持续时间不固定，但据测定在20-42小时之间。
//
//黑色黎明：
//由层中的流浪者命名，黑色黎明是层中的光线开始迅速消失的一段短暂时间。是夜晚即将到来之前会发生的事件。在此期间，流浪者们应立即在任何建筑内甚至是街道上的车辆中找到庇护之处。黑色黎明将会持续2-15分钟。
//
//夜晚：
//在夜晚事件中，环境光线亮度将急剧下降至接近漆黑一片。在夜晚外出漫游是极其危险的。进入黑暗中会导致心理压力增强、迷失方向，有时也会产生幻觉致使受害者更加深入危险的境地。受害者们或将遭受来自未知源头的，瞬间的、剧烈的撕扯。撕扯的力度会随着受害者进入黑暗的时长而增强。暴露在黑暗中超过数分钟以上即可导致受害者被撕裂或流血至死。夜晚的持续时间各不相同，但已被测定在1-16小时之间。
//
//实体：
//笑魇、猎犬和窃皮者偶见于大厅和仓库中（若建筑内的灯光熄灭它们的数量将更多）。亦发现有大量的尸鼠，它们的行为取决于灯光是否亮起（当灯光熄灭时它们将变得更具侵略性）。有时可在仓库内的板条箱中发现大量的雄性死亡飞蛾。
//
//经常可在办公楼内目击到窗户，亦有少数报告称目击到笑魇。
//
//街道上通常是实体绝迹的，但在夜晚结束后的短时间内例外。在该时间段，出现了猎犬 与窃皮者 的目击报告。
//
//基地、前哨站和社区：
//Tramvajáci
//Tramvajáci，亦被称为“电车帮”，是Level 172中一个移动的团体，采用改造过的电车作为他们的基地。他们因驾车穿行该层并绘制地图，且为其他流浪者提供补给、庇护所的帮助而为人熟知。
//
//该团体拥有六名成员。
//他们很愿意与其他团体交易。
//团体成员能以多种语言进行交流（例如：英语、德语、俄语、波兰语和捷克语）。
//通过他们对层级的测绘，该团体获得了多个出口地点、最活跃的巴士/电车站、储有实用物资的仓库的信息。
//入口和出口：
//入口
//在Level 11，流浪者有时能够发现一条类似于加拿大多伦多市的电车系统的轨道线路。若流浪者搭上电车且在搭乘途中失去知觉，当他们醒来，电车将正在Level 172中某随机站台停靠。
//出口
//在任意站台搭乘一辆巴士会把你带回到Level 11。理论上亦可将你带到其他层级。
//在将你带到该层的电车内等待或搭乘另一班电车通常会将你带回到Level 11，但也可能将你带到后室地铁。
//任何大厅与仓库的入口门（更大概率使用侧门时）有时会将你带到Level 20、Level 56，罕见情况下甚至是Level 522。
//不知为何，搭乘一辆行驶中的卡车能带你到Level 22。
//切出某些办公楼中的天花板会通向Level 171。
//理论上切出某些办公楼中关闭的办公室门可能通向Level 4。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl172{}