//Level 160
//关闭
//作者 注
//这篇文章中提到了“自杀”这个话题，所以请考虑是否继续阅读
//
//
//
// 
//
//house.jpg
//你不记得了吗？你怎能忘记呢？
//
// 
//
//你还记得那些日子，不是吗？你曾经和伙伴玩到太阳落山的日子？你不记得曾经热衷的游戏吗？捉鬼游戏？你总是玩得那么好！藏猫猫？别人根本赢不了你！你在玩这些游戏时认识的小伙伴呢？用手都数不过来！你愿意付出什么代价来回到那时呢；没什么比的上过去的美好时光，对吗？
//
//你想重温这些记忆的愿景与日俱增。你已经迫不及待了，是吗？
//
// 
//
//swing.jpg
//你超喜欢这个，不是吗？你会花很长时间在上面荡秋千，或者只是坐着凝视开阔的天空。
//
// 
//
//那些日子里，你从未感到无趣乏味。那时的一切与现在多么不同，现在一切都很单调，灰白。你之前岁月里所有的乐趣，现在只是云消雾散，随着时间逝去了。但不一定非要如此。我可以把所有这些时光和更多的东西赠于你，只为了让你重温一次！
//
//你怎能忘记和Emma共度的时光？那个曾经与你分享秋千的女孩，那个曾经为你歌唱最甜美的旋律的女孩，那个风雨无阻，每天都来听你吐露心声的女孩？她就在这里，在等你，对着自己哼着你唱给她的相思曲儿。而你就如此匆忙地否定她的存在，就如此快地忘记她吗？她还没有腐烂；她还在这里，等你回到她身边，履行你爱的诺言。
//
// 
//
//sky.jpg
//这本不应发生。你还这么年轻，没必要看到所有人都这样离开，至少在这个年龄段没有……
//
// 
//
//为什么是你？为什么不是其他人来承受这样的内疚？你现在本应腐烂了。就像其他人一样腐烂了。
//
//那时候，在一瞬间，你失去了一切。无望地站在燃烧着的橙色天空下，对这一切都无能为力。但事故不是你的错，是他的。
//
//他们爱你直到生命的最后时刻，而在这里，你可以重新体验他们的爱。他们也渴望你能回到他们身边。你所要做的就是接受我的契约，我将赋予你在生命中失去的一切，满足你的每一个愿望。我保证不会让你再受到那样的折磨，在这里你也不会回想起那些记忆。
//
// 
//
//Gudstuff
//不是你的错！不是你的错！不是你的错！
//
// 
//
//你空虚，无家可归，甚至没有可称之为家的地方，没有可称之为家人的人。然而你坚持往前走，饿了、渴了、累了、受伤了……但你从未停下，从未为任何人或任何事停留。
//
//这时你遇上了她。
//
//她看到你从远处蹒跚而来。她刚给自己的孩子们做好晚餐；当然了，可以分你一些，对吧？你还记得吗？
//
//她带你去家里，和你分享食物，给你新衣服，给你住所——她甚至把你留在身边，让你叫她“妈妈”。但你却称之为一段糟糕的回忆？
//
// 
//
//village.jpg
//已经很接近了！只差一点，我知道你可以的！
//
// 
//
//你想要一个新家，对吗？一个可以让你感到平静，远离心魔的居所？看到你现在这样受苦，我真的非常难过。恳求你接受我的提议吧，结束这折磨！
//
//你知道怎么找到我。
//
//你难道不希望逃到你亲爱的朋友身边吗？他们急切地守望着你，想再次和你玩乐，嬉戏。你亲爱的Emma，她只是渴望你的再一次触碰。你可怜的母亲，在床上啜泣了几个小时，只希望有天你能打开家门回到她敞开的怀抱。她也等待着你，她刚刚准备好你最爱喝的汤，摆在桌子上，想让你和其他家人一起吃，而你就这样打发了她，只是因为你可以。
//
//他们都希望与你团聚，就像你希望与他们团聚一样。事物的高纬度下，你对我来说稚嫩如孩童，你无法对我隐瞒想法。你的手在抖，眼里饱含泪水，我知道这种感觉，亲爱的；你想念他们。你极度想念他们，并希望能回到他们身边。我可以实现这个愿望，我可以满足你，我可以给你一个逃离这你游荡了如此之久的独特的地狱的机会。
//
// 
//
//lake.jpg
//那个可怕的日子……
//
// 
//
//你还记得吗？那个被诅咒的日子，让你几乎要结束这一切？你的心里没有任何犹豫，再次失去一切给了你太大压力，没有试图复仇，没有与那些给你带来如此痛苦的人斗争；你只是跳了下去，在短短几秒钟里放弃了你长久以来生活的世界。
//
//你期待着安静，或是水流在你身体周围旋转的水声。你以为你会闭上眼，让牙关松弛，在灵魂离开凡间的时候，拥抱死亡的冰冷抓握。但死亡没有找到你，相反你发现自己身处一个比地狱还糟糕的地方，一个由极尽人类意识所能调动的所有杂乱记忆组成的噩梦。你已经习惯这里，但一切可以更好。这里是一个避风港，所有不好的记忆都可以在这里找到永恒的归宿。都会好起来的，现在你可以来找我，我们可以达成契约，这样你最终就能拥有你应得的永恒的幸福。你难道不希望得到幸福吗？
//
// 
//
//wow
//应许记忆之城。
//
// 
//
//你的所有苦难都得到了宽恕，现在可以把它们抛之脑后了，你在自己制造的天堂里感到如此安心。现在快点吧，你的朋友还在等你。
//
//为你感到骄傲，我的小小模范。
//
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl160{}