//Level 106
// 
//
//生存难度：
//等级 4
//
// 
// 
// 
//Level 106是后室的第107层。这里被发现的日期不得而知，只有通过帮助者1和在他们帮助下逃跑的人才能知道里面的情况。
//
//Level 106似乎是一系列永无止境的走廊，所有这些走廊都通向各种家庭中的房间，例如卧室、客厅、储藏室和厨房。偶尔有例外，例如发电机房。
//
//描述
//Storage.jpg
//仅存的一张Level 106的照片，发现于Level 33。
//
//Level 106分为三个主要区域，每个区域似乎都是无限长，四层楼深。虽然每个区域都有相同的主题房间，但它们都逐渐变得更加腐朽。
//
//区域A：Level 106的区域A被认为是三个部分中最安全的，这是因为缺乏实体和维持群体的能力。这里的房间如下：厨房、储藏室、卧室，在极少的情况下，还有发电机房。该区域中的所有计算机或类似物品都处于正常工作状态，但是它们都被一个似乎不存在的密码或一个不断变化的密码锁定，因为没有多少黑客能够成功地将它们启动到引导窗口，所以得出了目前的结论。电视也是如此，但它们都被永久地调到了电影《马克·吐温历险记》片段的循环中。在那里，一个人物，实际上是魔鬼，对一群有知觉的粘土生物造成了巨大的痛苦。痛苦地杀死他们。在关闭之前，新闻总是以引用“假若我们有了他们的帮助，我们能做成更多”结尾。当附近没有人时，所有的电视似乎都关掉了。因此，如果你发现一个打开的，通常意味着“移居者”2在附近，或者曾经在附近。厨房里有各种各样的食物和水，电器都正常工作。尽管炊具似乎会自行启动和关闭，即使设定了时间，但它还会改变炉架的位置和加热温度；微波炉会设置一个随机的时间，等等。这个层级有灯，但不是所有的灯都能亮。虽然这个迷宫里没有一个房间是完全黑暗的，但也会有一些阴暗的地方。然而，谢天谢地，这里并没有隐藏任何秘密。至少在这里。
//
//区域B：Level 106的区域B略显危险。这里的房间与区域A的房间一模一样，但都比较破旧。墙纸从墙上脱落，水管里的水从天花板上滴下来，一些家具甚至被翻过来、毁坏或搬走，在木头或地毯上只留下模糊的轮廓。这些房间里的机器很容易出错，有些能启动，有些则不能。但是尝试启动它们在不止一个方面是一场豪赌，因为在Level 106的这个部分打开任何东西通常都会吸引实体。例如，实体有猎犬、笑魇，有时还有肢团。
//
//区域C：区域C是Level 106最危险的区域。这里的房间比其他区域更破旧，也被植被覆盖，从杂草到发芽的树木和丰满的灌木。在这个区域中没有光，实体无处不在。所有的房间都只有一些基本的家具，就连这些家具也都被毁了。这里有床架、书桌、空书架、柜台等等，但没有枕头、书籍、食物等更小、更独特的装饰品。这里的任何机器在退出之前都会关闭，这意味着照亮这一层的唯一方法是通过油灯、火、煤气灯等。穿越这里可能很有挑战性，因为当你试图逃离实体或只是正常穿越时，植被会挡住你的路，减慢你的速度或绊倒你。
//
//此层级有一种奇怪的效果，就是你感觉自己被人注视着，尤其是当电视打开和关闭时和使用其他机器时，或者当你到达区域C时。一份找到的文件将其描述为“好像有什么东西一直在你背后，你看不到甚至不知道。但它总是在那里。”这究竟是对一个人心灵的影响，还是更险恶的东西，目前尚不清楚。一些人认为它是一个生活在所有楼层的实体，其他人只是认为它是偏执狂或恐惧。
//
//基地、前哨和社区
//“移居者”
//移居者是一个由大约8-10人组成的群体，他们完全依靠Level 106区域A的资源为生，因为他们都缺乏深入B区和C区逃跑的勇气。他们用床单和沙发在大约1-3个房间里露营。在离开之前，他们对周围几个房间里找到的食物进行定量配给。如果你遇到他们，你可以随时加入和离开。他们接受的人数不超过10人，如果他们的人数少于8人，他们会更加急切地希望你加入。
//
//“帮助者”
//帮助者是一群帮助其他人的人，他们最终在这里逃跑。幸运的是，他们在一个楼梯和另一个楼梯附近找到了大量的楼梯，这给了他们一条通往较低楼层并最终逃生的捷径。从少数目击者的叙述和故事来看，帮助者和移居者并不知道彼此的存在。他们手头没有太多战斗力，反而在你逃跑的路上堵住了不必要的门口和房间。他们也很友善，只有在有理由的情况下才会咄咄逼人。他们只会给一个非常需要的人食物和水，因为剩下的是留给志愿者的。
//
//报告
//第一个表明该层级存在的证据是在Level 0地板上发现的一本日记。作者的遭遇不得而知，尽管他们似乎已经记录了他们在前厅的正常生活。为了简单起见，只给出了他们在Level 106的重要片段。
//
//“所以，我不知道我现在到哪里来了。这个奇怪的地方不能再奇怪了，单黄色的房间是明亮的，单黄色的房间是黑暗的，废弃的办公室，在其他地方，这个奇怪的迷宫式的不同风格的房间让我绕了几个星期。然而，现在，我到了一个新的地方。这个地方奇怪的是，我不记得如何……我想我现在就在这里。有卧室，一个有台球桌和电视的房间，一个厨房和其他普通房间，真的。我很乐意最终能找到出路。虽然我很担心，如果我甚至记不起我是怎么来到这里的，我就无法逃出。"
//
//“现在已经两天了，我试着用微波炉煮一些食物，但计时器设置为40分钟。在微波炉停不下来后，我带着一些饼干离开了房间。所以在那之后我就不管了，再也省不下那些面条了。”——虽然本段还有更多内容，但由于与整体无关，因此被省略了
//
//“我今天遇到了一群人！他们称自己为‘移居者’，很有趣！他们似乎是8个人，靠‘安全区’的食物生活。我问那是什么，他们解释说有三个区域达到这个水平。有一个部分是区域A，我现在所在的完全安全区。有一个部分是区域B，那里没有这么好的照明，还有实体盯着我看。然后是区域C，显然是逃跑的地方。虽然那里没有光，而且由于植物的原因很难穿过。当我问他们怎么知道这件事时，他们都悲伤而沉默。我认为这些线索可以串起来。"
//
//“我离开这些移居者已经有两天了。虽然他们有一个很好的社区，但我需要马上离开这里。到目前为止，我只是漫无目的地四处走动，我找到了带厨房的卧室、多个储藏室、几个电脑室和无数的走廊。到目前为止，我还没有遇到其他人。只有我自己。我打开电视，然后它只是播放了一些泥塑电影，其中一个戴着面具的家伙杀死了泥塑人物。不知道为什么，它一直循环。很奇怪。"
//
//“现在我似乎找到了一批全新的人！在经历了数周漫无目的的四处走动之后，我终于找到了一些新的人！这群人自称为“帮助者”，我问他们是否知道定居者，但他们说他们不知道他们是谁。因此，这个地方显然足够大，两个群体都无法接触。这里的人非常友好，甚至给了我一些水，这是我非常需要的。他们说，他们发现了一个有多个楼梯的区域，一直通到区域C，所以这就是出口。他们说让我休息一下。当我醒着的时候，他们会让我躺下。我现在正在睡觉前写这篇文章，让我们一起出去！"
//
//“多么忙碌的一段时间啊，在我醒来后不久，助手们立刻带我离开。一个叫Melody的好女人帮我离开了，她带我下了楼梯，经过一个发电机房和走廊，然后又下了两组楼梯。经过一个厨房后，我们下了最后一段楼梯，进入了我能想象到的区域B。灯时亮时不亮的，我偶尔能听到在这一小群人设置的路障后面有怪物的声音。穿过一些腐烂的房间，又走了四段楼梯，区域C就在眼前。这个地方到处都是植物，明显缺乏生命。3我看到一只长臂试图伸到Melody跟前，我穿过一个路障，它就够不到我们。这里的房间只有最基本的家具，即便如此，所有的家具还都坏了。空床架、没有书的书架、空橱柜和没有门的橱柜。只有黑暗和腐朽。手电筒熄灭了，所以我们不得不跟着一些放在地板上的油灯走。尽管如此，经过四层多的跋涉，我们还是到达了另一个楼梯。楼梯底部只有一扇门。Melody对我说，这扇门可以带我去很多地方，她祝我好运。我点点头，向她道谢，然后进了门。我回到了原来的黄色房间，房间里灯光嗡嗡作响，地板上有股怪味。”从这里开始，日记不再与文档相关。
//
//虽然有其他谣传是关于此层级的文件被发现，但这是最著名的一个，除了附在Level 33信件上的图像。考虑到这封信提到了Level 106的布局，以及作者在区域B发现了一个微笑者，在C部分发现了无数的肢团，因此从理论上讲，这幅图像就是拍摄于此层级。
//
//薛定谔式实体
//薛定谔式实体是一个非常神秘的实体。薛定谔式实体是对于一个或多个未知是否存在的实体的称呼，相关的留言声称假若这些实体存在，它们将会把人带入该层级以及监视这些进入者，假若它们不存在，那它们也都不是。表明其存在的唯一证据是：
//
//你被监视的感觉
//只要周围没有人，电视就会关掉
//人们是如何在这个级别上随机出现的
//一份文件的发现表明，该实体不断更改计算机上的密码或电气设备上的设置
//另一份文件还指出，电视上的视频是如何链接到Level 106的，在那里，一个粘土人看不到的奇怪实体被它折磨。“假若我们有了他们的帮助，我们能做成更多”这个引用文段可能可以在如此多的人死亡之后解明人们是如何来到这个层级的。
//到目前为止，薛定谔实体被视为不真实的唯一原因是缺乏真正的探索和证据，除了目击者的描述。
//
//入口与出口
//入口
//虽然人们似乎经常到达这里，但进入的方式目前尚不清楚。这里有足够两组人居住。
//
//出口
//唯一已知的离开此层级的方法是到达C区的最后一个楼梯，这个楼梯似乎能把人们带到不同的Level。不同的报告称可以传送到Level 0、Level 4、Level 13、Level 26和Level 33，还可以传送到更多层级。
//
//作者信息
//« Level 105 | Level 106 | Level 107 »
//
//Footnotes
//1. "The Helpers"，暂译为“帮助者”
//2. "The Settlers"，暂译为“移居者”
//3. The place was ridden with plant life and a distinct lack of life.原文如此。 作者似乎认为植物不是生命。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl106{}