//Level 138
// 
//
//生存难度：
//等级 3
//
// 
// 
// 
//138
//Level 138中一条小巷。
//
//Level 138是后室的第139层，看起来像是一条狭窄的复合体，其内部的霓虹灯的文字以日语、英语和韩语书写。
//
//描述：
//Level 138是一条无限延长的狭窄小巷，其上方永久性处于夜空，其灯笼上的文字以日文、英文和韩文书写，并遍布整个街道，最常见的入口在居酒屋酒吧、咖啡店、商店以及餐馆。尽管这些建筑内部经常居住着许多实体，然而，其中一些地方依旧存放着前厅中常见的生活用品，因此让该进入方式是冒险的。可以用多种方式进入这些建筑内部，最常见的是通过切出Level 178的方式或在Level 34里找到梯子。由于在各个地方都有返回Level 138的入口，因此很容易切出该层级。
//
//该层级不会出现昼夜交替的现象，无星的夜空会永远在该层级上方徘徊。地面上偶会有水坑出现，这表示该层级曾经历过暴风雨天气。即使附近市集或餐馆里没有食物或饮料，流浪者也能闻到满腔满腹的茶叶或肉类的温暖香气。带有平假名与汉字的灯笼十分常见，这些灯笼最普遍的颜色为橙色或红色。有一些小巷的外观更为传统，由木制结构的建筑和较少的电灯组成，而另一部分则看起来像霓虹灯城市街道。不应该在停车场内使用所看到的自行车，因为当流浪者坐在自行车上时会在其附近生成一个实体。
//
//许多实体可以在空荡荡的酒吧和商店中筑巢或在街道上徘徊，尽管大多数都在建筑物内部。在该层级中最常见的实体是穿着浴衣与和服的无面灵、猎犬、地栖怪以及蠕灵。
//
//基地、前哨与社区：
//神会
//位于Level 178中一入口附近的连接至购物与餐厅复合体中，以帮助流浪者进入Level 178，并协助有需求的人在Level 138中探索。
//他们的补给品由天照寮所提供。
//经营着一家名为“黄金街边小吃”的餐厅，其食谱上的食材来自于Level 178的厨房。
//一个从该区域内分离出的基地，以便于帮助那些希望在Level 178中永久定居的流浪者。
//该基地内部的居住人口为15人。
//其首领名为Aadhira，是天照寮的领袖Irawan的妹妹。
//入口与出口：
//入口
//进入Level 138最常用的方法是在Level 178中探索几周，最终会看到一个带有出口标志的房间，该房间会通往Level 138。进入后，流浪者所离开的木制结构建筑物会留在原地，整个层级散布着木制町屋，这些建筑物都通向Level 178，这证明该层级的出入口具有一定的稳定性，而许多层级都缺乏这种稳定性。其他进入Level 138的方式是在Level 11中走得足够远，并能看到一条上面挂着霓虹灯笼的小巷。若在这条小巷中走得很深的话，就会达到Level 138。另外还有罕见的进入方式是在Level 34里找到一个通往上方舱口的梯子，将会达到Level 138。
//
//出口
//离开Level 138最常用的方法是找到分布在各处的木制町屋建筑物之一。由于位置固定的原因，很容易找到这些房子。其他离开Level 138的方法是找到带有日文、韩文或英文的路标，其箭头上面写着“富士”，并指向左侧方向，沿着路标方向行走后将达到Level 183。另一种罕见的离开方法是进入一家便利店的员工房间，并关上身后的门。在员工房间内等待几个小时，然后打开房门，就会达到Level 176。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl138{}