//Level 154
//
//
//
//Level 154
//
// 
//
//生存难度：
//等级 5
//
// 
// 
//低实体计数
//描述：
//level154a.png
//一扇圆圈的门。
//
//Level 154 是一个极其危险且可能致命的层级，在后室中作为神秘“激光游戏”的地点而存在。其外观为由完全相同表面漆黑的石墙所组成的近乎无限的迷宫，并有着自头顶的灯泡处传出的黯淡彩色灯光。该层级的主要特性为存在数个宽广开放的房间，通过由外表漆有彩色标志的门进入。此些宽广开放的房间即为游玩激光游戏的地方。
//
//此层级可被分为两个不同的区域：走道与激光房。走道包含多条如巨型迷宫般扭曲蜿蜒向无穷尽方向的石制走廊。每一条走廊都是空的，完全没有任何实体或装饰布置，但地面上会有随机出现的灰尘微粒、木质颗粒以及碎玻璃。走廊内的温度总为潮湿微温的，但在靠近激光房的位置温度会有轻微上升。可以利用此区别来辅助定位标志门。
//
//地板、墙壁与天花板都为全黑，使其非常难以导航与分辨。十分不建议在未携带任何人造光源，诸如手电筒、手机或火柴的情况下探索此层级。由于此些走廊的迷宫特性，同时也建议带上大量的火药、面包屑或是其它可用以造出走过的地点标记的物品，以使得不在走廊中迷路。
//
//在进入 Level 154 后，最优先所做的应当是寻找带有标志的门。唯一已知离开 Level 154 的方法就是穿过这些门。尽管这些门出现的频率不低，但也是相当罕见。由于 Level 154 的走廊中没有食物或水源，最重要的一点就是尽快寻找一扇门，以避免死于饥饿或脱水。若能尽快行动，其应能在死亡之前找到至少一扇门。然而，虽然每扇门都有着一个出口，但到达此出口所需的步骤却因门而异，所以建议流浪者搜寻与其所持技能最相符合的门，即使这需要跳过另一扇符号门。
//
//4789607694_8e95ed4fa7_b.png
//两个正在直线房间尝试激光游戏的流浪者。
//
//在每扇门的后面都是“激光游戏”，在此是一个宽广开放的房间，房间中央有一个基座。基座的顶端为一面挂旗，被制为所进入的门上的标志形状。其面朝方向与性质根据门的不同而有所区别，但总会有数道红色激光散满整个房间，阻止流浪者触碰挂旗。激光游戏的目标就是在不触碰到激光的前提下抵至挂旗处并将其从基座上取下。触碰激光会触发不同的效应，但其都能够造成至多四级烧伤。用身体部分触碰激光将造成皮肤的解裂，并可同时在暴露于激光中的数秒内造成肌肉与神经组织的损伤。若能够在不被激光击杀的前提下抵至挂旗处（在被击中后仍有可能做到这一点，只要其还能够移动），则游戏被算作胜利，触碰到挂旗的流浪者会被传送至外界。挂旗将随后立即被层级中一个完全相同的复制品替换到基座上。
//
//直线房间
//
//直线房间可于漆有浅蓝色粗竖线的门后找到。此房间包含有静止且永不移动的激光。此处的激光将严重损害任何碰触其的人员，并几乎在接触的同时令其造成三到四级烧伤。同时每一个直线房间实例内都包含有一个巨型计时器。计时器悬停挂于远端的墙上，恰好位于基座与挂旗的后方，显示着剩余的秒数。其从 60 秒开始倒计时，且将在某人进入直线房间之后立即开始倒计时。这标志着游戏的开始。在游戏过程中，通向直线房间的门将自动锁定。若有人无法在时间结束前抵至基座前并取得挂旗，则基座与挂旗都将通过未知的机械装置缩入地板内，激光将被关闭，且游戏将被认为失败，此时门将自动解锁。
//
//在游戏失败后，流浪者将需要寻找一扇不同的门以获取另一次离开 Level 154 的机会。由于此机制的存在，有相当的几率会出现由于此前有过失败尝试导致直线房间一无所有的情况。若有人找到了一个空的直线房间，那么其可以直接离开，因为游戏并不会开始。由于有较大的可能性遇到死路，因此不建议去积极寻找直线房间。
//
//当一名流浪者抵至含有挂旗的基座下并将挂旗取下基座后，游戏即宣告胜利。直线房间是房间中规则最简单的一种，且亦被认为是最容易通关的一种。没有需要留意的其它特殊隐藏机关或是意料之外的扭曲，所以如果有人能够找到一间正常运作的直线房间，那通常去尝试一下也是安全的选择。
//
//shapeshifterslogoline.png
//圆圈房间
//
//圆圈房间可于漆有黄色圆圈的门后找到。与直线房间相似，门将在游戏开始时猛然关闭并锁定，将流浪者困在内部，直至游戏胜利或失败。与直线房间相似，当抵至含有终点挂旗的基座下并将挂旗取下基座后，游戏胜利。然而与直线房间不同的是，圆圈房间的激光是始终在运动的，尽管比较缓慢，且没有计时器。相反，流浪者可以有无限的时间完成圆圈房间。圆圈房间也是较小的房间之一，且因此需要避开以抵达终点挂旗的激光数量也更少。
//
//圆圈房间能成为可通过版本激光游戏的其中一个关键特性是，圆圈房间内的激光是整个层级中最弱的。与圆圈房间内的激光进行短暂接触将通常导致两到三级烧伤，而不是通常的四级或五级。在意外碰触一次圆形房间内的激光后，流浪者完全有可能仍然离开且不留下永久性组织损伤。由于此原因，很推荐那些对自己的能力不自信的人尝试圆圈房间，而不是去别的更加专业的房间。
//
//由于其激光较弱，用不反光的材料阻挡某些激光也是可能的。如果能拥有粗厚坚实的物体，比如一把椅子或一张凳子，那么就可以用此阻挡激光，无需依靠敏捷穿行。此种策略在其它房间并不可靠，因为那些激光的威力足够偶然洞穿即使是如上例般坚实的硬质物体。如果流浪者能够遇见此种物体，那最好的选择就是去寻找圆圈房间。
//
//shapeshifterslogocircle.png
//三角房间
//
//三角房间位于漆有红色三角形的门后。由于其为房间之中最小的，三角房间亦是最危险的一个。此处的激光极度强烈，即使是最为轻微的接触，也能够造成严重的神经与肌肉损伤。
//
//虽然如此，但是三角房间的目标是很独特的，且在有了必要的防范与准备的情况下，三角房间对于某些想要完成的人来说也可以是最简单的房间。三角房间并不需要灵敏的身体来穿越满是激光的房间，其仅由一个谜题构成。房间内有于随机方位放置的七个固定的三角棱镜，并有一束激光自入口左边的墙上射出。每一个三角棱镜的外形都是完全相同的：四英尺高一英尺宽。于房间的角落有三面镜子。位于房间中心的是三角挂旗，被透明的箱体封死着。唯一已知移除箱体的方法是，通过调整镜子的方向使得激光能够转向通过全部七个棱镜，在激活棱镜后，箱体即会被升起，直至挂旗被取下。
//
//当流浪者进入三角房间后，其便无法在谜题被解开前离开房间。门将立即锁定。三角房间仅应由那些对自己解决问题的能力有自信的人进行尝试。此外，虽然仍未被证实，七个棱镜方位的随机性使得理论上某些三角房间是不可能被完成的，且将因此成为死亡陷阱。由于此种可能性，三角房间是不被推荐尝试的。
//
//kh3tkg.png
//正方房间
//
//流浪者可以通过漆有绿色正方形的房间的门进入正方房间。仅根据正方房间的描述，通常似乎是不可能自正方房间离开层级的，但亦有数名曾进入正方房间的流浪者报告表示能够将其完成。此些流浪者离开层级的方法仍未可知，因其全都坚决拒绝透露此些方法。或许在不知道如何从正方房间离开层级的前提下进入正方房间才是将其完成的关键。虽然有着数次成功尝试，但仍推荐流浪者为安全起见远离正方房间。
//
//正方房间的布置总是相同的。房间的区域总恰为正方形，且正方挂旗被锁于自地板射向天花板的无隙激光墙。激光间的空隙极小，没有任何人类可以在不受到严重伤害的前提下穿过空隙。第一眼看来，正方房间似乎是无解的。此外，门将在进入正方房间后锁定，所以离开并不在选项之列。似乎此挑战有着更多的东西能让参与者成功将其完成，但截至目前，我们仍没有那些物品的可能信息。
//
//shapeshifterslogosquare.png
//五角房间
//
//五角房间可以在外部漆有粉色五角星标志的门后找到。此房间是目前规则最简单的一个房间，但根据流浪者的不同也可以是极为困难或极为简单的。五角房间亦是最大的房间，推测有数米长，可能有上百米。
//
//在进入五角房间之后，流浪者所需要做的最重要的事就是立即快速奔跑。若要通过五角房间，流浪者必须自房间的开始端冲向远端并尽快取得挂旗。靠入口的墙上有一个包含两片薄平台的自动装置，连接着跨越房间天花板与地板的线缆。在进入房间之后，自动装置将启动并生成一面自顶部平台延伸至底部平台的激光墙。其将随后开始向房间远端移动。若流浪者跑得不够快，那么激光将追随而上并极有可能对其造成严重伤害或死亡。五角房间是对身体能力的最简单测试。若有流浪者觉得认为自己是个极速跑手，那么五角房间则是一个万全的离开方法。对于不是极速跑手的流浪者来说，五角房间则意味着绝对的死亡。
//
//shapeshifterslogopentagon.png
//入口与出口
//
//
//
//入口：
//
//Level 154 仅可从 Level 1 进入。若想寻找入口，仅需寻找发着浅蓝光、蓝光、黄光、红光、绿光或粉光的多色荧光灯即可。跟随这些灯光穿过走廊，最后会将你带向与位于 Level 154 之中完全相同的带符号的门处。进入任何一扇门都会将流浪者传送至 Level 154 的走道区域。
//出口：
//
//Level 154 仅能通过于五个房间变体的任何一个中触碰并取下挂旗离开。取下挂旗会将流浪者带回 Level 1 中与其离开房间对应的门前。离开 Level 154 的每位流浪者都可以保留其取下的挂旗。未观察到挂旗有任何奇异特性，但多数流浪者都决定将其携带以作为一种战利品。
//shapeshifterslogo3.png
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl154{}