//Level 188
// 
//
//生存难度：
//等级 5
//
// 
// 
// 
//Level 188是后室的第189层。其被发现于2009年2月5日。现认为此地是被称之为“窗户”的实体热点区。幸存者将其称作百窗庭。
//
//188.jpg
//Level 188，摄自某一高处窗口的内部。该相片的拍摄方法未知。
//
//描述：
//Level 188的形式为一座大型建筑物，并在其中央带有一个五边形的庭院。在任意时段，墙壁上都会出现约90-200个窗口，尽管其中的绝大多数都处于“非活性”状态。窗户的内部将被百叶窗覆盖，而活性窗户内部则存在某种光源以及一个实体。
//
//Level 188庭院中的高墙不含任何房间，假若窗户并不存在，那么墙壁将是光秃的，无任一入口点或是出口点。无从确认这些墙体是无限的厚度、抑或是在其后方存在有某种形式的空间。天空往上看去是无穷的黑暗，尽管有人声称在庭院里目击了Level 24。
//
//多人认为地板上的草坪实际上是一种生长于混凝土地板的苔藓。同时，其中一侧的墙壁上还有着一组管道。产生自这些管道的液体并不能安全饮用。有理论认为Level 188中央的大型木圈是一扇通向另一层级的活板门，不过该理论尚未得到验证。
//
//基地，前哨和社区
//该层级不存在已知的基地、前哨和社区。
//
//入口和出口：
//入口
//到达Level 188的唯一已知方法是进入出现在枢纽中的一个窗口。然而，此举极为危险，因为大多数窗口中都包含有一个未知个体，并且能够发起无法预测的袭击。进入枢纽的窗口将有直接抵达Level 188某一窗口的微小可能。
//
//出口
//离开Level 188是有可能的，但是非常危险。你每进出一次窗户、你毫发无伤地回归之机会就越来越渺小。离开Level 188最为相符的方式是穿过那扇你进入此地时的窗口，尽管你很有可能无法退出。而你最好的幸存机会就是躲避所有窗户。它们总会是陷阱。祈祷吧，试着走进你来时的窗户。要是你看到有五彩纸屑从窗户里飞出，那么里面就有一个派对哦！=）
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl188{}