//Asset 194 - “梦幻庄园”
//评分: 
//+8
//+
//–
//X
//Asset 194
//未经不结盟贸易集团的明确许可，不得共享或复制本文档
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//Asset194_StructPrime.png
//放置了访问节点“Calatrava."的建筑物的外部视图
//
//价值: 中等
//
//优先级: 低
//
//描述： Asset 194 主要由位于山脚下的一片约 50 英亩的亚热带雨林组成。该层级的真正大小尚未确定，但据推测，它的边界是其旁边的山。该层级气候温和，同时，该层级无敌对实体，这使其成为一个安全的定居处。与此同时，雨林内有多个瀑布，游泳池和超现实主义建筑，这使其成为希望放松身心的流浪者的常见景点。
//
//虽然这些建筑中的大多数仅仅提供了很少的生活空间，但其中的许多都适合短期的可持续的生活，同时，这里也有着良好的环境。这些因素使得许多人希望在这个层级内短时间居住，尤其是那些主要生活在如Level 11一样的高度现代化的层级内，并正在寻找一个更有自然气息的环境的人。
//
//Asset194_Calatrava.png
//从主体建筑内部看到的访问节点“Calatrava.”
//
//Asset 194归B.N.T.G.所有，因此希望在该层级中度过一段时间的人须给予B.N.T.G.一定的不可转让且不可退还的信用点数，以获得一个或多个建筑物的临时所有权。支付的价格由建筑物的大小，复杂性和可居住性决定。
//
//那些希望住在层级中的人也可以要求获得一座他们预先设计的建筑物，B.N.T.G.将会努力“创造”这些建筑物。由于Asset 194的奇特特性，创建新的建筑物并不需要用真实材料来建造。该层级的中心是一个大型的堡垒状建筑，其中包含一个称为“Calatrava."访问节点的机器。该机器中有以数字形式保存的该层级的建筑物数据，并且可以下载和编辑该层级的“蓝图”。
//
//Asset194_CalatravaInterface.jpg
//正在使用的Calatrava.lvl 的一个示例。建筑物在该软件中显得更加抽象;此示例显示了一个名为“1473 乡村教堂”的预设模型的数字格式。
//
//该访问节点含有一个无品牌的USB驱动器，当其插入计算机时，用户将可以访问层级的建筑物数据。除了这些数据，还有一个名为“readme.txt”的文件，其中包含有关如何使用该软件的说明以及其可能的创建者留下的消息。
//
//该消息的作者名为“Miriam”（风格化的“MIRIXM”），其所在地尚未被找到。其所在地在邮件中称为“Lazarus峰”，该地点并未出现在任何团体的档案中。找到Miriam并不是B.N.T.G.的当务之急，尽管其对该层级的影响力仍然未知。
//
//readme.txt
//嗨嗨嗨，是我！如果你还不知道我是谁，那么那是你的问题，而不是我的问题<3。所以我猜想，如果你读到这里，那就意味着你偶然发现了calatrava！如果不是因为我无法让该死的抹除系统运行的话（如果它突然启动并且有人死了，那么这当然不是我的错，笑死），接下来会有一个诚挚的祝贺。
//
//所以，因为这个错误，我猜，想自定义这个层级就只能先到先得了。至于如何使用它，我会简单明了地告诉你。首先，你需要熟悉操作步骤。启动calatrava.lvl，按“开始”，你离自定义自己的层级又近了一步！我好像有点把它卡在森林里面了，所以……很……唉……尴尬，哈哈。
//
//至于如何添加建筑物和其它东西，这实际上就像找一些预制模型并将它们放在你喜欢的任何地方一样简单！整个建筑显示为一个网格矩阵，所以需要一些直觉才能得到它正确的位置，但是一旦它平稳落地，你就可以放心离开了！然后，继续将数据上传回calatrava！单纯选择一个不错的空位就行，嘿，你会吗？
//
//现在显然我们必须制定一些基本规则。我真的不能阻止你做任何这些事情，并且，嘿，这关我啥事
//
//1. 这个地方的入口和出口几乎是一成不变的，所以请注意，任何人都可能偶然进入这个地方。考虑到这一点，请确保您创建的内容是您不介意大量人看到的东西。
//2. 在你阅读这篇文章的时，这可能看起来不值得一提，但为了所有不圣洁的爱，你最好不要创造任何可能破坏这个地方的东西。森林砍伐只是在之后的一会才很有趣，之后它只会令人悲伤。
//3. Tel，如果你正在读这篇文章，你应该不会很开心。老子已经多少次告诉过你不要再碰老子的东西了。
//
//但是，是的，呃，除此之外，随便干吧！做你想要的，我真的不在乎。一如既往，如果你需要聊天，我会在Lazarus峰等你<3
//
//-爱你的 MIRIXM
//
//cicadascii.png
//Asset194_HorizonRender.jpg
//从目前最高的建筑顶部拍摄的Asset 194的地平线视图，可明显观察到瓦解现象。
//
//从远处看时，Asset 194的山脉似乎正在慢慢溶入天空。B.N.T.G.普遍认为，整个Asset 194，而不仅仅是其中的建筑物，都是由Calatrava产生的，并且该层级正在慢慢开始丢失其“内存”。消失的速度尚不清楚，但预计在很长时间内都不会影响主要森林地区。
//
//入口和出口： Asset 194 可以从 Level 10 进入（在 B.N.T.G. 的Level 10 资源站周围的田野发现了一个可靠的入口）和 Level 128（走进柱子偶尔会通向随机建筑物的内部）。建议客户在他们的资产中保持谨慎，因为有可能被随机传送到Level128。其他出口包括Level 9和Level 37，尽管这些出口似乎不是一成不变的。在森林地区徘徊足够长的时间，您可能会发现自己处于这些层级之一。
//
//值得注意的事情：
//
//到目前为止，B.N.T.G.已经在该层建造了41个不同的建筑，其中29个由客户拥有。虽然客户可以自由地提供他们认为合适的房屋设计给我们，但Asset 194中所有建筑物的结构数据均由B.N.T.G.独家管理，客户无法从根本上改变或定制。
//
//Asset194_Sink.jpg
//建筑物的内部，配有一个功能正常的水龙头。
//
//描述: 一座2层楼高的砖和混凝土建筑，配有连接到附近河流的管道系统。内部装饰较少，仅配有最基本的必需品：用于洗澡的水龙头，客户提供的床垫以及用于储存水和不易腐烂食物的小存储区。
//
//价格: 730 B.N.T.G.点数。
//
//附注: 无。
//
//Asset194_Front.jpg
//该房子的门廊的景观，其以石柱和各种植物装饰。
//
//描述: 一座类似于超现实主义平房的单层房屋，在房屋周围和屋顶上都装饰着多个石柱和石拱。建筑的前后都有平板玻璃窗和木门，其内部有完全可持续，原始的能量来源。
//
//价格: 1215 B.N.T.G. 点数。
//
//附注: 这被客户用于永久居住而非作为其次要地产。
//
//Asset194_Callisto.jpg
//一张Callisto的照片, Callisto是它的俗称。
//
//描述: 一个高大的蜿蜒楼梯，其会通向中间和顶部平台。该建筑物由多个支柱支撑，并被较小的装饰性建筑所包围。该地区杂草丛生，偶尔会阻碍攀登，但是没有人试图清除它。
//
//价格: 436 B.N.T.G. 点数。
//
//附注: 此建筑物已被用于大量活动，包括所谓的婚礼仪式。它已经变得如此受欢迎，以至于B.N.T.G.已经讨论过向那些希望在Callisto上举办团体活动的人收费。
//
//Asset194_Bowl.jpg
//一张碗的照片
//
//描述: 一个大的卵形混凝土碗，放置在层级发现之前生成的建筑物的边缘。
//
//价格: 14 B.N.T.G. 点数。
//
//附注: 目前只有买家被看见使用过它，他偶尔会来碗这里，并且一次最多坐一个小时。当被问及此事时，他回答说：“我喜欢一动不动地坐在碗里，假装我是一个温暖柔软的饺子。它确实为心灵创造了奇迹，你懂的。”
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl194{}