//Level 119
// 
//
//生存难度：
//等级 4
//
// 
// 
// 
//newlvlmaybe.jpg
//滑梯，Level 119的唯一已知照片。
//
//Level 119是后室的第120层，由Reddit用户u/chianticat10于2020.6.29发现。
//
//描述:
//Level119与Level 58十分类似，似乎是一座废弃的水上乐园。它含有无数的滑梯，有些在乘坐时具有特殊效果。虽然没有滑梯的外表是生锈的，但由于某种原因它们内部锈迹斑斑，此原因未知。
//
//此层级对神智有独特的影响效果。处于这一层级时，你的神智会随机地逐渐增加或降低。导致此现象的原因未知，有些人猜测是因为某物在注视你，并随心所欲地搅乱你的神智。这种说法未被确认，也缺乏足够的证据，因为只有两个人提到过它。
//
//有时你乘坐滑梯，会在滑梯上方或下方见到眼睛。它们最有可能是你神智降低而产生的幻觉。多数时候你不会见到它们，原因如上文所述，此层级对神智的影响是随机增加或降低的。
//
//另一种独特效果类似于Level 777的赌场，有些滑梯会随机在一眨眼间消失，有些则会出现。滑梯中的人会摔死，除非他们没有处在会导致摔伤或死亡的高度。
//
//这些滑梯有时会卡进其他滑梯，导致从中滑下变得不可能。如果你被堵在卡住的滑梯中，你所在的位置（可能极为狭小，因为多数滑梯并不宽阔）将会涨水，原因未知。然而你会更加缓慢地失去氧气，导致窒息死亡的过程更加漫长。虽然此事件发生的概率极小，但它随着你在Level119停留的时间增加而增加。
//
//滑梯效果列表
//此层级大约含有982种滑梯类别，为方便起见，我们只记录了其中最常见的。不要试图走进没有被记录的滑梯，它们很可能是危险的。
//
//蓝色滑梯
//总是把你传送到蓝色通道。
//红色滑梯
//派对客大量出没=)，进入红色滑梯是不明智的。
//除了大量的派对客，无其他效果。似乎派对客选择红色滑梯的原因在于它们不产生效果。
//黑白相间的滑梯
//立即死亡。
//黄色滑梯
//把你传送到Level 0。黄色滑梯被认为是此层级中最安全的滑梯。
//漆黑的滑梯
//大量的笑魇。
//如果你以某种方式在笑魇群中活了下来，你会被传送到微笑房间1的正中心。
//橙色滑梯
//有确切的50%几率把你传送到Level 2.2或巢穴。
//粉色滑梯
//召唤约3-4个派对客至此层级。别担心，这个滑梯十分安全！=) 我们不会伤害你。=)
//灰色滑梯
//滑梯里的小孔中充满了各种污物。
//米色滑梯
//把你送到终点，进入是不明智的选择。米色滑梯会频繁地卡进其他滑梯。
//实体
//偶尔会见到笑魇和派对客在此层级游荡。
//
//基地、前哨和社区
//此层级无已知基地、前哨和社区。
//
//入口和出口:
//入口:
//你可以在Level 11找到一家供水商店，它有个古怪的名字“Alom Wotor”。进入这家商店会导致你昏迷，最终在Level 119醒来时出口已经消失。
//
//出口:
//上文已列出，你可以通过许多滑梯离开。一种不需要坐滑梯的方法是：行进约91.78千米并找到一扇玻璃滑门，你会到达Level 11。
//
//作者信息
//« Level 118 | Level 119 | Level 120 »
//
//Footnotes
//1. 译注:
//The Smiling Room，笑魇的基地。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl119{}