//Level 151
// 
//
//生存难度：
//等级 转译错误
//
//猴子追着黄鼠狼
//猴子停下来提袜子
//啪！黄鼠狼跑走了！greathall.jpg
//这是Level 151的一个房间，我们用它放玩具。
//
//Level 151是后室的第152层。来和我们一起玩吧。
//
//描述：
//Level 151是一个巨大的、真人尺寸的娃娃屋，像是英国都铎时期的宅邸，看起来保存完好。我们仍不知道它是如何保持整洁的。
//
//据估计，Level 151的面积为7500平方英尺，且很有可能存在更多目前无法进入的区域。1
//
//进入Level 151时，流浪者一般会发现自己处在一个开阔的大厅中央，或在某些情况下出现在地窖里。层级中大多数的光源看起来具有时代特色（例如蜡烛、壁炉和火把），然而，它们其实是假的。这些蜡烛和火把巨大无比，它们并非熊熊燃烧着，而是以内置的LED灯模仿火焰光芒。在Level 151也能看见一些过时的舞台灯光。仔细观察壁炉，流浪者会发现它们其实是印有燃烧的煤炭的大型图片，而壁炉架则是涂上了金属漆的塑料。
//
//许多房间都有窗户，它们可以被砸碎。不过，这些窗户也是假的，窗外并无他物，只有一片白（或黑）色雾气。若留心倾听，可以听见缓慢而微弱的尖叫声在雾中回响。试图穿过浓雾逃跑的人会被强制送回他们在此层级最初到达的房间。2
//
//Level 151存在昼夜循环。
//
//白天，宅邸的大部分灯不发光。上文提及的窗外雾气持续散发出明亮的白光，这是白天的主要光源。卧室在白天被砖墙隔开，无法进入，直至夜幕降临。3
//
//在夜间，外面的雾会完全变黑。它的黑暗程度堪比Level 6，即完全漆黑一片。墙上的蜡烛和火把在天黑时会同步激活，发出冰蓝色的微光。那凝视般冰冷的光线使心灵枯萎，溺于黑暗。此时卧室、地下室和阁楼都可以进入。在这段时间内，多个秘密通道、活板门和绊网将会开始运作。房间和走廊会周期性地来回移动，伴随着让人联想到锯木头的巨大噪音。
//
//然而，多个命名为“玩偶”的实体在此时变得活跃。
//
//实体：
//目前唯一在Level 151被探明的实体是玩偶。
//
//玩偶
//“玩偶”是真人大小的荷兰洋娃娃，具有日耳曼风格。它们只出现在Level 151。据此推测，它们很可能像其他流浪者一样被困在玩偶之家里。
//
//在自6:00始至18:00终的人为白昼期间，玩偶是被动的实体，不会接近人类，它们的存在甚至很难被探测到。人们经常看到它们坐在大厅的餐桌旁，或者懒洋洋地站在不同的房间里。
//
//然而，在夜间，它们会变得具有攻击性。起初这些玩偶似乎是固定不动的，然而这只是错觉。只有当人类（在他们视线内）移动时，实体才会以相同的速度移动，无论目标的体型如何。若玩偶发现一个流浪者，它们就会“锁定”他。一旦发生这种情况，玩偶就能够得知此人何时移动，无需再与目标保持视觉接触。
//
//仅需一次触碰，玩偶就可以完全控制目标。如果一个玩偶抓住了一个流浪者，它们可能会做出不同的行动。最常见的情况是，玩偶会宣布流浪者是它们的“玩具”，必须存放起来，因为“游戏时间已经结束”。然后，他们会试图把受害者塞进玩具箱，把玩具收起来，这会把受害者压死，让他们非常高兴。在其他情况下，当最近的玩具箱装满时，玩偶选择用玩具武器攻击流浪者，将玩具捐赠给慈善机构。虽然这些武器看上去只是浮夸的超大玩具，它们的功能与真的武器正常玩具完全相同。
//
//在极少数情况下，如果被激怒，玩偶会折断受害者的脖子。折断玩具，因为我们不想再和他们玩了。
//
//玩偶具有一定的语言能力。它们会发出孩子般的笑声，哼唱各种童谣。《柑橘和柠檬》、《啪！黄鼠狼跑了》和《编玫瑰花环》似乎是它们的首选。
//
//附录：玩偶具有高度智能，有知觉，能够自由思考。这些玩偶通过未经证实的方式获得了对M.E.G.数据库的访问权（见探索日志），并开始编辑本文。纠正这些错误只会导致文本被进一步篡改。
//
//基地、前哨和社区
//Level 151没有已知的基地、前哨或社区。
//
//除了玩偶，他们欢迎你留下来！遵循我们的指示，做一个乖玩具，你就不会被伤害。
//
//探索日志
//关闭 dollhouse_exp-log_1.docx
//序言：以下语音记录了玩偶之家行动，该行动由M.E.G.小队████执行。19年3月7日，三名特工，特工Valentine、特工Jones和特工Barrister，被派往Level 151进行第一次官方探索任务，研究传说中的玩偶实体。在录音的时候，玩偶被简单地称为“实体”。
//
//17:42
//*门打开的吱吱声*
//
//17:43
//特工Barrister：就是它。Level 151。注意后方，这里可是恐怖谷。
//*松动的地板嘎吱作响，接着是一声巨响*
//特工Valentine：啊！你也得小心脚下！
//
//17:46
//*木头刮擦声的回声*
//特工Valentine：那是什么？
//特工Jones：可能是附近的实体。我查看一下平板电脑的雷达。
//*探测器嘀嘀作响*
//特工Jones：雷达没有探测到任何东西，附近只有三个点——我猜是我们。
//特工Barrister：猜测并不令人振奋，Jones。我们对这个地方了解得越多越好。
//
//17:54
//*沉重的下楼梯的脚步声回响着，接着是玻璃的回声*
//特工Barrister：这些蜡烛看起来……大得可笑。几乎像个玩具。
//特工Jones：谁会玩这个？我认为我们之前看到的那些巨大的玩具箱是一个更明显的暗示。
//特工Valentine：但是你看到那些壁炉了吗？它们甚至都不是真的！我知道这些层级很诡异，但这些有什么意义吗？
//*回荡着孩子般的笑声*
//特工Valentine：那是什么鬼东西？实体？
//特工Barrister：是从那边传来的。我们应该去看看。保持冷静。
//特工Jones：雷达还是没有发现东西。你确定那是实体，而不是什么幻觉吗？
//特工Barrister：只有一个办法可以知道。
//特工Valentine：说真的，我有种糟糕的预感。如果我只是个普通的流浪者，我会立刻朝着反方向跑。
//
//17:57
//*双开门打开时发出的吱吱声*
//特工Barrister：看起来像个餐厅。
//特工Valentine：那些是木偶吗？坐在桌边的？
//特工Barrister：超大玩偶。大部分流浪者说实体是真人大小的玩偶，这条被证实了。
//特工Jones：雷达探测不到它们。我们到底该怎么办？继续观察吗？
//特工Barrister：别靠太近！
//
//17:59
//*相机快门的咔哒声*
//特工Barrister：我是████小队的特工Barrister。开始报告：我们遇到多例未命名实体T-151。4实体似乎是真人大小的玩偶，可能是日耳曼式的。我们不确定实体是否可移动，但它们目前看起来很温顺。实体之间似乎通过未知的方式进行交流。我们已经制定了637号安全协议，意味着我们要与实体保持不少于3英尺的距离。我们必须进行进一步的检查，以确定T-151实例是否对人体有害。报告完毕。
//*相机快门的咔哒声*
//特工Valentine：你觉得它们知道我们在这里吗？
//特工Barrister：我不确定我想知道。
//特工Jones：我不认为激怒我们不了解的东西是一个好主意。记得当——
//
//18:00
//*窗户突然关上的声音，接着是笨拙的脚步声，伴随着木头的刮擦声*
//特工Valentine：什么鬼？！我看不见了！
//*雷达急促鸣叫*
//特工Jones：我想我的平板探测到什么了！
//*灯亮的声音*
//特工Valentine：什么——？它们动了！
//*几声匆忙的脚步声在地板上回荡，接着是木头的刮擦声*
//特工Barrister：站在那别动！
//特工Valentine：它们又动了！
//特工Barrister：我看得出来，Valentine。
//特工Barrister缓慢而安静地走了一步
//跟着她的是同样缓慢的木头刮擦声
//特工Jones：所以……只有我们动，它们才动？
//特工Barrister：看来是这样。一切都变黑了。也许就像……夜间？
//特工Jones：那我们怎么……
//
//未知声音： ～柑橘和柠檬，圣克莱门特的大钟如是说～
//
//特工Valentine：我们必须离开这里。
//特工Barrister：别傻了！我们得放聪明点。如果我们跑出去，它们会跟着我们的。我不想知道它们抓到我们后会发生什么。
//特工Jones：我们要怎么出去？枢纽的门是单向的。
//
//未知声音：～你还欠我五分钱，圣马丁的大钟如是说～
//
//18:01
//特工Valentine：不，不是有一群幸存者说他们发现了一条通往活板门的秘密通道吗？
//特工Jones：显然他们在楼上的第二间卧室找到了一个。但我们要怎么找到它？
//特工Barrister：这是我们唯一的机会。也许我们可以用这些椅子挡住它们？
//特工Valentine：好……好的，我们可以做到的。
//特工Barrister：我数到三……一……二……三！
//随之而来的是各种刺耳的噪音。地板上传来的脚步声立即被实体移动的声音所掩盖。随着门打开，家具移动的尖锐摩擦声也可以听到。
//
//18:04
//特工Valentine：救命，他们碰了我！我动不了了！
//特工Barrister：喂，Jones，开门！
//特工Jones按照指示推开双开门。
//特工Barrister发现一只乳白色的手抓住了特工Valentine的腿。
//
//未知声音：～什么时候还我钱？老贝利的大钟如是说～
//
//特工Barrister：他们紧紧抓住了他！这些家伙力气得有多大？
//
//未知声音： ～有钱了就还，肖尔迪奇的大钟如是说！~游戏时间结束了！
//
//几声疲惫的咕哝和呻吟继续着，然后听到一声尖叫，门啪的一声关上了
//
//18:05
//特工Jones：天啊，它们抓住他了！我们该怎么办？
//*家具移动的声音，接着是响亮的撞击声*
//特工Barrister（喘着气）：这应该能阻挡它们一段时间。我们得在没有他的情况下继续了。我们什么也做不了。
//特工Jones：看起来他们活跃的时候，就会出现在雷达上。
//*雷达响声 *
//特工Jones： *叹气*。探测范围内什么都没有。
//特工Barrister：来吧，我们走。
//
//18:17
//特工Jones和特工Barrister正在Level 151的走廊上徘徊。自从特工Valentine失踪后，他们就再也没有发现玩偶的踪迹。
//特工Jones：我不明白。这个“第二间卧室”到底他妈的在哪里?
//特工Barrister：我想房间已经移动了。
//特工Barrister靠在墙上
//*相机快门的咔哒声*
//特工Barrister：重新打开Log T-151。附录：实体具有敌意，特工Valentine在战斗中失踪，假定已身亡，“玩偶”似乎使他瘫痪，并把他带到未知的地方。值得注意的是，玩偶似乎只是在一个人移动时才与其一起移动，速度与移动的个体匹配。我想他们是在唱儿歌。是《柑橘和柠檬》。结束日志。
//*相机快门的咔哒声 *
//特工Jones：你怎么这么冷静？Valentine死了！
//特工Barrister： 推测死亡。
//特工Jones： 随你怎么说！我都快疯了！你是怎么保持冷静的？
//特工Barrister：在我逃离Level 6后，就没有什么能让我害怕了。
//
//18:35
//这两个特工正在穿过玩偶之家的三楼
//特工Barrister：我想，当那些玩偶看不见我们时，它们就没法跟踪我们。
//特工Jones：你可能是对的。自从Valentine被带走后我就再也没听过那愚蠢的儿歌了。
//*开门的声音*
//特工Jones：终于有卧室了!
//两个人悄悄地走进房间
//特工Jones：等等，我们怎么知道这是不是第二间卧室?
//特工Barrister：我们没法知道。如果房间改变了……也许“第二间卧室”就意味着我们找到的第二间？
//特工Jones：那只是猜测。就像你之前说的，猜测并不一定可靠。
//特工Barrister：查看四周。也许我们能在这附近找到秘密出口。
//*房间周围有几近无声的动静*
//
//18:42
//特工Jones走过去查看一个滑稽的不成比例的木制玩具箱
//特工Jones：嗯……也许是在这。
//*箱子打开的声音*
//特工Jones惊恐地尖叫起来，然后赶忙捂住了嘴。
//特工Barrister：冷静，Jones！
//特工Jones：是Valentine！它们……它们把他塞在这里了！操？！
//特工Barrister上前检查尸体
//特工Barrister：他死了。
//特工Jones：好像你不知道似的!”
//特工Barrister： Jones，冷静点，控制好自己!
//Jones站了起来
//特工Jones：控制自己？！你不觉得我在努力吗？
//*探测器在背景声中鸣叫*
//然后，Jones推搡了Barrister一下，使她踉踉跄跄地跌出了门外
//
//未知声音： ～那是什么时候？斯特普尼的大钟如是说～
//
//一个玩偶出现，抓住了Barrister的肩膀，使她僵在原地
//特工Jones：Barrister！
//特工Barrister：停！不要动！
//特工Jones：我们该怎么办？我们不能永远待在这里！
//特工Barrister： 你不能。听着，对我来说一切都结束了，但你还能离开这里！它们会注意我……这样你就可以溜走了！
//
//未知声音： ～哦，我不知道，圣玛莉里波的大钟如是说！～
//
//特工Barrister： 跑啊！
//
//18:43
//特工Jones冲出了门，避开了蜂拥在现场的玩偶们
//*设备坠地的声音*
//
//未知声音： 哎呀，玩具箱满了！我们把这个玩具捐给慈善机构吧……
//
//回过头来，特工Jones可以看到布娃娃们从箱子里抓起一把玩具斧头，朝特工Barrister走去。
//
//未知声音：～点一支蜡烛引你去睡觉，举一把斧头将你头砍掉～
//
//在旋律的最后一句，其中一个玩偶把玩具斧头砍在了特工Barrister的脖子上。
//*巨大的声响*
//
//19:03
//特工Jones继续独自徘徊在Level 151的走廊与房间里。Jones拿出他们的相机，按下按钮。
//特工Jones：重新打开日志T-151。附录：这些实体是危险的。避开它们……只能避开它们。你听到圣克莱门特的钟声，然后就跑！跑！它们把Valentine塞进一个玩具箱里……还砍掉了Barrister的头！天啊……我要离开这里……我一定要离开这里……求你了……结……结束日志。
//
//1:18
//*开门声*
//特工Jones：第二间卧室！求你……求求你……放我从这里出去！
//*房间里有快速的翻找声*特工Jones在房间里紧张地搜寻，希望找到任何可能的出口迹象。几分钟后，响亮的石头隆隆声传来。
//特工Jones：哦，感谢上帝！是秘密通道！
//特工Jones沿着黑暗的走廊跑去。
//
//特工Jones后来在Level 1被M.E.G特工找到。他被带到基地Alpha记录他们的探索发现。特工Jones发现他们在混乱中于Level 151丢失了平板电脑。这个设备目前下落不明，但人们相信它在玩偶们的手中。撤离小组被派去寻找平板电脑，但他们找不到它。随着不断的死亡，后续所有希望派遣小队找到这个平板电脑的申请均被拒绝。
//
//一支营救小队随后被派去取回特工Valentine的尸体。
//
//[关闭尸检报告]
//特工Valentine
//人们发现特工Valentine的尸体从玩具箱里移到了一张滑稽的大桌子旁的木椅上，他的四肢摆得好像在喝茶。
//
//以下包含由██████医生实施的尸检报告:
//
//“目标似乎死于颅底高压导致的颈椎骨折。多处腿部骨折，割伤，瘀伤及嘴唇上的一处撕裂伤，都表明死者在被塞进一个小地方之前，曾多次被殴打。死者的手臂一定是被暴力拉扯以适应空间的，然后再被压在脖子上的物体压碎。以我的医学观点来看，这极其痛苦。”
//
//特工Barrister
//特工Barrister的遗体后来在玩具屋的阁楼上被发现。Barrister的肠道挂在天花板上的鱼钩上。Barrister的头骨和股骨在鱼钩旁边的塑料质亚麻篮子里被发现。Barrister的遗体前摆着一个大木牌，用蜡笔写着“为慈善：D”。
//
//特工Barrister身体其他部位下落不明。
//
//入口/出口：
//入口
//入口随处可见！来加入玩具大家庭吧，玩偶们很友善的！
//
//在Level 150的树木处切出。
//Level 151可通过枢纽中的单向门找到。
//穿过Level 178的假墙。
//在Level 188中可以通过相应的窗口进入Level 151。
//在Level 98的餐厅里点了一个“超级娃娃屋”。
//出口
//Level 151唯一已知的出口是位于密道尽头的一个隐藏的活板门，可在书房与第二、三间卧室中找到。这些隐藏出口通往随机层级。
//你无法离开！玩具们必须被收纳好，不能在外面到处乱跑。快点回到你的玩具盒里去，那里头美好又舒适。
//
//作者(们)
//« Level 150 | Level 151 | Level 152 »
//
//Footnotes
//1. 谁会关心它多大啊？我只想玩儿！
//2. 玩具永远不能离开。
//3. 还没到睡觉时间呢。
//4. T代表一套临时命名系统，数字代表它们与人类第一次遭遇时所处的层级。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl151{}