//Level 111
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//level111.jpg
//一个Level 111中的地板的样品。
//
//Level 111是后室的第112层，它的外形为微型的铁路，风景看起来与50年代或60年代的英国乡村小镇相似。
//
//描述：
//Level 111的地板对新来的旅行者来说很显眼，似乎完全由OO/HO比例（分别为1:76和1:87）的模型铁路组成。这些模型建筑在外观和触感上都是用硬纸板制作，尽管它们不可能被摧毁。这同样意味着穿越也许会很困难，因为很多时候你会发现自己被无法穿透的建筑绊倒，或者你可以小心地站在它们的屋顶上，并沿着这条路探索。
//
//Level 111完全在室内，墙壁看起来像是一个空荡荡的高中体育馆墙壁，且为纯白色。学校的“标识”是三个随机的亮橙色字母，字母会根据你所在的房间而变化。体育馆内存在门，但总是通向其他设计完全相同的体育馆。模型铁路总是横跨整个层级。
//
//健身房的墙壁上被挖出了一些小孔，这些小孔都有轨道穿过。墙壁内部被证实有空间，这些空间被称为“中转站”。这里是模型火车进出其他轨道和其他房间的位置。房间里一片漆黑，似乎完全无法进入，因为任何不是火车模型的东西最终都会进入绝缘层。
//
//虽然模型建筑不能被摧毁或移动，但模型火车本身可以。火车通常都采用1950-1960年代的火车外形，它们都以半稳定的速度前进，但如果前面有另一列火车或其即将穿过它们附近的一些站点，它们似乎会稍微减速。如果一个人要踩上火车或使火车脱轨，就会听到从墙壁内部和天花板上方传来的尖锐尖叫声。一旦发生这种情况，所有出口的门都会锁上，之后会发生什么是未知的。不过，也有在引擎脱轨后出现额外模型的案例。
//
//大多数模型都是以各种实体的外形出现的，其中无面灵占据了街道，肢团占据了小巷，窗户为许多模型建筑的窗户。除此之外的任何的窗口内部都会看到其他层级的迷你版，主要为Level 0、Level 53、Level 26或Level 27。
//
//这里的模型实体完全为非暴力的，且似乎没有生命。非实体的模型人物看起来完全相似于人类的迷你版，尽管他们不是无面灵，他们的脸被涂成了纯粹的恐惧的表情。它们的成员似乎在逐渐变多，这也与探险者在脱轨或引擎干预后失踪的情况相吻合。
//
//基地、前哨和社区
//模型爱好者
//模型爱好者是一小群喜欢观赏火车的人，因为层级与实体接近，这些人喜欢“只看火车经过”，他们非常平静，总是对谈论他们自己、他们的团队，或者模型列车所基于的真实列车感兴趣。
//
//The Gaugemaster控制器。
//据传闻，Gaugemaster控制器是模型发动机脱轨时发出尖叫声的原因。它们大多不怀有敌意，而且似乎只有在人们干预他们的模型时才会对其在意和互动。
//
//入口和出口：
//入口
//为了进入层级，你可以在绝缘体中找到小孔并进行切出，或者你可以在Level 52中进入一扇门，可以通过虽然其没有喋喋不休的声音，但类似于Level 111中声音的模型发动机运转时发出的叽叽喳喳声来寻找这些门。进入Level 111的另一种方式是在Level 94的一些房屋内找到一张火车表格，与表格互动将带您到达该层。
//
//出口
//要离开层级，你可以找到通往Level 52的门，或者切出至绝缘体。另一种离开的方式是找到通往Level 9的大型门。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl111{}