//Level 128
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//Level 稳定性: 黎明
//M.E.G.分配的团队(们): Trailblazers, Lazarus
// 
//
//Level 128是后室的一个外部层级，与其他层级有许多联系。
//
//描述:
//Level 128是一片平坦的草地，长约60厘米，似乎永远向各个方向延伸，持续的雾层使其无法看到1公里以外的东西。天空似乎永远是暗蓝色，没有明显的太阳；由于没有明显的日/夜周期，时间以BST为准1周期性的风扫过该层，尽管风速从未被报告为高于强风。探险家们注意到，整个层级上弥漫着一股淡淡的臭氧气味，随着风速的增加，气味越来越浓。
//
//该层级表现出一种重力异常，自由落体的物体在接触地面之前会迅速减速，大大减少了因快速下降地进入此层级而造成的伤害；这种重力异常的上限似乎是500公斤，在超过500公斤后它无法触发。
//
//本层最重要的属性是其中出现的结构：房间和柱子。
//
//房间
//房间是一个单一的房间或走廊，由一个看似随机的，悬挂在半空中的一个固定位置出现，海拔高度从25米到70米不等。它们的位置、高度或大小没有明显的模式，每个房间唯一不变的特点是它们都来自于后室的其他层级。每个房间的墙壁从外面看都是透明的，因此可以看到房间里的东西。
//
//这些房间並不是简单地模仿其他层级的房间；它们实际上与相应的层级相连，形成了Level 128的唯一入口和出口。从内部来看，几乎不可能分辨出房间是否连接到Level 128，唯一已知的方法是破坏不同房间的墙壁或地板，直到通过其中一个洞可以看到该层（不过这种方法成功的概率特别低），或者找到探险家之前留下的洞；这些洞是与Level 128的双向连接，也可以由探险家设法从Level 128爬上并突破这些房间。
//
//任何有洞或开口可以进入Level 128的房间都被称为 "破洞"；探险者应谨慎对待可能连接到危险层级的破洞房间，因为这些是实体进入Level 128的唯一已知途径。值得注意的是，从来没有实体表现出有能力突破房间，一些探险者报告说看到实体在没有突破的房间里行走，完全无视其观察者。
//
//与大多数这些房间的源头层不同，它们从未被观察到会自行移动或改变，即使在遭受了一定程度的结构性破坏后也是如此；因此，一旦一个房间被攻破，理论上任何探险家都有可能再次找到这个通道。然而，如果一个房间被损坏到几乎完全摧毁的地步，它可能会从它本来的层级上 "脱离"，切断该通道，导致房间倒在地上。一位在原头层目睹这一事件的探险家声称，房间的门本身就消失了，没有留下房间存在的痕迹。2
//
//支柱
//支柱是巨大的长方形结构，正好是20 x 20米宽和长，似乎无限地延伸到空中，也可能同样地深入到地下。虽然它们显然是以完美的90度角切割的，但其多孔的表面使它们具有非常粗糙的质地。所有的柱子都以完美的网格排列，每根柱子与直接相邻的柱子相距1公里；由于整个层级的雾气，这意味着在任何时候都只能看到一到两根柱子。
//
//支柱的材料是一种不明的多孔石，后来被命名为 "柱状岩"。实验证明，由于柱状石对任何试图划伤、碎裂、融化、腐蚀或以其他方式破坏它的行为都有明显的抵抗力，因此很难研究；更多信息可以在其物品条目中找到。
//
//基地，前哨和社区:
//M.E.G. 布拉沃前哨
//建造在拉扎勒斯研究小组正在研究的柱子旁边；在其底座周围建造了一个铁丝网围栏和临时实验室。
//包括一个房屋结构，一个主要的总部和一个车库，用于储存B.N.T.G.委托的车辆，供侦察队开拓者在开拓者项目任务中使用。
//前哨站附近的两个房间连接到Level 4和Level 20，大部分家具被移走，地板的一部分被切开，为一套电梯让路。
//B.N.T.G. 11号交易站
//构建在两根支柱之间。
//平均人口在20至25人之间，主要集中在相连的各层之间的贸易进出口。
//接近四个独立的房间；由于它与布拉沃前哨站的相对位置不明，这些是目前唯一已知的到达贸易站的途径。
//幸存者前哨
//在游览过程中，开拓者团队会定期发现小型探险者团体或定居点；虽然他们的位置已经被编入目录，但为了保护他们，他们的位置不会在本文件中披露。下面列出了由开拓者护送到布拉沃前哨站的几个团体。
//
//两名来自Level 19的探险者，他们声称地板在他们脚下坍塌；采访内容可以在下面第一个附件中找到。
//三个探险家组成的小组，有一个临时的帐篷；四个探险家在帐篷里护理他们受伤的手臂。开拓者能够提供医疗援助。根据他们的证词，这群人很可能是从Level 34进入的，他们发现了以前的探险家留下的一个被破坏的房间；这个房间还没有找到。
//开拓者们报告的其他值得注意的事件和定居点。
//
//在距离布拉沃前哨站大约6公里的地方发现了一小批肢团；它们从Level 72的一个洞里掉下来，在试图攻击开拓者之前漫无目的地四处游荡；在呼叫增援后，该实体群被消灭，房间被摧毁。
//*超过75名成员的永久性定居点，建在四根柱子之间；根据对不同成员的采访，它最初是一个由7名探险家组成的团体，他们在通过Level 4的一个被破坏的房间后被困在Level 128。
//
//一个小型的游牧团体开始崇拜这些柱子，认为它们是由一些更伟大的生命创造的结构；他们定期回到更大的定居点，在返回他们的旅行之前补充物资。
//入口和出口
//入口
//Level 128根据已经记录的房间，Level 128有可能与每一个由人造内部空间组成的层级都有联系。进入该层最简单的方法是通过以前的探索者创建的通道，因为这些通道不会随着时间的推移而消失或改变。
//
//出口
//进入Level 128的过程也可以反过来使用；但是，由于所有的房间都悬浮在半空中，所以退出Level 128比进入Level 128要困难得多，如果没有任何形式的补给或准备，几乎不可能。
//
//[2] 发现附加文件
//档案 "Kelly Patters的采访"
//[关闭档案 MEG-Lvl128-Int1.rtf]
//Transcript of Lazarus Interview 128-Rivers-K/R
//Level 128, "很棒的户外空间"
//前言
//以下是拉扎勒斯研究小组特工凯瑟琳•里弗斯在布拉沃前哨站录制的音频采访记录，在她和罗伯特•约翰逊被侦察队开拓者从Level 128救出后，采访了获救的探险家凯利·帕特斯。约翰逊拒绝接受采访，说他需要 "在一个屋檐下单独呆一段时间"。
//
//对话记录开始
//里弗斯
//好的，凯利。让我们从你现在的感受说起吧。
//
//凯利
//嗯……松了一口气！我很高兴能和别人谈谈。我的意思是，别误会我的意思，Rob是个好伙伴，但和别人聊天的感觉很棒，你知道吗？
//
//里弗斯
//[嗤笑声]
//相信我，我完全明白。我几乎无法想象在那里是什么感觉。说起来，你说你在那里呆了多久？
//
//凯利
//这是个问题。这里的灯光从未改变过，我从来没有真正有过良好的时间感。
//
//我想说的可能是……一个星期，也许两个星期？过了一会儿，一切都开始混在一起了。说实话，我现在真正记得的是那场大雾。还有走过的路。天哪，那些走过的路。唯一能让我不去想我的脚有多难受的事情，就是看着我们经过的每根柱子从雾中浮现出来。
//
//[暂停]
//
//我想了很多关于柱子的事情。我不知道是我的心态问题，还是这个地方的问题，但当我们接近一个柱子时，它似乎从未变得更近。只是……更清晰。然后，在我们意识到之前，它已经在我们身后了，雾气开始散开，而且正在蔓延至下一个。
//
//当然，我们彼此交谈。这可能是唯一能让我们不至于走散，在草地上迷路的事情。但过了一段时间，我可以说我们都不再注意它了。它已经成为自动的，就像走路一样。
//
//但是，最终，我们听到了你们团队使用的那些车的声音，就像恍惚的感觉被打破了。我们开始制造一些噪音，接下来我知道的是，我们已经在来这里的路上了。
//
//里弗斯
//是什么让你来到这里？你说你来自Level 19；我想知道事实的其余部分。
//
//凯利
//[思考中]
//我们刚刚开始打开一个板条箱——我不记得里面有什么了——这时我们周围的所有灯都开始一个接一个地闪烁和关闭。黑暗迅速包围着我们，我们听到了声音……咆哮、抓挠和……其他事情。我们手无寸铁，但是——谢天谢地——Rob抓住我的胳膊，把我拉向他在墙上发现的一个洞。我们开始爬过它，声音很快就消失了。
//
//你拥有的19份文件并没有真正地描述。那个空间……很紧。也许这只是入口，但它并不比我们穿过的那个洞高多少。也满是灰尘。我们做的每一个动作都扬起了大量的灰尘，以至于我的眼睛都在流泪。
//
//在接下来的几个小时里，我只能听到地板在我们下面吱吱作响，偶尔飞蛾在灯光下飞舞。然后，突然，吱吱声变成了可怕的呻吟，然后是嘎吱声。然后我们向下坠落了。
//
//感觉我们坠落了好几英里，但由开始的自由落体变成了更温和的滑翔；然后，当我最终着陆时，就像我被轻轻地躺在稻草床垫上一样。显然，我在尖叫，但直到我着陆并感觉到我嘶哑的喉咙，我才意识到。
//
//再过几秒钟，我觉得Rob落在我旁边，我们都静静地躺了大约一个小时，只是盯着漂浮在我们上方约30米的房间。那个房间在我们挖的巨大洞的两端大约10米。然后，Rob站起来，说我们应该开始环顾四周。他帮助我站起来，然后……好吧，我们开始走了。你应该知道其他的。
//
//里弗斯
//非常感谢你，Kelly。我知道这对你们俩来说并不容易，但我会确保你们很快被带到另一个层级。
//
//凯利
//[松了一口气的笑声]
//谢天谢地。我越早离开这里越好。
//
//Rivers
//有什么不对劲吗?
//
//Kelly
//那些该死的！
//
//[深呼吸]
//
//我很抱歉，是柱子的问题。只是……它们的某些东西真的让我心动。也许是它们的高度，或者它们的大小，或者它们消失在高处的雾气中的方式，但是向后靠去看它们，使它们突然感觉更近了，就像它们正俯身看着我。
//
//但这不仅仅是亲密关系。还有一种……就像他们在看着我一样。就像沉默的法官一样，他们知道我的一切。
//
//也许这就是他们靠得更近的原因。
//
//[长时间的沉默]
//
//Kelly
//[平静的声音]
//对不起，我可以离开吗?
//
//Rivers
//是的，我想仅此而已。我想我们都需要一点新鲜空气，嗯?
//[嗤笑声]
//
//到此为止吧，让你为Level 4做好准备。
//
//结束对话记录
//文件"Trailblazer Project"
//[关闭档案 MEG-Lvl128-TBS.rtf]
//Trailblazer Project 摘要
//Level 128, "很棒的户外空间"
//项目状态
//活跃
//
//项目摘要
//发现并利用Level 128和整个后室的许多其他层级之间的连接。
//
//作用
//Level 128的持续性及其与其他层级的许多稳定联系使其成为M.E.G.作为供应物资和人员运输以及推进整个社会的可靠途径的宝贵资产。基础设施和大规模定居点的未来发展可能导致Level 128成为整个后室新的主要联系或活动中枢。
//
//方法
//M.E.G. 侦察队“Trailblazers”由队长马库斯·霍尔特和特工怀亚特·皮尔斯顿和泰勒·琼斯组成。选择这些代理商是基于他们在导航和制图方面的技能，以及他们之前在戶外类型层级导航的经验。
//
//开拓者团队的任务是导航Level 128，确定每个房间的层级和大致位置，发现新房间后两小时內向Bravo前哨站报告。
//
//为了准确映射房间的位置，必须建立一个可靠的系统来确定它们的相对位置；幸运的是，支柱的一致网格模式允许M.E.G.形成一个简单的二维坐标网格，前哨站查理的支柱代表(0,0)。
//
//使用此系统，可以为每个房间分配一组近似十进制坐标，以精确定位其近乎精确的位置，并更轻松地在它们之间导航。
//
//问题和解决方案
//虽然已经建立了一个可靠定位以前发现的房间的系统，但这些点之间的距离和导航问题仍然普遍存在；因该层的长距离，加上整个层级的高草和浓雾，使旅行变得极其繁琐，在整个Level 128导航需要大量的时间和精力。
//
//为了解决这个问题，M.E.G.委托B.N.T.G.生产第一代越野汽车。工程部为换取开拓者协助，建立自己的往返11号贸易站的供应路线。这些车辆设计为每辆可容纳6辆特工，并配备了定制设计的火力发动机和巨大的燃料储备，以允许极长的长途旅行。其中3辆目前由Team Trailblazers使用。
//
//作者(们)
//« Level 127 | Level 128 | Level 129 »
//
//Footnotes
//1. 后室同步时间，是M.E.G.在整个后室使用的一个单一时区。
//2. 尽管探险家避免讨论房间被毁的原因，但在残骸中和周围发现了爆炸材料的痕迹。
//3. 原文为Greenlit
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl128{}