//Level 198
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//level-198.jpg
//Level 198的最顶部
//
//Level 198是后室的第199层。
//
//进入Level 198后会在广阔的天空中进行自由落体。它的真实大小是未知的。
//
//描述：
//Level 198完全没有地面。Level 198内唯一的物质为所有已知种类的云、可供呼吸的空气以及偶尔出现的大雨或大雪。
//
//当进入Level 198时，流浪者将出现在层级的最顶部（很明显），并立即开始以稳定速度下落。Level 198的温度被形容为“冷得让人很不舒服，但并非无法忍受”。在进入Level 198的两个已知流浪者身上均未发现冻伤或其他因寒冷而产生的损害迹象。在Level 198的“顶部”，天空被观测为完全黑暗的，但经过下落时的某一点后，昼夜循环开始，大约每六小时于黑夜和白天之间转换一次。夜晚的天空中未观测到星星的存在。
//
//流浪者下落的持续时间似乎各不相同。根据Level 1居民Gia Laghari的叙述，坠落持续了大约22小时，而M.E.G.特工Meadow1经历了持续八天的坠落。尚未知晓影响下落持续时间的因素。在一次坠落结束时，流浪者将安全地于随机层级中重新出现。
//
//基地、前哨和社区：
//显而易见地，此层级没有前哨。
//
//特工Meadow的记录
//这是一份录音文件，由于2020年7月9日坠入Level 198的M.E.G.特工Meadow记录。
//
//录音以大约一分钟急促的空气流动声和慌张的呼吸声开始。
//特工Meadow：好吧，好吧，我需要整理一下头绪。我在哪？不觉得我以前听说过这个层级。天啊，这上面真他妈的冷。
//第一次记录结束。
//特工Meadow：好吧，我觉得我应该记录我的…漫长的坠落，只是为了研究目的。从进入这一起层大概过去两个小时了。到目前为止，没有坚实地面的迹象，只有…云。我觉得从某种程度来说它挺漂亮的。这让我想起了那次我和妈妈去落基山脉徒步旅行。只是…少了点石头。哈。
//第二次记录结束。
//特工Meadow：嗨！从我进来到现在，大约，呃…九个小时了。景色变得有点无聊了。任何值得注意的东西…哦，对，下了一次雨。让我更冷了，但很快就好些了。我希望这里能亮一点，我害怕我会不小心掉东西…
//第三次记录结束。
//特工Meadow：你好。我落了已经快两天了。我有时候睡着了，然后醒了。没什么值得注意的新东西，除了和雨有一些小冲突。顺便现在有蓝天了，偶尔。没什么其他可报告的了。再见。
//第四次记录结束。
//特工Meadow：只是报告一下还是什么事都没发生。干，我他妈的又冷又湿又累。完毕。
//可以听到衣服摩擦的声音。据推测特工Meadow忘记了结束录音。大约30秒后可以听到哭声。更多压抑的哭声后第五次记录结束。
//特工Meadow：我掉进这里已经大概四天了。没什么可报告的，除了昨天下了一整天的雨。我还在发抖。
//两分半的沉默，直至特工Meadow再次讲话。
//特工Meadow：只有一直没完没了地往下掉，看不到尽头…我想这他妈是对我在这里的全部经历的一个非常合适的描述。我在这多久了？四个月？感觉更像是四个世纪。为什么我会这么做？这里死了多少人？有多少死亡是被我看到的？他妈的有什么意义？我不能再这样下去了。
//第六次记录结束。
//特工Meadow：为第五天欢呼吧！天气…大部分时间都很晴朗。我大部分时间都在试着睡着，但当你陷入永远的坠落时真的很难。你知道的，一个月前我就应该高中毕业了。我和妈妈已经等了几个月了，那本来将是我一生中最美好的一天。但是紧接着我们因为一个糟糕的成绩吵了起来，我跑上楼，在台阶上绊倒了，然后…现在我要死在这里了。或者永远在这里下落。我不…我不知道。
//又一次的哭声
//特工Meadow：我猜这总比被怪物吃了强…
//特工Meadow：我想我妈妈了。
//第七次记录结束。
//特工Meadow：第七天。我恨这个地方。
//
//没有其他与层级相关的录音，特工Meadow拒绝谈论她从Level 11中的泳池中被救出来的经历。
//
//入口和出口：
//入口
//Level 198有两个入口。根据她流浪者Gia Laghari的陈述，她在Level 78中找到了一个Level 198的入口，她在那里发现了一扇微微敞开的门，微微的寒风从里面吹出来。第二个入口缺乏足够的了解。2020年7月9日，特工Meadow在Level 11的摩天大楼顶上遭遇了三只死亡飞蛾。根据一名在摩天大楼底部附近巡逻的M.E.G.特工的证词，她当时没有意识到周围的环境，向后退了一步并从摩天大楼上摔了下来，在落地前大约10英尺处切入了Level 198。
//
//出口
//目前还不知道是否有方法可以使流浪者主动离开Level 198。唯一已知的逃脱方式是完成自己于层级中的坠落。
//
//作者信息
//« Level 197 | Level 198 | Level 199 »
//
//Footnotes
//1. 为什么她有代号？我们都没有代号。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl198{}