//Level 102
// 
//
//生存难度：
//等级 3
//
// 
// 
// 
//LevelX
//Level 102 中的一条走廊。
//
//Level 102 是一系列的走廊，其中充满了关闭的商店。
//
//描述：
//Level 102 是一系列错综复杂的通道，类似于购物中心里的走廊。尽管经常能找到相当长的走廊，但这些通道都充满了关闭的商店，据记录，这些走廊的长度约为100米至10公里远。在这些通道的尽头有两扇门，分别标有“男性”和“女性”，每扇门上还有一个褪色的油漆轮廓。这些门背后是典型的公共厕所，但可以找到一些补给品，包括：杏仁水、刀子、避孕套和杂志。这些房间通常有不明来源的微弱光线，墙壁上有霉菌；不建议长时间待在这些厕所中。在这些厕所中还能找到镜子，据报告，在照镜子时，会产生扭曲的个人镜像，产物甚至可以出现在主体背后，并且只有在主体停止照镜子时才会消失。
//
//偶尔，能够找到一家开放的商店，入口处上方用白色大字写着“快乐地带”。商店大部分是空的，除了一张稍微腐烂的木桌和一个金属柜，在其中可以找到几瓶杏仁水和手电筒。
//
//在整个层级中，可以找到各种类型的商店，其中一些商店的品牌名称不明。在这一层级中，可以发现笑魇、窃皮者、木灵和猎犬，有时可以听到来历不明的笑声，这些笑声似乎来自一个小女孩，还可以听到来自成年男子的几乎无法理解的喃喃自语，这些声音以及一系列金属敲击声似乎来自关闭的商店内。
//
//在整个场所均有可能找到一扇金属门，它通往一个房间，里面摆满了桌子、椅子、蜡烛、散落在地板上的撕碎的纸，以及散落在地板和墙壁上的散发着腐臭的人肉；长时间暴露在这种气味中，可能引起恶心、呕吐、昏厥，在某些情况下，还会产生人群遍布的幻觉。如果当事人昏厥，幻觉发生的几率会更大，直到醒来后，还会内经历很长时间幻觉；据记录，在离开这个特定的房间后，会经历1至12小时的幻觉。
//
//在进一步穿越Level 102 时，有可能发现一大片散落有钢桌与钢椅的区域。在该区域中央，有一道金属栅栏围绕着一个洞口，这个洞口似乎并不通往任何地方，没有探索者能够从这个空间返回；由于从该洞中听到了一系列的咕噜声与咆哮声，因此理论上认为该洞栖息着一个实体。
//
//在这个区域的桌子上，可以找到空杯子、塑料盘与披萨饼盒子，通常都是空的，但有时可以在盒子里找到状况良好的披萨饼。尽管并不建议食用这些食物，因为此处存在蟑螂、蛆虫和苍蝇等昆虫。
//
//Level 102 相当黑暗，缺乏窗户，尽管不时会出现顶灯，但建议携带光源来详细探索这个地方。不建议在这一层级长时间停留。
//
//基地、前哨和社区：
//该层级不存在已知的基地、前哨和社区。
//
//入口和出口：
//入口
//最近发现，穿过Level 13 中第102层的一扇乡村木门可使人进入本层级。
//
//出口
//要离开本层，需寻找一段向下的灰色楼梯，这将带人进入Level 103。进入该层级的下水道，将通往Level 41。切出墙壁到达Level 103 也是可能的，但并不具有保证性。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl102{}