//Level 166
// 
//
//生存难度：
//等级 2e-环境危害
//
//安全
//不稳定
//非实体危害mainpath.png
//主要道路的图片。
//
//Level 166是后室的第167层。该层级表现为一个悬浮于虚空之上的社区。
//
//描述：
//Level 166由几户的家庭的住宅以及铺砌瓷砖的街道组成，这些街道分布于悬浮在半空的大片的地形上。该层级的许多房屋让人联想到20世纪的郊区住宅，如水平放置的壁板，三角墙屋顶，双悬窗以及镶板门。值得一提的是，该片地形的边缘表现为一片完美的圆形。任何穿越了边界的房屋都被切断并露出其内部结构。
//
//枯萎的植被——落叶的树木，灌木与草——为层级内贫瘠的环境增添了一层深棕色。
//
//该层级有一片保持不变并且澄澈的暮色天空。即便许多认为其的人造的，因为天空无法提供任何自然光，但这目前无法被证明。
//
//明亮道路：
//尽管该层级大部分并未被点亮，但路灯发出的橙色光源照亮了这一路径。该路径是安全通过该层级的唯一途径，因为当人员进入黑暗并断绝了眼神接触后，人员将消失。这一点可以通过不断眼神接触来避免。
//
//即便如此，明亮道路也并非完全没有危险。有时，该层级所有的路灯都会熄灭，持续时间自五分钟到数个星期。已经有数十名人员和M.E.G.特工因此死亡。
//
//为了避免停电的风险，人员必须：
//
//团体游历
//携带光源，最好的选择是头灯或者任何具有强光的东西。
//始终保持彼此之间的视线。
//尽量避免眨眼。
//请谨记，即使是小组中任何一个成员没有进行眼神注视的瞬间，也可能会对小组造成严重的致命影响。
//
//虚空：
//当自层级的边缘往下看时，可以看到一个黑色的间隙。虚空与天空的相交处有一条缝隙，仿佛其逐渐融合到一起，在地平线边缘形成了显著的对比。由于间隙和层级漆黑的地面在肉眼上难以分辨，所以光源对于人员不会掉入间隙至关的重要。
//
//任何掉入虚空的物体都会不断的掉落，直到其到达一个可见的点，所有东西都会悬在半空中。最终，可以看到许多东西聚集在一起，形成了巨大的物品堆。还有些不明身份的尸体漂浮在其上，可能为绝望的人员试图去抢夺这些物品。该特性也被认为是地形漂浮的原因。
//
//出现了各种各样的看法，包括人们可以到达这个领域的终点从而去到想要的层级，甚至是前厅。由于救援工作已被证明困难，因此不要求任何人去证明这点。
//
//建筑物：
//在该层级，大多数建筑内部都被填满。其外观大都完好无损，但通过打开门或者透过窗户可以看到内部填充了粉饰灰泥，砂浆，熟石膏和混凝土。
//
//据主要道路较远的几栋房屋自远处眺望似乎正常，但仔细观察会发现这是一种错觉。这些房屋都是由错综复杂的墙壁所组成。自特定的角度来看，其组成了一个正常的房屋外观。
//
//警告：
//对于出于任何原因试图进入层级黑暗区域的人员：你将对可能遭遇的任何危险负全部责任。
//
//路径的尽头是两栋正常的房屋，其与Level 166内奇特的房屋形成了对比；其包括正常郊区住宅内常见的房间，如厨房，客厅和浴室。
//
//这些房屋内有各种常见的家用物品，如家具，厨具等。值得注意的是，另一间房屋里有一台被压碎的摄影机与一本被损坏的日记。这两者表明，在层级被记录前有人员居住在此层级。
//
//笔记：
//该日记是在房屋B的第二间卧室里发现的，里面有一些文字，似乎为一位住在此处的人员的日记，尽管许多页已经丢失了。
//日记内容已扫描，如下所示：
//
//第一页
//第二页
//第三页
//第四页
//第五页
//第六页
//第七页
//第八页
//笔记
//
//
//
//
//入口与出口：
//入口：
//在Level 90的房子内部时，打开后门可以通向主要道路附近房屋的后院。建议在进入后尽快来到主要道路。
//在Level 69时，主要道路可能会出现“分岔”。随着道路的前进，道路将变得越来越窄。沿着这条“岔路”行驶，可以引导人员来到Level 166明亮道路的起点。此时 Level 69的雾将消散。
//只有在绝对必要的情况下才能使用这个入口。建议缓慢行驶，因为很容易撞到其他人员和/或者消失在黑暗里。
//
//出口：
//Level 166的检修孔可能会打开一段时间，进入这些检修孔将带你来到Level 183。
//在房屋A右边的两栋房屋，有一栋房屋，其内部有部运行中的电视，其持续显示雪花屏。进入这所房屋将来到Level 104。
//尝试用火柴，打火机甚至雪茄点燃任何房屋都将来到蒙黑天空。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl166{}