//Level 153
// 
//
//生存难度：
//等级 3
//
// 
// 
// 
//bookshop.jpg
//一张书店入口的照片
//
//Level 153是后室的第154层。该层由M.E.G成员Adeline McCaffery在一次救援任务中意外切出而发现。
//
//描述：
//Level 153以一间循环的书店的形式存在。每个进入该层的流浪者都会来到这间城市背景下的书店的门前。从外观上看，书店贴着浅奶油米色墙纸，上面装饰着一些复杂精巧的小设计，包括两个似乎穿着希腊式服装的女人形象。如同图中所示，没有任何指出书店名称的招牌。店外的空气中弥漫着淡淡的绿薄荷与香草的芬芳。同时，该层缺少昼夜循环且一直处于白昼的状态。
//
//书店正前方的马路是无法通行的，因每尝试走上马路时，总有一股无形的力量会阻止人们通过。流浪者或许会沿着人行道探索——然而，书店旁边的每栋建筑都上了锁并且无法打开——而转过拐角总会回到同一条人行道上。
//
//正如前文提到的，该书店处于一种循环的状态。值得注意的是，此循环具有一种古怪的改变时间的效应，因此需要对其进行更深入的描述。请不要在意描述的长篇幅，因人们能否安全地离开该层取决于层中发生的变化。下面是关于流浪者们会遭遇的循环形态的描述，首先是起始形态。
//
//关闭虚实期描述
//当流浪者进入书店，他们将会发现自己身处于类似1950年代的装潢中。角落里典雅的留声机播放着轻柔的音乐。在店里，绿薄荷和香草的气味会变得浓郁很多。入口的右边是柜台，人们可以在那购书结账。店里零散地摆着几只皮椅；椅子旁有小桌子，桌上通常配有一套茶具和一个装满薄荷茶的茶壶。茶水是可被安全饮用的，并有着和杏仁水相似的治愈功效，也是层中绿薄荷与香草气味的来源1。天花板上长满了藤蔓和各种植物，一些情况下是百合花和紫菀。店内洋溢着明亮的自然光，因此所有照明设备都是关闭的状态。
//
//3b57b16d-28d3-44e7-b52f-ff27c703a6cd.jpg
//一张虚实期内发现的书籍的照片，由M.E.G成员Adeline McCaffery拍摄
//
//店里其余地方都摆满了书架，书架上摆满了各种颜色、大小的书籍，但均没有书名。一眼翻去，所有书都是完全空白的。但在翻开书的两分钟后，书页上会开始显现人们过去的一段愉悦经历。三十分钟后，人们开始会在阅读时听到他们所爱之人的声音。虽然这可能会给予流浪者暂时的安全感和幸福感，但过久地暴露在这些书的内容下会使人们感到失落和孤独。建议远离这些书籍。
//
//任何想要再次打开入口的尝试被证明是无效的，因其在人们进入书店后会被锁住无法开启。但同时，书店后部一扇通往储藏室的门会被解锁。储藏室内部有着许多箱子、摆满书籍的架子与一台小型的装订机。进入储藏室，关上门，重新开启，你会回到第一次进入书店的位置，但面对的是一个不同装潢的书店。这一新形态被称为欲障期。
//
//关闭欲障期描述
//如前文提到的，打开储藏室的门并离开会把人们带回第一次进入书店的位置，但有一点例外：书店变更为1970年代的样子。椅子上的皮垫现在变成了绳织的材质，且水壶中的绿薄荷茶被替换成木槿茶。喝下茶水某种程度上仍是安全的，但伴有微弱的晕眩和混乱症状。蔓越莓和巧克力的气味弥漫在空气中，天花板上的藤蔓被星星装饰物所替代，而一个收音机将会播放音乐。店外的光线似乎处于永恒的“黄金时光”状态，即最常见在日出后第一小时或日落前一个小时的景象。除这些之外，店里的几支蜡烛也被点燃且无法熄灭。书店的窗沿和柜台上常可以看到摆放着一些紫菀和多花月季。
//
//stackobookslol.jpg
//“噢？这些书变得更加散乱了，还有我的摄影学位可不是白来的！” - Adeline McCaffery
//
//墙壁面具开始在此形态的书店墙面上出现，最常见的是恶鬼面具与潘塔罗内面具。亦有未经确认的报告称在店内最左边角落处的一把椅子上发现了一张哥伦比亚面具。
//
//同样的，从椅子或书架上找到的书籍在翻开的前两分钟将是完全空白的。在这之后，流浪者便可以阅读到关于其过去的内容，除了一点例外：书籍上会显现探索者过去渴望但却未发生的事情，而不是愉悦的经历。人们会获得短暂的满足感，但这种感觉很快会被极度的后悔与渴望替代。除这些症状之外，有流浪者报告称有种与这些书籍呆在一起的渴望。过久地暴露在这些书的内容下可能导致心理损伤（例如记忆丧失、真伪不辩），因此强烈建议远离这些书籍。亦有报告称听到了更响亮的话语声。同样地，入口将保持上锁状态。若想去往下一形态，走进储藏室2，关上门，然后重新离开。如此将会把人们带到幻视期。
//
//关闭幻视期描述
//在进入这个新形态时，书店的装潢将变换为2000年至目前年代的样子。与先前形态相比，现在店内少了几只椅子，且半数椅子现在会是木制或塑料材质。桌上的茶壶里装满了温杏仁水。 被注意到的是里头的杏仁水将失去平时在其他层级中的、对精神和身体的疗效，而目前的效果则不大有帮助3。 天空看起来是晨昏时分的景象，即日出之前或日落之后，白天与夜晚交替的时间。在此阶段，许多人会发现灯和各种照明设备亮着。更多种类的玫瑰会出现在幻视期的书店中，且少量出现的紫菀将会紧闭着花苞。 你一直爱着你的紫菀….
//
//墙壁面具在此形态中将更加常见。流浪者们注意到有一种被窥视的感觉 我们都看到了 ,尽管这只被归为被此循环所影响而产生的猜疑。在幻视期，想要戴上这些面具的冲动会变得更显著，所以最好尽一切所能远离它们。
//
//image0.jpg
//另一张幻视期书籍的图片，由先前同一个M.E.G成员拍摄
//
//书籍中内容的背景多种多样，但它们都只关于一个主题：未来。经常地，流浪者们会阅读到前室中未来将发生的事件。同样地，也可能阅读到后室中未来的事4——不过，发现这类内容的情况相当稀有。长久地暴露在这些书页前会导致暂时性视觉丧失、中度偏头痛与躁动。对预知和改变未来的渴望也将导致流浪者们变得更具攻击性且易怒。最后，还有关于出现轻微幻视的描述，例如看见一位家庭成员、一位朋友，或一只宠物。
//
//离开此形态的流程与先前形态一致。进去，关门，出去。进去，关门，出去。 进去，关门，出去。 如此将会把人们带到最后一个已被记录的形态：恶坏期。
//
//关闭恶坏期描述
//恶坏期的书店有着区别于其他任何形态的未来性质。每把椅子都漂浮在空中且能承受加之于上的一切重量；扶手上的几个按钮能够控制椅子把人们举得更高。书架现在是上下相叠的且店内的所有书籍均被替换成了文件夹大小的平板电脑，与前室中的Ipad或Kindles等设备相似。店里现在是完全无声的，尽管有些人提到听见了从店外传来的小提琴演奏。桌上的茶壶被漂浮着的饮水机所替代，内部装有或温或凉的腰果水。罂粟和红玫瑰散落在墙壁、天花板和书架上——藤蔓和玫瑰的茎上布满了荆棘，因此强烈建议不要摘起它们。店外的光线极其耀眼且过久的接触可能导致灼伤。由于这种光的存在，店内无任何照明设备亮起。
//
//奇怪的是，只有一张面具存在于此形态的书店：哥伦比亚面具。它可以在店内最左边的角落处被找到，而不是被钉在墙上。有M.E.G.成员提到听见了从面具处传来的低语声并因此用尽一切努力才避免遭其影响。
//
//这些书籍的内容被认为是极度危险的，可能致命。阅读这些书籍会引发全面的视听幻觉，流浪者会认为他们正在和某人聊天（通常是前室中亲近的人）且聊天对象知道离开后室的方法。下面是一段音频日志转录,当中Adeline McCaffery, 一位来自M.E.G.小队Quick Match的搜救实习生，成为了幻觉的受害者。
//
//McCaffery:“日志09，这里是M.E.G.搜救实习生Adeline McCaffery，汇报来自…嗯，你们知道的。我现在在另一个书店，没想到吧，但这个很…现代。实际上太现代了。它看起来有点像我读过一本书里描绘的一间办公室——《月族1：暗月之影》？或什么什么的？我不知道——哈，看啊！那些椅子好神奇，它们漂在空中！”
//
//[ 持续几分钟的沉默，随之而来的是液体流出的声音，可以听到塑料杯掉在地上。 ]
//
//McCaffery：“好—好吧，嗯，速报，这里的杏仁水不是…杏仁水…是另一种他们怎么称呼来着的坚果饮品…现在这里的读者比通常多了很多。我猜那些书里的主题一定比上一阶段的还要好。”
//
//[ 持续两分钟的沉默。 ]
//
//McCaffery：“好了，我搞明白怎么把这傻逼玩意开起来了，我还等了差不多半首歌的时间。噢，这东西还是全息什么的！哈…等等…上面啥东西都没显示。我搞不懂了…”
//
//[ 持续五分钟的沉默。 ]
//
//McCaffery：“…妈妈？妈你在这干啥？怎么了？你怎么到这地方来了？…什么？不可能吧，每个人都说这里是没有出路的…。…那爸爸呢？真的吗！你觉得他会和我说。其他人也能离开吗？等等，我不能那么早就走，我还得告诉其他人。…哈？不，我当然想回家陪着你们，但…如果我就这么突然地走了，难道不会太自私了吗？”
//
//[ 持续两分钟的沉默，除了McCaffery的呼吸声之外没有任何声音。 ]
//
//McCaffery：“不…你是对的。我确定他们会知道，就像你告诉我的那样。对吗？好，好，让我把这本书放回原来的地方——能找到你我真的太开心了，妈妈，我以为你会永远离我而去了…我等不及要回去了。”
//
//[ 录音机被放在桌子上的声音。 ]
//
//McCaffery：“好吧，这就是再见啦！我知道M.E.G.最终会发现这段录音的。你们最好快点然后赶紧回来，自由就在前方！…嗯？来了，妈妈！搜救实习生下线！”
//
//[ 没有移动的声音。完全无声。 ]
//
//[ 在十分钟之内，可以听到轻笑声。渐渐地，笑声变得越来越大。直到两小时后录音机耗尽电量为止都没有停下。 ]
//
//此事件后的两到三天，M.E.G.成员在Level 153中找到了McCaffery。尽管她仍然具有生命体征，但展现出多种精神错乱的迹象——任何试图使她脱离幻觉的举措都被证明是徒劳无功的。成员们成功找回了McCaffery所读的那本书，但进一步的实验表明该书已不再显现任何人的过去、未来或任何幻象。医生估计她仅能再存活一周左右的时间，且无法进行交流。但在该周之内，她消失了。试图解释她为何消失的调查仍在进行中。
//她得救了。
//
//
//
//
//
//
//
//
//加入我们，你也将得救。
//
//实体：
//亚历山大·布洛克维奇
//亚历山大·布洛克维奇宣称自己是书店的老板5。可在柜台后面找到布洛克维奇，他身高6英尺——取决于某人所在的形态，他的外貌和言辞会随之改变。他鼓励人们买书——尽管，任何时候某人想买书时，他只会回答“抱歉，那本被其他人预订了。下次有货了再来！”尝试向他提问总会令他摇摇头，走进储藏室然后消失。挑衅或侮辱他会导致人们迅速地被踢出书店并进入Level 10之前的随机层级。
//
//读者
//读者是在任何形态中受害于这些书籍的流浪者。他们不会移动——但在前三个阶段中，尝试拿走或摧毁他们的书会导致他们对挑衅者发起攻击。仅在欲障期，通过对着读者的眼睛泼洒水的方式仍可能救下他们。
//
//Evocationaries
//Evocationaries在第一个形态中较为少见，但随着某人深入循环，它们的数量会不断增加。若遭遇，迅速地找出并且摧毁它们是至关重要的。
//
//死亡飞蛾
//雄性死亡飞蛾在书店中很常见；而雌性死亡飞蛾较少见。因此只要避免与其接触和做出侵略性行为，它们会是相安无事的。
//
//基地、前哨和社区：
//M.E.G. (探险者总署)基地“书虫”：
//包括八名成员，他们愿意承担志愿者的角色、进行交易，也可以向他们提问。
//能在书店的入口附近被找到。
//他们停留在第一形态且会尽一切努力阻止任何人进入下一形态。
//每天用一小时的时间一起读书和追忆过去。
//入口和出口：
//入口
//通过Level 75的一个贴着“自传”标牌的书架切出会来到该层。
//在Level 67找到桌上一本标题为“起源”的书，然后带着它走出面包店的入口会将人带到Level 153的外部。
//在任何一层找到一本标题为“我的故事”的书会将人带到该层。
//亦有可能通过偶然的切出来到Level 153，但这非常罕见。
//出口
//罕见地，不像该层的其他图书，某人可能会发现一本完全不含个人性质的书籍，取而代之的是一本用难以理解的语言写就且包含Madame Blanche's签名的书。用你的食指从左到右扫过Blanche的签名，会把你带到Level 906。
//尝试攻击Brockovich会导致流浪者被踢出书店至Level 10之前的随机层级。
//某人可能于从Level 75切入的同一位置再次切出。这样做会把流浪者带回到先前离开Level 75的同一位置。不过，此方法只会在初始形态生效。
//小概率地，在任何形态，桌上的饮品旁边可发现一个呈在金盘子里的果馅饼。咬一口，且仅需一口，你会去到Level 89。
//从一扇面对着玩偶店的窗户切出6会将人带到Level 520。
//戴上面具。戴上它。快点。
//
//
//
//
//
//
//
//你想要故事以怎样的顺序发生呢？
//是苦寻柏油，还是甜香馥郁？
//当消泯完美，了却欲望之时，
//匿于假面之后，御于狱火之中。
//
//作者（们）
//« Level 152 | Level 153 | Level 154 »
//
//Footnotes
//1. 不过，需要注意的是将茶水带出该层是不可能的，因每次尝试带出都导致其完全蒸发。
//2. 奇怪的是，这间储藏室并不具有书店本身的时间变换性质。
//3. 那些喝了茶壶里杏仁水的人描述其杏仁味远比平常强烈
//4. 实验已证明这类内容是可信的，且导致许多人陷入了更为危险的境地。
//5. 显然，他的姓氏即是导致幸存的流浪者称呼该层为“布洛克的书店”的原因。
//6. 奇怪的是，该出口是由一个刚从Level 75切入的流浪者所发现的。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl153{}