//Level 168
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//DsAntPCL.jpg
//一只正在玩捉迷藏的无面灵。
//
//Level 168是后室的第169层。目前，Level 168有三种已知的不同的变种。
//
//描述:
//Level 168通常位于一栋外观平常内部面积却十分巨大的房子的内部，又或者位于一个无穷无尽的郊区房的庭院。在更罕见的情况下，Level 168也可能是一个荒谬般巨大的城市公园，有着各种各样的游乐场设备、长椅、垃圾桶、树木和喷泉。该层级的水源可以安全饮用，建议在休息期间饮用以保持体内水分充足。
//
//当Level 168的开放空间形态时，天气似乎总是表现为万里无云的晴天，并且拥有舒适的温度以及永不落下的太阳。类似地，Level 168的内部空间形态大多照明良好，室温也保持在一个舒适的温度。可以在内部找到像现实世界那样布置的家具，也可以与这些家具互动并轻松地移动它们。在这一层级也很容易找到各种各样的补给，尤其是层级处于内部形态时。该层级的窗户被认为是安全的，但进入这些窗户可能会导致你离开Level 168。
//
//实体
//Level 168可以最常见的实体是儿童和成人无面灵，尽管儿童无面灵的数量要比成人无面灵要多得多。要避免壁橱、阁楼和爬行空间等黑暗空间，因为你可能会遭遇笑魇。Level 168内的所有儿童无面灵都被认为是非敌对的，除非有人主动挑衅，除此之外，他们还表现出了与遭遇的流浪者进行捉迷藏游戏的独特渴望。流浪者无法拒绝第一次游戏的请求，因为进入Level 168的流浪者并没有意识到，当儿童无面灵在躲藏点发现他们时，流浪者就已经加入了游戏。而成人无面灵充当的是监督者的角色，较为被动。它们在Level 168的外部形态内更为常见，尤其是公园。
//
//找到你的儿童无面灵会和其他儿童无面灵带你到一个特定的地点“大本营”，它们会用手势示意你捂住眼睛，通过手势“3”和“0”数到30。如不遵循这些指示将会激怒实体，但它们还不会立即攻击你，只有完全不配合的人才会受到在场所有无面灵的攻击。此外，在数到30时偷看、在某时候加快倒数，或数到30之前就结束倒数也会激怒区域内的无面灵。建议在捂住眼睛倒数时提高音量，以减少刺激到无面灵的风险。
//
//数到30后，你会发现所有儿童无面灵都躲在了Level 168的某个地方。儿童无面灵的躲藏点通常处于大本营150米的半径范围内，但有报道称在极小概率下，这些实体的躲藏点会更远。这些实体的躲藏能力参差不齐，有些实体藏在了客观上非常糟糕的位置（即，在一个太小或透明的物体后面）还有一些则藏在了很难发现的位置。不建议立即指出选择了糟糕地点的无面灵，因为他们可能出于沮丧而攻击。相反，你应该熟视无睹地从他们身边走过，说出一些赞美和困惑的话语，比如：
//
//"他们会藏在哪呢?"
//"你们藏得真好！"
//"你们有人能给我一个提示吗？"
//当时说出最后一句话时，就有可能会出现一只兴奋的无面灵主动从躲藏的地方内跳出来并朝你挥挥手，示意想要帮你找到其他人。这样，几分钟后，就可以安全地找到那些躲在一个糟糕位置的无面灵，并且不会有激怒它们的风险。你应该利用这段时间储备你发现的物资。如果你足够幸运的话，还有机会碰上一场派对！=) 一旦你找到一只无面灵，它就会回到大本营，等你带着最后一只无面灵回来。
//
//你需要找到的最后一个儿童无面灵藏得是最隐蔽的，并且永远是你进入Level 168碰上的第一个儿童无面灵。在找到最后一只无面灵后，他们会牵着你的手带你回到大本营，其他参与游戏的无面灵则都会为你鼓掌。如果在这之后成人无面灵没有来提供点心和零食，则新一轮的捉迷藏将立即开始。这一次，最后被发现的儿童无面灵将开始“数”到30，方法是捂住脸，每数一次就点一次头。你必须立刻跑开并找到一个躲藏的地方，因为如果拒绝或不配合就会导致它们的攻击。
//
//该无限循环的躲猫猫游戏将一直持续到你死亡或离开Level 168。此外，在每完成一次游戏之后，这组儿童无面灵很可能会带你进入不同的层级变种。而概率会随着你完成的游戏次数而增加，因为如果总是同一个地点的话，你的玩伴们肯定会腻。
//
//基地，社区和前哨
//搜寻者
//搜寻者由9名流浪者组成，他们由于无法找到第二场游戏的最后一只无面灵，被永远困在了Level 168。尽管他们一直表现出一副很沮丧的样子，但他们还是愿意与其他流浪者合作，并进行交易。目前尚不清楚到底是搜寻者们需要找到的最后一只无面灵是否已经离开了Level 168，还是这些搜寻者们的躲猫猫天赋太糟糕。他们总是会感谢那些帮助他们搜寻的人，但这对他们找到无面灵无济于事。
//
//Heidi
//Heidi是一位精力充沛的28岁流浪者，她热情地将自己描述为“专业的藏匿者和搜寻者”。她声称，自她进入Level 168以来，她已经进行了数千次躲猫猫游戏，并且完全没有离开的渴望。Heidi只会在进行游戏时与他人交易，她也很乐意告诉你她知道的最好的躲藏点。她偶尔会询问流浪者是否在Level 168发现了新的出口，这样她就可以避免不小心离开了。
//
//入口和出口:
//入口
//如果你已经在其他层级躲避实体有一段时间之后，就有小概率切出进入Level 168。 一般来说，躲避正在积极搜索你的实体的时间越长，你就越有可能进入Level 168。应该注意的是，这种方法不适用于那些是死胡同或实体绝迹的层级或房间。目前，正有M.E.G.的成员们试图通过躲猫猫游戏进入Level 168的测试。
//
//出口
//通过Level 168的窗户离开有时会带你前往另一个也存在窗户的层级,但Level 168的窗户大多会带你前往层级的相反形态。换言之，在Level 168的内部形态中从一个窗口离开会导致你进入Level 168的外部形态 (反之亦然).
//
//通过尽可能地在你和大本营之间保持距离，也有可能离开Level 168并出现在另一层级。根据Level 168形态的不同，可进入的层级也有所不同且进入概率都极小。如下：
//
//内部形态 (房屋): Level 18, Level 27, Level 178, Level 282
//外部形态 (社区): Level 9, Level 90
//外部形态 (公园): Level 10, Level 11, Level 172
//只有在你完成第二场躲猫猫游戏后，才能离开Level 168。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl168{}