//Level 197
// 
//
//生存难度：
//
//等级 变化
//
//神秘属性
//信息匮乏
//环境的突然变化
//Level 197 是后室的第198层。这是一个大型的洞穴系统，里面有大量具有各种独特属性和效果的水晶。
//
//描述
//Level 197 是一个大小未知的深邃水晶洞穴。这个洞穴很深，其顶部和地面均长有水晶。这些水晶性质反常，并且在多方面影响着流浪者，其影响的性质取决于流浪者所处区域。
//目前在Level 197有四个已知的区域，命名如下：
//
//“绿松石区”
//“紫水晶区”
//“红宝石区”
//“缟玛瑙区”
//区域是指Level 197中长满不同矿物的部分。有传言说，一些区域由其他矿物组成，如钻石、绿宝石或黄宝石，但尚未得到证实。
//
//关于不同区域的更多信息见下文。由于Level 197各区域间的主要差异，区域的生存难度, 基地，前哨与社区列表和入口/出口列表 均有不同。每个区域均有一个标有 "区域结构"的单独段落，以告知流浪者区域的地形以及可能需要避开的地方。
//
//区域1 - 绿松石区
//21:34_01-11_正在预览_最新版本...
// 
//
//生存难度：
//等级 Zeta
//
//可能安全
//可能稳定
//待定的实体记录Zone_1
//在区域1内所发现的水晶的特写图片
//
//绿松石区是流浪者进入Level 197后最有可能到达的区域。这个区域盛产具有镇定效果的绿松石水晶，据流浪者说，这让人感觉特别放松，并描述这种感觉为 "就像刚从漫长的工作中回到家一样"。这些矿物可以相对容易地从地面和岩壁上取下，并保有上述的镇定效果。
//
//区域结构
//绿松石区非常深邃。其宽度为15英尺，高度为17英尺，并由一种可与辉绿岩相媲美的材料组成。这里的火成岩不会断裂，无论使用何种工具来开采它的尝试都失败了。区域1内的隧道间并无明显差异，且所有墙壁都很光滑。区域1内的所有岩洞共同构成了一个粗略的圆柱形结构。与其他区域不同，区域1构造稳定，无薄弱环节。如果在区域1的表面看到裂缝，那么请尽快通知M.E.G.前哨 "感觉良好"的操作人员。
//
//钟乳石和石笋广泛分布在整个区域1，并不时有水滴落下来。到目前为止，还没有关于钟乳石坠落的报道，所有的石笋都近似于倾斜的圆柱形，平均高度为11英寸到4英寸。石笋上有明显的人为磨平的痕迹，但是谁磨平的，何时磨平的，不得而知。
//
//绿松石区唯一有所变化的地方是一个被称为“冥想湾”的大型空间。这个空间及其描述都难以找到。据说在房间的中心有一个半径为30英尺的巨型绿松石晶石。中心的水晶约有30英尺高，这个区域还长有其它绿松石水晶。该区域还会像喷泉一样不停地喷出蒸馏水。这里面散发出沉重的宁静感，据走进去的人说，他们想尽可能久地呆在那里。冥想湾被认为是着迷者的由来，但这一点无法得到证实。
//
//绿松石区的水晶尺寸不一，最小的记录是3英寸×1英寸×0.5英寸，最大的是5'×4'×3'。1极少数情况下，从区域1的地面上把绿松石掰下来，会使蒸馏水从水晶底部滴下，并从被掰下的地方慢慢渗出。这些水没有任何消极作用，可以安全饮用。这些水不能像水晶那样离开Level 197，所以建议在离开前喝掉这些水。
//
//由于顶部与地面上的水晶簇发出的光亮，区域1比较明亮。强烈建议尽可能多地采集绿松石水晶，因为它们有助于应对区域3的危险环境。2
//
//实体
//有两份报告称在区域1发现了一个笑魇，但这些报告仍未得到证实。建议M.E.G.特工人员将任何确认的目击事件通知其指挥官。目前还没有证实其他实体存在。
//基地，前哨与社区
//M.E.G. (探险者总署) 前哨站“感觉良好”
//“感觉良好”前哨站挖掘绿松石晶体，并将其运回大部分人居住的地区，如Level 11, 中枢, 和 Level 901。
//大约有53名特工驻扎在Level 197的区域1。
//该前哨站位于level197的入口附近，以便于M.E.G.成员进入。
//驻扎在前哨的M.E.G.特工人员获准向那些没有防毒面具并且打算进入区域2的流浪者发放防毒面具。如果没有防毒面具，则允许“感觉良好”让流浪者在前哨站内或周围停留，直到面具送来。
//着迷者
//着迷者是一个由125名左右的流浪者组成的团体，他们拒绝离开区域1。
//除非受到挑衅，否则他们完全被动。
//着迷者是一个蜂巢式的团体，如果有一个人采取了行动，其他人也会采取同样的行动。
//该团体没有确定的领导者。
//入口和出口
//入口
//如果在任何一层突然感到放松或平静，那么就去寻找这种感觉的来源。在寻找来源时，很可能会有一个契合当前层级，并发出蓝色微光的昏暗门路。走进门路后就会切入区域1。
//截至2021年12月13日，进入Level 197最稳定的方式是在Level 210的地板上随机切出。这种情况发生的几率适中，睁眼行走时的几率略高。预计在走廊的中间位置就会切出。如果没有，请闭眼并向前走至电梯处，以便再次尝试。
//出口
//沿着区域1的照明路径继续前进，就能到达区域2。
//有传言说区域1有一条昏暗的路可以通往Level 108，但尚未证实。
//区域2 - 紫水晶区
//11:34_19-11_正在预览_最新版本...
// 
//
//生存难度：
//危险环境
//极不宜居
//少量实体Zone_2
//由于空气中的病原体干扰而模糊的区域2的图像
//
//紫水晶区是流浪者会到达的第二个区域。该区域充满了大量薰衣草香味的紫水晶，这些紫水晶兼具有益处和危害。据知，散发这些气味的水晶可以舒缓和放松任何与之接触的人，但另一方面，它们也会传播危险的疾病并感染流浪者，这些疾病与前厅的各种疾病有相似之处，如天花、西班牙流感，以及偶有的黑死病。尽管有这些相似之处，但这些感染的突变使其潜伏和发病的速度更快。有鉴于此，建议流浪者如果要在区域2长期活动，应准备好杏仁水和防毒面具。
//
//当流浪者进入区域2时，一堵紫水晶墙会从入口处的地面和顶部同时缓慢长出，阻止人们返回区域1。鉴于墙壁生长缓慢，人们可以毫发无伤地跑回绿松石区。
//
//如果流浪者转身继续探索区域2，身后会传来岩石和水晶破碎的声音。转身时，先前区域1的隧道会变成紫水晶区的隧道，随着前进，这条隧道将更加狭窄，最终完全封闭。这条隧道的尽头有许多通过空气传播，并且可以在几分钟内穿透防毒面具并致死的病毒。继续前进，不要试图返回。
//
//区域结构
//区域2的结构与区域1截然不同。绿松石区的构造是圆柱形的，而区域2的构造杂乱无章。紫水晶区的大小暂无定论，但多数测量结果为7英尺高，5英尺宽。而紫水晶的尺寸几乎都是6英寸×1英寸×2英寸。区域2的材质是脆性辉绿岩，在足量压力下易碎裂。3
//
//18年5月16日，紫水晶区被确认为线性结构。一群流浪者在一个薄弱点上用临时的镐头打通了区域2的地面。成员们坠落了大约10英尺，落在了另一条隧道里，流浪者们声称他们是通过挖通地面来看看下边有什么。他们表示自己的行为纯粹是出于好奇，但他们已被M.E.G.拘留审问。
//
//一组M.E.G.救援队被派去救助两个受了重伤的流浪者，并报告说现在的洞壁是石墨而非通常区域2第一层的辉绿岩。这一层晶体较少，实体攻击性更强，空间大于第一层。返回时，有两名特工人员失踪。实体似乎无法从放下来的绳索上爬上去，并被困在第二层。如果没有适当的武器装备和相当规模的队伍，不建议进入第二层。
//
//目前还不知道是否有第三层，层次是否无限多，或者在第二层之外是否还有更多的层次。当第二层的安全区域建立并得到保障时，将对此进行测试。
//
//实体
//区域2存在实体，比如笑魇，尸鼠，影， 窃皮者，以及少量的窃骨者。这些实体藏身于零星分布在洞穴周围的漆黑槽部和开阔区位。
//
//上述区位可以在整条区域2的道路上找到，由于附近的紫水晶发出的不规则光线，通常可以在通过之前发现这些区位。如果这些区位或凹槽附近没有紫水晶，那么可以在前方抛出一个光源。如果流浪者没有光源，最好小心地走过危险区位。这些槽部内藏有大量的实体，且通常是成群的死亡飞蛾。一旦被惊扰，它们会冲出洞穴来寻找惊扰它们的东西。
//
//如果流浪者在区域2范围内遇到实体，那么建议回避该实体，因为来自紫水晶区的实体血液中通常携带高危病毒。
//
//在区域2偶尔能找到军用级的光源。这些化学灯类似于荧光棒，可以在一种类似于前厅军用背包袋的绿色小型容器中找到。这些袋子只分布于有实体的开放区位或槽部中。
//
//与区域1相比，区域2相对较暗，自然光源较少。单体紫水晶也会发光，但是这些紫水晶发出的光昏暗且易消逝。强烈建议流浪者带着手电筒进入这个区域，因为单体紫水晶间会拉开距离，以至于过于黑暗，影响观察。
//
//基地，前哨与社区
//在区域2没有已知的基地、前哨或社区。
//
//入口和出口
//入口
//沿着区域1的照明路径，可以进入区域2。
//出口
//可以从缓慢封闭的紫水晶墙撤退，从而安全地返回区域1。
//通过区域2可以进入区域3。
//区域3 - 红宝石区
//21:46_21-11_正在预览_最新版本...
// 
//
//生存难度：
//等级 4
//
//不安全
//不稳定
//大量实体
//红宝石区是Level 197的第三个区域，四处都是发光的红宝石，使得整个洞穴呈现出浓厚的红色色调。据探索该区的流浪者报告，区域3的温度变得 "热得令人难以忍受"。墙壁上的一些晶体有灼烧感，多个流浪者因触摸这些晶体而导致四级烧伤。
//
//当流浪者从墙上掰下冷却的晶体时，很有可能会流出类似于绿松石区的液体。然而，从这些地表水晶流出的液体并不能饮用，因为区域3的红宝石会流出腰果水。强烈建议不要触摸或打碎该地区表面的任何红宝石。
//
//区域结构
//红宝石区空间结构均为10英尺高和10英尺宽。通常在高度和方向上会有所改变，比如区域3的一些陡坡足有83°且可能需要攀登设备。由于生长在斜坡表面的红宝石会灼伤攀爬的流浪者，故强烈建议在攀爬前除清红宝石，并检查你所攀爬的表面。
//
//当探索的时间较长时—通常为1-2小时，流浪者可能会到达一个被称为 "绯红要塞 "的地方。绯红要塞是一个有四座黑曜石桥梁连接到一个巨大方形平台的广阔地方。这些桥虽然只有1英寸厚，但却足够坚固，并能承载多人，而且在到达中心平台之前，所有的桥都会延伸约1000英尺。房间中央的平台有大约100,000平方英尺的面积，并且似乎没有任何东西支撑。不建议人们向下看洞穴，因为桥梁有4英尺宽，向下看可能会因引起眩晕而坠亡。4
//
//Zone_3
//在绯红要塞通过高清摄像机拍摄的区域3的顶部。
//
//绯红要塞的高度尚未确定，但根据目前的估计，约有700英尺高。虽然被命名为要塞，但这处水晶构造在外观上并不像任何时期的要塞，而更像电子游戏《深海迷航：零度之下》中水晶洞穴的红色版本。要塞内部温度不同于外界，因为热量似乎并没有从这些冰凉的水晶墙壁中散发出来。理论上来说，热量应从要塞的另一处得以散发出来。要塞内有多处楼梯和房间，并且大多数房间都会有袭击流浪者的攻击性实体。在少数房间里会有装着许多可用材料的红宝石宝箱，这些材料，譬如冷却布和冷冻的瓶装杏仁水，可以帮助流浪者穿过区域3的其它地方。5
//
//由于水晶区域的四面均各有一扇门，要离开绯红要塞很简单。离开要塞后，你就很难再发现另一个要塞，所以当你发现一个绯红要塞时，你要决定好是否去探索这个地方。
//
//实体
//区域3有大量危险实体，包括区域2的所有实体以及地栖怪，悲尸，Nguithr'xurhs，爪形菌蛛和疫疾。实体多位于类似于区域2的槽部和开阔区位，但也可能出现在区域3的路径上。
//
//区域3似乎对其内的所有实体都有一种精神影响。当流浪者被一个游荡着的活跃实体发现时，该实体会进入所谓的“激怒状态”，并追逐流浪者直到抓住他们或看到绿松石晶体为止。这种策略并不适用于所有实体，所以强烈建议流浪者在对着被激怒的实体拿出区域1的绿松石水晶时，要注意追逐他们的实体的情绪状态。
//
//如果实体行动迟缓，看起来呆滞、恍惚或疲惫不堪，那么建议你迅速跑过它或朝相反的方向跑开，从而远离实体。一旦使用水晶，水晶就会开始摇动并发出响声。丢出水晶并远离水晶和恍惚的实体。水晶的颜色会暗淡下去并爆炸，其发出的尖锐的碎片可以穿透肉体、骨骼，乃至高级防弹衣。
//
//一群流浪者报告说，透过绿松石水晶看实体时，实体对他们的攻击性行为会减弱。这个策略似乎对悲尸和爪形菌蛛有效，却不适用于其他任何实体，而且已被证明无效。通过绿松石水晶有助于透过厚重的红色色调观察外界。
//
//基地，前哨与社区
//由于该地区的实体具有很强的攻击性，区域3没有基地、前哨与社区。
//
//入口和出口
//入口
//进入区域3的唯一途径是通过区域2。
//
//出口
//目前，区域3所有可能的出口都无法确定，因为报告显示出有些出口之间存在着相互矛盾。据报告，一些人可以从Level 8出去，并找到返回M.E.G.前哨 "洞穴入侵者 "的路。还有报告显示，一些人在一条没有照明的路听到了类似于Level 0荧光灯的嗡嗡声，并且一旦走入就会被送回至level0。
//
//到目前为止，尚不知道这些随机出口的成因及出现形式。
//
//区域4 - 缟玛瑙区
//信息错误_正在预览_最新版本...
//⚠️信息警告⚠️
//
//关于 "区域4"的信息仍可能更改，且尚未敲定，并且仅由于未知的一方未经许可提前发布了这些信息，因而公开。以下文章中出现的部分细节已证实。但多数仍为未知流浪者的断言。
//
//因此，我们要求流浪者审慎对待这些信息。
//
// 
//
//生存难度：
//等级 待定 [无人区]
//
//实体优势
//神秘属性
//未知信息
//缟玛瑙区是Level 197中最危险且最难到达的区域，它的存在仍仅仅是基于所谓的目击者访谈，而仍未明确证实。区域4存在的主要证据是一个流浪者取回的缟玛瑙水晶。
//
//Level 197的区域4是一个深邃的缟玛瑙水晶洞。这些水晶非常锋利，有一个流浪者报告说，他们因触摸水晶的尖端，手掌被划出了很深的伤口。人们还认为区域4几乎一片漆黑并且没有任何从水晶中发出的光线。根据未经证实的报告，人们还推测，在这个区域内无法使用任何设备，包括手电筒、照相机、夜视镜，甚至化学灯。
//
//区域结构
//由于缺乏关于缟玛瑙区的资料，因此无法确定该区域的空间结构。唯一已知的是本区域漆黑一片，且本区域地形不存在倾斜或下降。
//
//下面这张纸条是在区域1“感觉良好”前哨站发现的。递送纸条与写纸条的人不明。该纸条转录如下。
//
//我差点就被那些该死的水晶杀死了。因为你几乎看不见，所以你需要隔着一些保护物用手来轻轻地触摸墙壁。要像蝙蝠回声定位一样来用听觉判断你和墙之间的距离。比如，如果右侧声音更大，这就意味着你离左边的墙太近了，需要调整一下位置。
//
//另一件事就是你需要保持前行。我不知道怎么说，但这就像有什么东西……在你附近。你看不到也听不到它，如此等等。你几乎能感觉到它就在你身边的那种氛围。
//
//我不知道它是什么，但和我一起进去的那群人称它为黑暗君主，或者简称为君主。我们七个人都有一种感觉，那就是当君主靠近时，我们就不得不屈从它。我的探索队除了我无一幸存。我发现当你跪下、鞠躬或表示尊敬时，它就会放走你，然后消失不见。
//
//拜托，如果你到了这里，不要试图反抗君主。否则你会和它一并消失不见的。
//
//由于缟玛瑙区尚未证实存在，所以说明中提到的任何内容和上面提到的所有威胁均无法得到证实
//
//实体
//黑暗君主是一个仅存于缟玛瑙区的未经证实的实体。据说它是一个由黑烟组成的幽灵似的实体，头顶上漂浮着一个象征着王权的暗黑色的物品。黑暗君主身上除了被认为是眼睛的两个白点外，没有其他明显的特征。
//
//基地，前哨与社区
//尚未发现或核实任何基地、前哨或社区。
//
//入口和出口
//入口
//由于该区本身尚未证实，目前还没有任何入口。那些据说从区域4离开的人声称，通过区域3的危险部分，或者试图跑回区域2的入口，都会进入区域4。
//
//出口
//尚未证实有区域4的出口，但有三个流浪者声称，在探索了足够长的时间后，他们被送到了任何一个他们想去的层级。
//
//作者
//« Level 196 | Level 197 | Level 198 »
//
//Footnotes
//1. 测量值分别为长，宽，高
//2. 目前尚不清楚为什么水晶的蒸馏水无法离开Level 197
//3. 星形、五角形和十角形都已得到验证，仅举几例。
//4. 由于环境太危险，无法精确测量，所有测量结果均为预估。
//5. 关于“攻击性实体”的更多信息见下文
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl197{}