//Level 100
// 
//
//生存难度：
// 
// 
// 
//new100.jpg
//Level 100的海洋与沙滩。
//
//Level 100是后室的第101层。
//Level 100是一条细长的海滩线，道路两侧被一片海洋所包围。
//
//描述：
//Level 100由一条笔直的沙路和一片无限宽广的海洋组成。沙子看起来很光滑，而道路本身不断地延伸。然而，据曾来过这里的唯一一名探索者说，这条沙路似乎没有终点和起点。沿着这条小路前进时，偶尔会遇到一些随机的物体。这些物体通常是个人财物，如手机、照片、衣服和其他个人携带的小物品。
//
//由于只被探索过一次，关于该层级的信息十分有限。从已知信息来看，似乎沿着海滩小路走得足够远，最终会见到偶尔出现的墓碑。每块墓碑上都刻着一张脸，虽然每张刻画都显得幼稚简陋，但探索者形容它们看起来很平静，认为它们很安详。除了面孔之外，所有的墓碑上都有日期。目前尚不知它们为什么被刻在那里。但鉴于它们在纪念碑上，因此被推测为死亡日期。
//
//Level 100海洋的两边都是无限的，因为即使在游了几分钟后，探索者仍表示地平线从未改变，海洋只是不断向外扩张。经过一段时间的休整，探索者决定潜入海洋深处。海洋几乎没有任何特点，完全由沙子组成。水下具有清晰的能见度，很容易显示出海底的无尽向下延伸。一切都是由沙子组成的，而沙子最终会固化并结块成岩石。
//
//基地、前哨和社区
//该层级不存在已知的基地、社区和前哨。
//
//影子
//影子是一种只能在人的周边视觉中看到的实体，尽管有报道称，在后室的许多层级都存在影子，但理论上该实体的主要活动场所是Level 100。虽然它最初被认为是隐形的，但新的研究表明，该实体具有极其精妙的伪装能力，能够准确地将自己掩藏在环境中，以至几乎不可能看到它，只留下它的影子可见。
//
//M.E.G. 采访日志 8872
//日期： 2018.08.31
//采访者： Alex Patr
//受访者： Holly Clove
//
//<开始采访>
//Alex Patr：那么，你能解释一下发生了什么吗，Clove小姐？
//
//Holly Clove：好…好吧。我当时在Level 11。我只是一个人到处转转，一切似乎都很正常，直到我听到路边有人在闲聊！我很好奇，因为我以为是你们的人在说话。但结果我发现…嗯，那不是M.E.G.的人，而是一个不同的组织。不知出于什么原因，他们开始追赶我，所以我开始逃跑。我不想进入任何建筑物，因为…
//
//Patr打断了Clove的话
//
//Alex Patr：我们知道，你只需要解释一下发生了什么。恕我直言，但我们对你的发现很感兴趣。
//
//Holly Clove：好，在被追赶了一段时间后，我决定装死。事后看来…这是个糟糕的计划。但我认为值得一试。我脱离了他们的视线几秒钟，并借此机会趴在地上。当时我身边还有那些没有脸的家伙，所以我只能假设袭击者认为我被它们杀了！
//
//Alex Patr：然后呢？
//
//Holly Clove：然后他们就走了。但我担心他们是在骗我。我似乎确实赢得太轻松了。躺了一会儿后，我感觉有东西把我抱了起来。还没等我反应过来，我已经站在了一条薄薄的沙地上。两…两边都是水，而且那里非常明亮、温暖和热带。我也看不出是什么东西带走了我，但我觉得是一些阴影生物？也许吧？
//
//Alex Patr：你在那里发现了什么吗？
//
//Holly Clove：嗯！当我走在沙滩上时，发现一些随机的物品，我没有捡起它们，但有一些人的照片、手机、整件的衣服，还有一些其他的东西，比如打火机。就是人们会随身携带的东西，你懂吧？
//
//Alex Patr：还有什么吗？
//
//Holly Clove：我再往前走，发现了一些墓碑，上边没有名字，只有平静放松的脸和日期。这很奇怪，我什么都没碰。
//
//Alex Patr：你提到了一条“薄薄的沙地”，那里还有别的东西吗？
//
//Holly Clove：有的，那里全是水。我去游泳了，就向外游了好几分钟。我没有看到地平线的变化。只有大海，永远都是海。我花了一点时间恢复体力，然后潜了下去。海…海床一直向下，所有的沙子都变成了岩石。其实下面也非常清晰！
//
//Alex Patr：你是怎么出来的？
//
//Holly Clove：嗯，我上岸后，还拍了一张照片，我决定再走走。几个小时后，我已经很渴了，所以当我找到一瓶水时，我非常高兴！于是我捡起了水瓶，结果却被两边抓住，带到了Level 0。
//
//Alex Patr：还有别的吗，小姐？
//
//Holly Clove：呃…没了，就这些。
//
//Alex Patr：好的，谢谢你，Clove小姐。就这样吧。
//
//<采访结束>
//
//入口和出口：
//入口
//真正的进入方式目前还不得而知，因为任何试图重现原进入方式的尝试都被证明没有效果。不过，之前的进入方式是装死，直到影子把人送到Level 100。第一次发生这种情况是在Level 11。
//
//出口
//要想离开这里，必须摆弄海滩上的物品，墓碑也许亦可行。这样做会吸引影子的出现，然后它会把人送到Level 0。
//
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl100{}