//Level 196
// 
//
//生存难度：
//等级 3
//
// 
// 
// 
//level-196.jpg
//进入Level 196后拍摄的照片。
//
//Level 196是后室的第197层，由一名匿名用户发现。该用户的尸体在该层级的第34层被发现，死因为不明实体的攻击。
//
//描述
//Level 196呈现为20世纪80年代的旅馆，占地面积约7平方英里，属于小型层级。然而至今仍未测得其高度。在该层级中你可以看到旅馆中普通的客房，然而大部分客房中都空空如也，缺乏家具。有时可以发现大量散落的三明治和杏仁水，但可能是腐烂的、也可能受到了污染。该层级的照明条件同样较差，所有灯皆无规律悬挂于天花板，且需要手动打开。然而，该层级中的光源实际上并非灯光，而是窗户之外的白色虚空。注视窗外太久会导致暂时失明。
//
//在该层级中可能会出现几阶楼梯，将你带入该层级内的另一楼层。然而，你也可以通过在该层级内长时间滞留来上升楼层。当滞留时间过长后，只要与该层级内的某一物件接触就会即刻引发一次切出，使你穿越数个楼层，且返回较低楼层的阶梯将会突然消失。在该层级内遭遇实体的概率取决于你所处的楼层高度（该层级内的实体只有笑魇、窃皮者与猎犬，但少数报告称在该层级内发现了Potri的踪迹，尚未得到证实），但你最有可能遇见的是一种名为红戚的实体。这种实体由一位匿名的M.E.G.研究者发现，有关它们的情报相当缺乏，但已知它们应为人形的锈红色实体。
//
//楼层
//如上文所述，该层级内越高的楼层就越危险。确切地说，从第30层开始，一切将变得诡异，可以看到建筑的梁柱外露，并有一定程度的受损迹象。窗外的光逐渐减弱，导致层级陷入黑暗。地面变得脆弱易碎、出现裂痕，苔藓与真菌从较大的裂缝中长出，空气的湿度与温度均上升到令人难以忍受的地步。每次拾级而上，都能看到客房中血肉以令人作呕的方式替代了尖叫。这一切都是红戚导致的。
//
//直至今日，已经有58层得到了探索。目前推测该层级中的楼层是无限多的。
//
//血肉之室与红戚巢穴
//这些房间会在40层以上的区域出现，也是红戚栖身之所，因此极度危险。在这些房间中，红戚吐出的物质会将家具染黑。其结构将不再和更低层一样由混凝土构成，而是变为了质地与红戚相近的血肉。这些血肉会消化其上的流浪者，并且与红戚一样遍布孔洞，洞中嵌有眼球。所有非红戚实体都将陷入洞中，作为血肉之墙内红戚幼崽的食物。在这些房间中，实体将开始交配，雄性会将其一部分身体植入雌性体内，直到雌性死亡，产生一道闪光。雌性的尸体将会被粘在墙上。如果一个婴儿出现在了闪光之中，墙壁就会将婴儿吐出并将之杀死。目睹这一切的研究者都认为自己的心理受到了巨大创伤，因此后续的研究已经终止。
//
//基地、前哨和社区
//猩红之神的信徒
//（由于红戚的出现，不推荐流浪者与该组织互动）
//
//该前哨由10人组成，位于Level 196中一个特殊的区域，在其中不受切入/切出效应的影响。
//他们称，猩红之神用这片地方换得了他们的信仰。
//他们正在试图深入研究红戚。如果你对猩红之神有所不敬，他们将变得十分冲动。
//近期的研究得出，红戚污染了他们的心智，因此他们才会有如此表现。同样可以推得的是杏仁水无法治愈这一过程。
//入口与出口
//入口
//你可以通过进入Level 11中的一栋建筑来到该层级，少数情况下也可以从Level 188进入。当你试图进入Level 1却失败时，也会进入该层级。
//
//出口
//上楼时有几率突然切出至Level 0，但可能性很小。有传言称上到50层即可进入Level 11。如果你是通过Level 188的窗户进来的，不要担心！你依旧赶得上派对，只要能在第一层找到一个气球！=)
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl196{}