//Level 155
// 
//
//生存难度：
//等级 3
//
// 
// 
// 
//13577213683_82c3fab0cc_b.jpg
//Level 155的边缘地带。
//
//13577097015_f221f8b4ff_b.jpg
//Level 155中众多拱门之一。
//
//13941645602_0ac22fccb8_b.jpg
//Level 155的下水道。火线也常出现在此区域。
//
//13814035745_952857c4ff_b.jpg
//Level 155中已知最早的火线照片之一。
//
//Level 155是后室的第156层。它于2017年6月25日被一名匿名流浪者发现。
//
//描述：
//Level 155是一个巨大的废弃迷宫，由砖墙和拱门组成。这一层级空间有限，呈六边形，从一侧到另一侧的直线距离约为50公里(≈1619平方公里）。它的墙体表面由石头制成，覆盖着一层薄薄的人造废料1、苔藓、污垢和残骸。这一层级的木质屋顶破旧而腐朽，其木板不断掉落至地面。阳光会穿过常见的缝隙，是该层级唯一的自然光源。
//
//该层级阴冷潮湿，温度在11°C-17°C之间变化。Level 155似乎有不断运作的昼夜循环，每天的白昼平均持续约4小时。在夜间，层级中几乎没有光，所有在此层级中的流浪者都会身处伸手不见五指的黑暗。建议在夜晚降临前迅速离开该层级，鉴于Level 155的实体在此期间将变得更具攻击性。
//
//尽管Level 155被认为不可能维持任何人类的生命活动，但观察到正常的蟑螂及老鼠等动物群在此繁衍生息。
//
//墙壁区域
//Level 155的墙壁是由石砖制成的迷宫状结构，它们以该层级中心为圆点，周围15公里为半径呈矩形。它们被随机分割，但以类似网格的方式排列，有些部分可以长达2公里，而有些甚至不到20米长。它们将最终导向拱门区域。这一区域的表面积约为584平方公里，约等于总表面积的36%。
//
//拱门区域
//Level 155的拱门与墙壁非常相似，呈网格状排列，每个拱门的宽度和高度各不相同。拱门往往在层级的边缘附近变宽，彼此之间通常相距约8米。这一区域的表面积约为1035平方公里，约等于总表面积的64%。共计约有129875000个拱门。
//
//下水道
//下水道是一组大型互联污水管道的名称，是在Level 155中穿行的一种简单而安全的方式。它们的入口可能会突然出现在Level 155的随机墙面上，呈圆柱形，宽约9米。下水道的地面上往往会出现巨大的水坑。在穿过一条狭窄的通道后，你会出现在该层级的一个随机位置。几乎没有光线进入这个区域，因而流浪者将经历完全的黑暗，类似于夜间。唯一的光源是下文提到的火线（The Lines of Fire）。
//
//火线
//火线是一组相互连接的闪闪发光的线，能在Level 155的边缘附近发现，非常稀有。它们没有实体，可以很容易地通过。通过时，这些管线会发出热量，是Level 155的主要热源。
//
//火线有一个独特的属性：排斥Level 155的所有其他实体。这使得它们可以被作为流浪者的临时安全点。它们缓慢地弯曲，扭动，旋转，且不会对遇到它们的流浪者构成威胁。目前它们是否为生命体尚不明确。火线会周期性地改变颜色，从红色变为黄色，有时则是橙色。这些颜色明亮而鲜艳，光照强度也将根据颜色改变。在夜间，它们是Level 155中唯一持续存在的光源2。
//
//基地、前哨和社区：
//这一层级没有已知的基地、前哨站或社区。
//
//实体：
//死亡飞蛾往往会在拱门顶端筑巢。它们通常对流浪者怀有敌意，因此在Level 155攀爬拱门或大声喧闹来侵扰它们的巢穴是不明智的。
//巨大的尸鼠 群居住在Level 155，它们以地面上的垃圾维持生命。Level 155的尸鼠通常对流浪者保持中立，除非被激怒，否则它们不会攻击3。
//“疫疾”的菌株分布在Level 155各处。在此层级中，务必减少与所有墙体表面的接触，以防止感染。离开后，确保对任何可能接触到墙体表面的设备进行有害物质清除或是隔离检疫。
//入口和出口：
//入口
//目前只有五种已知的方法可以进入这一层级。
//
//深入Level 108有时会来到Level 155。
//Level 224的前门曾被记载能将流浪者送往Level 155。
//Level 448中监狱内的某些门通向Level 155。
//穿过Level 532的特定石门可到达Level 155。
//进入Level 797墙壁上的一个特定洞口可到达Level 155。
//出口
//目前只有一种已知可退出该层级的方法。
//
//爬上Level 155的顶楼可到达Level 19。
//[+] 作者
//« Level 154 | Level 155 | Level 156 »
//
//Footnotes
//1. 塑料袋、铝罐、糖果包装纸、香烟等。
//2. 由于未知的原因，所有其他发光物体似乎都会急剧变暗，乃至毫无用处。
//3. 最近的报告引起了人们对尸鼠群日益增长的敌意的关注。流浪者在Level 155遇到尸鼠时，应谨慎行事。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl155{}