//Level 145
// 
//
//生存难度：
//未分级 
// 
// 
//182cell.jpg
//一张低画质的在Level 145内所摄得的典型囚室的照片。
//
//描述
//Level 145内的场景具有高度重复性，其设计让人能想起21世纪前的监狱建筑，极易引发幽闭恐惧症。 这些房间内部潮湿不堪，处于被弃置的状态，具体表现为管道泄漏，角落遍布霉斑，墙漆起皮，还有能让其余物品与该层级的墙壁相混淆的斑驳墙体。
//
//在Level 145内的囚室大多都不会存在除进入其他囚室的两扇门外的另一扇门，而上述的连接门则能通往其余区域，如此便形成了一个联通了无数囚室的漫长直线廊道。大多数时候这些相同的构造最终会汇集于一处死路，这也意味着流浪者必须倒回去数英里来寻找另一条探索层级的道路。而例外则是一种以第三扇门的形式出现在囚室内的出口，遇见这种出口的可能性微乎其微。
//
//囚室本身以网格状进行线性排列，而这些狭小的囚室则会分别以边长4英尺，6英尺或8英尺的正方形为底的长方体状的形式出现，地面距天花板有8英尺。囚室内的墙壁暗淡肮脏，粉尘四散，充斥着上文所述的潮湿腐臭气味。而每个囚室的墙壁原本应由灰色/白色的砖块或混凝土构成，同时其颜色斑驳陆离的墙面漆则本应统一为冷色调的单纯青灰色。
//
//Level 145本体并非无限延展；但是其狭小的囚室的集中堆叠则使这个层级看起来极为庞大。层级内的囚室数以万计，每个囚室内都有遮挡严实的铁栅，内部存在着大囚室间容纳更为微小的囚室单元的空档。正因如此，在Level 145内找到其他流浪者难如登天，除非流浪者结伴前往本层级。
//
//182window.jpg
//在Level 145数不胜数的囚室之一内的一面窗户。
//
//182dark.jpg
//Level 145内一个没有窗户的囚室，暗淡无光。
//
//Level 145并非由传统监狱中的白炽灯泡和荧光灯照明，而是由在约75%房间内都能出现的窗户进行自然采光。这些小型的，坚不可摧的窗户会向囚室内射入一道闪亮的白光。尽管存在着如此耀眼的白光，但是因囚室本身构造的问题，这束亮光最多只能照亮囚室内一半的空间。
//
//与后室内存在的其他窗户不同，也非实体窗户的位于Level 145内的囚室内窗口是具有外景的。在窗沿的可以看见以90°水平无限延伸的石质人行步道，这些步道向前平铺，直抵白茫茫一片的天际之外。在窗户的两头则可以看到石砖或混凝土基底的摩天大厦，如扭头望天，看见的则是无尽延展的砖块，混凝土墙还有偶尔可见的玻璃窗。
//
//下方可见的街道——从窗户远望的视角——由极度典型的城市景观构成，街景上也充斥着饱满而富有生机的奇异色彩，尽管这种过于绚烂的色彩不可能在真正的城市景观中出现。街上建筑的建造年代和建筑风格不尽相同。这些建筑的内部构造是可见的——观察房间内景——其内部似乎经过精心装修，而街道的其余部分则充斥着各种街道饰物，如路灯，邮筒，建筑工地，随处停放的车辆和一大堆琐碎微小，不必赘述的细节。
//
//透过窗户经常能看到有疑似人类小腿的部位经过窗前，有时这些经过的个体还会成群结队地走过，发出沉闷怪异的脚步声与无法听清的私语声。这些个体具有可供辨认的面部特征，如发色、衣着和鼻部形状。从离它们咫尺之遥的窗户和窄道等地能观察到它们的类人形体，但无法进一步发现其余特征，因为它们的身上似乎笼罩了一层灰色阴翳，掩盖了身体的其他部位。
//
//182end.jpg
//Level 145内一个单向通行囚室。
//
//Level 145囚室内的回声极其响亮，囚室本身可以让任何响度足够的声波在囚室内壁进行几乎无限的弹射。这些回声有时甚至可以滞留数小时至数天，以一种超乎自然的速率在墙间不停传播。回声一般由窗外的喧嚣声，流浪者的脚步声和移动囚室内家具所发出的噪声组成。在极少数情况下可以听见响彻囚室的尖叫人声。
//
//目前尚未明确这是否为恐慌下发出的嚎哭，抑或仅仅是层级内原生实体对此类声音的刻意模仿。即便如此，流浪者仍不应在任何情况下去追溯这些声音的源头。来到此层级却未能归来的人多数是因为囚室过多且补给匮乏。而这些怪异声音的源头则是这些人未能生还的次要因素。
//
//入口和出口
//入口
//Level 145因其难以切入的性质而闻名，究其原因是它的出口少得令人咂舌，其间隔又极为遥远，以至于分布于两个不同层级的入口甚至都无法互相连通。即便如此，我们还是找到了下列的两种入口。
//
//Level 145的主要切入方式是借道Level 448并尝试切入层级内任一监禁室内。特定的监禁室会随机让流浪者被马上送入Level 145内。
//作为备份方案，第二种更为可靠的入口则能在Level 95内被找到，其入口与层级的地下深处相连接。与Level 448的随机出口不同，在Level 95地下深处区域的囚室内极难找到出口，如有出口，那其便必会通往Level 145。
//出口
//离开Level 145难度极高，部分原因是其庞大的体积与其囚室极其狭小的空间。目前唯一已知的Level 145的出口以一种极为少见的随机木制的门出现，想要找到此类出口流浪者必须在层级尽头游荡足够长的时间并找到内部存在上述木门的囚室。
//
//目前Level 145唯一已知的出口通向Level 563，而这个出口则会将流浪者带往此层级通道的起始处。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl145{}