//Level 114
// 
//
//生存难度：
//等级 怀乡…？
//
//欢迎回家
//放下忧愁
//吧…？CF04C83F-1139-4DBF-8BC2-CADCCE9CBBF5.png?width=623&height=467
//Level 114许多变化形式中的一种。
//
//Level 114是后室的第115层，由流浪者Janine Brown于2021年4月17日发现。它表现为流浪者童年卧室的形式，在卧室的门后存在一个无限延伸的黑色虚空空间。
//
//描述
//Level 114在空间上具有不同步性——除去一些个例，每个流浪者所见的该层级都是独特的，并无法察觉到其他流浪者。这一层级的外形就像每个流浪者在青春期前（约9-12岁）的童年时代的卧室。
//
//暂不知道当流浪者的童年时代有不止一间卧室时，Level 114的变化如何。如果一个流浪者的童年时代有不止一间卧室，那么Level 114将会呈现出类似于Level 38的混乱空间结构，通常被流浪者描述为“许多房间无规律的融合在一起”。此外，如果两个或以上曾共用同一个房间的流浪者同时进入Level 114，他们将出现在同一空间。除非满足这个条件，流浪者无法观察到同时存在于层级内的其他流浪者。
//
//当流浪者进入Level 114，他们通常会发现自己站在门道中，面向房间。他们身后的门微微半开，而门外除了一片漆黑的虚空之外别无他物。
//
//除去虚空，房间内的床也是在所有Level 114的表现中唯一不变的。在所有Level 114的表现中，流浪者童年时代的床将被完全相同的一张单人床替代。1这张床的床垫被紧密地安装在一个木制床框上，床单是蓝色的，底面绘有花卉图案。床单中有大量的床虱，躺在床上的流浪者经常会发现自己暴露的皮肤被叮咬并出现皮疹。
//
//此外，Level 114内的大多数电子设备以及电器无法使用。这种现象是非正常的——当检查时，这些设备的元件从未出现过可识别的错误。幸运的是，被流浪者带到Level 114内的设备不受这种现象的影响，可以正常工作。尽管如此，能用的电池或其他电源仍然无法为此层级内被影响的设备供电。
//
//此层级内唯一能正常工作的电器似乎是默认打开的电灯开关。尽管如此，房间内的灯光也不会像流浪者童年时代卧室中那样表现。灯光无一例外地呈现出黯淡，单调的白色，仅仅能够照亮周围的环境。建议流浪者无论在任何情况下都不要关掉房间里的灯，这会使隐藏在黑暗空间的笑魇出现并攻击流浪者。
//
//虚空
//虚空并不是该层级的“屏障”，而是该层级的一部分——通过门道可以随意出入虚空，并且包含可呼吸的空气。该空间中的重力比较低，产生了类似让流浪者可以漂浮于水中的效果。
//
//尽管如此，流浪者的运动无法抵消掉空间的引力。换句话说，在虚空中向上游泳是不可能的，而掉入虚空的流浪者们将永远沉溺于黑暗。从来没有尸体从虚空中被追回，目前推测那些坠入虚空的人最终会死于脱水。
//
//不像其他类似的空间，这里并没有潜伏在内的骇人恶兽，但你也绝不能在此放松神经。从房间内凝视无边无际的虚无，如同于海湾眺望张着血盆大口的汪洋，那口中充斥着如同墨水般黑暗的虚空，我敢肯定绝对没有人能深陷其中后安然无恙地返回。虽然暂时没有观察到什么生物从中显现并吞噬那些战栗的过路人，但也许确有什么恐怖的怪兽潜伏在这之中。
//
//仔细端详这个萦绕在心头不去的鸿沟使人想起死神那无情的咽喉。意识到这样的命运正等待着我们每一个人的灵魂实在是令人战栗——甚至是在这里，这个失落的世界——在我们平凡的旅途之终。那门后的房间也没有任何的舒适感，单调乏味，丝毫没有生灵的痕迹，仿佛虚空中那逐步逼近的恐怖存在已经爬了进来，遮蔽了空间，扼住了生灵的咽喉，直到那可怜的灵魂在这房间中成为死去的一个挥之不去的阴影，这就是大多数人的命运，对徒劳的生活感到绝望却无能为力，只能眼睁睁的被黑暗的深渊吞噬。
//
//——节选自το χαμένο βιβλίά του χώρου (to Chaméno Vivlíá tou Chórou)2，第拾贰卷。
//
//选文1：对Level 114虚空的描绘，摘自失落军团的文件（约公元650年）。Leo Castellos 提供。
//
//为了防止流浪者掉入虚空并一命呜呼，M.E.G. 在门把手上系了一根长约150码(约137米)的绳子。不小心掉进虚空的流浪者可以“游”向绳子，然后用它爬回房间。3不小心掉进虚空的流浪者可以“游”向绳子，然后用它爬回房间。
//
//实体
//压迫霉菌
//最近研究表明，Level 114有一种独特的霉菌，它生长在房间墙壁和天花板上的小块区域。这种霉菌似乎具有诱发焦虑的特性。分析表明，真菌的赘生物中含有一种目前尚未确定的蛋白质，这种蛋白质导致了霉菌强烈的“沉闷”气味。研究发现，这种化合物可以刺激人类大脑中管理压力反应的部分，增加肾上腺素水平，引发焦虑。
//
//当有人待在房间内时，压迫霉菌会迅速增长，导致流浪者的压力水平随着时间的推移逐渐升高。已知在一个人进入大约8小时后，该房间内的霉菌会超过阈值，对人体呼吸和神经系统健康构成威胁。因此建议流浪者不要在Level 114逗留太久。
//
//笑魇
//此层级的床底藏有很多笑魇，在黑暗的地方它们会更加密集地出现，比如橱柜或抽屉的内部。当灯亮着的时候，它们会待在黑暗的空间里，不会对流浪者造成威胁，但是关掉房间里的灯会使它们显现并攻击。
//
//窗户
//房间里的窗户偶尔会被实体替换掉。4童年时代的卧室有窗户的流浪者应当保持警惕。如果流浪者童年时代的卧室没有窗户，他们就没有什么可担心的。
//
//基地，前哨与社区
//由于Level 114的面积过小和空间不同步的性质，没有建立任何基地，前哨或社区。
//
//入口与出口
//入口
//通过一扇门进入任何层级时都有小概率进入 Level 114。
//出口
//在这个房间中睡着，你就会在 Level 9 的一条街道上醒来。
//用沉闷的声音说“我好无聊…”会让你出现在Level 25 。
//有一个很小的可能，门把手上会绑着三个不同颜色的气球！如果你想要找点乐子的话，就去触摸他们，你会到达一场有趣的派对哦！=）
//采访记录
//M.E.G.为Janine Brown进行了如下采访。作为第一个成功进入和离开Level 114的流浪者，她得以被记录在档案库中。
//
//收起采访记录
//采访记录 10328
//<记录开始>
//日期：5/26/2021
//时间：16:42
//采访者：M.E.G. 档案员 Lake Kesler
//受访者：Janine Brown
//
//Lake：那我们就直接谈正事吧?
//Janine：（坐立不安）好吧……
//
//Lake：太好了，谢谢配合。你能告诉我们你看到了什么吗?
//
//Janine：我…我在我的卧室里…我小时候住的房间。
//
//Lake：好的。你能描述一下你的房间是什么样子吗?
//
//Janine：面积大概是16英尺乘20英尺？墙是米色石膏板，地毯是灰色的，床靠在门口左边的墙上，上面的墙上贴着一张芭比娃娃的海报。还有个粉色的小凳子，用来装我的夜灯。右边的桌子…你们常用的那种…宜家的桌子，我想。壁橱在正前方，是白色的，木制推拉门。像往常一样，玩具和东西满地都是。但是，一切都有些奇怪，我没有在家的感觉。
//
//Lake：你能描述一下你所观察到的不同吗？
//
//Janine：床不一样了。我绝对确定。我的床单是……鲜艳的粉红色。我小时候特别喜欢粉色。但在这里，床单是深蓝色的，上面画着一种恶心的的花卉图案。我觉得它也不太干净，躺在上面一段时间后我有点痒。
//
//Lake：好的，还有别的东西吗?
//
//（Janine沉思了一会儿。）
//
//Janine：有股霉味。像腐烂的木头之类的。并且…很…冷。
//
//Lake：“冷”，你指的是温度很低，还是—
//
//Janine：嗯…是的，温度确实很低，但是……不，不是那样，不只是那样。我感觉这间屋子好像一个已死去的肉体，毫无生机。
//
//Lake：嗯…
//
//（Janine停顿了一下，整理了一下思绪。）
//
//Janine：是……是因为灯光。我肯定，灯光全都……是错误的。在前厅的时候，我在多伦多做室内设计师。而且我觉得我做得很好。
//
//Lake：好吧，我有点跟不上了，这有什么关系呢？
//
//Janine：我在建筑学院学到的最重要的东西，也是我们学到的关于室内设计的第一件事，就是照明。大多数人都不会想太多。但它真的可以成就亦或毁掉一个地方。过于黑暗时，人们会变得抑郁。过于明亮时，眩光会让人们变得焦虑或疲劳。而灯光色调太…冷时，人们就会变得…坐立不安。
//
//Lake：我明白了。那么，请问要如何描述你房间里的灯光……或者，嗯，你发现你自己进入的那个层级里的版本？
//
//Janine：你还记得楼梯间的那些灯吗？就像，在那些丑陋的混凝土建筑里，通常没人用的那些楼梯间，因为大家都坐电梯?
//
//Lake：记得…
//
//Janine：没错，就是那样的，毫无生气。只有……丑陋、昏暗、白光。这让我感到恶心。它覆盖整个房间，让它变得……苍白。我仅仅是能看清整个房间，但是完全没有家的感觉。
//
//（Janine停顿了一下，不舒服地挪了挪身子。）
//
//Lake：好的，那是你小时候的房间的感觉吗？
//
//Janine：不，绝对不是。我的房间永远是明亮而温暖的。我记得我的灯是淡黄的，我还有一盏小夜灯，它的形状像一只鸭子，和咖啡杯差不多大小，我叫他芬恩。他将阴影驱赶到柜子里，将那里变成我的屋子里唯一黑暗的地方。
//
//（Janine停顿了一下并回忆。）
//
//Janine：并且充斥着粉红色。爸爸从没有同意重新粉刷墙壁，但是我的床单，我的玩具，我的裙子，我的椅子还有我的我的芭比公主书包，都像郁金香一样粉红。
//
//Lake：那如何描述你对你过去房间的感觉?
//
//Janine：我很喜欢我的房间，它几乎是我的整个世界：涂鸦、作业、玩玩具、和凯西还有莉兹一起过夜。
//
//（Janine温柔地笑了，当她回忆起美好的时光，她的脸上露出一丝温暖。）
//
//Janine：当然，我的童年并不是只在房间里度过的。但对孩子来说，你的房间就像你的城堡，你自己的世界。当我在学校过得不好的时候，它就是我的避难所，把我与世界及其尖锐的边缘隔绝开来，只与自己独处。它就像我的第二个母亲，或者第一个姐姐，那是一个庇护所。
//
//Lake：（点头）这么说有点奇怪，但我明白了。
//
//Janine：我知道房间没有生命，但是，作为一个室内设计师，一个房间是可以有某种灵魂的，你明白我的意思吗?
//
//（Janine的眼中闪烁着热情，Lake点头。）
//
//Janine：不过人总是会留下痕迹。就像草地上人们留下脚印，或者你在桌上写字时留下墨迹。或者你坐了几年的椅子开始发出吱吱声。
//
//（Janine兴奋地比划着。）
//
//Janine：我们去的地方总会留下一点我们自己的影子。当然，这会让这个地方不再是原始的或无瑕的……但这恰恰赋予了它一些个性。就好像这个房间开始成为我们的一部分。它给了房间一点生机。
//
//Lake：多可爱的情感。
//
//Janine：就是这样的。
//
//（一阵舒适且短暂的沉默笼罩着空气。）
//
//Janine：但是这世界上没有不散的宴席，不是吗?
//
//（Janine眼中的光芒很快消失了。）
//
//Lake：我……我想是的，但这有什么关系?
//
//Janine：人类是善变的，他们的居所也是如此。
//
//（现在她的声音里有一丝悲伤。）
//
//Lake：嗯…
//
//Janine：我最终会搬出我父母的房子，上大学，找工作，然后在城里有了栋房子，并遇到了一个人…我和他订婚了。
//
//（Janine停顿了很长时间。她脸上的悲伤似乎加深了。她的眼神空洞，茫然地望着远方。）
//
//Janine：…被他出轨了，我在悲伤中开始学会喝酒，撞毁了我的车，失去了我的工作，如此生活几年，直到我被困在这个地方。
//
//（她的语气带着尖锐的苦涩。）
//
//Janine：我曾经还是个小女孩，她的世界里有优雅灿烂的花朵，有暖和温柔的床铺，有天真烂漫的美梦，她梦想着快乐的生活，梦想着美好的婚姻，梦想着成功的事业…但她…她不在这里，也永远不会出现了。
//
//（有那么一瞬间，她的眼睛里闪烁着怒火。但很快，这种神情就消失了，她脸上又浮现出那种萦绕不去的、死一般的表情。）
//
//Janine：那就是我进入的层级的感觉：死亡。就像以前的那个小女孩一样。再也没有笑声了，再也没有过夜了，再也没有粉红色了，就像蝴蝶离开后留下孤独的茧壳。
//
//Lake：所以…那都过去了？
//
//Janine：是的。
//
//（她苦着脸。）
//
//Janine：并且，我一开始总是幻想着自己会化茧成蝶，现在，我不那么确定了。
//
//（停顿了一下。Janine挪了挪身子，用手捂着脸，若有所思，眼睛继续注视着远方）
//
//Janine：我意识到，我才是那个茧。那个小女孩带着希望与梦想早已高飞，而我，我则被困在这死亡的躯壳中孤独的望着她。
//
//（沉默再次降临，它带着些许忧郁。）
//
//Lake：听到这些我很难过。
//
//Janine：没事，又不是你的错。
//
//（Janine的脸上又露出一丝苦笑。当Lake结束采访时，房间里的气氛变得轻松了许多。）
//
//Lake：你可能会感兴趣的是，我们确实从外勤特工那里听到过类似的报告，但你是我们正式记录的第一个案子。
//
//Janine：（带着一丝假得意的神情）看来你们欠我一个奖。
//
//Lake：你还注意到房间里有什么不舒服的地方吗？
//
//Janine：我试着打开了门，外面仅是黑色的虚无。我立刻想到了Level 6，厌恶浮上心头。我从桌子上拿起一支笔，把它扔进虚空，而它就像沉进水里一样往下漂。
//
//Lake：看起来你很聪明…但我们最遗憾的就是许多流浪者都像单细胞生物。
//
//Janine：哈。
//
//Lake：但如果门无法使用，你是怎么离开的？
//
//Janine：我在房间里待了一会儿。我想这可能有一个机关，四处找东西，但都没用。几个小时后，我开始坐立不安…灯光几乎起了反作用。最后，我准备试试山魔王仪式。但当我坐在床上看手机上的使用说明时，我想我那时有点打瞌睡了。而当我醒来时就发现自己来到了Level 9。
//
//Lake：嗯，我想这就是我们需要的全部信息。很高兴认识你，Janine。
//
//Janine：很高兴见到你。事实上，能说出来让我松了一口气。我感觉我要把不舒服的经历抛在脑后。
//
//Lake：我很高兴你这么想。
//
//<记录结束>
//结论：这些记录与现场工作人员口口相传的报告以及后来对其他流浪者的采访一致。一个M.E.G.小组被派去寻找Level 114的入口，以便进行进一步研究和记录。
//
//作者（们）以及图片授权
//« Level 113 | Level 114 | Level 115 »
//
//Footnotes
//1. 有多张床的房间只会有一张被替换，其他床不会出现。在罕见的情况下，若流浪者童年时代的卧室没有床，层级的床仍然会出现在房间内的适当位置。
//2. 译注：此段希腊文意为空间的失落之书，貌似为原作者捏他萨迦利亚·西琴的书籍《恩基的失落之书》，此处借鉴俄分在此处的处理不译。
//3. 此层级的空间不同步属性在虚空中会被削弱，导致绳子在Level 114的所有表现形式中都存在。通常情况下，流浪者扔到虚空中的物体不会被其他进入本层级的流浪者看到。然而在绳索固定了几个小时后，此层级似乎已经允许它永远固定在建筑上。
//最初用于探索虚空的绳索是由M.E.G.的研究人员Joshua和Josiah Hale留下的。在预测中，一旦探索结束，它就会随着此层级的形态变化自发消失。然而，一个星期后，Hale兄弟回到该层级进行进一步研究，却发现绳子完好无损。
//
//4. 那些不是实体的窗户将通向虚空。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl114{}