//Level 199
// 
//
//生存难度：
// 
// 
// 
//描述：
//dreamforest
//艺术家绘制的 Level 199 的景象。
//
//梦之森，古老而珍贵，一直以来都在后室的传说中有重要的地位，据说只凭梦境就能进入这片浑然天成的乐园。不少人为找到这里想尽了办法，Level 11 甚至有商贩打着帮人进入 Level 199 的招牌，出售起了各种药片粉末。有关该层级的各种报告真假不一，这份层级档案也因此变得尤为复杂。
//
//传言，Level 199 有无尽的河流、湖泊、溪谷，远方则是无数群山环绕；地面上覆满了翠绿的植被，到处都是超乎想象的奇花异草。有关层级内动物的报告寥寥无几，人们看到的也许只有幻象和飞体二物。
//
//显然，丰富的自然景观是这里最常见的事物，但流浪者们常常也说，层级中有不少废墟。此地曾经有砖瓦砌起，只是如今早已被人遗忘。以此看来，Level 199 中也许生活过不少有智慧的实体。
//
//层级内的时间行进异乎寻常，在此地驻留数十天，外界也许只会经历片刻；而有时，状况又会完全相反。不少流浪者曾报告自己在其中旅居数月却无需任何补给，似乎 Level 199 已满足了他们的一切生理需求。
//
//纠缠庭园
//garden.jpg
//画中描绘了园内横跨中世纪城墙的金字塔。
//
//一些流浪者深入层级，便发现越来越多的人造建筑映入眼帘，而“纠缠庭园”就是层级内建筑最密集的地点。庭园内，各式建筑肆意矗立、交错盘桓，一如野蛮生长的植物。砖瓦彼此纠缠，围出一座混乱不堪的城市。
//
//庭园中遍地是没有出口的道路、引向虚空的走廊与无法抵达的房间。其内有数条运河，但河中都没有注水。反倒是一些被侵蚀的小路上会出现流水，一直流过房屋、广场乃至可供行走的小巷。
//
//城中有无居民至今无人知晓，庭园是否为人工打造也是个谜团。虽然街道上能看到独特的文字，似乎是智慧生物所写，但整座城市实在没有任何功能。有人觉得这里以前遭受过某种灾变，但具体情况如何仍然无法确定。
//
//飞体
//orb3
//一名流浪者从 Level 199 中醒来后画下的飞体。
//
//飞体是 Level 199 内唯一的“实体”。飞体所属的生物种类还不明确，甚至它们是否有生命也仍待考证。飞体的外形呈球状，身体由无数相互覆盖的发光条带组成。层级各处都能找到它们的身影，不过庭园附近和内部的飞体最为密集。
//
//遭遇飞体的流浪者说，它们会带领人前往庭园，尤其是城内最中心的区域；那里，空中翱翔着成百上千的飞体。城内的建筑都向飞体倾斜，仿佛它们身上有某种引力。不过，位于飞体附近的流浪者们却没有感到被牵引。
//
//庭园中央立着一座小塔。这座塔虽已历经沧桑，但却完好无缺，仿佛城内混乱的力量并不能叫它有分毫损坏。有几名流浪者登上了塔顶，看见塔内有一个基座，但似乎缺少了一块零件。也许正是因为这基座有所毁坏，城内才混乱不堪，也不见一个人影。
//
//Isidro Martínez 的回忆
// 
//他们让我留一份档案记录，我并非想拒绝，但是……打探别人的梦境多少有些古怪吧？虽然听说我的梦境可能是一个层级，但我始终觉得这场梦是我的私人体验，只想留给自己珍藏。
//
//不过最后，我还是决定分享一下，不去操心那么多了。
//
//我如何进入了那场梦，现在已经记不清了。梦里，我只发现自己全身都变得清澈透明，仿佛我已化身鬼魅。我起身四视，周围宛若天国：树木葱茏让人顿感亲切；气候温暖而不致燥热；光线充足但不会晃眼；真是一片乐土。
//
//头脑中，我对时间的感知模糊了。现实里我昏睡了一个月，但在梦中却似乎只有几天。那几天里，我探寻着超乎头脑想象的神迹，漫步在长久无人涉足的小径。梦里的整个世界似乎都已被人遗弃。
//
//我在梦里漫无目的地行走，遇到了那样……东西，我实在无法确切地描述它。单说外观，它看起来就像很多丝带缠绕成的球体，单是在脑海中复原它的样貌就让我很头疼。至于它究竟是什么东西……我确定不了。我感觉它并非活物，而是像整个梦一样空虚；但是它却为我带路，当我停下欣赏美景时，它就在我身边盘旋，等待我继续跟随它的脚步。
//
//那样东西，那个球状物，一直带我走出深林，步入了一条石径。四周的人造物（或许也不是人造，但各位应该懂我的意思）让我感到惊奇，我便从梦中苏醒了。我隐约记得看到了远方的某样东西，那是……我记不清楚了。我在小径上被惊醒，也许就是因为看到了那样东西，但也可能是别的事物。但不管如何想，我都记不起来了。
//
//我真的记不起来了……
//
//基地、前哨与社区：
//Level 199 处于梦中，而且进入其中的流浪者从未与他人相遇，因此层级内不太可能建立任何哨站。
//
//入口与出口：
//入口
//该层级只能由梦境进入，此处列出一些对进入该层级有帮助的做法。
//
//在自然景观较多的层级内入眠，比如深红森林、 Level 37、Level 797。
//保持镇静。如果情绪不稳定，感到焦虑、懊悔，则会难以与层级建立稳定的连接。
//有很多商人会贩卖帮助人进入 Level 199 的药品，但是我们还未确认这些药品的实际效果。
//出口
//要离开 Level 199，只需醒来。不过这可能很难办到，不少流浪者感觉自己被“固定”在了层级内。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl199{}