//Level 121
//消逝之岛
// 
//
//生存难度：
//等级 2
//
// 
// 
// 
//121shore.png
//隔着水面望去的主岛一景。
//
//121highest.png
//在最高点拍摄的Level 121。
//
//Level 121 是后室的第122层。
//
//描述：
//Level 121 是一片由森林岛屿组成的群岛，位于一片可能无边无际的海洋中。Level 121 似乎包含六个大小不一的岛屿（其中三个已命名），其中最大的岛屿艾里希亚（Irisia）有30平方英里（77.7平方千米）。其昼夜周期是地球的两倍。这个周期似乎并未对这些岛屿的宜居性产生影响。气温从未高于85°F（29°C），也从未低于30°F（-1°C）。
//
//本层级的气候最为符合温带。空气不自然地静止，因为几乎任何时候都无风。然而，这里有极度频繁的杏仁水降雨，偶尔还会有暴风雨。这里的实体不会受到杏仁水的负面影响，并饮用它来维生。
//
//岛上的大部分森林都很古老。本层级最著名的实体，紫眸者，已建立小型定居点，并清除了其周围的森林，在边界上创造出新的森林。
//
//约有300名紫眸者居住在这一层级。其中大多数居住在艾里希亚岛一个名为多玛之土（Domum Terra）的定居点，有大约150人口。另外两个次大的岛屿，维奥莱塔（Violeta）和韦尔贝纳（Verbena），各有大约50人口。在其它较小的岩石岛屿上，还分散着一些孤立的个体。在海上，木船和浮动房屋中，是剩下的50名个体，他们共同生活在一片名为多玛之水（Domum Aquae）的船群中。
//
//本层级最奇怪的一点是，主要陆地定居点的许多道路和建筑都通向海洋。就在地表以下，能够看到水下的房屋与道路，进一步通往更深处。当被问及这一点时，多玛之土的居民反应激烈，拒绝解释，因此目前只能从理论上推测。
//
//岛屿上拥有种类繁多的动植物，与前厅中发现的非常相似。然而，许多物种的外表有所改变，且表现与它们的前厅对应生物有很大不同。有些生物具有危险性，有些生物有用或无害。在Level 121 中探索或拜访M.E.G.使馆时，务必注意以下动植物：
//
//动物：
//折叠
//蝶象：
//121butter.png
//田地中的蝶象。
//
//蝶象是一种温顺的动物，是迄今为止岛上最大的动物。它们的数量稀少，而且相距甚远，但每一只都对周围的地区产生着深远影响。其外表与前厅中大象相似，但却是独居动物。它们的头部两侧没有大耳朵，取而代之的是蝴蝶般的翅膀。它们真正的耳朵要小得多，藏在翅膀后面。蝶象利用这些翅膀来制造风，摇落树上的水果，或掀落树枝上的猎物。它们是杂食动物，既吃水果也吃小型哺乳动物，如猫鸟。被激怒时，蝶象会迅速扇动翅膀，产生一阵猛烈的强风，可以吹走体重较轻的人类。虽然它们不构成严重的危险，但建议不要打扰它们——紫眸者对该物种持保护态度，任何伤害蝶象的人都会被逐出村庄。
//
//极乐羔羊：
//极乐羔羊在紫眸者群体中极为重要，且倍受尊敬。尽管极其稀有，但它们经常出现在紫眸者定居点的边缘。极乐羔羊的习性与普通羊相似，只是在其毛发中长有非功能性的紫色眼睛。紫眸者经常把这些眼睛割下来，作为珠宝佩戴。每隔一段时间，来自多玛之水的紫眸者就会航行到主岛，从多玛之土带走一只极乐羔羊，然后在水手节上把它献祭给家乡。
//
//跃鹅：
//121geese.png
//跃鹅在一次短跳后浮出水面。
//
//跃鹅无论在视觉上，还是在生物学上都与加拿大鹅相同。然而不同的是，它们会从水边的岩石上高高跃起，然后一头扎进下面的海洋。它们主要利用这种方法来捕鱼。
//
//猫鸟：
//猫鸟是紫眸者的主要肉类来源。它们既被视为家禽，也被视为害兽。它们相对无害，但仍会攻击任何快速移动的事物。它们还会同类相食，因此猫鸟必须彼此分开饲养。猫鸟完全成熟的周期为两周。成年猫鸟体内一直携带着两枚鸟蛋。猫鸟死亡后，鸟蛋会从尸体上吸收营养、成长发育，因此紫眸者建造了猫鸟围栏来收集它们的蛋和肉。
//
//六角海星：
//121star.png
//浅水池中的六角海星。
//
//六角海星让人联想到前厅的海星，除了其身体中央有一只奇特的眼睛。它们被命名为六角海星，因为每个个体都拥有六条手臂。它们生活在岛屿海岸的浅水区，可以用手臂在地上缓慢爬行，它们的眼睛能够旋转180°，以提供广阔的视野。六角海星是食草动物，它们用身体底部的钳子磨碎海底的海带和植物。
//
//蝠蜂：
//蝠蜂是前厅中蝙蝠和蜜蜂的混合物。它们拥有蝙蝠翅膀，比蜜蜂略大，但比蝙蝠小。蝠蜂表现出很高的智商，并以用细枝和树叶筑巢而闻名。它们偶尔还会从蛛网树上收集网状物作为建筑的粘合剂。与前厅蝙蝠不同，它们视力极好，像鸟类一样成群结队地飞行。它们拥有利爪，以便在授粉时保护自己免受触角花的伤害。蝠蜂个性温顺，除非过于接近它们的蜂巢，便会产生激烈的领土意识。它们的毒刺可以长到2英寸（5cm）长，如果对准脖子，足以致命。蝠蜂蜂巢通常看起来像球形的鸟巢。
//
//植物：
//折叠
//蛛网树：
//121spider.png
//结满网状物的蛛网树。
//
//蛛网树是Level 121 中一种常见且极其重要的树种。与大多数植物不同，它们是肉食性的，模仿蜘蛛的狩猎习性。它们没有树叶，而是长出类似蜘蛛网的网状物，在树枝之间延伸，捕捉任何飞入其中的东西。 未察觉的猫鸟是蛛网树的主要猎物。这些网对小昆虫和动物来说是致命的，但对紫眸者来说，这些网很容易从树上剥落，并作为粘合剂用于各种建筑和物体。它们还被用作编织织物的丝线。
//
//触角花：
//121flower.png
//闭合的触角花。
//
//触角花是生长在一些外观正常的树木上的小花。每几朵正常花中，就有一朵是触角花。触角从雌蕊中伸出，寻找昆虫，如蝠蜂。一旦接触，它们便开始闭合并刺透皮肤，从受害者身上吸取血液。它们通常对人类没有危险，但能够造成轻微的伤害，就像黑莓丛的刺一样。
//
//针果：
//121fruit.png
//针树上的针果。
//
//针果是紫眸者食用的主要水果。其外壳像坚果一样坚硬，但可以通过施加足够的力量，或使用木制工具打破。据报告，果实的味道像花生。针果生长在针树上，而针树分布在紫眸者定居点的边缘。许多当地动物也用其他方法破开外壳，食用里面的果实。
//
//基地、前哨和社区：
//多玛之土（Domum Terra）：
//多玛之土是艾里希亚岛上最大的城市，也是整个层级中最大的城市。它拥有大约150名紫眸者人口，和他们的海洋兄弟相比，该地居民拥有独特到惊人的文化。当要做出重大决定时，多玛之土的所有成员都会聚集在村子中央，进行多数制投票。多玛之土由一些木材、树叶、岩石和毛皮打造的建筑物组成。这些建筑材料通常用蛛网树的网粘合在一起。尽管他们的建筑杂乱无章，但多玛之土的居民似乎已经围绕着一个被称为 "园丁 "的据传不朽的现实扭曲者发展出了自己的文化。在多玛之土的海岸边，一块巨石顶上刻有一尊这位存在的石雕，面朝大海。这座雕像纤瘦而高大，头上戴有月桂花环，脖子上围着一条长围巾。最值得注意的是，它的卷发被醒目地涂成了紫色。
//
//还观察到有一座回头望向园丁的雕像。这座雕像几乎完全淹没在水中，由相同的材料制成。只有头部露出水面可见。当被问及时，紫眸者不情愿地将这座雕像称为“水手”。水手雕像拥有长长的黑发、锯齿状的牙齿，以及刻在皮肤上的鳞片，使它几乎看起来像一个半人的海怪。它那明亮的紫色双眼永不停息地从水底注视着多玛之土的定居点。
//
//多玛之土的居民对艾里希亚岛的本土物种极为保护。他们在Level 23 与多玛之土间切入切出，以获取稳定的木材供应。由此，除了需要腾出空间建造房屋外，他们无需砍伐Level 121 的树木。不推荐在多玛之土的紫眸者面前伤害任何本土物种，即使是猫鸟。
//
//多玛之土的公民很友好，只要遵守他们的习俗，他们愿意进行贸易。他们的饮食主要包括猫鸟和针果，在交易时会提供这些资源。
//
//多玛之水（Domum Aquae）：
//多玛之水是Level 121 的第二大定居点。它是一个由船只与浮动木屋组成的集合体，距离艾里希亚岛和多玛之土的海岸约5英里（8km）。许多船只停泊在浅水区，与淹没在水面下的古代建筑遗迹相接。多玛之水的公民以大鱼为食，并在屋顶收集雨水饮用。他们对贸易不太友好，但在某些情况下仍然愿意。如果在多玛之水钓鱼，必须只保留最大的鱼——为了维持生态环境，习惯上会把小鱼放归大海。
//
//多玛之水的公民崇拜水手。每隔100天，就会有一群公民航行到艾里希亚，把一只极乐羔羊带回多玛之水。在那里，他们将献祭极乐羔羊，庆祝水手的伟绩，其中包括创建Level 121。虽然水手是多玛之水的主要神灵，但公民们也会以较小的方式庆祝园丁。在多玛之土则不然，在那里，水手被完全回避，并被排除在任何庆祝活动之外。
//
//M.E.G.（又称“探险者总署”）紫红大使馆：
//紫红大使馆由M.E.G.建立，用以管理人类与Level 121 中紫眸者的外交关系。目前有5名活跃成员。补给品从深红森林经由Level 23 运送至此。如果发现自己身处Level 121，最好的办法是找到大使馆，它位于多玛之土最右边。大使馆已经帮助了无数迷路的流浪者回到深红森林。
//
//入口和出口：
//入口
//Level 121 可由Level 23 进入，但具有几率性。为此，必须进入该层级的水库，但可能会将流浪者切入其他层级而不是Level 121。正因如此，M.E.G.认为该入口并不可靠。紫眸者能够始终经由Level 23 回到Level 121，但其方式仍未披露。Level 121 也可由潜入Level 134 海洋的方式进入。从Level 125 的海岸横渡海洋，也可能带人到达Level 121 的岛屿。偶尔，尝试从Level 7 的洞穴入口切入Level 8，反而会带流浪者来到这里。
//
//出口
//121exit.png
//通往Level 23 的出口。
//
//Level 121 总是可以通过多玛之土边缘附近的一棵奇怪空心原木离开。紫眸者们总是乐于向流浪者展示该出口。这个出口通向Level 23。潜入海洋可能将人切入Level 85 的船体附近或Level 97 的岛屿附近。横渡海洋最终将带人来到Level 125 的海岸。
//
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl121{}