//Level 158
// 
//
//生存难度：
//
//凶恶
//
//和平相处
//实现凶狠计分
//准备感受冲击
//ONSLAUGHT_STATION_BABEY.png
//散落在层级中许多海报的一张。
//
//Level 158，通常被称为”猛攻站”，是后室的第159层。其采用了12站地铁的形式来与其他实体作战。
//
//描述
//Level 158内包括了12个地铁站，每个地铁站都以十二星座中的星座来命名。只有白羊座站和双鱼座站可以上车，其他十个车站都有一种无形的力量阻止人员下车。两个车站各有四个售货机，两台出售食品，两台出售饮料。这些货物似乎是无限的，其中没有任何一个货架是空的。两个车站都有一卫生间，其都可以自楼梯后面进入。所有的卫生间都十分潮湿，且镜子通常都有雾。这两个可以上车的车站与Level 11的地铁相似。显著的区别是，地板，墙壁或天花板上都贴有“猛攻站”的广告海报。这些海报可以带出层级外，并且是Level 158内自然出现的唯一易燃物。此外，其中的一些海报宣传了Level 714, 其感谢了放克贩子所提供的“音轨”并且告诉人员去参观该层级。
//
//两个车站之间有两种旅行方式，——要么登上火车，穿过十个车站；或者进入任意一个卫生间并在镜子上画一个“T”图案。每24个小时，站台的灯将关闭10分钟并在此后重新开启。Level 158的居民将其称为“夜晚”。在此期间，所有的海报都将被替换且自动售货机将更新他们所选择的食物/饮料。脱离于层级的光源依然可以被创造，例如手电筒或火焰。Level 158仅在列车上没有人员时才会出现”夜晚“。在此期间内，没有观测到敌对实体的产生。
//
//Level 158的主要居民是一个名为 猛攻瘾君子联盟
//Onslaught Junkies United
// （简称”OJU“）的团体。这些居民不是Level 158的本地居民，相反，他们均为通过一个入口进入该层级的人员。该组织声称其不负责层级内的海报，而是在欣赏了地铁的整体美学风格并产生独特的文化后决定留下来。他们没有领导者，所有的重大决策由所有人投票决定。他们之中的部分成员对两个站台的触摸屏信息亭进行了重新编程，并为他们提供了多种功能。所有的的信息亭都可以显示OJU排行榜与列车的安全影像。其还对火车上出现的可能实体进行了详细概况，包括排名系统以及应对各个实体的措施。每个信息亭都有一个”声音测试“，让人员可以收听上面所提到的”音轨“。
//
//抵达该层级后，一个称自己为“售票员”并带有美国加利福尼亚州口音的响亮声音，将欢迎人员到达该层级。无论人员进入哪个车站，该声音都戏剧性的宣布其为“猛攻站”。通过列车到达十个无法下车的站点之一后，一个随机的武器将在面向站台的座位下生成。该武器可以是传统的武器，如刀，手枪或者棒球棒等；也可以是更加独特的物品，如遥控手套，装满了未知酸性物质的水枪或能够产生可见声波的麦克风等。其中一些物品的运作方式仍在研究中。因为一次仅有一人可以进入列车，如果有人员试图将武器带出列车，将遭遇一堵不可见的墙。同样的，自外部将武器带入列车内将遭遇相同的效应。
//
//此外，每个车站将会有三个随机实体登上列车。值得注意的是，出现的实体似乎没有偏离M.E.G.的数据库的范围，因为未在火车上发现新的实体。需指出的是，类似杰瑞，Blanche，与游戏大师一类的特殊实体可以登上列车。这使得M.E.G.认为所有实体并非真实的，而是Level 158所创造的副本。目前仍不清楚其是如何做到这一点的。
//
//上述实体将保持静止直至车门关闭。这时，售票员会通过对讲机喊道“你知道该如何做！”。在此之后，对讲机将播放指挥消息以及来自Level 714的音乐。同时，所有的实体将恢复正常的行动，其中的部分明显较实际实体要弱小，具体原因仍未知。有些人员认为其为列车为每个车站均进行公平的的竞争。当实体被击败或列车到达新站点时，实体将切出列车地板或者停止存在。在被动/有用的实体的情况下，人员可以选择要在每站点停留十分钟以离开他们或者击败他们。
//
//特别的是，尽管存在数个极度敌意的实体，但在列车车厢内似乎没有死亡的可能。列车的幸存者报告说，当他们正常情况下会死亡时，他们将自列车地板切出，并最终到达了他们最初到达的车站。所有与列车有关的伤势都完全痊愈。如果人员在回到站台之前跌入了轨道并被列车撞倒；抑或流浪者受到严重伤害并失去行动能力，如截肢等，同样该效应同样会出现。此外，所有进入Level 158的物品都经过了化学性质的改变，来消除通过未知方式发生过敏反应的可能性。同样的，任何伤口或疼痛感将在再次进入白羊座或双鱼座时消失。
//
//根据观测，列车自身的速度非常快，但只有在三个实体都被击败或者在十分钟后才会到达下一站。特别的，列车有一个明显的前部车厢，任何登上该车厢的尝试均失败。所有的列车车厢均无任何污染且无法被损坏。上述车厢只有座椅，灯以及窗户，所有记录在案的车厢均无扶手或栏杆。车厢两侧的门均无法打开。
//
//活动列车
//部分情况下，会出现被称为”活动列车“的特殊列车车厢。这些车厢将在旅途中替代普通车厢。
//
//这些车厢具有特殊的效应，能够指定一个特定实例的实体并在特定车站上车。该实体将是指定车站唯一登上的实体，只有在击败该实体后列车才会到达下一站，上述过程没有时间限制。这些事件的例外将在其编号后加上菱形。以下为截至2021年7月15日所有已知的活动车厢事件的记录。
//
//值得注意的是，活动车厢似乎仅出现在自白羊站上车时。据OJU的说法，其因为白羊站适合“更具有竞争力的成员”，而双鱼站则更适合“悠闲体验”。
//
//收起活动列车记录
//207号： 一辆明显大于标准大小的列车，其内部有5cm深的冷水，但站在其内部为安全的。该列车本身约有一个体育场的大小，但具体尺寸仍未知。该车厢保证了七层之物的实例。其通过从车厢地板涌出到达了水瓶站。其体型明显小于实际体型，且再生能力弱于实际。尽管如此，其依旧十分危险。许多OJU的成员称其为“奔跑杀手”。
//
//740号：一辆标准的列车，除了其天花板上布满闪烁的眼睛。该车厢保证了到达天秤站的阿尔戈斯实例。该实例与实际实体的外观有着很大差别，其被描述为“内部有着七只眼睛的不断旋转的的环形链条”。该实例通过一自发显现的巨型木槌来攻击，该木槌逐步的通过车厢并试图粉碎人员。其展现出了比先前被击败的无定形与具有飞行能力实体更强大的能力。该实例的七只眼睛中能够发射出彩色的激光，并能够使被击中的人员无法移动。当其击败时，所有的眼睛切出了地板，但锁链保留了下来。其中的一个锁链断裂，这使得能够作为鞭子来使用，尽管其不是一种有效的武器。
//
//1042号：一辆标准大小的列车，其内部有一放置有Macintosh LC 475的桌子。上述物品可以出现在列车内的任意一侧。该列车保证了Photoshop的实例。其一共在旅程中出现了三次。一次为金牛站，一次在狮子站，还有一次在天蝎站。一旦出现，人员可以牺牲手中的武器来立刻前往下一站，也可以冒着失败的风险来与其进行战斗。普遍选择的策略是权衡手中的武器并牺牲手中最不有效的武器。值得注意的是，人们可以将个人物品牺牲给其，但并不建议这样做，因为这将导致物品无法挽回的消失。
//
//3394号：一辆内部类似宫殿的列车，其比标准列车都长，宽出许多。有一条长长的红地毯通向楼梯，其上有一金色的王座并带有红色的天鹅绒靠垫。当到达狮子站时，王到达列车并坐在王座上。在其期间大门无法进入，所有试图损伤王的尝试均失败。当列车开始移动，其将开始召唤33波动画。自第三波开始每波将增加两个动画个体。
//
//只要至少存在一个动画个体，王就将保持不受攻击。一旦33波动画个体全部被击败，王将变得脆弱并亲自加入战斗，实例将拔出一把被称为“神剑”的武器。需注意的是，这与真实的实体相比是不真实的，这使得这种偏差受到注意。当王被击败，其将在没有剑的情况下切出车厢地板，从而使得人员在剩余的旅途中使用剑。剑能够用来击败一片实体，若人员能够击败王，它将成为一种相当有用的资产。
//
//6768FUN号：一辆装满气球和彩色纸屑的标准列车。特别的是，其将在每个站点生成三个派对客和三个扫兴客的实例。上述实体将通过相对的门进入车厢。扫兴客的实例通常是友好的，除非其受到攻击，否则不会伤害人员。随着时间的增加，派对客实例的数量将会增加，而扫兴客实例的数量将会减少。与真实情况不同，与派对客实例接触会导致人员的肾上腺素激增。此种情况在人员失控前发生了十次。使得该效对于人员来说为一把双刃剑。值得注意的是，售票员会用友善，高亢的声音喊道“让我们聚会吧！”。
//
//7841号：一辆类似于污水管道的列车，其保证了射手站的催眠者实例，同时保证了在其抵达之前用萨克斯作为武器。这是在列车上获得萨克斯的唯一已知方法。催眠者将给人员20分钟的时间练习萨克斯，然后准备自己的萨克斯并让人员参加萨克斯决斗。人员也可以主动开始萨克斯演奏以开始竞赛，催眠者将同时开始竞争。人员将依靠在旋律上超越催眠者来取胜，目前仍未知如何具体做到这一点。根据OJU的指南，想要击败催眠者，人员必须在演奏中投入情感与激情。
//
//99389号：一辆狂欢节主题的列车，车窗被剧场窗帘覆盖。这辆列车保证了摩羯站的游戏大师实例。其提供关闭列车内所有灯光来进入列车，并出现在列车中央。在灯光恢复前，其用聚光灯暴露自己。实例将召唤一张桌子来使人员有足够空间就座。与游戏大师的战斗并非物理意义上的战斗，而是通过三种游戏之一，即四字棋，军旗大海战以及糖果世界。如同真实的游戏大师一样，实例会尝试在每次游戏中作弊。人员可以通过赢得游戏或揭露其的作弊来取胜，后者将戏剧性的宣布其的失败并切出车厢地板，包括桌子和游戏。
//
//84241-◊号：一辆类似于动物救援中心的列车。旅程将以更高难度的标准进行，每站会产生六个实体而并非三个，或者在每站产生更多的活动列车事件。此外，武器会每隔一站产生，而不是每一站。当人员到达射手站，其将会遭遇拉斯普京·巴塞洛缪国王三世的欢迎。车厢里的所有武器都会切出车厢地板，同时，人员的所有伤口均会愈合。在遭遇该实例后，最后两站将不会出现实体。人员可以利用这段时间与其玩耍。无论是否意外，都无法伤害到其。如果流浪者感到无聊，那么该实例的毛发将不会作为Level 241的入口，而是作为通往火车站目的地的入口。当该入口被启用时，列车将在人员站起的三秒后到达车站。
//
//140906-◊号：最独特的活动列车之一。该列车至少有一个站台大小，中间有一张桌子和椅子，武器将会在桌子下生成。装满书的书架排列在列车内部的墙壁上，所有的书本都无法被拿起。Blanche实例将在上车后立刻出现，且其的行为与真实实体近乎完全相同。该实例将通过与真实实体类似的心灵遥控来帮助或阻碍人员。该实例不喜欢的行为包括：咒骂，损坏书架/书籍以及不礼貌的行为。值得注意的是，其针对实体采取非致命的应对措施。例如解除其的武器或使其内讧等。除上述细节外，该旅途与正常情况相似。
//
//基地、前哨与社区
//白羊前哨站
//由M.E.G.在白羊站建立的前哨。
//该基地利用列车针对敌对实体进行训练，同时记录Level 158实体与其他层级实体的差异。
//双鱼前哨站
//由M.E.G.在双鱼站建立的前哨。
//该基地主要集中于与其他M.E.G.基地的联系以及针对层级力学的研究。
//猛攻瘾君子联盟 (OJU)
//由20个人组成的永久居住于该层级的组织。
//所有成员均为十几岁或二十几岁，其使用90年代的俚语并用昵称互相称呼。
//每个成员都将列车视为一种竞技运动，并根据独特的评分系统对所有成员进行排名。
//通常友好且愿意提供建议与食物。
//> 关闭排行榜
//OS_TOP_10_LEADERBOARD.png
//2021年7月15日的前10名排行榜。
//
//发现
//Level 158的首次发现是一名OJU成员“xXx_GrandCentralSmackdown79_xXx”，通常简称为“GrandCentralSmackdown”，自Level 11的地铁站内走出且手里拿着“猛攻站”的海报时被发现。他开始宣传这一层级，其似乎为一场体育赛事。几名M.E.G.成员被邀请“观察冲击，很酷的家伙们”，在此之后，其带领人员进入地铁，到达了双鱼站。
//
//入口与出口
//入口
//乘坐Level 11的地铁有时会到达双鱼站或白羊站。若人员在乘坐时有意识的想到Level 158，该情况一定会发生。
//据报告，Level 59内有条隧道通往白羊站。目前仍不明确是否同样有通过双鱼站的隧道。
//有五个自Level 61进入双鱼站的报告。
//罕见的，Level 2的一条走廊将通往白羊站。
//在Level 317大厅浴室的镜子上画出一个倒置的五角星将来到Level 158。
//出口
//双鱼站的楼梯将通往Level 11。
//白羊站的楼梯将通往Level 72的铁路。
//在列车离开后进入白羊站的地铁隧道将通往Level 59的隧道。在列车到达前进入将可能通往Level 2。
//在卫生间的镜子上画一个钻石将来到Level 317。
//使用信息亭的”声音测试“将轻松访问Level 714。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl158{}