//Level 135
// 
//
//生存难度：
// 
// 
// 
//135
//Level 135密集的树木。
//
//Level 135是后室的第136层。它看起来既像苔原，又像北方茂密的森林，这些森林非常神秘，并且有一些奇怪的属性，使得这个层级十分奇怪。
//
//描述:
//Level 135处于室外，它既像平坦的积雪苔原，又像亚北极地区茂密的森林。大多数流浪者最终在树林前切出。这一层级非常空旷，给人一种孤独的气氛，使流浪者感到抑郁和疲惫，但是这种影响会被足够的杏仁水抑制。这一层级没有昼夜循环，苔原和森林的天空从各个方向上都呈现出多云和乳白色的形态。在阴天时能见度会被极大限制，这一层级几乎没有声音，唯一的例外是每隔几个小时就能听到远处有窃窃私语声和嚎叫声。
//
//苔原是无限延伸的，苔原的某些部分有雪和流动的溪流。无论流浪者远离森林，往苔原中走多远，森林总是会在附近出现。森林非常茂密，但一队队的流浪者在试图进入这里时分道扬镳。如果流浪者在这里待太久，他们会开始产生幻觉，比较著名的幻觉是前厅的动物和人在苔原出现，或者他们爱的人出现在他们面前，却不和他们说话。
//
//这一层级明显缺少实体的存在，这里几乎是空的，例外是在树上目击到了笑魇，猎犬和两尾狐在苔原上筑巢，雄性的死亡飞蛾和 肢团比较少见。另外，实体很少被目击到。一些人一次又一次地宣称听到了不连贯的低语和远处的嚎叫声，但是声音的来源从未被找到。
//
//基地，前哨站和社区:
//狩猎者
//由一位叫做Sofia的女性领导，她在切入后室前就是一位专业的猎人。
//在这一层级打猎，目的是获取食物和锻炼。
//他们用肉，皮毛和资源交换武器。
//入口和出口:
//入口
//为了进入这一层级，你可以在Level -6的深处切入来进入Level 135。或者在 Level -7中的田野里进入睡眠状态，由于充满敌意的实体的存在，这是十分危险的。你也可以通过Level 47进入。一个流浪者进入的方式是从Level 93的山上走下，被绊倒后掉入Level 135。另外，这个方法从那以后就没有起过作用。在Level 140入睡之后，你也许会在Level 135的某个地方醒来。
//
//出口
//目前有三条已经确定可以离开这一层级的路。之前，在这一层级发现了 水井，跳进井中可以离开，它总是把流浪者带到Level 8，Level 66或者 Level 127。你也可以走进树林，找到一条狭窄的土路走1-4小时，你周围的环境会逐渐变成Level -7的景象。你也可以把自己埋进苔原的雪中，你会被带到Level 93或Level -5。Level 135的某些部分有时会通往Level 39。可以肯定的是，他们通过盯着周围的光线看到达了Level 39：如果周围变暗了，太阳突然落下，这是你接近Level 39的标志。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl135{}