//Level 125
// 
//
//生存难度：
//等级 1
//
//安全
//稳定
//无敌意实体Richfield_Gas_Station2C_Cucamonga.png
//“过往之层级”入口处第一栋建筑，以及“起点”。
//
//1024px-Cayuga_IL_Route_66,_Cayuga_to_Chenoa1.jpg
//“过往之层级”平稳道路的尽头，位于平原之中。
//
//Level 125 是后室的第126层。
//
//描述：
//Level 125 是在长度上进行延伸的66号公路的一复制品，其路边地带存在大量人类以及 Entity 147 居住。该地带从路边起延伸20英里，随后逐渐崩裂，并转为一不可居住地带。人与 Entity 1471 只能在距离路边30英里以内地带生存。Level 125 似乎拥有与地球相似的昼夜变化周期，但其周期时间长为26小时，而非24小时。由于层级的大小广阔，不同地区的天气可能不同，但总体遵循一月一变的规律，即同一天气每月重复一次。Level 125 的天空中无任何星星被观测到。该层级内也有来自前厅的一些动物，例如郊狼，鹿，蚯蚓，蛆，以及短尾猫，它们与只存在于 Level 125 内的其他动物一起栖息于此地。Level 125 独有的植物大多被发现在“道路的尽头”告示牌之外，所以大多数并未记录在案。
//
//在平原地区内有一名为“道路的尽头”的告示牌。由于该告示牌后方更远处的地带的空气中二氧化碳含量随与告示牌距离而增加，其后方地带逐渐变得不可居住。由此，该告示牌被认为标志 Level 125 的宜居地带的边界。尽管如此，二氧化碳似乎并没有渗入标志以内的区域和通往标志的大公路。此外，“道路的尽头”之后的建筑与前厅相比更不正常，例如加的油为 液态痛苦 的加油站以及售出不能食用且看起来恶心的食品的小吃店。距离道路25至30英里的地带之内的建筑变得扭曲而无法进入，甚至有时与之接触也极为危险。并且，20英里以外的建筑的标志文字以及产品名基本为无法理解的胡言乱语。
//
//虽然一些 Level 125 内独有的动物大多可以在宜居地带内找到，但 Level 125 内大多数独特植物均在“道路的尽头”之外被发现。由此，大多数 Level 125 内的独有植物均未记录在案。被记录在案的特殊植物有例如形状和大小类似橙子的紫色柑橘类水果，无籽的形似西瓜的蔬菜，以及带有乳酸的发光南瓜等等。除了独有植物，Level 125 内同样也有层级独有实体。下文为一详尽介绍层级内特殊植物，动物以及其出现的地点的列表。
//
//动物群：
//Level 125 内的动物
//植物群：
//Level 125 内的植物
//重要地点：
//Level 125 内的重要地点
//基地、前哨和社区：
//盛景港：
//盛景港是位于起点旁边的一规模庞大的沿海小镇，由于其良好的气候以及美味的海鲜而知名。由于该港口与任何其他大型社区的距离均很远，港口与其他社区间的外交关系被认为并不重要。
//
//人口：211
//实体147数量：342
//人蚁数量：67
//
//静水村：
//静水村是一近水乡村，位于裂石中部，由于其严密的安保以及炎热的天气而知名。目前，静水村与跃石村关系良好。
//
//人口：94
//实体147数量：156
//人蚁数量：23
//
//跃石村：
//跃石村是一位于稀树草原内的一以农耕打猎为经济体系的社区，位于裂石地区的最远端。如前文所述，跃石村与静水村关系良好。
//
//人口：76
//实体147数量：102
//人蚁数量：28
//
//新萧尼人镇：
//新萧尼人镇是位于橡乡中部的一大型农镇，由于其大量例如胡萝卜，土豆，卷心菜，蓝莓等等的农作物产出而知名。新萧尼人镇目前与静水村和跃石村保持紧密联系。
//
//人口：128
//实体147数量：210
//人蚁数量：40
//
//巨石村：
//巨石村是位于树林中部一大型猎人村庄。巨石村由于其皮毛制品以及其严谨的野生动物保护法而知名，该法律规定任何猎人不可在一周内捕猎超过三只动物，无论其体格大小。即使巨石村也有农业经济，相比于新萧尼人村的农业还仍为稀少。巨石村目前与新萧尼人村和边界村庄均保持良好关系。
//
//人口：182
//实体147数量：211
//人蚁数量：36
//
//边界村：
//边界村是Level 125 内最大的村庄，位于平原和弯曲小道的正后方。其高降雨量以及快速发展的农业和渔业使得其经常与其他小村庄开展交易活动。此外，一些在边界村之外的建筑内似乎每七天会重置并补充食物以及其他补给。因此，边界村被认为是停留在那里的流浪者的安全庇护所。
//
//人口：294
//实体147数量：410
//人蚁数量：57
//
//入口
//Level 125 的第一部分区域，即起点，有几率在行驶于Level 121的海上时发现。若流浪者在尝试离开Level 83时失败，则会有较大几率将会被海水冲到Level 125的岸边。在Level 4中可以找到破裂的木门，打开木门后流浪者将会切出至Level 125的起始建筑之外。若流浪者想进入Level 125 ，这是最推荐的进入方法。
//
//出口
//Level 125 可以通过从起点的海上行驶离开，此时流浪者将会遇见 Level 121 或 Level 100 的岛屿。若流浪者在树林中建筑扭曲点之外继续行走太远，其将会切入 Level 135。在”道路的尽头“标志更远处可以发现存在扭曲的农舍，进入农舍后流浪者将会切入 Level 10。
//
//作者（们）
//« Level 124 | Level 125 | Level 126 »
//
//Footnotes
//1. 译注：原文中此处仅有"147 instances" ，考虑到语义问题增加了链接。
//2. 译注： Davy Jones Lockers 本文直接照其本意翻译，下文将简称储物柜。
//3. 译注：原意为Road Jump, 结合其被碰触时反应，将其翻译为路突。
//4. 译注：原文为Determigrade，结合其分裂特性，将其翻译为裂熊虫。
//5. 译注：原文为Manants，即人蚁。
//6. 译注：原文为Breaking Point，结合其行为翻译为休息处。
//7. 译注：原文为Stomkins，结合其特点翻译为强酸南瓜。
//8. 译注：原文链接通往entity 25，为Plague Goblins，与沙蟹无关，在此放出原链接 http://backrooms-wiki.wikidot.com/entity-25#:~:text=Sark%20Crabs%20are%20noted%20to,terms%20of%20damage%20sustained%201.
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl125{}