//莫里贡特公国
//
//
//介绍
//Level 132，也称“莫里贡特公国”。该层级空间十分广袤，且有多个人口聚居地。尽管被称作公国，莫里贡特公爵自身却并非人类，因此，Level 132 不由任何人类领导的组织监管。其中的村庄多会自行处理内部事务，不受后室中的众多组织干涉（包括 M.E.G.）。Level 132 中存在5个村庄，它们人文习俗不同，地理环境相异；但整体而言，该层级的自然环境相对温和。相比于后室中的其他层级，此处环境多样、远离冲突、适宜居住，数名流浪者已经在此定居。因此，M.E.G. 决定将该层级的生存难度标记为0级。
//
//Level 132 中的人口合约800名，居住在其中的各个村庄中。公国面积约50平方英里（130平方千米），其外围只见悬崖不断向下延伸，直至白色的虚空；并未发现其外存在其他土地。该层级的异常特性之一是其中存在大量集市、商铺，可为居民提供充足的食物；因此，虽然可耕种的土地众多，居民们只会根据个人喜好选择是否在田园、农场中居住。
//
//Level 132 中的商店并不像中世纪中期的村庄商铺，而像是由现实中各个时空的商店拼接而成。当今地球上已不复存在的商店在该层级中复现，这些商店会不定期补货，兜售古今千年间存在过的各种商品，品牌多样，款式齐全，希腊古瓮甚至能与智能手机并排展示，不必吃惊。
//
//该层级中存在大量古玩珍奇、也有很多科技产品。因此，在这里，购物是人们日常生活的中心，也是广为盛行的消遣，各个村庄中心的店铺都装潢得光彩夺目。所有村庄的经济都完全由贸易商谈支撑，因为该层级中的各个商品都有其独特价值。公国中物品的货币价值不复存在，因为无论商品贵贱，商铺都会以相同的频率补货，且不需要昂贵的采购过程。该层级中的商品价值完全由人们的个人收藏所需决定。比如，倘若某人需要一颗苹果才能完成自己的水果收藏，而另一人需要一枚钻戒才能完成自己的珠宝收藏，那么此时，一颗苹果的价值就与一枚钻戒相等。
//
//贸易是各个村庄中最重要的活动，因此该层级的人们内部关系极为紧密，十分排斥外来团体。村庄的街头巷尾，尤其是购物中心和活动广场常常被清理得美观整洁，一尘不染。鹅卵石铺就的路上还会点缀一些桌椅长凳、花坛草丛，这些物件并不会妨碍交通，因为人们大都步行前往各个地点。Level 132 中最常见的商店种类是饭店，各个村庄中都能看到别具特色的烹饪场景和各式各样的菜肴。节日庆典在这里也非常普遍，每个村庄都有自己的独特节日。这些节庆的内容往往有关特定主题的商品——如鲁米利亚的手机节，波利斯薇尔的单车庆典。节庆期间，居民们均会展示自己的相关收藏。
//
//这里的人们非常喜欢收集特定品类的物件。不论某人的收藏是在数量还是种类上高人一头，他都会受到各方尊重。居民们的收藏一般是通过谨慎的议价、交易积累而来。有时，这里会举办跨村庆典，各个村庄都会展示出自己的珍奇货品。居民们最常以这种方式交易获得其他村庄的商品，借此丰富自己的收藏。在各自的村庄中收藏最繁多齐全的五个人会比较彼此的成果，其中最优者会去拜访莫里贡特公爵，并和他比拼彼此的藏品。话虽如此，至今没有任何一人收集的藏品足以胜过公爵，他是 Level 132 中最积极的收藏者。
//
//
//
//
//
//村庄
//
//
//波利斯薇尔
//
//
//织物之乡
//08PTSjC8.png
//
//
//人口：57
//环境：微寒温带森林
//主要商品：服装
//
//
//波利斯薇尔是该层级中面积最小、人口最少的村庄。该村庄地处莫里贡特公国的西部，内部经营着很多服装店。因此，该村庄的人文习俗多与造型、外貌有关。五个村庄中，波利斯薇尔的居民最喜爱装饰自己的住所，以物易物得来的各种物件会被用作每间房屋的装饰。
//
//各个时代的不同衣物在波利斯薇尔交替盛行，此处的时尚潮流在所有村庄中最为复杂精致，很多居民都说流行服饰的风格隔几个月就会变化。有时，易洛魁人的鹿皮衫和苏格兰短裙广受欢迎；有时，中国的汉服也会大为流行。一般来说，村庄中最优秀的收藏家会备受推崇，人们选择的服饰也会反映这位收藏家原属的民族文化，以表示对他的尊重。不过，在日常生活中，村民们常常会混搭，同时身着不同时代、不同民族的服饰，呈现一派颇具实验主义的神奇场面。比如，有人戴着魔术师礼帽，身上却会穿罗马宽袍、破洞牛仔裤，外加马裤、风衣。
//
//波利斯薇尔附近有数片花田，居民们在此种植、收获鲜花，用以制作天然染料。村庄内的不少商店都会提供衣料染色服务；为衬衫染色也在当地被视为成人仪式；一个人若想要成为波利斯薇尔的居民，也必须学会此项技能。波利斯薇尔的街道上满布花朵，几乎每户村民都会留有花园用于便捷制作染料。
//
//波利斯薇尔的人们认为食物的外观重于口味，即使是普普通通的廉价食品也要用心装饰，有几家烘焙店甚至专营食品装饰服务。不鼓励流浪者们去尝试波利斯薇尔的各种创新菜品，居民们过于注重装饰，可能存在食品安全问题，而且有些菜甚至不能食用。
//
//
//
//
//
//梅利亚
//
//
//建筑之乡
//dRwZi4sa.png
//
//
//人口：89
//环境：温湿的树林
//主要商品：建材
//
//
//梅利亚的人口较少，面积较小，都只大过波利斯薇尔。该地位处公国最南端，也因此拥有最温热的气候。梅利亚中的建筑风格多样，胜过其他村庄。此地也是发现 Level 132 时遇到的第一个村庄。当时村庄中仅有几座小小的连排房屋、一座广场，以及广场周边的商铺。但现在，梅利亚的面积已大大扩增，而且其中的每一座建筑都是由居民亲手打造。不少梅利亚的居民都有自己的豪华房屋，或在一条街道上有多处房产，这在此处非常常见。
//
//梅利亚的很多商铺都会贩售建筑工具、材料，以及园林工具，因此居民们对建筑都相当了解。很多人都具备设计师、建筑工、工程师等所需的能力，他们不是专业从事者就是业余爱好者。 梅利亚的房屋材料全部来源于当地商铺，建筑工们会根据自己的喜好选择房屋的样式。各种精心打造的房屋和豪华别墅点缀了梅利亚当地的风景，但有些房屋在结构上不如一般的安全。不少居民在盖房时会尽力造大造高，因为这里不存在像现代社会一样对房屋占地面积和高度的限制。这也使得梅利亚的街道往往蜿蜒细小，两旁布满了各种外形特异的实验性建筑。
//
//虽然梅利亚中也有少数人不参与房屋建造（一般是参与者的亲朋好友），但想要成为梅利亚居民并在其中盖房子的人，都需要证明自己能建造一座至少质量过关，不会伤及他人的房屋。这也导致梅利亚内部关系紧密，相对排外。不与他人一起居住的人必须拥有自己建造房屋的能力才会被允许在其中居住。
//
//梅利亚的居民通常都有其他居民无法建立的收藏：房屋。在梅利亚的各种节日庆典上，居民们会展开建筑比赛，或成单，或组队，在郊区附近修筑新房。由于类似的事件举办得很频繁，梅利亚内有很多房屋都处于未完工或废弃状态，居民们对待房屋的态度就与对待其他商品一样。最近，梅利亚中逐渐流行起可移动、可运输的房屋，因为这些建筑可以在跨村庆典上交换到别的优质商品。
//
//梅利亚崇尚简约烹饪，不同于别处，这里的食物往往清淡普通。居民们总是忙于修筑新房，因此更喜欢在工作时也能吃的简餐、零食。村庄内饭店稀少，但熟食店和烘焙店很常见，用于给居民提供便于携带的糕点、零食。不过，从某种程度来说，梅利亚的菜品十分古雅美味。
//
//
//
//
//
//弗思兰
//
//
//美食之乡
//FgfR2dlc.png
//
//
//人口：142
//环境：寒冷的半苔原
//主要商品：酒食
//
//
//弗思兰人口中等，地处公国北部。这里有最多的餐馆饭店，有些特定时空的饭店甚至只在这里经营。尽管此处天气寒冷，弗兰斯的居民们却都过着“温暖”的生活，因为这里的菜肴大部分都热气腾腾。进入 Level 132 的人们一般会因为此处阴沉寒冷的天气而拒绝在这里定居，因此弗思兰的很多屋子都是空的。弗思兰中的饭店数量远超人们的需求，因此这里总是会有剩余的食物。
//
//人们对异域的美食和稀奇的菜肴颇有兴趣，如果菜肴只能在弗思兰经营的餐厅或一些高档饭馆找到，则会更受欢迎。很多居民在找到前卫的菜品时并不会收藏起来，而是借此机会大快朵颐。居民们最喜欢、最推崇的食品是蛋糕。这种习惯使得居民们无法拥有太多的菜肴藏品，毕竟大部分食物都会被人吃掉。
//
//弗思兰的中心地带总能闻到各种古今美食的香气，几乎每家饭店都有户外用餐区，可供人们社交、聚餐。来到这里的流浪者们一开始总会觉得吃这么多很浪费，但是等他们适应了此处的习俗后，反而会跟居民们一样一天吃四餐——在晚餐之后还会加一顿夜宵，当地居民称之为“第二次晚饭”。因为要吃这一顿饭，弗思兰很多居民的作息时间和普通人也不同。在午夜，弗思兰的大街小巷依旧热闹非凡，寒冷的空气中尽是烧烤美食和蛋糕甜点的香气。
//
//虽然这里的食物精美豪华、丰富多样，其中一些食用起来也不完全安全。为了尽可能利用多余的食材，丰富烹饪手段，不少厨师和业余厨艺爱好者都会尝试制作前卫、实验性的菜肴，也正因如此，一些食物的食品安全问题无法得到保障。如果对尝试新型菜肴有所顾虑，建议还是选择传统且有品质保障的食物。
//
//
//
//
//
//罗希欧
//
//
//知识之乡
//nEWoV0SW.png
//
//
//人口：256
//环境：亚热带丛林
//主要商品：书籍
//
//
//罗希欧是 Level 132 中人口第二多的村庄，地处公国东部。尽管有不少居民在搬出罗希欧并迁往别的村庄，这里的人口仍然很多。罗希欧最大的特点是教育界的竞争十分激烈。其中的几所学校都在竞相收集各种有关知识、信息的物件，比如书籍、卷轴、数学工具、史料等等。此地最常见的商店是书店，其中出售书籍以及其他独一无二的记载了某些信息的物品（比如秘鲁绳结），这些物品的年代越是久远，其价值就越是高昂。
//
//之所以不少居民在从罗希欧的学校毕业后会选择搬迁，是因为学校内为各年龄段的居民配备了不同课程，培养他们对其他村庄专长有关内容的兴趣。而选择留在此地的人们通常会成为教师、或去书店以及其他商店工作，而且不少商店都会供应学校所需物资。不同学校间的竞争十分激烈，人们也由此分裂为不同的团体。不同学校的学生间常有极大的分歧，因为跨校交流时泄露的信息会被用于反对、诋毁彼此的学校。
//
//还有件事值得去往罗希欧的人们留意，那就是吃饭时要付两次钱：第一次的费用用于得知食物的价格、名称、原料，第二次的费用则用于购买食物，这与其他提供菜单式服务的商铺一致；但在罗希欧，不管去什么饭店，都要用这样的方式购买食物。
//
//虽然罗希欧的人口主要是成年人和青少年，但也有部分老年人。罗希欧十分开放，欢迎各个年龄的流浪者来访、居住，也不会像其他村庄一样为他们设置特定的考验，而罗希欧的学校也会竞相争取流浪者们的加入，不论年龄大小，均可入学。在某些领域有专长的流浪者在这里会备受尊重；而且，如果他没在罗希欧的学校中读过书，或是来自其他村庄，则会更加受人青睐。
//
//罗希欧的建筑风格和古老的大学校园相仿。人们的服饰在罗希欧则相对标准、统一，因为学生在出入公共场所时都需要穿校服。在这里，居民们会尽量把自己打扮得平平无奇，免得给其他人泄露有关自己的信息。因此，罗希欧的居民不如其他村庄那般紧密团结。
//
//
//
//
//
//鲁米利亚
//
//
//科技之乡
//ZLK8HFLL.png
//
//
//人口：324
//环境：温和的田园
//主要商品：电子设备
//
//
//鲁米利亚是 Level 132 中面积最广、人口最多的村庄。这里有最多的现代商店，科技也最为先进。鲁米利亚位处公国中心，也因此成为所有跨村庆典的举办地。
//
//鲁米利亚专产各种电子设备，因为这里面积广阔，店铺种类众多，此处的居民可尽享现代生活的便利。鲁米利亚的房屋内配有淋浴、冲水马桶、电视、现代厨房、洗衣机。此处可以购买到电脑、智能手机（但 Wi-Fi 信号时好时坏），还能找到各种其他村庄常见店铺的现代版本——21世纪的服装店、饭店、建材商店、书店；不过鲁米利亚内没有汽车店，这里的路也仍旧由鹅卵石铺就。
//
//较高的科技水平给居民们带来了其他村庄难得的便利和舒适，这也是此处人口众多的原因之一。鲁米利亚的居民们不需要操心日常的衣食住行，因此多半时间都在用买来的商品做些现代生活独有的消遣，比如：玩电子游戏、VR设备、摄影、绘画（包括数字绘画）等等。鲁米利亚的村民们不像其他人一样热衷于不断收集各种物品，他们很满意自己已经拥有的东西，
//
//因为这里十分安全，且有无线网络信号，流浪者们可以在这里休息并记录下自己的所见所闻。鲁米利亚有些居民也比较喜欢浏览 M.E.G. 数据库。数据库内有关此层级的大部分信息都来自于流浪者们在鲁米利亚发来的报告，但鲁米利亚和其他村庄一样并不会主动和 M.E.G. 联络。
//
//鲁米利亚的外围是公爵府邸。虽然公爵这样称呼自己的住所，这栋建筑的外貌却像一座11、12世纪的诺曼式城堡。公爵府邸只在年度跨村庆典时对外开放，此时公爵会邀请来自各个村庄的五名最优秀的收藏者进入城堡。不过，虽然公爵府邸的门常年关闭，公爵本人却常常在鲁米利亚的街上闲逛，有时他还会和居民做买卖。
//
//
//
//
//
//公爵
//
//I2xt5FwI.jpg
//公爵的速写像。鲁米利亚中一位居民所画。
//
//莫里贡特公爵是居住于 Level 132 内的一名类人实体。他友善、直爽，常常和人类互动。他的智力水平很高，会讲古今上下任何一种语言。
//
//公爵的个子很高，头戴一顶奇特的大王冠，身穿显眼的红色长袍，在人群中很容易就能认出来。公爵的脸是紫色的，面容深沉，有副尖下巴，还戴着一张金面具。他的腿被一种阴影般的物质遮挡着，几乎看不清。他的四肢和躯干附近还会不断散发出黑色的蒸汽。虽然样子古怪，但他非常友善，愿意和 Level 132 中的居民和来访者们合作。他常会找到来到 Level 132 的流浪者们，观察他们的物品，并尝试和他们做买卖；而即便流浪者拒绝此事，公爵也不会不高兴。如果流浪者们告诉公爵自己想离开，他也会把他们带去出口。
//
//虽然公爵个性谦逊，却喜欢在年度跨村庆典上发表一些夸张的演讲。公爵钟爱各个文化的戏剧、表演，会亲自参与其中，也会举办或赞助类似的活动。在庆典的高潮，公爵会将来自各个村庄的五个人请上舞台。这些人一般是各自村庄中最优秀的收藏家。
//
//庆典结束时，这五个人会跟随公爵去往他的府邸。跟随公爵离开的人通常不会再出现，但会有新的人接替他们的位置。Level 132 中的人们认为，公爵会和被带走的五个人打赌，赌谁的收藏更大更全。如果公爵输了，他就会把自己的地位拱手相让；如果公爵赢了，他就会取走那些人的收藏并命令他们离开公国。
//
//
//
//
//
//入口与出口
//
//
//在 Level 10 中，进入弓箭手们占领的塔楼时可能会来到 Level 132。也可以通过在 level 302 中的森林中长时间行走抵达 Level 132。
//
//Level 132 的出口位于鲁米利亚。在中心广场可以找到巨大的空心树干，进入其内的流浪者会被送往 Level 10 或 Level 121 的随机地点。此外，在公爵府邸内还有一处出口，但不知道该出口通往何处。抵达这个出口的流浪者们会因为输掉赌约而交出自己的电子设备，所以这些人的下落至今不明。
//
//
//
//附加信息
//查看附加信息？
//
//波利斯薇尔
//
//
//傲慢之乡
//你目空一切，但我……
//
//我比你更强。
//
//
//
//梅利亚
//
//
//贪婪之乡
//你贪得无厌，但我……
//
//我拥有的总比你多。
//
//
//
//弗思兰
//
//
//暴食之乡
//你咂嘴舔唇，但我……
//
//我已夺走一切。
//
//
//
//罗希欧
//
//
//嫉妒之乡
//你矜名嫉能，但我……
//
//我比你优秀太多。
//
//
//
//鲁米利亚
//
//
//怠惰之乡
//你好逸恶劳，而且你……
//
//你自己招致了此番下场。
//
//
//
//公爵
//
//
//
//我并非公爵，我乃魔鬼。
//
//
//莫里贡特
//恐怖真相
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl132{}