//Level 167
// 
//
//生存难度：
//等级 1
//
// 
// 
//不友好的人类社群baseball.jpg
//位于Level 167中心区域的棒球场，图片拍摄于一场比赛中。
//
//描述
//Level 167由一个有小城市大小的地区所组成。区域中的建筑风格类似于20世纪末期在建设中的城市-郊区风格。层级中的住宅和其他建筑基本上可以正常运作，但是它们总是表现出某种衰败的迹象，预测这种现象来自于缺少定期维护。很多不同种类的建筑上都有和本层级最大的两个社区有关联的涂鸦。本层级的地面由混凝土和湿润的土地所构成，但是却不存在包括草在内的任何类型的植物。
//
//本层级没有电力供应，但是有些住房里有可使用的自来水，这些水的温度和清洁程度在不同的建筑中并不一致。尽管缺少恰当的食物保存条件（例如速冻食品没有冰柜），但是在本层级的不同超市里，食物都可以食用。即使这些食物被带离本层级后，这些食物依然会保持可食用状态。通过某种尚且不明的方式，商店中的食物会定期补货。但是补充的新货只有当商店内有流浪者时才会存在，而且被观测到在一个流浪者离开和重新回来之间至少仅需10秒就可以出现。
//
//本层级中不同区域间没有物理隔离，但是如果从中心走的足够远，就能够到达其他层级。本层级没有昼夜循环，在它显橙色的无云天空里，太阳永远不会升起或者落下。本层级的中心是一个棒球场，可以观察到一群人经常会在里面比赛，但关于这群人我们知之甚少。
//
//基地、前哨与社区
//本层级有两个主要社区，可以通过它们所涂鸦的内容是本层级内的哪个棒球队来区别它们。这两个棒球队的名字分别是“奶昔队”和“烟味队”。本层级中心有一条白色喷漆线，它应该是这两个社区地盘的分界线。线的一侧有一副奶昔的粗糙粉笔画。另一侧用粉笔画了一个棒球，这是它们两个社群的Logo。两支队伍的粉丝都极端厌恶对方，于是双方的棒球比赛经常以暴力互殴而结束。
//
//对“奶昔队”粉丝的描述：
//奶昔队的代表色是红色和黄色，他们的logo是一个写了“M”的纸杯。“奶昔队”的粉丝以在第七局结束后的观众放松操时间唱的“战歌”而闻名。每局比赛唱的战歌都不一样，也不知道这些歌的作者是谁，或者他们是怎么组织起合唱的。最近他们的歌意义开始变得越来越模糊，增加了和声和不同的声部。下面是从他们表演里的一段主副歌节选：
//
//打得那些烟味队人的脏手握不住把。
//无比英雄的奶昔队员各个都能打出全垒打。
//用投手投出的球，打的他们遍体鳞伤。
//我们相信你们能做到，让那胜利的天平永远倾向我们！
//
//哦，哦，奶昔队，我们知道你们必胜。
//哦，哦，奶昔队，我们将同你们战斗到底。
//哦，哦，奶昔队，我们知道你们必胜。
//哦，哦，奶昔队，我们将同你们战斗到底。
//
//1
//对“烟味队”粉丝的描述：
//“烟味队”的代表色是蓝色和白色，他们的logo由一个画着生气的人脸的棒球以及用设计过的字体在棒球下面写的“烟味队”。烟味队的粉丝以他们贯穿整场比赛的有组织的跺脚和鼓掌而闻名。目前有怀疑认为，他们的这些动作里隐藏着一些信息，但是这些信息尚未被破译。以下是一种用一种增强的莫尔斯码所翻译出的信息：
//
//我们呼唤你，伟大的巴尔杜兹拉，万王之主，万主之王，赐予我们胜利吧，在那对抗奶昔队的战斗中，只因你可让天空战栗，让太阳破碎，只有你能打败那群令人恐惧的家伙。为回报你的恩典，你可以从我们之中选出任何人来永远服侍你！
//
//对运动员们的描述
//不难注意到，运动员本身好像并不属于这两个社区，而且据称他们住在棒球场地下。此外不难发现他们很少关注看台上的粉丝，甚至当看台上打的不可开交的时候他们任然在继续比赛，只有从看台上掉下来的尸体干扰了他们比赛的时候，他们才会暂停一会来搬运尸体。这两只队伍好像按照和前厅一样的规则进行比赛。不过他们会在每场比赛间交换使用一个特制的球拍，并且要求投手击球。
//
//入口与出口
//入口：
//在Level 40里去玩一个叫做“坏消息熊的极限棒球挑战赛”的街机游戏可以让流浪者传送到本层级
//穿过Level 168里“街区”的变种有小概率会通向本层级。
//沿着Level 480的走廊偶尔会让人到达本层级的超市里
//Level 777里一个叫“黑袜子”的专业体育赌场有门通往本层级和其他基于体育活动的层级
//出口：
//如前所述，只要离开棒球场足够远就可以前往其他层级。但是流浪者最终会去往的层级在很大程度上是不确定的。不过他们一般最后会到达有类似于城区或者教区风格建筑的层级。
//
//下面几个层级是Level 167去往概率最大的层级
//
//Level 98
//Level 132
//Level 153
//Level 220
//Level 648
//收件人：监督者Andrew
//发件人 Henry Sunter，M.E.G. Alpha基地
//主题： Level 167的人祭
//Date: 2021年7月15日
//
//嗨Andrew，
//
//我把我发现的一个事件报告发给你，个人认为这份报告值得深入研究，希望你能注意一下。
//
//incident_report_6_13_2021.txt
//
//M.E.G.事件报告 2021年6月13日，Level 167
//有人目击到居住在Level 167中，称为“‘奶昔队’粉丝”的一群人在进行人祭仪式。据推断，人祭的祭品是社群中的另一个成员，他应该是自愿参与以上仪式。由于M.E.G.成员并未参与其中，人祭仪式的具体细节尚不明晰。不过该仪式似乎包含有在众人同时手舞足蹈的时候用棒球棍击晕祭品的环节。
//
//2021年7月13日的更新：在仪式结束后的一个月里，这些人所代表的奶昔队胜率上升了7%。目前无法确实其与人祭这几件是否存在关系。
//
//考虑到这个仪式还有从另外一支队伍的消息中翻译出的向“巴尔杜兹拉”祈祷的内容，我确信这里存在着需要我们认真探究的事情。
//
//Henry Sunter, M.E.G. Alpha基地
//
//M.E.G.访谈记录 2021年7月23日
//被采访者：Harrison Young
//采访者：Henry Sunter
//前言： Young是被称为“‘奶昔队’粉丝”的一员。在人祭仪式之后我们设法联系到了他
//
//<记录开始>
//
//Sunter：你好，Young先生，你能告诉我一些关于奶昔队的事吗？
//
//Young：呃，如果这个也算的话，那我们队是最好的棒球队。
//
//Sunter：但是他们一季度的胜率不是比起他们粉丝的的胜率低了一点吗？
//
//Young：你这样还能算是一个奶昔粉吗？输了几场比赛不能说明我们不是最好的棒球队，唉。我们在联盟里也有最好的粉丝。
//
//Sunter：抱歉。那你能告诉我一些有关于你们“舞蹈”的事吗?
//
//Young：我也很为这自豪，我们练了好久这个。
//
//Sunter：除开这个，你们这个舞里有什么意义或者象征吗？
//
//Young：它只是我们表达支持的一种方式。
//
//Sunter：是这样啊，那你能和我聊聊“巴尔杜兹拉”吗？
//
//[Young看上去被这个问题震惊到了]
//
//Young（大叫）：不得高呼他的圣名！
//
//[Young猛扑向Sunter]
//
//<记录结束>
//
//后记：Henry Sunter最后在一只眼睛被打肿了之后设法逃离了访谈的地方。
//
//M.E.G. 事件报告 2021年7月25日
//在11局下半之前，奶昔队粉丝的手舞足蹈一直很显眼。但在11局中场，他们突然随着整齐的一声跺脚停了下来。这短暂的平静被似乎从天上传来的声音所打破。直到太阳似乎爆炸，整个层级笼罩在黑暗之中时，声音变得越来越大。这个时候天上出现了一个非常大画着脸的棒球冲着棒球棍飞来。考虑到这种情况，此时的奶昔队粉丝非常的冷静，随后他们突然唱道：
//
//归去 归去汝之来处
//你必不能糟践我的比赛
//归去 归去汝之来处
//回到那地方，那火焰的王国
//
//哦，奶昔先生，不来踩着我吗
//哦，奶昔先生，和他一起回归亡者的世界
//哦，奶昔先生，不来踩着我吗
//哦，奶昔先生，和他一起回归亡者的世界
//
//巨大的棒球在半空中停了下来，就像所向披靡的军队突然停止进攻。
//
//燃烧吧，燃烧吧，随着那烈火与权威
//你已成为我们的敌人
//燃烧吧，燃烧吧，随着那烈火与权威
//给家园带来空气与阳光
//
//哦，奶昔先生，不来踩着我吗
//哦，奶昔先生，和他一起回归亡者的世界
//哦，奶昔先生，不来踩着我吗
//哦，奶昔先生，和他一起回归亡者的世界
//
//巨大的棒球突然爆炸了，爆炸的火焰覆盖了整个层级，太阳也重新露了出来。在这之后比赛正常进行。
//
//比赛结束后几个奶昔队粉丝被询问了关于这件事的看法，他们总体上都表现出对这件事的鄙夷，说，“这已经是今年第五次了”，以及“要是他们（烟味队粉丝）再整这种烂活，自己就撒手不管了。”
//
//作者/协议与译者
//« Level 166 | Level 167 | Level 168 »
//
//Footnotes
//1. 鉴于译者水平有限，根本没有玩过棒球，对这里的歌词翻译不可避免的存在误解，如有大佬愿意斧正，译者感激不尽。此附原文链接：level 167的原文
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl167{}