//
//建立帐号 或 登入
//The Backrooms吧
//Backrooms Fandom Wiki
//The Backrooms中文wiki官方哔哩哔哩公众号
//Discord
//主页
//
//中文沙盒站
//
//图书馆
//
//层级
//|
//实体
//|
//物品
//|
//团体
//
//故事
//|
//相关人士
//|
//现象
//|
//设定
//
//搞笑文章
//|
//国际翻译中心
//
//原创图书馆
//
//原创层级
//|
//原创实体
//
//原创物品
//|
//原创故事
//
//原创团体
//|
//原创相关人士
//
//原创设定
//|
//原创搞笑文章
//
//原创艺术作品
//|
//原创现象
//
//网站
//
//最近创建的页面
//
//最近的更新
//|
//最近的编辑
//
//随机层级
//|
//随机原创层级
//
//随机实体
//|
//随机原创实体
//
//旧页面中心
//
//本月最高评分页面
//
//历史最高评分页面
//
//最低评分的页面
//
//社群
//
//讨论区
//
//翻译预定
//|
//最近的帖子
//
//作者页
//|
//中文网站作者页
//
//加入网站
//
//管理专用
//
//后台管理
//
//职员站点
//
//所有页面
//
//会员一览
//
//侧栏
//|
//顶栏
//|
//主题版式
//
//
//
//　
//
//Level 183
// 
//
//生存难度：
//等级 2
//
// 
// 
// 
//Level-183-1.jpeg
//Level 183二楼的一条小长廊
//
//Level 183是后室的第184个层级. 本层级是在2019年12月10日由前M.E.G.研究员Maria “Beehive” Julia发现的。
//
//Level 183是I.R.H.B.的总基地1，由前M.E.G.研究员Maria “Beehive” Julia在2020年1月14日建立2。
//
//描述：
//Level 183，也被I.R.H.B.称为“洁净下水道”，是一个巨大且异常干净的下水道设施，其完全被泳池瓷砖所覆盖。本层级的一部分被实体非水覆盖, 并且这里是此实体最常见的栖息地。 非水与干净的淡水非常相似，而且是在Level 183里唯一能见到的液体。本层级的自然光来自于无法被观测到的光源，其类似于从窗户射入的阳光。
//
//Level 183中的大多数实体似乎都被非水所感染。本层级里的常见生物是极其干净的白化症尸鼠3与雌性和雄性死亡飞蛾，但本层的雌性飞蛾会吐出无害的非水而非酸液.
//
//在本层级里留下的任何垃圾都会在无人看管的情况下消失。但这不适用于瓶子或碗等容器。
//
//楼层：
//Level 183被分为不同的楼层, 并且每一层又被分为由隧道互相连接的小房间。到目前为止，有三个楼层的地图已经被绘制完毕，第四层的地图也正处在绘制过程中。所有楼层都有大约4平方公里的空间延伸，并且每个楼层至多可以有10个房间，这些房间都由圆形的水平隧道连接。每层里位置随机的混凝土螺旋楼梯让人可以在各楼层之间移动。当流浪者将目光移开时，每组楼梯的位置都会发生改变。所有楼层都有照明，但光线似乎无法到达隧道内部。
//
//一楼是流浪者第一次进入本层级时会到达的地方。这里也是I.R.H.B.基地的所在地。本楼层没有任何非水的存在，所以这里是完全干燥的。但在本楼层可以找到其他实体。
//
//二楼是发现大量非水的地方，因为本楼层的一部分都被非水所覆盖。这一楼的空气一直很湿润，这使得本层的墙壁都变得很潮湿。水源源不断地从天花板上滴落下来。实体在本楼层能被更频繁地发现。
//
//二楼之上的其他已知楼层都被完全淹没在非水之中，I.R.H.B.正在慢慢地探索并绘制这些更高楼层的地图。三楼和四楼的建筑模式和大小似乎都与前两层相似。
//
//基地、前哨与社区
//I.R.H.B. (巢穴行为独立研究员):
//由前M.E.G.研究员Maria “Beehive” Julia与2020年1月14日在Level 183的一楼建立。该基地现在有10名研究员和20名勘探员。
//I.R.H.B.对除了M.E.G.之外的所有流浪者都表现得很友好。I.R.H.B.对M.E.G.成员持有高度的怀疑态度，并且只有在M.E.G.成员手无寸铁的情况下才会表现得友好。本基地的成员会对任何携带有未经授权的非水样本的人和任何被非水感染的实体采取敌对行动。
//大多数来自I.R.H.B.的攻击都是非致命的。他们只对那些对I.R.H.B.构成威胁的武装流浪者使用致命武力。
//报告显示，I.R.H.B.的周边地区由感染了非水的死亡飞蛾守卫。
//该基地对贸易高度开放，但当他们被要求提供非水的样本后，他们将会变得具有敌意。他们主要想获取电子垃圾和实验材料。
//入口和出口：
//入口
//在任何有洗手间的层级里，你可以从干净到令人怀疑的座便器切入进Level 183。这些座便器很少见，但最容易在连续的厕所隔间里找到。
//出口
//在没有被其他流浪者看到的情况下，在Level 183吃任何垃圾都会让你切出本层的地面并进入Level 183.1。
//在一楼的天花板上切出将会把你带回到你原来的地方。
//作者
//授权
//« Level 182 | Level 183 | Level 184 »
//
//Footnotes
//1. I.R.H.B.全称为“Independent Researchers of Hive Behavior”，中文名称为“巢穴行为独立研究员”
//2. 详情请见“基地、前哨与社区”部分
//3. 被I.R.H.B.称为“实验用尸鼠”
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl183{}