//Level 162
// 
//
//生存难度：
//宜居 
// 
// 
//concrete%20texture
//一张混凝土墙及其纹理的特写照片。
//
//concrete%20warehouse
//普通的房间平台——注意灰褐色的墙壁和极少的家具。在右方，还可以看到两个M.E.G.的水壶。
//
//Level 162是后室的第163层。
//
//描述：
//Level 162是一堵极大极厚的混凝土墙，墙的侧面会伸展出很多平台，这些平台上又有另外的墙体和天花板，内部还附有家具。根据目前的观测结果，无论是高度还是宽度，其墙面均向各个方向无限延伸。其墙下无任何支撑，因此与许多层级不同，Level 162实际上没有地面。墙及其平台前方为一个无限的浅灰色空间。这一层级虽然温和，但无任何天气因素，如雨或风，并且始终保持在79°F（29°C）的温度。 Level 162无昼夜循环，尽管光线与前厅白昼时段相当。观测表明，这种光直接从墙的对面照射到墙上。这束光线来自浅灰色的虚空，虽然目前还不知道这束光究竟来自虚空中的何处，如果在任何具体的方位。假定该种光源的大小可能是无限的。
//
//由于其众多的出入口，以及该层级本身的宜居性，Level 162已经成为层级间的交通枢纽。从某一层级进入会到达特定的平台，从某些平台离开会到达相应的层级。作为层级整体宜居性的一部分，Level 162物理属性的一个独特之处在于，从任何高度坠落都不会导致在撞击另一个平台时受伤。尽管如此，坠落时仍然会产生惯性。
//
//平台通过未知的方式从墙的侧面随机出现，并无缝地被吸回所述墙中。所有平台在任何方位都保持可见和稳定，从10分钟到几个24小时不等。通常地，当一个平台即将移动时，平台在移动之前会晃动大约30秒。接着晃动将停止，平台将移回墙内。这些平台可以通过其间生成的墙1的门和窗进出。如果在平台后退时仍有人在平台上，随着地板移动，他们最终会跌落到下面的另一个平台上，若在平台有四堵墙的情况下，他们会被动地切出。
//
//粗略的计算表明，平台的移动速度为每小时4英里，即人类的平均行走速度。平台的大小可能在250到3000平方英尺(76到914平方米)之间，尽管这些平台尺寸可能有极大的差异。次墙的高度通常在8到15英尺(2.4到4.5米)之间。大多数平台为方形、矩形或多个四边形并合在一起的组合。虽然偶尔会发现三角形和六角形的平台，但还无所记录平台偏离上述形状的情况。这些平台的次墙和主混凝土墙本身都有具有正常功能的门，尽管主混凝土墙上的门总是通向其他层级。次墙中出现的门则为Level 162内平台的入口与出口。平台的次墙上会出现窗户，但无证实窗户出现在主混凝土墙上的案例。
//
//broken%20wall
//一个普通平台上破损的次墙的案例。虽内部钢筋弯曲，但仍极其稳固。
//
//试验表明，混凝土墙可能会碎裂与损坏，但不会完全破裂。当从主墙上凿下小块混凝土时，新的混凝土将在30秒或更短的时间内填平孔洞，就像墙体在自我修复一般。由于墙的坚固性，这种混凝土的样本通常极其小，证明了其为由普通强度的混凝土制成的，即混凝土由未经加工的混凝土、沙子和砾石及沙子的骨料制成，每克的比例为1:2:4。邻近平台上的次墙也表现出同样的结构，尽管它们为可破坏的。当这些墙被拆开时，其似乎包含有支撑的钢筋。平台的地板由同样的混凝土混合物制成，尽管上面可能覆盖着由合成纤维制成的地毯，这些合成纤维有各种各样的颜色。钢筋也出现在地板比平台墙的数量更多。
//
//平台的地板由相同的材料制成。大约有一半的平台大部分是空的，没有重要的特征，而另一半类似于前厅中的房间。一些空房间可能有小型的家具，如餐桌和椅子，尽管这些家具往往比前厅的家具更易碎。对比之下，前厅样式的平台通常载满了各种家具。
//
//有些房间可能有电器，但唯独已知运作的电器是墙上的插座和电灯。管道系统与Wi-Fi等自然存在于后室的网络在Level 162上无法使用，但400-500 MHz或以上的无线电信号可以正常工作。这使得在超过3000英尺(914米)的距离上接收无线电传输变得困难。
//
//平台房室种类：
//blue%20bedroom
//一张由Wall-Wrangler Josiah Wilkins拍摄的卧室平台照片。
//
//卧室
//卧室是一种与21世纪早期美国郊区住宅的卧室类似的房间平台。其次墙总是被漆成浅棕色、蛋壳白色或亮蓝色再者贴上墙纸。卧室里的油漆或墙纸（连同Level 162的其他平台房间）也可以被破坏，会露出下面的灰色混凝土。卧室总为多边形，被描述为矩形合并在一起。卧室里的家具包括床、书桌、梳妆台、边桌和椅子，还有电视、照明设备和通风设备等电器。所有家具和电器都是用其前厅对应物的资源制造的。而墙壁装饰，如描绘前厅文化特征的绘画和海报（自然场景、乐队、电影广告等）十分常见。
//
//所有的家具和电器都是运作的。虽然卧室里没有可食的食物和水，但于卧室居住和睡觉均十分舒适。 卧室是居住在Level 162团体的休息区，也是迷路的流浪者和探险者的接待场所。通常卧室里有一张或两张床，这意味着床通常由多个人共用。
//
//abandoned%20kitchen
//一个厨房平台。除了水槽以外的所有器具均缺失，水槽无法运作。砖墙实际为贴上砖墙纸的混凝土墙。
//
//厨房
//厨房平台为类似于21世纪初美国郊区房屋中常见厨房的房间。厨房墙壁总是漆上白色或贴上不同的印刷墙纸，通常模拟砖块或木板。厨房通常为矩形或三角形，少概率为方形。与其他平台的门不同，厨房门由可滑动玻璃制成。玻璃几乎为半透明，只在另一面映射出模糊的形状。冰箱、水槽、灶台、烤箱和厨具是厨房里常见的物件，尽管它们从来都无法运作。然而，冰箱和烤箱中会出现可食、易腐烂的食物，包括各种新鲜水果和蔬菜。有时能够在水槽中找到饮用水，尽管水龙头永远不会运作。
//
//由于Level 162居民经常会有坏血症，因此人们希望厨房里有富含维生素C的水果和蔬菜。冰箱里可以找到柑橘、柠檬和酸橙等柑橘类水果，Level 162的居民会定量供应，这使它们成为最有价值的交易货物之一。厨房平台除了补充食物和水外，无其他用途。如厨房平台几乎无资源，通常会被层级的居民忽视。
//
//仓库
//仓库平台类似于大型仓库建筑的横断面。仓库平台始终为矩形，是唯一无次墙的平台。上方的天花板虽然为与主墙相连，但不会因缺乏支撑而倒塌，且保持于直立。仓库里唯一能找到的器具为长长的金属货架，货架上可能摆放着21世纪初风靡于世界各地的非功能性家用电器品牌。除了电器，还有一盒盒易腐食品，这些食品可能是新鲜的，也可能是陈腐的。这些盒子里装着许多常见的零食，如薯条、椒盐卷饼、牛奶巧克力和口香糖。仓库里均有瓶装的杏仁水，这使得其成为饮用物资的主要来源。
//
//仓库是食品与杏仁水的高频生成点。虽然食物无丰富的营养，但其确实令喜欢这些零食的人精神振奋。Level 162的主要群体则向无附属的流浪者售卖零食和杏仁水。
//
//店面
//店面平台类似于前厅的小商铺，主要为餐厅、熟食店和便利店。墙壁与地板通常漆上许多不同的颜色或覆盖着瓷砖，而平台形状通常为矩形、三角形或六角形。店面内有柜台、小桌子、椅子和21世纪早期典型设计的空自动售货机。与其他平台不同，店面平台中的可食用食物为正餐，通常为汤、三明治与熟食。也可以找到烘焙食品，如蛋糕和饼干。这些烘焙食品味道鲜美，如同刚从烤箱中取出一般。
//
//虽然店面平台上无饮用水或杏仁水，但许多流浪者也愿意饱餐一顿，他们想要的不仅仅是仓库里的口粮。由于这些食物如厨房般罕见，Level 162的居民极其关注店面，通常在搜刮一阵后只存留下器具。
//
//办公间
//办公间是类似于Level 0中的办公室的平台。其总体设计——办公间是唯一在平台区域有次墙的平台——与Level 0极其相似，但墙纸和地毯会有多种不同的颜色。办公间总会被次墙分隔，次墙无门或窗，尽管其所连接的主混凝土墙能够容纳门。这些平台从来没有天花板，而这是进出办空间的唯一途径，要么爬墙，要么从更高的平台跳进去，要么穿过主混凝土墙上的入口。
//
//办公间总是呈矩形，是饮用水的不错来源。办公间内器具丰富，在桌子或椅子旁边，极可能有一个饮水机。水壶可取出，能够由流浪者携带。办公用品，如纸、笔、剪刀和胶水，在办公间很容易找到，一些组织用其来制作标识服装。除水与办公用品外，Level 162内的办公空间无其他用途。
//
//浴室
//浴室平台类似于21世纪早期建筑中的公共厕所。浴室总是矩形或多边形的形状，并于墙壁和地板上贴有陶瓷瓷砖。厕所、水槽、镜子、间隔板与地面潮湿的标识是浴室中仅有的器具。在每个水槽和厕所都可以找到饮用水，这使得浴室平台成为收集水方面最重要的方式。
//
//由于浴室平台相对较小且易于寻找方位，并几乎总是能找到水，因此浴室成为Level 162较大组织进行清洁运动的常用对象。
//
//基地、前哨与社区
//concrete%20lab
//M.E.G.“混凝土骑士”;用于研究混凝土样品的底座显微镜与扫描仪。该实验室是可移动的——必要时，所有的设备均会被转移到更稳定的平台上。
//
//M.E.G. （A.K.A.“主要探险家集团”）“混凝土骑士”基地
//M.E.G.于Level 162建立的“混凝土骑士”基地由20名成员组成。由于层级不断变化的形势，该基地是M.E.G.仅有的移动基地之一，为了尽可能充分地探索混凝土墙，与壁牧者进行合作。这种合作是壁牧者和混凝土骑兵共同目标的一部分，目的是保证Level 162里的人的安全。
//
//混凝土骑士在厨房、仓库、店面与浴室平台上进行了大量的清理工作。他们与壁牧者的唯一合作是对主墙部分的进一步探索。每隔一英里，主墙上都会标记一个红色的喷漆X标记，从这些标记部分向前延伸的平台房间的外壁上也会显示这个标记。
//
//wall-wranglers%20symbol
//壁牧人臂章上绘制的符号，由简单的绘图软件仿造。
//
//壁牧者
//壁牧者是一群居住在Level 162的人，由104名成员组成。他们利用登山装备、绳索和滑轮在平台之间穿行，自称是在Level 162的流浪者的守护者。他们为那些对环境缺乏经验的人进行救助，与其他较小的群体和流浪者进行交易，并带领那些不希望留在层级的人到较为安全的出口。
//
//壁牧者可以通过他们的徒步装备和绳索来识别。除了装备外，每个壁牧者还必须佩戴灰色臂章，上面用白色蜡笔写着“壁牧者”的符号——一条笔直的垂直线和三条横线贯穿其中，象征着主墙及其众多的平台。这些臂章是用在办公室里找到的纸和胶带粗略制作的。壁牧者会在他们能找到的任何平台上定居，不过出于宜居性的考虑，他们通常会选择卧室、仓库或店面平台。
//
//他们靠各种平台提供的食物为生，壁牧者用他们的登山设备与绳索，五人一组，从一个平台远行至另一个平台。
//
//组织者
//组织者是一个由49人构成的组织，为出入Level 162的人员提供会计系统。他们在纸上记录大量日志，跟踪进入该层级的人员，确保退出的人员只到达最安全的层级——或者，如果他们是某个组织的官方探险家，则确保他们安全到达更危险的层级。虽然组织者经常与壁牧者同行，但他们是各自独立的团队。
//
//组织者很难辨别，除非在他们的工作空间——几乎总是办公室。壁牧者向组织者提供食物和水，作为交换，后者会留意谁进入和离开层级。
//
//入口和出口：
//入口
//Level 162可以通过Level 20的地板进入，在那里你会发现自己在一个仓库平台上。
//穿过Level 81中的任何一扇门都有概率将你带到Level 162。
//Level 170中的一些二型水泥箱通向Level 162。
//穿过Level 172的入口门，有概率到达Level 162。
//穿过Level 176浴室区域的洞进入Level 162的浴室平台。
//在Level 432停电期间，躲在木楼梯下，通过切入穿过下面的地板会到达162层。这是如何发生的目前正在调查中。
//出口
//通过办公间平台上的一扇门离开，或停留于有外墙的平台上在后退时切出，会随机进入Level 0或Level 1。
//当平台后退时，于任何平台的次墙进行切入也将导致随机达到Level 0或Level 1。
//穿过卧室平台上的卧室门，门旁边有一幅画将通向Level 57。
//切入一个办公平台的次墙可以直达Level 81。
//切入混凝土墙就会来到Level 170的二型水泥箱。
//从浴室平台上的一扇门出去就可以到达Level 189。
//穿过混凝土墙和次墙上任何打开的门可能会进入Level 277。
//从郊外房间平台上的门出去可能会通向Level 111、Level 409或Level 566。
//有些仓库、商店或办公室平台门附近有霓虹灯出口标志，无论它们是在主混凝土墙上还是平台的副墙上，都通向终点。
//作者及译者
//« Level 161 | Level 162 | Level 163 »
//
//Footnotes
//1. 译注：为翻译方便及阅读流畅，下文均称“次墙”。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl162{}