//Level 124
//⚠️警告⚠️
//以下音频记录不具有可信性。虽然这位探险者拍摄了许多照片，并获得了关于这一层级存在的很多证据，但我们不能未经核实就相信他的说辞。所以，我们要把人员送过去，该层级存在的真实性一经确定，我们会即刻更新条目。保持警惕。
//监督者-A
//
//> 隐藏音频日志 (part 1)
//
//记录开始：
//
//byv8AtmT95rKNkc.jpg
//我在哪儿？
//
//所以，我想我应该把录音设备打开。（必须遵守协议，对吧？）我叫Michael Smith。我刚刚探索了Level 215的家庭住处，然后因为疲倦睡着了，醒来之后发现自己在这里。我查了M.E.G.的数据库，没有找到任何相似的地方。这儿太黑了，简直伸手不见五指。
//
//[可以听到走路的响动]
//
//我天，我好像被困在什么公寓里了。感觉很像我小时候住过的公寓，但我找不到什么证据。门锁着，窗户也打不开。我去给我姐姐的卧室拍张照，那儿连个窗户都没有。
//
//[相机摄像声]
//
//7gN6Hr8Pzc9nT3a.jpg
//另一间卧室。
//
//我感觉，这地方没有色彩。仍在探索中。未发现有用的补给。
//
//[可以听到呼吸和走路的响动]
//
//兄弟，我有种不祥的预感，而且时刻在加重。我感觉有个极度危险的东西在靠近，它会杀了我的。操。
//
//[15分钟的沉默]
//
//找到点有用的，我想这能让我离开这儿。壁橱里这面烂墙。我想，现在我唯一的选择就是切出了，所以他妈的开干吧。
//
//[沉重呼吸声和嘈杂响动]
//
// 
// 
//
// 
// 
//
//记录结束。
//
//> 隐藏音频日志 (part 2)
//记录开始：
//
//妈的，我想吐；这切出是真他妈糟糕。我现在在另一个地方，看起来像个楼梯间。以下是照片。
//
//ifVyd8nRFKH1uAo.jpg
//楼梯交错处的照片。
//
//这虽然没有那么黑，但氛围让我毛骨悚然。
//
//[30分钟的沉默]
//
//老天爷啊；我猜这楼梯是无穷无尽的。我已经厌倦了，就好像我的余生都要一直下楼一直下楼了一样。操。
//
//[30分钟的脚步声和呼吸声]
//
//喔，可算找到一扇黑门，只是看起来非常非常可疑。以下是照片。
//
//RxA3fiH1bNVUPpe.jpg
//好黑啊……
//
//感觉我不该进去，但别无选择了。
//
//[门轴嘎吱声]
//
// 
// 
//
//[关门声]
//
//哦哦，这里挺亮的。我想这是个歇脚的好地方。但首先我得拍张照。
//
//tHXSds1YGkAozea.jpg
//房间的照片。
//
//我要找个地方坐会儿。腿疼得要命。
//
//[嘎吱嘎吱的响动]
//
// 
// 
//
//[1小时的沉默]
//
//我想，够了。而且这种被追赶的愚蠢感觉更剧烈了，所以我得动身了。祝我好运。
//
//[门的响动]
//
//这和之前拍的不一样。我得再拍一张。
//
//wpW7ye9VQkmRj1K.jpg
//这红灯让我很不安。
//
//我要试着去打开些别的门。
//
//[扭动门把手的声音]
//
//打开了左手的门。
//
//[扭动门把手的声音]
//
//右手离我最近的门，没打开。
//
//[扭动门把手的声音]
//
//右手角落的门打开了。我看见里面是一条没有尽头的长廊。好像没什么可探索的。咱去左手的。
//
//[呼吸声]
//
//噢，别，又是楼梯。
//
//[下楼的脚步声]
//
//妈的，又变暗了。楼梯并不长，我估计得再拍一张。
//
//TWQJ32uS8FhUgHr.jpg
//从下面看这楼梯。
//
//哇，这也太黑了；比我进来时的那间卧室还要黑，几乎什么都看不见，得把我的手电打开。
//
//[按钮声]
//
//好多了。这里有好几条走廊，一片漆黑。就算用手电也无法照亮。
//
//信号扰动
//这
//信号扰动
//他妈
//信号扰动
//怎么了？
//强烈的信号扰动
//
//我追到你了
//
//记录中断
//
//> 隐藏音频日志 (part 3)
//
//因信号扰动过于剧烈，停止记录。是否重启？
//
//是/否
//
//
//
// 
// 
// 
// 
//
//是
//
// 
// 
//
//记录继续。
//M: 你是谁？
//UE: 我是追逐者，你身后的猎手，也是你们人类所说的，实体。你那被追逐的恐惧感是完全正确的，如果你在那个“起始卧室”停留，你会死。在你进去又走掉一小时后，我差点杀掉你。但你的恐惧感又救了你一命。但现在你自己送上门来了，这次你没有听从自己的恐惧，没有听从自己的灵魂和思想，而是选择了死亡。
//M: [笑]
//UE: 对你的死神毫无尊重。你们人类都很愚蠢，但我想和你达成个交易，你直接来找我，我可以给你一个痛快。
//M: 狗屎交易，老哥。
//UE: 这是我最后一次问你了。你是接受失败，还是要被残忍痛苦地杀死？
//M: 去你妈的，傻逼。
//UE: 那么，你的选择是残酷的死亡。我警告过你了。
//
//[低沉的吼声]
//
// 
// 
//
//[上楼的脚步声]
//
// 
// 
//
//[可以听到成群实体呼啸而过的回声]
//
// 
// 
//
//我操，现在我正在这个非常崎岖的走廊里跑动，我下方15米处就是成群结队的又饿又恼的实体还有那个猎手。要是没啥补充能量的东西……我的生存几率等于0。
//
//[喘息和跑步声]
//
//喔，那有个能量棒。要抓住它。妈的，这没照片谁会信啊，虽然我在狂奔，但还是得把它拍下来。
//
//T5gMWmVDF8EqGHf.png
//走廊
//
//[跳起的声音]
//
//这里路障非常多，很难跨越。那些实体离我越来越近了。噢噢，好，又一根能量棒。
//
//[持续20分钟的喘息和跑步声]
//
//多亏了能量棒，我感觉没多累，但不幸的是，我和实体间的距离正慢慢地缩小。
//
//[可以听到跑步的声音。喘息声越来越重。Michael沉默了半小时。]
//
//呃啊，我的呼吸很——很困难。Phish，根据我的——我的经验，我跑了有大概8.5公里。成群的敌对实体越来越少，但那些 呼 强悍的实体离我越来越近了……有不少——路障，但我全跨过去了，有的 呼 实体倒是没做到。他妈的好啊，又有能量棒！
//
//[可以听到沉重的喘息和跑步声。Michael沉默了五分钟。]
//
//终于，我快到出口了!
//
//JYxm1vcplbCMrUq.jpg
//走咯
//
//妈的，实体离我很近了！我得离开这个狗地方！
//
//[敲门声]
//
//记录中断
//
//> 隐藏音频日志 (part 4)
//
//因信号丢失，停止记录。是否重启？
//
//是/否
//
//
//
// 
// 
// 
// 
//
//是
//
// 
// 
//
//记录继续。
//
//我的腿乏的走路都困难。这十公里长跑真不是闹着玩的。至于我现在的位置？我被传送到了Level 0。我从这儿到过Level 1，可以再走一次，虽然现在的我甚至不能正常行走。
//
//[15分钟的喘息和走路声]
//
//我看到Level 1的入口了。我想事情到这儿就告一段落了，得去把这份音频交给M.E.G.看看他们有什么举措。再见。
//
//记录结束。
//
//在切入Level 1后，Michael Smith前往了M.E.G.的阿尔法基地，并将全部音频记录和照片都交给了M.E.G.。音频记录经过监督者-C和多名M.E.G.特工的查阅，他们派遣了四名特工前去探索Level 215以证明Level 124存在的真实性。Michael Smith现在Level 11生活。
//
//⚠️更新⚠️
//特工人员为我们提供了足够的证据和相关信息，这证实了Level 124的存在，并使我们对其有了全面认识。我们派出四位特工，无人生还。感谢他们的事业，也感谢每位参与的人员。
//监督者-A
//
// 
//
//生存难度：
//等级 5
//
// 
// 
// 
//crLvtU1aPkJ8ZVK.jpg
//起始卧室的照片之一。由一名M.E.G.特工拍摄。
//
//Level 124是后室的第125层。
//
//描述
//由于Level 124层级本身所具有的的复杂性，没有统一描述。该层级由四部分构成，其中的威胁可能有所不同。
//
//部分一
//Level 124的起点。其外观取决于流浪者的记忆。通常看起来像是流浪者童年时居住的公寓或房间，但里面不存在任何照明。尽管它看起来和记忆中的居所非常相似，但待在这里的流浪者会感到不安的情绪。
//
//在此处长时间停留，有98%的死亡率，而这不仅仅是由于层级本身的精神影响。导致死亡的主要原因是一个无记录的实体，也正是该层级的独特之处，它自称为“追逐者”，其外观看起来像是30岁的职员，但它在追上流浪者时会化身为后者最恐惧之物。它的来源和动机目前均不详，而后续可能也不会补充。与该实体的部分对话有记录。
//
//隐藏 lvl124.expl_log_1.mp3
//记录开始：
//记录者： M.E.G.特工：Lara Cryder 和Xander Morris。
//任务负责人： 监督者-A
//简介 四名M.E.G.特工中仅有2人从Level 215成功前往Level 124。
//
//Xander： 好，Stretch，我成功了，我应该已经到达Level 124。
//监督者-A： 很好，你能向我描述一下，你现在所见的周围环境吗？
//Xander： 呃……这儿很黑。
//
//[咔哒声]
//
//Xander： 这看起来很像我小时候的卧室，但更暗。这房子好像挺大的，所以我准备去探索一下周边，说不定能找到队友。
//监督者-A： 好，我会和你保持连线。
//
//[5分钟的静默]
//
//监督者-A： 啊，Xander？你听到了吗？
//Xander： Lara？Michelle？Nate？
//未知声音： Xander？我在这儿，你在哪儿啊？我啥都看不见，这也太暗了！
//Xander： Lara？
//未知声音： 是我！！你在哪里？
//Xander： 我在一楼！来了！
//Xander： 我看不见你！
//Lara： 我在这儿，你后面！
//Xander： 好！
//监督者-A： 所以，我们的想法是对的。至少有两名特工成功抵达。你们有找到其他人吗？
//Xander： 没，我没找到。
//Lara： 我也没。
//监督者-A： 那么，你们的主要任务是进一步了解这一层级。是的，虽然正如我所知，这房子又大又昏暗，但你们需要找到些异常的物体，不论是什么。是房里的一面墙，一个花瓶或是别的什么，只需要找到它，你们明白吗？
//Xander和Lara： 是。
//监督者-A： 祝你们好运。
//
//[Xander和Lara交谈，寻找了约30分钟。]
//
//Xander： Stretch，有点不对劲。找不到异常的物体，我俩已经把整栋房子翻遍了。
//监督者-A： 不可能，一定有的。
//Lara： Stretch，我很怕……不知道为什么，也不知道是什么引起的。但我的恐惧愈演愈烈了。
//监督者-A： 第一位探险者也声称有同样的感觉。Lara，仔细说一下你的感觉。
//Lara： 我感觉，有什么东西在追我，想杀了我们两个，我和Xander。我快被吓哭了，感到很害怕……
//监督者-A： Lara，请不要放弃，这个东西只会等着你。你要做的就是继续搜寻，好吗？
//Lara： 是的，我明白，Stretch。但我怎么遏制这种恐惧。
//监督者-A： 你能做的就是尽快完成工作。
//Lara： 谢谢，我会努力的。
//监督者-A： Xander，那你呢？
//Xander： 说实话，一样。我的恐惧在加剧，但我只能让自己冷静。虽然不奏效，但有助于工作。
//监督者-A： 忠于职守，伙计们。我不想你们分心。
//
//[Xander和Lara悄悄交谈，持续15分钟]
//
//[Lara跑去2楼]
//
//[1楼玻璃破碎声]
//
//Xander： 谁他妈干的？
//UE： 找到我的午餐了，说遗言吧。
//Xander： 跟你这弱智中年服务员？不。
//监督者-A： 不，XANDER，停下！求你了！快跑！！！
//UE： 让我们看看谁是那种人。准备好被折磨致死吧。
//Lara： XANDER，我找到了！你在哪里？
//
//[血液四溅的声音]
//
//Lara： 怎么了？我天——
//监督者-A： LARA，跑！！！
//
//[响亮的跑步声]
//
//Lara成功到达了Level 124的部分二，记下了层级探索日志，并在生命的最后几秒钟发给了Stretch。遗憾的是，她在Level 124的部分四，逃离实体时阵亡。Xander被认定已阵亡。
//
//
//Level 124该部分的唯一出口是找到一个异常物体，切入将把流浪者传送到Level 124的部分二。
//部分二
//在部分一切出后，流浪者会发现自己抵达了部分二。Level 124的这一部分看起来是一座楼梯间，该区域绝对安全，但没有资源也没有食物。楼梯没有起点，也没有终点，这解释了为什么不断下楼去寻找终点是徒劳无功的。离开层级的这一部分的唯一途径是行进几个小时之后找到一扇看起来很可疑的黑门，如果运气好的话可能也就几分钟。通过这扇门，流浪者得以到达Level 124的部分三。在层级的这一部分，流浪者也可以通过切出，到达Level 432。
//
//部分三
//部分三的外观可能有所不同，通常是一间在开派对的房间。这一部分可以说是Level 124的“主要”部分。这里也绝对安全，可以在里面停留很长时间。从部分一开始，被追赶的感觉愈演愈烈，但在这里相对慢得多。
//
//该区域是你掉头的最后机会，如果没有做好迎接部分四的准备，最好折返回到部分二。
//
//部分四
//一旦进入Level 124，你唯一的选择就是逃命。部分四是一条极短的走廊，左右有几扇门，但只有两扇能开合，左右各一扇。一扇通向一条长度10公里（约6.2英里）的长廊。另一扇通向实体的聚集地。如果有流浪者进入，“追逐者”会和流浪者交谈。
//
//谈话结束后，成群的实体会从走廊和房间里涌出，到达流浪者的正下方，一直冲进上述的走廊里。这些实体速度通常比流浪者慢一些，但如果流浪者放慢脚步，就会被大群实体虐杀。
//
//其后，流浪者唯一的生存选择就是冲过这条长廊。在流浪者的左右会出现能量饮料和能量棒，让他们不至于耗尽体力。在走廊的某处可以切出，但不建议这样做，因为在这里切出会前往负数层级。
//
//如果流浪者成功跑过长廊，并打开一扇标有"EXIT"的门，他们会被传送至Level 0。目前只有一个人成功做到，也就是之前留下音频记录的那位流浪者。
//
//基地，前哨，和社区
//由于Level 124的复杂和不稳定性，不可能在此处建立基地、前哨站或是社区。
//
//入口和出口
//入口：
//脑海里没有任何有关层级的想法地在Level 215入睡可能使人员前往Level 124。
//Level 282中的昏暗卧室通常通往Level 124。
//出口：
//成功跑过十公里长廊将前往Level 0。
//在长廊中切出会前往随机负数层级。
//在Level 124的部分二切出会前往Level 432。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl124{}