//Level 189
// 
//
//生存难度：
//等级 2
//
// 
// 
// 
//Level 189是后室的第190层。此层级被发现的确切时间不得而知，许多人都声称自身曾于不同时日至少因意外进入过此层级一次。
//
//描述：
//photo-1569122243657-3c1c51340f65?ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&ixlib=rb-1.2.1&auto=format&fit=crop&w=300&q=80
//一张探索者最开始能找到的、最普通类型的卫生间相片。
//
//此层级似乎由无尽的，类似于干净的公共卫生间的房间群组成。在大多数起始房间中布置有五个隔间和五个水槽，它们均功能齐全。每个房间内总是包含两扇门，它们都会创造一个本层级的出口或提供通往另一个卫生间的入口。
//
//起始房间拥有窗户和镜子，为房间提供了大量的“自然”光线和空间。探险者报告称，在所述窗口的另一边看到的不是拥有静止云层的蓝天，就是一片单调的空白。到目前为止，所有设施均无法通过任何已知方法对其进行破坏。
//
//这里空气新鲜，与大多数初始层级相比尤为如此，该层级被描述为拥有人造空气清新剂的微弱香气，房间里可以听到细微的流水声。
//
//豪华卫生间
//photo-1576698483491-8c43f0862543?ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&ixlib=rb-1.2.1&auto=format&fit=crop&w=300&q=80
//豪华卫生间的一张罕见照片。
//
//这个房间相对来说十分少见，但是可以通过门上的金色把手对其轻易辨认。房间内，除了与普通房间相同的设施外，还可以找到两个小便池和一个淋浴间。这个房间里的物品设计更加细致和奢华，内有大量的黄金和大理石装饰。
//
//此外，此类型房间最有价值的特性是，它的所有设施均使用杏仁水而非普通的水。然而，这种杏仁水的来源依旧有限，直到将其用尽也只能装满60个中等大小的瓶子。据说此房间能为找到它的人提供一种强烈的充满希望和身心轻松的感觉。
//
//危险增加理论：
//根据目前的信息，在此层级经历的前50至60个房间是完全安全的。一个公认的理论是，你在遇到出口前穿过的房间越多，到达出口的可能性就越小。以超过50~60个房间开始，探险者报告称感觉越来越不安全，并注意到各个房间，包括豪华房间在内，开始以各种方式进行着恶化。
//
//photo-1597098540640-0cf6008159a0?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=632&q=80
//一张由探险家经历的第55间卫生间的照片，与起点相比有明显的变化。
//
//一个特别的探险家声称他在遇到出口之前穿过了将近200个房间。当他前进时，他曾注意到：
//
//空气变得越来越污浊。
//厕所里开始堆满无法辨认的垃圾。
//灯光变得越来越暗，直至几乎一片漆黑。
//墙壁被维护的痕迹越来越少，暴露出更多的砖块和霉菌。
//地板开始被肮脏的卫生纸和污水覆盖。
//门后开始出现越来越多令人担忧的噪音，很可能是由下述实体引起的。
//实体
//在前50到60个房间内，根本没有实体存在。然而，当超过这个数字时，房间中实体存在的概率将会增加。这位考察了200个房间的探险家报告说，笑魇和猎犬的数量越来越多，同样也有非敌对状态的无面灵出现，他们只会站在隔间或镜子前，就像是在模仿厕所里的人类行为，不过我们无法理解它们这么做的目的是什么。
//
//前哨
//本层目前没有已知的前哨存在。然而，本层级却拥有作为大量杏仁水和普通水资源相对安全来源的可能，这点促使M.E.G.定期派出探险队于此搜刮，尽管任务中总伴随着队员的失踪。
//
//马克的卫生间
//根据那位在当时已探索该层级199个房间的探险家回忆，就在他失去希望的时候，他发现了一扇门，与其他门不同，这扇门的把手被拿掉了。当他走进去的时候，他发现了一个叫做“马克”的实体正向他打着招呼。
//
//据说，马克在当时告诉了那位探险家他考虑搬来该层级居住，他似乎正在堆砌垃圾，让他所在的这一房间看起来更像是他以前的居所。接着，探险家殷切地询问马克该层级的出口位于哪里，马克很干脆地打开了一扇隔壁通往Level 4一条走廊的门。马克似乎对探险者的这一询问感到十分疑惑，据探险家说，马克好像完全不理解为什么对方不在想走的时候直接离开。
//
//入口与出口
//入口
//据悉，当有人想使用Level 2的卫生间却又对其卫生状况感到厌恶恶心时，这个人便会在打开下一扇门的那一刻进入该层级。这种方式的更有效版本包括坐在该层级的厕所里，朝它尽可能多地喷洒空气清新剂，让气味侵入隔间，并闭上眼睛想着遇到一个“漂亮的卫生间”。当你睁开眼睛时，你将确定地出现在此层级。
//
//有一种理论认为，如果有人在Level 34中持续行走足够长的时间，就可以进入本层级。然而，这种方法并不可取，因为所有试图通过这种方法进入的探险家均还未返回。这表明，即使他们成功到达本层级，也无法找到该层级的出口。
//
//出口
//如前所述，唯一已知的离开该层级的方法是离开你现在所在的卫生间。以探险者记录为据的计算得出，80%的人会在经过1至12个卫生间后离开。大多数情况下，这种方法会让你回到Level 2中的卫生间。如果这种情况没有发生，那么你每经过一个房间后逃脱的机会都会变小很多。M.E.G.的许多成员仍能从后续的路程中得以返回。
//
//一些人推测，如果一个人通过足够多的房间，这个层级会将他带往Level 34，但此说法有待证明。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl189{}