//Level 122
// 
//
//生存难度：
// 
// 
// 
//Level-122-1.jpg
//仅有已知的Level 122照片.
//
//Level 122是后室的第123层，被发现于2020年9月12日
//
//描述：
//Level 122在外观上就像1980年中永无止境的购物中心，霓虹灯反衬在该层级的屋顶与地板上。在该层级中，大量的补给品生成并能在层级周围的商店中找到，进入该层级的设备可以在不用充电的情况下持续使用，因根据报告显示，霓虹灯发出的光线会对电池供电的设备产生充电作用。音乐扬声器在屋顶上排列组成，经常播放着从1980年到2006年年底左右的音乐，这可以防止你精神错乱，并且已被证明可以轻微治愈后室中遭到精神攻击的受害者。建筑物内的灯光会通过改变颜色的间隙来确定难度级别，在此期间里，扬声器上所播放的音乐也会发生改变，以下是灯光改变颜色的记录列表。
//
//灯光颜色的破译：
//红色=严重状态：在这种状态下，会出现大量实体，并被证明它们对流浪者表现出更为激进的攻击欲望，在此期间，任何阻止或击败实体的方式都被证实是无效的。
//黄色=危险状态：实体处于正常状态，但大多数都在该层级中徘徊，建议在摊贩或美食广场中藏好自己，并与其他流浪者团队合作，因为一名流浪者不太可能击倒一群实体。
//紫色=中立状态：在大多数情况下这种颜色被记录为持续时间最长的灯光射出颜色，此时商场的状况没有更糟或更好。实体仍会继续徘徊在该层级中，但实体数量减少到“可容忍”的状态，而不再构成威胁。
//粉色=实体温顺：粉色的灯光对在Level 122中装备不足的流浪者是一种祝福，在该状态下，任何具有攻击性的实体都对流浪者没有敌意，即使四周都有这种颜色，但仍建议不要接近实体，因为这些灯光的持续时间很短。
//此外还记录了这些灯光在随机时间下关闭而导致停电阶段（见下文）
//
//停电阶段：
//在Level 122中每隔一段时间里，霓虹灯将会关闭，使离开Level 122的流浪者完全处于黑暗中，几秒后，唯一的光源便是霓虹灯店铺的招牌，温和且柔软的光晕，商场的天窗也陷入昏暗，但有白色的小点描画了夜空中的星星。在停电期间中，笑魇会在该层中徘徊，因此建议你留在美食广场或随身携带大量的杏仁水。停电阶段通常约2小时，并且一切都恢复正常后，发电器嗡嗡作响，灯光闪烁以及音乐再次响起。
//
//购物中心：
//商贩们会在Level 122的墙上排成一行，但他们大多数都有一个下拉式铁制车库门用来遮挡商店内部。只有少数的几家商店仍然营业，开业的商店由不同时代主题的商店组成，比如1990年代的一家音乐唱片厂商、1970年代的糖果店、2007年的科技商店等。一份报告发现了一家商店，里面装满了从后室中拿出来的物品，从记忆罐、后室终极食谱、瓶装杏仁水，以及各种的简易装备，例如一个附在皮革制袖口上的破碎瓶和拳击手套，似乎是来自不同后室层级的各种材料制成的。其他被发现仍然在营业的商贩皆是破败不堪，发现蠕灵正在享用留在地板上的所有垃圾，而笑魇通常潜伏在破旧商店的后方。
//
//实体：
//Level 122栖息着各种类型的实体，其中大多数对流浪者具有攻击性，以下是包含了该层级的所记录到实体的内容。
//
//蠕灵是在腐烂且破烂的商店中发现的，当时它们正享用着似乎来自现实中的动物残骸。
//笑魇经常潜伏在远处的破旧商店里，并且在停电阶段时出现。
//虽然大多数都很温顺，然而窃皮者只有在Level 122的严重状态下才会出现。
//在其他商店的物品中，可以从货架上找到所有记录颜色的八卦信标，但在店内徘徊的话似乎没有任何精神影响，一些八卦信标在被发现时，会熄灭信标内部的LED灯。
//一名在Level 122里的流浪者声称，记忆蠕虫在Level 122的危险状态下以无法解释的速度在该层级中徘徊。然而这一说法被无视了，因为从那时候起，就没有记忆蠕虫的目击事件。
//服务员是Level 122的独有实体，曾是一个完整记录过的实体。只有在美食广场才会被发现，他的整个身体都是不存在的，但你任然可以知道他在场，因为他的衣服以成片的形式覆着于其身体上，他穿着一套老式的冰淇淋店服装，声音十分开朗，这让你想起在现实里常常播放到深夜的广告，尽管是一个温顺且通常很友好的实体，但若激怒他可能会导致被踢出美食广场，又是有时候则会同这位隐形人本人进行搏斗。
//前哨：
//美食广场虽然在Level 122没有具体位置，但在该层级中的附近能较为容易找到一些线索，比如丢弃在食物盘和地板上的苏打水污渍。最终这些线索会引导你找到美食广场。
//美食广场是该层级中唯一最安全的地方，根据报告显示，服务员用一把大干草叉和特殊香料阻止其他实体进入他的厨房，目前尚未得知这些香料可能包含了什么物质用来阻止大量实体。
//美食广场栖息着Level 122的独有实体——服务员。服务员愿意为你提供食物、杏仁水、皇家口粮，有时还会提供其他补给品，例如可以暂时防止酸性灼烧的衣服、以及厨房里的工具、剁肉刀或牛排刀叉。
//服务员常会拒绝与Level 122中的流浪者进行交易，他更喜欢用现金或硬币交换物品，而不是一件物品交换另一件物品。服务员并不是一个公平的人，经常会以荒唐的价格推销物品或食物，或者在发现所购物品或奇怪的地方之后就不再向你购买，根据报告显示，试图与服务员讨价还价来降低价格会被踢出食物广场，直到另行通知。一份报告显示，一名流浪者与服务员讨价还价后被该实体未戴手套的手打中，后来受害者在报告中已经死亡，脸上覆盖着一种细菌，并已经渗透至其躯干内。
//入口与出口：
//入口
//若在Level 109的四路交叉通道处绊倒或摔倒会导致你暂时失去知觉，这会导致你在Level 122中醒来。
//Level 480内很少有通向Level 122的门，然而很难区分类似商店的入口与Level 122的入口因为这两扇门看上去几乎一致。
//出口
//跳进美食广场旁的随机餐厅内的垃圾桶，这会导致直接到达Level 11。
//在该层级中步行大约13小时左右，你将会看到两个浴室的入口，上面贴着常见的符号，而不是平时的男性与女性标志，如果在右侧有油漆飞溅的标志，那么会导致传送至未命名。
//若你决定乘坐左侧带有扭曲列车标志的浴室入口，可能会导致直接从浴室中走向后室地铁。
//找到一张带有拱廊的海报，并且触摸它，将会抵达Level 40。
//找到一家标有“Artopoieío Desire”的商店并进入该商店，将会抵达Level 67。
//一些商店旁边的门会比该层级中的周围其他的门更脏，进入这些门的话，会导致直接到达Level 480，通常会将你置于随机商店的过道中心，并这些门会在你的身后随之消失。
//根据一些流浪者的报告显示，在停电阶段时，开锁并打来后室的摊贩旁边的门，有可能会导致直接抵达蒙黑天空，但不建议这么做，因为在蒙黑天空中根本无法逃离。
//若向服务员询问“惯例”的话，他会带你走向厨房的后面，进去后，你就会听到他正在搅拌某种类别的餐盘，并且你会闻到最后吃的东西的味道，大约4分钟后你就失去知觉，当你再此醒来你会在你之前想到的最后一个层级苏醒。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl122{}