//Level 136
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//GODDAMNEDDOOR
//我不知道怎么旋转图片，不过这应该不重要吧？
//
//Level 136是后室的第137层。
//
//在我告诉你打开这扇门会发生什么之前，不要让门关上。首先，第一步，如果这门开着的话，别让它关上，不要被生存难度0骗了，这地方可以而且会杀人。
//
//描述:
//我该从哪开始呢？看完这个我该怎么办？好吧，好吧，首先，你可能会看到这扇门，我确定你会看到，嗯……在某种程度上其实我认识的人都见过这扇门。我……我都不知道这扇门是层级里的固定设施还是什么。我在三个层级前好像遇到过个人警告过我有关这扇门的事情……然而当时我觉得我并不该相信他。他说这个是他在学校里路过的门，在他……卷入这一切之前。我得跟全世界宣布下这事，如果你没见过这个的话，我相信你之后会看到的。我不知道编号是多少，或者说它甚至不应该是个层级……。好吧，它应该是个层级的衍生品，汲取了其他层级的精华。管他呢，当我把这玩意放下的时候，无论如何我都得打开它。
//
//我前面一直在说这扇门，这门是入口。入口和出口，我需要把这些写文档里吗？啊，没事，我会为了被裁员做这件事的。
//
//还有这房间本身，如果这些尸体不是房间本身就有的东西的话，我会说说他们的。如果你进这房间里了（我觉得更像是进衣柜里），然后把门关上，并向内走去。这简直就像……那什么都没有，你什么都感觉不到，你无法移动你的身体，你看不见，你唯一能做的事就是……思考。你此刻是十分清醒的，你没有睡去，你只是……不能，不能做任何事。这简直能把我逼疯了，而且将会影响你他妈的一辈子。嗯，然后就没别的什么了，它就是个感官剥夺室。现在，据我所知（我没有太多时间去搞这个，虽然它很危险），如果这门关上了，它就会动，你永远不会知道它又会移动到哪里。如果门关上了，你被关在里面了，那扇门依旧存在，但你看不到它，感觉不到它，你甚至无法告诉你自己你还存在，直到下一个人打开这扇门。
//
//如果你看到门了，看在老天爷份上，请他妈的打开那扇该死的门！那些尸体？他们就是没有看到这些描述的人，这就是为什么我要留下这个文件，不过我通常不会干这事，这种为人民服务的事，你们这些忘恩负义的东西。
//
//我该写写我的经历了。首先，我看到了门，当时我在Level 1的枢纽转悠，毕竟我是个新来的，主要是我很无聊。不过我说，那门挺有趣的，这没有多少门，通常都是一些能穿过的开阔区域。所以，我这猪脑子干什么了呢？我打开了那扇傻逼门，嘿，你猜怎么着？这全是尸体，我自己就没有多少补给，结果这些人带着成吨的补给都饿死了！我走了大概五步吧，想了想要不要继续探索，因为我在一个全是尸体的房间里。结果我刚转过身往门口走，门就关上了。
//
//我不知道在别人开门之前我在里面待了多久，就在这门被打开的那一刻，我感受到了，我感受到了我的嘴就像干旱了一样，我的背已经僵直，就好像我摔倒好几次一样。不过谢天谢地，我做到了，我花了……嗯……应该是三天吧，用三天摆脱了寒冷，谢天谢地，是别人的好奇心让我没有死在这里，把我拉到了Level 4的某个地方。我想，我真的是有够走运的。
//
//所以，这些，加上流浪者们的流言，这就是我所得到的东西。我待会就把这些发给M.E.G.然后赶紧让他们传播出去，希望我已经解决这些问题了吧。他妈的，真应该多给我点钱。
//
//如果你看到了这扇门，请打开这个傻逼玩意！你或许能救一条人命。当然，别把自己关里面，这样的话你只会成为下一个傻子。还有件事，这门好像有意识。别……别想着能用什么东西撑开或者顶着，就那里面，得有四五个门挡，还有块石砖，我不觉得这能给你什么好的记录。
//
//基地，前哨和社区:
//不管它在别的地方啥样，我都不觉得有人会在这傻缺地方设什么组织。
//
//入口与出口:
//入口
//打开门就行，哪都可能有。
//
//出口
//据我目前所知，离开这里的唯一方式就是从这扇门出去，我可不想冒险在这里切来切去。
//
//如果你对这里挺了解，请先把信息交给M.E.G.，如果没有办法交给M.E.G.的话就给我，你可以问问，Level 1的Jared就是我。还有，别犯傻。
//
//Evereds登出。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl136{}