//Level 101
//我站在那里，眼睛望着地平线，大衣和围巾被风吹得乱七八糟，伫立在海边。
//
//从一些方面讲，这里很宁静。风和海组成了自己的交响乐，但我觉得十分轻柔。我觉得这里真美。
//
// 
//
//生存难度：
//等级 2
//
// 
// 
//高数量实体
//我听到身后传来脚步声，一双小脚丫踩在沙子和下面的贝壳上，踩得嘎吱作响。我转过身，她就在那儿——我的女儿，我的小姑娘。她好像被涌动的海浪迷住了，两眼呆呆地，注意力集中在水面上。她真宝贵，真是我的明珠。
//
//field.jpg
//从Level 101 恢复的照片。
//
//Level 101 是后室的第102层。
//
//描述：
//Level 101 是一个近乎完美的地球复制品，这是太阳的第三颗行星，也是后室中绝大多数漫游者的起源地。
//
//虽然Level 101 几乎在所有方面都与地球相似，但它对地球之外区域的复制情况尚不得而知，若其确有复制。但如并未复制，也无法从去过Level 101 之人的报告中得出明确结论。
//
//没有她的日子的幻象闪现在我的脑海中，还有猎犬、火焰和无面灵，我不得不强迫自己再次忘记。那些记忆不是真的，再也不是了。
//
//一旦进入Level 101，你就会在进入后室前的家中苏醒。尚无记录显示无家可归者或在后室中出生之人在进入Level 101 时发生了什么，这可能是由于目前尚无此类人进入Level 101，或是由于这些人还未离开Level 101。
//
//尽管具体情况众说纷纭，但普遍理论认为，一旦进入Level 101，你就会实际地重归进入后室前的生活，尽管这种理论与该层级中存在多名漫游者可能性的冲突并不为了解或报告。
//
//我看到我的女儿用小手捡起一个贝壳。是她的。她是真的。我冲了过去，抱起我的骨肉，把她揽进怀里，紧紧地抱在胸前。我把头贴在她的身上，她脸上的困惑一扫为幸福，闭上眼睛，轻轻地咕哝着。
//
//然而，Level 101 有些许记录在案的 “不一致”，随着时间的推移，这些不一致在Level 101 内逐渐变得更加明显，更加强烈。
//
//“你们两个玩得开心吗？”
//
//人们对“不一致”的理解并不多，但某些要素在正式报告中重复出现，以下为部分记录：
//
//认为路灯柱“太高”的倾向，尽管程度不一。
//杏仁水并不以任何形式存在。虽然假定有生产杏仁水的可能，但该产品并未被任何供应商出售或分销，也未被任何搜索引擎记录。这似乎并未对Level 101 的地球产生重大影响，如果有影响的话。
//有一段声音与其源头不一致的时间，被描述为“滞后”。
//由于Level 101 仍在后室的（假设）边界内，某些典型的后室其他层级的现象仍可能发生，但在报告中得到的证实较少。
//某些动物1从远处看时皮肤缺失或过量，据称大约为100米，尽管这是基于报告的估计。这种效应似乎是一种幻觉，只有漫游者才能观察到，因为这通常不会持续超过片刻。
//新西兰并未出现在任何世界地图上。新西兰仍然存在，并且仍然对Level 101 世界有影响，但地图上没有（据称也不能）以任何形式出现新西兰。Level 101 的本地居民没有注意到这一点。
//我转身面对站在沙丘上的他，他的头发被风吹倒，沙子粘在腿上，从他的脸来看，他穿着短裤和衬衫显然很冷，但他试图用他那古怪可爱的方式来掩饰。
//
//有那么一瞬间，他的皮肤…不对劲，松弛，憔悴。就像一层层的皮肤覆盖在他身上。
//
//但一旦我眨眼，它就消失了。我摸了摸口袋里的药。
//
//基地、前哨和社区
//鉴于进入Level 101 完全基于随机，且极度难以进入，截至本文撰写时，没有任何派别（持续）努力在Level 101 建立前哨。
//
//“你们两个玩得开心吗？”
//
//我耸耸肩，把我们的女儿放下来。“也许我们只是在等你。”
//
//他笑了。“噢，你太客气了。”
//
//他走到我身边，看着我们的女儿在岸边奔跑，穿着她的大外套摇摆而行。
//
//入口和出口：
//入口
//Level 101 完全无法进入，除了在Level 2 发现的未上锁的门。鉴于只有7名个人进入Level 101 的例子记录在案，其中只有3名得到确认与核实，通过门进入Level 101 的可能性未知。
//
//“真不敢相信她已经快一岁了。”
//
//我点点头。“哦，是的，我记得。她出生时我就在那儿，你知道吗？”
//
//他又笑了，这次笑得更勉强——他以前听过这个笑话，但他还是笑了。“我知道，我知道。”
//
//出口
//我们的女儿转过身来，向我们展示她发现的一个大贝壳。它很光滑，紫白相间。它很美。我接过来，用大拇指感受一下。“这太神奇了，亲爱的。”我把它递给我丈夫，他把它举到眼前，像鉴定师检查宝石一样检查它。“嗯，奇妙的颜色和轮廓，但是光泽、裂纹和裂隙可以更好。”
//
//我轻笑一声，推了他一把。“嘿！我是一名工作中的批评家。”我揉了揉眼睛，转身回望地平线。
//
//说出“我准备好回去了”总是会致人陷入昏迷，并在Level 0 苏醒，通常伴有某种程度的方向迷失。
//
//又来了。那种令人毛骨悚然的感觉。波浪的声音与它们的运动不一致，太阳有点太偏向左边，云层移动得太快。但当丈夫握着我的手时，那种感觉瞬间就消失了。
//
//作者&译者
//« Level 100 | Level 101 | Level 102 »
//
//Footnotes
//1. 鹿、鼬、一些鱼类、大多数蛇、猎狼犬及其相关品种的狗，以及人类。
// 
// 
// 
// 
// 
//
//“准备好进家了吗？我想它已经煮好了，对吧？”
//
//我点点头。
//
//“是的。”我说，脑海中对另一个地方的记忆早已消失。“我准备好回去了。”
//
//而一切都开始消逝，消逝，消逝。黑暗从我余光边悄然而至，笼罩了我。我开始坠落——但坠落并没有停止。我睡着了，梦见了我落下的女儿。
//
//当我回去，回去那个不真实，不再真实的地方，在潮湿的旧地毯上醒来，那令人作呕的黄色，还有荧光灯痛苦的叫喊。
//
//我失去了一切，又一次。
//
//而我，躺在地毯上，哭泣着，尖叫着，知道我再也回不去了。除了一张田野的照片，我什么都没有，只能靠它来记住这个梦。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl101{}