//Level 116
//简繁
//
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//116
//Level 116中央的溜冰场。
//
//Level 116为后室的第117层。其外观为一个环形的空溜冰场，温度会根据在层级内所处的位置而变化。
//
//描述：
//Level 116为一个环形、极寒的溜冰场，存在不同的区域，每个区域均可容易、安全地进入。该层级可通过较寒冷的层级进入，如：Level 47、Level 115、Level -5和礼物平原。也可通过将自身淹没于Level 7进入。探索者一般会在溜冰场附近的看台结束探险，但也可能在露天观众席结束探险。溜冰场本身是该层级最大的部分，但由于冰面很滑，因此很难直接使用，建议借一双溜冰鞋，以便顺利地进入溜冰场。该层级通常为安全的，其内的实体仅有无面灵，笑魇， 肢团，以及该层级的原生实体“教员”。
//
//从各个方向都可听到微弱的笑声和溜冰鞋划过冰面的声音，从溜冰场中央可看到该层级的大部分区域。该层级内的所有无面灵都是温顺的，有时可看到他们在游戏厅玩、滑冰或打开储物柜。冷空气和钢铁的气味从周围散发出来。从溜冰场可以看到看台，一堵狭窄的玻璃墙将两个区域分隔，而一排排露天观众席围绕着溜冰场的部分区域，观众席下方有明显的空隙，笑魇和肢团藏在里面。洗手间在不远处，男女标志用英语和法语书写。Level 116的一个显著特征为记分板附近的墙上有一面倒置的，颜色反转成绿色和黑色的旗帜，旗帜中间有一片倒置的枫叶，理论上类似于加拿大国旗。该层级存在Wi-Fi连接。
//
//洗手间可以直接切出，类似于标准的洗手间，有熟悉的Level 0的嗡嗡声。一排排的隔间看不到尽头，走得太远将导致迷路。肢团偶尔藏在厕所里。离开浴室往左走通向看台，而往右走通向露天观众席。
//
//沿着微弱的游戏机噪音的方向前行可到达游戏厅，这是一个面对溜冰场的小空间，里面有一些可玩的游戏，如：射击场、桌面弹珠和抓娃娃机。机器之间的一扇出口通向一条铺着蓝色地毯的走廊，走廊通往派对室或用餐区。切入任一游戏机可到达Level 31或Level 40。进入用餐区还可通往小吃店，如果提出需求，穿着制服的无面灵会给你杏仁水或食物。所有食物都是安全的，你可以安全地坐在用餐区的椅子上吃饭。小吃区后面是员工专属区，可以看到无面灵进出。如果你进入这个区域，你只能找到扫帚和破掉的溜冰鞋。派对室一般是空的，里面到处都是海报和泄气的气球。有时，进入派对室并关上身后的门可能会来到享乐层 =)，但这尚未得到验证。
//
//沿着看台走到一个充满储物柜的开放空间可到达更衣室，这些储物柜通向另一个相同的房间，这可能会导致迷路。有时可以在更衣室找到“教员”。
//
//主溜冰场附近有一个儿童溜冰场，易碎的冰和幼年无面灵有时似乎在滑冰是其主要特征。冰很容易被打破，并会通向负数层级。
//
//溜冰场租赁区很容易到达，在看台区不远处。一个蓝色工作台上面有加拿大尺码表和用英语和法语写的小册子，这个工作台就面向溜冰场的其他区域。溜冰场租赁区是环形的，探索下去最终会带你回到溜冰场的其他区域。溜冰场的租赁区由该层级的一位被称为“教员”的原生实体运营。理论上，“教员”与Level 31的“教练”有关。“教员”是一个难懂而又聪明的无面灵实体，看上去是一位身穿曲棍球服，棕发，梳着侧马尾的无脸女性，她通常拿着一根曲棍球棒，头盔遮住了她的头。她很友好，会帮助你安全地生活在该层级，如果你问她怎么离开，她会告诉你怎么出去，然而，问她关于“教练”或后室的问题会让她不悦。
//
//基地、前哨和社区：
//虽然在Level 116建立社区是可行的，但该层级尚未形成任何社区。
//
//出入口：
//入口
//该层级可通过温度较低的层级进入，例如Level 47、Level 115、Level -5与礼物平原，但是从不同层级进入的难度有所不同。要从Level 47进入Level 116，你需要挖穿Level 47内冰屋的墙壁，并跳入其中。沿着Level -5的无限走廊行走有可能进入Level 116，但是概率非常小；深入礼物平原也可以使你切入Level 116。进入Level 116最常见的方法为使用Level 115的滑雪升降机。将自身淹没于在Level 7是最不推荐的进入方式，但如果需要，仍可使用。
//
//出口
//离开Level 116的常见方法包括切入一台游戏机到达Level 31的街机区或Level 47，询问“教员”或任一无面灵出口在哪里，或者打破主溜冰场或儿童溜冰场的冰，这将通向一个未知的，可能未被发现的负数层级。另一种离开方式为掉进露天观众席下面的空隙，但这是极其危险的，通常会导致死亡或被笑魇伤害。切入更衣室里的一个储物柜将到达Level 115。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl116{}