//Level 149
// 
//
//生存难度：
// 
//宜居聚居地
//无有害实体thumb
//Level 149中的椰子树。
//
//Level 149是后室的第150个层级。它大约在600年前由失落骄阳部族发现。
//
//描述：
//Level 149是一处在广阔的天空包裹下的空间，其中悬浮着许多岛屿，岛屿上可以找到一些椰子树。这一层级的面积是有限的，据探测这些目前最远的岛屿在400公里（250英里）外。
//
//Level 149并没有昼夜交替，而是保持在夜晚时分1。太阳仍然能被发现，但它似乎被固定在了某一位置。此层级的平均气温为32℃（90℉）。此外，雨水与中等强度的风在此层级也十分常见。
//
//Level 149的重力十分微弱，仅为前厅或大部分后室层级的15%，大约等于月球表面的重力。在层级底部有一股非常强的风，这使得层级中的岛屿免于坠落2。
//
//thumb
//Level 149中的椰子果实，可以食用。
//
//这一层级中的岛屿形态各异。有些能达到方圆6公里的规模，有些却只有几平方米的大小。它们以不同的倾角、位置与成分散乱地漂浮在层级各处。目前已经探明的岛屿数量超过2000个，它们由沙子、泥土和岩石组成。在这些小岛的中央总是分布着若干椰子树，数量从一到两百多棵不等，树木的生长和其所在的岛屿大小有关，其高度与岛屿的宽度的一半相近。Level 149的岛屿形状并不固定，但在大多数情况下，距离层级中心越近，岛屿就越大。这些岛屿上经常会覆盖着某种植被，例如草或灌木丛，在少数情况下会有热带花卉。因此，层级中还栖息着一些可以在前厅发现的昆虫，例如蚂蚁、蟋蟀等。岛屿的地面中营养物质含量异乎寻常的高，甚至可以在无任何外界影响下支持生命的存在。
//
//因为Level 149的以上特性，包括食物（椰子、昆虫等），这一层级是适于居住的。因此， 失落骄阳的一个部落选择了这里作为他们的家，并且由于他们没能找到离开这个层级的可靠方法，他们决定长期驻留此地，并对层级进行了较为彻底的研究。
//
//屏障
//屏障是Level 149的一部分，位于层级的边界附近，距离层级中心约200公里（120英里）。它被认为是层级的终点，因为在屏障附近没能找到其他岛屿。目前的研究证实，这是由于该区域附近的重力明显增加以至于岛屿已经不能被强风支撑住。这一区域被认为是高度不稳定的，据流浪者报告，他们在这一区域听到了巨大的噪音，并感受到强烈的焦虑。这一区域目前尚未被完全记录，且没有任何人对此地进行过完整的探索。尽管在物理上该层级具有边界，但据推测层级的天空应该是无限的。
//
//基地，前哨和社区：
//失落骄阳 椰子岛民：
//Level 149目前唯一已知的社区，位于层级中最大的岛屿上。
//建筑物包括易洛魁3风格的长屋，各式树屋，和一座公共建筑。
//由于缺乏可靠信息且与后室其他区域较为闭塞，目前不清楚该部落的具体人数，据估计在40-100人之间。
//作为整个后室最古老的社区之一，他们在600年前即定居于此。
//以薄薄的椰子树皮和棕榈树做成的长矛为武器。定期狩猎层级中唯一的实体“椰饵”并收集成熟的椰果以在整个社区进行分发。
//与大多数失落骄阳成员的游牧生活相反，这一部落成员的生活很大程度上是固定的，其原因是离开此层级的困难性和其中拥有的食物或水的供应。
//对大多数流浪者持中立态度，但几乎不会接受新成员，除非流浪者表现出成为他们一员的强烈意愿。在大多数情况下，他们会向流浪者提供住房。
//实体：
//Entity 61, 或被称为“椰饵”，是这一层级中被发现的唯一实体。目前尚不清楚发现这一实体的时间及经过，但自从它们到达这一层级以来便被Level 149中失落骄阳的成员所熟知，并早在15世纪就曾绘制关于这一实体的纸卷。Entity 61的肉在这一层级中被认为是一种美味佳肴，尤其因为其稀有性以及喜欢居住在较偏僻岛屿的习性。
//
//入口和出口：
//入口
//目前只有一种可靠的进入方式：
//
//从Level 46 中某些重力明显较低的部分可以进入Level 149中最大的岛屿。
//出口
//目前只有一种已知的离开此层级的方法。
//
//走进屏障深处，有极小概率可切出到Level 37 或Level 140。切出到其他层级的可能性仍然存在，但目前仅有这两个层级得到确认。应当注意，这一方法十分困难且不可靠，因此在500年中仅有5人被确认离开了此层级——这意味着绝大多数居民都将在Level 149度过余生。
//[+] 作者信息
//« Level 148 | Level 149 | Level 150 »
//
//脚注
//1. 译注：这似乎与下文有矛盾，但原文如此。
//2. 译注：原文如此。虽然我没看懂
//3. 译注：易洛魁是美洲原住民部落联盟，各部落凭借具有约束力的法律而在精神层面和谐共处，是一种对土地十分熟悉的公社型文化。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl149{}