//Level 144
// 
//
//生存难度：
//等级 5
//
// 
// 
// 
//Gothic%20Ruins
//最佳天气情况下，一座典型的Level 144的前哨站废墟。
//
//Level 144是后室的第145层，主要由一片泥泞的平原组成，受到持续性的永久降雨影响。
//
//描述：
//Level 144永远被厚重的暴雨云层所笼罩，持续而不稳定地降雨，但雷击几乎是连续的，只要暴露在室外，就受其严重威胁。
//
//Level 144的地面满是泥泞，不可能步行穿越。不相信这一事实的结果即是导致人员陷入泥地而死。人们认为，绝大多数切入Level 144的流浪者都抵达在泥泞的平原上，并因此而死。
//
//在Level 144的的旅行仅限于一组高高架起的石质堤道。这些堤道平均约高15米，宽1.5米，但它们的尺寸浮动很大。这些堤道的作用是连接一些废墟，后者据说最初是由某个不知名派系作为前哨站而建立。堤道很少按直线延伸，常常发现某条堤道垮塌或是无法通行，使流浪者折返。
//
//仅应在和风细雨的短暂间歇内出行，这是由于堤道狭窄又湿滑，而且缺少栏杆或是扶手，很容易让人员跌落致死。由于天气变化无常，且各前哨站之间往往至少隔着数英里的距离，外出旅行的风险是注定的。堤道也受到了雨水的严重侵蚀，极其不平整，哪怕只是瞬间的不注意，也会导致致命的滑倒，因此，在堤道上行走时必须时刻保持谨慎。
//
//除非Effulgentine发现了你，那就撒开脚步跑吧。
//
//废墟的规模、结构和荒废程度各不相同，但多数仍保存有房间供流浪者栖身。不幸的是，霉菌和其他真菌在Level 144的潮湿环境中得以茁壮成长，使得几乎Level 144所有的建筑结构都受其侵袭。这些真菌有毒性，不可食用或是吸入。
//
//废墟里常见骸骨，偶尔是现代流浪者的，但多数似乎属于曾经使用甚至是建造了前哨站和堤道的那个派别的成员。由于普遍的潮湿和霉菌的破坏，从废墟中并没有找到任何具有考古价值的东西。试图给未来的流浪者留下地图或是信息的尝试也同样徒劳。
//
//几乎全部Level 144的人员都是偶然到达的，因为这里荒无人烟，不产出任何有价值的资源。也就是说，如果你有时间为此做准备，你要携带多套保暖的防水衣装、睡袋、手电筒、武器以及尽可能多的食物。虽然雨水可以安全饮用，但只有从空中直接接住才能够饮用，因为落到地上的水必然受到了真菌污染。如果可以的话，还应当携带一个强过滤性能的呼吸器面罩。否则，就利用你手头的东西做一个，并尽可能地避免与真菌接触。
//
//除了雷击的光芒外，Level 144当地的唯一光源就是Effulgentine。
//
//实体：
//Level 144的主要实体是Effulgentine。在雨中，远处看它们就像是灯柱。然而它们是巨型的人形实体，高度通常超过20米。它们有着一双大而平扁的足部，这使它们能在泥地上大步流星却不下沉。手部也同样拉长，但不清楚是否有专门的用途，或许只是它们发育过程中的冗余。它们干枯的身体上覆有靛蓝色像鱼一样的鳞片，上面严重感染了侵袭废墟的同种真菌。头部基本上是完美的球形，内部中空，连在长而灵活的脖子上。它们的头部正面部分有缺失，可以从这些空洞中自如地发射强光。
//
//EffulgentineArt
//一幅关于Effulgentine的艺术创作，由一位逃离Level 144的流浪者所绘。
//
//在Level 144的各处都可以在周边看到多个Effulgentine。人们认为它们一生中的大部分时间都是静止不动的，头部以一种神似灯塔的方式360度往复转动。它们通常独自站立，但也有小群聚集的情况。其叫声被喻为雾笛演奏的鲸歌，可以传到数英里外。观察到Effulgentines能对彼此的叫声做出反应，这表明它们至少拥有基本的社会智能。
//
//偶尔会目击Effulgentines在泥泞的平原上漫步，当它们这样做时，总是把自己的头朝下，来回投射光束，好像在寻找着什么。只有当它们在追捕人类猎物并想要隐秘行事时，Effulgentine才会熄灭自己的灯光。
//
//绝大多数情况下，Effulgentines对于穿越堤道的人类无动于衷，但它们会在某种随机的时间点变得具有敌意，要么追赶人类，要么埋伏人类，把人员从堤道上扯下来。已知它们甚至会在前哨站外连续等待数周，只为在躲藏的人类行动时捕获他们。
//
//一旦被其捕获，它们会毫无怜悯地将人员扔进自己的发光巨口里。目前不清楚人员是会被囫囵吞下，还是被光解体。
//
//Effulgentine所产生的强光和噪音足以眩晕近距离的人类。它们还能轻易追上人类，并具备将人类当做布娃娃一样抛来抛去的体型和力量。但它们似乎不能或是不愿为了获得猎物而破坏前哨站的废墟，所以废墟成了躲避Effulgentine和恶劣天气的庇护所。
//
//通常情况下，只有当一个Effulgentine攻击一群人类时才会有幸存者，因为它们似乎会在击杀两三个人后对此失去兴趣。
//
//Level 144其他实体的存在更像是捕风捉影，并没有被M.E.G.所证实。一些流浪者称，地表有大小各异的隆起物移动，甚至偶尔会突破地面。然而对于这种生物的体型、外观和行为的报告有极大不同。因此，流浪者将泥泞平原上的任何异常处都看做潜在的未知实体，并依此采取相应行动。
//
//来自后室其他地方的实体进入Level 144的情况似乎不比人类来的频繁，而废墟上通常由非本土实体所占据，又由于前哨站废墟是Level 144的唯一安全区，流浪者可能被迫要在接触敌对实体或暴露自身存在之间做出取舍。
//
//入口和出口：
//我们认为，Level 144中被毁坏的前哨站都曾拥有出口。但不幸的是，目前只有不到百分之十的前哨站废墟中仍然拥有可用的出口。这意味着，普通流浪者切入Level 144的话，为了找到出口，必须探索大约十几个前哨站废墟。由于晴朗天气的少见，这段旅程往往需要数周时间，如果人员准备不足，饥饿和暴露己身都会成为像是Effulgentine一样的生存威胁。
//
//幸运的是，所有出口也能作为入口使用，并且看上去很稳定。这促使了M.E.G.尝试通过其中一个已知途径来建立基地。在开始，最大的困难是真菌。但Effulgentine很快就意识到了M.E.G.的存在，并围攻了这座前哨站。这毁坏了出入口，并阻挠了对该层级的进一步探索和对其他流浪者的援助行动。最终，由于在Level 144的驻扎尝试困难重重，并且无法证明在此地建立纯观察哨站的合理性，该前哨站被放弃了。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl144{}