//Level 137
// 
//
//生存难度：
//等级 0
//
// 
// 
// 
//Level 137是后室的第138层，可经由Level 2的某扇门进入（详见入口和出口）Level 137在2016年首次发现，但对其的探索尝试直到2021年末才开始。
//
//Cicadinen_(Hemiptera-Homoptera)_von_Mittel-Europa_(1896)_(19988405174).jpg
//一张从桌上取下的海报。值得注意的是，上面似乎是蝉的解剖图，而非飞蛾。
//
//描述：
//Level 137由一系列研究室组成，以老化痕迹明显的木材建造。Level 137的环境非常明亮，每间房间里至少有一盏煤油灯或是一根蜡烛照明。
//
//整个区域覆满了某种粉末，最初被认为是灰尘，但之后发现是褪下的飞蛾鳞片。多个探险者都声称自己听到了窸窣的响动、风铃声、和扇动的声音，但并未发现其来源。
//
//Level 137的首个房间内，有一张桃花心木桌，四扇门，靠墙有一个标本展示柜，里面有各种蛾类的标本，用翅膀下方的两个螺栓固定在柜子的后部。
//
//这些展示柜填的满满当当，被门闩锁住。
//
//房间正中的办公桌总体上干净，上面摆着各种海报、文件和笔记，字迹难以辨认。而且当这些材料被拿走研究后，办公桌上面也变得满是粉尘。
//
//从这里开始，后面的每个房间都是一样的。每面都有四扇门，每面都有展示柜。这些展柜大多没有上锁，有些的里面空空如也，但其中部分展柜里有死亡的蛾类标本。据称某个房间里有个展示柜被打碎了，但意义不明。
//
//对蛾类标本的研究显示，其腹部下方可见一条裂口，里面完全没有任何器官或是组织物。触摸这些标本的内部会使其短暂地摆动它们的翅膀和附肢，但没有找到令它们长时间复活的方法。M.E.G.所属的特工人员已带走其中一个标本，将其带回了阿尔法基地。
//
//但她的母亲很想她。
//她滑坐在膝盖上，折起的翅膀不自觉地压在身后的地板上。她缓慢地把双手遮到脸上，把手折叠在本应是嘴部的光滑位置周围——并无声地啜泣。
//她花费了多年时间去研究完善她的手法。即使是创造像待在自己箱子里的这些小生物，也是一项艰难的工作。而哪怕是失去其中的一个，也是毁灭性的损失。
//她探出去看了看自己最新造物曾经在的位置。它是在她离开时被带走的，那时她正在寻找材料来填补它们娇小身体里的空隙。
//她俯身，把触角顶在墙上，挎包放在一边。休息片刻后，她把手按在满是粉末的地板上，把自己往上撑，直到站起来。还有其他可用的，她只能继续工作。
//她把挎包举到桌案上方，慢慢地打开，掏出她左边展示柜的钥匙，盯着它看了一会儿，然后又埋头观察她的新材料。
//
//入口和出口：
//只发现了Level 137的一个入口，是位于Level 2的一扇陈旧木门。这扇门没有把手，把手所在的空洞周围划痕遍布。由于Level 2的规模之大，通常很难找到这扇门，但很多流浪者都声称自己是被扇动的声音和风铃吸引而来。
//Level 137中存在各种出口，但目前没有对这些出口的官方描述。据称，Level 137直通Level 19，但也有至少两位探险者通过Level 24抵达了Level 137。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl137{}