//Level 113
//Level 113： 真正的机器之地
//等级： Lambda	不稳定	富敌意的人形实体
//↓112	↑114
//« 描述 »
//level113.a
//图1 — 自区域 ב 观测到的区域 א
//
//Level 113 — 通称“真正的机器之地”1，旧称“机器之神”2 — 是一片城市化的环境，可分为三（3）块特定区域，分别编号为区域 Aleph（א）、区域 Bet（ב）及区域 Gimel（ג）。
//
//区域 א 曾被认定为完整的 Level 113，是一结构类似燃油发电站的大型自动化设施；区域 א 相当残破，沿墙壁散布有缺罅及裂缝，墙上布满污渍。א 的墙壁主要由混凝土筑成，并用钢筋和钢框架加固，只在有窗户的部分中断。整个区域 א 的地面均铺有地砖，其材质为某种未确认的陶瓷材料，该材料部分性质与普通砖块相符。区域 א 的灯光主要由白炽灯提供，这些灯似乎有故障，发光质量参差不齐，有时会在毫无征兆的情况下熄灭。
//
//区域 ב 是一片类似美国大城市的环境。该区域完全由铝、铁、钴和铜等金属材料组成。区域 ב 在其限辖范围内有数量最多的实体，通常位于大道上和大多数建筑的底层。这些建筑被认定为异常现象，有时被描述为 Level 113 中被忽视的实体物种；之所以如此认定，是因为这些建筑在附近存在可能有害的刺激时可以“装死”，显示其具有原始智能。除堡垒及发电站（见区域 א）外，该区域的建筑大多是空的。区域 ב 的堡垒外观上类似位于 ב 中心一座戒备森严的地堡。它被包裹在大约25块纯钨板中，因此该地堡对多种武器攻击具有强大的抵抗力。Level 113 之王及大多数皇家级器灵都居住在这里。
//
//level113.b
//图2 — Level 113 中实体35的一般行为模式
//
//区域 ג 是围绕整个区域 ב 和区域 א 的机械框架，类似于整个 Level 113 的基础框架。由于根本无法接近该区域，关于区域 ג 的信息相当少；但通过使用强力聚光灯和激光测距装置，仍可以相对仔细地检视 ג。区域 ג 结构为笼状，支撑梁散乱地穿过其框架；此外，有11个实体35定居于该笼状结构的最高区域 — 这是唯一一种在 Level 113 及其他层级均有分布的实体。但这些实体的行为似乎与其他层级的同类有所不同。这些实体35被观测到能够模仿不同的形状和符号。以下是它们最常被观测到模仿的符号（图2）。
//
//Level 113 的主要特点是其主要实体—器灵3—与其他层级的实体之间存在巨大的智力差距。Level 113 中每一种独特实体类型的智商估计都在125以上。器灵是高度智能的自动机器人，表面覆有保护用的铝板或塑料板，根据其在器灵等级结构中扮演角色的不同而展现出不同的外观、大小及行为。
//
//安保级器灵
//军用级器灵
//皇家级器灵
//安保级器灵4（SGM）是一支专为执行防御程序而设计的器灵，其职责为确保 Level 113 的机密性。SGM 通常使用加密或伪装的方式确保敌方不知道它们的存在。
//
//« CDT 数字间谍单位 »
//机密防御型数字间谍单位5
//
//CDT 数字间谍单位是一种常见的间谍自动机器人，只在 Level 113 内发现。数字间谍单位 外观似小型机动车辆，其上装有一雷达天线。数字间谍单位的职责是篡改或渗透 Level 113 内的文件和电信讯息；这些自动机器人会执行一切必要的尝试来完成其任务。
//
//« CDT 摄像间谍单位 »
//机密防御型摄像间谍单位6
//
//CDT 摄像间谍单位，有时也称 CDT 物理间谍单位，是一种常见的间谍自动机器人，只在 Level 113 内发现。摄像间谍单位外观通常似带有一个轮子的小型机动车辆，上面安装有一系列球形摄像头。摄像间谍单位的目的是监视敌方，并为器灵地面部队的安全通行提供保证。
//
//« 发现过程与历史 »
//level113.c
//图3 — Level 113 的高分辨率照片，由 Kara H. Thanatos 拍摄
//
//真正的机器之地于第一次器灵-人类战争之后的1986年首次被记录，记录者是几位从[已编辑]的遗迹中逃出的流浪者。一名幸存者—Kara H.Thanatos—选择用她损坏的相机来监视器灵的行踪；观测过程中，她在[已编辑]找到了一扇出口门。Thanatos 在 Level 113 徘徊了25分16秒，直到被一 CTD 直升式单位发现并攻击。其小腿、臀部和头部中枪身亡。摄像机继续拍摄13秒，直到被同一直升式单位击毁。在接下来一年的某个时间点，一名未透露姓名的人在绝对保密的情况下从 Kara 的尸体中取出了所有子弹，同时从相机中取出了 SD 卡。
//
//« 器灵所参与的战争 »
//« 第一次器灵-人类战争（1986） »
//« 交战方 »
//
//器灵
//人类
//实体33
//实体96
//第一次器灵-人类战争始于1986年12月26日，据推测是在6名来自 Level 80 的流浪者携武器进入 Level 113 之后。当时 Level 113 的君主—Bismarck-Richelieu—误以为那是一次攻击行动，于是第二天便向实体1宣战。Level 0、Level 7、Level 9、Level 11 和 Level 94 是战争的主要前线。第一次战争期间，大部分战争前线都能得到妥善修复；唯独 Level 0 遭受了不可恢复的严重破坏。人类在第一次器灵-人类战争中取得胜利，Level 113 被与后室其他部分隔离开来。
//
//« 第二次器灵-人类战争（2014） »
//« 交战方 »
//
//器灵
//实体67
//人类
//实体96
//第二次器灵-人类战争于2014年9月29日开始，起因是器灵与实体67之间达成防御协议及人类的进一步军事化（尤其是在探险者总署和后室装修公司军事化后）加剧了器灵与人类之间的紧张关系。监督者A和B签署了一份宣战书，宣称纵容器灵的存续无异于允许“在我们的后院形成一个智力奇点”。
//
//2014年10月2日，“Karl”小队于区域 א 及享乐层发动了一次突袭。10月，Yamato-Richelieu 宣布部署 Level 113 的所有军事资产，以打击进攻部队；此举将战线推进至 Level 11、Level 4 和 Level 302 的边界—这些层级对于维持后室生态系统的稳定是必不可少的。2014年10月30日，双方达成停战协议，迫使实体1武装力量放弃了8个层级，包括 Level 6 和 Level 10。
//
//« 基地、前哨和社区 »
//自第二次器灵-人类战争以来，Level 113 内便不允许存在任何人类据点。若有据点建立，器灵将对在场的所有人类执行格杀令。
//
//« 入口与出口 »
//« 入口 »
//[应停战协议要求进行编辑处理]
//
//« 出口 »
//目前为止，已知 Level 113 的出口只能通往 Level 11、[已编辑]和原 Level 110。
//
//Level 11 - “无限城市”
//欲进入 Level 11，须在区域 א 内找到一扇出口门，该门通往 Level 11 中一扇随机的出口门。一旦离开，该门将自动锁死，无法返回。
//原 Level 110 - “奇点之后”
//当前，自区域 ב 的边缘处跳下可以抵达原 Level 110。在原 110 被破坏前，自 Level 113 某幢建筑的屋顶层经一扇门离开便可抵达原 Level 110。类似于通向 Level 11 的出口，该门也会在有人通过其离开后自动锁死。
//[显示作者及图像资源]
//Footnotes
//1. 译注：原文为拉丁文 Verum Terra Machinis。
//2. 译注：原文为拉丁文 Deum De Machinis。
//3. 译注：原文为拉丁文 Machinarum。
//4. 译注：原文 Security-Grade Machinarum。
//5. 译注：原文 Confidentiality Defense-Type Digital Espionage Unit。
//6. 译注：原文 Confidentiality Defense-Type Photographic Espionage Unit。
//7. 译注：原文 Military-Grade Machinarum。
//8. 译注：原文 Classic-Type Multiple-Use Ground Unit。
//9. 译注：原文 Classic-Type Offensive Firestorm Unit。
//10. 译注：原文 Classic-Type Explosive Device。
//11. 译注：原文 Classic-Type Offensive Helical Unit。
//12. 译注：原文 Neo-Type Offensive Acceleration Operator。
//13. 译注：原文 Royal-Grade Machinarum。
//14. 译注：原文 Royal-Type Servant Unit。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl113{}