//熟悉的地铁隧道向前不断延伸。在永恒之中，前进毫无意义。走过几里之后，流浪者们便会发现自己又回到了原点。往好了说，进入这里就像是走进了一场不寻常的梦；往坏了说，此地便是一个人最恐惧的梦魇。昏暗的灯光、碎裂的石柱、废弃的轨道。在这场无尽的旅程之中，它们便是流浪者所见的一切。
//
//没有实体，没有人类。在一段时间之后，就连影子也会抛弃它的主人。然而，一种“被跟踪”的感觉却无时无刻不萦绕在空气中。墙壁上没有眼，却能注视流浪者的一举一动。时间一分一秒流过，我们的界限越来越近，直到填满虚无的空间。呼救，不过是向一片无人的深渊厉声呐喊。流浪者被彻底隔绝其中，任之自生自灭。
//
//道路通向四面八方，使流浪者不知所措。但千万别妄图在其中找到方向——随着时间的流逝，方向感将被彻底剥离。那些路通向哪里？亦或者它们根本没有目的地？越是深入，流浪者对于现实的掌控便越发薄弱。这是真实的吗？当心那些陷阱，它们会引诱你进入一片万物俱寂的世界，唯有抽离的记忆伴你左右。
//
//囚徒们不愿接受自己必然的命运，一次又一次徒劳地尝试反击潮湿的围墙。他们像老鼠一样挣扎着，而砖墙则如鹰隼般环绕着。无助之人的双眼频繁眨动，盼望着自己能从这短暂的梦境之中苏醒；然而可惜的是，这场噩梦永远没有尽头。令人生畏的极寒冻结了顽固者的所有意志，他们再也无法抽出力气去绝望地祈求出口。
//
//隧道的尽头没有光——只有无尽的黑暗。时间流逝，流浪者们终将与自己的影子融为一体，走入那片深渊，与无尽的黑暗共舞。这座废弃的建筑将是时间长河冲刷之下唯一不倒的囚笼，受困其中的流浪者终将向它那残忍的禁锢屈服。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl133{}