//Level 159
// 
//
//生存难度：
//等级 3
//
//不安全
//不稳定
//中量实体snowy1.png
//Level 159，郊外几条小路之一。
//
//snowy2.png
//在Level 159更为空旷地点找到的加油站。
//
//Level 159是后室的第160层。
//
//描述
//Level 159为一美式小镇，量得其面积约3000平方千米。层级内，建筑风格各异，而似乎大体与80~90年代美国的城建相近。除了建筑，Level 159主要地形为平原，有枯死的杂树灌木的丛块。Level 159亦展现了低温与极端的天气。暴风雪常肆虐于Level 159，导致地面在大部分时间被雪覆盖。由于近似等量持续的雪会将任何开阔地覆盖，清理雪的尝试一般无果。但虽然受到持续降雪的影响，Level 159的地表似乎永不能产生深于四厘米的积雪。
//
//Level 159的气候稳定性极差，关于气候的一切，都可能随机改变，1但温度一般不会到达极端的数值。温度在随机的时刻波动，但似乎永不达到0摄氏度以上，亦不会跌到-19摄氏度以下。Level 159似乎也具有古怪的天气模式，可能从阴云密布到无云的转变仅仅需要几分钟。本层级中云的存在与降雪似乎无关。层级原生实体似乎不受低温与强降雪的任何影响，但其他生物仍被环境正常影响。在未损坏的建筑物中，温度一直比外部的温度高10摄氏度。天气与温度变化可能是层级范围的，它影响着层级的一切。
//
//Level 159中可找到的实体包括猎犬与笑魇，双性死亡飞蛾与大数量的层级特有实体。层级特有实体在很多方面都是相似的，甚至包括知觉方面。许多有意识的实体都具有与人类似的智力和情感。与人类相似，它们和流浪者似乎使用同一种方式在层级中穿梭。很多实体并不能归于一个类别，所以描述下方将会有实体的列表，来帮助你区分实体。大多数实体能够归入实体列表的多个类别中。
//
//Level 159也含有大量独特地点或环境，大多数都能无视层级中的极寒，保持在0摄氏度以上。建议您进入这些地区时保持高度警惕，若可能请绕路而行，因为大多数这些地点包含了危险物质或危险实体，但不排除少量例外。更多关于此的信息列于实体列表下方。
//
//实体种类：
//关闭
//类人实体
//类人实体是层级中最稀有的一种实体，仅仅组成了层级内10%的已发现实体。大多类人实体有与人类相似的强处与弱点，似乎也与人类有一些性质相似，例如可用于抓握的手指2、双足行走的能力等。即使主动带来危险的类人实体也多次被目击并需要一定注意，类人实体大多数也可以归为中立实体一类。
//
//半人实体
//半人实体为大小介于人类与动物间的实体，它们似乎有很多种类，最常见的有着更似人的上半身和更似动物的下半身。这些实体有些能够一定程度发出人类的语音，但似乎有些完全不能说话，它们会以书写形式与其他类人实体或人类交流。有着似动物上身与似人下身的实体也曾被目击，但由于身体比例不平衡，愚笨，无法说话及使用工具，它们似乎无法长期生存。
//
//非人实体
//非人实体为无人类特征的实体，亦是Level 159中最常见的一种实体，组成了大约65%的实体数量。非人实体种群的强度与生存状态取决于实体本身的形态、智力与行为。几乎一切已确认的非人实体都具有人类语言能力或能直接与人类交流。非人实体可能像Level 159之外的实体一样危险。目击一个非人实体后的最好应对方法是退回，以避免当面对抗。
//
//中立与被动实体（无危胁下）
//被动实体是在无威胁、伤害情况下表现出被动的实体。有意识的被动实体似乎生存地很小心，有迹可循，比那些组成小组扮演腐食者或肉食者的主动实体要好得多。有意识的被动实体似乎可能帮助流浪者生存，也展现结伴生存的能力。建议流浪者以尊重人类的方式尊重这些实体，否则可能极大损伤该实体与流浪者的潜在的信任关系。其他似乎缺乏意识的被动实体经常以实体死去或流浪者生活留下的废物生存，也倾向于避免任何正面冲突。
//
//主动的危险实体
//主动危险实体，或称AME，是在任何精神方面或物理方面可以寻猎流浪者的实体。若缺少分类或标志物的话，这些实体似乎很难识别出来。标志物一般有血迹、不稳定的行为与极大的啸声或低沉的声音。一些此类实体似乎能够模仿人类语言，去吸引容易受骗或过度好奇的流浪者，使其被杀死。尽管这些实体的模仿能力非常稀有，但这种情况经常发生，可以视为一种威胁。实体几乎会攻击任何其他看见的生物，所以当两个这种实体遇见时可能决斗至死。因为这类实体的重大冲突，实体完全不能集中攻击某个基地或组织。
//
//奇异实体
//奇异实体，是具有轻微的温和的异常能力的实体，但似乎与它们的生物学特征无关。奇异实体一定程度上能够掌握它们的异常能力，但也有目击的例外。大多奇异实体具有缺点或弱点，有着不同的严重性，一些甚至能在一小段时间内无效化异常能力。因为具有最强的异常控制能力，奇异的危险实体极为危险，应该尽全力避开。这个类型的实体也可以分到其他实体类型中。
//
//特殊环境地点
//关闭
//加油站
//一切已发现的加油站有着敌对或危险的实体，但不太可能导致流浪者死亡。加油站若被清空或安全，会以白旗为标志。所以若未做好充分准备，不建议进入一个无白旗的加油站。所有曾被报告给M.E.G.的加油站都货架上似乎摆满了食物和饮料，类似于前厅加油站经常提供的食物和饮料。空货架似乎在随机时间刷新产品。M.E.G.管辖下唯一的加油站目前是该级别内所有行动的基地。
//
//操场
//几个与前厅相似的操场稀疏分布在奇异的地点，像是在楼顶或路口之类。操场的地板由沙砾或木屑组成，很难光脚走上。有时食物或水瓶出现在长椅或桌子上，但发生的频率太低，无法作为稳定的食物来源。在此类建筑时保持一定程度的注意，因为敌对实体仍然能够进入操场，非敌对实体通常把它当作路标。在操场上的温度恒定在5摄氏度。雪在触碰地面时就直接融化，原因未知。
//
//造物堆坑
//造物堆坑（被称为堆坑）是顶面有几个圆柱形开口的大型水泥掩体建筑，可以在空旷的环境中找到。堆坑中满是未知来源的高发达科技产物，最重要的是包含了液体罐，似乎有几个独特的实体保存在水体中，且液体罐的电脑似乎能够随机控制这些实体的形态、特征与行动。电脑创造实体的方式是未知的，但可以确定堆坑是Level 159实体创生的地点。当实体完全长成时，它的罐仓就会直接发射，并且去往Level 159的随机地点。发现不同灵长类动物的骨骼与几个未知物种的骨骼遗骸散落在整个层级，这些骨骼可能来自层级原生的这些实体。如果您遇到任何类似于灵长类骨骼任何东西，建议您将其位置报告给最近的M.E.G.前哨站，让我们进行进一步研究。
//
//废弃商场
//废弃商场是一间巨大、破旧的商场，大约占地2平方千米，高约50米3。内部温度似乎一直稳定在18摄氏度，且完全停滞，使在该建筑内无法点火或使用加热器具。尽管购物中心规模庞大，但似乎主要由通常在前厅中可以看到的品牌的关闭商店和几个空的“待售”房间组成。还有曾经目击的其他房间无法归到这两种类别中，似乎目的完全不同，这些商店售卖随机的产品，从空瓶到不知来源的古代武器与工具。每个物件似乎都有一个由垃圾列表组成的价格标签。如果能成功找到这些垃圾，将这些垃圾放入商场中稀少出现的储存箱，就可以取出对应的物品。如果没有付正确的物品或没有任何支付，离开上产时物品将会直接消失。
//
//造物牌匾
//造物牌匾是一个似乎坚不可摧的金色牌匾，位于Van Dieria，上刻一句话：“我们已到达一个伟大的发现，但亦创造了一个恐怖强大的思想，比我们提供智慧的限度还高。由于天可能也拥有这些造物，我们可能早已被杀死。对于留下的人，我只有一件事要说，请不要飞得太靠近太阳。”强烈建议不要试图破坏造物牌匾，这仅仅会使工具磨损，且当地生物可能对你深表怀疑。
//
//基地、前哨和社区
//M.E.G.前哨“凝城”
//凝城是M.E.G.的中型前哨站，由3名M.E.G.员工和几名志愿者建成与维护。与大多数其他已占领加油站相同，这个前哨站货架上储存的食物和饮料可随机刷新，成为了该层级仅有的次可靠食物来源之一。食物和水平均分发给前哨站的所有工作人员。因为食物与水的简单分发，凝城最受层级内流浪者称赞。
//
//Van Dieria
//Van Dieria，是一个有着368名流浪者与实体的小型古老住区。实体占了本基地的三分之二人口。除了前门与后门，本基地被严密的墙壁封锁，以预防主动危险实体。本基地无任何管制，因为人口太小没有必要。所有决定是由长期居民的投票产生的。名字Van Dieria的意义不明。
//
//入口与出口
//入口
//于Level 1或是Level 4中打开冰冷结霜的金属门，直接进入Level 159。
//乘坐开往Level 36中C航站楼的有轨电车，能够达到Level 159内一个废弃的小型机场。
//有极小概率进入Level 11的商场将会达到废弃商场。
//出口
//进入一个甜品店会去往Level 11。
//进入一个入口上方有一个“Roller Rockin' Pizza!”字样的拱廊建筑，将去往Level 40。
//在10秒内返回进入层级的门，将原路返回到以前的层级，在此时间段之后尝试重新进入将导致门突然关闭。
//进入Level 159内的沙井，进入Level 34。4
//作者信息
//« Level 158 | Level 159 | Level 160 »
//
//Footnotes
//1. 译者注：原文Level 159's climate is extremely unpredictable and almost everything about it can change on a dime，这里没有找到“change on a dime”是否是俗语。
//2. 译者注：此词没有查明翻译。正在询问原作者。（编辑者注：英文原文的“对生拇指”，是指能够轻松碰到其他手指指尖的拇指。）
//3. 译者注：原文为"0.05 kilometers"，已经改为更加合适的单位。
//4. 译者注：入口出口部分原文没有添加无序列表。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl159{}