//Level 195
//警告
//本文档仅供 M.E.G.中高层人员查阅。
//Level 195受M.E.G. 监督，其在没有正确的防范措施时进入是有害的。
//Level 195的所有入口均受到看守和保卫，未经许可不得进入。
//请输入您的凭据以查看本文档。
//
//
//凭证通过
//
// 
//
//生存难度：
// 
// 
// 
//
//
//7310716326_7fc79a530f_o.jpg
//一颗树上的锌制树枝
//
//Level 195 是一个类似于地球上的森林的生态系统，但是 Level 195 中的所有物体均由过渡金属和后过渡金属制成。
//
//描述:
//Level 195的大小未知，温度在 23°C 至 17°C（75°F 至 62°F）之间波动。此层存在昼夜更替，一次完整的更替需要 38 小时才能完成。此层级白天似乎有太阳，但晚上却没有星星或月亮。白天，天空是灰蒙蒙的，几乎没有云。由于整个层级都缺少水，因此湿度极低。此层级只有汞雨这唯一的天气形式。
//
//此层级的地质、动植物群与地球森林有着惊人的相似之处，所有原生物体都由金属组成，最常见的金属是铝、镍、钛、银和钨。你可以在此层级中找到所有的过渡金属和后过渡金属，除了锝 (Tc) 和钋 (Po) 之外。这两个例外都是有放射性并且没有稳定同位素的元素。
//
//尽管这里的植物似乎会随着时间的推移而生长和发育，但由此形成的生态系统都是由金属制成的。该森林的生物群落中也有原生动物，其由各种金属组成并与地球上的生物存在对应关系。这些有机体具有内部结构，并且通常由较软的金属制成，例如金、铜和镓。树木由更坚硬的材料制成，且越靠近树干的中心就越硬。树木根部最柔软，并吸收地下所发现的汞。
//
//13712756264_8dba97e45c_c.jpg
//由镉和铁制成的鸭子。
//
//对土地的挖掘显示出由不同材料组成的各种斑块。这里的金属似乎不会被空气氧化，所以铁和铜不会生锈。类似晶洞的结构在地下很常见，内部显示出了一些稀有金属，如铱、锇、铑和钯。在地下深处也发现了稀土金属矿脉，其中钇在此矿脉中含量最高。
//
//此层级中不存在水，河流或湖泊等区域的水被汞所取代，汞在此层级的温度下是液体。空气中的重金属颗粒具有剧毒，会引发各种健康问题，如呕吐、恶心、疲劳、易怒、记忆力减退等。传统情况下对人类有毒的金属仍然会在体内发生预料的反应。强烈建议避免接触任何液态汞，因为汞长时间接触皮肤会对健康造成伤害。
//
//Level 195适合大多数生物居住，但需要从其他层级带入食物和水。建议在此层级内穿戴好防护服和呼吸过滤器。
//
//M.E.G.站点 - "Plutus的锻炉" » 已废弃
//Plutus的锻炉于发现Level 195后不久建立，是该层级内第一个有人永久居住的地点。通过从其他层级进口土壤和农作物以保证温室运转。在找到长期解决方案之前，水将被保存和循环利用，且供应量会偶尔减少。
//
//Plutus的锻炉存在了大约一年，其为 M.E.G. 生产了各种武器、盔甲和工具。当时，Level 195空气中的有毒物质还没有被发现。在此站点运转的前六个月内，40 多人开始出现并发症，比如呼吸系统、神经系统和心血管系统的损伤。这些发现与重金属中毒，特别是铅和汞蒸气的中毒症状相一致。
//
//当时并没有进行合适的环境检测，这很可能是因为当时需要快速建立站点以利用Level 195的宝贵资源。
//
//此站点运转10 个月后不久，生产就停止了。Level 195的出口会以固定的顺序循环变化，但当时无人知晓。在 1 年内，最初的 103 人中有 74 人死亡或重病。剩下的人在第 379 天找到了新的出口，只有 29 人在探险中幸存下来。
//
//附一份详细记载Plutus的锻炉遗址的探索日志。该探索是在事故发生几个月后进行的。
//
//<< 隐藏日志
////[视频记录开始] // » 195/FP/ex1
//
//[镜头缓慢移动]
//
//Lazarus: 开始了吗?
//Skye:我想是的。
//Lazarus: 这是…… Plutus的锻炉探索日志 1。那儿发生了——
//Skye: 你不需要解释，它已经在文档上了。
//
//Lazarus: 不管怎样，我们应该接近那个站点了，这里的树看起来都乱七八糟了。
//[脚步声]
//
//Lazarus: 在那里！你看见了吗?
//Skye: 当然。
//
//[镜头拉近，远处有一个破败的前哨]
//
//[镜头切入PLUTUS的锻炉]
//Lazarus: 停电了。
//Skye: 废话,这个基地已经荒废了一段时间了.
//
//[手电筒的咔哒声]
//
//Skye: 这里是怎么被破坏成这样的？没有任何东西能造成这种破坏。
//Lazarus: 我们往这走吧，我想这里会通向中央的房间。
//
//[进入后，地板上躺着5个人。]
//
//Skye: 我们需要治好这些人。我认为一旦新的锻炉建成并运行，他们就会这样做。
//Lazarus: 但愿如此
//Skye: 档案室就在那条走廊的下方。我们先去那儿吧，然后再去其他地方。
//
//[门被打开，进入房间。]
//
//Skye: 开始寻找所有关于健康的记录。
//[文件柜的开关声]
//
//Lazarus: 我找到了一些。我认为他们是—
//Skye: 给我。
//
//[他们翻阅了病例]
//
//Skye: 这正是我们需要的。我们需要继续探索其他东西。
//Lazarus: 幸存者没有把大部分重要的东西都带走吗？
//Skye: 他们带走了所有的设备。但没有带走文件
//Lazarus: Skye…我想我找到了一些东西。
//
//[Lazarus举起一张写着字的笔记本纸。]
//[二人一起阅读。]
//
//> 打开附件
//Lazarus: 她成功了吗？
//Skye: 我不知道。我不认识她。
//Lazarus: 我们能看看我们是什么时候来的吗？
//Skye: …好。
//
//[Skye把纸折起来，放在了她的夹克口袋里。]
//
//[镜头切到未知的房间]
//Skye: 为什么这里的墙……被撕裂了？
//
//[镜头沿着墙壁拉近。可以看见裂缝和被撕裂的部分。]
//
//Lazarus: 我们走进来的时候我注意到外面有些地方看起来和这里好像。
//Skye: 你认为这是某些野生动物干的吗？
//Lazarus: 是的。因为这里没有敌对实体。
//
//[Lazarus用一根棍子在墙上戳出了一个裂缝，两个类似昆虫的生物爬了出来。]
//
//Lazarus: 这是什——
//Skye: 回来! 我们以前从未遇见过这种情况！
//Lazarus: 它们看起来……并没有敌意。我们可以尝试获取它们的样本。
//Skye: 好的，我们会把它带回基地，看看那里的人怎么想。
//
//[Lazarus在翻他的包，拿出了一个透明的容器。他抓住了这只昆虫，并用金属塞子把容器封住。]
//
//Lazarus: 抓住了。它看起来像是由几种不同的金属制成的。
//[斯凯走上前，镜头中这只虫子被放大。]
//
//Skye: 它在对盖子做什么?
//
//[昆虫在刮擦金属，似乎在吃它的碎片。]
//
//Lazarus: 我想它会吃金属。这让我想起了家乡的白蚁。
//Skye: 好吧，我们把它放在一个袋子里，这样它就不会从容器里逃出来了。
//
//[镜头切到 PLUTUS 的锻炉外部]
//Lazarus: 我们了解了一切吗？
//Skye: 是的，我们走吧。
//Lazarus: 好吧。关掉摄像头吧，我们不要再浪费电池了。
//Skye: 好
//
//[记录结束]
//在探索完Plutus的锻炉之后，人们对昆虫样本进行了观察。这种昆虫是Level 195的独有实体。
//
//<< 隐藏文件
//实体E-195-1 - "金属白蚁"
//
//Liquid_metal_insect_%283506396611%29.jpg
//由钛和铜制成的金属白蚁。
//
//统合实体分类系统
//实体编号： E-195-1
//栖息地： 195
//IETS:
//2E
//分级：
//Zoophoid
//性质：
//DST
//描述:
//金属白蚁是Level 195的原生生物。这些实体与前厅中的正常白蚁非常相似。它们外壳的材质多种多样，大部分是铝、钛、铂和钒；腿、下颌骨、眼睛和触角由铜制成。它们内部解剖结构与 Level 195内的其他生物一致，其内部器官被相对应的金属所取代。
//
//它们的行为与白蚁类似，但是它们不吃木头，不打洞，而是切割金属。虽然它们更喜欢生活在Level 195的树上，但是它们也会钻进人造的金属结构中。和其他昆虫一样，它们通过产卵繁殖后代，但是其中有一个很大的区别：它们的后代是由母亲在产卵前吃下的金属构成的。这对于在金属白蚁大量繁殖后进行跟踪调查很有用。
//
//金属白蚁通常可以存活2年。它们对热非常敏感，会避开温度超过32摄氏度(90华氏度)的地方，这可以用来防治金属白蚁的侵扰，而传统的防治方法是没有效果的。这些昆虫可以被容易收容在非金属容器中，而且只需要偶尔为它们提供弹片作为食物。
//
//金属白蚁的一个可能的应用是用来破坏金属结构。它们可以被释放到敌人的基础设施中去吃掉金属支撑物，也可以用来处理武器。
//
//行为准则:
//应当:
//把金属白蚁存放在非金属容器中。
//偶尔给它们喂金属
//用热避免金属白蚁的侵袭
//不应:
//将其释放到其他层级，特别是遍布金属结构的。
//尝试压死金属白蚁。他们的外壳非常坚韧。
// 
//
//M.E.G. Site - "锻炉Novus" » 活跃
//在Plutus的锻炉废弃之后，新锻炉在正确的安全系统下建成。锻炉Novus的空气过滤器与气闸门系统一起安装，以减少与有毒尘埃的接触。并且人们对此层级出口地点出现的和时间进行了充分、详尽的计算，以便于人员和物资的进出。锻炉Novus距离Plutus的锻炉大约35公里，其基本组件和建造材料均从以前的基地回收。
//
//锻炉Novus目前有164名居民，因重金属引起的健康问题一直很少，每两周会运一次水。
//
//锻炉Novus还设有一个能用来进一步调查Level 195的生态系统实验室。目前有关扩大Level 195矿物采集和研究范围的计划正在进行审批。
//
//入口与出口:
//入口
//Level 195的入口是稳定的，不变的。
//
//在Level 91中进入一个被漆成蓝色的谷仓。
//登上一艘停泊在Level 230名叫青铜天空号的船。那里是水进口和金属出口的地方。
//触摸Level 75中的铜丝。
//出口
//出口的变化遵循一套周期为320天的循环模式。
//
//打开一扇嵌在树上的金属门将通往Level 230. « 当前出口
//触摸金子做的鸟巢将通向 Level 46.
//进入一个由镓组成洞穴将通往 Level 75.
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl195{}