//Level 108
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//complex.jpg
//从层级上方拍摄的Level 108内部的其中一座“混凝土螺旋”。
//
//spiremap.jpg
//该层级运作示意图，圆圈内的浅灰色代表中空的混凝土螺旋内的地板，深灰色代表走廊，中间的浅灰色代表层级中向上向下的随机路径。
//
//hallnew.jpg
//Level 108的某条内部走廊。
//
//Level 108是后室的第109层。它是一个由中空圆柱体并且内有间隔的“混凝土螺旋”构成的建筑群系，每座螺旋内都有走廊穿过。
//
//描述：
//Level 108是一系列空心圆柱体区域，建筑内部周围有窗户，每层有44个。地板和混凝土墙壁相同材质，在顶部可以看到天空。每个混凝土螺旋的内部都有许多走廊，内部走廊都按照＃字形状排列，而四周的走廊在内部的窗户周围弯曲。走廊里非常黑暗，偶尔会有大型物体挡住去路，从床架到卡车都有。这些物体的出现原因不得而知，但有人推测它们是被切入到后室里的。由于未知原因，这些物体无法被人为移动。据称即使是其中最轻的物体，也“比火车还沉”。
//
//除了相邻窗户的走廊外，所有走廊都处在黑暗中，偶有少数的壁灯照明，但只能勉强照亮其下方。该层级的照明与Level 6非常相似。
//
//不同的混凝土螺旋的中央有各种上下的途径。常见的有电梯和楼梯，但也有报告称是绳索，攀岩壁甚至是悬浮的水柱。
//
//该层级中除了悲尸外没有其他实体。整个层级中也很少听到其他响动，无论是脚步、灯光、电梯运作、窗户破裂等一切都显得极其沉闷和寂静。这种效果使得人员在该层级内易于失去方向感，甚至经常导致精神错乱。
//
//基地、前哨和社区：
//卡车支部
//“卡车支部”是一个小组织，他们住在一辆自己发现的大型半挂式卡车旁，非常乐于交流和贸易，且态度友善。他们声称自己曾经是Level 6中一个更大的团体的一部分，经历了一次大伤亡后，少数人员逃到了Level 108并选择留在该层。
//
//Base Azŭ
//Base Azŭ是一支从M.E.G.中脱离的探索队伍。他们极富攻击性，在Level 108四处移动，杀掉他们所见到的任何人，是该层级的主要威胁。该组织的动机不明，因为他们的攻击性使其无法交流。
//
//入口和出口：
//入口
//目前Level 108有两个已知入口。走入Level 6的某条走廊可以将人员无缝地传送到Level 108。Level 65的某部电梯也会带人员进入Level 108中＃字形区域中央的电梯。
//
//出口
//该层级有多个出口。进入电梯有时会将你送往Level 65，据称也有去往其他层级的出口，都与走廊上阻挡的物体有关。如汽车去往Level 69，铁路模型去往Level 111，花园棚子去往Level 165。在Level 108的走廊里迷路会使迷失人员进入Level 170的某个Ⅱ型混凝土箱。在Level 108的深处探索，有时也会导致进入Level 155。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl108{}