//Level 130
// 
//
//生存难度：
//等级 1
//
// 
// 
// 
//Level 130是后室的第131层。该层级由庞杂的泳池与管道组成，且多处空间违反物理定律。
//
//Level130.png
//Level 130内的一个泳池。可在房间的另一边看到管道。
//
//描述
//Level 130由数量众多的由混凝土或石砖搭建的房间相连构成，每个房间皆空旷而缺乏足够照明，互相之间直接连通；偶尔，也会有两个房间并不相邻，而是由走廊连接。每个房间内皆存在泳池，以及分散在墙面与天花板上的管道。大部分管道会通向附近的泳池，并不断地向其中输送池水；而泳池底部的排水口则会以同样的速率排水。
//
//房间之间的门为统一的白色铁门。部分房间内，存在跨越泳池表面、或是沿着墙体搭建的小过道。所有房间和其内的泳池都是整齐的矩形，但是其尺寸不定，有时泳池甚至会与房间等大，占满所有面积。
//
//泳池内的液体已被确认为污水。所有房间内的池水均为绿色且带有污泥，即使那些房间本身没有污泥的痕迹。直接接触这些池水已被确认不会对人体造成伤害，但依据红白光的检测，除非你对其进行了蒸馏处理，否则直接饮用该液体并不安全。
//
//在该层级内，泳池很有可能出现在墙上或是天花板上。这些泳池内的池水所受到的重力方向会指向池底，直到池水被带出这个房间才会恢复正常。此外，地面的泳池有小概率比目测的要深得多——目前为止已知最深的泳池深84英尺（约25.6米），而那些深度无法测量的泳池显然比这更深。
//
//Level 130在很少情况下会出现一些内部带有古怪家具的房间，这些家具包括散落的椅子和梳妆台。这些家具通常都处于损坏或失灵状态，因此想要接触它们的流浪者都应做好事先观察。梳妆台内会出现的物品为装有污泥的小塑料瓶、或是各种磨损严重的书籍，其中包括一本后室终极食谱。仅有一次，有人在一个泳池的池底发现了一副床架。
//
//黑泥
//该层级中遍布黑泥。这种物质的粘稠程度与蜂蜜相近，会在烘干时变硬。直接接触黑泥会对皮肤造成轻微的刺激，但是根据记录，只要在接触后迅速将黑泥洗去，就不会留下长期影响。如果与黑泥接触时间过长，可能会出现程度不一的烧伤症状，在此后的进一步影响则至今未被观测到。只要水池中没有肉眼可见的污泥，就代表该水池内黑泥含量较少，不会引发刺激。
//
//黑泥会在断电期从管道中排出，也会被该层级内的实体消耗。
//
//构成黑泥的物质目前尚不明确，其中主要的成分是一种未知元素。一些实验证明其中含有钙、磷、硫等元素。这些都是人类骨组织内的常见元素，而该层级内发现的骨头碎片中则几乎不含有这些元素。
//
//断电期
//断电期以固定的规律出现，每次持续40分钟，间隔4小时。只有在断电期期间，钝人才会出现在Level 130。在断电期内，该层级的灯会熄灭，排水口关闭，大部分管道将停止排放污水。
//
//在少数情况下，管道在断电期内会流出污泥，造成小型的泛滥。在断电期结束后，水池底部的排水口会以更快的速度排水，直到液体总体积减少至与断电期之前相同；而这一功能的具体实现机制目前未知。
//
//实体
//钝人是该层级内最常见的实体，但它们只会在断电期出现，且一旦电力恢复就会开始撤离。在该层级见到钝人的概率实际上非常小，与它们消失的数量完全不成比例。
//
//在深度超过10英尺（约3米）的泳池中，有可能出现一种被称为“Granuros”的巨型鱼类实体。该实体没有牙齿，估计长约11英尺（约3.3米）。在同一泳池内看到超过一只Granuros的概率非常小，但如果泳池足够深，确实有这个可能。
//
//Granuros通常以管道中排出的污泥为食；然而，如果没有污泥可供食用，它们也有可能同类相食，或是捕食人类。在一次极其罕见的同类相食案例中，Granuros展现了其独特的消化系统：由两片巨大的软骨构成，互相挤压以碾碎食物。
//
//基地、前哨和社区
//M.E.G.黑水研究站
//为研究Level 130内的奇特现象而建立。
//拥有8名常驻人员。
//欢迎需要休息的流浪者，并会为他们提供补给。
//泳池人
//4名生活在Level 130中的人。
//开放交易。
//驻扎在一个通向Level 131的出口旁，并且乐意指引他人通过这里离开。
//偶尔会在夜晚一展歌喉。
//重要声明
//在广泛调查了该层级内异常的失踪状况后，M.E.G.的调查人员们已经确认这与尝试切出该层级的举动有关。
//
//目前我们认为，如果尝试在Level 130中切出，流浪者就会切入运输黑泥的管道，并在其中被绞碎。虽然从理论上来说，在管道内也有切出的可能性，但是M.E.G.依旧在此警告所有流浪者不惜一切代价，避免直接从本层级中切出。
//
//为深入研究这一现象，M.E.G.黑水研究站已经成立。
//
//入口与出口
//入口
//Level 129中黑色的门会通向这里。
//在Level 33的腐化区域中，地面上会出现一些洞口，通往该层级。
//出口
//在该层级内很少出现的双开门将会通往Level 131。
//该层级内的走廊里有小概率出现一副梯子，爬上它即可到达Level 233。
//在任何情况下，都不应该试图直接切出该层级。
package lvls1x;

import java.util.Random;

import br.game;
import br.ui;
import javafx.animation.KeyFrame;
import javafx.animation.Timeline;
import javafx.event.ActionEvent;
import javafx.event.EventHandler;
import javafx.scene.paint.Color;
import javafx.util.Duration;
import lvlc.randomdrop;
import model.wupin;
import sub.midiplayer;

public class lvl130{}